{
    "name": "El Coyote",
    "place_id": "ChIJc_hltCZewokRrVOkkU2lA2o",
    "grid": "QN6",
    "address": "70-09 Austin St 2nd floor, Forest Hills, NY 11375, USA",
    "rating": 4.1,
    "user_ratings_total": 1075,
    "phone_number": "(718) 268-0777",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQmVUUnJlRm96T1VKV2FXZG1OemRPWXpsdllVRRAB",
            "text": "Very long wait. And the restaurant was not full at all."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cd1RHbzNPWFJpYmpaMmQwVnNhazV3ZEdwR1YwRRAB",
            "text": "Checks all the boxes"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNU5VZGhVbHBNTnpoWFYzSk5aR05tWWxkcFYzYxAB",
            "text": "Hoy visité por casualidad y quedé muy satisfecho. Josué, quien nos atendió, fue muy amable y brindó un servicio excepcional. La comida que pedí estaba muy buena, con sabores auténticos y bien preparada. ¡Sin duda volveré! Recomendado."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWVJtTTFZa3B0VEZoaVQycGZhbVpJVkc1c2RXYxAB",
            "text": "Service was terrible, waiter were not attentive & never came back after ordering to refill water, check if we wanted anything else or even make sure the food was ok. We had to ask for the check with another staff since our waiter never came back around. Food was not good, lack flavor with too much lime and over cook seafood smh. Terrible experience! Would give it no star if I can."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNlNXTk1aUzE0ZDJVNWFXUlVORE5YUkVKTWVXYxAB",
            "text": "Had a great lunch with my son and a friend. We were the first ones there on a Saturday around noon, it was a hot day and we stayed inside. The atmosphere was inviting and comfortable, service was pleasant and the food was good. Overall a great place. I would go again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNVltNUlTSGRtV1ZnNVVYSmthRkZrUlZGWGMzYxAB",
            "text": "The food I ordered was cooked very well it didn't take long for it to be ready the service was excellent very positive"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUU4zbHJjbEJZZFV0UVUxUjVZa2hZUjNrNVJXYxAB",
            "text": "Guacamole was good\n\nBut everything else was not.  Worst tacos ever"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPUE5nT0c4OUxfeXdRRRAB",
            "text": "El Coyote in Forest Hills is a solid go-to spot, especially for their all-day happy hour from Monday to Thursday. The food on the happy hour menu is actually really good, not just basic bar bites, and the mango and coconut frozen margaritas are amazing. The vibe is always chill, and Josue gives great service every time. It’s an easy place to relax, grab some drinks, and enjoy good food without spending a ton. Hopefully you’ll get lucky and experience their random live Mariachi singers; they take requests for a tip!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPejZ3czdocnFDbnhRRRAB",
            "text": "From the moment I walked in to El Coyote they delivered an experience that exceeded every expectation. The welcoming energy, elegant decor, and the perfect background music instantly set the mood for a great time.\nThe staff here truly go above and beyond. From the warm greeting at the door to the attentive servers who seemed to anticipate every need, the service was flawless. Special shoutout to Josue for their exceptional hospitality, professional, friendly, and genuinely passionate about making our visit unforgettable. I highly recommend their coconut margarita with coconut shavings!!\n\nTheir happy hour keeps me coming back on crazy work days and even more now that they have amended their happy hour schedule. No margarita hits in Forest Hills like theirs do.\n\nTruly love their staff and everything about this establishment. If I could give them 100 stars, I truly would."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVk5uaHJWbUZwT1Y5elpGaHZkM1JtWjNFeVRWRRAB",
            "text": "Excellent food and fun atmosphere"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZak1iYXFBRRAB",
            "text": "Can't complain about anything! Great, great, great!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcjRLZEhBEAE",
            "text": "I’ve walked by many times but never ventured in until recently. Hidden away on the 2nd floor I didn’t know what to expect. Had a more formal dining vibe than I expected and since I was alone I sat at the bar to a surprisingly attractive Happy Hour menu! Plenty of drink and food options with prices set that you can enjoy a few rounds, which I was more than happy to do. Bartender was great, vibes were chill. I will definitely be stopping in more frequently."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3M0tpREl3EAE",
            "text": "I went for brunch with my friend and we had a great time, the food was amazing, great service and entertainment. The drinks were amazing."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM05qN2hnRRAB",
            "text": "Absolutely loved this restaurant. The food was amazing, the service was amazing as well. We went on a Sunday and there was a guy dressed in Charro and was singing, absolutely enjoyed it. Definitely coming back and this restaurant has become my favorite."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc01IMGVREAE",
            "text": "Lo más rico, que he comido!\n100% recomendado!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMDQyLUtBEAE",
            "text": "Too small and tight to enjoy the atmosphere"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNmVubkx3EAE",
            "text": "I was there on Valentine's Day and was given the menu. Asked what they would recommend and ordered lamb chops for me and came frozen cold . Whatever food was on the valentines menu was prepared and precooked. My plate was like it was coming from the fridge besides the potato purée(the only thing was hot ). It's not my first time there but I am so disappointed."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfazlLYnpnRRAB",
            "text": "I want here with a group of friends this afternoon  and we all really enjoyed eating here.  The atmosphere, food and service were all great.  Our waiter, Josue was a pleasure who provided top notch and friendly service  I would recommend  for anyone who enjoys Mexican cuisine"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaWFTWmdRRRAB",
            "text": "Best Mexican food ! And best margaritas ☺️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURfb2Q4bhAB",
            "text": "This spot was a great time. Came here to pregame with friends before a concert. The margaritas were strong and the tapas were tasty. What more could you need?"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfd1BiUlhBEAE",
            "text": "I celebrated my birthday at El Coyote Restaurant in Forest Hills this past weekend and we had a blast the service is outstanding the food was even better. I would recommend this restaurant for your birthday celebration or even just a date night. Wonderful restaurant.  I can’t rave enough about this place.This is by far our favorite restaurant.  The waiter who helped us was amazing I’m sorry I didn’t get his name but overall the staff was\nPhenomenal."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNU02N3l3RRAB",
            "text": "I've been countless times and they never disappoint. The food taste and smells amazing, the service is always friendly. Great for friends or a date night"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNUp5aDRRRRAB",
            "text": "very underwhelming and overpriced"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbEstd3RBRRAB",
            "text": "This is restaurant is amazing the food and drinks are worth it! The service is great they are an honest establishment I left my work bag here on a Saturday didn't realize it was missing for 2 a days and when I returned for it the manager had it safely put away in the office so grateful for them! They have my families business for life!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaUxLalVREAE",
            "text": "Decent Mexican spot"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeXNpSnhBRRAB",
            "text": "Go on Happy hour and sit at the Bar...good food ,friendly staff and good prices."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdjg2Y0NnEAE",
            "text": "Uno de mis lugares preferidos 🎵\nMe encanta el ambiente,el servicio, la amabilidad y sobre todo la de Jorgito😉"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMza2NiN3dRRRAB",
            "text": "On November 6th I went to dinner. I'm from Florida Gate. $98 dollars. I understand. The tip. I gave $10 as a tip. The waiter was not there and I gave it to someone else and he forced me to put 18%. I am"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcU1HZ0xREAE",
            "text": "The food was fresh,and so delicious, our server was professional and nice,we had a great time there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYb2ZTSHF3RRAB",
            "text": "Hidden Gem on Austin Street- had no idea about this joint. The mango frozen margaritas were delicious -but cold bc we were outside but great taste. The food was ok, I liked the empanadas and the spicy wings- we didn't order a lot. Service was fantastic, on point, attentive and courteous -love the decor!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdjYzWTJRRRAB",
            "text": "Buen lugar para comer"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYN0tQQzVBRRAB",
            "text": "Excelente gama de mezcales, Frank, el bartender te hace sentir como en casa y a pesar de estar lleno el lugar sientes una atención personalizada. Solo tengo que decir, gracias totales."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYck5LZEhnEAE",
            "text": "Franky is the best bartender in town! Very friendly with very nice special service at all times! I’ll recommend you the margaritas."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOVBQdFVBEAE",
            "text": "Guy said go home and dismissed me as if I'm a Child lol"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNWU3cWVBEAE",
            "text": "Stayed at the bar, good happy hour, the drinks are good the food is good, overall worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURub2EtT0VBEAE",
            "text": "Me and my bestie stopped by for a quick frozen margarita during their happy hour. The place was clean and nice. Staff welcoming. The margaritas were great !!! Will definitely come back and order a meal! Nice restaurant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURud2EtdVhREAE",
            "text": "Great place for families, great food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcnFEeHdBRRAB",
            "text": "Frank the bar tender was amazing! Very attentive and courteous made my visit to el coyote amazing and will definitely be coming back"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIenN1SERREAE",
            "text": "Best placer ever … excelente servicio ..Frank my mesero… the best !! 10 star!! 👍🏻👍🏻👍🏻👍🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIanN5LTRnRRAB",
            "text": "Please is nice looking. Service is insanely slow. Forget to give water and our lemonade came after 20 min and was all watered down. Would of been better off sticking with water. Over 30 minutes and queso still didn’t come out. It does not take that long to melt cheese that we are paying upwards of $17 for. Once the queso came, forgot our meat in it. Looks like not fresh cheese, too stuck together. Told me it was under, he came and checked, didnt have anything. Point black even before i get started with the food, avoid. Many other better places to go eat Mexican. For price, service, and quality, this is not it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cHBuUlRnEAE",
            "text": "Let me start by saying the service is always immaculate . The food appetizer mini nachos was a bit salty but the entrees were good I had the steak with onions it had a good kick to it and was made to perfection. Drinks were also good\n\nThe biggest problem was the dessert the lava cake with vanilla ice cream scoop tasted as if it was really old . The ice cream definitely had freezer burn it tasted very choppy and the cake was dry even with the chocolate all over it. I’m guessing not many people order dessert but still they could do wayyyy better for desserts .\n\nWould go again wouldn’t order dessert"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d09iWW9BRRAB",
            "text": "This is a solid place for drinks and food. I would recommend the grilled foods. The mole is not that great but on average everything I’ve had is great. Good service and well balanced crowd."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3amNQTU5nEAE",
            "text": "10/10 Excelente comida, ambiente y atención! Recomendado para venir con amigos o familia 😃"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaWN2R0FnEAE",
            "text": "Good location and has a nice outdoor seating area. Food was ok. Tacos were good and shrimp was a little undercooked but the flavor was there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieUp6QVRBEAE",
            "text": "Dope 👌 restaurant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyXy1mTmdBRRAB",
            "text": "Very nice place. Excellent attention. Delicious food and spectacular cocktails."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxN3FybG5RRRAB",
            "text": "음식 서비스 등 모든면에서 최고였어요.\n인종차별도 없었고 혼자 갔음에도 테이블로 잘 안내받았습니다.\n그리고 테이블이 흔들리니 웨이터분께서 바로 높이 맞춰주셨어요.\n음식도 정말 맛있었고 이 음식점 덕분에 연말이 완벽해진 것 같아요.\n저를 서빙해주시던 웨이터분께는 10달러 추가로 따로 드렸습니다"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbzRMTXJnRRAB",
            "text": "The restaurant is located upstairs.  We didn't have to wait long to be seated.  Once seated the waiter approach us to take our order.    Our drinks and appetizers came out pretty quickly.  Our main course was not long after that.  Everything was absolutely delicious!  Parking in the area can be hectic depends on the time you go can be pretty hard to find a park."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdmZtRTF3RRAB",
            "text": "A most excellent Mexican restaurant on Austin Street. Upstairs, with an elevator available. Very noisy inside, so we sat outside in a pleasant breeze with a nice view of the busy street below. Service was perfect. Margaritas were excellent, and the food was fresh. I appreciated the manager patrolling, picking up food dropped from tables, shining windows, making sure everyone was happy. He did a great job, because everyone WAS happy. We had a great time. And no one rushed us. Fully accessible ♿️."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dnI2eUFnEAE",
            "text": "The restaurant was very close to the train station and the stadium very short walk. The restaurant it self is up stairs with a balcony the decor is fun and festive. The wait for our food was kind of long but as we were starting to get antsy the food came out. They ended up realizing they didn't have an appetizer my friends ordered really late into us waiting for it which was alittle upsetting but our waiter ended up bringing out double shots of tequila for the whole table so we were happy. When the food finally came out it was delicious 😋 we left there full and happy! Would go back again if we are in the area."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbnN2bm9BRRAB",
            "text": "It was my first time visiting this restaurant and I have to be I’m very impressed. The food and drinks were amazing. I would definitely like to go back here again. I recommend anyone in the area to give this place a try. The whole happy hour drinks part ridiculous if you have kids."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbk4tSTBBRRAB",
            "text": "Came here for happy hour. The frozen margaritas were good. We had the beef empanadas and chips with salsa to start. It was good. Empanadas were nice and hot and the salsa had a nice kick to it. I had the Churrasco and it was cooked perfectly. Nice and tender. Overall I enjoyed my meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNGVyVnFnRRAB",
            "text": "My husband and I have been coming to El Coyote for years and they never disappoint! The food, drinks, service and ambience are always 10/10. Most recently, we were taken care of by Victor and he was amazing! Definitely try their churrasco and skirt steak tacos 🤩"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDa3BhWDhnRRAB",
            "text": "Love it here, been to many Mexican food places and restaurants and this one is definitely in my top 5. The food just tastes so flavorful, I got the skirt steak dish with chimmichuri sauce and it was sooo good. Such a generous portion as…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbF9laHp3RRAB",
            "text": "Love this place for afterwork happy hour. The staff are super friendly. Margaritas and Sangaritas are good. Frank, Javier and Josué are very attentive and accommodating."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeDRUU1NREAE",
            "text": "Locating the stairway to El Cayote was the only challenge we experienced but it did not take away from our night.  From entry into restaurant and throughout our stay, the staff at El Cayote were very welcoming and accommodating. The atmosphere was bright, colorful and very cozy. There was outdoor seating but we chose to eat inside due to the hot temperature outside.  For our main meals we ordered the Paella El Coyote with lobster tail and the Flautas Chorizo. Both dishes were excellent!  We had enough left over for a future meal. For drinks we ordered the Tropicana and it was very tasty.  The cost was very reasonable.  The restaurant, including bathroom, was modern and very clean.  Overall, we had a great experience and we will be returning soon.\nStaff/Service=5\nFood=5\nDrinks=5\nAtmosphere=5\nCost=5 (a rating of 1 would be expensive)\nOverall= 5 Stars"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJcllDNlNBEAE",
            "text": "Situated on the 2nd floor of the building, we didn't really expect what the location was. When we entered, it was very lively, with the mariachi band, preparing to play around the restaurant.\n\nOn a Friday night, it wasn't crowded. We got to sit on a table with tall chairs. They serve nacho chips with their own salsa. We first ordered mojitos, their passion fruit flavored one was really good.\n\nWe started with a steak quesadilla. My wife ordered the paella and I had their special for that day, the sirloin con camarones, basically a surf and turf. They all came within a reasonable amount of time, and we enjoyed our food very much.\n\nThe server was really nice especially with the mojito, she suggested the passion fruit, which really was the best I've had there. The mango was okay.\n\nAfter our meal, we were given warm house wine with cinnamon which was, to our surprise really good!\n\nI would definitely go back and try some of their other food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1N3NqeVVBEAE",
            "text": "Their happy hour starts at 12pm (Monday to Friday) and lasts until 7pm! Most places start at 3/4. Their happy hour plates are a bit smaller than their lunch plates but everything was super delicious.\n\nSome highlights:\n\nI highly recommend the sangarita. It was $6 during happy hour. The passion fruit margarita is pretty good as well. The mango one was just ok to me.\n\nJalapeno poppers were actually jalapenos! They were delicious."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3aE51UW93RRAB",
            "text": "Very flavorful. Decent priced. Option For outside seating to avoid Mariachi band. No wait time on a Friday night in forest hills is great. But they still had a good crowd. This was our second time."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3LVB5Zl9nRRAB",
            "text": "Came here with a friend for happy hour. Food was delicious and drinks were strong. The crowd was mixed with different ages and types. It was chill and had a great mix of latin music. The bartender was friendly, attentive and kind. We will be back soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCeDdqTUNBEAE",
            "text": "I didn't care for the food or service.  The food lacked flavor,  & was very greasy. The waitress may need some more training, or maybe,  just some help, waiting on the tables (the restaurantwasn't crowded though).  The one good thing I can say, is the margaritas weren't bad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbDRfTFhREAE",
            "text": "Amazing experience! Food is phenomenal! Big props to chef. Can I also say they are super attentive and very friendly! Would eat here all the time♥️ if you love seafood and avocado get the aguacate relleno que delicia ☺️"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcDZTSzdnRRAB",
            "text": "Enjoyed sitting outside at this establishment, not a lot of places like that in Queens. The decor went right along with the theme. The pork dish that I tried was extremely tender like it literally fell off the bone. Only problem I really…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDNnVHTHVnRRAB",
            "text": "One of the best margaritas I have ever tried :) They do have many delicious margarita flavors and that’s awesome.I also like their fajitas, food arrived little late but I totally understand it,  especially during this Pandemic. I will recommend this place to my friends for sure!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBM0pLbVd3EAE",
            "text": "I always enjoy going to this place. The food is delicious and the service has always been wonderful. I’ve been there four time in the last year and I always recommend it when they ask me for a Mexican place.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWNXFXSEpnEAE",
            "text": "Our experience at El Coyote was nothing short of amazing. The food was an explosion of authentic Mexican flavors that left our taste buds dancing with delight. The drinks were crafted with expertise, perfectly complementing each dish. However, what truly elevated our visit was the impeccable service provided by the staff, especially the bartender, Josue!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZcUl5SnNBRRAB",
            "text": "The owner Carlos is very genuine and kind. This family owned restaurant jas legit Mexican food.\n\nThe torta de milanesa is a must. It can get messy but it's packed with flavor.\n\nBe on the look out for their margaritas in the watermelon or cantaloupe!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZOG9qVGhnRRAB",
            "text": "This is our go-to place for a Hispanic food. We have been coming here many time but occasionally. Every time we received the same grate service and great food. The ambient might need a bit of a touch up in lighting, but we always can count…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcjVlUjBnRRAB",
            "text": "Un lugar lindo,  tranquilo,  con ambiente familiar,  es un restaurante mexicano pero con gustos para todos.  Yo pedí un churrasco y lo sirven con arroz y frijoles, el costo aprox. 35 usd"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtX29HVWd3RRAB",
            "text": "Been a client of this amazing establishment since the first week of opening and I’d love the food, drinks  I had even celebrated my Bday few times here       in the last 4-5 years   We been going a lot  since ELIAS  (Bartender/waiter) start…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzX2JYRzdnRRAB",
            "text": "Best happy hour in Queens , great good, great drinks (passion fruit margarita my favorite pic) service is always outstanding, bartenders provides an excellent service at the bar ,they offer happy hour menu as well (60c wings can't go wrong)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1cXBiS0VREAE",
            "text": "Happy Hour Specials were great, very affordable.\nExcellent bartender\nDelicious food"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3akxpU05nEAE",
            "text": "I've NEVER had a bad night at El Cayote! Awsome location (Forest Hills), the staff is always friendly. Maribel is an amazing waitress!!! Food is amazing!!! Everytime I go I try something different it's just that good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cWFuOXhnRRAB",
            "text": "I really enjoyed my time here, food and drinks are on point and service was fast and attentive. The food was also reasonably priced . I would recommend this place for a nice couple night out."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJMnR6b2xRRRAB",
            "text": "Went there on a Saturday for happy hour! The food and service are excellent. I had the buffalo wings, nachos de queso, and chicken chimichanga. If you love coconut, you must try the coconut margarita, it’s excellent! The sangria is on point as well!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybk1IaGl3RRAB",
            "text": "Good food, not the best I’ve ever had but good. Price is also good not expensive at all."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbklLdXJBRRAB",
            "text": "Pretty good food, pretty decent staff, pretty good prices. The bean soup is incredible. They also have a nice middle area for larger groups."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNjdYc0xREAE",
            "text": "I was there for the first time and it was an amazing experience from the food to the service the bartender with colored glasses made us the best margaritas around the area Definitely back soon"
        }
    ],
    "reviews_count": 78
}