{
    "name": "5 Burro Cafe",
    "place_id": "ChIJVykOpCBewokRVqNJ7N9mo4M",
    "grid": "QN6",
    "address": "72-05 Austin St, Forest Hills, NY 11375, USA",
    "rating": 4.4,
    "user_ratings_total": 2504,
    "phone_number": "(718) 544-2984",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201Vk5EbFJXWEJKUnpKUGVIbHdOM3BGTURWQloyYxAB",
            "text": "5 Burro Cafe is d/b/a 5 Star Cafe imho. 5 stars for food, service and atmosphere. Excellent food that you crave, kind and attentive service and super fun festive atmosphere. Love this place!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdFNWVkZXamh1Y21GaWRFYzNYMUJ5YWtSclkzYxAB",
            "text": "I love it here each time I come either alone or with friends the food never disappoints, the staff is great and I love the music. Keep in mind if you come during the weekend be prepared to wait and it can get very busy."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RFdGUlNkSGx6YUZKV01DMDRTWFUxYW5ScVNFRRAB",
            "text": "Neighborhood Cheers with great comfort food."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTVNFNTFTbVJzYzFGTVJFbFVXR3RtZUZSblZYYxAB",
            "text": "Great food Great prices"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNdGFGUjNTamhJV0hkd2RFSnNZM0ZVV0RkRU1VRRAB",
            "text": "Went for lunch after not having been in the place for a couple of years. Asked for some enchiladas with flour tortillas instead of corn which I've had in other places because it was the only item that had mole on the menu (which I love and compare through many Mexican restaurants) and the waiter told me, order the burrito and ordered mole on the side because they couldn't honor my request. I did, but was terribly disappointed when I got a burrito than  couldn't be called one because a burrito is supposed to be a tortilla rolled up with stuff inside and mine wasn't even that. The tortilla was too small for the amount of filling. It was a very small tortilla whicj was half wrapped. On top of it all, the mole was horrible. It was really a disappointment. I told the waiter, I never complain about anything, anywhere, but this is not a burrito. As a Latina, I felt insulted cause I spoke to him in Spanish and told him, really? you called this a burrito? He just looked at me.  To top it all off, I get charged 4 dollars for the horrible mole just because they couldn't accommodate my simple request for a different type of tortilla? I love Forest Hills, but, certain restaurants are losing their authenticity in terms of cuisine. Needless to say, I won't be walking into this restaurant in the foreseeable future. There are much better restaurants to eat in the area."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swdFdXRTFUME5DV21KaGMwVTBlVlF3ZFZSVlRFRRAB",
            "text": "My number one go to spot for micheladas and authentic Mexican food! I always get the vegetarian fajitas! The flour tortillas are so fresh and delicious. Comes with fresh veggies like grilled onions, peppers, broccoli zucchini, tomato’s and mushroom all fire seared. And the mussels omg the sauce is amazing! I don’t even eat mussels but I ordered the for my man and it came with soft fresh bread that I dipped into the sauce and fell in love! I need the recipe lol"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSlUwbGtkVGhVYlVJMVQzZElWbEZmTmxSUVJrRRAB",
            "text": "I’ve been coming to this restaurant for over 10 years — it’s where I had my very first margarita and where my family made countless memories. As a first-generation American with Guatemalan and Honduran roots, this place has always been special to me. It felt like home and was the closest I could find to authentic food in the five boroughs.\n\nUnfortunately, my last visit completely changed that. The hostess disrespected me and my partner in front of my son — putting her hand in our faces and then pretending she’d been pushed when I stepped back. To make things worse, we were treated differently from other guests in a way that felt unfair and, frankly, biased.\n\nFrom the bottom of my heart, this is truly sad. I came here for the food, the ambience, and the comfort of familiarity. But that experience took away a place that once felt like home. After more than a decade of loyalty, I can’t see myself coming back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWE9HNUhMV3QyVWxJeWEwWnlXWGhEYURoVGNFRRAB",
            "text": "$14 for a chips n salsa is crazy and a $10 “sharing charge” is absolutely nuts. The prices along with the long wait time and extremely loud environment would be worth it if the food was exceptionally good, but it’s not. I think the positive reviewers are just not aware of how very good Mexican food should taste since there’s not much here compared to the nearby neighborhood of Corona."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTmJIZEtaRlpqWmsxYWJIcGZhMFoyUlVOeGQwRRAB",
            "text": "Warm greeting and sincere smile from all the service staff 🥰🥰"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUFREUjRSVmd4ZWpOWk5HaElXRU4zWkdwWGJrRRAB",
            "text": "Food was excellent, easily 5/5. Ordered the burritos, which come with Mexican rice, refried beans, pico de gallo, guacamole. Price was around $24. The margarita was respectable.\n\nThe restaurant space/environment was 3.5/5. It’s a restaurant with small space that gets crowded fast, I wish there was more real estate to work with. It’s easy to get bumped in your seat as people are walking by. On the plus side, there is nice decor inside."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMlRYRnZTRVJmWVVSQ1NsSTBORlUzTW1KS1NHYxAB",
            "text": "Love it love love !!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSmMyTnRRekZqZFdSb1UxUXRObVJQV20xaGJrRRAB",
            "text": "Third time I tried to dine here. Wait is always too long. Won't be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSVJHWjNPRGxWVDBGM2FVUlJjVGhwWDAwMUxYYxAB",
            "text": "Luis is my favorite server. 🥰…"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdF9LT3hBRRAB",
            "text": "There’s a reason there’s a line out the door for this place most nights. First and foremost their margaritas are the best in Queens, if not all of New York, with multiple flavors that fit any taste bud. That is only a small part though, the food is absolutely something people come back again and again for. Their head chef has been here for many years, at least 8 that I know of and the food shows his commitment to quality and his pride in this place. The staff are always friendly and make you feel comfortable and valued as a customer. I had the pleasure of meeting the owners when they had a booth at the Forest Hills street fair and it’s easy to see why their staff rarely changes and everyone is so happy to be here. This is a Forest Hills staple that I’m sure will be here for so many more years to come.\n\n*Update-\nStill a resounding 5 stars. This place is so used to being packed that even another Forest Hills street fair couldn’t shake them. We sat down as a party of three and waited for nothing. The service was top notch and the food was amazing as always."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMlozbG9aa0l3YjJONldqVjZPSFZtT0d4elZGRRAB",
            "text": "The wait can be long but is soooo worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MllXRXpNVFpGVDNOaU0zTkdZMlZSVEZKRU1FRRAB",
            "text": "Brunch Steak was Amazing 😍 Tender & juicy! Yum😋"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbVBTUzdRRRAB",
            "text": "Always Great food and friendly service staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseGRXbGZjRVJzT0ZoZlJHMURTWFpCTlZaS2FVRRAB",
            "text": "Very nice people and delicious food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMmJYTlZWWEF0WDNCelptZGpXVlF4Tm5sSFMzYxAB",
            "text": "Great place.  It's small and wait may be long but it's worth it.  Price is very fair. Hadn't been here in years and just as good as I remember"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbVkzNldBEAE",
            "text": "LOVE IT THERE.. ALWAYS A GOOD TIME.. DRINKS AND FOOD R AWESOME.. STRAWBERRY MARGARITAS  R YUMMMN"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUVMyUlFORTVSYW1KcVIyUkNZV1JmUzJGV1MzYxAB",
            "text": "Been coming here for years and the vibes just get better and better. Our waiter was so attentive and nice ! Sofia the host was an absolute angel and even made us bracelets :’)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWFZFUjVTbGR1VGpsblNrcFFORGhUVFV0bGJVRRAB",
            "text": "Such a cute spot! The hostess, Sophia, is the absolute highlight <33 She’s such a sweetie and totally adds to the overall vibe of the place. Also, try the frozen strawberry marg - sooo bomb!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVeWRHNTRhWGREUTBsUFNqUXhRbGhGZUhsSE5YYxAB",
            "text": "I hadn't been in here in a while. I had tacos del Norte, they were good. Lots of fixings on the plate for the tacos were crispy corn tortillas and delightful to eat. Oh, they were carne. That is their mistake versus beans or something else. The sides on the plate included were beans that is refried, lots of rice, guacamole, salsa, sour cream and other stuff ...\nAll very good.\nYou to wash this down with something so add a couple of Modelo. Negri beers, very fitting and very good with this meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMFIwZHFhWGx0YWpOc1QwaElkWFJzY0ZaWmVtYxAB",
            "text": "Small place but excellent frozen margaritas and the food is great and filling. Prices are very good as well!  Skirt steak was awesome, as was the enchiladas 😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTlJEVjJRMFpaYVZoU1NuVTRaMk40ZGxseVJXYxAB",
            "text": "I’ve been here for a couple of years and although the waiters aren’t always the warmest. Today I had the worst experience with the shortest dude with glasses. Who made us feel bad for not ordering food. When in fact we did order food. Shorty did nothing than take our order had the audacity to charge us 20% tip. Don’t waste your time at this place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSU0xXUnlSV1F6YW5oR2VVWmtOelUxYWtKaWVIYxAB",
            "text": "Not sure why the girl said “let’s me check my list” when their Google page clearly says they DONT ACCEPT RESERVATION 🤣but ok go off queen, maybe they take them for special people?idk. Free chips and salsa which appears to be MONUMNETAL in…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveVEwTkhVa3RpUlZKUE4yOWFaV2h1Y0ZKd1VGRRAB",
            "text": "It's a small place but it's a Queens Gem. Everything is delicious but the steak is top tier! The steak is soft like butter, juicy, and flavorful.  Whether its steak tacos, steak salad, or a platter, you will enjoy every bite.\nMy godsister ate carnitas tacos and it was scrumptious.  5 burro is the spot, iykyk."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaVpuTmxRbEIxVkZSa1pWVmxaVVpZUkcxbE4yYxAB",
            "text": "I liked it the food was good, give it a try"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cFFVWTNUMHB6VG1WVGVubFlRMDk1UW5ReWNWRRAB",
            "text": "Very good food fresh and I like it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podFJWRXlNM1pUYWtjNVh6VnRXVXByZEVGaExWRRAB",
            "text": "Good place, Good service, food was good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JNVEwMVFVR2RPUTFKQ2EwTjFSV1F0TW5Oa1NGRRAB",
            "text": "Viva 5 Burro! Great 30 years ago when I used to frequent the joint, still great today after all those years."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQ2IzQkpkalpQTldFNFdVZDJSMDVEVkY5WmVuYxAB",
            "text": "So many years 5 Barrios open..  Still the best place for drinks"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINzRyOWp3RRAB",
            "text": "THE BEST MEXICAN RESTAURANT IN NEW YORK! This is my wife and I favorite place to come eat. The food here tastes better than the food I had in Mexico. Service is great, drinks are great. The best! Frozen Margaritas in town. I really wish they were able to purchase the store next door to expand the location because their is always a wait to get a table. Reasonably priced."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcFZUZDRjbVIxZGxSM1JHNVNWVWw1UjFsSVJtYxAB",
            "text": "Amazing food and drinks!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psemFEUlRiR2xCYUdobVN6QTVZMmh6ZGpkM05tYxAB",
            "text": "Food was delicious and service was good only thing is you might have to wait for a table is always busy but it was worth it to wait"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaFdtNWZhVk5sVEZSb1RVcFlaa051YW1GMU5VRRAB",
            "text": "The chipotle chuleta and chipotle chicken are both fantastic.   I opt for the (chunky and well seasoned) fries instead of the rice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMlFXSTBTRzVuZW1SNFRtcFhYMUJyUVZaRE1uYxAB",
            "text": "All about this place is great- food, vibes and drinks. Love that’s there are margarita pitchers and the prices are good. Only thing that sometimes sucks is the wait for a table when it’s busy can be up to two hours."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbU1GcFlMVkZ2UTJSdFFUZDBiRmRyVkZKNFVuYxAB",
            "text": "Horrible experience. Had 3 different servers and the one who took my food order was so nasty when I asked about waiting a long time for my food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CYWVrMWZYMWhSZDNOWGFGSlJPRTVpVmprNFltYxAB",
            "text": "My sister and I have been to this place last year and had a wonderful time there because there were lots of people there. Both of us ordered fajita, and many others. The food was wonderful, and the service was wonderful. The atmosphere was that there were many people, many others."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeVVURkxaUzAzWVVoeVZuQnBVMUJPVkRZMFJsRRAB",
            "text": "I actually can't even describe how delicious this place is. You just have to try it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSVltTnFUMjF0VUVKc1gyOXRaakZDVGxobk9IYxAB",
            "text": "Get there early tho it be packed"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNmNrRm5iM2QwYVVWak5Fc3pTVGswU1dGeFgxRRAB",
            "text": "The frozen margaritas are awesome here especially the watermelon. Food is delicious whether it's the tacos or fajitas. I love coming here"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV05UUTRiazUzTFY5cWFVZG1aeTFmVGxCNGRIYxAB",
            "text": "Best food and drinks"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WVZERjJiWEZUTTNkNVVYZHRSRkJKVDFZelJtYxAB",
            "text": "Came here to check out one of my friend’s favorite spots. The food was honestly delicious and the portions were really satisfying. The place has a laid-back vibe and the service was quick. I really enjoyed it 😊"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScWIweGxPRU5ITldkNlRUVjBjR3RJVldWQ1NrRRAB",
            "text": "Very delicious! Good service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNFEyaGlNbDlIY0VNMVZYWk9WVVpXWjNwSGRWRRAB",
            "text": "Great Service Great Drinks... Good was pretty good as well. Will return"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNVFtcG1VVmwxVFZreVFrTXlSR3gzWm5keGNuYxAB",
            "text": "Popped in for a late lunch with a friend on a 100 degree day. It was so nice and cool in there, it was incredibly refreshing. I had the pulled pork tacos and they were amazing. The grilled veggies were cooked perfectly. I asked several times for no salt on my rim and it came w salt. What can you do. This place was cute, thanks for having us!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRFVHVnFTRFkyVWxKUGQyOWxlVUZZY0VrM1ExRRAB",
            "text": "Buen  ambiente  muy amable  los meseros"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NVEwbzBNR0ZZZEhjM2JHOUVjekI2VDNOQlQwRRAB",
            "text": "The best tacos ever with the most friendly staff. I stop here every time I visit New York.  My favorite is steak taco."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGT01EVjJaeTF3UTFwUWVrZGtRMEpOTm1Wd1FrRRAB",
            "text": "This place has really gone downhill. My fiancé and I came in and asked the host if it was okay to grab a drink outside. She checked with a server, who said it was fine as long as we ordered an appetizer with our drinks — which we were happy to do.\nWe ordered the passion fruit frozen margaritas, but whatever we were served did not taste like passion fruit at all. I brought the drinks inside to mention the issue to the server, but he insisted that’s how they were supposed to taste. He didn’t offer to replace them or suggest an alternative. Instead, he brought out a bottle of cheap passion fruit liqueur to “prove” the flavor, which didn’t help at all.\nWe also ordered guacamole and chips. The guacamole came out — but no chips. Yes, we were given complimentary chips when we arrived, but we specifically ordered guac with chips because we wanted more chips to enjoy it properly. When I went inside to mention it, a support staff member started yelling at me, asking if I wanted a small or large order of chips. I was confused, since I thought chips were included with the guac.\nWhen I brought it up with our server, he said the complimentary chips were the chips for the guac. I had to explain that the complimentary chips are usually just a welcome snack — not part of a paid appetizer. Still, nothing was done to fix the situation.\nI asked for the check and decided to leave. As I’m trying to rush and finish my app and drink, I overheard our server gossiping with a coworker about my complaint — completely unprofessional behavior.\nI’ve given this place a few chances, but it's clear they don’t care about hospitality or basic customer service. I understand it was the end of the night, but if staff don’t want to serve guests properly, the restaurant shouldn’t keep seating people.\nVery disappointing experience. You should learn a thing or 2 about your next door neighbor Reef even when they’re in the weeds they still CARE about providing the best memorable experience to their guests. Time to clean the house up and replace with new people who actually care about customer servicing and this is coming from someone who works in the industry."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOQ1pEZHBRbXBRUm5sUWNFdG5OMkZuUzNwU2MyYxAB",
            "text": "I give this place 5.0 .The food in this place was really great. I totally forgot or underestimated the flavor within the Food. The chips 3.9 were good plus the sauce 4.3(unique). The appetizer: Avocado Relleno - which has shrimp in this wonderful cilantro sauce 4.8. Then there was The Fajitas Combo with steak 5, shrimp 5, and chicken 4.9, which was marvelously flavorful.  Rice 3.8, beans, 3.9 And who could forget my son’s Quesadilla Chipotle Chicken 4.8"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOUlQVDB3RRAB",
            "text": "Good place to have a big meal and enjoy with your friends and family. Food tasted delicious. The portion of the food was big enough for a person. Had leftovers to take home for later snack. The atmosphere is perfect for casual dining. The restaurant was quite cold. It was a cold rainly day. The service was alright, although we had to wait for the waiter for a long time to get our check. The gratuity 20% was already included for Friday early dinner time at 5 for 4 people. Note: Lunch and dinner price is different, the portion of the food is different for lunch and dinner."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbjZUMUd3EAE",
            "text": "The wait was short, around 7:30 pm. Small, nicely decorated place. Food was served quick and delicious steak nachos with good presentation and portion sizes. The hostess and servers were kind and attentive. Highly recommended."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MExxTXNRRRAB",
            "text": "Great food, service and portions.\nBest carne fajitas I’ve had in a long time. Suiza were so good and tasty and so was the guacamole.\nLuis was super sweet."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdXJXVUNREAE",
            "text": "An OG spot , I’ve loved 5 burro ever since I was introduced to it years ago ! Their salsa and chips are unreal and so addicting. My go to plate are the steak tacos, they never miss with a delicious side of lemonade. the atmosphere & presentation of the cafe is great and I love that they are always playing great music. although the prices have gone UP 🥲 I can always count on 5 burro to be a great Mexican option."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbzdUU09REAE",
            "text": "I followed the hype to try this spot. I can say I was pretty disappointed in the food. I don’t like that the burritos only have meat and guacamole and everything else is on the side. Then when I try to add stuff to the tortilla, it becomes too big and falls apart. Idk. Maybe next time I’ll try a different dish. But the atmosphere of the place was great. I really loved the vibe. Service was pretty good too. I’ll try it again one day."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeE0ybk13EAE",
            "text": "We visited after too long of an absence and thanked our lucky stars as we got seated right away at this popular and bustling cafe! Even the hostess told us this was our lucky night as there is always a wait to get in. Yippee!\nWhile the place is on the small side and gets a bit cramped, it is such a a unique and welcoming place that allows you to feel instantly comfortable and relaxed.\nWhile 5 Burro's is well known for their frozen margaritas (they are fantastic) we opted for some Corona's (no draft beers, only bottles) and tequila shots.\nComplementary chips and salsa were bright to the table.\nWe ordered the Mexican salad con carne with skirt steak-- a favorite go to that I have never gotten better anywhere. Their in house made dressing makes it so good. All was fresh and delicious.\nWe loved picking some tunes to play on the jukebox.\nService was super friendly and attentive. The restrooms were clean and well maintained.\nOn street parking only.\nCan't wait to come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdTZxNnBBRRAB",
            "text": "Great Mexican food and even better drinks! The Margaritas here are STRONG. Some of the best I’ve had! I was impressed with their chicken fajitas and quesadillas. The chicken nachos were ok, but a little burnt. I wouldn’t get them again. But everything else was excellent. Would definitely recommend this place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMkxQb0pBEAE",
            "text": "Probably the best steak tacos I’ve had! It’s a nice little Mexican spot in Forest Hills and it’s always packed especially on the weekends. Loved the frozen margaritas as well (I do prefer the strawberry one). The steak tacos were cooked medium and it was just amazing, I had to come back the following week just to have it again. The service takes a bit of time but the food is worth it. They also give out free homemade salsa and chips which were really good too! Staff were nice and checks in on you as well. Highly highly recommend! Get the steak tacos. Take my word for it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJM2E5TGpScXA3NFRREAE",
            "text": "I visited 5 Burro Cafe on a Sunday night at 7 p.m., and the restaurant was fully packed. The host, Sofia, greeted me warmly and informed me that there was no wait if I chose to sit at the bar, or about a 15-minute wait for a table. Since I prefer not to sit at the bar, I initially said I might come back another time.\n\nHowever, Sofia went above and beyond to help. She offered to put my name down just in case, and I appreciated her effort to solve the problem. I noticed there were three empty outdoor tables, so I asked if outdoor seating was available. She confirmed that there was no wait for outdoor dining, so I happily chose to sit outside — my preferred option.\n\nSofia promptly brought me the menu, and I ordered the shrimp tacos for dinner. Shortly after sitting down, I was served chips and a delicious dipping sauce. When I finished the first round of chips and my meal wasn't ready yet, Kayla noticed and immediately offered to bring more chips — a thoughtful touch that impressed me.\n\nKayla also confirmed that I could pay using Apple Pay and that they could bring the machine to the table. On her return, she even brought extra napkins without being asked — another small detail that shows her attentiveness.\n\nOverall, I was very impressed with the hospitality of both Sofia and Kayla. The shrimp tacos were delicious, and the dipping sauce was excellent. I highly recommend 5 Burro Cafe to anyone who enjoys Mexican food. They also offer vegetarian taco options, which makes this a great spot for vegetarians who want to dine in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5b2RpbWpnRRAB",
            "text": "Came here as an out of towner; the first thing that hit me was how friendly the place is. The staff and locals made me feel very welcome and I loved the atmosphere.\nHowever, I actually came for the food, which didn't disappoint. OK, you're paying New York prices, but I've paid more in some places for a disappointing experience. The food here is delicious, well prepared and tastes authentic.\nWell done guys, keep it up."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MmVhTGRBEAE",
            "text": "The food and drinks here was amazing. The staff was so friendly and attentive. I opted in to sit at the bar and Carol was so sweet. She helped me figure out what I wanted because I am very indecisive. I ended up getting the fajitas which were so yummy. I had two coconut margaritas and trust me I didn’t need one more lol!\n\nI will definitely be returning here. If you’re thinking about checking this restaurant out, please do not hesitate!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNGZ5cWVREAE",
            "text": "Hostess was great! There was a line out the door; so we figured it must be good. Seated very quickly. Margaritas were fantastic & just what we were looking for. Complimentary chips & salsa served - the salsa was great but unfortunately the chips were stale (probably because they’re fresh made & not store bought full of preservatives- but still no fun eating hard chips!) The entrees were delicious & ample servings to say the least!! Wish they had more combo selections - I like enchiladas AND tacos, but had to choose 😩 only one. I guess I just have to go back again for the enchiladas!! Fun place. Recommend!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocWNXc01nEAE",
            "text": "I was first introduced to this restaurant about 10 years ago. Every time my daughter and I finished watching a movie, we used to come to eat at this place. I moved out of the country for a few years and decided to come back to this place to celebrate my brother's birthday and try the delicious steak and frozen margaritas, but unfortunately, the lack of empathy, knowledge of customer service we received from the host and waiter was deplorable, did not enjoy at all the food. I hope they will take the corrections needed and wish you well 👍, but after being a loyal customer, I am forced to take my business to other restaurants."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwX0ptZzdnRRAB",
            "text": "This is my go to for frozen margaritas and an excellent skirt steak salad 🥗 mmmmh\n\nIt’s a little on the small side so if you’re not a fan of cramped spaces this may not be for you. They do have our door seating. If your lucky you won’t have to wait long to be seated. The frozen margaritas are delicious and they offer a host of flavors. The staff is friendly and portions are perfect. This is a perfect chill, eat and drink spot. You will not be disappointed.\n\nIf it’s your birthday let the waiter know and you’ll get your very own sombrero hat."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKa0xpdmhnRRAB",
            "text": "This is my 3rd time in this restaurant. The food is amazing so does the frozen margaritas. The servers and the bartender are very nice to cater to your needs. Still, unfortunately, you have a bipolar host who lacks empathy, care, and knowledge of what Customer Service is all about. She has no manners whatsoever, and based on my observations throughout the night, she seems to run the restaurant her way—very arrogant and unpolite. So the first impression of welcoming to this restaurant is very unprofessional. There should be no reason your clients should receive such treatment from your host—a disappointing experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvellIakVnEAE",
            "text": "Owner of the restaurant is very nice very sweet man BUT the workers at night are very RUDE and disrespectful!!! Super racist which is very sad because the restaurant is literally a Mexican restaurant!!! Very sad owner needs to get new workers. Started speaking in Spanish assuming we didn’t understand English very sad because we come a lot during the week and the atmosphere is AMAZING everyone during the day is very nice and respectful. Will not be returning. This is the worker showing us the middle finger. VERY UNPROFESSIONAL"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxcGJuMVNREAE",
            "text": "This is my go to Mexican food spot, as I’ve been going here for years now . Located on famous Austin Street in Forest Hills it is quite convenient to get to by transit. This is a very casual spot not fancy at all and it is very much a bar setting. I love the spot, mainly because of the food. I have tried everything from their steak, steak, tacos, grilled chicken entrées, grilled shrimp, and even their pork chops. Hands-down. I have never been disappointing with any of their food. It is all so very good. The portion size is a nice and everything is well seasoned. My most favorite thing to get are the drinks specifically the frozen margarita. I’m not proud of the statement, but I have only had a frozen margaritas in all the years that I have been going to this restaurant and that’s because they are so damn good.!! you get to flavor them as well I have had everything from the pomegranate, to the apricot, to the strawberry, to the passionfruit, and I love them all. The staff are very friendly and know how to navigate very well throughout the restaurant even though they can get very crowded at times. The only con that I have about this restaurant is that it is very small and the waiting time on most days can be very very long, as they are a neighborhood staple and very popular. during the summertime, there is outdoor seating, which alleviates the wait time sometimes. Love this place they never disappoint. Highly recommend if you want good Mexican."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXOW9URUhBEAE",
            "text": "I’m convinced 5 Burros has the best frozen margaritas in Queens. I went around late brunch time on the weekend and had great service. The food looked and tasted amazing. Definitely one of my favorites in the neighborhood but you’ll have a harder time enjoying it when its later in the day or weekends at night because it gets crazy busy so service might be slower."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaamRudHJ3RRAB",
            "text": "The frozen margaritas are bomb and they have a good amount of alcohol content. The menu has a good amount of options. I really enjoyed the chicken soup and fried pork chops, both tasted authentic and were freshly prepared. The service was decent. The prices weren’t bad, both the food and drinks were reasonable priced."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDalBqUXJ3RRAB",
            "text": "Free chips and salsa is very nice food take a little bit longer then I expected but tasted nice and fresh but when in the end they charged you for your table and one next to you it's crossing all the good food and service my bill come out…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbXFuUlZREAE",
            "text": "First time visiting this Forest Hills staple and it didn’t disappoint. I had the stuffed peppers + a ‘michelada’, both were delicious! Food was fresh and tasty. The drinks were great quality and the ambience was lively. Service was also very good. Overall a great first impression that’s left me wanting more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINktpYVF3EAE",
            "text": "Had a great experience here. 5 Burrows has been around since 1990, and for good reason. Chips and salsa are on the house when you sit down, and the waitstaff and hostess are extremely friendly. The Burritos de Pollo, Chimichanga, and Fajitas were delicious. Highly recommend this spot."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNROS1YY213RRAB",
            "text": "Went for lunch and it was pretty delicious. You will definitely leave full! Appreciate the complimentary chips and salsa."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1eWRlUDVRRRAB",
            "text": "Place is a small gem. Service was amazing. Drinks were beyond delicious and food was next level fresh. This is my new go too Mexican restaurant on my very frequent visit to New York. Again. If you love frozen margaritas. You really cannot go wrong."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaDhpLVRREAE",
            "text": "We went last night for the first time. I’ve heard from different people that the place was popular for drinks which made doubt the quality of food. I was gladly impressed by the flavor, fast service and amount of food they serve. It was a lot for a midnight meal but that was our fault. The service was outstanding. We will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMDZpQzNnRRAB",
            "text": "The best margarita on the rocks I’ve ever had. A good amount of alcohol. The Fajitas were delicious and Nachos with Guacamole and Salsa were delicious. Excellent staff always willing to help."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnajlmeXVBRRAB",
            "text": "This place is really great for margaritas and they have amazing food. This was my first time here and I’ll definitely be back. The place is pretty small and at certain times can have an hour to an hour and a half wait, but you can have drinks while you wait and the wait is truly worth it. Great atmosphere, staff, and food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuOXRYaC1RRRAB",
            "text": "Anytime you’re in NYC, make sure you stop here for frozen margaritas & food. You won’t be disappointed. 🗽"
        }
    ],
    "reviews_count": 79
}