{
    "name": "Kuku Korean Cuisine Forest Hills",
    "place_id": "ChIJJ4nH0HNfwokRguSIyQ-34ao",
    "grid": "QN6",
    "address": "107-12 70th Rd, Forest Hills, NY 11375, USA",
    "rating": 4.6,
    "user_ratings_total": 318,
    "phone_number": "(718) 268-8886",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xock5td3lkMU5mUW1GUWJuTktjSFUwYlVOT04zYxAB",
            "text": "I went here yesterday lunch time. The food and service was great!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STFVuQnhORWh4Y0dWSFQzTTFSRGxWWVhkaWJIYxAB",
            "text": "Nice 👍"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabWNGTjNhMVZ3TVZZd2NVcGxWRkZCUTB0WVYyYxAB",
            "text": "The restaurant is clean, and servers are pleasant. The food is very good. Everything tastes very fresh."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMFpuVjFlbGwyUlRsT1kwTjNUV2w2T1hwWWJVRRAB",
            "text": "cozy, yet modern spot for yummy korean eats! the menu is versatile and reasonably priced. also wonderful service!! the staff there, especially Minju and Christina, were lovely and made our visit better.\n\nwe ordered the grilled chicken combo set which came with a portion of grilled chicken/veggies, soon tofu soup, rice, and banchan. this is plenty for one person but we ended up sharing and it was the perfect portion for the two of us.\n\nthe interior is so so so gorgeous!! a really sleek design that feels classy during the day and homey during the night. the music was not too loud and consisted of mostly r&b.\n\nthere’s street parking (~10 minute walk) from the restaurant and also plenty of metered parking. it’s always a bit hectic to drive near the area though, so i highly recommend taking public transit or parking away from queens blvd.\n\noverall, would visit again!!! the menu featured soo many different dishes."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaGRIRkpURzVQVWxBNVVUTjJOR1J4Um0xWFdFRRAB",
            "text": "this was my first time experience with korean food and i must say, i was delighted! we got some incredible food after getting suggestions and i was helped on how to mix what i was served. will definitely try more korean food whenever i get a chance!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkS1dUaDFVa3RFTkdJeVdYbHZRazlYVVdWT2VXYxAB",
            "text": "Honestly, I don’t get why there are so many bad reviews. The food here was actually really satisfying, the flavors were exactly what I was craving. The place isn’t fancy, but it’s cozy and clean enough. Service was decent. For Forest Hills, this is a solid Korean spot. I’d definitely come back if I’m in the area again !"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSFl6UmpNREJGYlVGT1dHaHdiREJrVm1OYWNVRRAB",
            "text": "Come here with my wife often and we are never disappointed! Every drink and meal has been wonderful, would recommend it to anyone! Stephen and Tommy are the best bartenders! The Kuku 75 is a great drink also"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbmEyTnJNMWhWWlROQ1FXaDZXVWw2VTJGQlUwRRAB",
            "text": "Very slow and over priced."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRFJ6VkdNRm8yVlRkM2IyRm5jbEJ4U0U1WVFYYxAB",
            "text": "Great place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkb2NXNW9ibVkwVDNveGRqTkVYMjVrZVVWTmIzYxAB",
            "text": "They made the wrong order. Rude and unprofessional"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210c2JHbG5XWEozTWxsV056UlpNM0F3WjBZMGNXYxAB",
            "text": "Beef tofu stew was delicious. Spicy chicken was okay. Seafood scallion pancake was top notch. Sweet and spicy wings were more sweet than spicy. Meat was a little chewy. Service was excellent. Ambiance wasn’t bad for Forest Hills."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twck56aFNNRkF5WkdGSE1HaE1RVTk1WWt4Q1oyYxAB",
            "text": "This Korean restaurant is a true culinary delight: each dish is crafted with care, honoring tradition while highlighting authentic flavors. The service is courteous and attentive, and the atmosphere strikes a perfect balance between elegance and warmth, creating a memorable dining experience. The spicy pork, in particular, deserves mention—it is undeniably fiery, yet so exquisitely seasoned that it becomes irresistibly enjoyable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NGVGQktXVmxPUmsxU1NrSlBabGwwVVdGaVVrRRAB",
            "text": "Such good food!! Will be back :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSWNGWTNMV05YU2xGT00wdDNkVGs0VlZKUWNVRRAB",
            "text": "Excellent food, service- do recommend and I will be back!\n\nI ordered the seafood sundubu stew- great price and quality. Banchan side dishes were great. It was busy on a Friday night so I sat at the bar, so no wait."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWVJVSnFOSEI1Wms5b2QwNTFWbDk1VEc5M1ZXYxAB",
            "text": "I've eaten here a few times. The food is really good, I enjoy the spicy pork, various rice dishes and their soups. The LA Kalbi is ok, I prefer a different cut personally. I've yet to try their fried chicken. I highly recommend getting a combo. The drinks I've had are good. The dessert here is skippable unfortunately because nothing stands out. It's better to go to Martha's across the street.\n\nThe service gets a 4 because I've had great servers and too passive servers. I've had great service where we we receivee refills but not pestered and even offered to make a soup of the rice at the bottom of our bowl. Then I've had service where no one checked up on me, not even once and I had to flag someone down for the check after sitting around.\n\nIt's a nice looking eatsblishment and they make good use of the smaller space."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONFNXeFdaRUZwY1RadE5tczNTa2cwVEd4c2QzYxAB",
            "text": "Great experience all around! The service was kind, attentive, and genuinely welcoming. Drinks were spot on, and the fried chicken was absolutely excellent—crispy, flavorful, and perfectly cooked. Definitely a place worth coming back to."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WblRYWkJhVlZsTm5WdlJuZGZjVjl0Tm04eFlYYxAB",
            "text": "Polite staff and incredible food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nM1YxOVVWVkpETVVsVVkxQnNUMWc0UVhseWVXYxAB",
            "text": "The food was really great but when the place is crowded food may take an hour to come"
        },
        {
            "date": "1달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5R04ydEJVa0kwYTI5WFZXeHhWMWd4VFVaTWJsRRAB",
            "text": "Maravilhoso"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wc2NqUjJWbkJXUkRkZmNGQkVhQzFNVnpkc0xXYxAB",
            "text": "Had an unfortunate experience recently with this restaurant while attempting to order lunch for my office. Their preferred online platform (toast—the one that their website directs you to) refused to accept my order. When I called to inform…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTGFWaHRlbXBQYUdNeFp6Tk1WVVJLZVdkemQwRRAB",
            "text": "Great place for Korean cuisine in the heart of Forest Hills"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQ1prTk1RbHB5VldKYWIwSjZhSEZwZUdOSFZrRRAB",
            "text": "First time dining at a Korean Restaurant. Everything was delicious. The staff was super friendly and the food was very flavorful. I highly recommend stopping by."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWmMzSkhYemhsU2xZM1F6TTJPRVJDTVVsaWFuYxAB",
            "text": "#koreanfood #nyceats #kuku Is amazing from start to finish service and food is on point, I will be returning. #foresrhills eatery"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZek9GZHZiMUJ1Y1hFelRVdERaRzQ0YW5seFVYYxAB",
            "text": "Great food, staff and atmosphere. Can’t wait to come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeWNWUlhhR3RXWmtOdE1GWXlkSGhTYlhsUk4yYxAB",
            "text": "The food was excellent and the service was top-notch. I was very surprised on how much they filled up our water, they filled it up almost every single time that they went by and saw it was empty. The atmosphere was very nice, I wish it was a bigger place, but besides that it was amazing authentic Korean food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQ2RGUnZaM1JhV2pOZlQyVnNhRmRFVlVkTlMzYxAB",
            "text": "Nice food and friendly staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNFpsa3pObmgyWmxoeGNXbFRYMFJZWWtab1dIYxAB",
            "text": "A very popular spot in Forest Hill. The staff were very friendly and helpful. They immediately cleared the table as soon as table become available for our party.\nThe restaurant is very modern and simple.\nThe food was very good. Not like traditional Korean food I’ve had but very tasty. Great flavors and portions are very good. The seafood pancake was a little too oily but still crispy and delicious. My family enjoyed our lunch"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVGRGZFJTM1ZZWVc0elkwVmhOREF5TjBaRE1tYxAB",
            "text": "One of the best options for delicious food and really great service in the area. Can't go wrong with anything on the menu everything is 10/10. This place deserves all the hype."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTVlXd3RSVFpGV0RrMVFXSnNOVUZIZGpjeFJHYxAB",
            "text": "This place was amazing. Truly great food with chill environment. We ordered a bunch of options to get a feel for it. Nothing was disappointing. Would come back frequently."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQk5VWk5lVUpGU0c1Wk5rWkhUWEJrUzNaek5YYxAB",
            "text": "Visiting from out of town so originally apprehensive about not having the typical Korean bbq experience where you cook the meats yourself at the table but hands down from the minute we walked in to paying our bill, the service was impeccable. The attention to detail was next level. The food was phenomenal and drinks were top tier. Absolutely will be on my list next time I’m back in town! Can’t say enough good things about this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbFlsQlVjMHhHYzNGcWJHOXBNemRtZFc5YVpXYxAB",
            "text": "Usually do delivery from here, which has pros and cons obviously, because fried chicken just doesn't travel as well. This place changed my partner's view of japchae for the better and the service is really nice in person."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNFgyMVJVbnBVV20xR2QxUk1WbXByVTNSQlVGRRAB",
            "text": "my first time here!!!! the servers are attentive and very kind. the banchan tasted fresh & my meal was delicious. my favorite thing was the pickled carrot! 10/10 would come back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waExXOUlZMUZOUjJsM05HaDZPRWw1VlRCUE1GRRAB",
            "text": "Beautiful plates, bright and cozy feeling.\nEverything came out amazing, the service was fast and the seating was comfortable. Bathrooms were spotless and they had mouthwash in the bathroom. Very convenient. 10/10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cFEyVjNWMkp2Y0ZoV1NHaGZRbmRSYkVsRVgxRRAB",
            "text": "Great place! Everything was delicious, the soup was absolutely amazing, the interior is very cozy, and the service was excellent. Will definitely come back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQ2IxbE1UelpXU0hjdE9Fa3hXbmc0ZEdwaGFVRRAB",
            "text": "Their grilled croaker is really good.  Portion is a whole fish too.  Not too oily either.  Only place I know that does a good fried fish."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OcE1tNWlNRzUzVUROcGMwVk1hVXhETXpWclprRRAB",
            "text": "Had food delivered but everything arrived hot still and they were 30 mins away. The chicken was super crunchy and the spicy garlic sauce was really good. The egg on top of the kimchi fried rice was cooked perfectly. Fish cake, kimchi and pasta salad ban Chan was all delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeGN6TlFNUzFKYlVaSldrNUVSRzVsWDBsZmRrRRAB",
            "text": "Other than AC set too cold we are very happy. They also have a complimentary barley tea but staff don’t offer directly. So make sure to ask for it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204dE5IVXlTazR6WDJoVmIzZHpNbXRSTmpneVJWRRAB",
            "text": "Food and service was good. I loved the variety of banchan, the flavor of the soup was really clean and comforting. Overall it was my fave korean restaurant. I also highly recommend the korean soy garlic chicken wings"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKQ3Zwc2VsMU9yOTlnRRAB",
            "text": "I ordered the spicy chicken dish and it was $27 which is already so steep in this economy. It would be fine but there was maybe 4-5 strips of chicken in there. Mostly just sauce and vegetable. So disappointing. For $27 for one dish you want to leave satisfied. I left very disappointed. I pointed this out to one waitress she just smiled and nodded. Another waitress came by and just told me to mix it with the vegetables. They could have just brought some more chicken.\nIf it was goat, filet mignon maybe I could understand but it’s chicken. For $27 extremely disappointing.\nThe staff is nice and the place is clean. Service was fast therefore 2 stars. Absolutely no value here for your buck."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOS3N1X1NxNjVhNk53EAE",
            "text": "I've only gotten take out or delivery, but quality is always great and everything is nicely packaged.  Am always satisfied with the beef bulgogi.   I enjoy their banchan selection.  Interior looks very modern , would like to go eat in some time in the future .  Great choice for Korean food in forest hills"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJajA2TkRjbEl1YS1RRRAB",
            "text": "I love their casual setting and the bar! We wanted something different and found it! Their food is amazing! From their appetizers to their dishes, the wait is worthwhile! I loved the fish cake appetizer! We ordered potstickers, beef bulgogi and gluten-free mackerel! WoW.. what deliciousness! The space is simple, clean and welcoming! Their staff is super friendly, knowledgeable and accommodating! I highly recommend them!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJTFcwNWVuMkpEQ3dBRRAB",
            "text": "Incredible food. Fresh. Tasty. Authentic. Everything you want in a pad thai place!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQNkg0ZGZpX0pyY3dnRRAB",
            "text": "Really tasty food and friendly staff"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZWEtb0dGMFBDYWNnEAE",
            "text": "Amazing service and amazing food! Very decently priced and the drinks are excellent"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbXIxZUd2bDVXZjV3RRAB",
            "text": "This place is amazing place to seat in having lunch Dinner and they do accommodate base on any food allergies! Amazing customer service!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQamVicjRBRRAB",
            "text": "First time I had this hidden gem it was very delicious and the staff were completely amazing"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLMnl2NURPN3FyWGt3RRAB",
            "text": "Perfect food perfect service perfect experience. Lemon water, food filled with good flavors, the friendliest staff ever, water refilled like every five seconds, clean bathroom, clean restaurant, warm lighted and calm atmosphere, quick service, unlimited starting tiny korean dishes. Also the aesthetic is so cute, love it here. Been here twice, each time the experience was perfect. Gluten free dishes available as well as vegetarian ones. Also theres a bar. Come if you are hungry and dont know what to eat or if you js love korean food. I dont usually make restaurant reviews so trust me on this"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOV1Zvc1Rockp5ZURBEAE",
            "text": "dont order food online from here they dont care about online delivery order"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VORHlub2I0MUw3b2l3RRAB",
            "text": "never make pickup order on time"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPdVgwNnY4M2NmeVJREAE",
            "text": "Came with a large party, about 6+ and they accommodated us well. The servers are friendly, and everyone was happy with the food here."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cDVfeF9RRRAB",
            "text": "분위기와 친절은 물론이고\n플러싱에 괜찮다는 한식당보다 음식맛이 아주 정갈했고 훌륭했습니다. ^^\n해물파전은 간도 잘맞고 안에 재료들도 풍성했고 바삭고소하면서… 아~ 지금도 생각나는 맛이네요~\n메뉴들도 다양했으며\n한국주류와 칵테일 생맥주 등이 인상적이였습니다.\n다음에 친구들과 함께 모임을 이곳에서 가져볼 생각입니다.\n\n모든점이 마음에 들어서 많은 사람들이 이곳의 매력에 빠졌으면 좋겠어요! 꼭 추천하고 싶네요~"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMXJlZUV3EAE",
            "text": "맛은 조미료맛도 거의 안나고 한국에서 먹는 그대로구요 뭐부족한지 항상 체크해주시고 너무 친절하셨어요  포레스트힐살면서 자주올거같구 혹시 이사가더라도 일부로라도 올것 같아요  저만의 미슐랭3스타인 곳입니다"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMk9mclVnEAE",
            "text": "오!!! 맛있어요 순두부도 맛나고 개인적으로 파전 맛이 죽여줘요"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMGY3VHdBRRAB",
            "text": "최고에요"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJakxpSXFBRRAB",
            "text": "Great intimate location with as awesome food.\n\n*Parking can be easily found depending if you are going on the weekday vs. the weekend. If you are an avid FHer, you would know that at certain times it is hard to find parking. As we went on an early week day, it was easier for us to find parking and seating at the location.\n\nReally enjoyed the food alongside with the atmosphere as the setting was very intimate and the seating arrangements were well thought out. The servers made sure to check in with us as well, as frequently needed rather than being disrupting, or careless.\nThe food was savory and had different levels of spice as per request.\n\nThere is a lunch menu, which is also added as images to see the various pricing of the food items. We’ve tried the beef and the chicken, and were pleased.\n\nLook forward to trying out the fish next time!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPQ2w5ZUxwbHJ5WFV3EAE",
            "text": "How come this place got a 4.6 star? Over all their food was SALTY,  beef bulgogi combo was such a disappointment 😫 the fried chicken bucket half half had a taste like the skin of the chicken was in oil for too long that’s why taste so oily and chewy ! At least they have nice staff and nice place! Aha I forgot to add their kimchi is toooooooo fishy"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdnYyN3l3cDlXeWdBRRAB",
            "text": "Food was great! I got the seafood pancake with kimchi and radish as side dish  Service is also good, their restaurant is clean with a really good ambiance! A must try"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMkk2Z1ZREAE",
            "text": "Wow, I’m absolutely obsessed with the Garlic Tradition Chi-Bap at Kuku! The fried chicken was perfectly crispy and bursting with flavor. The staff was incredibly friendly and got our orders out quickly. This place is a must-try if you're in Forest Hills."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMazhpNkFnEAE",
            "text": "My visit to this restaurant for dinner was a delightful surprise! The food is incredibly delicious and fresh.\n\nWe started with the calamari for appetizers, which disappeared in minutes—it was that good! Our server jokingly remarked, 'Wow, you guys finished it already? Next time, we'll order two.'\n\nFor our main courses, we ordered a variety:\n\nCurry Shrimp Fried Rice: 10/10\nSpicy Chicken Bibimbap: The spiciness caught us off guard since we weren't asked how spicy we wanted it, but it was still enjoyable.\nCrispy Shrimp Chi-Bap: The portion size was generous; I couldn't finish it all and had to take some home.\nChicken tenders and waffle fries: A classic choice that did not disappoint.\nEvery dish scored a perfect 10 for taste and portion size.\n\nThere were some small additions served with our meals, including fish eggs, pumpkin, veggies, pickled radish, and kimchi. Each one added a delightful burst of flavor to our dining experience. Surprisingly, my favorite was the pumpkin—I usually don't care for it, but this was exceptionally tasty and I couldn't resist finishing it.\n\nWe rarely have dessert due to being full, but we made room for the mochi ice cream—and it was worth it.\n\nService was attentive; they cleared our table promptly after the main course and even cleaned crumbs away. They also served us a delicious tea while we waited for dessert, though I'm not sure what kind it was.\n\nLocated in the bustling area of Austin Street, parking can be a challenge, especially on weekends. It took us about 20 minutes to find a spot on the street. There are paid parking options and lots nearby."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPM0hyN3pmZ3VIdUtBEAE",
            "text": "Food is so delicious, Service is amazing and so friendly, they understan our necessities very well!! We'll definitely coming back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcHAtRjBRRRAB",
            "text": "While exploring the area, I discovered a Korean restaurant offering an excellent lunch special. The beef bulgogi was delectable, accompanied by purple rice and a mixed seafood soup—perfect for cold weather. Additionally, complimentary side dishes were provided. All of this was included in the $27 special.\n\nThe restaurant boasts a clean, modern ambiance, and the attentive staff ensured my tea cup was never empty.\n\nThank you so much, highly recommended!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaXRMc0lBEAE",
            "text": "Really good quality food at a reasonable price. Everything tasted clean and well balanced that had me consistently returning for another bite. Definitely excited to come back here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNlpfLTJRRRAB",
            "text": "This was my fifth time at Ku Ku! My friends and I love this place. It was my first time trying Makgeolli on this trip. Loved it!\nWe were obsessed with the Kimchi and the other banchan dishes.\nWe had Spicy Squid 🦑 and Spicy Pork & Kimchi and as always the food was delicious. The service was friendly and efficient."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc2NTUHFBRRAB",
            "text": "Food is delicious. I can't believe I found out about this place just today. Will definitely come back.\n\nUPDATE: I came for the third time for dinner and have noticed the portions for bossam and pork galbi are not consistent compared to my previous visits which was a bit disappointing. Food is still good though."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNROTZiMnVRRRAB",
            "text": "Keepin it real out here in Flushing\nService is great, place is nice but the food just didn't hit bro. Forest Hills is pretty Asian so I expected better. Of course, it can be just a off night so I might go and try again if I'm in the area. But even the soondubu didn't hit on a super cold windy night"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeV9HWEhREAE",
            "text": "We came here for lunch on a cold day and ordered the 18 piece poppers, sauces(kuku spicy chili and Thai sweet chili) on the side. Also ordered the beef bulgogi lunch combo and the spicy squid lunch combo.\n\nEverything was delicious! They give generous portions of banchan sides and the poppers were a lot more than we expected, at a decent price for Korean food. We ended up taking food home, enough for another meal the next day.\n\nThe interior is clean, spacious, and well thought out. Staff are friendly and kind, and the food came out pretty quickly.\n\nOn another occasion, I did take out for the Korean fried chicken wings, half garlic and half spicy garlic and their beef japchae. While the wings weren’t as crispy and the japchae was too soft after I got back home to eat for dinner, the taste of the food was still there. If you can, I’d recommend eating at the restaurant while the food is fresh out of the kitchen.\n\nWould definitely come back here again! Great addition to the forest hills neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUc3BDTHJRRRAB",
            "text": "I liked the atmosphere and overall vibe of the place. The restroom was very clean and the food was delicious. I am giving it 4 stars because the pricing is a bit high for what the food is. You’re paying more so for the area and the vibe. I would say to skip the higher priced items like the bimbimbap and instead go for the fried chicken (tenders or bone in, the seasoning and crispness of the breading is perfection) and the kimchi waffle fries. I could eat those fries everyday! The kimchi is definitely home made and fresh. I could have ordered an entire plate of it alone! The cocktail from the bar was a little weak for the price as well. Plenty of seating and good to come with friends, on a date or by yourself. The fried food here is a perfect spot for a hangover cure and that’s what I will definitely be back for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibGNpdWpnRRAB",
            "text": "We decided to come here after running some errands and we’re glad we did. From the outside, the restaurant looked kinda small but it was surprisingly spacious and modern inside. We ordered the wings (soy garlic) and the pork galbi bbq. The pork galbi bbq came with a side of banchans and purple rice. Everything was super delicious and came out quickly. Our waiter was also super nice and there was someone who would fill up our water glasses any time it was empty. Their staff has great hospitality and they definitely deserve recognition for it! Overall, it was a good meal and I would definitely come back again! 10/10"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaHEyalF3EAE",
            "text": "I have ordered grilled chicken and chicken Bibimbap. Also ordered lychee soju drink.\nIt was an absolutely delicious lunch after a long time. Staff is also friendly with really good service to everyone. Kuku Korean Cousine is highly recommended. 👍🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NHVqYmJ3EAE",
            "text": "I went here for lunch time because it was a stop away from where I work and I was craving Korean food. The place is on the smaller side but is cute. It wasn’t busy but staff greeted me and sat me down. I ordered the lunch special which was 26.99, and got the spicy squid and the pork/kimchi tofu stew. They meal combo comes also with purple rice and bantam (side dishes). The food was delicious. The atmosphere and staff was nice as well. Would come again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bTh1RFdnEAE",
            "text": "Japche and waffle fries are authentic and delicious.\nThe decorations are fancy and stylish and remind me of Manhattan restaurants.\nWish there are more seats and spaces. But overall, I enjoy the food and service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aVBMdlFnEAE",
            "text": "lovely place, calming atmosphere, high class attentive and empathetic service, suuuper fresh chicken wings!!! gluten free which is such a rare treat for me and actually delicious and done right. my first korean fried chicken in 13 years. Thank you. cannot wait to come back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzb0lxUzFBRRAB",
            "text": "I loved the vibes and interior of the restaurant. The service was amazing as well. As for the food, the soy garlic wings were good! I’d skip out on any of the fried rice dishes as they had no flavor whatsoever."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNWVDQjdRRRAB",
            "text": "It’s thanksgiving eve and perfect to have some tofu soup due to cold weather. Hence, we visited Kuku for our craving.\n\nTheir banchan was not as various as other spots but everything was decent. My personal favorite was the mashed potato.\n\nI am usually not a fan of fried chicken but their version was impressively good with appetizing sauce and juicy inside. Their tofu stew was also decent with soft tofu and various ingredients."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaVlMY2lnRRAB",
            "text": "This restaurant was incredible!!!\nWe came for vacations from Orlando and we're looking for a place to have good Korean food not way to far from the airport. If you are looking for a Korean restaurant and you're are not sure if you should pick this one, let me help you with that, pick this one!!\nFood was so tasteful, it's the best kitchen I've ever had in my life. Also our waitress Yuni was amazing, caring and so so kind, she made out experience even better.\nThank you so much for such an experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNVpHYzlnRRAB",
            "text": "The food was absolutely to die for, delicious. Some of the best beef bulgogi I’ve ever had! The kimchi and veggies were fresh. Everything was just tasty. The service was also really great! Our waitress went far and beyond to make us comfortable and fed. Always checked up on us and replaced whatever little side dishes we ate. Definitely recommend and want to come back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxODgydjB3RRAB",
            "text": "After few months of the restaurant opening, finally got a chance to grab a takeout.\nThe restaurant had a nice clean ambiance.\nOrdered Galbi and Soondubu. Didn’t really have much to note about the dine in experience but the staff seemed nice.\nThe food was good but not specially memorable. In my opinion, the menu items are priced slightly higher than expected for the type of food being served.\nFrom my take out experience, I would consider this place to be on the average side.  But I think it’s a good start and good addition to the neighborhood."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2X0lybXZBRRAB",
            "text": "I live in South Brooklyn, but I come here just to enjoy authentic Korean food. Not only is the food amazing, but the service and atmosphere are also fantastic. We always end up overordering because everything looks so good, and we can never decide what not to order. Lol The leftovers, reheated in an air fryer, are still delicious the next day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbUlDOEN3EAE",
            "text": "My favorite Korean in Queens so far!! The atmosphere is great and service was fast and amazing. Fried chicken is the best I ever had in my entire life. You can skip the beef bulgogi but spicy squid was amazing. Definitely get kimchi fries and their spicy cold noodles!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3d3ZqRkxREAE",
            "text": "ahhh!!! in love with this place. the food, service, and vibes are sososososo nice.\n\nI had the LA Galbi + Bibimbap and it was really yummy at a great price. I would say the galbi is a bit more tough than I’d like but otherwise zero complaints.\n\nI think the servers were awesome but I didn’t get their name :( one of them lowered the blinds since the sun was hitting me. I didn’t mind the sun at all but I thought it was a really thoughtful gesture.\n\nwould 100% come back again!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0b05qd093EAE",
            "text": "1st time here. Beautiful layout, plates and flatware. Drinks were amazing. I had the spicy margarita, my friends drinks were delish as well. Food was fresh, tasty and filling. I loved everything there. Can't wait to go back. Thank you to the lovely staff. The bartender or mixologist if you will was so friendly."
        }
    ],
    "reviews_count": 81
}