{
    "name": "Mad For Chicken Forest Hills",
    "place_id": "ChIJ4WU-tLFfwokRudUuWC9rw6Y",
    "grid": "QN6",
    "address": "71-37 Austin St, Forest Hills, NY 11375, USA",
    "rating": 4.1,
    "user_ratings_total": 583,
    "phone_number": "(718) 480-6618",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeWJUaFFaRmhOYkVGeVoxOXdiWGsxYXpNNVMyYxAB",
            "text": "Every time i order I request soy garlic why am i getting SPICY !!!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNFRtZ3pOVXhGTjNkeVUwNVJkakJtYm5sa2NIYxAB",
            "text": "Spacious place, great for larger groups. The service is decent"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeWFFc3lWMVI0WVdaSFJGZE5NMGw1WVMxYU5rRRAB",
            "text": "Server Alan is the man! Good service good hospitality and good communication!! Had the 10 piece wings, Mac & cheese with fries…"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWaVUxVnJha0ZWY0VOc1JGaHZNV0p1YUdoTmRFRRAB",
            "text": "The bowls are the best :)"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRWR6ZDRYek4wWm1jMFRYWkhielJsUm5wNGFFRRAB",
            "text": "Spacious interior, was pretty empty when I arrived I was the only guest.\n\nService could be welcoming but they did a good job at being attentive. I enjoyed the chicken bowl, had the spicy soy flavor for the chicken.\n\nWas expecting to be told about the happy hr as I did arrive between 3 and 6 but maybe that’s only available at the bar."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeldWSlZjR0kxYTA0NGJtZFZSRlZaVEVGcFZGRRAB",
            "text": "Romeo was our server. They we very patient, polite and accommodating and attentive.\nThey keep the restaurant clean an sanitize from table seat the high chairs.\nThe bartender also delivery a good old fashioned.\nThe food was delicious from apps to dessert.\n\nIll be recommending mad for chicken to all my friends"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKS1QwdFFiV0UzUkdnemNFdENOMlpQVmxCb2FWRRAB",
            "text": "9/28/2025👎Horrible experience, went with my family, everyone ordered their food and drinks, everyone got their food except me the one that's paying, the waiter never came by to check if everything was ok or anything. MY FOOD NEVER CAME OUT!, & The place was empty, I had to ask for the check, paid my bill with NO TIP! PAY ATTENTION TO THE REAL CUSTOMERS WHO REALLY PAY!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwZlJYUTVlRWt3VVU0eFYybFhWR3BFTkZGMGNuYxAB",
            "text": "Good"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sa1YzZGxNRzVrV2tGUVEyTlVhMkp4TldRd05VRRAB",
            "text": "Don't order from them.\n\nI'm sure their chicken is normally delicious but we paid full price for half the order, leaving a two year old child and her mother hungry.\n\nTheir phone number didn't work.\n\nEdit: they contacted us the next day and refunded the order which was appropriate. I've updated my rating but I'm going to think twice before I order again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oc1ZHVmtiVEJCUm1GMGREaHNaRlZZU0U5aFJGRRAB",
            "text": "Well, I'm certainly mad. I came in at around 9:45pm to order 10 chicken strips. I left at 10:30pm. I waited 45 minutes for 10 strips. Unacceptable. And to add insult to injury, my order had actually come out earlier, but the hostess didn't bother to check on it until I threatened to get a refund and leave. My chicken was sitting there at the bar, shivering, alone and scared to death. And unfortunately, my chicken was lukewarm when I got it. It's delicious chicken but they gotta get it together."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbWJtZFJPRE4yTkVaSmNGOXBXa2g1ZVdGa1VuYxAB",
            "text": "They work very slowly when you order food for yourself. The cooks are probably like sleepy flies.🪰 I waited for my order for 40 minutes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWFUxZDRkV2RXU1dWMVgyRmxOMlJpUkdodE5tYxAB",
            "text": "We've ordered many times and food is always good.  The chicken freezes well and we love to have some packed away, for a quick tasty bite.  I've also visited the bar and its 'meh'.  Yes you can get a drink, yes its drinkable, yes there's some TVs, but there's no personality or bar-feel.  It almost feels like you're a bother to be sitting there.  I guess I remember places like Uno's where the bar might have a bartender and regulars that made it kind of fun.\n\nAnyways, good food, good location.  Definitely a good place to meetup with friends, grab a table, some wings and beers!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nelRrMUJlblo1ZFV4eFlYZGpiMEppTlMxRlMxRRAB",
            "text": "Terrible, why provide a phone number if you won’t pick up? I tried to call to edit my order I did via uber eats, they don’t give the option to edit orders online nor do they pick up the phone? Make it make it sense.\n\nWhat if someone is allergic to certain food types. At least try to make it to where you can edit the food orders. I called like 30 times and no pick up."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkc1pteG9kbkpDUVU5MmFIRlphM1pZTjIxaGNrRRAB",
            "text": "Went here today with my best friend and goddaughter. Let me just reiterate what other commenters have said—the food is great, but the service is not.\nOur waitress was very nonchalant, didn’t check on us, and left us waiting 15–20 minutes just to order.\nWhen I asked about appetizers (since she mentioned the mad tenders would take 25 minutes), her response was, “well you already have fries,” with an attitude. We still asked for the menu and ordered vegetarian dumplings, which she said came with soy sauce dipping.\nAfter 25 minutes, the only nice workers—the busboys—brought out our food. The tenders and dumplings arrived, but no fries.\nThe drinks took too long, and I had to get up multiple times to flag her down for spoons and refills.\nDon’t get me wrong—I’m very understanding and patient. But overall, the service was just not up to par, which overshadowed the good food…"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOSDhwLWlWNC0teDlnRRAB",
            "text": "Not fresh"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SlVWWkhjemxoWDB0NmJUQjJPRjlpUjBkcWRWRRAB",
            "text": "Great date night place clean place and staff is on point."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psc1gybHhhVXh3TkVkSU5WWjRWVnA1VUV0U2JuYxAB",
            "text": "Food was great and atmosphere as well. However, along with our food we ordered 3 drinks and were never received. After the food arrived we were never attended until about half an hour later once we were nearly done with the meal. The food was great, just wish the staff was just as."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSGVFTTRUbE15T1RKeGNrVXlUVWhZTFZsU2RYYxAB",
            "text": "I usually like this place and had been here often , but today was unacceptable!!! We literally were waiting with my friends more than 1h to get our food and it was not at busy at all probably like 4-5 tables which is already finished eating …\nWe also ordered almost the same food and to cook it , is no way that it can takes 1.5 h …\nAlso we ordered pitcher of the beer with special deal and we got beer only after we reminded to the waiter and is took him more than 30-40 min to bring it …\nService literally 0 today at 8/14 unfortunately:c\nI’m  disappointed and don’t want to come back again\nPls fix this guys"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRVpWWjVjMFZGT0ZoVWQyaEdWR05CV1VkTVJtYxAB",
            "text": "Great happy hour spot!!!! $6 for beers and apps. We got truffle fries, buffalo chicken and chicken tenders for happy hour before 6pm. After 6pm they have weekly specials (weekdays only!)\n\nIf you have a clean bathroom and a clipboard cleaning schedule, it means you care about your customers and cleanliness!!!!\n\nPs. Chicken tender were dry but they fixed it! Amazing staff!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUFUzcEJiREJwVEhWdVYwTmlVV3RSY0RGaWRrRRAB",
            "text": "I love this place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJelpWRXdUaTFOZG0xS1IxZE5hM0pRVmpBd1JGRRAB",
            "text": "The food was good but we waited way too long for it. It wasn't busy, there was only a couple and a single person eating there when we arrived."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcmFWVmtRbVZWYTNKTFNsOUhjVWxrZUdKbk5XYxAB",
            "text": "I have lunch here every Saturday.  This past Saturday my girls and I had chicken tenders, wings, and spicy drumsticks with 2 different kinds of French fries. I love the food there."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTU1VTjJVMmROWjNKVGJUSXRNR1p5VTNOcFFtYxAB",
            "text": "Food is great. Service is spotty at best"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUGJVcE9RbWwyYkZsdFlYaFVMVWhUVm05NlRrRRAB",
            "text": "My husband and I stopped here for lunch today before heading to a concert at Forest Hills Stadium. The food was SO good with great portion sizes. We enjoyed the atmosphere even coming in at lunchtime, and the staff were great. We will definitely come here again and recommend it to others."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzd1dqZFJObWhOU2xKSlFtZFdTWGN0WWpOWlpFRRAB",
            "text": "We reached supper late in the night and they were almost closing but the staff was very generous, they helped us get the food, we got some chicken wings and veg dumplings in soy garlic sauce is amazing!!!! Like best dumplings ever!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTWRHb3dUVnBLTkhaTGEwaDNOa3haVFU5SlUyYxAB",
            "text": "Drinks and chicken wings are good, would visit again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cc2FYRnJhekl3UzBOUE4yUkpXVU5TTTFOMU5WRRAB",
            "text": "Great food! Happy hour is very much worth it with $6 Margaritas!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Vd01tSm9TV2RuZEVOdk1VZzFkWFV4TmtSdFZrRRAB",
            "text": "I should have tried other flavors instead of the golden bbq"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paamRYTnlOa3BqVUc1cmQzQlFkRkJYTmtNNU9XYxAB",
            "text": "Wack\nBelow average\nUncomfortable seating\nThe females give bad service, the guy with the blonde hair behind the bar was attentive.  He had to finish serving me because the two females were completely disconnected with the customers and needs"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWmEwMWtjbUV0TW1OdVVVdG5NbDl6Y3poR1ZGRRAB",
            "text": "The wings are incredibly crispy...I really enjoyed them.  I ordered the Large wing platter with 2 other guys and we couldn't even finish them.  Great spot after a concert at Forest Hills for a pitcher!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUVREbEtZMkkzVDBwbFFVRmZWMDFYZHpSVFUxRRAB",
            "text": "They say, \"How can you go wrong with chicken? Well, dont ask these guys because they have no clue how to go wrong. Everything was delicious but simple. Portions are substantial. Service on point."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUmFHdE5lSFZYVG5sb2NWaFZjM0p6ZG5wb1EwRRAB",
            "text": "The korean fried chicken there are tasting."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPTEZ4YzJucXE3VkF3EAE",
            "text": "They told 5 minutes but took 50 minutes to make the food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVWNVRm1Ua05JVURocVYxUlFaVkU1VXpSdmRVRRAB",
            "text": "This place is consistent but I sometimes feel like the staff could just be more experienced or trained better overall.  I do think they're all really sweet and well intentioned employees though and they want to do well; but for example, 3 people at a table usually means 3 settings and 3 menus.  We ended up getting our own setting after food had already been served.  It's a small thing overall, but it can add up, I'm sure; especially if they're busy.\n\nThe atmosphere gets a three because of this place isn't busy, it's a very large sort of empty feeling establishment.  Long empty tables, etc.  Then again, I choose a Sunday night so what exactly was I expecting.  The place is clean.\n\nThe popcorn they offer the tables is a nice touch but SO salty and (possibly because it's dinner when I went) maybe less than freshly popped.\n\nYou really should come for the wings which are delicious, crispy, and perfectly cooked every time.\n\nIf you think of this place as a sports bar, I think you're on the right track. Pretty good beer selection.  I think a bartender with better cocktail offerings could really breathe life into this place, but that's just me.\n\nAll gender restrooms are a plus.\n\nAll in all, if you want the wings, you're coming regardless and it's a good time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJWHhzTm1RNy1EU293RRAB",
            "text": "Great prices for happy hour , got busy as soon as I walked in but over all the food was great our server R. Marcos really hustled and managed to juggle all the tables well"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNcjAyb2prclp5Nk5nEAE",
            "text": "Good portion size of fries and vegetarian chicken. Well definitely come back if I'm in the area for another concert."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQREVqX1A4ajlPdFJ3EAE",
            "text": "Terrible experience!\nWe ordered chicken wings and a salad. The salad was okay, but the chicken wings were absolutely awful — they cost $30 and were spoiled, smelly, not fresh, and even burnt! The smell was unbearable. We asked them to take the wings back and refund us, but they refused. I strongly warn others not to eat here — the food is not fresh, especially the chicken, and it’s way overpriced!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNV3hzSUc3amMyVHZnRRAB",
            "text": "We were told our wait time was an hour. Little did we know that it was a game that night. The food was okay (spicy)but I surely did not like my shortly l Shirley Temple drink.  The seating were benches so not the most comfortable. It was just a very crowded night, loud ... The game was on."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQ2ZsTGpSX1pfZ09nEAE",
            "text": "I been eating MFC for a year and I love it the 10 tender full soy garlic with truffle fries are a good combo and I been buying it every time I go to MFC the forest hill one is good."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJM1cyb1d0a0xHRUpBEAE",
            "text": "Realicé un pedido para recoger a las 2:30 pm y cuando llegue al lugar el joven me dijo que no estaba lista a lo que espere aproximadamente 15 minutos. Decidí cambiar de opinión y me fui a sentar a comer mi orden a lo que rápidamente el vino y me dijo que no me podía sentar a comer. Fue frustrante porque estaba lloviendo y tuve que salir del lugar a comer en mi carro , no obstante pensaba pedir algo de tomar. Nunca había sido tratado con tan mal servicio por una persona en un lugar donde estoy CONSUMIENDO."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOcW9uOGlGcVpyaGRBEAE",
            "text": "$20-30 / pp\nThe food is always a 10/10 and their wings hits different. Everytime I go have a great experience with the staff and their attentiveness."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMDYyUnlRRRAB",
            "text": "Pretty much what I was expecting. If you're in the mood for chicken wings this is a solid option. We got both types of chicken wings (traditional & Korean). I do wish the spicy Korean option had a bit more of a kick but they were fried nicely with a nice glaze. For the traditional wings, I wish they came with sauces standardly as it seems a little unjust to have to pay extra for any sauce at baseline (the blue cheese and Ranch really were clutch for these). I ordered ahead and they were ready for pick-up by the allotted time. Prices reasonable for what it is."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ3JILUFnEAE",
            "text": "Very nice customer service delicious food and very kind people my server was Camilo"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc3FuVmtBRRAB",
            "text": "The Mac & Cheese, and the truffle fries where good but the chicken itself needed seasoning."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJejlqM2pnRRAB",
            "text": "Went for happy hour this best Friday and sat at the bar . Music was great, happy hour drink were strong & good , and the food was bomb ! Will definitely be my go to spot !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJajRHS3BRRRAB",
            "text": "Service is rather lacking, although the friendliness of the staff makes up for it.\n\nAs for the food, think of it as an overpriced KFC. True, it comes with options for garlicky and spicy flavors, but so are the many other Korean-owned chains that are  better."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMGJHTzRBRRAB",
            "text": "Came here for lunch for the classic MFC Korean wings. They were good but didn't come out hot. Slightly warmer than room temp. The nachos I ordered came out hotter than the wings. Go figure. Asked for a coke but that took a long time to come. Waiter seemed to have forgotten and was attending to other things and just chit chatting with other staff. Not a great experience that I have come to expect from MFC since the first one opened. Oh well."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJLThib3JBRRAB",
            "text": "The food and atmosphere are so incredible. I will definitely revisit this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc2REUWZ3EAE",
            "text": "Super good food and portions  . Great environment"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bWFDWkxBEAE",
            "text": "First time here. Food has large portions for a good price, we had to take “to go “, because two of us could not finish all. We got Kimchi Fries, Crispy chicken Bowl, and Tenders w golden bbq sauce. Everything was yummy. 😋\nServer Sonya was so kind , attentive and patient, thank you. ✨Atmosphere is one star lower, just from design perspective. Definitely will be back ☺️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdkt1TTR3RRAB",
            "text": "The service here is amazing, the server I had went beyond to make me and my friend comfortable. Made sure we were taken care of and tried her best to accommodate our needs. I love after we make our orders they serve free little bowls of popcorn here, and they’re not plain old popcorn either. They’re very flavorful too. The drinks here are very good and packed with flavor. The chicken wings are the best thing you can order here but I’ve had their noodles before too. I’ve haven’t been disappointed by their menu yet. The quality and taste is definitely there. So crispy, juicy and extremely flavorful. So delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdUtEN3ZBRRAB",
            "text": "We went on a Monday night. Only few customers present. We ordered truffle fries to share then the half and half chicken tenders. The food was good but the tenders took so long to come out that we got full from finishing the fries and just took the tenders to go. Service was not impressive. Our waiter was nice but only showed up to give us the food. Otherwise nowhere to be found"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRX083UmtBRRAB",
            "text": "Mad Chicken was a surprisingly quick and enjoyable experience. No wait, and our food arrived in under 10 minutes! The ambiance was great, with plenty of TVs for sports fans. I particularly loved the beer sampler, trying their lager, wheat, and IPA – they have a huge draft selection. We ordered wings, kimchi fries, and japchae. The kimchi fries were a definite winner, and the wings were decent, especially paired with the beer. The japchae was a tad salty for my taste. Overall, I'd definitely return for drinks with friends and enjoy the lively atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcjlXcThnRRAB",
            "text": "My boyfriend and I went to this restaurant for Valentine’s Day. While the food was great and the drinks were okay , the waiter didn't pay attention to our bill while processing the payment and charged us for not only our bill but another parties bill as well. How can you be so careless ? After messing up, the host walked around laughing with a smirk on his face. I didn't appreciate it at all. On top of that, our money was never refunded. My boyfriend talked with the manager who said it would be , but as of today, 03-15-2025, there is no refund. We will never diner here again. I visited two other locations and never had a problem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUOXVfVkFnEAE",
            "text": "It was different. Not sure if I would return. Their version of a piña colada is more like a mojito. I'm not a fan of mojitos. The service was bad I think they're short staffed. It was mother's day it was empty they had tables available. Now I know why."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyb2JxOWpBRRAB",
            "text": "Have been to their flushing location a few time but the food here is awesome too. Their iconic Korean flavor soy chicken is crispy and juicy, and very fresh. The avocado salad was newly cooked and tastes great. I would also recommend their kimchi fries as it keeps the unique flavor best when dine in. Overall the Mad For Chicken experience at Friday night was awesome."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidFkzTzBnRRAB",
            "text": "Just visited Mad for Chicken and tried their mac and cheese and bulgogi over quinoa. The bulgogi was good, but the mac and cheese was a bit overpriced at $12 and wasn't that flavorful. Overall, the food was okay, but the place has a nice atmosphere.\nI would recommend skipping the mac and cheese and trying something else on the menu.\n\nFor more pictures and detailed reviews check out my IG : @adventureofourlifetime"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dV9YeTVRRRAB",
            "text": "The food was truly amazing! The name 'Mad for Chicken' is apt, as the chicken is so mouthwateringly delicious that it will drive you crazy with cravings to return again and again. The dishes are finger-licking good, and don't let the name fool you - they also offer some delectable some beef options like beef quesadilla for those who prefer it. The environment is pleasant and clean, and while the service could be a tad faster, the friendly server made up for it. Overall, I'd give this place a well-deserved 9.5 out of 10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6dHRqaVhREAE",
            "text": "First time in this location and it honestly didn’t make me wanna go back there. Took forever to clear a table, after sitting for 5min no menu’s were given so we had to ask unfortunately. The popcorn they give to share for the table was stale. I also didn’t like that they couldn’t give chicken with no sauce. I do like their parmesan truffle fries even though it taste like more Parmesan than truffle. I also didn’t like that their dumplings weren’t individually cooked instead were mixed with vegetable, pork and beef. The service wasn’t great but I’m not sure if it’s cause it was 12am or they were just not on top of their game. I highly doubt I’ll be going back there."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLeGZ5Q1NBEAE",
            "text": "I’ve always been going to mad for chicken in flushing. Finally decided to try this one. I must say the boneless chicken were really good and delicious 🤤.  My wife had the crab 🦀 salad and was surprised how big it was and delicious. The only…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdnZhX1RnEAE",
            "text": "We visited this restaurant, and while we really enjoyed the atmosphere, the experience overall was disappointing. The avocado salad was absolutely delicious, but everything else we ordered was terrible—way too oily. On top of that, we ordered another dish, but the waiter completely forgot about it. It felt like we ate, but at the same time, we didn’t—it was such a strange experience. After that, we didn’t feel like waiting any longer and decided to leave. On a positive note, we appreciate that they were open on December 24"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPajkyZXhRRRAB",
            "text": "Korean fried chicken is sooooo friggin good especially their iconic soy garlic flavor. Overall menu is a bit pricier than other fried chicken joints however it’s truly worth the he extra few $$$\n\nOther items on their menu include various sandwiches, salads, bowls and array of sides but star of the show is simply chicken. I personally love the Radish, sweet and vinegary compliment the chicken perfectly.\n\nGreat food, great service and great music. I’m sold."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCak4tYXBRRRAB",
            "text": "Went on a Sunday and had fried dumplings with a sauce of half and half. It was really tastefulIf, if you like a kick of spicy this is the way to start as an appetizer.\nFor main course I ordered #2 the 5 wings and fries with a choice of sweet and spicy 🌶️ 🌶️ as a sauce.\n\nService was super sweet and very kind. Good music definitely a vibe. If you around Austin st in queens pull up!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdFozSVpBEAE",
            "text": "I would say it was good experience in this place. It’s kind of new place so I decided to give it a try. We ordered chicken wings and decided to try the clam chowder soup.\nThe manager was kind enough to change my soup since it tasted weird when we first got the plate.\nWe also had some chicken wings which were good.\nService was good I will see what happens the next time I’m around."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaUs2VEdnEAE",
            "text": "This is a cool place to have a yummy bite, I had the crispy chicken bowl and it was very good, I also had a Soju Lada drink and it was amazing, I loved it! The only thing I didn't like is that the music is too loud, a little lower would be good.\nUpdate Feb 2023: I came back after a long time, this time I had the spicy crispy chicken sandwich and it was really good! And spicy!  My friend had the nachos and they were very tasty as well. The sojulada is still amazing! Highly recommend"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaTZHOTNBRRAB",
            "text": "Being born and raised in Queens I have been going to Mad for Chicken for years. Chimaek is in my blood and I could always trust MFC to satisfy my latenight cravings closing at 11:30.\n\nUnfortunately I came here with 6 people and the daily special was refused as it was the day before Thanksgiving Eve….\n\nVery weird, been coming here for years and this never happened. Pelicana’s original chicken looking pretty tasty right about now ifykyk."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMjUtVnJRRRAB",
            "text": "This spot is an amazing vibe on Austin St. I stumbled upon it with a friend of mine and I was not disappointed. They serve you a bowl of yummy complimentary popcorn while you wait for your food, how cute! I have to say the BURST of flavors are devine. I got the Crispy chicken bowl - the Korean noodles were incredible. The mix of guacamole and bbq had me nervous at first, but once I took a bite it was actually really good. I love how creative the food is there. We also got the kimchi fries which I forgot to take a photo off because we literally stuffed our faces as soon as it came out. It was FIRE! It def has a kick so warning if you don’t like spicy. They have excellent kids options as well, my daughter loved their chicken bowl. I can’t wait to come back to Forest Hills and eat here again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNnNQNEhBEAE",
            "text": "Having Korean fried chicken in Forest Hills is nice, and this is one of the few places that does it here. The kimchi fries was decent but I thought the kimchi was a bit lackluster. The scallion chicken was a huge portion, much bigger than I expected. It was fried well and was very crispy, but it was a bit dry and became a chore to finish as we got full. Regardless, this spot hit the itch for Korean fried chicken. It gets very busy here on nights and weekends, so make sure you get here before the crowd does!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobHJhcDJnRRAB",
            "text": "Soy garlic wings were delish. Japchae and rice bowl was on the sweet side but  enjoyed the truffle fries. They were crispy and airy.\nStaff is friendly and service was good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMU82TFFnEAE",
            "text": "Food itself was overhyped and bad. Crispy chicken bowl had too much barbecue sauce and little chicken; just 5 tiny pieces that wasn’t crispy and tasted bland. Mac with melted cheese was also bland and was small in portion. However the restaurant was clean and the staff was friendly and attentive. The management should provide them with trays or a trolley to deliver the food because it gets pretty packed. Hope the staff is paid well and rested well because they’re the only good thing about this overhyped place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobTZmM3pnRRAB",
            "text": "It was nice and empty when we got there, and started to fill up on our way out. The service is fast, and they're super kind! Food is so delicious, and I love that they give you a mini trash can (metal tin) for the bones. Will be going back again for sure!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OXFLV213RRAB",
            "text": "Nice vibe, good for game watching. Chicken wings are good. I always go for soy, even though I have very high tolerance to spice and always order extremely spicy food but I do not enjoy MFC’s spicy sauce. And I wish they bring back sweet potato fries to the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcXNTbTB3RRAB",
            "text": "I went here with a group of friends on Saturday during lunchtime. I got the avocado chicken sandwich and my friends got some wings. The sandwich was good and so are the wings. I definitely recommend this place to any chicken lovers out there who are craving good, satisfying chicken."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdjd1UEtREAE",
            "text": "Please hire more help!!! They only had one waitress working. The food was cold.  The Bay Ridge location is much better."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldm8yZk13EAE",
            "text": "Always good and relaxing, low key atmosphere with great service. No matter what you order, the food is always on point. You will not be disappointed. Please try their lychee soju drinks!"
        }
    ],
    "reviews_count": 75
}