{
    "name": "Aged",
    "place_id": "ChIJobxb2iZewokREMCvwQz97UE",
    "grid": "QN6",
    "address": "107-02 70th Rd, Forest Hills, NY 11375, USA",
    "rating": 3.9,
    "user_ratings_total": 1348,
    "phone_number": "(718) 544-2976",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTVVXNTBZV2d6Ym5OaldUZFJiVlpWVEhVMFluYxAB",
            "text": "I brought my family for lunch yesterday and we didn’t have a great experience . I find that when gratuity is including at 20% the waters don’t care . For the prices in there this experience should be 100%. We found hair in the food, asked to speak to a manager and was told that there isn’t a manager there .  How are they running a Resturant like this with no manager .\n\nI called back today to speak to a manager and was told that there isn’t a manager on duty.\n\nI paid almost $500 for brunch for four people . I would think that the hair in the food would be addressed but it wasn’t . We have two Resturants and would never treat our customers like this .\n\nI’m not one to dispute any bills but this matter needs to be addressed ."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNWQxTjFUa3BDYUdKRlZWZGFibE40UlcxV1VXYxAB",
            "text": "The ambiance of the restaurant is nice and the food was good and the service in general was nice. However, we were a group of 4 and the tip was pre-added, and that was not nice. Especially because for good service we always leave minimum 20%. Additionally, they add a credit card surcharge. Additionally, they brought us an item we did NOT order and sent it back. Then the waiter brought it back and said we \"can have it\" while he brings the correct order. Yet, he charged us for it!!? We were also there celebrating a birthday and a complimentary dessert was not brought out for the birthday person. It's little things like this that can really leave a sour taste in the paying customers mouth and reduce the rating of the restaurant. It's the way things are handled that make it a non luxury experience. We did not complain or make a fuss, but we will not return."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaUplYmdRRRAB",
            "text": "Great steak tips with chimichanga sauce. And excellent drinks. Service good too."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWU2RqaFlUV1UzY1RZMWVsVkViVlZDVmxWc2FtYxAB",
            "text": "Came here to celebrate my father in law’s dinner. Wish we went elsewhere. The quality of food and service has significantly got down. DO NOT EAT HERE!!\nRude. Flavorless. Disorganized. Incorrect. Lost. Tiny portions too??? Sooooo disappointed. Like how do you mess up truffle fries?!?!?! I’ll tell you how get a frozen bag of French fries. Also they have a prefix 3 course menu, but didn’t offer it. WE HAD TO ASK TO SEE IT?? Also needed to ask for more water refills."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPb29lUy1BRRAB",
            "text": "The quality of this restaurant has really decreased over the past few years. The food isn't terrible, but it's ridiculously overpriced for what you get. I could have gotten better food at Applebee's. Nevermind that they include an 18% gratuity on the bill."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WQmExcFhkVzAzUTB0YWJXUXRlWFpZU2tWaVZtYxAB",
            "text": "So I went here to celebrate my anniversary with my wife and my son. We are from Queen so we decided to go local for a celebration instead of going to Manhattan. But I would have to say  it is convenient because it was close to where we  live but what was disappointing was the actual steak . If you consider yourself  a steakhouse, your steak should be the best thing on the menu. Which I was sadly disappointed. The prices were extremely high for what I received . when I ordered a steak medium rare. It came out medium wall. I had them redo it, and when the steak finally came out it looked like I bought it from a regular local grocery store. There’s nothing premium about the steak at all, but the fact that it was small and it was $65. I’ve been to well established steakhouses that paid this price or even or more and the steak was immaculate. I’m definitely not coming back to this location. I feel like the prices are way too high for. what you receive"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneFZtbHBOa2hHWW5SaVYxaHVjMUJyVFc1alZHYxAB",
            "text": "Really good food with great variety and friendly staff!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSE5FUlpPVWQ0YlV0aGIxazVaMGx0VTBsT01sRRAB",
            "text": "Ordered the ribeye and branzino, it was ok…but should’ve taken note of the 3.9 ratings here. Wouldn’t recommend - creamed spinach was sour and we sent it back. They even charge a credit card service fee…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGc1RYTndlV290TjBOMGRWVXlka2huVEZwNFRHYxAB",
            "text": "I have passed this place a few times and actually planned for this visit with a group from work for lunch. The waiter was excellent. He was patient when taking orders for a table of 7 with three checks. We ordered from the $20 lunch menu which was a pretty good value with a starter and meal. Portion was good for lunch. I actually had enough to take for later. The only thing none of us liked was the steak on the menu was an additional $10 which we felt shouldn't be an option if not in the $20 price point for the options. I had the chicken pasta with pesto sauce which was tasty. We sat outside and the water assisted us with the table placement so we could all sit together. The chairs weren't all that comfortable but it was nice being outside. I would return if in the area again."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNF9MOWtnRRAB",
            "text": "It was wonderful experiences gathering with my family members to dine at aged House everything i enjoyed like a home, we will back soon service food really Awesome."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeldtYzRiRzFFVVhBdE5HWkxSamN3UkVKbmEzYxAB",
            "text": "It’s was wonderful experience , foods and drinks service was amazing I like this place my family also enjoyed it. Hope we will get back.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neFJUTjVRekZqWmxwUFJGbFZSV00yZGtSSlJIYxAB",
            "text": "It was tremendous and nice environment, quality of foods I am really enjoying I should come back and visit again soon."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeXM3OHBnRRAB",
            "text": "Aged was one of my favorite spots on Austin St, and as of my last visit, I am extremely disappointed in the service and quality of food. I stepped into the establishment before two other people, as I walked up, the server looked past me at the two people behind me smiled and seated them, like took them to a table, and handed them their menus, then looked at me confused as I said I was before them, I smiled and said maybe you didn’t see me, just one, he waved his hand and told me I could sit anywhere so I walked over, he later brought me a menu and asked if I wanted water after he asked the two people he sat before me. He order my food and a drink. My appetizer was decent, but the main course is where I had trouble. I ordered the filet medium well, which comes with asparagus and mashed potatoes. My food came rather  quickly and all was well until I took my first bite into the steak, as soon as I brought the fork to my mouth I could tell something was off! The meat smelled as if it were covered in urine! Upon closer inspection of it in the dim Resturant I could see it was covered in some kind of liquid who knows what, I didn’t make a scene in the restaurant, I only said that something was off about the meat and I’d like it taken off my bill which it was. I am so disgusted and disappointed by this experience, I don’t if the meat was tampered with or spoiled. I have never had this kind of experience in any establishment before."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paU09VSnBUME16YjJKcVVsaFNkbGxZWjBkU1kzYxAB",
            "text": "Lovely spot on Austin Street!\nGreat place to meet friends and relax. We had a tasty Caesar salad, crispy fried calamari, and refreshing wine and cocktails. The staff were so friendly and welcoming . They made us feel like old friends. Definitely a place I'd come back !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRlNrWkhYMUV5U1dsUE1VRTNZazQ0WTJwTWVXYxAB",
            "text": "this place is really amazing for the plate night time or afternoon really love the steaks and the mac and cheese i recommend this place 100%"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1S1RUUndhR0p3YXkxNVJsZzRhM0ExVlVoWk9IYxAB",
            "text": "Great atmosphere, not too noisy!\nPerfect way to end the day,with American meal and cocktails.server was too polited and professinoal.Highly Recommended  this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVFdsVkxTMTlTVTFobWQwRnNaR05KYWs5SVUxRRAB",
            "text": "We didn't think much of the menu and we were going to leave.  But the waiter sat us, and we got our first drink and decided to stay.  The food was out of this world.  Ceaser salad and Buratta appetizers were perfect, but the steak(Filet Mingion and Ribeye) was amazing.  I didn't expect such deliciousness, but it was the best meal we've had in a long time, with perfect service.  Recommend in a heartbeat."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eldtbElWRUUxTkVNMFJXNU5Ta1JmTVZGaGVFRRAB",
            "text": "My son and I stopped here for a quick bite before going to a concert at Forest Hills Stadium. The place was lively, and the cocktails were incredible...but even though there seemed to be adequate waitstaff, our server was not at all attentive, and in the end, rather than ordering more drinks, we asked for the check and moved on. Too bad because \"the Royal Treatment\" was an incredible gin cocktail, and I would have enjoyed another round!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeWFWOUxTMVppV0V4MlNFNUJVSEUzYURKR1ptYxAB",
            "text": "Service and atmosphere were both great. Plating was very nice as well.\n\nEvery bite of food lacked seasoning. Truffle fries, filet, rib eye, mashed. We ended up taking most of our food to go so we could reheat at home with the proper amount of salt. The creamed spinach had a broccoli like flavor but was good.\n\nBased on food alone, we wouldn't return. Add in the $240 (after tip) bill, and I left embarrassed to have selected this restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSlFWbFpTVkF6ZVZwTE4waGtiamczUVhZemVGRRAB",
            "text": "Came here for dinner with a friend on their recommendation.   All food we ordered was good, I personally thought the burrata appetizer was delicious.   The crab cake was tasty, and it is mostly crab (which was excellent), but I felt for the price of $24 it was a bit small for that price.  Both my friend and I ordered steaks, her's was a touch over cooked as she wanted rare, mine was well cooked as I asked for medium-rare.  I really enjoyed the overall ambiance of the restaurant.  We opted for the outdoor seating as it was a gorgeous, cool summer evening.  I'd recommend this as a solid place to take a date as the establishment was great for having conversation, wasn't too loud at all."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcFdGaFZkRVpJVGt3d09XdE9TRmt0YjNCd1NHYxAB",
            "text": "For a steakhouse it isn't amazing but it would get the job done. Service was good, not amazing but the waiter was attentive and the food came out fast.\n\nFood was a hit or miss, apps were just OK. The Salmon was tasty, the Ribeye was good albeit chewy and under seasoned, definitely needed the sauces it came with. For sides, we ordered the mash potatoes and creamed spinach, the creamed spinach had an unexpected flavor that threw me off.\n\nWe came during the hottest days and the AC was barely on. It was uncomfortably toasty inside.\n\nI'd give it another try eventually but for our first visit, it was too pricey for the quality, let alone the $4 credit card charge on a $160+ bill."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMmFta3lObFpDTFZKM1gwUlFiWEZhVFZkT1FWRRAB",
            "text": "Staff and servers are great food maybe not so much. First off for a place calling themselves a steak house they only had 3 steaks, I ordered the filet mignon medium rare $55 dollars. Came medium well , dry and unseasoned which a good steak doesn't need anyway but this wasnt. Sides also came undone and off for a steak sides. Feel like they took advantage of the neighborhood being the only steak house in a busy area with alot of other great places right next door."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWlRWWkVOWGRoTWtSUGRtVmxWMk5mVkZNeFZGRRAB",
            "text": "Most excellent and well prepared restaurant with excellent accommodations associated with productive service professionals. The menu indeed had many special meals and was selectively well prepared."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNGRYWm5UMlJSUmxrMmRIY3pjVW94YjIxaGVWRRAB",
            "text": "It was great exprince."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbGFrVmFVVE5OZFdWUFlXbE9aMnRZY0ZScWIxRRAB",
            "text": "I’m not a big stake house 🏠 guy but this is was by far the worst I’ve ever been too .. it’s a beautiful restaurant, however the food was mediocre."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaGRsVllZbGd0YzJGQlJVZ3dUbm80ZFZvdFNuYxAB",
            "text": "Skirt steak is great! Desserts on point too. A bit pricey but worth it for a nice date night."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVlVtdEhkVzlhWHpNNVFUQjZUM1pRT1RaQlJIYxAB",
            "text": "Absolutely beautiful"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMGQwdE1hSGhJUVcxV1V6RjRWVEE0T1VzNGQxRRAB",
            "text": "I've been here before it's my third time. Food is good but some of the steaks are pricey."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTWNXZE9aekJxY1RGcWF6VkVhREpxVmpOVGJXYxAB",
            "text": "My daughter was at Citiield for a concert and my wife had never been on Austin st...We are from Monmouth County NJ....Happened upon this place and it was after 9. Burgers were amazing. Calamari was tender and cooked perfect. Our server was polite and did an overall great job. Def recommend for a nice meal, especially when its nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTWJFaGlkREpWTlVnemRqY3dZa0Z4ZG1WU1owRRAB",
            "text": "Aged is a true gem in Forest Hills—elegant without being stuffy, and consistently satisfying across the board. The steaks are top-notch: expertly aged, perfectly cooked, and full of flavor. I highly recommend the ribeye or the filet—both melt-in-your-mouth tender.\n\nThe atmosphere strikes a great balance between upscale and cozy. It’s ideal for date night, special occasions, or even just treating yourself to a great meal. The appetizers are also excellent (don’t miss the crab cakes or tuna tartare), and the sides—especially the truffle fries and garlic mashed—complete the experience beautifully.\n\nService is professional and warm, with a staff that clearly knows the menu and makes thoughtful recommendations. It’s not the cheapest spot in town, but the quality justifies the price. It can get busy, so reservations are smart, especially on weekends or holidays.\n\nIf you’re in Forest Hills and want a reliably excellent steakhouse experience, Aged delivers every time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKakMwZVNrMXNEcUxnEAE",
            "text": "I wish I could give them negative stars very very very bad"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNbVA5dUxHemVqdFlnEAE",
            "text": "Only got 3 stars because of the friendly service. The macaroni was disgusting. Smelled like rotten vinegar…. tasted bland.\n\nThe sweet chili wings also were subpar and were barely cooked all the way. Overall very disappointed in the food here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLZnUzNmpRM3JuR1lREAE",
            "text": "The steak was so good! The fresh fries instead just ok."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMGRtTnVhVVpGWTNsd2FsUkphbEJSZUcxWVduYxAB",
            "text": "We reserved place for 12 people during lunch time, and they had people too, for whole place only one server, he also was a barman at the same time. That was insane waste of our time. Food so. I got dirty utensils, not just dirty, but not washed completely , with food leftovers on the fork.   This place is getting down"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPMlRwdWJDb1BINkpnEAE",
            "text": "People were very kind but food awful & not worth the money."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPcndpX3VzNjZXaWZ3EAE",
            "text": "Every dish was undercooked and had to be sent back. This included the French onion soup and steak. When I commented to the manager, she literally said, yes we know the chef isn't very good. Steak was too fatty and everything was over salted as well. Waste of time and money, plenty of other options around."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKMmtwSXlPZ1pLYVJBEAE",
            "text": "This is my first time visiting aged.we were there to celebrate my daughter 's 45th birthday. The staff was very nice. They sat us quite quickly. Very impressed! The waiter gives us our menu and water. He asked us if anybody wanted anything to drink as he was taking our drink order. My grandson Cameron had asked the guy that he wanted the macaroni and cheese and the waiter abruptly tells Him this is just a drink order. Now as the waiter takes our food order, I had ordered a filet mignon rare. I told the waiter I wanted it bloody as I received my order. The portion was very small and my filet mignon was not cooked properly. It was cooked well. I had to call the waiter over to take back my food so they can get it correct at this time my grandson Cameron had to return his Mac with truffles cuz they put way too much truffle oil that it made the macaroni and cheese taste spoiled. The waiter does take it back and gives gives Cameron another bowl of macaroni and cheese with truffles this time they put the truffles on the side. I'm waiting from my steak to return back to the table. By that time my family was almost done with their meal. My only one complaint is if you're visiting a location for the first time you need to make sure as you're taking the order  correctly cuz the old business saying you only have that one time to make a good impression. Thank you"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJM2gtdnprOHRicV9nRRAB",
            "text": "Tasteless food and overpriced."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbUxhS1J3EAE",
            "text": "Now restaurant with indoor and outdoor seating. Ribeye  Steak was cooked to order"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdDd6LTBnRRAB",
            "text": "The food was tasteless, we found hair in the potatoes but it wasn't taken off the bill until we asked, they wanted to charge us 20% tip without warning, The food was generally tasteless, the beer was good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbmFTTlpBEAE",
            "text": "Perfect place for brunch, the steak and eggs are absolutely the best one so far for brunch. The platter doesn't need anything but to be eaten . Bloody Mary's are great. I personally don't do reviews, but this one deserves it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM0ppdEF3EAE",
            "text": "My husband and I had a delightful brunch here!! We would definitely come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcjdqZFpBEAE",
            "text": "I dined in on Easter Sunday. Calamari was cold. Food was good. Bathroom was filthy."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaWZqZWpBRRAB",
            "text": "The service was really good and atmosphere is great. Place is beautiful and plenty of space. We had the tuna tartar and calamari. Both were great especially the calamari with the spicy kick. For dinner my wife had the half chicken that she says was really good. I had the ribeye, I did not like the steak. Meats was meh and char wasn't good. More medium than medium rare and extra fatty."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNXJ2QXZnRRAB",
            "text": "My friend and I went on 4/15/25. We ordered and shared the caesar salad and the burrata for apps. She had the skirt steak, I had the filet mignon. The entrees came with sides and we order an extra side of creamed spinach. We also split a lava cake for dessert. It was all delicious!!  I highly recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcnB5ZF93RRAB",
            "text": "Ordered skirt steak and filet mignon medium rare. Both were dry. Place needs upkeep as well."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMHViZ29RRRAB",
            "text": "The steak was acceptable, and I had a side of mac and cheese that was surprisingly good I'd visit again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aHZUcExREAE",
            "text": "Chef Laguno is here, and the food is absolutely incredible! We had the lamb chops, and they were cooked to perfection—tender, flavorful, and just the right amount of seasoning. The pan-roasted mushrooms were my personal favorite; I could seriously eat them every day! For dessert, the crème brûlée is a must-try—perfectly creamy with a beautifully caramelized top. If you’re looking for something lighter, the grilled chicken sandwich is also delicious. And don’t forget to stop by the bar—Abraham makes amazing drinks! Highly recommend this spot for an unforgettable dining experience!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NHU3T3ZBRRAB",
            "text": "I recently had an amazing lunch at Aged in Forest Hills, and it was all thanks to a familiar face—my favorite chef, Lagano! I’ve been to Aged before, but when I happened to recognize Chef Lagano while passing by, I knew instantly that this was where I needed to eat. As a foodie who loves exploring different restaurants, it was such a joy to reconnect and enjoy the comfort food I had been missing.\n\nThe meal was nothing short of exceptional—every dish was crafted to perfection, just as I remembered. The flavors, the presentation, and the quality were exactly what I was craving. On top of that, the service was fantastic, making the entire experience even more enjoyable.\n\nFinding my favorite chef closer to home is a win, and I’ll definitely be coming back. If you’re looking for great food and top-notch service in Forest Hills, Aged is the place to be!\n\n⸻\n\nLet me know if you’d like any tweaks!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRZ2FXQllREAE",
            "text": "Yeah no."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMzhxRGRREAE",
            "text": "The server was exceptional. The decor and ambiance of the place were welcoming. It was quiet and peaceful. The background music was set at a delightful volume. Indoor and outdoor seating is available. Parking is hard to find in this area. The food was delicious and well portioned. The fries were slightly over salted but otherwise enjoyable."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcGJxNnl3RRAB",
            "text": "I had a perfect birthday here! The atmosphere of the restaurant was amazing, and the food was delicious, especially the appetizers, which my friends couldn’t stop praising. A special thanks to the manager Mr.Naresh, for his help in fulfilling all my requests. I will definitely come back next time."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOWItUkh3EAE",
            "text": "This place is such a hidden gem and I will be back. My partner and I came here on 01|01|25, the food was amazing as well as the service. Each staff member that we encountered while dining there was very attentive and made sure everything went well. Thank you for an amazing experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdi1QMWFnEAE",
            "text": "We made a reservation and got seated on time. Service was good, attentive, and professional. We ordered an appetizer that was served fairly promptly. All the food came as ordered. I had a ribeye, which was delicious. The mashed potatoes were awesome. The salad was not special. Service could have filled water a bit more often. The ambiance was good. It was tight seating but not overly cramped. I'm a bigger guy and was fine. One distraction was that there seemed to be multiple servers at times. One girl asked about drinks, and another came a bit later to take the order, and yet another brought the bill. It was a bit confusing as you didn’t know who to ask for anything. All in all, it was a nice experience and we would return. As far as the bill, expect to spend between $50 to $100 per person. Not an every night meal spot but nice for a special occasion."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmM1A3YVVBEAE",
            "text": "If you want a steak house, this is not it.  Unfortunately, this neighborhood doesn't have a steakhouse.  The place is tiny, uncomfortable seating and below what's expected for a restaurant in this price range.  Location wise is great, but for any fan of an \"American style\" steakhouse, this is a heartbreaking spot.  Some of their sides are shamefully small and below average and their mac & cheesy is shamefully executed, watered down elbow pasta with a hint of cheese in a soupy liquid.  Stay away from their seafood soup, it has to be the most confusing thing they have there.  For one reason or another, someone thought that making a spicy broth with a handful of veggies and a hint of lobster with the would justify a $13 price tag on a tiny soup bowl was a good idea. YUK, and maybe someone should tell the chef that heavy spices is a no no in an American style steakhouse.  If I wanted heavy spices I could have walked\nTo half a dozen spots in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbDRQWk5BEAE",
            "text": "I really enjoyed this place. From the time we walked in Sebastian catered to us. We requested to be reseated because it was very cold. We ordered a bottle of Riesling as our drink of choice. French onion soup as appetizer (it was amazing) and the Lamb Chop as main course. Everything was so delicious. Sebastian checked up on our needs, Khalil made sure our glass was always with wine and had great conversation. We definitely enjoyed the service and food at this restaurant. Very personable and intimate."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNy1feXd3RRAB",
            "text": "Food and atmosphere was good. Filet mignon, burger and the half chicken was very delicious. We shared calamari, caesar salad, ceviche and burrata. Skip the ceviche it was just ok. Everything was good. Service could of been better. Wasn't busy at all for dinner. Some how our server spilled one of the cocktails on our guests. We moved tables. He seem nervous for the reminder of the evening. Didn't come to offer to refill beverages like wine or cocktails from our guest empty glass, had to flagged them down. Don't even think they compensated us on part of the meal."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbmN2ZkRnEAE",
            "text": "Took my family for lunch after my Son’s middle school graduation. The place is very nice & beautiful. The people are very nice. I don’t eat steak so I can’t tell how it is but my seafood pasta was amazing. My family loved the food & place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dVBXcVJ3EAE",
            "text": "I enjoyed this place very much. I had a very melo experience. As you can see we sat outside to enjoy the weather. For 2 people we paid $157 plus we tipped pm the side.(not included). We had 3 drinks , 1 appetizers each and 1 entrée. The bread the first gave to us was very soft , warm, oh I forgot tasty. I got organic Chilli chicken wings. It was good, just wished it was more spicy. I got lamb with potatoes which came together and omg it was yummy. The ny stake was also tasty. I enjoyed their service and the wait was not long. Got a table as soon as I walked in. The food and everything came fast. They even help you pack your left overs up to take. It was worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3eEt5dEZnEAE",
            "text": "Everything just tasted average or salty, especially that French onion soup just full of salt, it's like the whole purpose of their menu is to have diners order more drinks to cleanse the saltiness away."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNFBpMGpBRRAB",
            "text": "Purchased a Groupon deal for 2 and absolutely enjoyed it.\n\nI ordered the baked clam and filet mignon. It was sooo good! Tres bien!! 💕\n\nI love the sauce on the baked clam it was so good. I definetly will be back for those.\n\nThe Groupon dinner deal for 2 includes: 2 appetizers, 2 entrees, and 2 desserts.\n\nThe chocolate lava cake was just right ! Absolutely delightful.\n\nIt was very easy using the Groupon deal, just show the waiter the deal and ask what you can order.\n\nAt the end you have to pay tax + tip. (Both based on original price of what you ordered & automatic 18% tip).\n\nOverall, very satisfied and was super full. Will come again with family!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlb0tqNzBnRRAB",
            "text": "Had a very nice dinner in this restaurant. The ambient is perfect for a dinner. The food was great, very tasty. And the customer service was impeccable, even put candles for the occasion."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOXMzM0ZBEAE",
            "text": "The steaks were amazing as always , we come for every birthday . We had the crab cake appetizer, skirt steak , ribeye both cooked to perfection with truffle fries and mash potatoes . For my birthday they got me a small lava cake with a candle and sang to me . Great experience Ily Our Server helped us out"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxOHJpdnN3RRAB",
            "text": "Overall Great Steakhouse!! Service was amazing 👏 For the appetizer we had the 🦀 cake which was 🤤. My girl had the skirt steak and I had the bone in Ribeye both were great! All their steaks are aged for 20 days, we had it with mashed potatoes, creamed spinach and truffle mac n 🧀  😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsOGV6eE9REAE",
            "text": "Anniversary dinner. Food was very good and place is beautiful inside. However we told waiter it was our anniversary 4 times and not once did he congratulate us. Meantime three tables were there for birthday celebration and they got a song and cake. I was a bit disappointed. Not sure I want to return."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJX3ViZFdREAE",
            "text": "Went here on a whim with my girlfriend and I wasn't disappointed. I ordered the Atlantic Salmon and Baked Cauliflower while my girlfriend got the Shrimp Scampi. It was so delicious. Our waiter Victor was very attentive and nice. The maitre d' came over and filled up our glasses and checked if everything was alright at our table from time to time. Hard to believe this was in Queens! The atmosphere is incredibly romantic. Dimly lit candle at every table. The bar area is incredible with a huge selection. I loved everything about this place from the food to the decor to the music to the service. It's a little on the expensive side. The main dishes are about $30-40 but it's worth it. I need to come back and try the steak. Thank you for the great date!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzbXZDdGtBRRAB",
            "text": "I planned a company event here for Valentine's day. It was a disaster. Our reservation was for 930pm we didn't eat til midnight. The steaks were cooked poorly. They gave us the wrong menu, messed up drinks and grossly over charged us. We…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSM3VLQnBBRRAB",
            "text": "Came here for a nice evening out with a friend. Food and service were both good in a nice relaxing atmosphere. It's a weekday, so it wasn't too crowded.\n\nWe had the calamari as a starter. Flavor was really good, but could be more crispy. Calamari also had these fried jalapeño peppers.\n\nFor entree, we did the Mahi Mahi, short ribs and roasted cauliflower. All were delicious. My friend loved the cauliflower.\n\nMahi Mahi with baked clams was seasoned well and delicious.\n\nShort ribs was cooked perfectly, tender and juicy on a bed of carrots and mashed potatoes.\n\nWould recommend this place and go back and try their steak."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzaWE3Rmt3RRAB",
            "text": "My wife brought me here for my birthday dinner. We had a 3 course meal which was very good especially the crab cake was delicious. I would recommend any one going to this resturant to try the crab cake. The service was 5 star and excellent. I would go back again and recommend friends and family to go."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1enNLOGN3EAE",
            "text": "We came here for dinner on Saturday and had a great experience. The staff was friendly and the waiting time for the drinks and food was fairly quick. We ordered a NY strip and chicken Alfredo pasta. Overall the food was good, but the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyb1ktWWxRRRAB",
            "text": "Food is amazing very delicious and fresh, taste so good American Cowboy Stake was perfectly cooked and pasta delicious too nice job chef 👍🏻. Stuff need to learn come more often and ask customers if they need anything, they keep passing our…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDODRqaXZBRRAB",
            "text": "Very good. The food was on point; No complaints there. The prices were slightly high given the fact that we were dining on the street and it was cold and windy outside. Pre-covid, we were all able to dine in and get the full restaurant experience all of which is generally reflected in the price. In these pandemic times, we are not able to experience the interior where the ambient would have been more quiet, nicer and much warmer thus it does not justify a bill over 100$ for two people without drinks. The wind and the car exhausts weren't helping either. Thankfully we didn't experience a garbage or cleaning truck pass by.\n\nAs for the food, the steak was perfectly done. I aked for medium well and couldn't have had it any better. It was served with mashed potato and garlic on top. The consistency of it was outstanding.\n\nThe truffle mac and cheese was perfect. From the amount of cheese to the texture on the top; it was just beautifully executed.\n\nThe salmon was cooked to perfection. Seasoned perfectly. The outside slightly crunchy from being fried and the inside still glistening with its juices.\n\nWe had ordered a clam chowder soup prior. It had a very welcoming taste. The texture of the creamy soup was on point. The amount of seafood in it was perfect.\n\nOverall the food was extra ordinary. Once the pandemic dies down this is hands down one of the best places to go to for the quality.\n\nThe price just barely meets the quality. Slightly lower prices would be appreciated.\n\nP.S $4 for a thin, small glass of Coke Cola with 70% ice is not worth it."
        }
    ],
    "reviews_count": 72
}