{
    "name": "Nick's Bistro",
    "place_id": "ChIJVeH-jBtewokR9ZsFO83CeQs",
    "grid": "QN6",
    "address": "104-20 Metropolitan Ave, Flushing, NY 11375, USA",
    "rating": 4.5,
    "user_ratings_total": 1270,
    "phone_number": "(718) 544-6425",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTWN6TXRkVzQwUWw4dGVUazFaMHRQYlhOa1kzYxAB",
            "text": "Good drink and food well recommended they don’t take Apple Pay FYI"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MFoxSjRkSEkwYWtKS1RXaFpXa3RxTW5oclVrRRAB",
            "text": "My friend, whom I am staying with raved about this place so I had to go with him. The food was super tasty and it’s not overpriced ..\n\nI would definitely go back …"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMVUyWjZkRFJZUlhWa01rbzFjRGxyV0c1b2NuYxAB",
            "text": "Had the Fra Diavolo, the mussels smelled like manure and tested awful.  Very disappointed.  Would not recommend."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaFpsbFZTRmxrZUV3eVprcDRRVGRPUm05RVEyYxAB",
            "text": "Food here was amazing, we started with the stuffed grape leaves and the avgolemono soup. Perfection. But then we had the main courses (a pork souvlaki platter along with a lamb gyro platter), which, unbelievable, topped that. The meat was tender, moist and juicy; in comparison to other restaurants, you can tell this was made with quality ingredients and homemade with care. We had the pleasure of meeting Dillon and Diego, who took care of us. They were absolutely awesome.\n\nWe love going to restaurants as they are places where we can make memories and share experiences. This was that and much more, as both Dillon and Diego treated us like family.\n\nYes, this restaurant was that good, make sure you find yourself here.\n\nNick’s Bistro, thank you so much!!!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoblh6QnhXV3BHY2xvMlIwVnFTRzAyWlVOWVUyYxAB",
            "text": "I ordered the lamb burger expecting something flavorful and unique, but it didn’t taste like lamb at all. The patty was pale—more like veal or a beef blend—and completely unseasoned. The texture was fatty and lacked the richness that defines real lamb. Surprising because the first time I ordered the lamb burger - it was named Nicks burger- who makes the patty with so much parsley, it was really good. But the lamb burger yesterday tasted bland and so disappointing.\n\nThe only thing I enjoyed was the brioche bun. My onions were undercooked, and even after asking for sauce, I was given A1 steak sauce, which didn’t complement the dish at all. I had considered adding mushrooms and was told it came with cheese, but it had this block of feta, so dry, unseasoned- weird.\n\nOverall, the service felt rushed. The dining room is excessively loud and even though they checked if I was satisfied with the meal, you know it's more of a formality. Then they jumped straight to offering dessert. #wheredidnickgo"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVelVWZzRhSEo2YUhJMWFGZEhjbUpTU1RCYWNuYxAB",
            "text": "Great neighborhood spot! The food is always fresh, service is friendly, and the place feels cozy. Definitely one of my go-to restaurants in Forest Hills"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaldVVkZSMkpzVVcxemQwRkJiRmcwU1hsNVVsRRAB",
            "text": "So disappointed!!! I just tried out their new family package through Uber eats while I have guests, which says it is supposed to feed 4 to 6 people. The 3 proteins received in this package arrived nearly EMPTY while all the fried food and…"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wclJtRnJUM1pvWHkxM1EyeEZUbkpzVUhSRFpIYxAB",
            "text": "We’ve visited Nick’s Bistro many times, and every experience has been absolutely wonderful. The food is always fresh, flavorful, and beautifully presented — from the tender grilled meats to the delicious seafood and authentic Greek dishes. The staff are warm, welcoming, and make you feel right at home. The cozy atmosphere and consistent quality keep us coming back again and again.\n\nTruly one of the best neighborhood gems — a perfect place to relax, enjoy great food, and share special moments with family and friends. 💙✨"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnN09YNGtnRRAB",
            "text": "Great food always"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQ1RrNUVNRTlrTmt4QmRYQnlPVzFMUWsxcVpIYxAB",
            "text": "Great food amazing place !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMlQwdFhMVzVDZG1Kc1kwZHdkWEp3T0VVNWJFRRAB",
            "text": "Good employee good mangaer good boss kitchen staff everything"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNmVGcEtlbGg0YkVSUlgwNU5kRmx4YTJnNFNGRRAB",
            "text": "They had a stand at Forest Hills Stadium and the food was overall really sub-par.\nFries were lukewarm, and then the next batch of fries was overcooked with no flavor.\n\nThe lamb gyro i had was also sub-par.\n\nSadly this was 30 dollars all-in."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ndE5HaGlabWxXY0VJelMyTmlZVGhxZDJkWFMyYxAB",
            "text": "Great food and great service highly recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeWNrVlhlR3d6YXpSVWMxbEthVEZSVlVaME1rRRAB",
            "text": "Chicken souvlaki and quinoa falafel very good. Hummus and Greek salad just ok. Service was slow and not very attentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSM1dXRTNkSGRRWVRSbmFXaG9UVkowWldSUU1VRRAB",
            "text": "Nice place, fresh food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdU1HRlFlV1ZSU0ZoQk5VWnhTa0YyZFhKc1dsRRAB",
            "text": "This place is GARBAGE! Don’t eat here! We ordered Chicken Francese it was 2 FRIED cutlets that tasted exactly like that! Fried! No lemon just 2 thick Fried Cutlets that tasted as if they used day old oil to fry the cutlets. I also ordered a chicken parm Panini and the bread had GREEN MOLD ON IT! Stay away unless you wanna be overcharged for lack luster food that is molded and cooked by a kitchen that is clueless."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ob1NGZFFWbmhmZGpKMmJraElXV1pJWkVOaFJHYxAB",
            "text": "Very tasty and many gluten free options."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNWRucE5RMDFzTFc1SVZEaDFSWEl5VlY5ck1IYxAB",
            "text": "Food is excellent love the Greek salad and lunch specials. They have so many gluten free option including gluten free pita highly recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUWNHUjRSRll4YjFnNWFuRlJXREF4YVc0MFEwRRAB",
            "text": "This was my first time ordering from Nick’s Bistro, and it couldn’t have gone better. I spoke with Diego, who was extremely helpful in ensuring my order was prepared just the way I wanted. The customer service was excellent, and the food was even better. I’ll definitely be ordering again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SVgzTjBWME5HT0hWdFFqSXhhSEJWWlVSaWFVRRAB",
            "text": "Stopped by with family since we were told it's great. They weren't kidding! Some of the most delicious Greek/Mediterranean food I've ever had! Not that I've had a lot - but still!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUVNtTkdWMGwzVG13M1ZqbG5hVTh6VFVabE1GRRAB",
            "text": "Nick’s Bistro was a delightful experience and with great food (large portions!).\nWe got a bottle of Greek white wine which was nice and dry. I ordered the special which was a Talapia fillet - fantastic. My wife got lemon chicken dish with a side of roasted broccoli and cauliflower.\nFor apps can’t go wrong with a side of spicy feta and hummus! The crab cakes are also phenomenal.\nFor dessert we tried the Banana bread-Nutella alla mode which was surprisingly delicious.\nOur waiter, Dylan, was funny and made excellent recommendations.\nThe restaurant can also do a decaf cappuccino, though I recommend the high quality espresso.\n5/5 will be back again soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsZlpWbGZNRlpOUTIxdWJ6bHJUVUZuZW5GemJsRRAB",
            "text": "A real gem and the food is always amazing. This is actually a destination restaurant in a place you wouldn't think would have very many destinations. If you like to eat Italian food that has flavor, look no further. No need for Arthur Avenue here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTWFtRk5RMjlZWkV4amVXeG9NSHBpZWpSUFZFRRAB",
            "text": "Great place, great service, near movie theater and   ice cream shop Eddie's."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKd05VVTBUSGh3WjNZeE1tRktUR1Z1VVdwM2MxRRAB",
            "text": "A lot of options on the menu, got a Cesar salad with chicken. Service was great, felt very homey."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR1IxOTZWazl0UlRWcmRUZElSV2hFVUVreWVFRRAB",
            "text": "Small restaurant that provides friendly service. My apricot glazed pork chops were good, but wasn't something mind blowing. The pork chops were cooked well and had a nice crunch from possibly being grilled. It had a nice flavor but was definitely missing something to enhance the flavor. I didn't like the texture of the rice that was paired with pork chop. It was a bit mushy and was seasoned lightly. Members of my party also enjoyed the burger, lemon potatoes, breaded lemon chicken, and stuffed mushrooms. I might want to try other Greek dishes from this place to update the review, but we shall see."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNVRXcHZZbmRIUzJkMkxWSlRSRFJ2TUZScE1IYxAB",
            "text": "Delicious foods n good service! Next to movie theater, good place to grab a bite before watching movie."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RlltRktjelZoWWpFeVlscHdSRzF1ZVd4dE9WRRAB",
            "text": "2nd time coming here. Food, staff and atmosphere were excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OT2VYUkdNakZLY0c1U09XcHdZbVJzZVROdFJrRRAB",
            "text": "Seafood salad is a must"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wd1gyaEVjVVJOUjNWNVVFbHpaMGxmUW1kclVGRRAB",
            "text": "Black linguini with sea food is great"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSamVtbGpVMGsyWlhreU1IUlRTbFJTYkRSTFpGRRAB",
            "text": "Was so excited to try this place with my husband due to the good reviews. We ordered the quinoa falafel for an appetizer which was tasty. For our entrees, my husband got the chicken slouvaki and I got the shrimp saganaki. I did notice that two of the shrimps tasted a little fishy but I drenched them in the tomato sauce to mask the flavor a bit. That was a mistake because I definitely should have said something. That night at home I ended up getting so sick..I won’t go into detail but it was a horrible night, I was even sweating from the stomach pain.\nLike I said, I know I should have said something when I noticed some of the shrimps tasted a little off but the true problem here is that the restaurant served old seafood. For the price that they are charging, the least they can do is ensure that the food is fresh. Needless to say, I am very disappointed and will not be going back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJRG51c2lMMmVPWlFREAE",
            "text": "To quote the chef “I don’t know how the temperature of the steak will be when I take it off” have you ever heard of a thermometer? How do you call yourself a chef? What planet does someone order a medium steak get it bluer than blue then have the audacity to say you can’t control the temperature and it needs to cook more off the grill. You’re not qualified to cook food for gold fish."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOZmVreFRjRkZRWnpaWGJWOUtXR05OVWtWS2NXYxAB",
            "text": "Let’s start with the stars: the grilled Branzino is a must—flaky and smoky perfection. The gyro? A nostalgic bite of the past—juicy, flavorful and tender-hard to find anymore.\n\nBut then came the plot twists. The lemon potatoes arrived with way too much salt, drowning out their usual zesty comfort. And the stuffed shrimp, while beautifully tender, came with a letdown—the menu promised crabmeat, but what showed up was clearly imitation!  You should clearly note this on your menu. Which accounts for the 3 stars instead of 4"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKa2FUVnBiMG95V1dsQ1RsVnRRVFkzV2pSaWRXYxAB",
            "text": "First time and try Greek place as we came back from a trip in Corfu…. Everything was delicious perfect and well served. Thank you guys thank you so much … highly recommend salmon over Greek salad and Athenian filet"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKQ2w1dVhRZ09xejV3RRAB",
            "text": "Came in here randomly because I wanted a nice lunch and wow - everything was so amazing. The food was so flavorful and delicious, the atmosphere was perfect - great calm lunch vibe, and the waiters were perfect. Super attentive without overdoing it and just so on point. Was affordable too. Thanks!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOZnU1b25UbGJmelBBEAE",
            "text": "The portion sizes are HUGE, so definitely come hungry! The food overall was okay. I wasn't a fan of the Saganaki (if I spelled that right); it tasted bland and too greasy for my liking. The spinach omelet could’ve used a bit more moisture or a good sauce to liven it up. On the plus side, the service was solid and the staff were friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQdlA4SUh1MXY2ZzVRRRAB",
            "text": "Brought my mom and Mother in law to celebrate an early Mother’s Day dinner. At first I reserved for 6 but then I had to add one more guest when I called I was able to add one more person to my party with no problem, they were very accommodating, not only that we got there 30 mins prior to our reservation and were able to sit us right down.. Our server Nick was awesome, very polite. Food was delicious hats off to the chef.. :). Will def be back here again !!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNSGszWlN1enNfUHdnRRAB",
            "text": "The experience here left a lasting impression. Excellent Greek food and a welcoming atmosphere. So good!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaTdfMzVBRRAB",
            "text": "Food was great, highly recommend their black linguine, gnocchi and Manhattan, Cosmo for drinks. Portions were massive but the price is a little high but justified for how good the food is.\n\n8/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcmFtRVNBEAE",
            "text": "Went there for lunch with some coworkers. Everyone was very happy with their orders. I ordered the lamb platter with grilled vegetables and it came with a side salad. The platter was a great choice. I have been there before a few times and I was never disappointed."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc1oyOHFRRRAB",
            "text": "Loved the moussaka and lamb gyro platter. Moussaka was a huge serving - enough for 2 people, so at ~$22/entree, it was well worth it. Our water glasses were always filled, all waiters & servers were extremely attentive and kind. Food tasted fresh.\n\nManagement: I’d maybe try the moussaka with a béchamel sauce (less acidity compared to the tomato sauce, you’re already getting acid between the moussaka layers anyway). The atmosphere was very homey, but could use some upkeep - felt like it was out of the 2000’s era."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJclpqekNREAE",
            "text": "Great food, good prices."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaVlLbEx3EAE",
            "text": "I love the food and people here. Been using take in lately. Always good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJLXJ5Z2V3EAE",
            "text": "Great food and service, will definitely be back!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleS1Lcld3EAE",
            "text": "Was walking by and loved the ambiance of the outdoor dining.  Decided to stop by and order. Don't regret it.  Everything we ordered was delicious.  And more than enough portions.   I will be coming again and bringing some friends."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3LWIyQzhBRRAB",
            "text": "This Greek restaurant exceeded all expectations, delivering an unforgettable dining experience. Every dish hit the mark, leaving us so immersed in the flavors that we ate in complete silence, savoring every bite. The service was outstanding—attentive, friendly, and efficient—enhancing an already fantastic meal. Despite being completely full on a Wednesday night (a true testament to its quality), everything was seamless. If you’re looking for yummy Greek cuisine that delights in every way, this place is an absolute must-visit!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcV9hb2dBRRAB",
            "text": "Very good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNXNmR0lnEAE",
            "text": "octopus great"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRX05pR2h3RRAB",
            "text": "Nick’s is one of those places you think about and you become Pavlov’s dog.  I think quinoa falafel and the saliva flows.\n\nThe service and ambiance match the food.\n\nIf you’ve been there you know!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRakxIb0d3EAE",
            "text": "Last night I went to one of the best Greek restaurant in Queens \"Nick's Bistro\" located at 104-20 Metropolitan Ave, Flushing, NY, Nick's Bistro is a delightful gem that offers a warm, inviting atmosphere coupled with exceptional cuisine. From the moment you step inside, the friendly staff ensures you feel welcomed, making it an ideal place for a casual meal or a special occasion. One standout dish at Nick's Bistro is their \"Lemon Ouzo Chicken\". This entrée features sautéed chicken breast in a luscious lemon ouzo sauce that is nothing short of amazing. The chicken is perfectly cooked, tender, and juicy, while the sauce provides a vibrant burst of citrus flavor with a subtle hint of anise from the ouzo, creating a delightful balance that tantalizes your taste buds. It’s a unique offering that showcases the restaurant’s commitment to blending traditional recipes with a modern twist.In addition to the Lemon Ouzo Chicken, the rest of the menu is thoughtfully curated, featuring a variety of other Greek and Mediterranean-inspired dishes that are equally impressive. The ambiance is cozy and charming, making it a perfect spot for both families and couples alike. Overall, Nick's Bistro is a must-visit for anyone in the Forset hills,Flushing area. The combination of outstanding service, a warm setting, and dishes like the unforgettable Lemon Ouzo Chicken makes for an excellent dining experience. #nicksbistro #onlyinqueens #Greekfood"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBOWJMZHpRRRAB",
            "text": "Great food fast service and friendly staff. Diego is so kind."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmamZmbnJBRRAB",
            "text": "I was here to meet my wife ten years ago because the restaurant had the same name as mine. Today, my wife and I celebrate our anniversary here. The restaurant hasn't changed much. The food is delicious, especially the lamb chops, which are very tasty. The Greek cannoli dessert is special. The waiters are very nice."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cjczVVpBEAE",
            "text": "Food was very delish, service was pretty quick. We shared first greek salad and saganaki cheese which was so good. Then we ordered two entree’. It was a lot and brought some food home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdV9PTXZBRRAB",
            "text": "We were hungry and wanted to try new dishes and different for us both. Portobello with crab meat. Moussaka, grilled octopus and started with a share salad. Greek beer to wash it down all the good food but still hold on to the delicious taste. Still remember the well balanced moussaka that was to die for .\nThe octopus was tender but for me I wished it was served as a whole piece and not cut for me while the char would have been more outstanding with tones of lemon juice. I did not care for the chickpeas mixed in .\nThe mushrooms (2) were well prep still I wished it was more meat then fillers ( breadcrumbs and such).\nWe are going back this Summer for more of the Greek delicious food . I am thinking of the lemon chicken soup and more traditional Greek dishes.\nThe team in all cooked served and clean efficiently while the manager took care of mom to be comfortable at all times since she is elderly with mobility issues. The smile on their faces made our experience unforgetable. Keep doing the great job you had delivered to us both. See you soon  ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeXRUeHhRRRAB",
            "text": "I came upon this place with a friend while walking Metropolitan Ave and I have to say I'm impressed, the food was plenty and delicious and the sangria I had was one of the yummiest ever, also the Margarita on the rocks was amazing and so refreshing! If I lived closer I would become a regular and would like to try more on their menu."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUMDgyd2pRRRAB",
            "text": "Nick’s Bistro is my favorite restaurant. I’ve been dining here for over 10 years and I have never had a bad experience. Their food is excellent!  I have never had a dish that I did not thoroughly enjoy. What also really sets them apart from the rest is their hospitality. They treat their customers with such kindness. I love Nick’s!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc3UzNi1RRRAB",
            "text": "This is the second time my co workers and I have ordered from here\nThe first time I forgot to take photos\nWe ordered the chicken gyros - they are buy one get one free and the lemon chicken soup which is also buy one get one free!\nThis is an Awesome deal and super delicious\nThe food comes very hot\nThe lemon soup is thick and very tasty\nI’ve had from other Greek places and this is one of the best\nThe chicken gyros are filled generously and have a great taste\nWe will definately be ordering from here more often !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUZ3BiOEZREAE",
            "text": "We came as a party of 6, and made reservations ahead of time. Food is wonderful, authentic, tasty, and does not make you feel heavy. The saganaki is one of the best ones we’ve tried, comparing to the ones we had locally and internationally. The tzatziki with the pita bread is delicious and comforting… Warm, soft bread with flavorful tzatziki and juicy chicken kabob, we were all amazed. The manager is very friendly, upon checking in he made sure we didn’t wait more than 2 minutes, checked on us frequently, and made sure we all had what we needed. The rest of the staff were very polite, quick, accommodating, and helpful. We all loved Nicks Bistro - cannot wait to come back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkN1Aybkh3EAE",
            "text": "The staff were friendly, the atmosphere was welcoming and the food was delicious 😋 Generous amount, too. Cocktails🍸 were also pretty good. Overall, highly recommended. 💚"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3b0pPN0xBEAE",
            "text": "We came here after watching a movie and it was after 8pm. We sat indoors (they have outdoor seating too), it was a little warm, lots of couples and a few parties. This is a hip place. Food was excellent, we had to take leftovers ho"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eDVpcE5nEAE",
            "text": "The food here is delicious. It is not a large restaurant, but with a reservation we were seated promptly. They have a lot of wait staff. The food came out quickly and whatever we asked for was promptly provided. It is a wonderful restaurant."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNjRDM05BEAE",
            "text": "This place was meh. There was a funky smell when I first walked in, which almost made me turn back around, but I didn't want to be annoying, so I just stuck with it. The food was okay. The falafel burrito I had was pretty good, except it was kind of dry. The service felt a little much, and maybe that was because we were the only two people there at the time. It made us feel like we had to rush."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldHE3NlhREAE",
            "text": "I want so badly to give this place 5 stars, especially since the service was great! But the parties who ordered the gyros were extremely disappointed. The meat was not cut from a vertical rotisserie because the meat was too symmetrical to be hand cut, and that the gyros were bland. However, the steaks and seafood were excellent and the folks who asked for desserts loved them. My recommendation: order the beef, pork, salads and stay away from the gyros!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1Z3NyTDZRRRAB",
            "text": "My friends and I just finished the most delicious brunch. The service was great, the food was amazing, and our server was on point. We were celebrating my best friends wedding and she wanted to treat us to a nice brunch. She couldn't have picked a better spot. Try the home fries, they're amazing!\n\nI highly recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4d3R2aS1nRRAB",
            "text": "Wow! Another great Mediterranean restaurant. My friend and I came here for early dinner and shared the spreads (eggplant, cucumber yogurt, and hummus) with pita bread. Then we shared char-broiled Bronzino. Very delicious Bronzino served with a touch of flavorful sauce. You must get the fish if you enjoy broiled fresh whole fish. We had the fish with grilled veggies and sautéed string beans. Glad we found the place. When Hubby came to pick me up, he looked at the menu and said he’d try it with me someday. I think he saw the lamb on the menu. Yea, the plate of lamb chops looks impressive! They have a friendly crew here, from the host to the waiter and runner. It was great teamwork. Perfect food and service!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMWYtYldREAE",
            "text": "This is my favorite neighborhood restaurant.  Excellent menu. Service is Airways fantastic.  Food is superb! We saw plants with fresh herbs growing outside of the restaurant.  The cocktails are delicious. Great daily specials. Very consistent quality. Loved the cucumber Gin mint cocktail."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVbDQ2STBRRRAB",
            "text": "Food was great. Service was phenomenal. We told our waiters that we were going to watch a movie in 30 mins and we planned on just getting apps. They said not worry and that we could order anything on the menu and it would come out in time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXelBYQ21nRRAB",
            "text": "The staff were very kind, friendly, and culturally diverse. The best part is their dedication to excellence and the protection of their customers and other employees.\nThe food did not disappoint and neither did my Frapé Martini. The only way to have a drink is to have a strong drink. That bar keep knows what they're doing and I loved it.\nI ordered the Mediterranean Octopus Salad and was greeted with perfectly cooked, flavorful, tender octopus with my fresh greens and tomatoes.\nThe atmosphere was very calm when first opening and rather cozy. It was an overall great experience and I will be coming back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOGFxdVdREAE",
            "text": "We did our son’s baptism party here and had a blast!!! Mario (owner) and his team made us feel like home! Good vibes, food is amazing and reasonably priced.  I had some food restrictions because health issue but they offered outside of my menu so I can enjoy with everyone, I don’t forget a kind gesture so  Thank you guys so much for the wonderful party!\nAlso, don’t forget you can work with the owner Mario to build your party menu, he is very good at suggesting. :)))\n\nWe definitely will be back!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydThmSWdBRRAB",
            "text": "Lately, I've been in love with Mediterranean Food and I decided to give this place a try. The service was great and the food was tasty and pleasant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPX2M2R2N3EAE",
            "text": "Service is top notch. They even encouraged our little one to keep screaming for their wonderful, delicious food. The pork souvlaki was yummy, the Branzino was perfect and the pasta scrumptious. We will be back for more. This place is a gem."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdDRyZ0JBEAE",
            "text": "Such an excellent restaurant. The outdoor seating was nice and the service was superb! The lemon chicken and lemon potatoes were perfect! I loved the filet mignon kebab, baklava, and dips too. Can’t wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeE1TX3BnRRAB",
            "text": "I recently dined at Nick's Bistro and was blown away by the exquisite flavors and impeccable service. The lamb gyro platter was a culinary masterpiece, perfectly complemented by the soft pita and creamy mashed potatoes. The Greek salad was fresh and vibrant, adding a delightful contrast. The succulent lamb kebab was a highlight, showcasing the restaurant's commitment to quality ingredients. Each bite was a journey through Greek gastronomy, leaving me eager to return. The combination of delectable dishes and a welcoming atmosphere earns Nick's Bistro a well-deserved 5 stars."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHbU5PRkVREAE",
            "text": "Very nice dinner. Wait staff was tentative but not overly. Food was delicious.  We had calamari for an appetizer followed by lobster ravioli,  lasagna and sea food pasta.  Only complaint was some of the squid rings weren't skined properly but all in all a good dining experience"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadVpieUNnEAE",
            "text": "Nick’s Bistro is a great place to get a tasty meal served by a friendly staff. I’ve tried their  stuffed sole and lemon ouzo chicken from the brunch menu. Both options are very good. I especially love the roasted lemon potatoes…delicious! Like most restaurants in the area, the premises are small so it can get very full, but they have plenty of outside seating if that’s your thing. 💯 recommend."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2OEx1NWZREAE",
            "text": "This place hade the nicest outdoor seating area that I have seen, they have a grate setup I felt very at ease without my mask! The food was amazingly delicious and they gave nice portion sizes, staff friendly and attentive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSa01fd2dBRRAB",
            "text": "I ordered the lamb chop for medium rare. The dish came in medium and well done. The grilled octopus was good, but I would've preferred the whole octopus as opposed it cutting it into pieces mixed with other sauce and chick peas and red onion. It was a different taste."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5NTlhR2VREAE",
            "text": "A hidden gem. Everything is good! Servers are busy running around but friendly and helpful. The mussels is really good🤩"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcm8ta3ZRRRAB",
            "text": "Very decent Greek food in Forest Hill. The local made Sangria is delicious and has fresh fruit flavor. Lamb Burger is pretty juicy and flavorful. I would also recommend the Lemon Ouzo Chicken which is so soft, and the pair with lemon ouzo sauce is great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdTQ3bXJ3RRAB",
            "text": "The dining area is small but the outside dining area is big and spread out. The food wasn’t there greatest. I had the Lamb Gyro, the gyro meat was dry and they gave me 4 small pieces of pita. The onion rings were good. My wife had the spaghetti with grilled chicken and the spaghetti had no taste.  It’s unforatunate because we always see a long waiting to be seated. Will try this restaurant one more time before I make a final commitment."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OFA3ZS13RRAB",
            "text": "Average at best. Appetizers were better than the entrees. How can a Greek place have mediocre chicken souvlaki and chicken gyro? Big NO NO"
        }
    ],
    "reviews_count": 80
}