{
    "name": "London Lennie's",
    "place_id": "ChIJc0MR70BewokRTMXd_MHdgm8",
    "grid": "QN6",
    "address": "63-88 Woodhaven Blvd, Rego Park, NY 11374, USA",
    "rating": 4.4,
    "user_ratings_total": 1847,
    "phone_number": "(718) 894-8084",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFdGVGQXRPVWxwTWxrelExWmFabTh3VjJKS1dHYxAB",
            "text": "The best seafood 👍 love it"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GR1RuUkhRM0ZaZFdwQ2IxWnBlRmxXV25KcE5XYxAB",
            "text": "This restaurant is known for its seafood. Crab fest was underway. Unfortunately,  I don't eat shellfish. I got their autumn salad as an appetizer. This was fabulous, as it was a collection of squash and various other things like pomegranate and pumpkin seeds, with some cheese and cream, but no greens! My wife had the honeyed cauliflower, which was cauliflower with a honey glaze. Okay, but basically cauliflower. For main course I had the salmon, which was undercooked. My wife had the sesame tuna, which was very good, according to her. Dessert was \"traditional\" key lime pie, which was good. Valet parking was a lifesaver."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVE9HMUNXbk5WTFdKcFowdExVV1pLY1RkRlMwRRAB",
            "text": "Since London Lennie's began hosting live music on Friday evenings, my husband and I have enjoyed several pleasant evenings there. We go for a drink, share an appetizer and enjoy the music. It's a lovely way to wind down and end a busy week. We don't choose to stay for dinner but you can't go wrong if you do."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VlZsY3pVVEZQYUhjM05FWldUbU14TTBaRVJrRRAB",
            "text": "Just Wow. Amazing time here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWU1uWnFiVk5OV0VnemVEbFNVMEpqYnkxcVYyYxAB",
            "text": "Coming back to a place from long ago and finding that nothing has changed! Wonderful news for sure.  Food was impeccable, service outstanding, atmosphere inviting.  We had the octopus, clams, lobster and king crab legs.  Everything was delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMWNUWTBaQzF3ZG5sMmJUWlNXbkF0U0ZSUGJXYxAB",
            "text": "Disappointing experience at London Lennie's on Woodhaven for my birthday. The seating arrangement was a struggle - initially offered a table next to the waiters' station, which wasn't ideal. When I asked to move, the hostess seemed put off but eventually relocated us. However, the new table was similarly situated on the other side of the restaurant.\nThe waitstaff seemed overwhelmed, taking a long time to attend to our needs and spending more time at the next table. Food was adequate, but the French fries were burnt, with the excuse that they might have sat under the light too long. Not the birthday celebration I was hoping for. Maybe not the best choice for special occasions."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRVluUjZXbUZKWVZvNVlsbEJhMVZHUm5aaFRIYxAB",
            "text": "Very quiet and relaxing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSVMxTlBUREIyUVhJM2NXZDRRM0F0VGpSaVVrRRAB",
            "text": "Great food and drinks."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeE5reFNhbGQyYUVOT1MycGZTVTFuYUhsNWEwRRAB",
            "text": "This is really a gem! Been in the neighborhood for 10 years and can’t believe I didn’t know this place until now. The seafood was really good and fresh, a great selection of varieties as well. Wait staffs were super friendly but not so attentive, took out our utensils after taking away the appetizers and never got us new set for the entree until we asked for that, a little hiccups but undeniably friendly. That is the reason I gave out 4/5 for the service. Price wise, very reasonable for seafood restaurants. We were a party of 3 adults and 1 kid, got a seafood tower, chowder, oysters, and two entrees to share and one kids meal, cost $400ish with tips. Overall, great experience and would return and highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xa2MxZHpkRU5PV1RKSmFXcHBNekpMUjFGb1dGRRAB",
            "text": "Was so excited to try this restaurant out. It is such a vibe. My partner and I enjoyed their restaurant week menu. Our favorites had to be the Oysters Rockefeller, Pistachio Crusted Halibut, and the Georgia Peach Crisp with pecans. Their New England Clam Chowder was very hearty. Their bread to start the meal was tasty. On Friday nights live music is playing which was such a treat on top of the great service. Will definitely be back but earlier in the day to enjoy their happy hour specials."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVFVYSm5aa056YjBKdE5XOUtSa1ZUUVhOVVkwRRAB",
            "text": "London Lennie’s Was Incredible!\n\nA few of us went to London Lennie’s last night and had an amazing time. The host was super welcoming, and the wait staff couldn’t have been better—friendly, fast, and really on top of things.\n\nI ordered the Center Cut Boneless NY Sirloin (18oz) and wow... it was perfect. Cooked just right, full of flavor, and honestly one of the best steaks I’ve ever had. Everyone else raved about their meals!\n\nThe whole place had a great vibe—comfortable, classy, and perfect for a night out. If you haven’t been, go. You won’t be disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcVNuZzNabTFyU0ZkcmJGZDRaM1pQWVhoMk5GRRAB",
            "text": "Great food and service. I go when they have deals. I'm retired so I gotta save but when you want something special, it's a nice place to go."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkblUxTXdZalJyWTFsRE9IUjRTbXh0YkVwMFQyYxAB",
            "text": "This establishment participated in Restaurant Week, however no one mentioned it when we were seated and when we asked about it, they only brought 2 menus for the group of us. The waiter insisted that I try the Rockefeller Oysters even though I had expressed interest in raw oysters. It was okay. The steak was also okay, but I guess that’s on me for getting filet mignon at a seafood restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNWVXcGtRWFpJYTJsalMzQTVPSEF6ZGpSVFRsRRAB",
            "text": "Came by for a lunch after a funeral service. It happened to be restaurant week which allowed us to taste an appetizer, entree, and dessert. Unfortunately they were out of the sushi rule I had been hoping to get. So I believe I got the muscles instead, which were fine. The halibut with pistachio looked great but it did not deliver as much as I had hoped. It was a little soggy and just needed a little bit more spice or taste. However, the dessert was quite good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMVFreEtPWE5PVDJoNk1qVllNa3hKZUc5SFZIYxAB",
            "text": "The fried calamari is the worst I have ever eaten."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNVNUWkJhbE5RWW5WeFIxQm9OVFZCWkRsaFoxRRAB",
            "text": "Excellent atmosphere and food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRFFVNXdjazFNWW5ReWEzWmlSMEkxYjBRMGNIYxAB",
            "text": "We decided to have a tomahawk steak, and as you can see sea food. It was the first time my wife and I eating there and we can say, we were not disappointed at all. The service, the atmosphere and the people were excellent. If you're ever in NYC and looking for a great place to eat, then I recommend this place for sure!! I give it an A++."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbFRVMUJjVXRRV2psWFZsaDVjVU53TVV0amFYYxAB",
            "text": "Food is soo good"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMXJhTjVBRRAB",
            "text": "Manhattan prices food was good 👍🏽 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbVJHWkVaMGhMUkUxWmJYWjNla2xKV2pkRmRIYxAB",
            "text": "An excellent seafood restaurant. Seafood  is always fresh and usually well prepared. Though  the soft shell crab dinner ( special item for summer restaurant week) was over fried. Really over fried.    Rest of dinner as always was delish.  And the atmosphere is comfortable upscale adding to a nice dining experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VFYzQjVWa3BZTFhwNE1rZ3RkbDh5WlhSNUxVRRAB",
            "text": "They have happy hour"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWd2VEZHlOVkJQWkc0NWNuZDViVEZ1TVhFM2RtYxAB",
            "text": "I’ve been dining at London Lennie’s for awhile now and while it remains a beloved seafood spot in the community, it’s clear the hospitality has not kept pace with the price tag.\n\nLocated on Woodhaven Blvd, this restaurant isn’t exactly easy to reach unless you’re driving or taking the bus —  compared to the more walkable blocks of Forest Hills. Still, it draws a loyal crowd thanks to its reputation and upscale menu — with dinner pricing that feels more Manhattan than Queens.\n\nThe atmosphere is dark and dated, with wooden blinds perpetually drawn, but what redeems it is their “Happiest Hour” deal — $10 light bites, oysters, and cocktails that make it worth the trip.\n\nThat said, don’t expect to be treated like a valued guest — especially if you’re dining during the discount hour. On my most recent visit, a waitress who recognized me licked her fingers to separate the paper menus before walking me to “that side” of the dining room— a gesture I found shocking in any restaurant setting, let alone one charging top-tier prices.\n\nEven more disappointing? The attitude! Her scowl said it all: I was “just” there for Happy Hour. Since when is wanting to spend $120 instead of $200 something to sneer at?\n\nLondon Lennie’s may still deliver on seafood and community nostalgia, for its nepo owner but the lack of hospitality is glaring — as if success has excused them from basic guest care. At a time when restaurants should be making diners feel welcome, it’s unfortunate when the experience makes you feel like they’re doing you a favor just by letting you in."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swME5XVkxaRUpXZGxrM1oyMTBWR2RwYUU5a2NVRRAB",
            "text": "Food was very good and moderately priced.  Lots of appetizers to choose from.  Good drink menu.  Service was very good but the waiter was definitely trying to up sell us but was not overly pushy.  Six people with dinner, appetizers, and a spattering of mixed drinks and soft drinks came to $375 with no desserts.  The fish was fresh and tasted good.  The only reason I didn't give service 5 stars was our waters were empty a couple of times and the slightly annoying attempts at up selling.  I would say more like 4-1/2 stars!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cFIwa3hlR0pHTFdSNlJ5MWlNbGsyVFY5QloyYxAB",
            "text": "Great staff and great food. The best branzino I’ve had. Everyone should try it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUmIycEJYMVJOTUhsd04xSklaRXBrU0RKa1YwRRAB",
            "text": "We’re not fish eaters. Fortunately the menu had lots of choices. We had wonderful baked clams to start. The server made very good suggestions and the steak and burger were very good. By the way, the coleslaw here is out of this world!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsZkxYcExkMDFXZVZjM2VGUmlTemxNTkhsVlJWRRAB",
            "text": "We love sitting by bar..where service is always on point..Seafood always fresh..and delicious....drinks are perectly made too..Thank you london lennies for being in queens...."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRFl6UkxjV0Y2Y1hOb1RWRk9iRzVuT1VSYVkwRRAB",
            "text": "Friendly waiter. Hostesses were inattentive and unwelcoming. The food was good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VONnVzWWZpb19UeXJBRRAB",
            "text": "Not even 1 star"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLSExoTENadi16bm5nRRAB",
            "text": "Great place to eat and relax going there again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VON0JpWkdNbGVMZHRRRRAB",
            "text": "Been coming here for many years. Always lives up to a great meal."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcTg4OHpfc2FmRXV3RRAB",
            "text": "Great service and absolutely amazing food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQ3duSXEzOFlpdnJBRRAB",
            "text": "Food was delicious, owner is a great guy"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPckw4cXFQbzdXXzdnRRAB",
            "text": "I never had a bad experience here. Wednesday's happy hour has half price oysters. Wifey had steamers and a red snapper. We shared baked clams. I had linguine with clams and a couple of bloody Marys."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX1pYNTdBRRAB",
            "text": "Food and service is good and excellent. I went there for oysters 🦪 cuz i was craving for that. I ordered 12 pieces kumamoto oysters and oysters was so small that it’s not worth paying a piece of oyster for 4.50$ for that size. I feel regret that I ordered oysters. Everything was worth going there except for oysters. The servers was nice and keep checking our tables very often. He even give me dessert on the house for our anniversary. I would recommend this place for a date night except for oysters experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURva2VLajFBRRAB",
            "text": "Great ambiance food was on point excellent place for a nice romantic evening."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLXVpVEJ3EAE",
            "text": "It's my second time there. The service is amazing and friendly, and they are very attentive. Love the prices for happy hour. The food is very delicious and fresh. It's a very friendly atmosphere where it seems like the locals gather and everybody knows each other."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyd09lWC1nRRAB",
            "text": "Great service  by the gentleman  waiter made us feel like a million dollars  happy Easter 🐰"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbE5YTzJBRRAB",
            "text": "Loved everything here. Seafood towers are spectacular, and king crab is an amazing experience to have."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvazRqRndBRRAB",
            "text": "Top Tier spot to eat at.\nPlease nuh go there with bad behavior and disturb the people dem nice place and Please nuh badda crowd it up so when me go there me can't get nuh seating. Oh but you di place nice bad"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcm9hQ2xRRRAB",
            "text": "Kevin was awesome 👌🏻. Very nice service,  and food is delicious. We will be coming back. 🦀🦐🦞"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcnRQRnhRRRAB",
            "text": "Just ok nothing special"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaXRIY1hnEAE",
            "text": "Delicious food, chose this restaurant to celebrate my wedding anniversary :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NHZPa1hBEAE",
            "text": "The vibe and atmosphere were great. But the food…well I wouldn’t give it to the friendly neighborhood rats"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMzhmbU53EAE",
            "text": "FRESH! FRESH! FRESH! What an absolute AWESOME find! We just wandered upon it late, not from the area. This is what they mean when they say New York has the greatest food!  Unique options on menu, sourced from the sea, not some restaurant depot. Mary was a doll and we arrived late, people still walking in late, they close when you're finished."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRczVPd2l3RRAB",
            "text": "Great place super friendly people"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBX2Ziek93EAE",
            "text": "5 Star restruant!   Great selection of fish!   Always Fresh and on Point!!  And Customer service is really On POINT!   I give this place 10 stars!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRamJydFRBEAE",
            "text": "Love the food. Staff is super friendly and nice."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReE9INnBRRRAB",
            "text": "Fabulous service. Food was excellent.  Freshest oysters.  Dessert was off the rails.  Bread pudding was the most amazing ever! Only to be topped by the key lime pie! Can't wait to try the others."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Z0x5Q0FnEAE",
            "text": "This place is known for seafood, so came with a buddy that has been here numerous times to try it out. I had the restaurant week dinner special, and we ordered some oysters and crab claws as appetizers. The oysters were delicious, and the main dishes were good overall. The pace of the dining experience, however, was slow paced, and by the time we were done, we spent over 2 and a half hours inside the restaurant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmb2JXcHZBRRAB",
            "text": "Nice atmosphere! Waiter was a but slow & ignored us several times! Food was good! Tomahawk was a bit on the smaller size than I'm use to but tastes ok!! Clam chowder was delicious & flan was delicious but presentation needed help!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueWQySkh3EAE",
            "text": "My husband and I celebrated our wedding at London Lennie’s and I think it was the best decision. The whole staff welcomed us in a lovely way, and Amanda, our server, really shared our happiness. Her empathy, enthusiasm and kindness made our day one of the most memorable of our lives. And the food… delicious. I highly recommend this restaurant. 🥂👰🏻‍♀️🤵🏻🍝"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIa1lpNXZnRRAB",
            "text": "London Lennie's in Queens is a seafood lover's paradise! Last Friday night, my husband and I indulged in a delicious dinner and were not disappointed. The oysters were fresh and briny, the lobster fried to perfection, and the tower combo was a feast for the senses. While the price tag was a bit steep (we spent over $280 for two people), it was well worth it for the quality and authenticity of the food. If you're looking for a truly exceptional seafood experience, London Lennie's is definitely worth a visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0dk5TY3V3RRAB",
            "text": "Great food, wonderful experience but yes, it's very overpriced. We spent a little over $360 for 2. We mainly went for the king crab because of an IG post we'd seen but they'd neglected to mention it'd cost $85/lb.  We were not about to pay over $450 for a king crab. Absolutely ridiculous! However, everything else we ate was delightful, especially the baked clams...a must."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidjRiWVVnEAE",
            "text": "As you walk in the atmosphere is classy. Fairly busy with a few birthdays. The food was excellent, I ordered restaurant week with a small side place of dumplings. Man every meal was good. They blended the flavors in such a way as to be curious of the other plates. Then dumplings are still in my brain."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnX2Jmc3h3RRAB",
            "text": "Fast service, nice atmosphere, and decent selection. When entering, seating was prompt and the server was immediate with his preparation of the menus. The service was very efficient and friendly, with orders being taken within 8 minutes of looking at the menu.\n\nOrdered the lemon sole and it was well-prepared, being fresh and falling apart easily. Bonus to the restaurant for noting our request for no dairy to be used.\n\nOverall, a pretty good experience visiting this spot if you're looking to spend a bit more for a nice date over seafood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwLV9icHhnRRAB",
            "text": "Food was blah\nServer was cool\nPrice point was high $$$\n\nThe menu descriptions looked beautiful and made one confused at what to choose based on how great it sounded, but when it came to the actually food,  it was bland,  underseasoned and overcooked.\nRestaurants must learn that they can stick to a vintage and traditional way of cooking but still use seasonings and spices.\nThe drinks were good.  At least 2 of the 4 we had anyways.\nThe price point per person was pretty high, and it was expected, but for what we paid (~$100pp) I wish the food would've been something to write home about."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLXR5QnpRRRAB",
            "text": "Living in Queens my ENTIRE LIFE and this was my 1st time here and I have been missing out for so long!  Beautiful venue, our waitress was so friendly and attentive, the menu options were perfect, the drinks were amazing, and the food was delicious and perfect.  Can't wait to go back and try something different!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeGRIZDBnRRAB",
            "text": "Amazing seafood place… I was impressed at how fast they made my martini!!\nThey have a huge selection of seafood, which I love! The restaurant is very family oriented, the staff is very friendly, our waitress was great, super chatty and friendly!\nWe ordered a lot more of the pictures I took, everything tasted great and fresh!\nWe will definitely be back!!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdjRTZEN3EAE",
            "text": "Valentines dinner done right! Food was good but our waiter Kirk made the experience better. Go visit Kirk!\n\n**Update** went back for NYE dinner and it seems like they have upgraded their food. Last time the food was good but this time everything was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaS1qalBREAE",
            "text": "I've been here to celebrate my mother in law birthday. And we had such a good time and very good food and fresh. Taka looks at the pictures."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENU1IYkRnEAE",
            "text": "I visited this restaurant during the NY restaurantweek and got a chance to try an amazing 3 courses dinner for 45$! A bit extra pay for the lobster ,but it worth it! So good, delicious,the lady waitress was amazing and professional! High quality spot,will come back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxOG9ENEhnEAE",
            "text": "Delicious and fresh.  My family and I enjoyed a wonderful birthday dinner this evening.  The staff were friendly, attentive and personable.  Great interaction, positive atmosphere and a safe environment for families.  The food tasted wonderful from  start to finish.  A neighborhood staple that we will visit again soon."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzaXFmYkpREAE",
            "text": "My First time here, will not be my last.  Brought my mother for her birthday, she enjoyed her food.  The staff were very friendly, our waitress was the best.  Service with a smile, the food was done perfect, everything tasted great.  Drinks…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhN2VTbmJBEAE",
            "text": "Traditional upscale fish and seafood restaurant. We've been several times before, and came to try their Restaurant Week selection.\n\nMy partner did the Prix Fix. The Mussels were plentiful with a mild Curry sauce. He had the Jumbalaya for his entree which was decent though a little over cooked. For dessert he had the Bread Pudding with Ice Cream. That was amazing. He also had their Old Fashioned which was nice and strong.\n\nI ordered off the menu. I had half a dozen Oysters. They were fresh and well cleaned. I ordered the Canadian Halibut with roasted vegetables. The fish was flakey and well cooked, though could benefit from drawn butter and lemon. For dessert I had the key lime pie. It was the only thing we were a little disappointed in, as it barely had any lime, let alone the signature key lime tartness. I forgot the name of my drink, but it was a peach schnapps and Stoli orange martini. It was strong and delicious.\n\nLondon Lennies is a real treat, and would be great for any date night. Their prices are reasonable though still in the 30 to 40 for an entree range. The seafood is definitely fresh, and that alone is a reason to come there alone. #Oysters"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVcFBqSUFnEAE",
            "text": "Wow.. it was a large group.. the seating and atmosphere was perfect.. quiet and nice.. the environment around suited the moment.. the food was unforgettably tasty.. a wide variety to choose from for both adults and kids.. I enjoyed the boneless beef ribs with the potatoes and sauce.. which came with a salad..  my other colleagues enjoyed the tuna steak with veges.. and the salmon with glazed potatoes and veges.. the calamari was great for an appetizer.. the desert was fantastic.. chocolate cake with whip cream and ice cream.. 🤤🤤🤤 the wine was of great taste which was recommended by the waiter.. waiting time for our meal was 15 minutes.. which was awesome.."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbnAtRkpnEAE",
            "text": "I had a great time here as soon as I walked in you knew just by the feel and the way I was greeted I would be back. I can't say enough about the service it was outstanding nothing short of stellar. The food was delicious everything was good…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDcV9xMFVnEAE",
            "text": "Located in Queens, New York, the setting and food makes you feel like your in Maine. The freshness, size, and taste of all the handpicked seafood is just amazing. Recommend for sure if your in the local area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0czRTMlFnEAE",
            "text": "The lobster dinner was truly exquisite, showcasing a perfect blend of flavors and culinary mastery. Each bite was a delightful experience. Also the King crab!!😻"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bzR6bFZBEAE",
            "text": "Had a great time here! Good food n wonderful atmosphere. Perfect for family dinner and private celebration."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPN2J1MEdBEAE",
            "text": "This place has been around a long long time and has always been a great place to get some good seafood. Whether a good raw bar, lobster, crab or some nice fish entree, you wont be disappointed in the food or service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNU5fdHVnRRAB",
            "text": "Casual atmosphere, gets a bit loud, I enjoyed the quality of the lobster tail, the oysters were ok, the truffle Mac & cheese was great, the steak & fries was awful, the meat was completely tendons- rubbery, inedible — chewy like rubber, at first, I thought my daughter was exaggerating, but I tried it, and we both had to spit it out. We didn’t eat it, we took it home. I tried to see if I could fix it, and no, didn’t work, it is the most god-awful cheapest and worst cut of meat. I had the filet mignon, which was much better. So overall, I would suggest the lobster mac & cheese and lobster tail, the shrimp were pretty good too, the meats I would not suggest, but this is not a steakhouse, but my daughter’s food was actually inedible, my filet mignon I took home, and I had to cook a little bit because I like mine, medium rare, and I eat steak all the time, but this was very rare. It was still purple inside once I warmed it up at home it was good. But the vegetables were great, delicious, rainbow carrots, and zucchini. Overall, I would return again just I would be picky with what I order. And stay away from the meat, stick to seafood."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJdW9lNDB3RRAB",
            "text": "Overall the appetizers were too expensive and overall too small (cocktail shrimp appetizer comes with 3 shrimps, shrimp tacos tasted ok but looked really gross, and the fried calamari was completely unremarkable and were of a diner quality. The main entries were pretty good but not worth the 30$+ price tag"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cC12S1dREAE",
            "text": "Still wonderful after all these years. We left Rego Park 30 years ago for Florida. Visiting this week and we discovered London Lennie's still here and nothing has changed. Impeccable service (Thanks Alex) , perfectly prepared food in an elegant but relaxed atmosphere for reasonable prices. Wish we could bring them back to Florida. But we'll be back next visit."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXb0xlZi1nRRAB",
            "text": "The food and service here are incredible. Highly recommend for a great quality seafood dinner. Great raw options, seafood dumplings, yummy sides, and of course, some succulent lobster with all the fixings. Everything was delicious and they have a fantastic wine selection. Special thanks to Debbie and Alex who provided excellent service on my last visits."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNUtEVmV3EAE",
            "text": "Truly amazing place. Our waiter Kirk was great and very polite. The food was excellent the service was great keep up the great work and food guys five stars ⭐️ ⭐️⭐️⭐️⭐️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcHJDSG1BRRAB",
            "text": "We had a local Long Island friend take us to London Lennie’s and it was the worst meal of our 9 days in the city. Terribly Disappointing. Sadly the waitress hardly ever asked how things were or we would have asked to have this Steak Frites taken off the bill. It was the worst piece of meat we have had in our  40  years dining out and the truffle fries were soggy. $28 was robbery and so disappointing…if anyone goes here just get the oysters and a cocktail and call it a day! Soooo. overly priced and poor quality…and I do not like having reviews like this but if you notice someone has left 90% of their food on their plate and you don’t request that to be taken off the bill, then that is poor service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCN292YjlRRRAB",
            "text": "Always a great meal with friendly staff who offer great service. They have a good selection of food/drink nd they do all it right from appitizers to dessert."
        }
    ],
    "reviews_count": 77
}