{
    "name": "My Kitchen Forest Hills",
    "place_id": "ChIJpXQKFhxewokR_sth4MevSco",
    "grid": "QN6",
    "address": "106-17 Metropolitan Ave, Forest Hills, NY 11375, USA",
    "rating": 4.7,
    "user_ratings_total": 192,
    "phone_number": "(646) 750-9804",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOeVVWQnNkVGhaZFhSNmVFbEhhMjFoWjJWNGNWRRAB",
            "text": "We hosted our wedding reception on October 18th and it was everything we dreamed and more. The venue is intimate and chic. The service, showmanship are top notch and the food is absolutely delicious! Our families and friends cannot stop talking about it!\n\nRebecca, Chef Yvan and the entire team deserve all the success in the world. My Kitchen is such a gem and Forest Hills is lucky to have this venue."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNWRHWlJUbWxMTjNoTFFsSnZNbGRrVm10MFJWRRAB",
            "text": "Where do I start? My wife and I had our wedding at My Kitchen and everything from start to finish was absolute perfection. Rebecca and Luz guided us every step of the way, making sure all of our needs were met and every question answered. Not only were we given the night before to set up, but also an extra two hours the day of to finish last-minute touches. Of course, we fell behind schedule, and when we arrived on the wedding day, Rebecca and her team had already taken care of some details for us—an incredible time-saver we’ll never forget!\n\nThe venue itself is beautiful and romantic, and having the cocktail hour, ceremony, and reception all within walking distance was such a huge plus. While we didn’t get to try the hors d'oeuvres that day, our guests couldn’t stop raving about them. Rebecca was everywhere—checking in, smoothing over details, and making sure the night went flawlessly. Her husband even jumped in to help me with my boutonnière when no one else could figure it out!\n\nDinner was fantastic—the slow-cooked brisket was a standout hit among all our guests. To top it all off, Rebecca and her team even packed us a take-home bag with food, hors d'oeuvres we missed, and a slice of cake so we could relive the magic later that night.\n\nWe are endlessly grateful for the patience, care, and personal attention we received. My Kitchen isn’t just a venue—it’s a team that truly cares about your day. Highly recommend for anyone looking for an unforgettable wedding experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVVoyUm5RbW95WldKM2VsTk9VbUpYVVVjNFgyYxAB",
            "text": "Had a Brunch for a baby shower, everything was running smoothly until it started raining and every guest had to go inside. The Manager was very rude towards the guest telling them to get up after they sat down inside. Instead of having…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUVUwaDVibkJVY0dOVlgzWnZObVZUVVdaRllXYxAB",
            "text": "Private brunch for a baby shower, the crew was fantastic, the fixing were on point and service impeccable. Lots of refills, tables cleared promptly and any needs met instantly. There was lots of street parking (meters and alt side) and all went as planned."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScGMzQkhTV05CZUdwMVVrNHdkazUxV2xkWlQxRRAB",
            "text": "I recently hosted my bridal shower here, and everything was absolutely wonderful. The staff was kind and attentive, the food was delicious, and Rebecca was incredibly helpful throughout the planning process. Would recommend this venue for any event!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYWFFRmxZMnA2Ynpoak5GVjZSRlUzZEhGT1RrRRAB",
            "text": "This is my go-to place for parties and events! We had my daughter’s wedding shower this past weekend.  Everything was beautiful! The food is delicious and the staff is excellent and so attentive to everyone’s needs. Rebecca couldn’t be more…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOV2RfN3lyd29XOS1BRRAB",
            "text": "My Kitchen is exactly the type of venue that’s much needed in Queens. It is incredibly beautiful and spacious, both inside and outside.\n\nWe chose the outdoor garden space for our wedding celebration dinner. The dark wood floors offer a nice earthy feel and there are a lot of plants and a beautiful tree that sweeps over the top of the garden. One thing to note is that the outdoor space does not come with a tent or space heaters - those must be rented through My Kitchen’s vendor at an additional cost (this was disclosed upfront when we toured the site).\n\nRebecca, Luz and Yvan are all very kind and responsive. Luz was especially patient and timely in answering any questions or concerns we had. Rebecca was very sweet and gave us her opinion when needed. The waiter and waitress serving our party were incredible as well - both were so polite and incredibly helpful and accommodating to any requests that we raised during the dinner.\n\nThe food was a hit amongst our guests. We chose the chicken francaise, eggplant parm and roasted salmon for our mains and yellow rice, ziti and plantains for our sides. The roasted salmon was a standout. We also opted for the taco station and dessert station; both of which were gone in its entirety by the end of the night. They also offer cake cutting / plating free of charge which is incredible!\n\nWe’re so happy we went with My Kitchen - it was the perfect backdrop for our cozy, botanical wedding celebration dinner and would recommend it to all who are looking for a beautiful, classy & accommodating venue in Queens."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNTDEzSVNndzUzdmpRRRAB",
            "text": "We recently hosted our wedding reception at My Kitchen Forest Hills with about fifty guests, and it was an exceptional experience from start to finish.\n\nFrom our first visit, my husband and I knew this was the perfect venue for us. The space is both elegant and inviting, and we were confident that Chef Yvan’s cuisine would impress our guests — and it absolutely did.\n\nA heartfelt thank you to Rebecca, Chef Yvan and the team — the food was outstanding, and the service was superb. The cocktail hour menu was a hit with our guests and dinner selections (we went with the buffet) were tasty and memorable. Guests still rave about how good the drinks were also.\n\nThe entire team was professional, attentive, and made us feel truly valued. Their seamless coordination allowed us to relax and enjoy every moment with our loved ones, which meant so much to us.\n\nWhat stood out most was the venue’s flexibility and willingness to accommodate our requests. They collaborated with us to ensure every detail reflected our vision, creating a truly personalized celebration.\n\nOverall, we could not be happier with our experience at My Kitchen. We highly recommend this venue to anyone looking for an intimate, budget-friendly, and elegant wedding venue. It exceeded our expectations for our special day."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbS1yZVNXNWFyamF3EAE",
            "text": "Muy atentos. Todo rico.\nVery attentive. Everything was delicious."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOXVHbHZBRRAB",
            "text": "My Kitchen was yet again a pleasure to work with. They catered an event for 50. They were prompt in communication, thorough in preparation, and incredibly personal upon delivery. And, of course, the food was delicious! We look forward to working with My Kitchen again and heartily recommend them for all catering needs."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbVAyaklREAE",
            "text": "We had our son's first birthday party at My Kitchen Forest Hills last weekend. From the first email interaction to the planning and execution of the event, our experience was very smooth. At our planning call to discuss the event, Rebecca,…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc2NDZVVnEAE",
            "text": "Had my bridal shower here in February, it was perfect! Rebecca and Luz were so responsive and helpful throughout the planning. The day was amazing, the staff was attentive, food delicious. The only thing I didn’t do was ask for a microphone ahead of time and wound up losing my voice (lol) if you have a big group, you definitely need one"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2b09iRDdnRRAB",
            "text": "We had the honor of hosting MortgageDepot’s 2024 holiday dinner at My Kitchen Restaurant, and we couldn’t be happier with how the evening unfolded. The entire team at My Kitchen were exceptional. Their service was attentive, friendly, and professional from start to finish.\n\nA huge thank you to Rebecca & Yvan for making our holiday dinner such a memorable occasion. I highly recommend My Kitchen Restaurant for anyone looking to host a special event!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeV9mS3Z3RRAB",
            "text": "My Kitchen Forest Hills offers a beautiful and spacious venue. The space itself is charming and easy to use for any special occasion.  The staff were flexible with what decorations we were able to use and always ready to help. We do not have words for how amazing the staff were! The staff were very accommodating, professional, and went above and beyond for our party guests. We could not have selected a better space to celebrate such a special occasion. Price was reasonable as well for all that it included! Drinks and food were top tier! Taste was delicious and presentation was amazing. Recommend this place for your future events! 10/10!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeVlqd3F3RRAB",
            "text": "I can’t express enough my happiness with this establishment.\nThanksgiving is my favorite holiday.\nMy husband and I were going to cook our usual feast this year, but I was just in a car accident recently and I am in multiple casts so our regular routine went into the trash.\nMy husband is so busy taking care of me that it would have been too much for him to make that meal by himself.\nI started searching around for an alternative solution as we still wanted to host our friends.\nThen I came across My Kitchen’s Thanksgiving Day Menu.\nIt sounded so delicious! And they were nearby and pickup was Thanksgiving morning. Perfect!\nRebecca and Yvan could not have been nicer about the entire process - from ordering to confirming a pickup time.\nMy husband went out to get the food Thanksgiving morning. Everything was so fresh and lovingly prepared. You could tell that only quality ingredients were used. They even gave us a serving platter for the turkey with a prearranged bed of greens.\nOur house smelled of delicious food (the best part of the day!) and I have to admit- we broke into the cornbread for breakfast. Yum!\nEverything was perfectly prepared and truly tasted homemade. There wasn’t any part of the meal that someone did not enjoy. We got both stuffings and it was hard for anyone at the table to choose a favorite.\nMost importantly, our holiday was easy and very happy thanks to these good folks.\nI’m hoping that they expand their business to include a restaurant sometime soon. I know I would go there often for a good home cooked meal.\nI know most people using this venue are not in the situation I was in, but if they could do this little takeout dinner so beautifully right I can only imagine what an actual event would be like. The attention to detail was not missed on me.\nThis is the kind of place you’d hire for a personal intimate touch. You don’t find that kind of thing around too much anymore.\nThanks Rebecca and Yvan!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQM3BELXNBRRAB",
            "text": "My Kitchen is an amazing venue to host your event! We had our son's first birthday here and returned for our daughter's first birthday. Venue is such a lovely space. We love it!\n\nFood is amazing as well. They have so many options and the chef will work with you if you have any requests!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQOGQtVW5RRRAB",
            "text": "I had the pleasure to have my wedding at My Kitchen this past October! Not only is the atmosphere absolutely beautiful and inviting but so are the owners Rebecca and Yvan. They are both very down to earth, warm, understanding, and a awesome…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzd096QW53RRAB",
            "text": "Amazing experience, bartender Nataly was amazing and the whole experience was awesome. Please definitely consider them for your next event. Whole staff, food, and drinks were amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeXM2d3dnRRAB",
            "text": "Had my engagement party at “My Kitchen” Rebecca was such an attentive organizer and communicated well with me and my family. Her husband is a talented chef and the food was so delicious, was able to work around my Fiancé’s food intolerances…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNEtTVWt3RRAB",
            "text": "We had my sister’s graduation party in June. Rebecca and Yvan are extremely kind and helpful throughout the entire process. From the menu, to music, to food, the entire party was a success. This is a hidden gem in Queens that makes you feel…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbFlfb2F3EAE",
            "text": "My Kitchen held the most beautiful reception for us today to honor my father. Everything was perfect. We can’t thank you enough for your kindness and attention to detail. Thank you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudTdXSUx3EAE",
            "text": "We recently celebrated our Elopement Wedding dinner (40 guests) at my kitchen forest hills and it was an absolutely magical experience from start to finish.\nFrom the moment me and my husband toured the venue, we knew it was the perfect place for our outdoor wedding reception; we fell in love with the garden; The setting was quaint and stunning, it truly revived my imagination for the perfect setting, loved the trees, surrounding the space, lighting and more!\n\nThe team was incredibly attentive and professional. They made us feel valued throughout the entire event, they ensured everything ran smoothly and allowed us to focus on enjoying our time with friends and family! that was important!\n\nThe venue itself is sophisticated, with a charming garden, and beautiful indoor reception area, where our guest enjoyed their cocktail hour. Our guests couldn’t stop talking about how beautiful and inviting it was.\n\nThank you to chef Yvan and team the food was amazing – so many of our guests commented on how delicious our 3 course elegant dinner was, the empanadas where to die for yum!\n\nOne of the things we appreciated most was how flexible and accommodating the venue was with all of our requests, making it feel like a truly personal experience. They made sure every detail reflected our vision.\n\nOverall, me and my husband couldn’t be happier with our experience at My Kitchen,  we would highly recommend it to anyone looking to host an intimate wedding that’s budget friendly and well-managed. It was everything we dreamed of and more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuaGQzd2JREAE",
            "text": "I placed a catering order to be delivered for my wedding reception at our house. I am so happy I chose My Kitchen. Everyone absolutely loved the food. Their customer service is great. Everything went seamlessly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMTVmVnFnRRAB",
            "text": "We recently hosted our baby shower at My Kitchen and couldn't have been happier with the entire experience. From the very beginning, their on-site coordinator, Rebecca, was attentive, helpful, and incredibly accommodating. She promptly answered all of our questions via email and during our in-person meetings, making the planning process smooth and stress-free.\n\nOn the day of the event, the staff went above and beyond to help set up our decor. They were warm and welcoming to all our guests, making sure everyone was comfortable and had a drink as they arrived. We chose a  brunch menu, and the food was absolutely fantastic. Our guests couldn’t stop talking about how delicious and plentiful everything was, from the main dishes to the freshly made fried chicken and waffles. (A must get)\n\nWe are so glad we chose to support this wonderful local business and would highly recommend My Kitchen to anyone looking for a memorable event space!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNuM0pWZhAB",
            "text": "I attended a wedding reception. Food and service was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeDZpRm1BRRAB",
            "text": "The team at My Kitchen is prompt, professional, and skilled. They catered our church choir dinner for 20; the food was excellent, the delivery speedy, and the attention to detail very thorough. Would highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaGVuNFVREAE",
            "text": "My husband Alfred and I just had our wedding at My Kitchen this past weekend and it was absolutely stunning! Not only was the food to die for, the ambiance was fabulous, perfect vibes, Rebecca and Yvan were delightful, and we honestly couldn't have chosen a better place to get married in the city!\n\nDo not sleep on My Kitchen when you are planning your special day or another event - you will not regret it! We received endless compliments throughout the night on the food, the wine, the space, the friendliness, attentiveness, and professionalism of all the staff - all of which continued to pour into our inboxes and text messages for days after.\n\nOur sincerest thanks go out to everyone at My Kitchen for making our day truly one to remember and hold in our hearts forever."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINHZ6NnJ3RRAB",
            "text": "I hosted my wedding event here and it was the best decision I've ever made.\nMy Kitchen is the absolute best place to have your wedding.\nOur family got full support and excellent service from A to Z.  Our meetings were embraced with positivity and even cookies made by the chef himself.\nRebecca is the best wedding coordinator and visionary to assist for your special day. The moment we sat with her she went above and beyond to facilitate our vision and needs .\nYvan who is the chef of My kitchen curated such a exceptional and stellar experience with his exquisite skills with our reception and menu selections. Our guests raved about coming in and seeing him cook everything right before their eyes.\nThe various drink selections  and desserts offered for our guests were amazing and truly divine. This is the space for your next wedding! We loved Luz who also made sure to contact us through every meeting. The staff and the servers went above and beyond to serve us with excellent service and hospitality. We love My Kitchen and will be returning for future events."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNId1BtZ1NREAE",
            "text": "Yvan and Rebecca truly pour their heart and soul into this exceptional restaurant and venue. With years of experience crafting both food and cocktail menus, their expertise shines through in every dish and drink. The beautiful outdoor space…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibGFPODV3RRAB",
            "text": "My Kitchen Forest Hills is an amazing venue for any occasion. We  hosted two celebrations there, and both were fantastic. The owners Rebecca, Yvan, and their entire staff are extremely accommodating, creative, and kind.\n\nWe held our daughter's Sweet 16 there on a fall evening in 2022. Utilizing both rooms of My Kitchen, we had a DJ, dance floor, lounge, photo booth, and sit down dinner. The vibe was chic and the food was delicious! It was a night she will never forget.\n\nThis summer we celebrated again at My Kitchen with a double graduation party for both of our daughters. It was the perfect neighborhood venue for our friends and family to gather. Not only did we enjoy the newly renovated indoor rooms, but utilized the backyard space with a barbecue station and extra seating. Once again, the food was outstanding.\n\nRebecca and Yvon's attention to detail and flexibility provide a truly personalized experience. Whether you envision a casual soiree, or a formal affair, they can make your dreams come true."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOGNIMmlBRRAB",
            "text": "We hosted our baby shower at My Kitchen this past Spring and could not have asked for a better experience. Their on-site coordinator was incredibly helpful and accommodating throughout the entire process to bring our event to life. She answered all of our questions in a timely manner via email and during our in-person visit as well. She was also very fair in helping us negotiate minor menu changes and space allocations so the event was totally customized to our needs.\n\nThe day of the party the staff was available to help in setting up our decor, which was a huge relief. They were all also very attentive to our guests, ensuring they were welcomed warmly and had a drink upon arrival. We opted for a family-style brunch and everyone raved about the food. It was absolutely delicious and abundant. Even the freshly baked pastries were incredible.\n\nThroughout the event, the coordinator and owner checked in with my frequently to ask if I needed anything which was such a nice touch. We were so happy to our decision to support this wonderful local business and would highly recommend them!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybXIyY0NnEAE",
            "text": "I ordered catering for my son’s 16th birthday- I was very nervous as every time I’ve been to a catered event (from other places) the food has been bland and boring. Chef Ivan killed it- everything was deliciously to die for. Everyone at the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMalBuTm1RRRAB",
            "text": "We love this place !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cC1DSUlnEAE",
            "text": "I had my wedding last Saturday (6-1-2024) and hosted 90 guests in the My Kitchen venue. It was the most perfect day! The food was great, everyone felt comfortable with the space. We rented the entire space including the garden area. The ceremony in the garden felt magical and was able to fit all of my guests. During the wedding planning, the My Kitchen event coordinator Jherica was always available for any questions I had and I was able to visit the venue as many times as I wanted prior to the wedding. Chef Yvan and Rebecca are really sweet and professional through it all.  I recommend booking your event here for any kind of celebration. Thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqZzVlV0dBEAE",
            "text": "I held my sister's bridal shower yesterday at My Kitchen. The venue was perfect for our celebration! The lighting was beautiful, and the space for our event was perfect. The staff was amazing and attentive to our guests, and they kept my…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5c056eWNREAE",
            "text": "Wonderful place! We had to provide a last-minute reception after a memorial service and My Kitchen were able to accommodate us. Delicious brunch was provided in their lovely setting. Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cU5XTXZBRRAB",
            "text": "Wedding on 05/20/2023\n\nI am not a huge fan of writing reviews but even 9 months later I can't stop thinking about how perfect this venue was for our micro-wedding. Rebecca and Ivan kept me cool even when I was stressing last minute. The food was delicious and my guest couldn't stop talking about it. I am extremely grateful to them and the staff as I was planning my wedding from long distance and under a tighter timeline than average. Thank you so much My Kitchen Team!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0OTZiMGpnRRAB",
            "text": "My husband and i got married here  it was so eventful, the food and atmosphere was spectacular spectacular"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxb3R5M0p3EAE",
            "text": "Best place for small events"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxc0s3MlRREAE",
            "text": "Great food! Amazing service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZ1lTWHl3RRAB",
            "text": "My niece had her wedding and reception here. The staff was amazing. The owner, Rebecca, was hands on and very attentive. The desserts and food were fabulous. The courtyard was the perfect setting for a wedding. We found parking right outside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsd0lfVXhnRRAB",
            "text": "We did our wedding at My kitchen in May 2023. We are so happy we found what we were looking for. The patio and ceremony were lovely , decoration was amazing and everybody loved the food and the venue. Rebecca and Yvan guided us during the entire organization. Thank you so much"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNXZHQzVBRRAB",
            "text": "We had a wonderful 90th birthday party at My Kitchen. The rooms were perfect and the food was delicious. Thank you to Yvon, Rebecca and the whole staff for taking care of every detail."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1NHVmbzJBRRAB",
            "text": "We had our engagement party at My Kitchen and had an unforgettable time. Our guests loved the atomosphere, food and service.  Thank you for helping to make our party vision come to life."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNmFHbVZBEAE",
            "text": "I had the most incredible experience at My Kitchen Forest Hills for my wedding. Rebecca and her team were simply outstanding. They were incredibly accommodating, kind, and helpful throughout every step of the wedding planning process. I can't recommend My Kitchen Forest Hills enough – it's a solid 10/10 in my book!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNGNhWVJ3EAE",
            "text": "La atención de Iván, Rebecca y todo su equipo fue excelente. La comida estuvo deliciosa y el lugar es hermoso. Muchas gracias Iván y Rebecca por su excelente atención."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeXZ5dXp3RRAB",
            "text": "Oh what can I say….  Place is Pretty, quaint,  narrow and small.   With the decorations it made it the space  look beautiful and intimidate.\nThe 1 bathroom was very clean, this is always a must. The Kitchen is an “open exposed “ space, it’s small “house” kitchen. Food was pretty good,  a bit bland.  Served Family style. The pastry area was set up very pretty and very tasty.  The open bar truly took advantage of the guests.  Each drink $24+ INSANE. Not appreciated!   This place is Good for a night out, to have other types of functions.  Not very accommodating truly for a wedding unfortunately. NO BRIDAL SUITE, No private bathroom for the bride,  the single doorway to announce the bride and groom together.  only fit only 1 person to walk thru at a time. Should be a double door.\nRemember to ask what are all fees up front.  Did not appreciate the extra fee of $1000 for open Canopy on windy rainy cold day.   The canopy itself was clear, all still look beautiful.  The price for a wedding was the same as it were a true catering hall.  I believe it should have been less.  Any other type of party is good.   Not my taste for a wedding.  I wish the owners much blessings on their new  business as it has the potential for something grand."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabDdhWXpnRRAB",
            "text": "We held my sisters bridal shower here and we couldn't have been happier! Rebecca and Yvan were there every step of the way, making the entire process so easy. Day of, the staff was so incredible, attentive, and professional (even with our…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadTUyZWdBRRAB",
            "text": "We found a gem! We had about 50 people for my Mom's 80th birthday party and we couldn't have found a better place to celebrate it. Rebecca was such a wonderful host. We are grateful for her for hosting us and her husband Chef Yvan. The food was absolutely delicious. We are all about the food! Thank you, My Kitchen FH!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaODVXVVRnEAE",
            "text": "We had a great time planning and hosting our wedding at My Kitchen. The venue is beautiful and perfect for a small wedding, especially when you can take advantage of the outdoor area for the ceremony. Our guests all complimented the set up and food. Chef Yvan prepared a delicious meal, we especially enjoyed the shakshouka. Rebecca was very organized and available to answer any questions we had while planning. Day of, Rebecca and her staff were great at communicating and making sure we were happy and on schedule. Our only (very minor) feedback was that the cut off for the music was a bit abrupt, but that being said we were appreciative to save on a DJ and were very happy about the audio set up. Very reasonable pricing for the area. Would definitely recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweGZ6NlpnEAE",
            "text": "Absolutely phenomenal venue. My wife and I got married in June and we made the best decision ever in choosing My Kitchen. Rebecca (the owner) was very professional and responded very quickly to our questions and concerns throughout the entire process. She is extremely detail oriented and a true perfectionist. Her Husband, Yvan is an exceptional chef and was able to adapt and make special request food that was exquisite and loved by everybody. A Google review cannot do justice for this charming and intimate venue. If you are considering having your event here please look no further. Whatever goals you have in mind they will go above and beyond to make sure that they will be fulfilled.\n\nOur wedding had 65 guests and we were concerned that it would be somewhat tight. Boy was I wrong. There was plenty of space on the dance floor for everybody to enjoy the most important day of our lives. We received so many compliments about the venue from our guests . The outdoor space is absolutely beautiful and quaint. My Kitchen will make ideas you have come to fruition! They exceeded all of our expectations. Thank you again Rebecca and Yvan!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwekxtcWVnEAE",
            "text": "Rebecca and Yvan are top notch venue owners.  They are down to earth, honest, pleasant and genuinely good people to work with. We had the pleasure of hosting our sons Baptism with them in August 2023.  They make planning so easy and are willing to go above and beyond. Rebecca was able to follow my notes and set up the decor for the event since we were coming straight from the church with the baby.  The food, as always is stellar. Yvan consistently impresses with the quality and tastefulness of his dishes.  Their space is a beautiful, elegant and clean.  Providing you with the opportunity to bring in your vision or keep things simple and still stunning. Our event was seamless and our families were very pleased with everything.  Will be hosting more events with them in the future."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2eWFQOEJ3EAE",
            "text": "Such a beautiful intimate space. My husband and I were trying to set a date for months and kept in close contact with the owners. They were extremely kind, humble, and professional. They made us feel like family and were also extremely polite and patience to us, especially in these times. There prices and rates are very reasonable and they were really accommodating with so much. We will definitely recommend this venue to anyone seeking an intimate setting. The food was delicious, especially the fish Tacos, our guests raved about them. They are very kid friendly and courteous. We really hope to work with them again in the future. Thank you My Kitchen for making our day so special.❤️❤️❤️🥺🥺🥺🥲🥲🥲"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaU9xNm53RRAB",
            "text": "On June 25, 2023 I had the most beautiful bridal shower at My Kitchen! Rebecca and Yvan were a pleasure to work with and lovely people from the get-go. The venue is really so special and such a hidden gem in Forest Hills. The food was so…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMjRYR1V3EAE",
            "text": "We were reading the reviews of My Kitchen and were intrigued by the wonderful menu selections.  Dhanny greeted us as soon as we walked in and promptly seated us.  The atmosphere of the restaurant is cozy and eclectically decorated.  Dhanny…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCOGJYZFlnEAE",
            "text": "I’ve never written a google review before, but not doing so here would be a minor crime. But I’m conflicted, because I’d like to keep this gem a secret.\n\nLarissa (my now wife) and I just got married a few days ago. Our reception was at My Kitchen.\n\nIt’s difficult to overstate how detail oriented and precise Rebecca & Yvan (the owners) are. From start to finish, every ask, inquiry, “concern”, and detail was met with granular precision.\n\nA professional summary of Rebecca & Yvan is: Rebecca – world class organization,  faciliator, and Yvan – an equally talented chef.\n\nWe arrived at My Kitchen at 5pm. All the tables, chairs, decorations, and appetizers were prepared. It was like walking into a well-rehearsed Broadway show.\n\nRebecca greeted us the moment we entered. The rest was a blur. The coordination, timing, delivery, and ambiance were perfect.\n\nFirst, everyone’s favorite topic – food.\n\nFor appetizers, we had the fruit, cheese, and crudite, as well as the charcuterie &\nfresh pasta stations (Lobster Ravioli and Gnocchi with Pesto).\n\nWe had 80 guests. The food quantity was perfect. About 85% was finished by 6pm.\n\nMy taste buds are equally entertained by decor and presentation.  Rebecca created a scenic setting for the appetizers (check their instagram). It felt like the Garden of Eden – hanging fruits, vines, and authetic form.\n\n(side note – we added several food selections only 2 days before the wedding, and they obliged without hesitation).\n\nAt 6:15, Rebecca faciliated our initial introductions and first dances.\n\nShe coordinated with the DJ before and throughout the experience to ensure the timing and execution were perfect. The sound and lighting were also ideal.\n\nThere were optimally numbered staff throughtout the night. They inquired and refreshed drinks efficienctly (we did wine & an open bar). The bartender was responsive and talented, and the queue for drinks never lasted long.\n\nAfter the dances (630 ish), we had a few speeches. My wife, myself, parents, and the bridal party spoke. Throughout the speeches, the staff replenished drinks while not interefering with the actual content of the speeches.\n\nAround 7, we started eating. Our selections\n\nWe went with the buffet format, and didn’t have formal seeting charts. We wanted a minimalist and non-draconian event.  Rebecca quietly faciliated a steady delivery of food acquisition for the other tables without an obtrusive global announcement.\n\nFrom 7:00-9:15, people kept eating and drinking. Again, there was never a wait for anything. At 9:15 we cut the cake. We also had their French and Italian pasty stations as supplemental options ( 90% devoured by end of night).\n\n(another aside – Rebecca boxed the remaining entrées, main courses, and dessert for us to take home)\n\nThe night ended around 10-10:15. Everyone had a memorable event. We enjoyed the exact experience that we set out to have. Our vision was truly 100% realized.\n\nI’d describe My Kitchen as ideal for any party up to 100 guests. It’s intamate, but still spacious…\n\nThe staff was available but never intrusive. There was no excess, they were equally polite, professional, well-dressed, and seasoned.\n\nThey run a tight ship. Yvan spent pretty much the entire night in the kitchen, but occasionally inqiuired about the food & any needed updates.\n\nRebecca was like a genie. Whenever we were about to need something, she was there, but invisble elsewise. Each interaction we had with Rebecca & Yvan was a little hit of joy.\n\nI believe Rebecca & Yvan are as authentic as they present. Down to earth but also professionals who deliver the exact services they represent.\n\nEverything about them is youthful, from their taste, form, presence, sense of design & event layout / spacing, adeherence to details, and even intra-personal dynamics with eachother.\n\nAfter one event, we’re lifetime patrons. By the end of the night they felt like family. And whatever vision or experience you’re set on having, they will facilitate it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNbTZyY3dRRRAB",
            "text": "It was a very family friendly restaurant. Small but at the same time cozy. My sis in law had the wedding here and it was perfect. The food was delicious and the attention to detail on point. One point was that i didnt feel the air conditioners, ceiling fans were on so much as it was a warm day but overall loved the place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKLV9YZk13EAE",
            "text": "Last month, I had the honor and privilege to be part of a full day wedding. As a DJ, who has been to many venues, I was highly impressed. From the outside it looks small and based on the neighborhood, just regular. Boy was I fooled. It's…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCOGNUOTh3RRAB",
            "text": "My Kitchen restaurant when above and beyond to make our wedding reception a beautiful stress free time ❤️. From the very beginning when I first reached out to Rebecca - to our wedding day she was kind, attentive, and helpful. To this day all of our 30 guests rave about the food and how great the service was.\n\nWe're so glad we went with my kitchen for our reception. Definitely memories to last a lifetime. (Plus the team took photos and videos of our evening voluntarily 🥲🥲)\n\nRebecca and Ivan truly are the kindest people and will go above and beyond for you on your special day ❤️ Thank you again Rebecca, Ivan and the rest of the My Kitchen team ☺️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobkotOHZnRRAB",
            "text": "I had an amazing time photographing yoonjin and Michaels wedding at my kitchen. The manager was excellent and very welcoming. The food, drinks and ambiance were a dream!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4aUxldFV3EAE",
            "text": "Ok everyone, if you’re looking for an intimate venue with the most loving owners/party planner/support system/amazing people, look no further! My husband and I had our wedding party at My Kitchen last September and it was a breeze. Dhanny is literally an angel we don’t deserve and she worked with us through every single thing we needed to work though and didn’t want to think about. I can not speak higher of her, she’s just amazing.\n\nShe has a great list of adjustable per head party packages and their venue is just absolutely PERFECT. If you want to have a small wedding with a backyard feel, this is the place.\n\nAnd if you’re NOT having a wedding, also a great place for dinner, family gathering, a friend party. It’s just a great location with ample parking, wonderful backyard, great dining room opening to said backyard."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1emR1ZGNREAE",
            "text": "I just want to thank you Rebecca and your husband for making our day the most special day ever. This is truly the best venue to use to celebrate any special occasion. The food is amazing and the owners are the sweetest most generous couple ever. Thank you once again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2eVlQQTN3RRAB",
            "text": "An absolutely perfect wedding reception thanks to Rebecca and her husband. If you are looking for a venue that cares about all your needs, this is the place for you. They even packed my husband and I food to go that we ate once we arrived…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2aTdQd2FnEAE",
            "text": "Si pudiera dar más estrellas lo haría , este lugar es hermoso , aquí realizamos nuestra renovación matrimonial y fue el lugar perfecto para hacer la ceremonia y la recepción, la comida estuvo espectacular de parte del chef  y la atención…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbDdtWlFnEAE",
            "text": "We celebrated my daughter’s baby shower at My Kitchen yesterday.  The event was wonderful from beginning to end!  Rebecca met with us to plan the event and Yvan worked with us to plan a Vegan menu.  The food was delicious and the staff…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad2MtbHlnRRAB",
            "text": "I cannot speak highly enough of Rebecca, Yvan and everyone at My Kitchen. My husband and I had our long overdue wedding celebration here on Saturday and it was absolutely a dream. Rebecca is an all star and was amazing from start to finish.…"
        }
    ],
    "reviews_count": 66
}