{
    "name": "Diner Bar",
    "place_id": "ChIJxZu_0jBewokRrtAenuc5H_g",
    "grid": "QN6",
    "address": "97-45 Queens Blvd, Rego Park, NY 11374, USA",
    "rating": 4.4,
    "user_ratings_total": 1775,
    "phone_number": "(718) 897-6000",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQ1NXa3haR3N3Y1dnNGJHSXpkM0p4TjJKdlJWRRAB",
            "text": "Love the cocktails & pumpkin 🎃 cheesecake"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SS1ltdFJlVWhFWVV0cmNEaEVWWEpuU0hScU5GRRAB",
            "text": "Wonderful.\nI ordered for appetizer the French onion soup in a crock bowl, lovely. Onions filled to the brim covered in gruye cheese, was good. My entrée was grilled chicken breasts with seasonal veggies, coffee and water. I was impressed with the quality of food. This diner is very, very clean from floor boards to ceiling vents. This a rare find in NYC. It was my first time here inside. I think I will revisit after Thanksgiving. Plus I ordered the beet salad to go and another french onion soup.\n\n5-Stars to the Hosts and servers. Bring the family-friendly to Diner Bar, you won't regret anything. Enjoy! 😀"
        },
        {
            "date": "수정일: 6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOXZMV05BEAE",
            "text": "Tonight my mother and her friends went out to dinner, It was the most ridiculous interaction they've ever had at a restaurant. There was 7 of them the waiter forgot to put in my brother's order couldn't keep it straight on whar they were asking for and while 2 different people from the table ordered food to go on separate bills he thought it was okay to put gratitude on their individual bills which I find ridiculous.. They got the bill for the table the other people gave in 180 cash towards the bill and her card for the rest of the bill. The waiter took the cash and charged her card the whole about and took the cash... When she went to talk to the manager and asked for the 180dollars  back if your going to charge my acct they told her we can't do that so I dont know what's going on at this place lately but I think its ridiculous that your trying to get over on an older lady... my question would be what did he think he was going to do with the cash or that they wouldn't realize what happened to it or that they charged her the full amount, how many time or to how many other people did they try to do this to.."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dW83WDVRRRAB",
            "text": "Foods and service are good!\n10/2025 steak is good 👍"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNdFlVWk1kVFV6UjNwNlZsOTZWRTlEWVZGc2QyYxAB",
            "text": "I LOVE this place, it’s a must go. Every penny you spend at this place it’s very worth it! The food is absolutely delicious, we go here often and always it’s the best. We usually do take out which is great, but sitting inside, eating and relaxing is SOOO much better. The staff is very friendly, specially the manager Rose she is great.\n\nToday we tried two new things: the sangria and the pumpkin cheesecake.\nWe also had the skirts stake and the rigatoni a la vodka -I cannot recommend enough.\n\nWe eat here frequently it’s one of my favorite spots. Also here is a picture of the cheesecake, I could not resist trying it before I remembered to take the picture!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTllYUlFaWHBVV0hKV05YUjVRV1JRZGxGa2JtYxAB",
            "text": "Unfortunately, I came across this place while visiting my mother at the hospital. I had no idea the current owner was the owner of Tower Diner. They have beautiful seating outside, providing the weather is nice. There's plenty of seating. I came here two times. I noticed Saturday is really crowded. Service was on point. The food was so amazing. The drinks were great. My favorite is the lollipop chicken wings. The meat was so tender, and it literally fell off the bone and so full of flavor. The margarita pizza was a winner as well. Once you're done eating in this place, make sure you order their ice cream and warm brownie. There's music playing in the background as you're eating your food and having your drinks. Overall, the atmosphere is great. I'd like to come to this diner under better circumstances in the near future and I will."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdVUwcExiV0pPWlY5VkxVNUlSbmR3YkdKTldGRRAB",
            "text": "Came here two days ago because of the good reviews and honestly I’m highly disappointed and will not ever eat here again. First of all, I ordered oatmeal without berries for my son and asked the waitress if they at least put cream or some type of milk in it she said she doesn’t know (which is a red flag as a server) and that it comes with honey. Ok honey is doable. The oatmeal was cooked in water… absolutely no flavor and the two packets of smuckers honey (which tastes disgusting btw) did nothing it was DISGUSTING and my son wouldn’t even eat it. $10 for gloop. I took it home and dressed it up for my son and he finally ate it. Now onto the other two meals. My child’s father and I both ordered the steak and eggs with home fries. Both medium rare, both sunny side up eggs. While waiting for our food there were two men behind us who were also complaining about how nasty the food was for the price. Well.. too late, we ordered. Our food came and there wasn’t any flavor at all. Not even salt and pepper on ANY of the foods. I swear to god we drowned our food in salt and it did nothing. We also ordered steak sauce to atleast taste SOMETHING and it did absolutely nothing. The chimichurri had no flavor either!!! It just tasted like oil. We were only a few bites in before we both started to feel very ill but we couldn’t pinpoint what part of the food it was, my son ate some off of my plate and pooped very badly immediately. This concerned me because I’m pregnant and food contamination is highly dangerous for pregnant women. We did not stay long, we were very irritated and packed everything up and left. $80 for something so mid. Oh and our server sucked, I don’t know her name since she never introduced herself but she kept walking off and not returning. Never came to check on us and ask if we need anything. She was more interested in talking to her coworkers. To the point where we had to ask other servers for additional items. She eventually never returned and no one told us anything whether she left home or just switched. However the other servers were good. Not sure what was going on that day but I Will never come here again."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVFZFOUZiVVZNYldaNWJYRXpSV1ZxZFdwbGJVRRAB",
            "text": "Excellent food. Everyone was happy."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVGFrcEVOR1JmV2s5VGMzTm5ibnAzV21aNlVFRRAB",
            "text": "Went there for dinner on a sunday.  Good waiters and staff is friendly. Food is good especially the fig salad. I also loved the carrot cake."
        },
        {
            "date": "3주 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcFgxWm5ZMmx5ZURCaFRWUnljbko2WHkxSWFIYxAB",
            "text": "아침 브런치 먹기 좋아요."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdVRsSm1TRGxrWTBKT2RIZFRORWRpWWtGSE1rRRAB",
            "text": "Amazing place! Everyone that worked there was in a good mood and very accommodating.  I would definitely go back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONGRYcEtjMm8xUTFaak5sUTFUbmhTUVhweFlsRRAB",
            "text": "Anytime someone is visiting from out of town, we bring them here for breakfast. Very good diner food! I think the portions are just right and the place is always nicely cleaned and orderly. The staff are kind and quick with anything we need.\n\nThe food itself is always tasty and fresh.\nWe’ve come in big groups and smaller groups and they always sit us quickly and serve us well.\nI recommend!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTmMzVkxXRkY1YUhweE5uaE5hMXBhYVZkTlJVRRAB",
            "text": "The best breakfast food ever. The eggs, home fries, and whole wheat toast were well and properly prepared. The condiments were served in good proportions and in individual serving cups. I requested olive oil and palatable, fresh oil was bought to my table. The service was excellent and alert."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0T1VrZHpYMFJIZGpWcGRuUjNOazB5WmtaWVdVRRAB",
            "text": "It was ok, nothing special. I had the chilaquiles (maybe it was a mistake?) and was underwhelmed"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wb1NHaGFNekIwWVRFNGVGOUNZamxUUTBOblEzYxAB",
            "text": "Great spot for a brunch."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneWVIbDBhRTloUm5VMWJEZGFiSFZLYWxaeGNYYxAB",
            "text": "A step above a typical diner, and prices reflect that,  but it's worth it.\nThey have a lengthy bar, large interior seating area (and outdoors as well),  great deserts,  and whether you order a steak, burger or salad,  you won't be disappointed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UlIxTm5lbGt3VG1KclRXTnBkWFpHUzFCT1JHYxAB",
            "text": "Service was great. It felt like a mix of a young bar and an Italian spot visually but the food was definitely diner food. A bit more expensive but it wasn’t too bad. I’m not sure if I’d go back but I wouldn’t have a bad meal if I did. The drinks were expensive but strong!  So make sure you’re walking. There’s good things on the menu. I just wasn’t blown away by what I had."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaVdtTXljbE5qY2tocFVWUk1XVlp5Tm0xTmIzYxAB",
            "text": "I have been driving up & down Queens blvd for years and never realized this was a diner. Thought it was another medical clinic, so when I had a doctor's app up the block, took my wife there for breakfast and WOWWW!!! 👍🏽👍🏽👍🏽"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTE4zZEtjR3BhVEZaNlVEbHpZVUV4UmxORFRIYxAB",
            "text": "Such a cute diner...great food, great presentation, friendly staff! Will be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMVNrdERlVkZtVGtwalNVNHlUazFxY2kwMFMzYxAB",
            "text": "Nice ambiance I loved the outdoor.\nThe food was good I went there many times\nWe got french toast pancakes and couple of drinks. They are a bit slow in serving food.\nAnd staff is friendly. Overall is was nice"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcGFGZENaSHBFUkZJeVdqTk9WRzlPYURjMVZFRRAB",
            "text": "The steak was tender and juicy, cooked to perfection, and truly the highlight of the meal. The brunch menu had a great variety of options, and everything we tried was fresh and flavorful. The atmosphere was warm and inviting, making it a comfortable spot to relax and enjoy a meal. The staff were very friendly, attentive, and made sure we felt welcome throughout our visit.\n\nOverall, it was a wonderful experience from start to finish. I would definitely recommend this place for brunch — perfect for a casual outing with friends, family, or even a special occasion."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoakxmcndnRRAB",
            "text": "This place is a really good place for Brunch, Lunch and Dinner. The food is actually always good here. I've actually never had a bad time here. Roza, is the sweetest manager. So charismatic! The boozy milkshakes are a fave, and I enjoy the black bean burger and steak salad."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sb2RVVTNXRTFtY0hJNVYwdDFhMnhHUW5WS1VXYxAB",
            "text": "Food was good.  Service was ok."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURad056MFhnEAE",
            "text": "It's a wonderfully decorated diner. I ordered the chicken and waffles. It didn't appeal to my pallid. But someone else many feel different. I had fresh orange juice. Straight from the orange 😁😁😁"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcFQzVnNVbmxHYTJOdU5YSkNOV0pKVWpscWRHYxAB",
            "text": "Love the drinks, excellent service and atmosphere 👍🏾👍🏾"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GZldEUTFWSHBoWTNWNmRYZDBVbGhvTUVOWFMwRRAB",
            "text": "We only have a good time when we get our favorite server Juan Carlos he makes sure our experience is good every time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMFVFbzRiVGhsUmpoeGRYcGZNMjlZVjNaeVNYYxAB",
            "text": "Didn’t know what to expect since the outside is underwhelming. I was pleasantly surprised. The calamari to start was crunchy and not chewy. The fried mac and cheese balls were filling and had a nice crunch as well. Fried just right. The lunch bowl was good and a big portion. I would for sure come back. They are an upscale diner type but from the outside it doesn’t look that way. Looking forward to trying other items next time. Also a spacious place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSU2VHWnlhbVkzZG1reU9GWmxjbmhvTVRkWmMwRRAB",
            "text": "Went there on a Sunday and it was packed!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Nk9ETm5TM1Z6VEhGSFRsaGxWVzFwYVU0eVRuYxAB",
            "text": "Our server was very busy so she took some time but thats ok cause the food is top notch"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbFV6bFZOVEV5UXpGV2QxaHlZekpSVTNOVmNtYxAB",
            "text": "This review is about the slices of cake they offer from the to-go area. Although they are good, the price of the red velvet $10 does not make sense?! It’s like half the amount of the other cake slices for the same price. I get inflation but…"
        },
        {
            "date": "2달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbk4zaGlXRVJETjFkZlF6STRha3RyWm1WaFpIYxAB",
            "text": "阿春当年经营的湘院楼、上世纪北京人在纽约的取景地；值得一续🧧"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbFpXZENlRFpVVEdkT1ZYUnVlVm96V1ROa2VuYxAB",
            "text": "I love their food. They have different options that can be hit or miss but their classics are excellent. Burgers and pancakes are amazing! Boozy milkshakes are delicious too."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSX09LdHZnRRAB",
            "text": "Very delicious Brunch!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUU5IbzNhVVphUVhCUVQxOUZXRlp6YjJsbk9IYxAB",
            "text": "The owner is absolutely lovely, inviting, and friendly! She personally checked on almost every table, including where my friends and I sat (at the bar), and even treated my friends and I to a free drink on the house to taste. Surprisingly the drink had zero sugar and tasted fantastic, Her warm soul and vibrant spirit made the entire experience amazing. We each gave her a big hug before leaving! I highly recommend this place, and my friends and I will definitely be back very soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUE9EQkdWemhYVmtoVmFqRjZZVzgxY2xGeFpYYxAB",
            "text": "The food is decent, nothing to complain about nor to brag about, however the service was questionable.. I was picking up an order and while I was paying, the guy behind the register was supposed to give me my change, I don’t think I’ve waited a full minute or so in my life before receiving change, he was typing something on his phone and I’m pretty sure it wasn’t a calculator.. it was a long night so I didn’t feel like mouthing anybody off, just a heads up to anybody who expects decent service from this establishment."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdzgzODRnRRAB",
            "text": "Dope experience. Rosa is the best. Food was too quality. The menu is small for a dinner style eatery, but it shows in the quality. Parking is tough in this area. Meter parking in front.\nStill here. 2025. Great food and service. Hercules and crew were so sweet. The server told me he had the same Milkshake I ordered for dinner the night before. Always a good sign when the staff is eating the restaurants food!\nTHE BEST MILKSHAKES EVER!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaVFreHhZbU15V1VScGQxZzFibkJaUzFaQlNIYxAB",
            "text": "Food good drinks everything it's worth a stop and try great for an date"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Vd04waEJTa0ZwY0cxQlFrMUpNa1psWkRCUGVWRRAB",
            "text": "Wonderful menu options. Food is very tasty and the place is clean and with good service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Fd1pHVm9YMjUzWnpSeVJrUlNhVXhGYlVOcGVIYxAB",
            "text": "Very fast service!  The waiter Miguel was a great and professional server. 👍🫡"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVeWNGQm9TRGhLUzNORlZWRjBTa0pxU2tJMmVuYxAB",
            "text": "This place sucked. The servers were hella rude, and the French toast was almost raw. I think there was hair in the grits. Very disappointing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGU1oxRk5RemhoV25velEzZDRUbnBWYkhSbk1VRRAB",
            "text": "We dine here quite often. The food is consistently good and the service is top notch.\nTonight’s mango cosmopolitan with tequila was a highlight 🍸🍸🍸\n\nSpecial thanks to the always wonderful manager Roza and our delightful waitress Anila."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWVdIRXhkMWhpY1VGQ1JFWk1NVnBpV2xGYVRtYxAB",
            "text": "Always good. Never disappoints."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWGFFZGlZMlozYUhOT09EVmxTR1JFT0Zsb01uYxAB",
            "text": "Had a really good, humongous burger, and amazing sweet potato fries! Music and vibes are really good too with nice outdoor seating as well!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSFkyRjRTbTB3YnpkUVgwaG5UV1I0WkdKbFQwRRAB",
            "text": "Incredible food, incredible drinks, incredible service, incredible atmosphere. Love this place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdlVGSlRjVTUxZW5CbFprODBSazUyYzBoM1dsRRAB",
            "text": "Delicious food, nice atmosphere.  We are definitely going back."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMU4ya3lZbTAwV0ZCMFVYRlhjWEZHVFdsVk1XYxAB",
            "text": "The ambiance was nice, service from wait staff was attentive and well paced for the amount of people in the restaurant. The menu had variety and something for everyone there. The food was delicious and the portions were generous."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORmJWazFUMk5XT1c5WVMyaEtNRlpNVW5nek5VRRAB",
            "text": "The place is beautiful, with a good atmosphere. You can sit at the bar, and they also have outdoor seating. I ordered chicken and waffles, which were fine. The service could have been better, but I'll visit soon to try more of the menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMVpWRXdPWEZ6WWxCUVFtSm9PRkEzZUhkd00wRRAB",
            "text": "Nice place! Love the ambiance Part classy bar-Part classy restaurant diner. Food is great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNWQySjNRbVJ6YjBkTE9DMVhVMVk1YWtaMWNIYxAB",
            "text": "Enjoyed brunch at this local gem. Ordered the Napoleon French Toast and The Standard. This establishment always serves such big portions."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVVJuQXpaVmRYTUZSUVdsTjFXVXhIVldkT0xXYxAB",
            "text": "Great food, drinks, and friendly staff."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5cDRfdnJRRRAB",
            "text": "기대 이상으로 음식맛이 좋아요."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveDQyNlNREAE",
            "text": "I really enjoyed this place as a breakfast spot with my wife. The service was fast, efficient, and very friendly. The menu is your classic American diner style, but they also offer some unique options – I tried the steak and fries, and it was delicious! The restroom was spacious and clean, and overall, the atmosphere felt warm and welcoming. A great spot for a morning date."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfektQZmV3EAE",
            "text": "wanted the American diner experience, so came here for breakfast on Sunday. it was quiet and plenty of seating around. servers were very friendly and offered advice on the food. the waffle was great but the chicken was average with its basic egg batter (not crunchy). pan cakes were spot on, soft and fluffy. overall a good experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJdVNqNkw1bllYWVdBEAE",
            "text": "Visited twice already, and I enjoyed lunch more than breakfast. Their burger was delicious, not a fan of beef and potato hash, not much flavor. Shakes and drinks were delicious. Service were great. Would return and recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIektMYWZ3EAE",
            "text": "I’ve been coming here for a while now, always receiving warm welcoming from the staff.\nI enjoy the food, usually I order what you see in the pictures.\nthey also have great alcohol varieties especially when Rosa is preparing it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNm9XLU93EAE",
            "text": "Went for brunch on a rainy Sunday, the restaurant was packed with families celebrating Mother’s Day and there was quite a line outside, but we somehow managed to find a table for two.\nThe place is absolutely gorgeous, elegant and extravagant old school style diner, with comfy booths and a sexy, well stocked bar.\nThe service is really good, nobody rushed us out despite the large crowd, and multiple people checked on us not intrusively throughout the whole brunch.\nThe food was really good, we really enjoyed the burger and apps, a bit disappointed in the chicken sandwich which was quite dry.\nThe absolute star of the meal was the boozy banana split milkshake, literally to die for.\nWonderful experience, def going back soon!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncXREaVhnEAE",
            "text": "Food was amazing and the service is good! If you don’t know what to get just ask the waiters to give you suggestions, Melissa and Rosa really helped us get what we wanted!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbGNmN3BBRRAB",
            "text": "Food at this diner was good looking and decent, with classic diner fare like breakfast, burgers, fries, and milkshakes. Service was average, with some room for improvement in attentiveness. Overall, a decent option for a casual meal"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNjltN0pREAE",
            "text": "it’s one of the prettier diners i’ve been to in my lifetime. they are a bit pricier than your typical diner though, but they also have a full bar if you’re into drinking. in the past i’ve tried their chicken and waffles, their Standard breakfast dish, huevos rancheros, and their turkey club. all great options but again— pricier than your typical diner, especially for Queens. i wasn’t the greatest fan of their corned beef hash dish but every dish served is presently nicely and all the servers are always very attentive to their tables."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OU1UMHFnRRAB",
            "text": "This establishment has really come a long way. It is spotless inside and the food is truly delicious. I stopped in and had the calamari which has pieces of fried banana and red pickled peppers with it. It was delicious and fresh. My server was Melissa who went over and beyond to ensure that I was happy and satisfied, she constantly arranged while she worked and was a happy and very pleasant to be taken care of by! The manager, Rosa, is also extremely accomodating and honest about options. She makes a killer delicious sangria too, she is known for it! She is very hard working, doesn't stop moving and walks around greeting every table to make sure everyone is happy. The staff here want to make sure you get what you want and are pleased. We also had the akirt steak (I like mine well done) and they prepared it exactly as I wanted. The steak was fresh, perfectly seasoned and LARGE! DEFINITELY better than most places and even better than some places known for it. I will be back. The environment is extremely quaint and the people and food are beyond pleasant and extra special.  Very pleased with this place and you will be too! Thank you for such an enjoyable lunch!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMcXZtZUM2bmJ2ejZ3RRAB",
            "text": "Extremely rude and unprofessional place to dine at. Save  your money and go somewhere else. The front desk man clearly saw we had made reservations but just coz one of my friends came few mins late, alright majority of the people was already there , refused to sit us and made us stand there when there was available seatings. His excuse was he taught we won’t order that’s why he didn’t want to sit us down when clearly we made reservations. He judged us based on our appearance and he kept saying he taught we won’t order. Man was very rude and racist."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnXzgzRzlBRRAB",
            "text": "Very nice upscale but relaxed feel. Menu with great food and drink options. Had a business meeting would love to go back with family and friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIc09HU2J3EAE",
            "text": "Stopped here for quick brunch w my wife. Was greeted nicely then was told my\nService animal wasn't allowed without paperwork. I showed my service animal ID and notified the host that asking for the paperwork is illegal and he replied he was unaware and will look into it.\n\nEverything was great  and the place was super clean. I didn't know the eggs Benedict came with ham and the staff were really nice and replaced order for me.\n\nGreat place I recommend for a quick\nBite."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aGE3QjlRRRAB",
            "text": "We live so close by but never tried this place until today. A great service, staffs were very attentive and friendly. The place filled in pretty quickly and by the time we were done with the food, it was packed. Everything we ordered was fresh and tasty. Will come back again to try other dishes for sure!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NnRLUFJREAE",
            "text": "I went there on a Saturday night, I was surprised to see it was fairly empty. I can only assume it has most of its clients during the day because it is in a very commercial area.\n\nThe drinks food and appetizers were delicious. I would certainly go back. You have to try the sweet chili shrimp."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMTl6d0dBEAE",
            "text": "The place is very nice and the food was good overall. They forgot my bacon when I asked them to sub or for the Canadian stuff on the eggs Benedict but Anna was a really nice waitress she checked in with us several times. I don't think it was her fault at all. My partner raved at how good his food was, I found my eggs a bit over cooked but I loved the Mac and cheese balls, so good. No bottomless brunch unfortunately but we enjoyed it and would come back. Next time I'll try the pancake tacos."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZXZfLW1GbTlPWWt3RRAB",
            "text": "This place is simply amazing! The food is delicious and the staff is friendly and professional. The diner is clean, and even if you have a large party like we did, they make sure that everything goes smoothly. For example making a reservation wad easy. We went in person to also look at the place and the gentleman who helped us was kind enough to take the time to give us our options for setup and where we could sit. Also, our waiter Juan was great! Will definitely return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaWN5WXZBRRAB",
            "text": "Very nice place.   The steak was cooked just as I requested.  Tried colored potatoes were delicious!  My friends,  picky eaters, were very satisfied.  I would definitely be going back there.   I was there at 8 am. Metered parking, but at 8am,  all spaces were open."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaHBuN1FREAE",
            "text": "Diner Bar is a standout culinary gem that delivers an exceptional dining experience with its impressive service and mouthwatering menu. The moment you step in, you're greeted with a warm and inviting atmosphere that sets the tone for a memorable meal. The service is truly top-notch—attentive, friendly, and knowledgeable, ensuring that every aspect of your visit is handled with care and precision. The burgers at Diner Bar are nothing short of spectacular. Crafted with high-quality ingredients and cooked to perfection, each burger offers a delightful burst of flavor. Whether you prefer a classic cheeseburger or something more adventurous, like their signature creations with inventive toppings, you’re in for a treat. The freshness of the ingredients shines through in every bite. Beyond the burgers, the overall food selection is equally impressive. From hearty appetizers to delectable sides and indulgent desserts, each dish is prepared with a focus on quality and taste. The menu caters to a variety of preferences and dietary needs, ensuring that everyone can find something to enjoy. In summary, Diner Bar excels not only in the quality of its food but also in its outstanding service. It's a place where you can relax, enjoy a fantastic meal, and feel truly valued as a guest. If you’re looking for a memorable dining experience, Diner Bar should be at the top of your list."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoenRUWElREAE",
            "text": "Our favorite place in Rego Park. Food is delicious and portions are really big. Very friendly stuff and the service is excellent. Love the comfortable seats, and the outdoor sitting when the weather is nice. The food is amazing and always fresh. The manager Roza is very friendly and attentive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLTdYWTNnRRAB",
            "text": "I visited on a Sunday afternoon with my family (including two toddlers in tow), and we had a great brunch. We hadn't heard of this diner, but we were on our way to the Queens Museum and decided to eat here as it had positive reviews and appeared family friendly.\n\nOur server, Alana, delivered amazing service, and the food came out quickly! We ordered the pancakes, with a side of turkey bacon, as well as the Capone omelette. We all enjoyed your meal, as well as the lively kid-friendly atmosphere. Highly recommended!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicWVuLWp3RRAB",
            "text": "The food and service were incredible. We ordered the Poblano Braised Short Rib Hash and the dBar Burger. I recommend both. The staff was super friendly. We'll definitely be returning."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNEkzQ2pBRRAB",
            "text": "Nice place for brunch!\nPretty big portions, fresh ingredients and fast service.\nMore expensive than a regular diner but worth it.\nLunch bowl is my favorite so far.\n\nBut coffee wasn't good for my taste. Probably different beans."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6aEtIaDNBRRAB",
            "text": "When someone says diner I think, mehhh burgers and fries, ok.. However,  this place is great, they have delicious menu options and every single one tasted amazing.  The mimosa tower was also a win!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1LV96em1BRRAB",
            "text": "Diner on Queens Blvd in Rego Park. Very nice spacious place also plenty of seating area outside. It’s get very busy for brunch and I don’t know why servers have to do drinks as well they definitely should have bartender working for busy time in the restaurant. Soft shell crab Benedict was not as good as I was expecting. Home fries was burned with no flavor and hollandaise sauce was very blend and very weird texture. Actually was very disappointed with that place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbDlmVURREAE",
            "text": "Pretty good experience! Food was good, presentation was nice and everything came out in a timely manner."
        }
    ],
    "reviews_count": 76
}