{
    "name": "The Cottage restaurant bar",
    "place_id": "ChIJx_PePXNfwokRERDpPk6YQ_g",
    "grid": "QN6",
    "address": "108-07 72nd Ave, Forest Hills, NY 11375, USA",
    "rating": 4.4,
    "user_ratings_total": 469,
    "phone_number": "(718) 480-8052",
    "reviews": [
        {
            "date": "18시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcmVUbDFRek5tVkc1TGIzcDFXRWhLZFUxMmJuYxAB",
            "text": "Do you want more 5-star Google reviews? Best of all, they’re free! We can provide as many as you need to help your business reach the top of Google Maps. Contact us on Telegram: @gthisjpeg"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oM1pIQjZOV3hRTFhwQk5IbDFiRVptYzJaSk5FRRAB",
            "text": "Brought a British citizen with me.  The cod fish in the fish and chips was obviously frozen cod because it wasn’t flaky inside the crust..key lime pie lacked firm consistency"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVmRGQjBTMFpRWm13M1V6RlVjVk13YW1wcmFtYxAB",
            "text": "All around bad experience. I do not plan on going back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNVNFWXdSRmxNUkdwWlpGZFRWMUkyVTFOamJsRRAB",
            "text": "Unfortunately, my first experience there was not good. We have ordered appetizers, lunch, coffee, and milk for kid. However, it took 30 min for the coffee and hot water to be served. Another 10 min for the half&half to come. My kid waited for another 20 min for his milk to be served. We are very hungry and just learned that none of the food was cooked. No appetizer after  1 hour of waiting. Also, the pizza restaurant next door had cooking smoke released directly to the outdoor seating area of the Cottage. The smoky smell was not pleasant for the long waiting time."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obWFrSkJkRXMxYTJsaGJYRlZlblkxYUdoc1VXYxAB",
            "text": "Food was ok but the service was terrible. The waitress did not seem to want to be there and was not good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toM1pXaGlRVTVJTVMweWVtbG5aM1V3ZDNkbmJVRRAB",
            "text": "I haven't been here in years and they must be under new management. While they had a few tables outside, there was only two tables full in the dining room, my table and one other. We waited over an hour for our food and the soda bread was so stale and tasteless. Sad to say but this WAS a gem in Forest Hills."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WYVNtOHphblZXTnpaMVdGZHFRa2RvYlhCeFFXYxAB",
            "text": "Great food, good vibes at the bar, great service, every time I go"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205T2JXTkJiemN3Y2sxSlRFZEZlRzVqYVZoV1ZHYxAB",
            "text": "Remarkably good pub grub served up  in an evocative atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTlFqZE9UMUZXUTFGUlh6WlRWbEZvTW1kdk9VRRAB",
            "text": "Best Shepard pie I've ever had"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkamJIQXRRMGMxVWpGRVFXcHRkelZ5YVZVMldWRRAB",
            "text": "Love the vibe of the place and the bartenders are great bur the server was rude and distracted by a FaceTime call half the time. Also unattentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podGQyWnRUWHBWWm1oalRuSkZiMWczYTJGTFpFRRAB",
            "text": "Very nice staff and great food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMFRURllWVmhRWmxGUVMyTkxkamMxTjNsNWFIYxAB",
            "text": "A friend and i went here after seeing a show in Manhattan.  The wait staff was great, very attentive, and friendly.  I ordered a Corona, and Burger.  Burger was MEH, you can tell they use frozen patties, and not fresh chop meat, burger had no seasoning on it on VERY BLAND AND BORING, however i was very hungry and ate.  The Atmosphere typical bar, sports on the TV, and LOUD, they do offer outdoor seating we sat inside since it was so muggy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeGVuUlJhRGRhYVZkcFdYaFhabGRLZUdFemVtYxAB",
            "text": "The service was pretty good but the garlic streak had no.taste and it was tough."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMlIyWXdZUzFpT1doNVRIQkNTRFJDYkdRMlZIYxAB",
            "text": "Young female was  rude while I was still eating and having wine and felt like she was pressuring me for the check so I asked for it so while I’m eating taking the money out she waited in front so I paid. Then I  asked for containers didn’t bring enough had to asked again. I requested to speak to a manager he came so he king of understood  I Ben going there fog 30 years. He kne me he said other people complained about her and asked my cell number. When he left I walked out I said to her she should apologize and she yielded I was crazy. Very disrespectful"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eFVWRnNlVnBpVldSS2RrMXdXblZHY0dSSGRYYxAB",
            "text": "Staff is great!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xObVNDMDJNREZ4VkRGQ1YwSkllRWQxZUVsU05uYxAB",
            "text": "This place is our go-to spot for winding down after work! Cozy, old-school, and full of friendly vibes. Nothing beats their French onion soup—it’s hands-down the best in town—and pairing it with a cold classic beer melts away the stress from the workday grind.\n\nBesides their amazing onion soup, I’m all about the shepherd’s pie, and my husband is obsessed with their chicken wings."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WR09YRnJabWxMTmtOM1ptWmFhMGhNTnkxNVJtYxAB",
            "text": "I'm giving 10 stars for each: food, service, and atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUlV6WXlaMlU1TFhCbVJqZE9XVkJQY25Cb1JIYxAB",
            "text": "Drinks only but nice to sit outside"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUzMxcmJMazhmUVp3EAE",
            "text": "Great atmosphere 👌 gd food and drinks the Bantender she's excellent 👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLSFloY0xMX0tqMFBREAE",
            "text": "Claire and Marina were great. Super friendly and great service, definitely coming back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cHV5dE9nEAE",
            "text": "Cozy Irish pub, friendly service and good apps to snack on."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3a04tMVV3EAE",
            "text": "4 of us were at dinner at the Cottage this evening . Before we ordered we were told that the Corn Beef & Cabbage was $21. 2 of our party ordered it. However when we got the check we  were charged $35 per order ( plus $1.22 for cc payment)…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b01DaUZ3EAE",
            "text": "So we ordered corned beef and cabbage off the st patricks menu. It was supposed to include soup and soda bread but we were told they aren't offering the soup until Monday, actual st patricks day. Which would be fine except the corned beef cost THIRTY FIVE BUCKS. It was definitely decent but didn't come with any horseradish or mustard sauce and definitely was not worth 35 bucks sorry. Not a lot of meat given. Fish and chips was perfection with hand cut fries and service was good. Just was really surprised by the price on that corned beef and cabbage since it wasn't listed and you could get something really fancy for that price elsewhere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdS1UaUhREAE",
            "text": "Selective service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnenFYV013EAE",
            "text": "Nice atmosphere.  Pub feel"
        },
        {
            "date": "8달 전",
            "language": "zh",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOHB6ZnBnRRAB",
            "text": "有好喝的啤酒，又有美味的食物"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOGNHNGpRRRAB",
            "text": "Pretty cool Irish pub with a horseshoe bar. Service was great and drinks were legit. Definitely worth a stop in if you're in the area."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdDlEUHlBRRAB",
            "text": "Fantastic Espresso Martinis along with what always seems like home cooking. Great holiday decorating,  too! The friends who were with me were very glad we chose The Cottage over other choices,  too."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeXRuWVRBEAE",
            "text": "The Cottage in Forest Hills is a cozy spot with a welcoming vibe. The tavern side is perfect for catching a game, thanks to plenty of TVs, and the menu is full of classic Irish favorites like shepherd’s pie and fish and chips. The food’s delicious, the portions are generous, and the staff is super friendly. Great spot!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaDVhV3dnRRAB",
            "text": "Food is ok, atmosphere is fine (your standard pub) and is nicely decorated for Christmas. Low review is for terrible service, we weren't able to find anyone for water or even silverware throughout the meal. I ended up going to the bar to ask the bartender since no one else was around. My meal came late, after everyone else had finished dessert, and they had forgotten the dressing. I ended up just taking it home to put mustard on and eat at home since no one was there to ask. It was really bad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaS0yUjN3RRAB",
            "text": "Thoroughly enjoyed dinner on the patio. It felt cozy with the lights and foliage, but with a touch of spooky also. Chill vibes and good food. Will definitely recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdXQtLUFnEAE",
            "text": "Went late last night. This was the most underwhelming  and non appetizing plate of chicken tenders I have ever seen. I refused it immediately and a lady who seemed to be in charge that night (she was interpretating for the food runners) laughed in my face and said I am not allowed to refuse it.\nThe few fries were over fried and dry and the finely shredded chicken was nothing to ride home about.  We had to eat again elsewhere.  Will not be coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdzUzTFJBEAE",
            "text": "First and most important Pamela our waitress was amazing and kind, the other lady’s too thank you for your excellent service you make the experience better, the food was good and fresh, Halloween decoration love it! Even have mocktails if you don’t drink and if you just need a spot to chill out and whatch a game the vibes of the bar 🙌🙌🙌 are 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaWV1WWR3EAE",
            "text": "Yes. More of this please. Fresh drafts and good eats."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYc0p1TnRBRRAB",
            "text": "I love the decor during festivals. Hoping to go there soon and try their menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuZzZxdUlREAE",
            "text": "Service was good (staff was nice), food was what I was expecting. Felt duped when I left the restaurant and later discovered that they had tacked on an 18% service charge for our party of two, along with a suggested tip (which was then calculated based on that service charge) that I left."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIakpTeXR3RRAB",
            "text": "The tenders and fries were pretty good , surprised at the pour of Guinness considering it’s an Irish bar but overall pretty good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MzhtSnVBRRAB",
            "text": "Very nice place serving authentic Irish cuisine. I went on two occasions and have had shepard's pie, bangers and mash and a pint of Guinness. The food tasted great and the presentation was very nice. I'm not a beer snob but the ladies here do know how to pour a pint of Guinness. That pint went perfectly with the food. Hit the spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbnJQd3dRRRAB",
            "text": "lousy Sheppard pie... better if you buy in supermarket"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6aHN1a1FBEAE",
            "text": "great place with great service!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbGUzbHRnRRAB",
            "text": "Amazing shepherds pie!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUOHBTRVVnEAE",
            "text": "Love their Turkey Burger, it's delicious and so tasty. It's the best I've had in a long time.😋🍔"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcjVmZXRBRRAB",
            "text": "Large portion sizes for the price.\nLove the pub atmosphere and decor is very cute.\nServers didn't go above and beyond. Cordial but they don't come by to refill your water when it runs low."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMGI2cWpnRRAB",
            "text": "The Guinness is always FRESH!  🙌🏼🥇"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5cGVQNXhRRRAB",
            "text": "Let me start by at least saying the corned beef and cabbage was good and I was told that the fish and chips were good (by another in my party).  That's where it ends.\nSince the original owner past away the service has gone consistently down hill.  This was also confirmed by another table near us who told us the same thing, as like my group they had been going there for years.\nWe went on St. Patrick's Day, as it was my friend's birthday.  The current owner clearly needs more experience in ordering and staffing.  We understood since it was a holiday we needed to wait for a table (40 min.), but did not expect to also have to wait over an hour for food.  This we were told was due to a backup in the kitchen as they were short staffed in the kitchen.  As an owner of an Irish pub you know St. Patrick's Day is coming up, so you make sure ahead of time you will have enough kitchen staff and they come in early before opening to start cooking.  You also order enough Irish soda bread so you don't run out at 5 PM.\n\nOnce we were seated it was 40 minutes before we got our potato soup, which only needs to ladled out of a pot.  4 soups were served with 2 spoons and no napkins.  When I raised my hand to ask for spoons I was given teaspoons.  Our waitress didn’t even know that all the meals were supposed to come with soup even though it said it on the menu.\n\n25 minutes after that we finally got our main course, but no utensils. We had to ask for them.\n\nSince it was St. Patrick’s Day, they were serving many beverages in green plastic cups, but serving Malbec wine in one like it’s a barbeque is not appropriate, especially when I saw them bringing a red wine to another table in a glass.  Another glass of wine was ordered but never served yet is appeared on the bill.\n\nAt a certain point I think they were purposely ignoring our table because we kept inquiring about NORMAL things so I got up to get my own napkins and a glass for the wine.  It's also not as if we were the only ones receiving poor service.  The table next to us also did not get napkins when their soup was served so we gave them some of ours and the large table in the center had ABSOLUTELY NOTHING served to them at this point and they had been there before us.\n\nMy friend who was celebrating her birthday CLEARLY asked for her beverage to be served with her meal and it was brought over ahead of time with ice, which of course melts and waters down the beverage so she asked the waitress to take it back and serve it with the meal, which she did, but did not refresh the beverage and so it was watery.  When my friend tried to explain she wanted a fresh one that was not watery it became another problem.  My friend's cousin had ordered the second glass of wine, which she never got so she asked for water, 3 times before she received that.  Then after dinner My Mom and the birthday gal ordered Bailey's Irish cream coffees.  My Mom's came perfect, but when the second one arrived, not at the same time, it did not have the whipped cream on top, so no problem I just asked for the cream for my friend and got it, but the problem was they had given her their Irish coffee which is whiskey and not Bailey's so again we had to send it back.  When it was brought back, they brought and extra one at no charge; I guess to make up for all the problems, so at least that was nice.\nThen the bill came and I saw the second glass of wine on the bill which was never served, so again I need to get the waitress' attention and point it out, as she says \"you never got it\"?  After looking at the corrected bill I understood why they didn't care about the service, because they automatically charged an 18% surcharge and then have an additional space which says \"tip\".\nI understand automatically adding a surcharge/tip to large parties of 6 or more, but we were only 4, so where the tip line appeared I drew an arrow to the surcharge.\nThis will be the last St Patrick's Day I go there or order takeout EARLY, so I get Irish soda bread.\nPS.  The 2 Young women taking names outside for tables were at least great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OFpXMjhRRRAB",
            "text": "Had a great time. Nice music, atmosphere. People were having a great time. The food was fantastic. Inna was my server; she was a sweetheart and a great help. Will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5c2J6LWpBRRAB",
            "text": "We ordered through UberEats for St. Patrick's. $28 per entree, fish &chips/cottage pie, and I agree wholeheartedly that the food is probably cheaper in the store than through delivery service. But damn. I at least expected more than 10 fries and two pieces of chicken tender sized fish. This was absolutely highway robbery."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dDlHV1VBEAE",
            "text": "I got the Shepards pie to go and it was delicious. It was a good portion size with a lot of flavor. They gave me an Irish soda bread roll as well which hit the spot. The staff I spoke with were very friendly and the decor was charming. I'm definitely going to come back and dine in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0cE5XSUd3EAE",
            "text": "Standard bar with good pours in an area that feels like it will support a good pub. Get a Guinness because they know how to pour a Guinness. As for food, get the pretzel. The hamburger is fine but get the salt shaker ready as it is undersalted. The potato skins would be better with less potato -- maybe flimsier but definitely better.\n\nStill, I enjoy the vibe a lot. I could be here with friends regularly. Enjoy the place as a regular bar. There is a bar area and a booth/table area, so you can be as private or as public as you want."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROOTgycUNBEAE",
            "text": "Beer and atmosphere 👌"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bzhDa0xREAE",
            "text": "The Roasted Beet & Carrot Salad was really, really good. The beets were cooked well and there were plenty. The golden beets were a fantastic surprise. The lemon dressing was a great complement.\n\nThey use quality cod for the fish and chips although mine were a but greasy and caused the breading to be soggy but the Cod was flaky. The serving size was three small to medium pieces. I opted for onion rings instead of fries and should've got fries. Oh well, wanted to try the rings.\n\nThe chicken pot pie comes with a flaky crust set on top of bowl of thick chicken base and veggies. There wasn't a whole lot of chicken. Also, though it takes a lot more work, I prefer the traditional pie crust pies. Overall, our meal was satisfying and delicious."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvNGJYODJBRRAB",
            "text": "We love this place, and go every year on st Patty's day, although I'm sure they would be good any day :)  On this particular day, our food was significantly delayed coming out and they ran out of most of their dessert options. I still…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXN0pXWElREAE",
            "text": "Very pleasant (and FAST!) service and good food at a good price! One of the best Shepherd's Pies I've ever had, as well as fresh hot Soda Bread!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPc1ByNXZBRRAB",
            "text": "My co-teachers and I were in the neighborhood, trying to grab a small bite after our kids’ graduation, & we stumbled across this beauty. I must say the atmosphere from the outside was a start, the inside was the next, the food and the hospitality we received topped it all off! I would be returning soon enough! Their bangers and mash is amazing along with their macaroni 🤤. Can’t wait to go back!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwM1BmdDlBRRAB",
            "text": "They will scam you if you’re a tourist. I was a bit uneasy when we came for a concert and the bartender had mentioned it had been slow and they expected more business from the concert, she had joked “well I’ll have to keep you guys all…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnc0pXQ3lBRRAB",
            "text": "Familiar, warm and comfortable, this authentic Irish Pub is a true gem in Forest Hills. Spot-on pub menu featuring NYC's best Sheppard's Pie and Corned beef. Charmingly competent barmen Adrian and Patrick swiftly deliver outstanding drinks with a sincere smile."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMG9LZi1BRRAB",
            "text": "Great Irish service! Very cozy and super welcoming. Great food! The shepherds pie was out of this world!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdHJuQ1dBEAE",
            "text": "This place is a classic Irish restaurant and bar. The interior is  comfortable and old (in a good way) and transforms you to a better time, and feels chill and cozy.\n\nThe food here is amazing, and I would recommend it to anyone. I had Curry Chicken and Chips- which was amazing!! I could eat it forever.\n\nThe staff was quick and attentive and took care of everything we needed, and always came over to check in on us.\n\nThis place is great. If you're in the neighborhood, stop by and check it out"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdXByR1ZBEAE",
            "text": "This place is so cozy! Great service and good food! This is about to be my new spot."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbE9lT0l3EAE",
            "text": "Very nice service and cozy terrace. Fries and burger are so good! Very recommended for a break!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxMDhPQ1FREAE",
            "text": "I wasn't expecting the food to be spectacular here as we dined for the ambience (cute Christmas decor) and I know the bar section is usually more popular than the dining room. Ordered a perfectly average chicken pot pie and shepherd's pie. Was it something to write home about? No. Did it taste homemade? Certainly not. But it was fine for what we expected and came in for."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4d0tyMHZBRRAB",
            "text": "This place is great, friendly service and delicious food. We were visiting from out of town and found this place to be very reasonable in price and the food was amazing! I had the fish and chips and the halibut was well seasoned and fried perfectly. The fries were also very good. My friend had the bangers and mash, he enjoyed it as well. I saw some other dishes go by that looked delicious as well. We will definitely be back if we are ever in the area again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdkkzMTZBRRAB",
            "text": "Was ready to celebrate St. Patty's day with music and beer but they had neither....food was great though!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHcy1uc2ZBEAE",
            "text": "Legendary bar! Best food and best staff hands down!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCXzRqUHlBRRAB",
            "text": "Everything is was perfect and delicious.\nFish and chips,onion rings and shephard pie."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXMC1haTFnRRAB",
            "text": "The place was excellent as always, the service was wonderful. The place was empty for a Saturday night and when we walked in we found out why, they had temporarily lost their liquor license and could not serve alcohol. Still enjoyed my…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocF9xVkJ3EAE",
            "text": "With all the glowing reviews, expected a much better experience. Decor in the dining room was super tacky. Only Irish beer they had was Guinness. Our glasses sat empty for like 10 minutes when we finished our first beers. The \"traditional Irish fare\" portion of the menu included items like fried chicken and fries in a basket. For the more adventurous they had fried shrimp and fries. Not exactly food that will whisk you away to Killarney. The food we ordered (shepherd's pie, burger, and Reuben) was just okay. The giant pretzel for an appetizer was our favorite thing we had. I'm sure the main bar is fine for sipping a Guinness and talking to the regulars. Don't like leaving bad reviews, however, if you are looking for an authentic Irish evening out, this is not the place."
        }
    ],
    "reviews_count": 67
}