{
    "name": "Gula Southern Comfort Bistro",
    "place_id": "ChIJC4eEoLpfwokRN7JRKbMQnA8",
    "grid": "QN6",
    "address": "70-17 Austin St, Forest Hills, NY 11375, USA",
    "rating": 3.6,
    "user_ratings_total": 112,
    "phone_number": "(718) 880-2263",
    "reviews": [
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveklyZW53RRAB",
            "text": "It is in the process of being renovated. They didn't indicate that they weren't open on their website. I called the day before my friend and I went and no one answered the phone nor was there a voicemail set up."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdE5mT3J3RRAB",
            "text": "It’s closed"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dXZHS1p3EAE",
            "text": "The server was a delightful person, food is above going to chipotle  but I wouldn't go back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6emJ1QUxREAE",
            "text": "a really great place.  love the food.  the picture service is nice, but i wish they warned you what was going to happen.  it seemed like it was just a promotion for the restaurant, so we let them take the pictures.  later we felt guilted…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMHN5UnB3RRAB",
            "text": "The brunch items we had were delicious. We will be back to try dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeUwzSGVREAE",
            "text": "Great place for brunch! Tried the eggs and steaks, it was the best. Staff are lovely and accommodating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NzhueGlnRRAB",
            "text": "We were the only ones in there and the server took forever. The seafood boil was SO SALTY. This certainly isn’t southern food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N3M2ZW13RRAB",
            "text": "I came in with my boyfriend and mom. Super delicious cuisine, warm ambiance, and exceptional service. The friendly waitress added to the overall delightful experience, making it a must-visit for those seeking quality dining in a welcoming atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N0pmVXpBRRAB",
            "text": "See this restaurant on Groupon. And purchased 50 dollars one. In the afternoon,I checked with the staff in the phone that it closes at 10pm(the google and restaurant sign says close at 12am). I was intended to call for an order for take out. But the girl on the phone says 18% gratuity is also included in take out order. So I want to change to dine in instead. And then the girl said they close at 9pm. And it was already 8:40pm when I called. So I have to make it to go with no choice.\nWhen I pick up the order, I asked the girl if the gratuity is charged even I walk in making an order to go without using any Groupons. She said yes, and she was not able to remove the fee. Does it make sense to charge 18% gratuity on take out orders? If the owner see the review, you can talk to me. I need an explanation. I work in restaurants too, I never heard of gratuity on takeout orders."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbXNiNUpBEAE",
            "text": "Underappreciated . . .\n\nGood food.  Great decore and atmosphere.\n\nSliders? Bomb!  Calamari?  Nice!   Half price happy hour menu items?!?  Hallelujah!\n\nGo here.\n\nCame back eight months later . . . . Still really good.\n\nVery good burger. Calamari is super!\n\nDrink prices are super reasonable.\n\nSomeone please WD-40 the damn door!\n\nOtherwise, I would and definately will return.\n\nThis place deserves more attention!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkbHYyTGRBEAE",
            "text": "SERVICE is really good, the server always try to give you the best BUT the kitchen they need to IMPROVE 1000000%. The place has potential they just need to get better. We ordered a steak MEDIUM RARE, that came well done and then came rare, please pay attention to the plate that the client is requesting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0a0puLTRRRRAB",
            "text": "Beautiful place with a wonderful waiter whose name was Estefania. I recommend 👌🏼"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdG9MUGd3RRAB",
            "text": "Are these lamb chops supposed to be for a toddler..terrible and messy. Disappointing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdll5OUpREAE",
            "text": "My brother and I went to Gula for brunch on NYE. It wasn't busy, but it's a small space, there were 3 other tables: 2 two tops and 1 ten top. Our server, Talia, was friendly and attentive. The brunch drink menu is limited with only a orange juice mimosa flavor. The white and red sangrias are an \"acquired taste\", tart and strong. My brother ordered the chicken and waffles and enjoyed his meal. I ordered the steak and eggs. The eggs and potatoes were cooked well, but my steak was lukewarm and only cooked medium on the ends. The steak wasn't freshly seared  and tasted like it was reheated, which was disappointing.\n\nI wouldn't return to the restaurant or suggest it to anyone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWa1ppNWdRRRAB",
            "text": "Place was empty and music was a little loud. Beware undisclosed: Waitress tacked on 18% gratuity automatically even for only a table of two.  This is normally accepted for party of 6+, not 2!.  Unlikely to return given the deceptive hidden practice.  Now we know Why they were empty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWdDRLNnFRRRAB",
            "text": "Horrible food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadzhtMXZBRRAB",
            "text": "Good atmosphere, tasty food, but too pricey for that good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdmNHSVZREAE",
            "text": "Their menu is laughable. Subpar appetizer portions. Will never return. We tried their brunch n dinner. Nothing  was good to eat."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNWRqRXZnRRAB",
            "text": "Cute cozy looking place. I sat at a table that had a water glass clearly filthy and requested a new glass. The prices for drinks & food was a bit on the upper end. Ordered chicken skewers & lobster roll. I was extremely disappointed with the serving size. Portions are very small and skimped for what you pay for. Also, the silverware received was dirty too. I would never come back. Thank god there was a Groupon that made me feel a bit better."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOG9EMG1BRRAB",
            "text": "Gumbo had old crusty rice with barely any \"soup\" part\n\nFried Oysters are a hard pass\n\nThe Mac and cheese is pretty good\n\nThe ambiance is of the place is offset by the blasting music from next door,  a venue called low key which must be owned by the same people because they have the same exact cocktail menu\n\nThe floorboards are separating, our two tables were broken,  the fire extinguisher expired 3 years ago,  there were dusty cobwebs hanging onto light fixtures.  They need a manager bad.\n\nHalfway through the meal they served the security from the lounge next door  his dinner. Cool no big deal.  Sat him next to us in an empty restaurant.  Again no big deal.  Until he started eating his wings,  table manners out the window , open mouth chewing and smacking on gristle ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNzRYczdBRRAB",
            "text": "If you like frozen food this is the place for you straight out of the freezer good luck"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSN19uNmRnEAE",
            "text": "This place was horrible. The food was horrendous. For appetizers we got Mac and cheese, and mozzarella sticks. Mac and cheese tasted like it was out of a box and mozzarella sticks were definitely frozen. The burger was disgusting and so were the lamb chops. I would not recommend this place. This place was also empty which was very awkward."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeWJEWnJRRRAB",
            "text": "A small n narrow restaurant but very comfortable. It did not take us long to get seated but we were the only ones there. The decorations on the walls were soothing. The menu was not over whelming either. Considering we were the only customer for a good half hour, the kitchen took long to send out its cuisine.  The octopus, country fried steak n the blackened salmon were very tasty but I felt the salmon was over cooked. The dishes also came with collard greens but we couldn't chew through them. Happy hour was reasonable too. A little expensive but we would go back to try other dishes ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSc2RmVWVnEAE",
            "text": "Had one of the best dinners ever here. Drinks were cute and delicious. Can't wait to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMU1fRFNnEAE",
            "text": "Great spot for brunch. The french toast tasted good. The portion was small, but to be expected for brunch. Pina colada was refreshing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSLWVhUWlRRRAB",
            "text": "Friendly people, good food. Really nice atmosphere. Great brunch spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSenBiai1RRRAB",
            "text": "Had the old bay chicken wings, taste like the chef fried some wings and then dumped the entire can of old bay onto them.  Salty as hell!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSa29HT1lnEAE",
            "text": "The atmosphere was very romantic, the cocktails were delicious, and the service was great. The food presentation was absolutely beautiful, The steak dinner was great. I wish I could say the same for the broil. l found it to be too salty which overpowered the other seasonings. I was not overly impressed. Overall it was okay. I would go back for the cocktails."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobmVxd2V3EAE",
            "text": "Food and drinks were good. I had the catfish, fried calamari and lobster mac and cheese. The henny colada as a drink."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoX3BucHZRRRAB",
            "text": "My wife and I first ate here several months ago and really enjoyed it. Went back and were not disappointed. She is a huge fan of the country fried steak. It’s is a very light coating and gravy with rich flavors. I tried the ribs and Mac and cheese and it was delicious. The max and cheese will be a repeat to go order for sure. Finally the corn bread is my wife’s favorite. So much so, she will order just that for a dessert in the evening at home."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOHJmR3VRRRAB",
            "text": "Maybe I should have known better than to try to get southern food in Queens. As someone who has spent many days below the mason dixon line, I can confidently say that this is nowhere near up to standard. The gumbo was off, the ribs were dry and it was altogether a disappointment"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdzduWTRRRRAB",
            "text": "Not real Southern food. The name tricks you into thinking Gullah. Not going back. I was very disappointed. Friendly staff, though. This restaurant is NOT Black-owned, though it's listed when you Google Black owned restaurants in Queens. Don't let \"Gula Southern\" fool you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobHRqdXFRRRAB",
            "text": "Points for service, music, food portion and flavor.\nOrdered spicy chicken with green beans, lemon pepper wings, shrimp and grits, jambalaya.. all delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCXzVfdE9REAE",
            "text": "today was my worst experience in this place. I had been here several times and always the attention and the prices were good with a happy hour menu including wines. Today the waitress deceived us, she gave us the wine at regular prices when…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcTV1T2ZREAE",
            "text": "Drinks weren’t great. Service was okay and food was small portioned and not anything special."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdnBQU2FREAE",
            "text": "Food and service is ver good.  I would like to come back for brunch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtaUxPc25nRRAB",
            "text": "Brunch was amazing. I got the French toast, eggs, bacon and grits with cheese! It was all great and Veronica was the most gracious host/server one could ever hope for. Everything was served timely and the bottomless mimosas were on point. The best way to start my Saturday!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtanZHalVnEAE",
            "text": "Great food, great atmosphere, Tali was our waitress and super helpful and attentive. Food was great, seafood boil was perfect 😊…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNFp1VmNBEAE",
            "text": "2 stars because I don’t have the same experience every time .I’ve been coming here often it’s close by home but now  I just come on certain days . my first time there wasnt The best before I could order an alcoholic drink I was told I couldn’t order a drink because it comes from next door and they were having an issue with the machine. Moments later a small group came in and must’ve been cool with the owner because by the time my order was in a man came and gave them all Henny colada’s and shots and took there order he wasn’t a server  . I was so turned off I didn’t even bother to say anything to the server she already seemed to be overwhelmed and annoyed wears it on her face and being that she already told me no I rather not get the person mad who’s bringing my food out. Luckily The catfish was amazing I wanted to come back it paired nice with my wine . Sadly I will say it definitely was only good one time I ordered it seems there’s different cooks . My second time it was the day after my birthday I had a nicer young lady with long hair she was so sweet she even gave my ice cream and said happy birthday there was also server/bartender alex ,I remember him because he brought and explained the Gemini experience drink and he spoke with joy mad me laugh and told me about happy hour so I now when I’m free I go for happy hour ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlZ1ppUmtBRRAB",
            "text": "I’m leaving 3 stars because the food is really good here. I’ve been here three times before. The first two times I had a really nice experience. The first server I had the first two times, Alex was amazing! He’s very knowledgeable and understanding. He has a really nice personality and is very accommodating. Now, my last experience this past Friday , she was the opposite. The server with short brown hair Olga has terrible energy. Her smile is super fake.. her whole attitude and energy is off. You can clearly see that she doesn’t enjoy what she does or wants to be there. It was making me so uncomfortable that I didn’t even trust my drink. I don’t know, maybe I can be a little paranoid but I’m usually not wrong. I ordered two orders of wings and one more order.. the last order I changed my mind because it took too long to come out and I just didn’t trust this girls energy, she seems miserable. The manager Roy came out after I asked if some of our items can be happy hour even though we came in shortly after 8 and he wasn’t very pleasant, he told me no sorry you had to find parking but I’ll discount one item. It was fine because I cannot blame him for my late arrival. I then went to pay my bill and the server Olga told me she cannot remove the gratuity off the check after I asked. It was only two of us so therefore gratuity should not have been added. I didn’t argue I just said okay because I have worked in the serving industry so I decided to wait until I speak to a nicer manager about the issue. I then thanked her and she told me “goodnight”. She wasnt appreciative of her tip so I asked her “you can’t say thank you?” And then she did. Overall the place is nice and the vibe can be nice also if you have a really good server :-)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlZ3BUMVRnEAE",
            "text": "Food was impressively underwhelming. We didn't even take our leftovers in a box. I love southern comfort food and was so excited to try this. Sadly, it was a major flop. Save yourself the disapointment."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbWVTR29RRRAB",
            "text": "Disappointing"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcG9ISkh3EAE",
            "text": "Service could be better, I asked for coffee with my brunch, they ran out of milk, and I had to wait before getting my coffee. The coffee was bitter, let her make a fresh pot. I had the flank steak with egg, taste was great, wish they cooked it as requested, medium, not well. Kept asking for simple things that should be on the table like salt, pepper, milk and sugar. Overall it's a nice little spot for brunch."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaXB1THhnRRAB",
            "text": "Food subpar. We wanted to have dinner. They were only serving brunch. I ordered chicken and waffles. The chicken was bland and the waffles looked like they were prepared for a child. They were rainbow bright colored waffles that tasted like cake definitely not what expected. Very disappointing. I was expecting a real southern cuisine to comfort my palate and had the unfortunate experience of palate southern discomfort... Very disappointing experience. I only selected 1 ⭐ because there wasn't the option to select a negative ⭐. If you are seeking southern discomfort this is the place to be. HIGHLY DISAPPOINTED!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MC0td01REAE",
            "text": "Can't say I'd recommend. The service was subpart. The Gemini experience was a waste of money. Drinks weren't very good. My food was ok. Just ok. Nothing worthy of returning for."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MDRQQllnEAE",
            "text": "The sign outside says \"$12 bottomless mimosas\" outdoor dining only, I am in, that's a great price and I love outdoor dining. Got my girls and we went. Because THEY were short staffed they wouldn't let us sit outside. We asked if they would…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1bHFyaU9BEAE",
            "text": "Great food and service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1ckxuazdBRRAB",
            "text": "I had brunch there and the food was good. I didn't like the plantain at the bottom but that is me as I don't like it usually.  Just sweet plantain not green one. The service can be a little slow though if you come too early (like the first)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NUx6dWZ3EAE",
            "text": "Went to Austin street to have a brunch w my son in this beautiful weather day. Food is ok and service is decent. Love the Parmesan truffle fries. The restaurant has more choices for food at night time. Groupon has deal now if you are interested to try."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MzZmZ0x3EAE",
            "text": "Cajun restaurant in Forest Hills. Southern food is so comforting and I love seafood and it was good place to go. We got shrimp and grits, fried calamari, seafood boil and Cajun chicken. Shrimp and grits was good consistency and great flavor. Calamari was nice and crispy with sauce I really like it. Cajun chicken was really good but seafood boil was very watery. Happy hour drinks are amazing 50% off wine , beer and margarita. Server should be more attentive and more knowledgeable."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydVBIR19nRRAB",
            "text": "After spending some time in forest park, me and my wife along with our 1 year old gorgeous daughter went into this restaurant because we were craving seafood. We ordered lobster and shrimp along with seafood bowl with calamari/shrimp as add on. The food quality was awesome and it tasted really good, specially the lobster and shrimp entree. The service was great as well. My server was Anthony and he was awesome. He came and checked on us every few minutes, making sure we are good. I really enjoyed the food and the small intimate setting of the restaurant. I highly recommend this place to any young/old couple or even friends going out for a bite. You won’t regret it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPanJHWFZnEAE",
            "text": "My friend and I came to Gula for Sunday brunch around 12:30pm. 4 stars are for the service, but I would normally give them 3 stars for the food. When we entered the restaurant, there was no one there, and only one other group came in aside from us. This was probably a good thing because the manager was split between Gula and the restaurant next door.\n\nI ordered the filet mignon benedict ($19) and my friend ordered the steak and eggs ($19) and truffle fries ($8). I would not recommend the benedict. The medallion is so thin, so it is easy to overcook. The dry medallion was supposed to serve as a replacement for the english muffin, but it did not work. The canadian bacon was also overcooked and dry, as was the egg. I cut into the egg and the yolk was not remotely runny. I liked the shape of the home fries, but they were doused in oil which did nothing to enhance the flavor. The same could be said about the truffle fries, which were also doused in truffle oil. One thing that was decent was my friend's steak was cooked medium-rare and was juicy and delightful. The only thing I would have added was more seasoning, but that dish has more potential. The delivery driver crashed into my friend's steak plate and it fell on the floor, so they gave us a lava cake ($12) on the house. The cake was moist and was way better than expected!\n\nLike I said, food was average and nothing worth coming back for. However, the manager mentioned that the restaurant was understaffed, and that he was basically doing multiple jobs at once. We never felt like he neglected us in any way. He was kind and welcoming and handled the plate falling mishap well. If Gula is to last, I think they may need to change up their kitchen staff, but they did a fantastic job picking their manager!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXLXZIQldREAE",
            "text": "I’ve wanted to stop in since they’ve opened and was able to do so this past Tuesday evening. It’s a quaint dim lit space with little seating. I arrived at 5:30 & it seems I was their very first guest since it opened at 5 PM. It took a while to get our food which was surprising since we were the only people there.\n\nWhat we ordered;\n\nFried Oysters 2/5 - These were a bit fishy. It was actually a bit disappointing with all the ingredients listed I thought it would pack way more flavor.\n\nParmesan Truffle fries 4/5 - crispy, fresh & truffled!\n\nBrussel Sprouts 3/5 - These were flavorful but just not roasted enough. I like my Brussels crispy.\n\nShrimp & Snow Crab Boil 3/5 - The sauce was tasty but the corn was the packed frozen unsweetened corn & the shrimp were overcooked.\n\nLobster & Shrimp 4/5 - the sauce was tasty but I wish it was a bit creamier. The shrimp were small & overcooked.\n\nFYI, there isn’t a cocktail menu. I believe they are waiting on a liquor license. We had the lemonade and ice tea. Overall, the food was decent."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhbU5EMnlnRRAB",
            "text": "This restaurant exceeded my expectations. The food is a delight with an explosion of flavors. The gumbo was full of flavor and spices. The shrimp and lobster is wonderful with a delicious sauce and the ribs are to die for. The vibe of the restaurant was also wonderful and they have inside and outside sitting. I highly recommend it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXbWZxa1BnEAE",
            "text": "Came here with my fiancé for a random night out after a long day. The ambiance and server were great. Unfortunately the food was really not.\n\nPassion fruit Lemonade: 5/5\nVery tasty with a sour kick\n\nMango Mojito: 3/5\nIt was good but could of been a bit more flavorful\n\nLobster Mac & Cheese: 1/5\nIt was almost like eating Kraft Mac and cheese. Barley any flavor. Lobster must of been frozen.\n\nBBQ pork rib sandwich: 3/5\nHad a bit a favor from the sauce but the pork wasn’t heated up fully and felt like it might of been waiting for us before we ordered it.\n\nLobster and shrimp: 1/5\nGeez. The shrimp was over cooked. The lobster was over cooked and probably not fresh but frozen. There was a taste of ammonia? I dont know what was up with those potatoes but they had to be out of a box.\n\nChicken fried steak: 1/5\nAnother flop. The potatoes must of been boxed but they had the possibility of tasting better with a little more seasoning. The steak. I dont know. It was so tough and hard I didn’t really want to finish it. The worst part was the spinach. I’ve never had something so bitter and harsh.\n\nI’m sorry for this review. I’m usually very accommodating to the restaurant but I dont know here. We were the only people here and I know it was a bit late but I don’t think giving lukewarm food and subpar (and at times garbage) flavoring can be forgiven here. This place has potential since the people were nice and the ambiance was great. I think they need to ditch the frozen stuff and give higher quality foods or lower the price and make it more affordable."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycmIySTF3RRAB",
            "text": "The food was just ok. Most of the dishes we ordered lacked flavor and presentation of the food was non impressive. The calamari was under seasoned, the filet mignon was not prepared properly and the catfish was bland. The catfish was paired with their version of a mango chutney. Very disappointing. The chutney was a chopped up salsa. The sorrel was also prepared correctly. It tasted like dirty water.  The best item ordered was the shrimp and grits. Out all the dishes, the Chef got this one right  This dining experience was not a hit. Go back and revamp your dishes and be sure to taste before sending them out.  I gave this a three because the decorum was comfortable and cozy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMnZQUjBBRRAB",
            "text": "One of the best food I ever had. My experience was great, the service was excellent, the staff  were very friendly."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhN3RXc1lnEAE",
            "text": "Went here for the 1st time for my birthday and although it was a lot smaller than I thought, it was quaint. The food was very tasty, good portions and nice ambiance. We ordered the Mac n cheese, catfish, ribs, fried oyster appetizer.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeXJMWm53RRAB",
            "text": "My children took me here for my birthday March 14, 2022. The portions were small for the price & the food was mediocre. What topped off the night was while eating dinner a roach appeared on the bench and was crawling up the wall. When we alerted staff they reacted as if this was not a big deal. The waitress Daniela was very nice called the manager. Another member of the wait staff came over to us and tried to kill the roach. At this point he had the nerve to ask if we still wanted to talk to the manager. First he didn’t kill the roach and obviously we still wanted to talk to the manager. I have no idea how they have a grade A rating. After my best friend spoke to the manager he comped the whole meal that wasn’t without a fight. We left without even singing happy birthday. We ended the night at TGIF. This place was horrible!!!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhLU1hcXhRRRAB",
            "text": "3.5 stars for me. Solid food at this restaurant.  We got the charred octopus ceviche, the ribs n mac, and the lobster n shrimp. The flavors were all good, particularly the sides and sauces. Highlight was the lobster and shrimp entree - get that!  The people next to us were also raving about the flavor of their food as well. Looked like they got the jerk chicken and shrimp n grits.\nThere were little things, like some pieces of the octopus and ribs being chewy and the drinks being eh, but they were short staffed so I’ll give them the benefit of the doubt. Definitely give this place a shot."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2bThpRjhBRRAB",
            "text": "Went here to have dinner because we have seen it around the neighborhood before. The food was really good! I had the ribs and Mac and cheese and my girlfriend had the catfish. I’m giving it a 3 star because when we first arrived we didn’t…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPX0wyMldnEAE",
            "text": "The kids loved the chicken and waffles. The Mac and cheese is wonderful. The ribs were good enough, as was the catfish. The collards we're good, made with garlic and oil instead of vinegar which wasn't what I expected but still delicious. I'd definitely come back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXeFlMVW9nRRAB",
            "text": "I loved their birria tacos it was so good and well seasoned comes with three and a good amount of salad. And Elijah was the sweetest the food and service was so quick and easy. Highly recommend to come with friends and during an outing event the scene is so chill but eye catching. Everything 10/10"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdXMyb3hBRRAB",
            "text": "Food was very flavorful.  I got the lobster tail with shrimp & mash potatoes.  The drinks were good as well. They serve alcohol now so that was a plus. The waitress was very pleasant and friendly!  I highly recommend"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdDYyZlZREAE",
            "text": "Awesome small restaurant. The food was great along with the young lady that serves up. Also when ordering ask what sides come with you meal. When I ordered the chicken fried steak I didn't realize it came with 2 sides so I ordered anouther side lol. The portions were pretty decent also. Also place is not black southern but more Midwest southern but great either way. Will def visit again."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPLU5YdjR3RRAB",
            "text": "💛💙❤️ very cozy place. Went for Sunday brunch and it got packed quickly. Make reservations. The ambiance and bottomless Mimosas were good. I got shrimp and grits & chicken waffles. Personally I preferred the chicken and waffles.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyc2VpN1FBEAE",
            "text": "This restaurant is a small establishments few tables available with construction still going on. It seems catering more for takeout clientele more than dining in. It is somehow unique for Austin street Queens New York serving Southern Comfort. It is worth of trying."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtN2VheC1RRRAB",
            "text": "Guess they short people on food to make money. I didnt want to sit in, so ordered food to go. (Btw i hold myself at fault a little for expecting to get what a payed for without verifying it first) order gumbo and some other items. Well i…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURheU5lMUx3EAE",
            "text": "Absolutely delicious. I can't say enough about the quality of the ingredients and the perfection in preparation. The Lobster & Shrimp was fabulous. A new favorite AAA+++"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNGR5ZmhnRRAB",
            "text": "Love this new restaurant. It’s a great addition to the neighborhood. The food is beyond extraordinary. Got the Oysters, really recommend the Ceviche. The Mac and cheese lobster is to die for."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydU5QNmpnRRAB",
            "text": "Great food and very accommodating staff! We tried the oysters as appetizers and it was delicious! The chicken could be bigger but it's so yummy too!!!!! Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aGM3dnNnRRAB",
            "text": "The food was excellent catfish was sooooo good. The food has the southern taste. Chef cooked the food to perfection.  Will be returning and taking fruends."
        }
    ],
    "reviews_count": 72
}