{
    "name": "Fogo de Chão Brazilian Steakhouse",
    "place_id": "ChIJrdwHMBVfwokR2vrJsy8aTOo",
    "grid": "QN4",
    "address": "92-50 59th Ave, Elmhurst, NY 11373, USA",
    "rating": 4.8,
    "user_ratings_total": 7279,
    "phone_number": "(929) 379-4333",
    "reviews": [
        {
            "date": "17분 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWc1dXZHZXVmxuWkdKd2JWcHBPRVpwZG05alpWRRAB",
            "text": "We had the perfect birthday dinner for my son’s 16th birthday. The food is delicious, the ambiance in the restaurant is so relaxing, good smooth music. Our waiter Jorge was amazing, he catered to our every need. And all of our other waiters were so nice. Love this place"
        },
        {
            "date": "46분 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRmFIRmlaMnN0Y0VacWFrOWtOSGxPWWpaSmRHYxAB",
            "text": "Great service by Jorge. Great recommendation on the dessert. Best cheesecake ever"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bE5VcExVVFpZZDBaWWJFTXdXSEozU0V3ellVRRAB",
            "text": "I love Fogo, but this location is trash. The food was bland, the service was horrible, and I honestly don’t know how it has good reviews—must be bots, family members, or folks with no taste buds. I’ve never sent food back at Fogo before, but this time I did. One piece of meat even smelled like a dirty locker room. When I brought it up, management got offended instead of fixing the issue and said, ‘No one else complained about the food.’ Then they slammed the checkbook on the table and picked up the plates with an attitude. Had I set it off in there, I would’ve been the problem. Just beware of this place. The only thing good was the water."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNU1saERlbU4xUjJWelRuUlhjMlZuVlRCWlpFRRAB",
            "text": "Valentina was so sweet, AMAZING and on point with such a big group of 23 people as we celebrated my daughter’s special birthday.  Thank you for a great time and delicious food!!!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNk9USnlPVmxWVEZKS2JYUnVZbWxIYjNoR1owRRAB",
            "text": "Good and drinks were great! Our server Valentina was incredible! She took great care of everyone at my sister-in-law's birthday party and made sure everyone had what they needed!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSlZXMURlVmRoZVRRMlZFOWFXRkZ4U21KaFpGRRAB",
            "text": "We love the environment"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V1ZHbzVlRWhIUTFOTWEwb3haMWN0Y1U1NWIwRRAB",
            "text": "It was my first time at Fogo. At first the atmosphere is so inviting and the nice decoration makes the restaurant elegant.\nThe attention is great! Food fresh and delicious! Variety of salads and fruits. Parking is available."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SV1JIWmtRV1ZhVEhVd1dtSm1aM1Z1Y0dkemMyYxAB",
            "text": "Atmosphere was welcoming, amazing service. Food was delicious, very unique experience. Kaung was attentive, professional and informative.  Highly recommended."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neFdFOUZaalpsYXpONlprZ3ljR3N3WlZOcGFIYxAB",
            "text": "Kaung was fantastic—provided truly exceptional service!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TVJWbG9RelExTlVGa05ERTVTbVl3ZUdVemRYYxAB",
            "text": "Kaung was great! Attentive and excellent! Food was delicious as always!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5T1owZ3hUVTE0ZW5KNE1FcGZTRFp2U21FM1YxRRAB",
            "text": "Terrible service. Never coming back. They take so long to come to your table with the meats, and they only bring out the cheap ones, if you want the good ones you have to request it otherwise they won’t bring it. Waiters are rude and the wholes service sucked. We usually go to the one in Manhattan and we like it so we thought this one would be the same, it isn’t."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsek5FcEtUMFZKUzNKV1oyWkZTek5LTVcxSFUzYxAB",
            "text": "Delicious perfectly made pineapple lemonade 🍹"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NE16Um9XVVJyTTBSaVRIUktkbTVYUXpCclpFRRAB",
            "text": "The food was really good and my family had a great time. Best part about the night was the service! Thank you to all the servers that made our night so enjoyable. Especially kaung, he made sure we had everything we needed and more. He was extremely attentive to us. Thank you so much !"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMGFGUlNOMFpDU0VFMU9UZGhNWEJ2YUhwaWRsRRAB",
            "text": "Son excelentes en todo se me quedo mi cartera y el bartender y mesera me fueron a buscar en mi auto para devolverme mi bolso 👜 con dinero el servicio muy bueno comida deliciosa Gracias 🤩"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobWJISkpUMjVtTm0xQlkwTkZhR2hGTlhobk1XYxAB",
            "text": "Food, atmosphere, and drinks were amazing.  Waiter Kaung was GREAT!"
        },
        {
            "date": "1주 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONE9XZGxkbE16UzFGblUwa3RPR1IzUlRkaE5uYxAB",
            "text": "部好吃。"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3d2RuRmhaVTlNWDBWMmVtUnhPVEpSUlRKRFkyYxAB",
            "text": "We had a horrible experience took my husband and kids for Father's Day we waited 2 hours after having reservations the wait staff were giving appetizers and waters because you literally could not get in,  after being let in we sat and no waiter so we get up make our way to the buffet I slipped and fell with a plate of food onto someone and the manager helped me up and said nothing else the floor was so slippery,  they did nothing for me, we waited 1/2 hr for someone to come give us drinks at this point we are leaving no one came to us with the meats it was a disgusting experience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMVFWTmlOMGgzZDAxdVMyMURSV2hoUzJSb1RWRRAB",
            "text": "We love it! 🤩.  Kaung gives us the best service and the all personal as well."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNMldVRnhXbXBhUVdWa2NGQm5kREYyWTFndGVuYxAB",
            "text": "10/10 TODO!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Rd2R6VnVNSEJzT1ROall6RXdNams1ZGt4eldWRRAB",
            "text": "The food and service was outstanding!!! Top quality meats Les , buffet and the cheesy bread was phenomena. And Thank you to top it off with amazing desserts was whew!!! Thu Ta was awesome!! Lesly girl, thank you!!!"
        },
        {
            "date": "1주 전",
            "language": "fil",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oaU9WVm5WWHBYWmpFNVJVUkxkRlZhYlUxT1lsRRAB",
            "text": "Great experience"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRmVsVjRPSFp5ZEd3eFMxaFRRMWxPT0c5c1lYYxAB",
            "text": "Excellent food and great service. My partner and I decided to host a spontaneous gender reveal here tonight. Jorge was the designated keeper of the secret, and he did an amazing job at surprising us. Thanks again, Jorge!"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVWRYRktjbWh4WWtoNk1YUnFaa2hQWDJKNldsRRAB",
            "text": "Diana, la mejor me gusta ella"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVlIxZHJOMmhHV1ZKSllURXdXR0Z6ZUhkeGRrRRAB",
            "text": "Our server George was very accommodating and kind!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psZlNqSnNkVFJmUzFSUk9XMDNYMEU0YXpORWQzYxAB",
            "text": "I had a great experience at Fogo de Chão in Elmhurst, Queens! Our server Diana was amazing — she took excellent care of us from start to finish. She made sure we got the best premium meats the restaurant had to offer and checked in often to make sure everything was perfect. Her friendly attitude and attention to detail made our dinner even more enjoyable. Definitely one of the best dining experiences I’ve had — thank you, Diana, for the outstanding service!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbFRqWkpXV3h3TkhoaU5GOU9Za0pWTkhkZlVFRRAB",
            "text": "Diana was very welcoming , patient and friendly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUGJVdFlTR1ZPVUhSNFRrWjNOVmw2UldGeFpHYxAB",
            "text": "Diana was very nice and attentive !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdFVFSXpWMHRzVVRSMk5HVjNOMmxzV1hKeWRYYxAB",
            "text": "I always go to fogo. This time I brought my mother and my cousin who was visiting from the Dominican Republic the staff made sure that my mother was very comfortable especially with her not allergy and they made sure to translate everything that they could from my cousin both of them had an amazing time which just made the overall experience even better best believe one of the best locations out there. I will be back soon."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVNVZXeEdNMlJaTVhONloyTlNRbUZqTUd3MWRFRRAB",
            "text": "Always a great experience every time my bus and I come here. The food is delicious and the service is amazing!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbmQwZEVXamRSZDNodVdEbGxkVlpqTlRoRlQxRRAB",
            "text": "Bruno was very attentive and kind . we had a great time celebrating my father’s birthday."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVWMzaE5hVWxTY0dsVVQyTXhNekV6YUZWS1lsRRAB",
            "text": "Great food amazing service. We had to wait for the meat to come around because I think they were changing to dinner service. But overall, it was a good experience. My boys loved it! BEST BREAD!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKd2JuRjVSemxSZUdndFoxaE9lWEJoWlhCUWJuYxAB",
            "text": "I visited this restaurant for first time and all i could say was that it was amazing time and service we celebrated together with my whole family my father’s birthday and all  ha a good and comfortable time thanks to our server Jorge"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQ2NrdDBZMmhRZDNZelQwUnNTM3A2UTBSd2MxRRAB",
            "text": "jorge excelente servicio"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaFRVMVFSMU5yWDNwRllVWnJSekp4U0RSYWIzYxAB",
            "text": "Such a great time spending my birthday here. David is our top notch waiter. Great service!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRWJWcDVhVzVITUc5akxVczBiMFpDZVRsemJVRRAB",
            "text": "This was my first time coming here to celebrate my daughter's birthday and David was so professional, attentive and explained the menu to us to help us decide what we wanted to order! The next time I come here I would definitely request David to be our server."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNVlVVllWVUp4YURsUExXTnFZemc0YzJGcWMwRRAB",
            "text": "I had a great time tonight for my friend’s birthday. Bruno and manager Jonathan consistently checked in and made the experience so worth it! Thank you!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSkxYb3RabU5KV0dacUxVTXhkRTVyU0ZCVFpsRRAB",
            "text": "My lovely friend took me here for my birthday: I’ve been before but not this location. I had Bruno as a server and he was lovely. The manager,Johnathan, came around and checked on us a few times and made sure we were well accommodated with what we wanted. Overall, it was a great experience. Great food, great drinks, great talks !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQ2MzbFRWVlJtWVRGQ01tNWhiRTVMTFRGZmVGRRAB",
            "text": "Service was great and food is fantastic!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeldqQjBlVEl5TWswdGRYZEZlVWhsU0Rsd1JsRRAB",
            "text": "We went to celebrate father in law bday. From the start it started off just bad. The hostess(Melanie) was just stand offish, more like why we here. She should not be a front end person due her lack of friendliness.  Seated a  table that was very very wobbly.. our waitress tried to fix it with the coasters but that didnt help. Waitress inform hosted . Once again Melanie gave attitude direct us to a smaller table. We are a party of 5. 3 of us are over 6ft tall. I told our waitress we cannot fit there comfortably.. at this point Melanie just walked off with attitude.  At this point i asked for the manager.  The female manager came and fix everything.  From that point on the dinner service was great. Our waitress was great from beginning to end. This place is more for younger crowd due to the mostly cold buffet that comes with the food. My inlaws are over 60 n cold food not there thing. Meat selection was great all the passadores were great would i return maybe"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSGF6WTVWRGwwYTFWamVsUklhamt0U2poalZuYxAB",
            "text": "Took my father here for his birthday dinner and he loved it. He got to try wagyu for the first time! Our waiter, JJ, was so kind and he even brought a free dessert for my dad's birthday. He really went above and beyond to make this dinner special. The food was really good, the ambiance was lovely, and even the valet was free and it was a breeze. I love that they have valet! II would definitely come back. Thank you to the wonderful staff at Fogo de Chao."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacjhmUl9RRRAB",
            "text": "The food is great and they offered the best service tonight loved it"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eFREbEtPR0Z5WVhsM0xUWnNlVkZMVkZsaWJIYxAB",
            "text": "Anthony was fantastic. Friendly, attentive and knowledgeable. My fiancé and I came in for our anniversary tonight and Anthony truly made the difference in our experience.\nWe really appreciated him sending us a complimentary dessert!\nWe’ll certainly be back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMmRVeFNXSGRsWmtndGRrY3diVFJETW1GWlVYYxAB",
            "text": "Valentina made my experience the best at this place :)"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTmFteGpRbTl0VEhWNU4yMXlRemx0V0ZWQ1FsRRAB",
            "text": "Thank you to the staff (Valentina, David, Jesus, and Kaung) for their amazing service and hospitality. The food was exquisite from beginning to end."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WlZtUk5VRmhhTm1VM01tczBPV1ZNWjFwT01FRRAB",
            "text": "The four servers taking care of our group Valentina, Jesus , David and Kaung really showed us a great time. Prompt  and responsive to our requests, cheerful and informative the whole way through. The staff was great and the food was excellent. Can’t wait to come back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBek9VMXZlR28wUW1SQ2RIRlVZV05FZEdoeU9VRRAB",
            "text": "David was amazing, patient, informative and friendly :), hosting an entire table of people and accomadating to each and every person"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bldFZGpjVUk0WjBkRE5IcGFjbWhJZEU5TWRrRRAB",
            "text": "David and Valentina were great !!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRmExcG9VVVl0WDNCTVJuWlhZVUZEWjBKeGFuYxAB",
            "text": "Valentina, David, Kaung and Jesus were so hospitable and attentive! Thank you for your service!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SVRFdGxTMk4xUVRCRVpVTkxRMk5QWjFoUlZGRRAB",
            "text": "Ambiance and food is good. Jorge is very nice and attentive. Will come back for another occassion."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treFpXMDRlRkEwUW5OUWN6RkZiMHMyTFhSRldsRRAB",
            "text": "Jorge our server was excellent. Great service and delicious food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd1NWZEhaelpFUWtZM1ZEWTViWFJZY21SaWFFRRAB",
            "text": "I really enjoyed this location from start to finish. We began at the bar and were impressed with how quickly our drinks were served. Shortly after, the hostess came over and offered us a table, which was such a thoughtful gesture and made the experience even better. We ordered from the all-day happy hour menu, and everything was absolutely delicious!  Definitely a 10/10. Our waiter, David, was fantastic! He was attentive, friendly, and provided excellent customer service throughout our visit. Overall, the atmosphere was great, the service was top notch, and the food did not disappoint. I will definitely be coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWmRtOUJkbHB5WDJGSlZrczJWRkkxY1ZNM2RsRRAB",
            "text": "08/09/2025\nIt was my first time coming here with my family. We had a great time. Thank you very much Jesus and others for ensuring we have everything we need and we are comfortable 😊 If there’s one thing, I’d say it would be better if the skin of the fruits were peeled. That would make it easier for customers to eat. Overall, our experience is great! Thank you for having us! ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQTFVsdmp3cHVhV19RRRAB",
            "text": "Great Spot for a Celebration Dinner!\nWe recently visited this restaurant to celebrate my niece’s graduation, and it was a great experience overall! We had a party of about 15 people, and I definitely recommend making a reservation if you’re coming with a large group.\n\nThe location is easy to find and has its own parking lot, which is a huge plus in New York. The restaurant itself is spacious, clean, and nicely laid out with a good-sized, fully stocked bar. I ordered a drink directly from the bar which came to $15 (plus a $5 tip) pretty fair for NYC.\n\nWe went with the $60 per person dinner package, which included an entrée, dessert, and unlimited soft drinks. The food was delicious, and the Marketplace side station offered a really nice selection — lots of variety and everything was fresh. Most of us tapped out after the first plate, so come hungry!\n\nOne thing I really appreciated: we had three children with us, and the restaurant was kind enough not to include them in the $60 per head charge — something most places wouldn’t do.\n\nThe service was excellent, and the overall vibe was perfect for a family celebration. The total bill came to around $700, which was very reasonable considering the size of our group and the quality of the food and service. I also want to make note that I was even able to add a few festive decorations to our table to celebrate her achievement ❤️\n\nWould definitely recommend this spot for special occasions or group dinners. Just make sure you come ready to eat!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNU5VZHRhR0Z5V21nMmRFSkJiRkJWU25wTE0zYxAB",
            "text": "I had an amazing experience at Fogo de Chão! The food was absolutely delicious — everything was fresh, flavorful, and cooked perfectly. The variety of meats, the salad bar, and the overall atmosphere made it a wonderful dining experience.\n\nA special shout-out to Bruno, who went above and beyond with his service. He was attentive, friendly, and made sure we had everything we needed throughout the meal. His professionalism and warm attitude really stood out and made the evening even better.\n\nHighly recommend this location, and if you’re lucky enough to have Bruno taking care of you, you’ll be in great hands!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMGNFaEpiblZCVUdoT1ExVTRiM0J1Y2kxUmJHYxAB",
            "text": "JORGE, our waiter and the meat carvers were excellent working on October 15, 2025 at 330PM. They were very attentive and accommodating to our needs. The food were all good, seasoned very well. The lamb chops 😋 were comparable to middle eastern cooking.\nWill be back hopefully soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReGJGQlBWMnhvWHpreWNUUkdjRzVPU1V4c1QyYxAB",
            "text": "This was our third time coming to Fogo de Chao and we love it every time. Our servers were David and Valentina and they were very helpful and informative with our experience. We love it here! The food is always great quality, the ambience is very upscale, and the prices are absolutely worth it. We definitely would recommend anyone coming here and we can’t wait until the next time we come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rdFZrcENXSGx4Wm5aUmJYbG1WWHB1ZDNWbVRGRRAB",
            "text": "Not my first time visiting Fogo de Chão, however, it was my first time to this location.  Food and service were exactly what I have come to expect from Fogo de Chão. Absolutely outstanding.\n\nDespite being my first time here I was made to feel like a regular.  With warm, welcoming smiles, and a genuine happiness from the staff, that will have me looking forward to returning.\n\nDavid made my drinks table side muddling fresh fruits perfectly. While Mia and Dayanara who, in addition to being absolutely adorable took care of everything else that made my experience one that inspired me to write about. Thank you both and I too, “Hope to see you soon”"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKd2FWSnpOREU0UWtOUmFEQTJZVGRUT1d0T1JsRRAB",
            "text": "Our Happy Lunch hour has been so satisfying not because of the delicious food but the hospitality and professionalism of our servers VALENTINA and DAYANARA. They have been so kind and attentive since we were seated. We will come back again for the FULL FOGO experience!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJN1ByRUNBEAE",
            "text": "Overall, it was a decent experience. The variety of dishes was impressive, and the staff were attentive. Even though my seat was in a quieter corner, they still checked in to make sure I was getting enough meat. I particularly liked the mashed potatoes; they were well seasoned and had a nice texture. The salad bar offered a wide range of options, so most people would likely find something they enjoy. As for the meat, while the servers were generous and enthusiastic, I personally found most of it a bit too rare for my taste, which made some pieces hard to chew. It’s probably more appealing for those who really enjoy meat, but for me, it wasn’t entirely a match."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MllPYjdRRRAB",
            "text": "I recently made a reservation for last Friday to celebrate my husband’s birthday. I’m so glad I made the reservation because the restaurant was packed! This was my first time experiencing Fogo so I was very excited. We were seated in the back corner of the restaurant so as it became crowded, I noticed that the servers with the meats didn’t make it to us as often because they were running out of food before getting anywhere near our table. Luckily, our server was incredible and he noticed that I had stopped eating. Despite being incredibly busy, he went out of his way to get the servers to return with the meat option that I was waiting for. To be honest, I really appreciated his attention to detail. His service was exemplary and he deserves all the kudos! We ended up leaving a generous tip and I can’t say how much I appreciate him making the evening so wonderful and memorable! The drinks are very strong and the crème brûlée cheesecake was the perfect ending to the evening! OUR SERVER WAS JJ!!!!\n⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210b1FXVmhXRlZTYkV4R1Z5MUlVRzlxUWxWRVUyYxAB",
            "text": "We have great time for celebration my BFF bday. It's hidden gems in Queens. Staff super friendly and helpful. I cant remember all name but I have say thank you Belinda, George, Frances and especially Larissa. Hope see you soon.\nfood yummy. I will taste seafood tower next time, free valet parking. Very convenient.\nHighly recommend ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRVltcDZWRm8wTVhkSVduTjJhSFpRT1dwck5VRRAB",
            "text": "WOW! I have never been more IMPRESSED by a restaurant in my whole life. From the food, to the atmosphere & best of all the EXTREME friendliness & PROFESSIONALISM of the manager Jesus. That man made this experience even more special. Before eating I told him I was here for a VERY special occasion & man oh man did he NOT disappoint. Where do i begin? First of all he sat us in a VERY special part of the restaurant due to the magnitude of the occasion. Then the way he explained every element of the restaurant such as where do we receive the food.  The phenomenal service that Jesus invigorates through the rest of the sensational staff here & it isn't just him another manager Mia was also extremely helpful & patient when it came to our experience & the food. The food overall was a 10/10 I cannot ask for anything better, the strawberry lemonade I had was marvelous. I would like to put an overall thank you to  Jesus the manager & Fogo de Chão for an experience I will never forget!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZM2RVMDVObmhrUzBGMFN6aG9UVVJrYVVWWVNWRRAB",
            "text": "Jorge was attentive and quick. Food tasted delicious except for round 1 for garlic steak was burnt. Food was not coming out as quickly as we would like but good atmosphere. Would definitely come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVllUbG9kbXBOVFd4eWRFaHRRWEJUYW5KMVRrRRAB",
            "text": "Really enjoyed file de costela.\nSo happy for that Irish coffee ~~ a hard to find item, in most places in NY. I don’t know why, so I was happy to order it. The kids confirmed dessert : amazingly delicious!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUVRUVklhVVJNYWs5VVVtRnZXRE5WV1hsMmFIYxAB",
            "text": "George was our server and he was absolutely wonderful along with all the staff coming around bringing over tons and tons of meat. The atmosphere is upscale and the food was amazing. Will definitely come again."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcVRqSlhlVTUyVkRsbmIzSlZZbnBGZUcxSGRYYxAB",
            "text": "🥰I loved the place. It's my first time. My husband and son loved it. We're planning a second visit. The service is excellent, 5 stars. Everyone is very friendly. I highly recommend it.🙏🏻"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKU1ZrOWxkRkpzVVVGMFNsZE9URWMyWDJsUmFWRRAB",
            "text": "We visited this Brazilian steakhouse as a party of 5 to celebrate my mom’s birthday, and it was fantastic! The restaurant was spotless, the service was excellent, and our server Jorge was attentive, friendly, and took the time to explain how everything works for our first visit. The food was delicious—every cut of meat was perfectly cooked, and the salad bar was fresh and well-stocked. We left absolutely stuffed and happy—definitely a place we’d return to for another special occasion!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMVIyZzNlbDlEY0ZWTU5IRmxRVlZHYm1wSVYzYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nWe came to celebrate a friend’s birthday and had the best experience! The food was amazing, and the atmosphere was perfect — but what truly stood out was the service. Dayanara and David were outstanding! So friendly, attentive, and made our celebration feel extra special. Thank you both — you’re the best!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPQy12cDZRdjZxVUd3EAE",
            "text": "I attended a gradation brunch at this location in a Saturday afternoon. We all chose the full churrasco brunch option. The food was good although I honestly did not enjoy any of the steaks I tried (lamb and chickens were the best options).\n\nClean and well managed as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeE9HTmhiVlIwZFZNM2VIVlRPRU5hVjFsNVduYxAB",
            "text": "Chelsea was a great server at the Queens, New York location. She was patient and accommodating. I come here all the time and she is the best I have encountered."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NWRrMDJaWFZaTFhCTldGbExZVE5DTmpWWmRsRRAB",
            "text": "Came here for my birthday and had a great time. Our server Jorge was very attentive and offered great service. Thank you so much for a great experience! Will be back soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSVptUkhSWE42VmxrdE5raHpkM2xQTFY5ZmQwRRAB",
            "text": "Jorge was an extraordinary server, he made sure we were taken care of paying attention to every detail. As well as Liz she was very on top of making sure everything we asked for was at the table. Thank you Jorge for making sure we were good while we celebrated my nieces birthday. We will come back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oa09UVm9kV1ZxTTA5RlVFZExUa1ZZWWtrd1RtYxAB",
            "text": "Came in for a late father’s day celebration and fogo de chao did not disappoint ! The food was amazing , we told Bruno it was our first time and explained to us the menu in detail . The steaks were cooked amazing and kept coming around every 5-8 min so we got time to try everything twice . I ordered the cucumber non alcoholic martini but unfortunately they were out of cucumbers so I had the non alcoholic sour that did not disappoint . The manager Alejandro and our other server Rafaela were great ! Would definitely come back !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2RmU19RRRAB",
            "text": "My husband and I decided to visit for the first time and we did the Brazilian special and it was amazing!! Every single thing was delicious! They have a variety of sides and every single meat was excellent! They came often to offer all kinds of meat.\n\nThe service was great! Towards the end of our meal we mentioned it was our anniversary and the server was so kind and brought us a desert with Happy Anniversary written on it. Very kind!\n\nWe will be visiting again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zeVEyTmFNMFZ1V21sQlJEaGpNVjlvWTNsTWJrRRAB",
            "text": "My aunt celebrated her birthday here and we were a family of 6. I loved the ribeye!!! so so good and their service was also very satisfying. David was our server and he did a good job while accommodating to all our needs for each of my family member. I personally LOVED the seabass cz it melts in your mouth."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdVNXdDZTSEJQVG5Wd1RYZEtibEJFVVZWVFdXYxAB",
            "text": "We came here for my partner‘s birthday. It was awesome. The food was delicious. The staff our servers JJ and Chelsea were very attentive without being overbearing, and Larissa. The manager was very gracious and came over and wished my partner a happy birthday as well. Had the best time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQ2VsVnVObkpKYWxsaFREQmxVbXhxUkZOWU0wRRAB",
            "text": "Jorge was out server. He was very polite and the overall experience he paid extremely high attention to our group and made sure we got our drinks and food in a timely fashion. The servers that bring out the cuts of meat were also extremely polite, professional, and efficient to assure that we have an even continuous supply of the cuts that we enjoy at the temperatures we like. The drink recommendations were also excellent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNE1sVktNMmc0T1hkMmNYQmFlRUkxTTB4WlpGRRAB",
            "text": "George was amazing. He always check up on our table and he made my birthday special. 10/10 service hope to get him as a a server again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUk1UY3pOR2M0V0V4cVp6QkVaRlJKTTNoRlNWRRAB",
            "text": "David and Dayanara were absolutely amazing! From the moment we arrived, they welcomed us with kindness and professionalism. They had excellent knowledge of the dishes and guided us with great recommendations, making the experience even more enjoyable. What impressed me the most was the great care they took regarding my allergies — they were very attentive and made sure everything was safe for me to enjoy. Their combination of expertise, attention to detail, and warm hospitality made the whole experience outstanding. Truly exceptional service that deserves recognition. Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVmIyeFJXazFmTVZwc1MyTkJkRGxoVDNGSVIzYxAB",
            "text": "Jorge was our server and he was great ! It was our first time there and he went in detailed with the menu options. The food was incredible, as well as the drinks J.j the bartender was super nice and made me a delicious mango margarita ! Overall great service they are super friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SVdXazFXVXh1WXpaVFZtTkhUakZ0U21wVlVFRRAB",
            "text": "Bruno is such an incredible server! He brings so much positive energy and is always so warm and welcoming. And let's not forget, the food here is absolutely delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taT1UxSXRPVTlhWjB0VU1HWjJUVGd4VFhkaldsRRAB",
            "text": "The experience was amazing!!! Literally the best 5/5 and my waiter Jorge was top tier very sweet and on par to food service in nyc. This spot is wil definitely be date night spot. Love love love."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOU9uRjlRRRAB",
            "text": "We wanted to try the bar experience in Fogo, it didn't disappoint, the Queens location as always was amazing, excellent food, great service, the place to go when you want to relax or unwind. Jesus (CSR) was amazing and Maria (bartender) was great, she prepared the best Caipirinhas. Key lime pie dessert was very good\n\nAnother great visit at Fogo Queens, this time we tried the new Lobster Mac & cheese, it was creamy, the right amount of cheese, great flavor and lobster cooked on point, this a dish you can't stop eating after the first bite. Great compliments to the Manager Larissa for the recommendation and the server David. Like always great hospitality, service and warm treatment 10/10"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKdmh5NTNHNFpLT2R3EAE",
            "text": "**\"Rafaela was absolutely amazing! Her incredible, heartwarming energy and delightful attitude made our birthday celebration at Fogo de Chão truly unforgettable. She went above and beyond to ensure we had a 5-star experience. Thank you, Rafaela!\"**"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOE9TUnV3RRAB",
            "text": "I had an 8:30 PM reservation, but we weren’t seated until 8:50 PM, and when we were finally seated, they placed us in a corner. Unfortunately, this seemed to impact our service experience as well, since food was served to us less frequently than to other tables.\n\nThe leather seating was uncomfortably cold, which added to the initial inconvenience. To make matters worse, I noticed a female staff member drop a food clamp on the floor, and instead of getting a new one, she used it to serve broccoli, which was concerning for hygiene reasons. Additionally, a staff member serving meat made eye contact with me, walked past without offering anything, and instead served another table behind us, which made us feel overlooked.\n\nAs for the food itself, some of the meats were delicious, but others were disappointingly dry. The quality seemed inconsistent.\n\nThat said, one staff member did stand out. He was cheerful, friendly, and engaging, bringing a positive vibe to the room. He was serving chicken drumsticks and made the whole experience a bit better. I’d recommend he be considered for a host position or receive a raise, as he really knows how to connect with customers.\n\nOverall, while there were some highlights, the service was inconsistent, and seating us in a corner led to feeling a bit neglected. Improved attentiveness and consistent quality would make a big difference here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swME5HRlpVRVJtYUVweGRGUjRUbE5pT0VnME4yYxAB",
            "text": "Wonderful hospitality as soon as you walk through the doors!! David and Jorge were amazing servers! The food was delicious! Overall service was great! Atmosphere like heaven!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONFdEZHZWVkpEUzJGa1VEWlVNbDlSVmswNVpXYxAB",
            "text": "David, Dayanara, excelentes meseros y con mucha amabilidad. Les recomiendo venir a este lugar, comida de exquisito sabor.\n\nDavid and, Dayanara, awsome waiters with much kindness. I recommend this place to come because their food is delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbExYUjZkM1ZtTmtRelVIUjBOMDF3ZFRSQ2JHYxAB",
            "text": "Went to a Caiphrinha tasting event. (Bad spelling) where you got some appetizers and two drinks. It was very good. The staff was very nice and gave a little extra special treatment to the tables that were celebrating a birthday."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTWMzTjZiVmgzUWtadmJIRlFhR3h3TVhKbGNYYxAB",
            "text": "The food was amazing and the customer service was phenomenal. It was my first time but it won’t be my last. Valentina, our waitress was a professional in every sense  of the word. She was polite, well spoken and very patient. Everyone that served us was on point with the meet. Mr. Khaung was also great. Thank you all for great service… I’ll be back!!!⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xR1NsTlpkWEEyWDNSck9HaGZkamRSWlRKcFMyYxAB",
            "text": "FOOD WAS TERRIBLE, TERRIBLE, chicken was burnt, I mean BADLY & no, it was not a BBQ char it was BURNT, BLACK, CRUSTY & the chicken breast was sooooooo try you can HEAR it when you tried to rip it in half WORD UP! THE CHICKEN SOUNDED LIKE A ZIPPER THATS STUCK IN THE MIDDLE AND THE NOISE IT MAKES WHEN YOU FORCE IT UP! The shrimp cocktail the COLD ONE THE SHRIMP WAS OLD & MUSHY THE SEAFOOD IS NOT FRESH THEY GET IT IN \"ONCE,\" A WEEK & THE REST OF THE STUFF LIKE CRAB CAKE & SALMON IS FROOOOZEN YES! FROZEN THEY wayyyyyy to EXPENSIVE TO HAVE FROZEN ANYTHING EVERYTHING IN THAT RESTURANT SHOULD BE FRESH, THE IMAGE THEY SET FOURTH, THE LEVEL THEY PRETEND THEY ARE ON THE MISSSSED THE HELL OUT OF THE BAR THE SALAD BAR ALLLLLLWAYS HAVE THE SAME THING EVERY SINGLE TIME HEARTS OF PALMS, MARINATED MUSHROOMS 2 TYPES, BEANS ARE ALWAYS ON THE OTHER SIDE LOOKING DRY & OLD, ASPARAGUS,  TOMATOE TOPPED WITH MOZZARELLA, ONIONS 4 TYPES OF LETTUCE i mean come on switch up the salad bar not nearly enough seafood selections no SPECIALS OF THE DAY, the cheese bread is HARD ON THE TOP and soft at the bottom huh? The bathroom smelled like straight pee I'm like huh again. TO BE CLEAR THIS IS THE LOCATION OFF QUEENS BLVD. It was freezing in there people walking around trying to SELL you drinks ITS WAYYYY TO DARK IN THERE!! MAYBE CAUSE THEY DONT WANT YOU TO SEE HOW BURNT THE CHICKEN IS... Desert selection are BAD! My WAITER left & came back literally 35 mins later I order a shareable side and NEVER GOT! & they said OH! I'll just take it off the bill I looked like LADY IM HUNGRY I WANT MY SIDE NOT A REFUND SHE GAVE THE REFUND ANYWAY & STILLLLL NEVER BOUGHT THE SIDE needless to say I left HUNGRY which was the same way I came. The LARGER PARTIES GOT ALLLLLLLL THE ATTENTION!!! This place is NOT WORTH IT ITS ALLLL HYPE ITS DEFINITELY NOT A PERSON WHOSE A REAL FOODIE. THEY NEED TO STEP IT UP NEW CHRF. NEW BY GOLLY SALAD BAR SWITH IT UP CUSTOMERS WILL APPRECIATE THAT!  & Also CLEAN THE BATHROOM & DONT SERVE OLD MUSHY JUST SHUTDOWN ... CHEESECAKE FACTORY\" HERE I COME!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYXdwNkxWbWVhTUNREAE",
            "text": "Rafaela was a great host, very friendly and informative of the menu. Jesus recommended the deserts which were delicious.  Top notch!"
        }
    ],
    "reviews_count": 91
}