{
    "name": "ZAAB ZAAB",
    "place_id": "ChIJSR84V9NfwokRqv7h7RV5z9k",
    "grid": "QN4",
    "address": "76-04 Woodside Ave, Queens, NY 11373, USA",
    "rating": 4.3,
    "user_ratings_total": 307,
    "phone_number": "(631) 526-1664",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNFVsSnZlRUoyVkhjNGRtMVVjRTV0YXkxM2FVRRAB",
            "text": "As a Thai food lover, this place was amazing!!!\nWe ordered a bunch, including the papaya salad, the rib eye steak, and their grilled fish.\n\nThis place offers authentic northern Thai food so you know they won’t hold back with their spices! Papaya salad has a rly good kick to it so be aware but it has a a great balance between spicy and freshness. The rib eye steak was super juicy and tender and their grilled dish was also amazing/ super crisp and perfectly cooked. All of the dishes paired so well with rice and we ate it 🆙"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTU4xbDViMk0wTmpOUFdtdFRNRFJMU0RsVlZrRRAB",
            "text": "Delicious thai food. If you love spicy thai this is the place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocFJVdGlXa1pSYzFselZFdGZSMVJmZEdoUFUxRRAB",
            "text": "A single spot close to LaGuardia airport that offers really good Thai food there’s other Thai food in the area. This place stands out as a more authentic experience. I started off slowly by just getting the chicken pad Thai and it was really well-made. I venture to a place across the street wasn’t as good. I’m definitely going back to the spot as likely my to go the delayed flightlocation in the area.\n\nParking is a bit challenging, just like the rest of Queens"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KR09YWlBTMmRSVW01WVNIUjJNVloyUTFwUWJIYxAB",
            "text": "Tasty food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xa09VWjJSMjl3YlcxSVJHWnNVRUpHV21JeWNYYxAB",
            "text": "Foods are not taste good . Its not authentic Thai food.  After try few dishes that taste not good and the price of dishes and high.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seE4zbEhWVmN0TTJSSU5GWTFVVkJZUkROd2VFRRAB",
            "text": "Came here a couple years ago after they first opened, found the food good but the service terrible, went back recently and the verdict has not changed. Why do the staff have such bad attitudes, it doesn't fit in with the other wonderful places nearby."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwc1dYVnZjMmxpWDBKWWVFbEdVSHBUVWxsWU4yYxAB",
            "text": "The kapow burger was unique and flavorful! Served with a spicy mayo on the side, it was a perfect combo to balance the heat of the kapow beef and pickled jalapeños."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdE1rTnNOazl2ZUVKVFpDMDJXSEU0T0dkdlJYYxAB",
            "text": "This cozy spot features staff who anticipate your needs. Their service approach is warm, food quality solid, and portions generous. Everyone who works here appears genuinely happy. The meals are consistently good and the atmosphere adds enjoyment. This place deserves a visit from you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WU5HdEljVFJxUkRsb1VuZEVhRTFpY21aeGNIYxAB",
            "text": "Great thai food. Always ask for iced thai tea"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eU1qQllPRnBMTUZOVmIwOXBibFV3TVdkVGVtYxAB",
            "text": "The duck larb was incredible. Best larb ever?? The som tum was also exceptional. 10:10 and service is also so great. Cute small spot with indoor and outdoor tables"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRlMyNUNNRlkwU1ZSb1lpMVJOM2hpZEdnNGFtYxAB",
            "text": "Always the best."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21od04xRjFOMWhEWm5VeGRsSk9UM1V6U1hsNFYyYxAB",
            "text": "I was genuinely excited to try this place, but unfortunately, my experience was deeply disappointing. Everything started off fine until a HUGE cockroach suddenly flew over me while we were eating. It was alarming and uncomfortable — we had to leave our seats and wait outside while a staff member went to handle it. He said he dealt with it but I saw it go behind the seats so I asked him to show us the bug. My husband went outside with him to confirm if it was dead. We sat down again but I felt uneasy and grossed out. The cockroach had been flying near our food, walking on the wall and the table next to us — it could’ve easily landed in something. I didn’t enjoy my meal. We spent $75 and walked away feeling like it really wasn’t worth it.\n\nThe staff member told me that he had been in the restaurant industry for 36 years and knew how to deal with situations like this. I respectfully disagree. He only said to me “are you ok?” once but didn’t really apologize and there was no attempt to make us feel comfortable, and honestly, no sense of care from anyone.\n\nWhat disappointed me most wasn’t the bug — things happen — it was the complete lack of response. A simple sincere apology or even offering us a dessert or something on the house would’ve made a huge difference. Instead, we were left feeling awkward and dismissed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaS2MwdzJZa2xFUkVkNVJrMHlTR295VVdSelRVRRAB",
            "text": "The dishes here make you close your eyes to fully enjoy them. The employees treat customers with genuine care. The food impresses for taste while offering freshness and nutrition. The mood struck a balance between laid-back and warm. I plan to return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Q1pVTnBRMDlrTWxSS2JtdE5WbDlTVjIwNE1FRRAB",
            "text": "Foods are so good. Highly recommend it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201clozcGtlamQxVXkxV0xXaHdNRlJXUm1OMFJYYxAB",
            "text": "My experience being here couple time the food is definitely excellent and what made the atmosphere even greater for dine in my server mimi and also ben they both are doing amazing great team work ..definitely recommend the fried rice and also som-tum remind me authentic like what I had at chiang mai and isaan during my trip 😁"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcVpHMUxPVWhyWWxaUU5qSXpVMjB4TnpZd00wRRAB",
            "text": "Friendly staff.\nGreat food. Was not disappointed with the seafood hotpot. Fried fish was so good. Picture was the aftermath of the soup.\nWine and beer only."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkM1ZYVkxkVEpHVWt0bWIwMVlaRUZaV0hkamVIYxAB",
            "text": "Their laab is the best I ever had. Spicy but balanced with complexity of flavor. Salty, spicy, sour , nutty, together with  mints, lettuce, cabbages, dills …. It’s a wonderful journey of flavors"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMFFtVXpVV0ptTTA1YVlqSkdlV1ZqTUUxb1kzYxAB",
            "text": "As I know from prior visits, Zaab Zaab’s food is excellent. However, this evening, our wedding anniversary, we looked up the restaurant online, saw it listed as open, made a reservation, received a text confirmation, traveled to it, and it was CLOSED. Unprofessional."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPNmxzTmlzaThLbDZnRRAB",
            "text": "I am a huge fan. Food came out promptly with excellent service throughout. This place serves remarkably good food. The meals feature good standards across the board.  just knows how to please customers."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKeWh0WTZuMHFQZVBnEAE",
            "text": "My boyfriend and i went there for dinner . After we ate over there, my boyfriend got serious allergic all over his body. The service was poor . My boyfriend has serious allergies almost threatening to himself. I will never go back this restaurant anymore!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKVFk1cWUwN2RLczdRRRAB",
            "text": "My god!  Very yummy\nThis is real thai food. You can feel the same in Thailand.\n\nI dont know why I come back again at zaab zaab 3 time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJNzduTXZJd2N1N2pRRRAB",
            "text": "Wow\nClean\nAmazing food great people so nice and caring best real steak crying tiger in NYC !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYnZnWkNHNE9QWWxBRRAB",
            "text": "The spiciest food I have ever tried. Delicious! Thank you for making me suffer!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZX3FMSnNBRRAB",
            "text": "Truly sooooo good 😭"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZX3B5N293RRAB",
            "text": "Incredible food and ambiance, can’t wait to come back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dWF6X2dnRRAB",
            "text": "Great spicy food and staff:  friendly than anyone we encountered in food services!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3c1pYMWJREAE",
            "text": "I was here a few times before. If you are craving authentic Isaan food, then you are at the right spot! Delicious authentic isaan food and their Thai Iced Tea is great too! The waiters are very friendly as well. Highly recommend it! But be careful with the spice level!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3elBuVjRnRRAB",
            "text": "The food was okay, kind of average, for the price and the area. I expected more and was disappointed. We were the only table and we had to wait a while for our food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndl9DSVdREAE",
            "text": "You come here for the food. Period.  It's spicy, sweet, bitter, fresh, but also delicious.  The staff is pretty lovely but very small.  While they say they have alcohol on the menu, they didn't have the harder alcohol when I went.  That's fine.  Everything was great and So tasty!\n\nThe space itself Could use a bit of an upgrade and sprucing up to make it feel more modern and maybe appear like there's a bit more space etc.\n\nI haven't seen them super busy as a restaurant but expect some delay if they are busy.\n\nThe Zaab Zaab fries are my number one favorite!  It's a surprise!  Also, don't be afraid to try fried duck entrails in your lab. That's So delicious!  Branch it' out and try everything."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaFByV0l3EAE",
            "text": "Zaab Zaab is one of the best Thai restaurants in NYC. I love the larb ped udon, the kapow, the crab fried rice, the tom sum gai hot pot, the mieng pla pow fish. There's great spice and authenticity here. And the atmosphere is super cute and inviting. Best of all, the owners do so much for the community; they're heavily involved in local food relief efforts and are always giving back. It's a place you can feel good about supporting!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfd0x1OXdRRRAB",
            "text": "If you want to get SICK, get LIED too and have HORRIBLE CUSTOMER SERVICE. This is your restaurant. I don't know how they got a Michelin star.\n\nDO NOT ORDER THE HOT POT. The clay pot was cracked on the bottom and a piece of clay was in the soup. Instead of apologizing, the manager decided to ignore us and make us pay 50% of the soup. The manager who decided to lie to us saying she is just a worker yelled at us and said she was calmly talking to us when she wasn't. She was rolling her eyes the whole entire time. Not only did she belittle us, she also LIED to us. She said a cracked clay pot has no health effect and that they just brought the clay pot. I didn't know the manager was also a scientist."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdmRUel9nRRAB",
            "text": "Absolutely delicious meal, as always."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOXRYWHNnRRAB",
            "text": "Very nice food, out in 35 minutes.."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dDlIN1pREAE",
            "text": "I've eaten since they first opened, I come like once or twice a year.  Always had a great meal.  Don't mind the haters, you guys are doing an amazing job.  Thank you for the great food!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bnVhaGRREAE",
            "text": "This is my first time trying the place and I was surprised that there is a high quality thai restaurant near me. This is not going to be my last visit because of good food and good service. I would highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2c3J5U3l3RRAB",
            "text": "This Thai restaurant was absolutely magnificent! The food was off the charts—every dish bursting with authentic flavors. The Duck Larb and Pad See Ew were simply mind-blowing, perfectly cooked and beautifully balanced. The staff was incredible—knowledgeable, friendly, and full of great recommendations. The service was spotless from start to finish, making the whole experience seamless and enjoyable. Super recomendable, and I’m definitely coming back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQMk11eE5nEAE",
            "text": "A bit of a mix up on my take out order but they fixed it right up and the food was delicious."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROLWJQU2Z3EAE",
            "text": "Very authentic Isaan food. We had Tom Ka Gai soup which was spicy and delicious.. The rib eye beef is another must. Service is fast and the waiter was very nice. High recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcW9UaWZBEAE",
            "text": "The Thai restaurant that sale the best duck larb in my opinion. The chef 👩‍🍳 bring northeastern style of Thai food to New York. Since she here I recommend you try her food and it authentic street Thai food. I love it so much try the duck larb and som tum so delicious. Watch out for the heat it spicy.🌶️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYc3FxTFJREAE",
            "text": "The place was almost empty. The waiter initially refused to let us sit at a 4 people table. After we ordered food and got our drinks, suddenly he offered to switch us to the bigger table. I didn’t move since we were already settled. As a result, we got served one dish at a time as the table couldn’t fit more plates.\n\nThe food is OK. The experience is ridiculous. There are better options in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueGRYREhREAE",
            "text": "Really good 👍🏼"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIa0pUcmVREAE",
            "text": "From the grill comes goong pow, two prawns as big as Italian sausages, their heads dripping with marigold-colored fat that I would happily spread on toast and eat for breakfast. They are served with a tart, herbaceous nam jim, one of many…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3aHI3eHJnRRAB",
            "text": "Great food, service, vibe.  Steamed whole fish and shrimp appetizer were the stars and the larb was very tasty.  Easy to see why this place was one of Pete Well’s favorites."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bVBuVHRBRRAB",
            "text": "Ordered food for delivery. And the package is broken. Food was spilled all over. I called back to the restaurant and they didn’t take care. Their manager said it wasn’t their fault even they did it wrap their food properly. Spent over $80 for noting."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdWVUSWxnRRAB",
            "text": "Really tasty northern Thai food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieDkyWFdREAE",
            "text": "got the steak, salted fish, and crab fried rice. Ws about to get the chicken too but, half chicken for $28, yes half chicken.\n\nThe steak was cooked well done, I kind of wanted a little pink (med well). The bitter sauce was the most awful thing I've ever tasted but, they did warn that it's a bitter sauce. Fish was good, but a lot of work. No complaints about the crab fried rice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMDUzX1RREAE",
            "text": "Usually never leave reviews but this meal was godly. I got the kee mow extra spicy and the extra spicy made it perfect although it was already delicious. For the drink I got the lychee thai iced tea. I forgot to take a picture of the mango sticky before we started devouring it but it was all 10/10. And to top it off the service was great. Thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyclpENlV3EAE",
            "text": "This restaurant is located in Woodside's Thai Town and offers traditional Thai cuisine. Compared to many Thai restaurants in Manhattan, their dishes are more traditional and flavorful, with some options not commonly found elsewhere.\n\nFor those wanting to experience authentic Thai food, this place is an excellent choice. Even if you order common Thai dishes that you often have at other Thai restaurants, you'll notice a distinct difference in the taste."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMHAzbkFnEAE",
            "text": "so good - best Thai food i've ever had - way better than Fish Cheeks in Manhattan"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMaTRpa0pREAE",
            "text": "Really nice staff! Love the fried fish and crying tiger."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bHBqelpnEAE",
            "text": "Zaab Zaab means Delicious Delicious and that is what this place is. Cuisine from northeast Thailand, this is not your typical NYC Thai fare with spices and sauces in combinations that sing. We had the Thai green ice tea - refreshing on a hot day and cooled off the legit Thai heat coming from our dishes:\n\nTom Hang: the tripe and spleen were cooked to perfection - just the right amount of chew and flavor was fresh. Loved the two sauces - one hot, one bitter\nNan Khao Tod: menu says croquettes but it's like the crispy rice at the bottom of a clay pot mixed with a fermented pork sausage. A flavor explosion. So good.\nSurf and Turf skewers: tbh this had the last flavor but was cooked to perfection - not overdone at all - very fresh. The flavor and heat came from the dipping sauce.\nThe salt baked fish: chef's kiss. A must get - I have never had a whole fish cooked to perfection like this. Juicy, steaming, fresh. The herbs and noodles in a rice wrap with two sauces - one chili and peanuts, one tamarind and shallots.\n\nOur servers were attentive and informative. No condescension and joyfully made recommendations.\n\nInside is bright and welcoming. There's one all-gender bathroom.\n\nWe will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROOExfR1VnEAE",
            "text": "We had been planning to visit Zaab Zaab Elmhurst location for a while and finally got a chance last weekend. Their decor is cozy like home with limited tables but the wait wasn’t too bad.\n\nWe heard their Thai style grilled chicken is one of the recommendations from Bib Gourmand so we had Gai Yang Vichean which came with 2 different types of Som Tum, lettuce, sauce and rice to share.\n\nThe portion of the chicken was more than enough for 4. It’s a little dry but amazingly delicious to enjoy with unique sauces. It came with 2 different salads and I love the classical Som Tum Thai.\n\nOne of our favorites tonight was their Kau Lau Hotpot which the ingredients were various with great portion. The broth was sweet and the meat texture was braised soft."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMF9id1J3EAE",
            "text": "Top-tier Isan Thai food in NYC!\n\nOverall, the food was quite good - the duck larb was a highlight and the Kapow (Kra Pao) was good but not quite as special. Loved the fries as a snack/app. Prices were reasonable, service was good, and the ambiance was fantastic with the live Thai music (Friday and Sunday after 6:30!).\n\nWorth a stop if you’re in the area, and worth a short trip if you’re not."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1aFpTQnd3RRAB",
            "text": "Northern Thai cuisine,  their isan papaya salad is the closest to home made that I have found in NYC.\n\nIt's clean, modern and still retained the traditional container for the sticky rice.\n\nThe food is delicious,  portions are good for the price and the service is friendly and helpful. If you have a pet,  the restaurant has a small outdoor seating area with astroturf (fake grass) that you can bring with you.  We will be coming back to try their other dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6b05yZFF3EAE",
            "text": "Converted chicken restaurant, excellent Thai food higher up on the spicy taste profile.   Noodle dishes were fantastic.  The minced duck was delicious.  Washed down with a Hazy IPA and Thai ice tea and coffee.  We'll be back to try more of the menu"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSZ0pET0p3EAE",
            "text": "Very close to what I tasted in northern Thailand cuisine. Unfortunately, all the three dishes I ordered are super spicy, we couldn’t finish all. the spice taste is so typical thai spicy, like dried pepper chip with lime , spicy and sour. I will go back for their small bites and whole fish next time"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dnQ3cXhBRRAB",
            "text": "Excellent, not-your-average-repertoire Thai food in a very tastefully decorated space. Caveat being that you better be prepared to contend with some heat! Most dishes are not for the faint of heart, though a nice Thai iced tea helps with the burn."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMWNpcnhRRRAB",
            "text": "One of the best Thai restaurants in NYC. I loved their food the ambiance the decor and their nice outdoor sitting arrangements. The Crying tiger steak was the best dish on the menu. The crab fried rice and the steamed whole fish was soo good, it makes me want to go back again. I will be back to try out other items on the menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bWJmOTJBRRAB",
            "text": "We wanted to try the unusual dishes we'd never heard of before. So spicy, we could barely eat what we ordered (-1 ⭐), even with downing a Thai iced coffee. Larb gai (ground chicken) we could not finish, but eventually did finish gaeng om pork loin as leftovers. There wasn't any warning on the menu at all, or scale of spiciness. Fantastic outdoor seating, attentive service. Beware the chilies!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMjRYb1FREAE",
            "text": "I'll be real here and say we came here after seeing a Righteous Eats TikTok about this place, but I'm so glad we stopped by. Zaab Saab is an amazing place to get Isaan Thai food!\n\nThe service was quick and friendly, and our server even made recommendations when we asked. I am a spicy food fiend, so I adored the spicy levels of the food here even if it did make me cry just a little bit 😉. In any case, the Thai iced tea made a refreshing addition to our meal.  Add the raw marinated black crab to your dish if you can! It really reminds me of Korean raw marinated crab, with an interesting punch to it.\n\nI also really loved the decor. Interestingly, it's very chicken-centered in there, which gives it a funky and interesting vibe!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeHRhbHNBRRAB",
            "text": "Classic Northern Thai fare - spicy, rich flavors and texture in a relaxed environment. Every one of the dishes, I would order again - some were very spicy, soup and larb."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cTliVUZREAE",
            "text": "Boy did this place lived up to the hype!\nOnce again, the Yelp community (thanks!) delivered as we ordered the Signature Salt Encrusted Fish, ‘Crying Tiger’ rib eye, Crab fried rice which were all amazing. Just be prepared to pay but know that you are getting a one-of-a-kind dish, the best quality and freshest ingredients when you dine here.\nGet lost in little Thailand with its great deco, chill vibes and all in all a great place to hang and have great food with friends and family.\nQuit your FOMO and get here ASAP as I know I’m already making plans to bring more friends to enjoy this Isan cuisine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaC1HS1dnEAE",
            "text": "Nicely decorated restaurant. Ive been to many thai restaurants and i would say that zaab zaab’s flavors is definitely different. We asked for mild spicy but its still really spicy for me. I wasn’t able to eat more of it due to the spice. If the spiciness was something that i can tolerate il prolly enjoy these dishes but still very good flavors.\n\nPS: i included a picture of the spot where we almost slipped 3 times. Maybe consider taking a look at that spot as it tends to get cramp at that area if people are occupying the spaces around it. Better be safe than having an occupational hazard. Lastly there were a few flies flying around."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSa3NXcVNBEAE",
            "text": "Great food in a casual environment. Definitely one of the best on Little Thailand Way. Every dish I had was excellent. I highly recommend the marinated shrimp, the pork collar, and the Hor Mok. I keep wanting to go back to try more and more of the menu. Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbVoyRDlBRRAB",
            "text": "Michelin-Bib Zaab Zaab, a Thai restaurant in Elmhurst, has some of the best Isaan local dishes. Their staffs here serve you with a big smile with fantastic service that comes from the heart. Zaab Zaab has the best grilled chicken ever maybe that’s why there’s a beautiful chicken wallpaper on the ceiling, lots of chicken figurines, and delicious grilled chicken hanging through their open windows. Thai iced tea and coffee are both super strong with a perfect balance of milk. Not overpowering at all. The Tom Zaab is super deliciously spicy. The Gao Yang Vichean Buri combo is the amazingly taste grilled chicken which also comes with a papaya salad. Flavorful and tender chicken with a crispy skin paired with two different dipping sauces. Sounds delicious right? Go try and experience a different kind of grilled chicken.\n\nThai Iced Tea\n\nThai Cold Brew\n\nTom Zaab Khreung Nai 22\n\nGai Yang Vichean Buri & Table Side Som Tum 75"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCa2NIZ1BBEAE",
            "text": "A lively and vibrant restaurant. Service was very attentive. We got the Tom Zaab and the crab fried rice. Both have excellent flavor. Beware of Tom Zaab at regular spice. It packs quite a punch. Large portions.\nSpace is a bit small, I recommend getting  reservations. Bring a coat, the seats near the windows are chilly.\nNot your typical place for pad Thai or green curry. Try their seafood. Will come back again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOHJENEJnEAE",
            "text": "Want to travel to Thailand but can’t afford to because of inflation? Want to practice making Mark Wiens’ facial expressions? Want to experience some authentic Thai culinary delights? Visit Zaab Zaab, but don’t come to order pedestrian stuff like skewers or pad see ew (those are nice dishes btw), come try the uniqueness this place offers that you can’t find at other Thai restaurants in NYC. There is limited seating and this restaurant will become super packed soon because of recent press coverage, which is well deserved. Good food, nice staff, don’t miss out. We ordered seven items between three people, and will be back to try the rest of the menu. Cash me inside for the food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCb29IRUtnEAE",
            "text": "Went to this place for a dinner on weekend. I heard this is an authentic Thai Isan food in that area. The resturent got a good ambiance. I ordered fried rice, whole cat fish, pan Thai, and beef steak. The food tastes was quite okay (can be spicy depending on your level). I did not like the pad Thai that much, but the whole cat fish and fired rice really good."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCazl2U2pRRRAB",
            "text": "It was new year dinner with family.. it was amazing food.. I live a few blocks away.. there are many Thai restaurants to choose.. but I end up going there..\nwe got Pla Dook Yang ( marinated grilled catfish) the quality of fresh fish you can’t deny.\nMieng pls pow ( it could say that their signature dish..) too good to be real.. forgot to take photos..\ndon’t forget to order Tom Zaab.. you won’t regret.😉\nNote / remind them ( less salt or spicy) it would be your the best experience Thai food.\n\nHere I’m again updating my reviews…\nI come here often coz my  neighbour and love the food. 5/16 on Tuesday around 10pm.. it was only 2 tablets and  1 table outside not that busy hR .. I don’t aspect of the server was give us attitude that we come here for free food .\nHe missed our some of the orders.. also when we tried to order more..the attitude was unbelievably… I don’t think we deserved to treat that way….\nI May think about to go back…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNUxQUnNnRRAB",
            "text": "I can’t recommend this place highly enough. Over the last 10 years I’ve seen several regional Thai concepts open in various places in the 5 boroughs with great authentic food that hasn’t been dumbed down and whitewashed but they all eventually succumbed to the pressure of basic b*tch energy and pivoted back to your run of the mill offerings to survive. I’m praying this place succeeds and holds firm against that inevitable whining noise.\n\nThe flavors are bold, vibrant and unapologetic. Be prepared to be transported, come with an open mind and an open palate and you’ll have a memorable meal.\n\nAnd to the Asian Karen who gave the absurd 2 star review because of a $6 iced latte, lady either you’re new to NY or you must have gotten a specialty latte/ selected a specialty milk cause all their prices are in line with every other coffee shop in NY."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcEwyMzRRRRAB",
            "text": "A great hip place for authentic Thai regional Isan food. We ordered a dish from almost every category (but not any seafood). Everything was quite spicy (especially the soup) so make sure to request and adjust the spice level according to your tolerance. I think if I were to come back I'd definitely go for the grilled steak and whole fish options!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaWNubmh3RRAB",
            "text": "What a great Thai Isaan restaurant: it ruined other Isaan food in NYC for me! The whole fish in salt was tender, moist, and broke apart easily, showing the mastery of their kitchen. The heavily meaty plates, such as the larb, came with delicious mixes of green leaves. The seasoning was great, letting the flavors of the ingredients and spices come through. I was surprised that the food wasn't greasy at all, even the fried bits. Even the noodles and rice, while plain, were cooked well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOHJ2SlZnEAE",
            "text": "Let's start off with the good. Amazing amazing food. I don't think you can go wrong with any item on the menu. The fish , papaya salad and the crispy pork belly was the highlight of the evening .\n\nWhere it fell short of 5 stars was the service. My friend ordered a beer before we arrived and the server forgot to bring it. We had to remind them. We ordered a bunch of food and towards the end eating we realized we were missing our duck larb . Asked a server and he confirmed they forgot our order. The server confirmed If it was a duck and we said yes. Went to the kitchen , and 15 minutes later nothing. Another server came up to us and we asked for the status of our larb. The server looked confused and after a few minutes told us it was never put in . At that point we gave up , paid and left.\n\nI'll chalk this up to a newer team and a busy Friday night. I hope the service improves. I would love to stop by again for the delicious food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaE9uU25BRRAB",
            "text": "I used to love this place when they opened the business last year. But lately they have raised the price several times. And it gets incredibly expensive and overpriced. And the biggest problem for this place is when you order food from here, they won’t modify the spicy level or saltiness and sourness taste for you. Smh!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlal82VUpnEAE",
            "text": "Food was very good (though also beware, spicy if you’re not used to it!). Highly recommend the rib eye, duck larb, whole fish and the rotisserie chicken (you can see the row of chickens hanging in the kitchen, always a great sign), and the service super nice"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ejlfMkVREAE",
            "text": "Thankfully despite rumour to the contrary, the heat levels have not been lowered to suit a wider clientelle's tolerance. Som Tum refreshing as usual, the beef and duck larb both need a water refill to finish. Place is packed as usual since becoming popular on the 'gram and on JBA list. Service was a bit slow including getting menus, bill, dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4b3RYNVhnEAE",
            "text": "I’m a huge fan of Thai food and specially spicy 🌶 so the whole 5 stars go to Leng Zaab Zaab soup, it was soooo delicious and spicy I really loved it! Will definitely came back for this.\nWe did order also whole fried fish PLa Takrai - nothing special so I wouldn’t recommend it.\nWill definitely come back for more soups and will try new dishes!\nService was a little too much, the server was checking on our tables way too many times."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdktmN3R3RRAB",
            "text": "We’ve been meaning to come here ever since @consumingcouple recommended top Thai places to go to in their videos. Zaab Zaabs food strays away from the common Thai food we see around elmhurst and instead introduces a mix of flavors we’ve never even tried before.\n•Moo Tod Pla Ra 8.5/10 (crispy poke belly oiliness balanced well with the vinegary fish sauce)\n•Neur Yang 8.5/10 (juicy flavorful ribeye went well with the sweet tangy tamarind sauce)\n•Gaeng Om 5/10 (acquired taste; I personally thought it was too much ginger flavor, too spicy, not enough curry which is what we initially asked for)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1bE9maUpnEAE",
            "text": "The service was ok. The food is not really impress. from the price you paid. I don’t like the way they made Papaya salad. There are other places that make better. Thai basil is really good. ( I mean you couldn’t go wrong with this dish) Hor mok is alright.\n\nOverall is just ok but wouldn’t go back again.\nFYI it is a street parking so we had to drove around and parked a few blocks away. Not an area to drive if you wanna eat here."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbjU3dnBRRRAB",
            "text": "If you like spicy Thai food, Zaab Zaab is the place for you! For spicy get their papaya salad or their short rib hot pot soup. For non spicy try their signature steak,  salt baked fish and crab fried rice!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtZ1B5cUV3EAE",
            "text": "We went for lunch and this is our first time here. I'm native Thai and I have to say, the food here tastes very authentic. This is the same you will experience in Thai-Esarn restaurant. Not only the taste but the presentation on dishes are also good. We ordered Gang OM - Beef (Spicy soup), Sup Normai (Spicy preserved bamboo shoot), Papaya Salad(Som Tum Thai), Larb Ped Udon, Grilled beef(Crying Tiger). For me everything tastes really good. But Larb Ped is outstanding and you will not find this menu regularly in any Thai Earn restaurant. I love their food that they serve with the side vegetables.  The only down side for me is, you can't adjust the level of spiciness. You can only have regular spicy (which is the real spicy), super spicy and super duper spicy which means if you do not like the spicy or barely eat spicy food, you may not enjoy the food here except you order non spicy menu such as Gai Yang (Grilled chicken) or Nae Yang (Grill Beef). But if you love spicy food, you won't be disappointed coming here. The service is great. The restaurant is comfortable and clean."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPN1BtVmhnRRAB",
            "text": "This cozy spot has all the neighbors bringing their families for some of the best Thai food around! Had the duck dish of course, Larb Ped-U-Don, with duck breast, fried duck liver and skin cracklings; and the Tom Hang hotpot with tripe,…"
        }
    ],
    "reviews_count": 82
}