{
    "name": "Nangma Restaurant & Bar",
    "place_id": "ChIJs4eWfnlfwokRtrchD1lEkBw",
    "grid": "QN4",
    "address": "83-17 Broadway, Elmhurst, NY 11373, USA",
    "rating": 4.5,
    "user_ratings_total": 211,
    "phone_number": "(347) 730-6117",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ndFJVVjVXa3hTUldwYWFFTmtUa1V3V1ZnNFkzYxAB",
            "text": "I'm completely sold on this place after my first visit. Our group had a wonderful dining experience. Yelp steered me toward this excellent spot. Their service team was sufficiently attentive. I'd eat here again and suggest others visit."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORFMzVlJkRWRHYVZwMmNUUndVMnRSVFY5TWMyYxAB",
            "text": "This is a  really nice spot. We just got couple of dishes as we had  more spots to explore in Elmhurst. Jr\n\nThe fried fish was great. It\"s spicy, tender,  crunchy  full of flavor and  The batter crisp and not oily.\n\nThe dried red pepper were like hot chips. Really good.\n\nThe fried beef lapshing noodle dish was outstanding!  The tingmo, a type of steamed bread, is great to soak up the sauce.\n\nCheck out Nangma in Elmhurst and experience a fusion of Tibetan Chinese cusines prepared by Chef kunpas"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbFVWTmhSRFJFVkRCS1QweFlaSGd3VEdoaE1rRRAB",
            "text": "Servers are friendly & accommodating. Food is great. Loved the braised fish with napa & their tingmo"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3M1EybHpabVF6ZVMxWFUzWk5OblpEWTBweWNYYxAB",
            "text": "They used to have delicious food but somehow it was changed and not as good as I expected. They have mixed of customer service. Some are very nice and others are so so."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VemVrNTJTbEJhWTFKSmIyaHdNakpvWW1kTllrRRAB",
            "text": "This is a well-kept restaurant and very spacious inside with good decor.\n\nWe've never had Tibetan food before and were able to enjoy all the dishes regardless. The service was also good and the atmosphere was chill.\n\nThe taste of food is just okay though. nothing really stood out and the lamb chop was a bit too dry.\n\nStill, it is a very good restaurant to eat at at Elmhurst."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eWJrVkVZVVpMY0V4aWJEVm9jME5oV1dSamVuYxAB",
            "text": "Was in a job interview and early enough that I could grab lunch here. I just got back from Nepal & was craving momos.\n\nPlace is really spacious and at 2PM was empty - just one other table. Service was friendly - but the kitchen took longer than expected. Still - hands down - the best momo I’ve had in a very long time.\n\nI’ll defo be back again!  😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCalZ6ZHVNRGh6ZVdKWVVuQnNYM0pzY0RCdFFrRRAB",
            "text": "Hands down one of my FAVORITE places since moving to Queens. Food is quality and worth the price, every time! We order takeout on uber eats from here regularly as well and spend like $90 for 4 or 5 dishes that lasts us a few days.\n\nEverything we’ve ordered that has hit every time:\nBeef and Tripe in chili oil (top tier)\nSichuan Dan Dan noodles (so much for the price, I’m obsessed)\nDry Pot (any protein is amazing, but we prefer beef and pork belly)\nFried AND steamed momos\nChicken Manchurian\nLhasa Fried Noodles\nNangma Combo Tripe Hot Pot\nGreen beans\nMapo Tofu\nShabalak stuffed patty\n\nPhoto is from our first time eating in (dan dan noodles, drypot and tripe hot pot pictured)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNVJrVTFPSFJFUVhocWVrUnZNVFJ1UkZoTmQxRRAB",
            "text": "Nice and clean environment, big enough for party and group dinners. Offering 2 stars because, food itself didn’t really impress to my friends and self. Gyuma and Momo very salty, we left over quite a large amount in plate behind, couldn’t eat. Salt level matters in all dishes. Hope it helps all.,Tashi  Delek"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3X1AtZ1BBEAE",
            "text": "VERY BAD. The WORST experience I have ever had. The chicken meat was uncooked- we did not finish it. We had to remind them to bring our food about 5 times with 5 DIFFERENT waiters. They gave our food to the wrong table and kept messing up our order. Please NEVER go here. The staff DO NOT CARE at all of their customers. They ignore you until you stop talking. The staff is SO RUDE and FOOD QUALITY IS BAD."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNHFLR1BnEAE",
            "text": "Last minute plans for brunch this past Sunday. My first time here and loved everything. The portions are large and delicious. I had the tripe stew with oxtail, potato and carrots, steamed dumplings, fried rice and the braised fish (my favorite). Oh I almost forgot the spicy cucumber salad.\n\nOur waitress was lovely and attentive, thank you for a pleasant experience.\n\nIf you like heat, this is the place to come.\n\nIG: WildBitesAndCampsites"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOFlINjB3RRAB",
            "text": "Sapidity food with the burdly tibetian taste, such a wonderful experience for me having tibetian dishes for the first time in my life, if i assume its kinda similar to chinese food since they are kindred country, the ambience of this place just wondrous and also it has vast dining area as well. Besides of that they even got pretty chandelier on the main entrance. Good place, recommended."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRellDdzBRRRAB",
            "text": "Good place for Tibetan food. Is it authentic? I haven’t had many Tibetan dishes but I liked what I had. The momos were good, thick wrapping with lots of filling and very juicy. The fried is my favorite."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURROGYyeTB3RRAB",
            "text": "The 凉粉，tea and Kong pao tofu is are must. Been here for like 5 times, never disappointed"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneF9DalNnEAE",
            "text": "I would skip every other restaurant and come here every single time. The food is absolutely delicious and the service is incredible!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaV9xXzRnRRAB",
            "text": "Great Tibetan restaurant in heart of Elmhurst"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBd3RXYzNnRRAB",
            "text": "Good portions for the price. Would come back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBa1pucjlBRRAB",
            "text": "This place is amazing! Nangma means melody and it makes us sing every time we go there. The Chong Qing Chili Chicken is one of our favorites! But don’t sleep on the Shoko Phing Soup, Tibetan Style. It will cure anything that ails. Sides that are awesome every time are the green beans, bok choy and the cauliflower casserole. Also the Spicy Fish Fillet with Tofu is out of this world. Anything you pick you can’t go wrong. Very affordable prices and the service is excellent, they treat you like family! Nordan is so sweet and helps us find something new to try."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfajg3a3dBRRAB",
            "text": "Ordered a bunch of dishes. The shoko phing was a let down. The potatoes were not cooked through. The dish had too much turmeric. The shabhakleb and Lhasa noodles were yummy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOHFDbUpnEAE",
            "text": "Great restaurant, I loved the noodles and momo a lot. I would visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNHRfUDFRRRAB",
            "text": "fantastic restaurant. delicious and reasonably priced food. amazing service. wonderful ambiance."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1eS1MM3FRRRAB",
            "text": "A year ago I gave it 3 stars because the food was overpriced, portions were smaller, service was a bit slow and the flavors were not up to par. Since then the owners have changed and it reflected on their new menu when I visited last weekend. Service was good, portions were great, food tasted great and the atmosphere is the best you can find in a Tibetan restaurant in NYC.\nI highly recommend their yellow laphing (cold bean jelly), veg thenthuk (good amount of vegetables), tingmo and combo tripe hotpot. Their momos are good too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbE5lWDl3RRAB",
            "text": "The food that we ordered today for take out was worst. (Shaphale, chicken chilli & thenthuk) were not as we expected. Infact, the shaphale bite felt like biting a rubber. The chicken chilli was really hard. Will think twice before ordering again. Very disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeExDYldnEAE",
            "text": "The waiters and waitresses were very friendly and nice.  Cool environment.  But it took a little bit longer than usual for the food.  But all dishes came in at the same time."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OTZYTHFnRRAB",
            "text": "Amazing and authentic food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOHZIUV9nRRAB",
            "text": "Before my friends and I went on our way to the see US open, we stopped here for lunch. It wasn't busy around the time we went, so seating was available. Now, we never tried Tibetan food, so we went for some safe options, lol. Between my friends and I, we had the steamed momo with the most delicious hot sauce. I've never had anything like that before, and it did not disappoint. We also tried the chicken manchurian and beef with laphing. Both dishes were SLAPPED, bro, especially with the sauce I mentioned before. Our server was chill and provided good recommendations. Overall, im glad we stopped here to try out new things. The food is worth trying for sure and for a decent price. I recommend this place !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bmQtRlFREAE",
            "text": "We had a full late lunch in Manhattan Chinatown around 2pm before going here. We were shocked at the amount of food we ate here without feeling full. A combination of magical atmosphere and attentive staff surely contributed to our experience. Loved this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaExEd3hBRRAB",
            "text": "What a fantastic restaurant! The food and service was incredible! From their fluffy and cloud like tingmo, to their savoury and delicious kung pao chicken! The entire meal was a delight, this is still a new spot but well worth a visit! The meal was fantastic from begining to end. Highly recommend trying their egg fried rice, the egg was soft and fluffy, and paired with the chicken made it an absolute delight. Truly a great place to check out when in Elmhurst!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib1plY01REAE",
            "text": "Beautiful decor, full of families and good vibes. Only tried the Sichuan dumplings in chili oil, but they were delicious!!! Can’t wait to come back and try more Tibetan dishes"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycU9YVU5BEAE",
            "text": "Serves decent Tibetan food compared to other places in the area. The restaurant is spacious with nice decor, making it a great choice for large parties, offering better seating than many other spots."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6aVppX3F3RRAB",
            "text": "Spacious\nChong Chin Spicy Chicken is exactly what I’m looking for around the area"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOGY3ZFhBEAE",
            "text": "Great service and food. Highly recommend!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNULUtINjZRRRAB",
            "text": "Great Tibetan food and ambiance. Wonderful decor with large photos of the Dalia Lama inconspicuously placed. Staff are Tibetans and are practicing Tibetan Buddhists. Support the Tibetan community in NYC and eat delicious authentic Tibetan food within a Tibetan setting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMHJUdWZnEAE",
            "text": "We had our son’s baptism in their event space  (40-50 pax) upstairs and it was very spacious and clean! TJ the manager went above and beyond! All the staff are also on point and very helpful with our guests. Food is delicious with plenty of options! I definitely recommend this place if you will be hosting an event! Thank you nangma!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbk9yQTN3RRAB",
            "text": "Food is good but you guys shouldn’t forget to add the sauce for to go orders!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNELVoyelhBEAE",
            "text": "Excellent decor, you can miss it from it's non descript  exterior but once you walk through the door it opens up into a large space with fully stocked bar and a pleasing aesthetic. The beef tripe in chilli sauce is excellent and my favorite off the menu. They also give generous portions of both food and wine for a great price that doesn't break the bank."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cU5fUHFBRRAB",
            "text": "We love Nangma, we come here all the time. Their dishes are really flavorful, we keep coming back for more! The Tingmo bread is so soft and pillowy but still has a nice chew to it, we always get an extra one to go when we have leftovers. The portions are really big for the price.\n\nAnd I have to mention the ambiance and decor, it's surprisingly nice considering how unassuming it is from the outside. We love how the culture is celebrated through the decor. It's also a very large space, we've never had to wait for a table. The staff are all so friendly and helpful too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkXzZiWUZREAE",
            "text": "A non-trivial amount of fresh red chiles shows up in the ping-sha riri, which is almost but not quite a soup, made from drenching a squiggly bowlful of cellophane noodles in dark, oily liquid seasoned with beef and fragrant with Sichuan…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMk9TRnlBRRAB",
            "text": "I like nangma restaurant."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMU9xdFJREAE",
            "text": "Their beef dumplings were amazing!!!!!! It's soupy, meaty, flavourful, and has a good portion of meat. I love their fried noodles as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0ck5XVm1BRRAB",
            "text": "The first time here, but I was amazed by the quality of food here! Absolutely delicious with unique flavors."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0cU5uWjV3RRAB",
            "text": "My husband's coworkers wanted to take him out for dinner and extended an invitation to myself. The restaurant staff were all so kind, amiable and professional. They made the entire evening so warm and welcoming. The chef even came out to say hello. The food was AMAZING. The lollipop chicken, the kung pao chicken, two different kinds of dumplings (I believe it’s called domo), spicy fried fish, a spicy noodle dish, the long beans, sautéed greens, and a meat filled “empanada” cooked to perfection. My first time trying Tibetan food and it did not upset. Thank you for such an amazing experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOOThibjFnRRAB",
            "text": "Great spot with karaoke, awesome food and an attentive staff. Recommend 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOM3RYWkpBEAE",
            "text": "the beef momo (sha momo) according to my friends were good. However, it seems disingenuous to name your restaurant “Nangma” and not serve halal meat. Tibetan Muslims were the one who invented Nangma in Lhasa and some Tibetan Buddhist customers outside the restaurant were extremely off-standish to the fact that my partner and I were Tibetan Muslims"
        },
        {
            "date": "1년 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbTc2WUFREAE",
            "text": "牛雜火鍋、四季豆、羊排都好吃，服務人員態度非常好！值得推薦"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxb1pYLUx3EAE",
            "text": "Extremely satisfying dining experience. My mouth is still exploding with delight. Just took my cousins to Nangma to bring in the new years, and we plan to come back on a regular basis."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWX01MMUtnEAE",
            "text": "Ordered maybe 10 different dishes for the group. Tried every single one. And every single one was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURscUxyckRBEAE",
            "text": "Big menu includes Chinese Sichuan and tibetan. Try the thenthuk if you want a noodle soup- it's like thukpa but better (different noodle shape)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsZ09IMEJBEAE",
            "text": "Great place for larger groups"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNW9LdVhREAE",
            "text": "Who could make better winter food than Tibetans?\n\nExcellent service, lovely atmosphere, and soul-satisfyingly good food. We were the only people there at dinnertime in a weekday, which is really sad because I’d hate to see this gem close.\n\nPictured is the bathuk noodle dish and the fried beef and laphing dish, as well as a pot of Tibetan milk tea (savory and not sweet, SO satisfying). Looking forward to coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGc3Nfa25RRRAB",
            "text": "ཡག་ཤོས་ཤིག་རེད།\n\nThe best in the business."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbHRMTjh3RRAB",
            "text": "The food here was pretty good. I would recommend the Dan Dan noodles, beef khatsa and stir fried pea greens. The ambience is good with authentic tibetan decorations. I wish the staff were more attentive in getting the orders/check, but their service was still good and friendly.  We just had to wait quite awhile for the orders/checks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodzlHRjNnRRAB",
            "text": "The food at Tibetan Nangma is worth the trip. Himalayan cuisine with its Chinese, Indian, Mongolian, and Nepalese notes was new to us, interesting, and turned out to be delicious. My only complaint is that I wish we could eat more or bring more people with us.\n\nTaught by previous experiences at genuinely authentic ethnic places we put our palates in hands of our server and followed his suggestions. No regrets.\n\nLhasa, long yellow chewy noodles came with pork belly, coated with chili sauce that delivered long slow continuous burn from within.\n\nTibetan fried beef curry was prepared with laphing made of mung beans and shaped in jelly like cubes.\n\nTingmo, a steamed bun with a soft fluffy texture and flaking layers, was perfect for soaking up the juices of the curry and wiping the plate after noodles.\n\nSteamed momos had a nice celery flavor and went really well with flavorful cayenne sauce served on the side.\n\nStir fired pea shoots — I always need something green —   were crunchy and garlicky.\n\nWe came to the restaurant during the off peak time. By being early, not only we got the best food out of the kitchen but we got a great personal tour of the beautiful place and the culture new to us."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMteXBUTmFnEAE",
            "text": "Excellent interior space with tall ceilings, service was great and we saw a bunch of catering orders going out when we dined in. The Shapaley and steamed beef momos appetizers were great. We ordered  the Chicken Curry and Tibetan Beef Potatoes with a side of rice as the main course which was delicious as well. To end the meal, we had the Tsamba Cake. The Tibetan tea was a bit salty which gets use to drinking."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM3BUT1hREAE",
            "text": "Great place to try Himalayan food. We tried the chicken lollipop, manchurian chicken,  lhasa beef noodles, momos, and the tingmo. It was all very tasty and delicious. The servers were polite, friendly, and helpful with assisting us with our food selection. The restaurant is nicely decorated, clean and spacious. We will be back to try the rest of their dishes."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cWMyWmdBRRAB",
            "text": "The staff is so friendly, the food is delicious, the space is very clean! They accommodate large groups and even have space for event rental upstairs for up to 80 people!\n\nThe waiter even turned on Mickey Mouse on the Tv and cleaned my child’s high chair before bringing it over.\n\nThe tripe hotpot is enough to feed two for lunch and it is SO GOOD. Great spice, perfectly cooked tripe."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaUtiS0RBEAE",
            "text": "New restaurant, very clean place, & friendly staffs. What I love about this Tibetan’s restaurant is that all staff are wearing traditional dress which makes it different from other Tibetan restaurants. Also food is great but bit over price for the amount you get. Lastly to get the check took about 10 mins so we were just waiting. So would recommend the staff to make sure to see customers are not waiting too long to get something like check. Other than that its a great place and would recommend it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeXVtM0hREAE",
            "text": "Had been eyeing on this restaurant to be opened and was very happy to have a new Tibetan restaurant in the Elmhurst area. The interior is absolutely nice the little details that they have thought in terms of representing the Tibetan Culture, the staffs wore the traditional dresses which is something different in a good way. ABOUT THE FOOD- It was decent the portion size is little for the amount of charges that were implied in these foods. Momo was my least favorite as it felt like we were eating a soup dumpling in a Chinese restaurant it didn’t seem right. I’m glad we gave it a try nevertheless\nAll the best to Nha Sang"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlb0tqeE9BEAE",
            "text": "We saw this place on tik tok and new we needed to give it a try just based off of pictures. We had the pleasure of having Chusang as our waitress.\nThe momo and dumplings were 5/5. Spicy chicken definitely only recommend if you…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdVpfbEJREAE",
            "text": "Nha Sang is an exquisite Tibetan and Sichuan restaurant that is family owned and ran. Their elegant interior pieced by traditional Tibetan decor sets their dedication to sharing their culture with their guests. My servers Chu and her Sister were very welcoming and attentive to all tables, including myself. I ordered their Chonqing chicken, beef with potato and beef momo. The chicken had lots of chili and just the right amount of numbing to create a firey delicious appetizer to get me ready for the main dishes. The beef and potatoes were beautifully arranged on the dish with so many different mouth watering aromas being produced. The beef was cooked to perfection not too chewy, not too tough, just perfect. Along with the potatoes which soaked up just the right amount of sauce which the beef and veggies sweated out. Combined in each bite was a spicy, aromatic, bold and savory delight that kept me wanting more. Onto the beef momo, each piece had generous amounts of soup and a large piece of beef ball. The dough was steamed perfectly to retain moisture yet firm enough to not have the whole piece fall apart when taking bites. The soup and beef were well seasoned and was to my up most liking! I had such a great experience at this new restaurant and will make it my normal eating spot when I relocate out to NY.\n\nJuly update! This visit, I tried their Tingmo and beef curry. I highly suggest all dishes I’ve tried so far! The tingmo was very plump and soft a delicious lightly sweet bun to use to soak up the curry and better than eating their dishes with rice in my opinion. The beef curry was very very yummy all the right notes of flavors, tender meat and perfect portions. I love their dishes and can’t wait for my next update as I devour their menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtZ1BqbFBBEAE",
            "text": "This place is spectacular! authentic food, artisanal wines, and a unique experience. Food is fresh full of flavors, paired with such a beautiful ambiance."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdEt2aGlnRRAB",
            "text": "The Ambience and the food was awesome. Service was also great . We went there to have a brunch and we are fully satisfied. The price was also reasonable.Can’t wait to go back again. Highly recommend!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaTR1REt3EAE",
            "text": "The restaurant was opened few days ago, Newly furnished Tibetan style. Our first time in and you have to go!  It’s the cutest spot and amazing food . The Chong Qing chicken is to die for . IT WAS FIRE! The service we received was so amazing and we will definitely be back again.\n\n100% Kid friendly . Our beautiful niece and nephew rate the momo 10/10.\n\nThe price is little higher than other Tibetan restaurants in queens but it’s worth paying for  taste , service and comfort."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdnBDQkp3EAE",
            "text": "Food was tasty and flavorful. Menu had Tibetan and Sichuan cuisine. Decor was on point and service was very attentive.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bWZqVWpnRRAB",
            "text": "Momos so juicy you have to eat them like XLB. The thenthuk reminded me of Canto chicken soups but richer to keep up with the hand pulled noodles, and amazing all together. Surprisingly nailed the Sichuanese specialties too. All around amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQteVA3ZVlREAE",
            "text": "Leaving this review as I eat!!! Man really incredible. Everything is so flavorful. And the staff were super kind!\n\nThink I’ve found my new favorite spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeXFEbEVnEAE",
            "text": "From a long day of work, my wife and I decided to go out for a “bite”. This place caught our attention from the outside. We asked to look at the menu and from their warmth welcome we decided to have a sit. They went over the menu step by…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdWNibHNRRRAB",
            "text": "The new shichaun Tibetian .I didn’t like the food at all the mono’s were uncooked and sha bhaley  was   Cold look like they just heat in microwave .\n\nThey were so busy they just put the coriander just like that food presentation is worst.\n\nI had a very bad food poisoning from  this restaurant interior is super duper but food is the worst ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaelBqOXJnRRAB",
            "text": "I love to come to Nangma since it’s near me and the hospitality along with the food and the ambience is top tier."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeTlXVV9RRRAB",
            "text": "The food was really nice and there was a 5% discount if you checked out with cash. I recommend the back pot meat 😋 here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLVBISFlREAE",
            "text": "Amazing restaurant! Will definitely be coming back. The food was very good. I highly recommend getting the spicy fish fillet with tofu and getting the bread to dip it in the sauce. The servers were also very nice. Cost was very affordable. The ambience is welcoming with a high ceiling, great for large groups."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPemR5a0dBEAE",
            "text": "I really enjoyed this beautifully decorated tibetan restaurant. It is one of the best tibetan restaurant I have enjoyed. They serve delicious authentic tibetan and authentic Schewan food. Owner and Servers are very friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPd1BiM2tBRRAB",
            "text": "Nha Sang restaurant  was my first time to Tibetan food. I had to ask the waiter to help me with suggestions as to this unique ethnic food and I was very pleased with the items I ordered. The food was excellent especially the chilli chicken.…"
        }
    ],
    "reviews_count": 72
}