{
    "name": "Empanadas Cafe",
    "place_id": "ChIJJyc8c9JfwokRv5fvVApxk0M",
    "grid": "QN4",
    "address": "56-27 Van Doren St, Corona, NY 11368, USA",
    "rating": 4.6,
    "user_ratings_total": 2091,
    "phone_number": "(718) 592-7288",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaFZTMXhlV3MzV0V0Vk5XZHZZMkZ3Um5GdVgzYxAB",
            "text": "Let me tell you something if you wanna find the best empanadas in New York City. This is the place 100% recommended."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCd1dWaDRPRzVwUXpkcVVsbzVVazlvVEVkVFVIYxAB",
            "text": "The food is affordable and prepared fresh per order. Great place for a quick lunch. The one change I would make is more seasoning since I personally prefer heavy spices."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRFdXRmtRbE10U2xGZlFtaHlUWFZsT1c5SFRuYxAB",
            "text": "Great place to get fresh empanadas but the only gripe that I have is that they are extremely cheap when it comes to the sauces. I ordered over 7 empenadas and only recieved 2 small sauce cups. The empenadas are already expensive so getting extra cups of sauce that are worth less than 10 cents shouldn't be a hassle."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201eVJsUnFiWGRFVUU1WmRreGtOMk5wTWt0M2RFRRAB",
            "text": "Great place! My go to at work!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRFRsaDJPSFJRU2pWTFYyZGFjMmgzY0RoUVEyYxAB",
            "text": "I've had this place occasionally over the years, and the empanadas are always great. Some of the best I've had. The bacon egg and cheese one is great. I personally love the corn flour based ones, they have such a great crispy/chewy crust. Generous fillings. They must make these to order because even after I ordered it was about a ten minute wait for 4 empanadas, so be aware."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rdFkxcFFNVlprV0c1MVJrODRkV0UxVjJsTVUxRRAB",
            "text": "Empanadas Cafe in Corona is a true Queens treasure! 🥟 With dozens of fillings and three types of dough—white, corn, and whole grain—every bite is fresh, authentic, and packed with flavor. Cozy vibes, quick service, and homemade helados make it the perfect spot for a delicious, affordable meal."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMmNtaFNka1JGUkZoek9FRkRhM1J3T1dFMVoxRRAB",
            "text": "autóctono ,"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preWVUaGxlV0pDTkdaRWFVUXllRXRyV1hsM1ZFRRAB",
            "text": "Definitely some of the best empanadas around. Great place to grab for before the Queens Zoo or Hall of Science nearby. Empanada fillings are generous and the skin is well fried without being overly greasy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRVdYVjNZMk5WUVZsS1RuQXlNRE5mVmpGMldXYxAB",
            "text": "I ordered the chicken and I wasn’t sure if it was ground beef. I ordered the beef, took one bite and… no this was not it. I tried this place because of the reviews, now I’m convinced those were written by bots. Or maybe I’m just used to Mama’s Empanadas across from the mall. A huge fail for me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdlV6bFdTRzF6TW5ZNFRUYzNkSGx1WjFGNFZYYxAB",
            "text": "Empanada Cafe has raised the bar so high that I cannot have empanadas anywhere else. Hands down just the most perfect empanadas. Always consistent, perfect distribution of filling to shell. Tried every single empanada on the menu. Place is clean, staff run a tight ship and have their business running so smoothly. I recommend ordering ahead so you don’t have to wait. There are some high top tables outside. Most people do take away.\n\nGreat spot to stop at after Queens Zoo or NY Hall of Science."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eE1XMXZZakprTkhKbVVtNVRlVE5wWjBacloxRRAB",
            "text": "Delicious empanadas, waiting to go again.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNVNuSldkbVptTjJ0RU1FNWhTelF5U1dKS1dGRRAB",
            "text": "Overpriced"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVE5EY3lRakZxT1RaRk1rbDVkWEpTYkVOUExXYxAB",
            "text": "Our absolute favorite empanadas place!  Es muy delicioso"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNFRFVjBSRlJNUzNkVGJHZG5OVmhVUmpSNFFsRRAB",
            "text": "Best empañadas in Queens. They offer fried or soft taco empañadas that I can’t stop eating. It’s not fancy - it’s on a street corner. But there are always people hungrily waiting for their orders. It’s absolutely worth the trip!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNFdFZDRaV1pYZURkM2VqaGFkV3hHZUdObldIYxAB",
            "text": "Great empanadas. Been going here for years."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScmVubFVWMGw0VERaeWJrOTNNVkpQTUhnME5YYxAB",
            "text": "Favorite empanadas spot. Best one is cheese & maduro."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaVMzRnFYMDFQYjJ0UVZEWkxkMW8yUWtNNWJIYxAB",
            "text": "Que ricas empanadas .! 💯🫵🏻💯"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNWNUUjFRa2hQY0RGU1pHTlhRV1pVVWxGUVMxRRAB",
            "text": "Just a bit pricey but delicious food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5R1YyOVlhakl0YzB0ZllqZHBXakZHU0ZOSmIxRRAB",
            "text": "The empanadas are okay ... super expensive $3.75 not a big difference for a regular price of $2 in another place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reFYzQTFWV0psTmpZMGJXeFNXVmxGYTBOT05WRRAB",
            "text": "Plenty of combination options, food is excellent. Only warning is the wait is a bit long as everything is fresh and the food isnt precooked. But the wait is worth it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUVlYTkRNV05YTkRaU2MwRllVMVJNZGxwd1pHYxAB",
            "text": "I ordered the catered empanadas platter and the empanadas were delicious. Everyone at the party loved it. The only problem was I did not order enough of it. Next time I'll order 100."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVlZsVkpVbVV6VUZwSWF6TTJVSGhVVVRaMWRXYxAB",
            "text": "Pueden tener un buen producto. Pero la atención al cliente es pésima estas chicas les falta un curso de cordialidad"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOa1VHbHVVMFZFYVhOWGVWVjRhMmhsT1VGVmJHYxAB",
            "text": "Soooo good! I had the plantain/cheese, chicken/cheese and beef/potatoes & all 3 were amazing. The empanadas are PACKED with filling. I'll definitely visit next time I'm in Corona!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VOU3FpTHpzMWRHWU5REAE",
            "text": "Empanadas are good and I’ve been going here since a kid but it’s changed so much, they increase their prices but not quality and the biggest issue is that they charge extra for sauces. They should give you more sauces for orders of empanada. I ordered 3 and they gave me one sauce and refused to give me another. They charge .50 cents if you want an extra which is ridiculous. Customer services is terrible. Food is decent. Not what it used to be."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTE1WQTNiMGxWUm1sNmJuWnhiVUoxT1d4eFQxRRAB",
            "text": "I did not like them, small and high price, 15 minutes waiting for a chicharrón empanadas with no chicharon flavor, this comment is for them to do better."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tac2NVMXRVVEJCTms1YWEwSnlPRE5hTlRKa0xVRRAB",
            "text": "Our empanadas were great - love the flour ones - order in advance - freshly cooked"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMmJrZFVjSFZJWmtsRVVWVTBhRVJPUmxCVFgzYxAB",
            "text": "Beware! The vegan and vegetarian empanadas are cooked in the same oil where the meat empanadas are fried."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWWVXeHBOR0ZFVmxwSWFVbDZNWFpSUWtOTmVsRRAB",
            "text": "La atención es horrible, las muchachas que atienden tienen aires de altanería. Y mala cara."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQMktnS0hSMk9MX1JBEAE",
            "text": "Las empanadas son deliciosas en especial la de carne pero compré de queso y no sé si es normal la cantidad de queso que colocan"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTFUyb3dSV2xoVFVwYWFtZFhjaloxZERkbVRWRRAB",
            "text": "The best empanadas in queens hands down"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOeXEtTEdwMk9fZGZBEAE",
            "text": "A small whole in the wall but tastiest empanadas in NYC"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJN2V1TGFZaUltR3VRRRAB",
            "text": "Ordered an assortment of chicken and beef mini empanadas tray of 50. Very disappointing. They were so dry."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNX3lnTExCMXNPN1VREAE",
            "text": "So so so good!!!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNRGp2NnpKb2RXQWJBEAE",
            "text": "Deliciosas las empanadas! Es mi desayuno oficia de los domingos"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1N0tpRmxRRRAB",
            "text": "I found the ice cre cream extra expensive… $4:00 that is too much!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJekhoZmVGenRYNUh3EAE",
            "text": "These empanadas are on point 👌🏽"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOLUQ0ZXlPeXAzc2RREAE",
            "text": "People are rude she knows who i talking about"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMalEyT2F0cXYyc1l3EAE",
            "text": "Great food, service needs to be more organized"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLejh2TTdZb2JHVGRREAE",
            "text": "Ordered platters for a party and it did not disappoint.  The empanadas were fresh and  tasty!! I think the empanada key card  is genius!! Well done!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPWFo0S21ydVB2Vl9BRRAB",
            "text": "The yummiest!!!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycG9DTDVBRRAB",
            "text": "Great empanadas do not like the post covid layout u need to wait outside for 20 min for empanadas I rather be siting inside. The empanadas are really good though! It would be nice to have a bunch of chairs and tables to sit outside eating…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaGJ5czR3RRAB",
            "text": "We came here after a visit from the Queens Zoo and enjoyed our first visit here! It's too bad there are so tables to sit at, just a couple side benches and a tall table. Oh well, we liked the flour ones the best, the beef is a classic, and my fave, the ham and cheese reminded me of too much of a hot pocket, but we enjoyed the chicken/potato, and sweet plantains. The homemade sauces are excellent! If you're in the area, stop here and enjoy!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURROWFuUmlnRRAB",
            "text": "Well this place has been open for years. They can do better for the public . Now you can’t even sit Inside and the place has an outside speaker service .  Took like 45min to get our empanadas. 3 total and 1 coffee. And price was a little overpriced for empanadas. The service to public is not very kind. Be ready to wait!!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3anN1R3hnRRAB",
            "text": "I'm not very impressed. The cheese empanada was sad. Hardly any cheese at all. The beef one was filled right, but the taste was nothing out of this world. Ham & cheese and beef & potato were OK. We ordered 7 empanadas and got 3 sauces. 1 sauce for every 2 empanadas, I guess the 7th empanada didn't count for extra sauce, so we had to pay an extra dollar. Also, at $26, I found it to be a bit expensive for empanadas, especially when you have to stand on the street to eat them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeFlhMW93RRAB",
            "text": "Empanadas Cafe has been on our bucket list for a while. It came to my mind this morning randomly and decided to give it a try to fulfill my craving. We got 6 empanadas with different flavors across different layers.\n\nThere are 4 different flours: Corn, White Corn, White and Whole Grain. I personally love the thin & crispy corn flour and my roommate preferred the classic white flour. They serve various filling options and we had difficulty deciding what to buy. Our favorites were the flavorful Breakfast and refreshing Hawaiian."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MGFLS2hBRRAB",
            "text": "This little spot packs a punch with good food. We ordered the chicken empanadas and the beef potatoes with a coffee. Chicken was good yet the beef is by far the best. The green sauce tasted so fresh and wasn’t too spicy. The coffee was decent yet I can’t fault them for that with the food that good. I have to say with how small that location is they have figured out a way to have a place for more than just a few people to eat with standing tables and benches. Lastly, the staff is super friendly. I don’t speak Spanish and they were able to work with me. They have a huge amount of pride for Queens and appreciated my Queens shirt I was reppin."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdmZMRnVnRRAB",
            "text": "4/1/22: Excellent empanadas. They take 10 to 20 minutes to cook after you order, but it's worth the wait. The crust is perfectly crispy and flaky. And they include a fresh made green hot sauce (not from a bottle). Had the plantain and cheese (4.75*), jalapeno and cheese (4.75*), Nutella and banana (4.5*), and the pork chicharron (4.0*, the only one I didn't love, I was expecting some of the crispy chicharron inside, but it's all soft, wouldn't order this one again as they've got so many other great ones).  Update: Came back the same day to order more: Corn Flour Shredded Beef and Potato (4.5*), Corn Flour Ground Beef and Cheese (4.5*), Whole Grain Chicken and Cheese (4.5*), Corn Flour Chicken and Potato (4.25*), White Flour Beef (4.25*), Corn Flour Broccoli and Cheese (4*, decent but boring, wouldn't order again), White Flour Spinach and Ricotta (4*, decent but boring, wouldn't order again), Corn Flour Codfish and Potato (3.5*, too fishy, wouldn't order again), White Flour Hawaiana (Ham, Cheese, Pineapple) (3.5*, too sweet, didn't like flavor, wouldn't order again)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM2FUcGJnEAE",
            "text": "So where do I begin empanada café is truly a beautiful gem in the heart of Queens New York the quality and service experience of this restaurant will always be unbeatable to me and I’m so happy that it is a recognizable name along other iconic restaurants in New York City Luz and her team are truly beautiful people who care about the customer and the quality of the food. They receive an amazing and I’m so thankful that they are striving with the service they provide because in my opinion, this restaurant has only gotten better better better always in the years it really has"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdG9lNHlnRRAB",
            "text": "Best empanadas I've ever had in life. I've had daydreams of the Hawaiian one for the past two days since I've had it. Spicy green sauce is an awesome compliment for any of the empanadas on the menu. Parking is difficult as the location is on the corner of a busy street."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdmVfVV93RRAB",
            "text": "Had urge for empanadas and tried this spot. The selections may change regularly as i read reviews and some empanadas were not available when I went there. Location is at a corner and parking is hard to find. Alternative side parking is in effect some days and I saw tickets on cars around the place. I ordered at the window and 15 minutes later they called me. I ordered 3 different types and they were labeled correctly and more importantly were delicious. Staff was friendly. There is no outdoor seating just a table and stand to stand and eat. This is a pure takeout spot.  I would recommend it if you have a hankering for empanadas.  Green sauce is a must."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpOFpQSXNRRRAB",
            "text": "The empanadas and this little spot are remarkable. Order on the phone in advance or at the window. They come in three shell types: corn, wheat, and whole grain. All are good, but the hearty whole grain is particularly special, and uncommon.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdDc3Sk9nEAE",
            "text": "Trek to Queens to checkout Empanadas Cafe. Upon arrival the ordering process is a bit confusing and you have to flag a staffer or ring the bell to get their attention. The establishment doesn’t allow entry and you must order from a window which makes the experience a bit impersonal.\n\nYou order and wait until your name is called. Once the order is ready and your name is called you can then make payment which I found a bit odd.\n\nThe empanadas were overall really good. I enjoyed the empanadas de Maíz more than the other.\n\nTheir outdoor space is not suited for eating and oddly placed tables on an active sidewalk is not ideal. I recommend heading to the park which is relatively close by car or by foot."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMWRqWXFRRRAB",
            "text": "Empanadas, different place..for a fast snack,or quick lunch, very good Empanadas, comes in corn or wheat, delicious.\n\nI enjoy the delicious fish with potato and the traditional meat, it's  right on the spot freshly made, they have a whole different type of empanadas for every taste at a great price,the staff are great also don't forget the drinks.\n\nDrop by check it out."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMybmUyTS1nRRAB",
            "text": "MAN!!!! THE BEST EMPANADAS EVER!!!!\n\nI ordered chicken with potatoes,pork and fish.\n\nFish was ok.\n\nCHICKEN WITH POTATOES AND PORK are LEGIT ones to try!!\n\nPrice is reasonable.\n\nYou call ahead and they will get it ready within 20min. Hot and crispy!! so YUMMY🤪🤪\n\nAfter I ordered, I waited about 15min. before my name was called.\n\nBE AWARE that this is good place so street parking is terrible! but it is worth it!!!\n\n⭐️⭐️⭐️⭐️⭐️🤩🤩🤩🤩👍🏻👍🏻👍🏻"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3b3N5NEdBEAE",
            "text": "This is by far my favorite empanada place! They make the best white flour mix vegetable empanada ever! They have a variety of fillings you can choose from with 3 different flour types you can choose from. Staff is very friendly and helpful especially if you don't speak Spanish like myself. Been going here for a few years - worth a try if you're in the area!\n\nEDIT: got 10 mixed vegetable empanadas and took a bite into my first empanada and it was not a mixed vegetable empanada, instead it was a ham and cheese empanada and being vegan that's no bueno for me. Check your empanadas before you leave to make sure it's what you ordered. First time this happened to me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0N05Ic2RREAE",
            "text": "So I ordered through Uber eats & my food arrived hot & fresh ! I got a bunch of different empanadas & they were ALL amazing !!!!!! The sweet plantain & mozzarella cheese was very interesting & soooo good ! I will definitely get that option again ! You guys got it ! I will definitely order again & check you guys out in person !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MWI2N1lREAE",
            "text": "Absolutely phenomenal empanadas!\nTried 5 different kinds, they were more than great - they were substantially different from one another!…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdDctd1VBEAE",
            "text": "a little pricey but they are your best bet. theres another colombian empanada spot down 108 thats cheaper but u will neeeeeva get this taste and this pretty package there. if u wanna save $$ go somewhere else but trust me ur gonna come back. worth the price. also its takeout window service only so you dont have to go in and leave smelling like food so thats a win for me. love this joint"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybXV1ZS1BRRAB",
            "text": "Prices same or better than other places. Friendly, fast service. No dine-in options, though there are a couple covered benches to the side. Order at RH window, then pay and pick up at LH window. Empanadas made fresh to order!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNE5YSUZREAE",
            "text": "Small but an amazing place with best empanadas in Queens. It is a popular location and therefore expect it to be packed. The food is amazing and worth the wait."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlM3F5NnZnRRAB",
            "text": "If you want to find a great spot for Empanadas, this is the place to go. A must whenever I am visiting NY. A lot to choose from, but I bet everything has a great taste. My personal favorites are the Maduro/Mozzarella & the Pork ones. You can even buy them frozen and fry them later. I wish they had a parking lot, it would be the perfect place."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjOGEtS0VBEAE",
            "text": "Hands down best empanadas in Queens! One of my favorites spots all year round! I usually order the shredded chicken made from corn and ground beef made with white flour."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCM3JQeEJ3EAE",
            "text": "I passed by this place having heard they had they the best empanadas in the area and I have to say they didn't compare to Rico pan in Woodside in the least. I can eat like six of my favorite ones from there. These were a pleasant quick…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3anFDbnlnRRAB",
            "text": "So I live right and the neighborhood and their empanadas are good. Only complaint is that they close early. It’s a takeout spot with small bites. Doesn’t really need to be open at 8 am. 12-11 at least for weekends would be much better"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlajhMMmtnRRAB",
            "text": "-Decently priced\n-better than mama empanada\n- the bacon egg and cheese was a lot better than I thought.\n-can be a bit of a wait as it can get busy."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrdWR6OURREAE",
            "text": "Empanadas are great, not too expensive. Coming from Brooklyn to Queens is a long drive, so it's out of the way. But that's my only complaint. Definitely worth the drive."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3ek5leFVnEAE",
            "text": "FANTASTIC FOOD! Honestly the best empanadas I have had in a long time."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMHBfMHNRRRAB",
            "text": "The Empanadas are amazing. I usually get the cheese, and breakfast. It’s perfectly filled with  fillings depending on which one you get. There’s not too much cheese, but the breakfast is filled generously with egg, cheese, and bacon. It takes about 20 minutes to get my food ready. The only thing I dislike is that there’s no dining in. It closed Becuase of COVID."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnLXVpU1VBEAE",
            "text": "Cash Only. The best empanadas in all NYC, Super Tasty, very friendly staff, very small place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyN3ZiLXN3RRAB",
            "text": "Best Empañadas in Queens. The prices are very reasonable. They have interesting options, and EVERY order is made after you place it; they are well worth the wait. My personal favorite is the Hawaiian Empañada! Very limited outdoor tables/seats ( NO indoor seats), so most of their business is take-out. Strongly Recommended!"
        }
    ],
    "reviews_count": 70
}