{
    "name": "La Fusta",
    "place_id": "ChIJFx8HV6lfwokRZBepb4QEmX8",
    "grid": "QN4",
    "address": "80-32 Baxter Ave, Elmhurst, NY 11373, USA",
    "rating": 4.4,
    "user_ratings_total": 945,
    "phone_number": "(718) 429-8222",
    "reviews": [
        {
            "date": "6일 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMGVUSk9PRk5HZDJ4b2JFZGxVR001VEZCb1NuYxAB",
            "text": "Es el lugar menos argentino que he visitado.. la comida no tiene sabor y las empanadas me dejaron un sabor a grasa horrible. Y encima un dolor de estómago ."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGck5XZGlWMmhETW1WWVdsaG1NSHB6VW5oUGVXYxAB",
            "text": "If I could give them 10 stars, I would! The best Argentine grill by far! The food was absolutely amazing — from the parrillada and sangria to the appetizer, salad, and the delicious flan for dessert. Rosa and Luis provided the best service — so kind and attentive. They truly made our day! Highly recommended, totally worth it!\n\n⭐⭐⭐⭐⭐\n¡Si pudiera darles 10 estrellas, lo haría! ¡La mejor parrilla argentina sin duda! La comida fue espectacular — desde la parrillada y la sangría hasta la entrada, la ensalada y el flan de postre. Rosa y Luis brindaron un servicio excelente, muy amables y atentos. ¡Hicieron nuestro día! Súper recomendado, ¡vale totalmente la pena!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRWFuWnhiMFpoYTFSRVdTMVhMVVpDVkVOTWJtYxAB",
            "text": "Ive been coming here since I was 7 years with my parents, I am now 26 and this spot still doesn't disappoint. Queens never disappoint u heard"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCYWVtVlZNVVpsYVdKR1VWSmZTRjl2YUZCd2QzYxAB",
            "text": "great authentic Argentinian food,this place its and institution in Queens."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabk5qRmxNRTFHZVhWeVNIVnZXRXAwUzB4blQxRRAB",
            "text": "Excellent steak and fish.  Fresh salads.  We had a business meeting here and this place is easily able to accommodate a small group of people.  They have a TV and we were able to hook up a computer with HDMI cable.\nService was swift and efficient.\nAlso, this restaurant is right across from Elmhurst hospital.  Occasional ambulance sirens would not spoil an overall good experience."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WlEwbEdNRk0wVTJoWFozZHphVjlrUjJOM2JtYxAB",
            "text": "The place delivers on food, service, and atmosphere all at once. The dishes feature fresh components presented thoughtfully. La Fusta deserves more credit than I can articulate. The team's service quality impressed us. I'm completely taken with this restaurant."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aU1EaHhiV295VW5jMVQySkhhekZKZWpKZlFsRRAB",
            "text": "AMAZING food, service, music! Muy profesionales y atentos!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR1EzQkNkMDlPUkc5T1VqVnVkMUEwUWxKWlFsRRAB",
            "text": "Longtime Favorite, But Slipping Fast!\n\nWe’ve been loyal customers for years, but this visit was disappointing across the board.\n• \tGrill: Ordered the large Argentinian grill medium rare, but it came out well-done. And the meat lacked quality.\n• \tSides: Ordered special fries, received regular ones. Veggie options were limited to spinach or broccoli—but spinach wasn’t available.\n• \tService: Only one server for the entire restaurant. Water wasn’t refilled, and basic bathroom supplies like toilet paper and hand soap were missing.\nThe price is still reasonable, but the overall experience has declined sharply. Sad to say, it feels like the place has changed for the worse."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQ1NFVnViRmg1Wldwb0xURlpVemhJZWpSTk5GRRAB",
            "text": "En resumen: la entrada y la atención estuvieron muy bien, pero la parrillada —que es el corazón de un lugar como este— no alcanzó el nivel esperado. Ojalá puedan mejorar en ese aspecto porque el lugar tiene mucho potencial.\nLa mesera y el señor que nos recibió ambos son muy amables y el servicio cumplió 10/10 eso vale destacar"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214M00wTnpha0pIYjI1UFVFWmxlWE00Y0ZKVlZrRRAB",
            "text": "The décor at La Fusta was lovely, but the overall dining experience fell short. The steak arrived semi-cold, the sangria seemed to be only red wine without liquor or sweetener, and the Russian potato salad was quite dry. In addition, the delivery of food took longer than expected. Hoping these areas improve, as the atmosphere has great potential."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMWJyYm93RRAB",
            "text": "The food is very good, the cuts of meat are good, the barbecue has a good cost, the Argentinian grill for two is highly recommended, especially if you like to try flavors and textures. Very good in the service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSmMybFVhVWR1UmswNVVYVnBUMXBWTVRkWmRsRRAB",
            "text": "Lovely restaurant with great atmosphere and friendly servers. Food and drinks were mostly on point. The empanadas (beef, chicken, and spinach) were all great. The entrana (skirt steak) was the highlight of the American Grill. Free bread and chimichurri refills. The broccoli and mashed potatoes were a bit bland, but fine."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNVgzQXlaVzlZTURnNWJtRmZUak14TUVSV1RsRRAB",
            "text": "Always a favorite for skirt steak and the La Fusta salad. The live music doesn’t hurt either. Been going for years. One of me and my husbands favorite restaurants."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdGRETjZNWE5SVjJ4T01YVjFObU0xWVZwbE0wRRAB",
            "text": "I’ve been coming to La Fusta for nearly 10 years and it’s been consistently amazing. It’s truly a hidden gem of Elmhurst. You can get a beautifully cooked steak, enjoy live music and have the friendliest staff take care of you here. Go here and bring your friends. Share the sangria, enjoy all the food. You won’t be disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoblJrUjJUVTl2TTI1alNWQmljRzlVVDJ0bVpVRRAB",
            "text": "Leaving this review so hopefully La Fusta can take some accountability….\n\nTo celebrate Father’s Day this year, we wanted to go to our fave restaurant La Fusta. We made a reservation for 6:30pm for 6 people. We were told we’d be accommodated and they looked forward to seeing us.\n\nWhen we arrived. There was a line and huge wait of people who all had reservations. Everyone had been told to come for their reservation time but none of us had been told when we’d arrive that we’d be waiting in line. There were families with 4 plus people waiting, many with older family members and babies/ toddlers. We were not given a reason for the wait or given an apology of any kind.\n\nDespite the wait, we wanted to stay because the food is always good at La Fusta. However then they made a very racist decision which left a horrible impression on myself and my family. The hostess decided to sit the family AFTER us in line BEFORE us because the white man at the front of their group complained. Supposedly they had a reservation for a half hour before us, but that is not what their family had been saying while they were waiting. They had been saying their reservation was for the SAME TIME as us. Since they were on line after us, they should have been sat after us. However they were intentionally sat before us. As a family of latinos, it was hard not to perceive that decision as blatantly racist.\n\nWe have frequented La Fusta for many years and for many special occasions. However, after this overt racism we’re left considering if we’ll ever return. Such a shame considering that their staff is predominantly latino as well.\n\nHoping La Fusta takes some accountability for this decision and reaches out to make it right."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKMy1vOWFodnJHTFNREAE",
            "text": "This spot has been around forever and the food’s still good, but the place just isn’t what it used to be. It feels run-down and outdated now."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLU1k5TUt5ajZtUnFBRRAB",
            "text": "The best Argentine restaurant!!!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQN0FqTkcyck9xOFZREAE",
            "text": "Me encantó excelente todos"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJTEkyTjZ1M1pfbmtBRRAB",
            "text": "I think is time to refresh the restaurant, furniture feels old and the place is very dark, food was OK we ordered the parrilla argentina and a steak, it’s better just to order the steaks, the parrilla comes with a lot of fat to make the plate look full, service was good…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvamNtODhnRRAB",
            "text": "The meat is a little delayed, but it is delicious"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJai1la2RBEAE",
            "text": "Un lugar agradable y sus carnes fenomenooooo...un lugar Recomendado"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJODdYM1BnEAE",
            "text": "Great place for enjoying a nice steak and having a good time! Thank you for your service, Saul. You were amazing! :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJazVxa2FREAE",
            "text": "Excellent food, and service is always wonderful very accommodating to change things with platters ordered"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMFlmd2h3RRAB",
            "text": "Excelente"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aElLUURBEAE",
            "text": "Excelente lugar,  recomendadisimo!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3Mll2WkNREAE",
            "text": "This is one of my favorite places to visit, I always feel at home. Great food and overall ambiance. The service is great and the food is delicious, well priced and extensive options. Vallet parking is available by parking in the hospital and bring the parking ticket to the table and they will cover it. Host your events in their private room that can fit up to 30 people to be in the comfortable side, but as much as 40."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRLUxIeVZnEAE",
            "text": "We lost track of how many decades we have been clients (LOL!). But I can definitely say the food is consistently delicious and the service is great. The mollejas (my personal favorite) are heavenly."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReG96a3hRRRAB",
            "text": "The waitress are really gentleman’s, the food is delicious"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbmZEVTZRRRAB",
            "text": "The service was impeccable, from the food, the people, and presentation. Extremely attentive. Also our server Luis really made us feel at home."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc2RfenV3RRAB",
            "text": "Excellent!!! The service, food and atmosphere is an experience in itself. Everyone is treated like family. The steaks are flavorful and cooked to perfection, the empanadas are out of this world. The bar is a highlight of comfort and live music entertainment. It’s a great steakhouse, bar, and restaurant. ✨🎵🍸🥩🍻🎶 🍹🎤🍷"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ1otTnZ3RRAB",
            "text": "Got a blood sausage sandwich, had to wait forever to even get a menu much less any service despite the restaurant on the whole being pretty empty. The food was mid."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNHE3S3VRRRAB",
            "text": "Muy buena la comidas y los meseros muy atentos"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbnZucXZBRRAB",
            "text": "Excelente la atención, el ambiente es muy acogedor,tranquilo, relajante, y la comida deliciosa."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbnJtVS1RRRAB",
            "text": "Excelente comida y muy recomendada. El lunch especial es completo y con muy buenas porciones. Uno de mis lugares favoritos de Queens."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2c3E2U2J3EAE",
            "text": "I have been going to La Fusta for more than 30 years and I really love this place, the food, ambiance, service has stay the same. It has change owners I believe twice, but the menu and quality of food has stay high quality. I enjoy going there. Especially I take advantage of the lunch menu from 12pm to 4pm and prices are much lower. I love the Sangria (white or red) from the place. I recommend you buy it by glass. Also on the lunch menu you can get 3 empanadas for a cheaper price and you can combine spinach or meat. Also I love the Russian potato salad, the entraña or skirt steak is half a price during lunch plus you get two side orders free. The soups are wonderful from the place and I love the mondongo soup. Finally the combination of salads with skirt steak or shrimp is my favorite. For me La Fusta is a wonderful Argentinean Restaurant. The lady owner is from Uruguay, but has kept the restaurant intact and it has worked."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQazV5ckV3EAE",
            "text": "I love this place💛 they have the best food and excellent service"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNlBxQXhBRRAB",
            "text": "Very hit or miss. I went there two weeks ago and the food was excellent. I went there yesterday and it was not good at all. Overcooked, cold meat. The La Fusta salad, which is normally delicious and full of stuff, was essentially just lettuce and onions this time. Drink your water slowly. It takes a while to get a refill. And despite listing their opening time as 1PM on weekends, it's not. It's closer to 2."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdUplTFpnEAE",
            "text": "I had a great experience here at La Fusta, the service is good and the food is exceptional. We started with the empanadas as appetizer and had the skirt steak. I highly recommend and we will go back to try other option on the menu"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcThqa21RRRAB",
            "text": "La Fusta offers a classic Argentinian dining experience with a warm atmosphere and exceptional service. The standout for me was the chimichurri – garlicky, flavorful, and perfect with bread. I finished the whole serving! The beef empanadas were also memorable, packed with juicy, well-seasoned meat.\n\nThe Cream of Shrimp soup, while generous with shrimp, tasted more like a creamy chicken noodle. It needed more seafood flavor.\n\nThe 20oz Shell Steak was tender and cooked to perfection though a little extra char and seasoning would have elevated it. And the Fettuccine with Meatballs was satisfying but could’ve had a bit more depth.\n\nOverall, a solid experience – I’d definitely return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYM3BHVnB3RRAB",
            "text": "I have been here many times before, however not in some years. I was soooo disappointed during my last visit with the food. Our server was wonderful and so was the atmosphere. It is very cozy and feels genuine. However, I am not sure why this restaurant being known for mainly serving steak has such a hard time doing it well. Our steaks were way over done, we asked for medium. Sent back one plate and once again the steak was not at the point I wanted. I was definitely not going to send it back a third time as I was hungry. They gave us a complimentary dessert for the issue. That was great, but still I would have much more appreciated a medium done steak! Oh yes, the sangria was very nice and so was the spinach."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMU9uOEZREAE",
            "text": "La. Mejor parrillada"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYLV8yb0xREAE",
            "text": "ALWAYS a great time, food is ALWAYS on point, which is why I'm ALWAYS back!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueTdUdzdBRRAB",
            "text": "Our steak was overcooked. Fries weren't great. They replaced it with no fuss. Service was great. They gave us dessert to make up for the blunder.\n\nMaybe an off night?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuM2JiZHpRRRAB",
            "text": "Good food and our waiter is the best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuek9uUEJREAE",
            "text": "Worst place ever, food is great quality but quantity is the worst. This was 65 dollars they said it was enough to eat for 4 people and this is enough for 2 people only. Never coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubHJYcmdRRRAB",
            "text": "I had an incredible dining experience at La Fusta in Jackson Heights yesterday. We started with the chicken, beef, and spinach empanadas as appetizers, and they were all absolutely delicious—flavorful and perfectly cooked. For dinner, I had the 1/2 skirt steak (entraña) with a side of fries, and it was cooked to perfection—tender, juicy, and bursting with flavor.\n\nFrom the moment we walked in, the welcoming staff and quick, efficient service made the evening even better. La Fusta offers not only amazing food but also a warm, inviting atmosphere. Highly recommend for anyone looking for a perfect meal!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0c1BhcTB3RRAB",
            "text": "A definitely very well done atmosphere, warm and pleasant room to feel like in Buenos Aires, excellent barbecue and more, recommended!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIM2NyY0lnEAE",
            "text": "Buena carne"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bGJ2SXd3RRAB",
            "text": "Great food and great service. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aktyWmZ3EAE",
            "text": "Mi gente tengan cuidado cuando estén degustando en este restaurante, por experiencia propia y mi familia nos dieron algo en la bebida, que todos menos yo perdieron la razón se les olvidó todo, y las consecuencias que tuvimos después de todo lo sucedido, y llegaron a la mesa y nos mesclaron una bebida sin autorizarlo, y a partir de ahí paso todo lo que acabo de exponer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWZzVEZk1BEAE",
            "text": "The Service was the best of all the restaurants I have been visited in New York , the food was good and not on the top though. Only one thing I could say it is the table quite small , not enough to place the dish 😂. The environment Exactly looks/feels like in Argentina, you would know what I mean."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNHBfaFJREAE",
            "text": "Fabulous meal with amazing service.  I have no idea why anyone had a complaint everything about this restaurant was perfect.  Had the La Fusta Salad, Argentinian grill for 2 and the flan.  Amazing food well portioned.  I also had a perfectly made Bourbon Manhatten.  I am going back for sure."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MGVTZzhBRRAB",
            "text": "Omg 10/21 sat down at tjis place amazing. From the stake the drinks, and service amazing luis is a amazing server, friend thank you. Very cozy place I only order take out but the food is delicious.  I got the stake salad with chicken, it brings avocado and eggs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURELW8yam5nRRAB",
            "text": "This was my first time visiting and I have to say that I was impressed. Service was outstanding. Skirt Steak was amazing. I will be back"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaVBhUzhnRRAB",
            "text": "We were three people, on Monday.\nAs soon as we sat down they brought us chimichurri and hot bread.\nWe ordered meat empanadas as appetaizer and provoletta with oregano.\nThen a 20 oz flap steak that come with a side (we ordered Russian salad) and an avocado salad.\nFor dessert pancakes with dulce de leche.\nI must say that all the food seemed very good to us, the attention was also very good from the waiters who were there today.\nI would return and I would also recommend it, I liked it a lot 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscnR6ODZRRRAB",
            "text": "Visited looking for argentinian empanadas while walking around the area and the many eateries near the subway - we found here the best argentinian empanadas in the city so far 🔥\n\nWe ordered one of each for take out: spinach, chicken and beef + 2 Quilmes beers (USD$24 including taxes) and they were ON POINT - very well seasoned, beautifully made, the chimichurri sauce, the eggs and the olives gave it the perfect touch 👍🏻\n\nWe are looking forward to going back to give their main dishes a try 🌝"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1b282QXdnRRAB",
            "text": "Visited La Fusta while visiting New York , and the food was amazing, i order a combination plate with steak, chorizo ,Morcilla and the famous Sangria. The service was great , i felt like i was visiting family members. Will\nDefinitely come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaXYtLW1nRRAB",
            "text": "We dined tonight, and usually, the skirt steak is tender and cooked perfectly. It was chewy tonight. The waiter replaced it with the shell steak, butterflied, and it was much jucier and better. The mashed potatoes were delicious 😋 The white sangria was full to the top with lots of fruit. It's very refreshing on a warm summer evening."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwZzlEbDZRRRAB",
            "text": "Gave them 2 chances. Steaks not cooked to my order. Appetizers not good. Cold antipasto is potatoe salad and slice of ham, no cheese. Over priced. Gave it a third try and food was very bad. The chicken with mushroom sauce was like chicken with Campbell's Tomato soup. My steak was so tough I needed an extra sharp knife."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZaUwzMEJnEAE",
            "text": "It's an old hidden gem , with good food. I enjoyed my chicken with lemon and wine sauce . And so did my partner enjoy his steak. If you love sangria you must have a cup. I recommend this place. The only thing I found unpleasant was the cocktail shrimp it was salty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaEtTWHpnRRAB",
            "text": "Such a cozy and lively restaurant with delicious food. The mix grille was tasty but my favorite was the shrimp ajillo. The prawns were cooked perfectly and the broth was flavorful. It's a great combo with rice. One of the best I've had.\nServers are friendly too."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3c295LWJBEAE",
            "text": "Very nice ambience. I had shrimp la fusta and my companion had pork chops with sauteed onions. The shrimps are lightly battered with creamy tomato sauce and bacon. The cream sauce is perfect for a pasta dish. The pork chops are moist and tender. Both portions are nice size. Good food and good value."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZ19MbmxnRRAB",
            "text": "First time at this location as we usually visit the NJ location. Great staff and overall food was good. We did order broccolirob and received broccoli, but overall experience was good. Apologies for the salad (Avacado salad) picture, but it's so delicious it was gone before I could take a photo 😅 OH, sangria was good as always!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbGVlYWlBRRAB",
            "text": "Asado de tias and the watercress salad.  Top\nSalad in Queens. In 2001, i discovered this place and it never disappoints.  Fresh selections, amazing staff and always authentic"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEZzU2R1ZREAE",
            "text": "We usually visit the location in NJ but while visiting the family, we tried this location. Service was good as well as food. Small issue ordering broccolirob and got broccoli. Shrimp soup was a bit bland. However, steak, pasta and avacado salad were delicious as always."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaUxxQy1RRRAB",
            "text": "Lovely meat experience. We ordered the meat platter with skirt steak, ribs, chorizo and chicken. Very flavorful and the portion was huge for a family of 4. Empanadas were excellent. We enjoyed our visit!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbjc2bGZnEAE",
            "text": "The best Argentinian steak house in Queens\nMy favorite is the Watercress and avocado salad with shrimps. Also the empanadas are delicious"
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGX29hLWNnEAE",
            "text": "Excellent restaurant, avec portion très généreuse. Service très sympa. Prix encore corrects, Famille bien accueillie !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLXIzX3J3RRAB",
            "text": "The empanadas were delicious, the steak was good, but a little fatty. Overall the food was yummy and the service was great."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcjlXX1ZnEAE",
            "text": "I ordered alfredo fettuccine it's really good.it's creamy not dry like the other place I tried.   Update\n04/17/2022 today I ordered alfredo fettuccine but the taste is not the same.it's lacking flavor."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcmJfbDB3RRAB",
            "text": "Really great place that if you're into meat, you gotta give it a try. It was a great experience. The waiter we had was awesome. We ordered Picada w/ French fries. Pictures don't do it justice."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcC1pOG93RRAB",
            "text": "Great place with super tasty and very high quality fresh meat! A must have is the Argentinian grill platter with its signature meat treats! The service was excellent, the atmosphere was very nice and romantic and the place is suitable for…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtc3B2VkxBEAE",
            "text": "Crowded most times so place gets cramped. Takes some time for order to get cooked. Food was great though. I loved the grilled salmon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPM3Z6Rjh3RRAB",
            "text": "A nice find in Elmhurst. All the dishes were delicious. Only regret was out of Tartufo dessert."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbV91OXpnRRAB",
            "text": "Salad was okay. The sauce could use more flavor. But I ordered a shrimp and avocado salad, yet there was no avocado."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvanFfNFVREAE",
            "text": "I love this restaurant, the food is great, and very good service. they changed the presentation of the menu"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtM2NyVkNnEAE",
            "text": "One of my favorite. Great customer service. Skirt steak!"
        }
    ],
    "reviews_count": 77
}