{
    "name": "El Artesano Bakery",
    "place_id": "ChIJb-A3HTRfwokRTlmpDZYCzFM",
    "grid": "QN4",
    "address": "90-16 Corona Ave., Elmhurst, NY 11373, USA",
    "rating": 4.5,
    "user_ratings_total": 37,
    "phone_number": "(718) 440-9227",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUWEySTVRV2t3UTNCaU9WVnpVa1ZsWmpsa1gzYxAB",
            "text": "Very expensive for no reason.The sold me a $6 12 oz iced coffee that the sugar was at the bottom of the cup more milk then coffee when a splash was what I asked. When I tried to get I what I paid for I was told to leave."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQmNFMHlUSFZ3T1dFeWVscFhaRTFZZDJOcVkyYxAB",
            "text": "I had work in NY and landed at LaGuardia Airport. Was hungry and came here. Good food and nice people."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVGRURnNMV0p4UkhKS2JIUlFYMHRxTWtkbVUyYxAB",
            "text": "Muy rico el capuchino y los croasan. Las empanadas también ricas para mi familia y para mí fue un gusto encontrar un lugar con calidez y muy buena la comida como la atención"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTVNIcHVZVGt6UlVwQ2NGWkRNazFDVlRGTFpVRRAB",
            "text": "Very poor service just bough coffee wet in my car and the lid wasn’t secure coffee spill out of the cup and mess up carpet and console in my car very poor service do not recommended"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaE4zZXRRRRAB",
            "text": "Dining at a Colombian restaurant is always a blast! The food is bursting with flavor and the portions are huge. The atmosphere is super inviting and the service is always friendly here. Whether you’re in the mood for some tasty street food or a full-on traditional meal, this restaurant are the perfect spot for an authentic Latin American dining experience,\n\nThe only downside is that the chairs are a bit tall and uncomfortable to sit in. It’s great that there’s a window table bar chair, but for the center table, I think it would be better if they had normal dining chairs"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbHJ2cmRBEAE",
            "text": "El pastel que Recibí  fue mejor de lo que yo esperaba  y el servicio es muy amable 100% Recomendable"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNU9HNVRREAE",
            "text": "Great spot, I come here a lot."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaU1hS29nRRAB",
            "text": "Me encanta el sabor, la atención el ambiente. El precio es muy bueno teniendo en cuenta la calidad de la comida."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aXNiRWJnEAE",
            "text": "La comida es excelente muy casera y a muy buen precio , los pasteles son deliciosos y la picada completa es excelente y alcanzas para varias personas , el servicio al cliente es excelente 10/10"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYa3EyZDF3RRAB",
            "text": "Super bueno el lugar!! Muy amable la chica valentina! Y una excelente energía!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqLXJQSFVBEAE",
            "text": "I always go here after work. Variety of great food and items. Inexpensive costs what’s not to love in this place."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcmFMZ1J3EAE",
            "text": "La comida del lugar es muy buena\nEl servicio es muy bueno la gente que atiende es muy buena onda\nEl ambiente es de lo más colombiano que alguien se puede imaginar\n\nEl mejor restaurante colombiano que eh comido"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEN0lXQTh3RRAB",
            "text": "Riquísimo desayuno y que decir la atención al cliente de maravilla lo recomiendo el 100%❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOak1EOHJnRRAB",
            "text": "They have best shakes ever and their sandwiches are so tasty"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsbjVMdXlnRRAB",
            "text": "Love it here. Las mejores empanadas y chicharrón. Always clean and very good service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsbl9TaFN3EAE",
            "text": "Great Bakery, bread is outstanding we order our coconut bread from El Artesano and is always fresh and delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsZ2RudUhREAE",
            "text": "This Colombian bakery is amazing! The smell of fresh baking hits you as you walk in. The food and bread are incredibly delicious. The people there are really friendly, and the place feels lively. Five stars for an amazing culinary experience!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsZ2FMVkpnEAE",
            "text": "En el artesano Bakery te sientes como en casa, todo lo que tienen en su menú me encanta, además las tortas personalizadas que son lo mejor! Ofrecen muy buen servicio al cliente! Es mi nueva bakery favorita!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaHFMX0tBEAE",
            "text": "Great Colombian bakery. The coffee  and pastries were fresh and tasty. . The staff is also very friendly."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eUpUQ3lRRRAB",
            "text": "Uff que delicia de panes volví a mi tierra 😋…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1eWRteHdnRRAB",
            "text": "Deliciosa comida, me llevo a la tierrita con el sabor, buena atención, gracias por el buen café"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dnJqQ01REAE",
            "text": "Me gustó mucho el concepto que maneja el lugar,  pues consigues desde un buen pan de bono hasta platos mucho más elaborados. Deben conocer su menú, está increíble!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1M3RIM2VnEAE",
            "text": "I ordered the Arepa with chicharron and sweet plantain and a coffe, and Omg it was delicious, the sauces that it came with the arepa enhanced its flavor and I for sure will keep ordering more from this place, definitely not the typical Colombian bakery."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1bnB2ZkdBEAE",
            "text": "Súper recomendado, un sitio agradable y muy buena atención… Deben probar el sándwich de albóndigas, las ensaladas y los postres, y ni se diga de las tortas personalizadas, lo máximo👌…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NnQ3MUl3EAE",
            "text": "Mis favoritas son las tortas de chocolate con relleno de arequipe, sus panes y galletas deliciosos también. Los recomiendo"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1eUtQN2tRRRAB",
            "text": "A cute little Colombian bakeshop with very reasonable prices and friendly customer service. I enjoyed their 2 scrambled eggs with cheese on a sweet roll very much."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1c0tiV3dRRRAB",
            "text": "Love this coffee place, arepas, empanadas or any of the breads are so delicious and there is some amazing cakes 🍰 that you shouldn’t leave without try.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabC0td1p3EAE",
            "text": "It's a nice cozy place and looks very different from what you see in the neighborhood, the prices are very unexpensive. I have tried a few breads already and each bread was better than the other. Recommend 100%"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabDRPZnZnRRAB",
            "text": "Venden pan muy rico, 100% colombiano. Me encantan sus pandebonos y pandeyucas, muy frescos, hacen sentir en casa. La atención es muy buena. Volveré"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeWR2Qnp3RRAB",
            "text": "Tengo años en el vecindario, han pasado como 8 negocios por éste bloque, restaurant y diferentes cafeterías, queremos cosas nuevas no copias de los vecinos... sean auténticos"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadHQyaEFnEAE",
            "text": "This is my favorite coffee shop. They have the best coffee and pastries! All at a great price. And the customer service is awesome as well."
        }
    ],
    "reviews_count": 31
}