{
    "name": "Park Side Restaurant",
    "place_id": "ChIJi92ZUM5fwokRekBGVkRa6jw",
    "grid": "QN4",
    "address": "107-01 Corona Ave., Corona, NY 11368, USA",
    "rating": 4.6,
    "user_ratings_total": 3193,
    "phone_number": "(718) 271-9871",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cFIyMU1hMlJOTWtoalRUSkhOM2d6VGpZNFVtYxAB",
            "text": "great staff"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocFkwVlBXa2cwTlhnd2VuSmlVR3RFUTJVME1IYxAB",
            "text": "If you don’t know…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUVp6VnVNRlZ6U0VjMlUwaFhaM2RDU0hGck4zYxAB",
            "text": "Absolutely classic spot with attentive service, friendly staff, beautiful interior, great food at reasonable prices and the atmosphere is one of one, this one my favorite restaurants in the city.\n\nI’ve dined here many times and didn’t realize I never left a review."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwa1FqSnZWWFZ5UkhOSU9HOUtWRFZOZDFsck9IYxAB",
            "text": "The owner gave us a warm welcome and seated us immediately in the beautiful, high-end restaurant, which is rumored to have a dramatic 30-year history. I was excited to be there.\n​Unfortunately, the waiter's service was consistently poor. He was pushy about the daily specials, placing both hands on our table every time. When I ordered the $23 angel hair with meatballs (to stick to my protein diet), his face showed clear disapproval. He only approved of my friend's $37 filet, commenting, \"This is nice,\" which felt like a slight against my less-expensive dish.\n​The service became bizarre when a kitchen staff member was thanked for a side dish but responded with a strange, negative head shake and finger wag. The worst moment was when my friend politely asked the waiter for extra white sauce for her dry spaghetti; he refused and, without asking, aggressively put cheese on her plate instead. We chose not to create a scene, despite my frustration.\n​Dessert was mixed: my friend loved her mousse, but my favorite crème brûlée was a disappointment—the crust was burnt, and the cream was tasteless.\n​On the way out, I shared our experience with the owner, who was sincerely apologetic. Despite the beautiful setting, the bad service overshadowed the evening. I still recommend the place, hoping others get a server who values good service. I left a 15% tip after noting a circled \"20\" on the bill, a choice the owner understood."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MGFIZFBaV0ZRVnpWQlpuWkRhWGRsVVdKSGFYYxAB",
            "text": "Used to be a great place ! Last two times I was there wasn’t happy.  And too many guys here have watched good fellas over and over.  Almost a joke"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMFowUmtia1ZJUzNGblJ6aEVWamRrUVhneFQwRRAB",
            "text": "had a lovely time, food was amazing, the service was so kind and attentive, and the restaurant is beautiful. will be back!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psc1QwbEZOWEJmZGtOZk1VNDNUR1JhU2xRNFNuYxAB",
            "text": "Lamb chops and branzino is what I had the pleasure of having. The fish was well prepared. The lamb was not my favorite. Very chewy. Prior to the entree I had garlic shrimp and beet salad. Delicious..."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210T05sWXhMWGxNU0hCdlpVVTJWRk0yWlRObVdHYxAB",
            "text": "Great service and food lobster tails was amazing"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZdFFtVlBVMnd4ZVVGMlQyeElkMWh1VDNSUk0zYxAB",
            "text": "delicious food !! all in all 10 out 10"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjM1IyaENRbEZQUTNSTWJVa3diMmxEY0hCcE1GRRAB",
            "text": "Old time queens Italian red sauce place. The experience was nice.  The food was good but not top tier.  Although worth it. The value and experience of OLD queens was excellent."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMVlsSkdUM2RvZUhveVkwWmtPVk5VVjBFNFRVRRAB",
            "text": "I loved it just made me feel Italian. The chx parm was delicious"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KR1ltMHdiM1U1VG1KbGEyMUNiMHhuYWpJdE9XYxAB",
            "text": "Awesome atmosphere and amazing food.  A must go to."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WU9FWlZTbkZrUzFCQ05YSTVRMnBYV2tZdFRXYxAB",
            "text": "Fantastic good food"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTlNtUkdabVptVWpkek1GZFBaemx1Um0xcWFsRRAB",
            "text": "It’s a nice place a bit dark and dated. I found the service to be overbearing but I think in certain places, it’s part of their selling experience. This is old school. I thought the food was good/very good. Not the best meal of my life but enjoyable. But - it’s too pricey for what it is. I think this is one of these cases where people go for the institution."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cE9ESmZWRzEzV1MxU01IZDZiWG80Y1ZVdFlXYxAB",
            "text": "Over the years, this place has deteriorated significantly. It used to be such a great restaurant with amazing food and service. I keep going back thinking it was just a one-off experience. But time and time again I go back, the service is horrible and the food mediocre at best. Drinks are also nothing to be proud of. This place can be something great but it is no longer."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMWJHVmhZbEpqYURneVUyNUlYMDVwTUdSSVRsRRAB",
            "text": "Un ambiente súper agradable y la\nComida deliciosa 🥰🥰🥰"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSS1JqUlJSa3hVVUVJdE9ITklVbFI1WkdnMWVIYxAB",
            "text": "Excellent I have been there a while back, the food from appetizers to dessert is excellent. Celebrated a friend's birthday, she's never been she was blown away!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadGIxaGFVbVZ3UTBvME5YaDRiWGhQT0ZRM1lsRRAB",
            "text": "We go here for classic Italian dinners with our family. Incredible atmosphere, feels very old school and the food is incredible."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGZlQzSnNYMGRYZEdGQ01rMXFSbUZYWlhGMldYYxAB",
            "text": "Pretty price, the tomahawk steak was good sized."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eVlVNVZia3hVWHpKb2VGSXlZa1JZZUVKSloyYxAB",
            "text": "good for special occasions"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gak4zbFNUR3BaTkdGM2JXTmxZazA0VTBGRmVHYxAB",
            "text": "Parkside is always a gem, got stuck in queens after a Mets game and ended up dining here. From the delicious appetizer to the fish of the day. I couldn’t recommend it more. They have a valet, and super service. What more could you ask for"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNU1WUTJhSHB4TjA4MVRsRXhRMkZvYlZGVFUyYxAB",
            "text": "Very classy"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSS01rY3lOakZHWWtSdlFqVllaR3BoY3pKcFNYYxAB",
            "text": "Sorry that I showed up so dirty, I was stuck at the windmill farm for almost 2 days with no food. The older lady did a fantastic job. Appreciate you ladies."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vdFpUSXpiemd3ZFZsTmN6aHhaeTFRYVY5RmVVRRAB",
            "text": "We stopped here after working outside all day We were from out of town. The food was good but service was slow. We sat in the bar area. It did start to get busy so we tried to get our check which took a while. You would think he would have given us our check when we said we didn't want dessert and we had boxed up our food. The appetizers provided or delicious"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdG9uLVF3EAE",
            "text": "My favorite place in Queens for great Italian food and service. Legendary and well known, you never know who you will bump into from sports stars and New Yorkers in the know."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwR1pWbFRUekphZVdwM2NubElabVl0YW5BeFJYYxAB",
            "text": "Classic atmosphere great food. The place was packed before a Mets game. The veal was worth coming back for. We wish we had ordered dessert."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dU1rZEJUVnBLYlc5QlFVRk1MV0ZVTVZoTWVVRRAB",
            "text": "Been going there for many work Christmas party's.  It's ALWAYS TOP NOTCH! From beginning to end and everything in-between. Start at the Bar then enjoy ALL the rest. ❤️❤️❤️"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMldXVTJWSFZXUWpOamEyWTNlRVZ6VmxGT1NVRRAB",
            "text": "The food was delicious, I had the boneless beef ribs with mash 10/10. The service was great. I will definitely be coming back to try out the other items on the menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGalVtd3lOa3BGYWxab1dWbEJXVzlIUkVSelNFRRAB",
            "text": "Quaint place, food excellent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTFlreHNSSFJLTkV4SlNGUktXR0ptVW5ocmJXYxAB",
            "text": "Old school Italian restaurant in Corona. The shrimp oreganata was good. The bread basket was great, yummy choice of breads."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RlFsUXdWakpCVEVGTVNFSnFTRU5wUkdWM1VIYxAB",
            "text": "Amazing food. Great service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUGIwdGFUVjh5WVVWa2VYVkZaRGhoT1dGT1FVRRAB",
            "text": "Old school classic Italian American.   Perfection across the board.  The atmosphere varies from room to room and they all capture something special in a way that now feels like a throwback.    There's an authenticity to this place that is refreshing and unpretentious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUlEzWkVlR1JwUmpGRlQwMUtabk4xTUdORFMyYxAB",
            "text": "The best Italian restaurant in Queens. Excellent food, service atmosphere. 👏"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPM0t1RzFRRRAB",
            "text": "Parkside is really among the last of a dying breed of old school, original, NYC Italian family restaurants. The food is consistently excellent. The service is phenomenal. The ambiance is perfect. This is just an all around great establishment.\n\nI love that the waitstaff is so attentive. They always come by to fill your water, clear the plates, make sure you have everything you need.\n\nI love that they bring you a delicious fresh bread basket and a cheese and meat plate with fresh brucietta before you even order your food. They are the most genuine, thoughtful restaurant. Absolutely a class act.\n\nThis place is outstanding. It's easily our favorite Italian restaurant in all of NYC and honestly, the US. It's just so genuine and so thoughtful and consistently great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTE5HZGpVbGM1VlRBd1EyWXhWamxCTTFCWVQzYxAB",
            "text": "Nobody I mean Nobody gets 5 stars..but Parkside"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OS1lrdEJhV3R1UldkWlRVNUxkakl5TmxFeVgyYxAB",
            "text": "Best Italian cuisine paired with exceptional service. The staff is remarkably accommodating and caring, making every visit a pleasure. With each dish masterfully prepared, choosing what to enjoy is truly the hardest part. Highly recommended!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4Z29IZnhBRRAB",
            "text": "Great local queens restaurant, staple in the community, consistently great food. Best Italian restaurant in queens, we go here whenever we can."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRVNGZHlMVFp6V1RablF6UlFVVU5mWm0xSFNYYxAB",
            "text": "If you are Italian don’t go there !!! $50 veal chops and they have no wine list just Carafes like the Olive Garden of white Zinfandel and Carlo Rossi fake Chianti. Never heard of an Italian  restaurant with no wine program ??"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTU5UaFFOa3R3ZW5CTU9XdG5PVnBPZGxwUVgxRRAB",
            "text": "Timeless spot for amazing Italian food..\nOur server Johnathan was superb.\nCould not have asked for a better lunch."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUlVtZG9NME4xU21odUxWTndiR0pOZW1jdGJuYxAB",
            "text": "One of the best Italian Restaurants I’ve been too. There is only one other that I know of and that’s Michael’s of Brooklyn!  Their Arribiata sauce is out of this world. Alfredo the gentleman up front is incredible. He has lots of stories to tell. Lots of famous people have gone here and it’s based around a Marilyn Monroe theme. Truly beautiful and food is really Incredible and fresh."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUE1ETkdOamMxY0ZaV1NuazRiM0pmU1hoTGJFRRAB",
            "text": "Was an excellent restaurant!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjd2JYSldaRWg2VTJwM1owZzBUalJDWkVsTllWRRAB",
            "text": "My Review of Park Side Restaurant (Corona, NY)\nToday was my first time visiting this restaurant — and I was truly impressed. You can feel the special atmosphere right away. It’s clearly a classic, long-standing place: there were many older guests, probably regulars for years, and also a good number of younger people too. That says a lot about the quality — this restaurant brings generations together.\nThe service was excellent — attentive, polite, and fast. The interior has a cozy, traditional charm. It honestly feels like being at home or in a good Italian movie. 🍝\nThe portions were big, and the food was delicious. Real Italian cuisine, simple but full of heart. I especially enjoyed [insert your dish here — for example: “the fettuccine Alfredo” or “the chicken parmigiana”\nI definitely want to come back again and would recommend this place to anyone who values great food and a warm atmosphere. Thank you to the staff and owners for creating such a welcoming restaurant. 🙏"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyODZLOGdnRRAB",
            "text": "Delicious. Especially love the calamari!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xZmFXRTVlVzVQVERsc1JEZzNkRXQ1WkVwcldHYxAB",
            "text": "Food was good  service was terrible .got ignored.never came back to refill drinks.took too long with kids .sat afternoon"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pObWVFVTFiVkJmYmw4NU4waEZObDlXZHpCS2MyYxAB",
            "text": "A Queens staple.  Been in the neighborhood forever. The funny thing is.  The demographic inside the restaurant is a sharp contrast to the demographic just outside. But the people still go there for that authentic ‘Queens Style Italian food.’ Come for the great food and also enjoy the ambiance. Plenty of characters in there. Loud talking tables with that Queens, Long Island accent. Very ‘NY Italian’ if ya know what I mean. The food was good. Not 1000 percent gourmet, but very delicious. I went with the seafood dish over linguini. Huge portion. Very yummy. Had lobster, shrimp, mussels. I also recommend the shrimp pasta dish. Check the pictures. Presentation is fantastic. The food looks just as good on the plate as it does in your mouth. Not a fan of the baked clams. They came out burnt. Look at the photo. Surprised they sent them to the table that way. Also a very very small portion. Not what I would expect for 15 dollars. Again. Stay for the meal but enjoy the atmosphere. Lots of characters in there. All straight outta a wise guys neighborhood sitcom. I guess they just can’t help it.\nPlenty of parking with valet. Convenient\nThe pistachio dessert was tasty. Left with enough food to take home. No regrets."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeWVFRjRlbFF3YkRJeGMzWjNNMDUxVjAxdGFHYxAB",
            "text": "It's nice to still have a little piece of old italian food. The Service could have been better. The food was ok. The fish wasn't that great. Might give it another chance"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nelVGWTFjVU5tVG5KMVdFdHhSbEZ5TmxjNFJtYxAB",
            "text": "I have been to Park Side several times now. Each time is additional confirmation that it is one of the best Italian restaurants I've been to.\n\nJust went today for my mom's birthday. She and my dad drove down from upstate so we had occasion to try the valet parking. What an iconic, classy, old-school touch. You leave your car with the attendant and are right next to the entrance.\n\nWe go inside and are seated within a minute, only because the lovely maitre d' was seating a party ahead of us.\n\nOur server, Jonathan, is an absolute gem of a fellow. Was attentive, kind, funny, always ready to help us, answered all our questions, and made the experience even better.\n\nEverything we ordered, and things we didn't was amazing, from our stuffed artichoke and Caesar salads to start and the complimentary bread basket, to the chicken parm, lobster risotto, and seafood fra diavlo pasta.\n\nDeserts on the other hand? Absolutely to die for. Pistachio tartufo, raspberry tarts, and tiramisu.\n\nCall to make a reservation! This place is worth it!\n\nAnd after dinner? The check was 2/3 what we expected for all ordered, making this place a great value on top of everything else! Then, we find out the valet is complimentary!!!\n\nYou can't do better than Park Side for old-school (in the *best* way), classy, New York Italian dining.\n\nEverybody come try it once, and I hope your experience is as amazing as ours have been!"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcmVLdnBnRRAB",
            "text": "우연히 들어간 식당인데, 음식이 생각보다 맛있네요~ 손님이 많아서 매우 분주합니다. 발레 파킹도 좋았구요~"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcmV5TmZ3EAE",
            "text": "음식이 맛있고, 친절합니다."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQRHM3X2ppei1ISThBRRAB",
            "text": "The service was a bit slow at first, but once we placed our orders, we were treated like kings and queens. The food was all top-notch. We had the Tbone steak, Carbonara, seafood fra diavolo, Mussels with a killer marina sauce, baked clams that were gone as soon as they put them on the table. Crispy Calamari, and you absolutely have to try the broccoli rabe. We had a blast with a family of 4 ordering everything a la carte."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdXVlV05nEAE",
            "text": "I recently had the pleasure of dining here and I am happy to say that it exceeded all my expectations. From the moment I walked in, the ambiance set a welcoming tone—charming, yet contemporary, with soft lighting and a warm, inviting atmosphere. The staff was incredibly friendly and attentive without being overbearing, making the entire dining experience feel personalized and comfortable.\n\nAs for the food, it was nothing short of spectacular. I started with the penne vodka, a perfect balance of flavors that was both refreshing and indulgent. For the main course, I had the chicken scarp, which was beautifully presented and cooked to perfection. The flavors were bold yet harmonious, and the portion size was just right. The attention to detail in every dish truly stood out.\n\nTo finish, I tried the desserts, which were a delightful end to the meal—light, yet satisfying. The wine selection was also impressive, offering a wide range of pairings that complemented the meal perfectly.\n\nOverall, Park Side provides a top-tier dining experience that combines excellent food, great service, and a relaxing atmosphere. I’ll definitely be returning and highly recommend it to anyone looking for a memorable meal out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rM01GZFBWVTVhYUhZNWVqWnpUWGR5U21oNVJHYxAB",
            "text": "Good Italian food and service.  On the expensive side,  especially for lunch.  The bathroom was very nice and clean."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQMXBYRk5nEAE",
            "text": "Had a delicious Sunday dinner here!! Very nostalgic ambiance, but it’s my favorite kind. I had the swordfish and it was cooked perfectly! very happy with the calamari and crab cake appetizers as well. the service was okay. we felt a little neglected in a corner of the restaurant but we still managed to get everything we needed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMl9fUWtnRRAB",
            "text": "Very impressed with the food. Most impressed by the steak (recommend medium cooked). One of the best. Pastas and scallop were all delicious as well. Appetizer also very good, particularly the large shrimps and small clams. But not a fan of…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudmJUQlp3EAE",
            "text": "I haven’t been here in years.  Their crab cake is toothsome😋!  Fresh, lumps, sweet.\nMy guest enjoyed her Seafood Combo.\nAttentive service and nice ambience with the greenery along the windows.\n\nThey serve you a variety of complimentary bread that they wrap for you to go and biscotti.\n\nIf you would like to have dinner here, make a reservation weeks in advance or they’ll tell you they have tables available at 4:30 or 8:30 p.m.  But if you aim to have lunch, they’ll likely have a table at the time you want."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvZ2NXRU9BEAE",
            "text": "Food, service, and value are on amazing! 🍝🇮🇹\n\nThey need some Frank Sinatra playing — it’s awkwardly quiet\n\nSpecify a seat when you make a res otherwise you may be placed at the end of the glass covered porch"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidS1ENEJnEAE",
            "text": "My son and I went on a Monday night and it was PACKED! The host/ manager was friendly and helpful. Sat us within 10/15 minutes.\nThe service was great. We sat out in the terrace area. The space was beautiful. The food didn’t take very long and my son and I enjoyed everything. His steak was perfectly cooked and my pasta was delicious. Very fresh. It’s got to be made in house."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdWFyTU9REAE",
            "text": "Old time, classic Italian spot in Queens that serves your classic Italian dishes - pastas, veal, seafood, and more. Starting off with the unlimited bread bowl, diverse and fresh. We got the rigatoni mattriciana, the carbonara, chicken parmigiana, and lobster risotto. All of the dishes were a hefty portion and incredibly filling. Servers were incredibly kind, service was fast, and food tasted fresh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cElicjFBRRAB",
            "text": "This Italian restaurant is in Corona and it makes you feel you are not in Queens or Corona but in Italy. Ambiance is beautiful and the food is delicious. I enjoyed it so much. The service was so nice and they gifted me a free cappuccino. I highly recommend it. I will be going again ♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxbWJHMmxBRRAB",
            "text": "To be honest, it is a really lovely place to go on a date or small party with friends or family. I ordered seafood combos and it was tasty. Their crab cake is on the point! If you like seafood, you gotta try it. Actually, all their food is good. I like their Stuffed Mushrooms as well. What else I wanna say is because it is a good restaurant, you might need to make a reservation few days before you go."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJLVRxZmI4NHFtVXBRRRAB",
            "text": "So happy to come back here. I called the week before to make a reservation.\n\nThey had valet parking which made it easy as  I wasn’t sure what they would have available since on my first visit we took an Uber.\n\nWe were seated right away.  The amount of food they give you right when you sit down is amazing, a massive basket of different kinds of bread and a cheese and meat plate.\n\nWe only ordered two appetizers, mozzarella and prosciutto & stuffed mushrooms. Since last time we got so full on all the appetizers.\n\nWe were a party of 5 and everyone tried some different for our main course.  Everything looked delicious.  I ordered the Shrimp Scampi and it was very good!!\n\nEveryone truly enjoyed themselves. It was great they had gluten free pasta as well for one of my colleagues.\n\nWill definitely come again next time we are in town."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbS15WXJXcE1mZnp3RRAB",
            "text": "Amazing, this place is awesome. I went there with my girlfriend on our first date 9 years ago and went back recently to celebrate my bday, and wow, just super delicious!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOXFudkpnEAE",
            "text": "We went here for our anniversary for the first time and we loved it! Excellent food, topnotch service and great atmosphere. The restaurant is elegant and clean. Loves the service and attention from all the employees. The food, drinks, and desserts were amazing! I am happy to have found this restaurant. Will continue visiting and bringing family and friends."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5N0tpaFJ3EAE",
            "text": "A must visit italian spot in nyc. Their pasta was cooked perfectly, their chicken parm was spot on and their complimentary bread basket was just amazing.\nService was impeccable, always there when you need it and very accommodating.\nAmbiance was very really comforting with good views."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibnVtNVBBEAE",
            "text": "**Park Side Restaurant, Corona, Queens**\n\nI recently visited Park Side Restaurant in Corona, Queens, and had an enjoyable dining experience. The Italian cuisine served was delicious, and the service was excellent. The staff was attentive and courteous, ensuring a pleasant meal.\n\nHowever, I was puzzled by one detail: the cheese provided for my pasta was different from that given to other diners. Despite this minor confusion, the overall experience was highly satisfying, and I would recommend Park Side Restaurant to anyone looking for a great Italian meal in Queens."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMXVLb3VBRRAB",
            "text": "First time coming here and I’ll will be back ! Let me start off saying the service is amazing. My server is name Jonathan and he made the whole experience wonderful. He recommended some great dishes. I had baked clams for appetizer. Perfectly seasoned. For my entree I had shrimp scampi. It was delicious. Heads up they give you your moneys worth for the portion size. The drinks were delicious and they’re definitely not cheap with the liquor! Overall experience was excellent ! Must try spot !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dEtMeXpRRRAB",
            "text": "Called in an order of spaghetti and meatballs and was told  it would be  ready in 40 min. I got to the restaurant 50 min later and was walked to the kitchen area only learn they didn’t even put in the order.  So 40 min turned to just over an hour.\nI regret not opening the container right away. I paid just over $26 for spaghetti and 2 meatballs.\n2 regular meatballs about 2” diameter which were not bad but far from great\n\nI prefer pasta to cook about 2 min after it’s al dente but this was somewhat mushy and sauce needed seasoning.\n\nThe place is nice and clean"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNac3ZYNzVnRRAB",
            "text": "There's a reason this is so long established Italian restaurant. The food is great, service is excellent, you are not rushed... Who could ask for more?  Pleasant and knowledgeable staff."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc05hb2p3RRAB",
            "text": "Came here for a birthday party and can’t say enough about how pleasant the experience was.  Gave us time and space for our group and the food and service is top notch.  Thank you for everything."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcnFqUVhBEAE",
            "text": "Queens is a perfect setting for this classic, huge, Corona Italian restaurant.  It is fun, noisy, and a bit old school, which adds to its old world charm.  I loved that before we even ordered, we were served a large bread basket with a unique assortment of breads and breadsticks.  All of the traditional Italian favorites are served here.  I had the Veal Francese which was a tasty, sizable portion.  I started with the Tortellini in Broth soup which was also delicious without skimping on the tortellini.  For dessert, I shared a Chocolate Mousse Cheesecake which was fresh, creamy, and scrumptious.  Service was friendly  and attentive throughout the meal.  Valet parking was friendly and efficient.  If you love classic Italian at reasonable prices, then this is a must place to visit. 🍽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMXZucWNBEAE",
            "text": "What a fun experience.\n\nLove to have found this place as spent one night in Flushing after the Mets' game.\n\nTrue Maitre D' at the front.\n\nGreeted with solid bread basket, meats, and Parmigiana cheese to nosh.\n\nClams and stuffed Artichoke to start, veal pizziola and pasta for dinner.\n\nNothing amazing, nothing terrible. All about the experience here.\n\nWell-rounded and valued wine list, too.\n\nCan hang out in the park after dinner and watch people playing bocci.\n\nThanks for the great time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwd1J6WndTbmRvV1d0cVVsZFJVazlwYTFKT1VsRRAB",
            "text": "Amazing service with great food. Will be back"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbF8zTERREAE",
            "text": "From the bread basket to the appetizer to my main meal all I can say delicious!!!! I came all the way from Florida to Corona and will be back. First class service and food, Thank you and see you soon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMWFpSk1nEAE",
            "text": "Definitely must call ahead for reservation because this restaurant is so popular and gets very busy.\n\nFood and service is unmatched and lower prices than other Italian restaurants nearby.\n\nDecor is a bit dated I’m willing to overlook due to their delicious menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdDdMNFRBEAE",
            "text": "HOLY $HIT!\n\nI don’t like going out to eat Italian Food since I grew up in an Italian Household and worked at pizzeria restaurant from 14yrs old to 24.\n\nMy Father was adamant on going here so we Made the Pilgrimage from Long Island.\n\nMy god it was worth the trip!  Nothing like it here on the island!\n\nMy father got a clam dish that was PACKED with Flavor and generous portion!\n\nI was absolutely blown away with their bread bowl!  The variety was something I have never seen and it even had prosciutto bread in it!\n\nI don’t like brown sauce but waiter strongly suggested their Chicken and Veal Dish.  IT WAS TO DIE FOR!  Something I have never experienced.  Mouth is watering as I’m writing this!  We will be back!  We passed on dessert bc we want to ICE KING!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLVEgwYWJJbW95bkRBEAE",
            "text": "I have been going here with my family for years. Always a great time. The food is always great and they have the odd ability to make you feel pampered in the middle of a restaurant filled to capacity. The dining room is comfortable and you never feel rushed. They can always fit you in, but do yourself a favor and call ahead to avoid waiting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbXBXQ093EAE",
            "text": "I’ve walked past this place everyday for more than a decade and I never went in because I always thought it was too expensive; up until a few days ago that I went to have dinner for the first time and it wasn’t as expensive as I thought! The food was bomb, calamari was stupendous and the chicken great. Service is on point and the ambiance is also nice.\nMy total bill for dinner for 2 was around $100 and totally worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OF96NXZ3RRAB",
            "text": "Authentic, not fussy, delicious food, excellent service. This was my first time so I was a bit skeptical, but it was an excellent experience. Great service, generous pour from the bar, delicious food . Even the pasta side dish was among the best pasta I have ever had - chewy and yummy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MXJDaHRRRRAB",
            "text": "I've been twice for lunch thus far, and I must say this place is really good, food wise, service etc. The first time I went with my daughter after church, she's 2 and it was around 3-4pm. I didn't know you needed a reservation, and unfortunately there was no seats available. I was offered the bar area, which I was not happy about as I have a 2 yr old, and I had chosen this location  bc I saw how pretty the dining area appeared, but she was hungry and wanted pasta and I had already valet my car. I took the table and to my surprise it was perfect, away from the bustling customers and peaceful. The energy was good there, minus one individual I won't mention...the owner was a sweetheart and checked in on me and Gracie. It was sweet. I ordered the breaded porkchop and mashed  it was a great portion and tasted amazing.\nThe 2nd time I returned, this past Monday, while my daughter was in class, and once again the food did not disappoint. It was as crowded, and the owner sat me in the perfect little corner in the dining room m, I may have to request it from now on actually, I loved it that much. Overall, it was a great experience. I think this will be my locale lunch spot for Italian faire. The environment and customers are classy, the food is great and the owner definitely cares. Will return!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBX09uOTRnRRAB",
            "text": "An Italian staple in Corona Queens\nBis old school setting, with valet parking for your convenience\nFood is delicious, all the American/Italian classics\nService is old school good"
        }
    ],
    "reviews_count": 80
}