{
    "name": "White Castle",
    "place_id": "ChIJ4wMNnVpewokRkjSNm49bc3g",
    "grid": "QN4",
    "address": "89-03 57th Ave, Elmhurst, NY 11373, USA",
    "rating": 4.1,
    "user_ratings_total": 2218,
    "phone_number": "(718) 426-0618",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMU5FMXZOVGN0VVZGYVNHTktUMHhVWlZGUVZuYxAB",
            "text": "For a White Castle, 👌"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMFJqVmFUelZEUldOck1IUmlXRjlVZFRreFMzYxAB",
            "text": "Murder Bergers always hit the spot.\nThen the next day comes"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeE1HZFNkVEZpYkdGVlJsUk5VMmN5TkROSFpVRRAB",
            "text": "They don't consider delivery people as human beings."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Wk56Vm5VakIzZGtOWU9UbEhNMnBxY1cxcE1YYxAB",
            "text": "Absolutely horrible! The tables were filthy &sticky. The buns were stale and hard. Place looks and smells like a subway. Needless to say, I wont be returning. The manager/worker, is clueless."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSGRHczBibEZFVlZsVFdFOTBNMEpmV1ZWMU9YYxAB",
            "text": "Great customer service our food was fresh and hot parking was easy besides the small dining area my score would be perfect."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRGRuazBXa3hKTVZkMFRGQTBPVWhJTVRob1VYYxAB",
            "text": "If I could put negative 0 I would. OMG!! My boyfriend and I came here for a quick snack at 8:30pm. We ordered our food and proceeded to wait 15 minutes for it to come!! My boyfriend went up to the counter after about 5 minutes to ask where the food was and how much longer it was going to take. The girl behind the counter turned her back and proceeded to ignore him while making french fries instead of getting orders together. I heard the manager say people at the drive thru were also waiting at least 11 minutes for their food. We only ordered a #13 meal and 3 egg & cheese sliders. I don’t expect perfection at White Castle but waiting over 15 minutes for our small order is disgraceful! I tried to talk to the manager and she dismissed me.. Do not come to this location!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVVNFcEVTbUZ0V25CYVZ6azJjRnA1VTNSUlVuYxAB",
            "text": "I am extremely disrespected by my recent experience at this White Castle location. I’ve been coming here for years and have never had an issue getting marinara sauce—until now.\n\nThis morning, I asked for marinara sauce and was told by the employee that I could only get one if I purchased mozzarella sticks. I offered to pay for the sauce by itself, but was told there was no way to do that. The employee then called over the manager, who simply repeated the same thing — that I could only get sauce by buying mozzarella sticks. This felt unnecessarily rigid and disrespectful.\n\nIf that’s the policy, there absolutely needs to be a way to purchase a sauce on its own at the register. A simple button or option in the system would solve this issue and prevent frustrating situations like this.\n\nAll I wanted was the sauce — so much so that I went ahead and purchased the mozzarella sticks just to get it. But after how I was treated, I walked away with only the sauce and left the food behind. Maybe the employee can enjoy the mozzarella sticks — hopefully with sauce.\n\nThis experience was unprofessional and unnecessarily unpleasant, especially so early in the morning. Please address this policy and ensure that paying customers aren’t treated with such disregard over something as small — and easily fixable — as a side of sauce."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MlFYWjJiMjlqVWtWTWIyRlJMWGt6VmtsTGNFRRAB",
            "text": "Drinks were well balanced."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUlQwUmFiM1l5UzB4a2VWY3RZakZ6WVhkbFZHYxAB",
            "text": "The live music on weekends adds a fun touch to the dining experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKd2NGTllRV04wZGtsTWVYUkxNRTFzT1hSUFNIYxAB",
            "text": "Me and my child visited this white castle establishment for the first time on 9/24/25 around 8-9pm. I ordered 1 cheese slider and 3 pc mozzarella sticks with orange juice for my child. However only 1-2hrs later my child ended up throwing it all up, in what seems to be ( by the smell and color and  look of it ) was the white castle burger. How sad I grew up with this, and wanted my child to experience the white castle burgers right from the restaurant only for him to get sick and throw up! Something is NOT right with that. The kitchen/staff needs to do a better job. This was possibly due to cross contamination and poor food hygiene and poor food handling skills. Or maybe just bad/spoiled burgers! Either way we won’t be coming back. The tables were also all filthy. No one is seen cleaning them. Food, liquid, on every table.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twU1MxQlRVRzFNZGxWNk1reFhhMUJXWlhsSFRYYxAB",
            "text": "It's white castle nothing else to say"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5SlRFRlJNRUZNUjJkUWRVaGFNMlJyU0VKNlNuYxAB",
            "text": "Hit and tasty"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeVEzaEdkWFl6V1ZWTlUyWnRUamxNWkV0MFVtYxAB",
            "text": "The restaurant was easy to locate."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeWFsbHZRV0pJWDNSb1ptaHJRMTkyWkROeGJWRRAB",
            "text": "App deals are great. The place is clean. The service is fast."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210amQyTjJTVmN3WlZoNVltSmFjRU56YlZCT05IYxAB",
            "text": "We ordered in, and Now I know why Harold and Kumar went to white Castle. Melt in your mouth hamburgers.. Must have if you come to New York.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONmJHVjJiWFZhYkhKME1XcHVTVWhyVlRaTVRYYxAB",
            "text": "Food always pipping hot and fresh as far as you describe fast food as fresh, lol. Service pretty decent. Line never lingers here, moves at good pace. But the microphone was full of static so difficult to understand unless cashier really enunciate each word dramatically lol. I do find white castles very expensive overall. Especially when you order items not in a bundled combo because you don't like the bundled options."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeVFVSldkWEk1Y3pWNFYwdExWV3A2TUdkMlJXYxAB",
            "text": "Love the remodeling, everything looks cleaner"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kZmVWcFRibUpuUzFSVFduRkRlR2xEWVZKSE4wRRAB",
            "text": "Great guy who served us our work truck didn't fit the drive way so he let us walk around and ordered at 2am aswell"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVFgwRTFWMUpPVlhoRGJHWTJjVkZzTTNKU0xWRRAB",
            "text": "The food omis great the price is great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSFExZzBNaTB0TVY4M2NYZFViMmh2YzFsblJWRRAB",
            "text": "Clean! Easy parking. Sadly a little slow but who cares. Where are we all rushing to. Staff was very friendly and had on clean uniforms and was very presentable. It does make a difference. If they’re willing to put in the work to look at that comfortable, that clean, that professional, I feel safe around the food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVGJGOUJUV1JoVm5wQlpEUkNTMmhoZERKU01sRRAB",
            "text": "Tasty!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeE4yUnFOM05VVjNOeVZFYzVlbUpvTkVOWlZGRRAB",
            "text": "Went there for the first time to grab a coffee , was not expecting the amazing service ! Will be back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsM05HNUJRVjlWTFVneVR6aHNZbXR5VlRObGFXYxAB",
            "text": "My mom and I have been to this place and that once get got there, my mom told me to found a seat then and then both of us sat down and talked about what to have there. Then I told my mom that I wanted 2 cheeseburgers, and she bought another 2 for her and then my mom bought two cheeseburgers for me 2 for her. The food was wonderful, and the service was wonderful. The atmosphere was there were people there and many others."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaFQzTnpTMlZoU0hWNWRsOURhWEp3TjJGMU1HYxAB",
            "text": "Good food ,  quick courteous\nService."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNWRFb3hMVmh4Y0hSM09EaFJNSEpCVWtvd2EyYxAB",
            "text": "2 small orders of Onion Rings and small soda. Good taste but small in size.\nRefills allowed. Nice.\n12 bucks for a soda and 2 sides ? Hmmmmm\nThey give you a $5 full meal next visit coupon with your order.\nThat would have been nice to offer before I placed my $12 order.\nSad that you need a coupon to get a cheap meal for a fair price.\nAt least....\nParking is Fantastic and\nBathrooms  are clean."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobjQ2bkNBEAE",
            "text": "The place was very clean, including the bathroom. The servers were very polite and quick on the orders."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV1dWZGpSbGxvYVUxb1dVUk5iM0JwV1hwU09XYxAB",
            "text": "Went a little crazy & spent 45. On fast food but we had a feast. It was GREAT !!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kc2NUUXlWRGM0ZW5BeFVEWklaR1prT0c1SFJuYxAB",
            "text": "The whole vibe of the place was off-putting from when I walked in to when I left. The woman working by the stove was yelling at one of her coworkers and her coworker seemed like he didn't care and tossed me my food which I found so rude and strange. And when I got home they gave me the wrong sliders. I ordered original and emphasized it twice to the woman and the they gave me fish. Honestly would not go back again and hope that do better for other people's sake 😡😡😡"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOeGVsZHBUa05OWlZkcE5WWklRVmxaVGpOZk1HYxAB",
            "text": "Great Customer service. Employee went above and beyond to help me out with an order. Wish I remembered her name, but thank you so much."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMVMyZFBZWGxQZEZadGJqQk5ZME56Vm1KcUxYYxAB",
            "text": "The food was fresh and hot."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNmFUSmlaRzlXZEVkNWJXZElWbGxhTUZGT1NXYxAB",
            "text": "Tuve una muy mala experiencia en este lugar. El personal fue grosero y poco atento desde el inicio. Además, el lugar estaba sucio, con mesas y pisos descuidados, lo que me pareció muy desagradable. No lo recomiendo, ojalá mejoren tanto el trato al cliente como la limpieza del establecimiento."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR1RGVnZlVGQyU21kbU9IQmFNVUZCT1hwMmFuYxAB",
            "text": "Super slow service. Seems they have one person doing everything. And slow even at 2pm in the afternoon."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbWdnZUdZdHJLYUZ3EAE",
            "text": "Fast. Tastes like what you expect it to be. Friendly staff. No complaints. Lots of parking to eat if you want. I got the chicken and waffles. Make sure you get syrup on the side. Best snack."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJWGd4YlBpbnVLdXJnRRAB",
            "text": "Terrific White Castle restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKMmZ6NmZUNDdHWldREAE",
            "text": "Been a while, but it hit the spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbkFvTmpqMVBXYnFBRRAB",
            "text": "Excellent service, amazing facility and great food👍👍👍😊"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKbTIwWXZza2FYS093EAE",
            "text": "Awful,never again, the service(was ok I guess good poeple)still awful"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZUx0ZTdiai1HVkRBEAE",
            "text": "Friendly staff and restaurant is clean"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoaWJiaFpnEAE",
            "text": "12 pc cheddar chicken rings didn't like the taste of powdered cheddar. Chicken good. Service good. Nice American restaurant."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN2V6OFlnEAE",
            "text": "I've always passed by this White Castle since I was a kid and even driving past it but never ate her. Today was the day. All the food was fresh, employees were much more nice than the one close to my home, and it was quiet. I enjoyed my food in such a great atmosphere only Queens fast food restaurants only have unlike Brooklyn. Lol thank you. I'll be sure to come back soon. 😁"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMWN5X3BBRRAB",
            "text": "The famed little square burgers are delicious! Buy them by the bagfull."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbHBmbndnRRAB",
            "text": "No fault of the staff who were pleasant and efficient, just white castle burgers, it turns out, are a major disappointment"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva1pQRlp3EAE",
            "text": "Unhealthy ingredients. Meat with artificial chemical ingredients and ketchup."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOW8yci13RRAB",
            "text": "The torta with the headset was really rude and disrespectful.  She did not serve me at register, I stood there for a while and decided to order from the app instead. She talked over me as a customer when I asked about my food. She was withholding my order, didn't let me know it was ready."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMXJybnB3RRAB",
            "text": "Cashier was rude.  I have not been to white castle in 10 years.  I was sooo excited to have a cheese burger.  The  cheese burger was good.  The chicken rings were bad. The fries were badd.  The cashier was horrible."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdjktWF93RRAB",
            "text": "Satisfaction after eating these burgers.\nIt's hard to drive by without stopping."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRaTczZUt3EAE",
            "text": "메시 백화점 쇼핑 후 치즈버거를 오더한 후 콜택시를 기다리기 편리하다."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdEktNUFnEAE",
            "text": "You know what you’re stepping into when you visit this location at midnight on a weekend. The cheap sliders, the quick turnaround, people sleeping in the booths. White Castle has consistently provided a quick bite at such a low price point I can’t even complain about the food. Whether or not you’ll get asked for spare change is another story but the sliders were hot and good (for what they are) and the fries were well done (asked for them to be crispier).\n\n🍔 Sliders: Each slider was the size of the palm pf my hand and had a slice of pickle, a thin patty, a layer of ketchup and a good ol’ slice of cheese. It’s a good balance of flavor and leaves you craving the next slider. I like to add fries into my sliders for just a bit more texture\n\n🍟 Fries: Crinkle cut fries that weren’t too salty and crisped up"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMnRybFB3EAE",
            "text": "So hopefully this was an off night but after this experience, I would advise you to check your bag thoroughly before you drive away ... I purchased through the drive through so I can take accountability for not checking the bag prior to driving off so when I got home I realized that they did not provide any condiments... none! Not one! Not 1 ketchup not 1 salt packet not 1 honey mustard nothing! And just so you know I ordered- several orders of fries, chicken rings, fish nibblers, among other things like the burgers 😞  they were super dry themselves and looked sloppily made/arranged. Even the chicken rings looked deformed and strange. It was such a disappointment."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOGNYWVdBEAE",
            "text": "Working from home today with the baby and couldn't get to White Castle, but the crave continued to grow stronger and stronger so I grub hubbed lunch from White Castle praying the offer wouldn't be messed up and boy upon delivery and boy oh boy was I pleasantly surprised. So this Review is for EVERYONE who thinks about offering white castle from this location when they can't get to it and is on the fence, you will not be disappointed, they put great measures in place to get you your food quick, warm, and order to specification. Lunch today included 4 cheese sliders, medium fries, (2) 1921 american cheese sliders, fish slider with cheese and a large coke. My order (drink included)  came SEALED in a trademark white castle delivery bag to assure me that my food was not tampered with after it left the Castle (appreciate that). After removing all my items from the bag I was pleased to see that the food was still WARM, the fries were still somewhat crispy (given the fact they were sealed), complete with napkins ketchup and tarter sauce I didn't even ask for. The fish with cheese was exceptionally flaky and delicious (see photo). The food tasted as fresh as if I just left the drive thru. This was a nice treat on a remote work day I must say,  I cannot speak for all Castles for delivery however for 57th street in Queens,  they got you. Have a look for yourself."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdTU2dzhBRRAB",
            "text": "This white castle is among one of the oldest of the New York franchise but you will not be able to tell by the modern extremely clean dining room floors and tables courteous staff delicious fresh food and a great vibe inside open twenty four hours with a drive thru in a great neighborhood feet away from queens center mall if your ever In the mood for one of these delicious sliders this is the castle you want to visit"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNnYyMUpnEAE",
            "text": "The staff was so kind and I really enjoyed my time eating there. The dining room was spotless. I wish the best for the amazing workers on 9/18/2024"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bExQTGF3EAE",
            "text": "I e been coming here for years and my burgers are always fresh,  the staff are personable. They need t update the dinning area and it can use a good cleaning. I don’t sit to eat, however waiting for your food in clean environment is always appreciated."
        },
        {
            "date": "5년 전",
            "language": "ja",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNNnVYMGF3EAE",
            "text": "ハンバーグがすごく可愛いサイズでちょっと笑えました😂\n食べやすくてアジア人にはちょうどよいかと思います。\nポテトは揚げたてのようにサクサクホクホクでした。\nハンバーガーの味は至って普通です。\n\n飲み物はセルフで飲み放題とのことです\n\nWiFiあります\nカード使えます"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbFBQX2pRRRAB",
            "text": "This is a classic, straightforward White Castle joint. The dining area is clean, moderately spacious, but bland. Customer service is friendly but slow. The food is everything you expect from a White Castle. They even have the fancy,…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBeTVXb3lRRRAB",
            "text": "I came here for the impossible slider to see if it actually tasted like a white castle burger. The results are yes and no. No it did not taste like a white castle burger however, it did taste like a burger just not a white castle one. (See…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycXN2RVBREAE",
            "text": "I think I'm giving this a blazing review because I haven't had it for a while and they had some new stuff. The fish nuggets and the shrimp was good the loaded fries not for me I shouldn't of been being so greedy I should of got onion rings or plain fries and that little bacon cheeseburger was bussin. I will definitely go again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzc2IydVlREAE",
            "text": "If loving them is wrong I don't  want to be right.\nI was shocked that white castle is listed as number one for the healthiest meat in all fast foods. Don't believe me look it up. The reason is its 100% ground beef no fillers and is never frozen as the keep it at 35°. True you pay later for eating them but no one can say it's not worth it.\nThis white castle very clean super fast service."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZOXZybnhRRRAB",
            "text": "Love White castles burgers with everything. Fries are good and they make the best shakes. Place kept clean and staff friendly."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2bGQ2S0pBEAE",
            "text": "Would give zero stars if possible!!\n\nWaited just under 20 minutes in the drive-thru to get to the order box, waited 2 minutes there until somebody said we'll be right with you. Now at this point I had wanted to leave the drive-thru lane however there was traffic behind me, in front of me and next to me was some sort of White Castle maintenance truck.\n\nAfter 25 minutes they're ready to take my order, I pull up around the corner instead of ordering thinking I could just drive out and leave only to find I'm blocked in! Car in front of me needs another 4 minutes before they get there food. I pull up finally after half an hour to the window and ask for the manager, basically she laughs at me and tells me I only waited 2 minutes and what is my problem? I said I waited 20 minutes and nobody even came to take my order and now I'm stuck here I can't drive out of the lane, she points to the truck and says this is an important truck that's doing work for White Castle, I said okay but waiting 25 minutes to just order fast food is not realistic. The cashier laughed while the manager told me I was lying, interesting how these were not teenagers rather they were full grown women easily in their 40s.\n\nOf course this review will mean nothing, there will always be demand for White Castle because the burgers taste pretty good, and neither franchisor or franchisee will do anything to improve their service levels. I recommend finding any other fast food quick service restaurant in the area other than this particular location."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvMElTN3B3RRAB",
            "text": "Excellent fast food restaurant. Very clean surprisingly for a super busy area. Staff are okay seemed a bit flustered/overwhelmed with all the customers in the place. The food was exceptionally fresh though!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURia3ZuSXNBRRAB",
            "text": "Дружелюбные работники очень чистое заведение все прекрасно просто супер  можно заказать онлайн и оплатить внутри"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzc2J5RWFnEAE",
            "text": "I placed a large order late at night, and it came out fast and fresh—possibly the freshest White Castle burgers I’ve ever had. It wasn’t just the burgers, either; the entire order was incredibly fresh, from the fries to the chicken rings and mozzarella sticks."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwa0k3QjdnRRAB",
            "text": "I walked in and they took forever to attend to me. 4 people: 2 guys making sandwiches, 1 on drive thru and a lady cleaning around 11pm. Nobody even acknowledged/greeted me to let me know they'll be right with me for what seemed like 5 mins until the lady cleaning came and asked if I'd been helped already as if someone else was responsible for the register. I ordered and the pic below was what I saw when going to get soda. Nasty to operate because it was sticky..not coming back here unless it improves. Seems really dirty and customer service was sub par. Gave 2 stars because food was good and thankfully I didn't get sick. Also gave the benefit of doubt that it was that one day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaFpMdVBnEAE",
            "text": "The burgers are finished very quickly and look very old"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbGZEd0JBEAE",
            "text": "Big fan of white castles. First, the bread was hard, and we all know them things be a little soft. Then I had a bad stomach for a few days. I would never visit that location ever ever!!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabzVYY1pnEAE",
            "text": "It was clean, the employees were super nice, and the food was better than the other white castles i've been to. I'm coming back for sure. They have a bathroom you have to be buzzed into but i didn't use it.\n\nedit: It''s been a long time and I've gone here at least twice a month for ages now. This place is consistent. Excellent food, excellent service, all around fantastic. I've gone through much of the menu. They are doing it right over at this one. Food's always fresh. I can't imagine how they pull that off. I'm always there in the morning, must be the morning staff is just great people."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZOUktQ2JBEAE",
            "text": "Inspired from the movie 'Kumar going to White Castle', but the reality is another story. Bun is soggy and the patty... bleh. The impossible burger patty was pretty good."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdHFiU0pnEAE",
            "text": "Childhood burger spot always amazing the crave is true"
        }
    ],
    "reviews_count": 69
}