{
    "name": "Olive Garden Italian Restaurant",
    "place_id": "ChIJj2g00UtewokRXsamx9jw04g",
    "grid": "QN4",
    "address": "92-10 59th Ave, Elmhurst, NY 11373, USA",
    "rating": 4.1,
    "user_ratings_total": 4734,
    "phone_number": "(718) 458-0549",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5a1dWTTNjbk5tVG1WMFpWWkNiMTlNVm5wNFgxRRAB",
            "text": "Wonderful restaurant , my first experience  at this restaurant. The breadsticks were ushered out quickly and were delicious. The fried mozzarella was phenomenal with Parmesan cheese on top. The mozzarella on its own was good however the flavor is multiplied by the marinara sauce that was provided with the side. Shortly after, the chicken Parmesan came. It was served with a side of spaghetti with marinara sauce. The chicken Parmesan was phenomenal and delicious with the side. The service was amazing and the server was very attentive.  I definitely would visit again . My partner had a side salad and a fettuccine Alfredo with crispy chicken. They said that the food tasted good and they wrapped it up to eat later. I would go again and this may be my go to every month or so."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMk1saDNhbVJzV1dOcmIwMXhabWRuZUUxQldIYxAB",
            "text": "Me and my friends came here last night and our server was Julie with blue hair💙she was so sweet and always made sure to come check on us if we needed anything else , also too I preferred the chicken tortellini Alfredo and it was sooooo yummy ! Def will be back and thank you again to Julie she was amazing and made our dine in experience great"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MlRWZEVablZrVjNjM1ozVnVSV3BtWlMxT1RGRRAB",
            "text": "My father and I had a lunch at Olive Garden 92-10 59th avenue .\nUsually I like the food and always finishes my plate .\nI ordered rigatoni with mushroom creamy sauce and my dad same things with shrimp .\n\nAt first I was thinking I’m full which I was very hungry then I stop eating so I took the rest home on the other hand my father ate his plate . On my way home I start feeling stomach ache feels like I need to throw up 🤮 I rash home I had some medication it took me the entire night til I started feeling little better . My father since he ate his entire plate he had a bad stomach ache  nonstop diarrhea  and lots of discomfort.\nI’m 💯 sure something with the food both of us got sick . All I can say I’m very disappointed I will never eat at Olive Garden ever again not my family or my friends.note ( the left over I throw it on the garbage of course ) . I’m speechless and feel bad my dad had to go through this."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCS1NreEtSRTgyUjJRNFNqSlZNQzFKZWtReGFVRRAB",
            "text": "Amazing!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQ2NYbzRSMDEwT1ROdlZVNVNkMGczT0U5aE5XYxAB",
            "text": "I'm going to leave a comment so that next time the workers take into account the way they serve the person... Mommy went to buy a kids meal with spaghetti and a mate ball, the girl named SHERRY was very rude to my mom... and also my mom asked for 3 extra meat balls because my daughter loves mate balls and she told my mom that that is charged separately and she didn't want to add it to the bill in the end they only gave her one meat ball when my mom asked for 3 meat balls... so very bad service from the girl... SHERRY"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paYVRYWjZkbTlwYmxoek0xcG1ZMXBUZUdNeGIwRRAB",
            "text": "Absolutely love coming here with my husband. The food is great and the servers are kind and helpful!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUFNXdE1SVk00VFZkRFVGVmZkVTVoZEc5NlFYYxAB",
            "text": "I rarely leave negative reviews, but my recent experience during dinner was disappointing enough to say something. The service was slow and inattentive from the moment we arrived. We waited far too long to be greeted, and even longer to receive our food, which came out cold and underwhelming.\nStaff Michelle latín server seemed disorganized and uninterested in addressing concerns. We had to ask multiple times for basic things like water refills, utensils, and condiments. For a place that advertises a pleasant breakfast experience, the lack of hospitality and care really stood out.\nI hope management takes this feedback seriously and works on improving the service. A good breakfast should start the day right-unfortunately,"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdFNYWnJXa1ZXUjFJeWFqQlBWMkZwZFcxWFEyYxAB",
            "text": "Lo mejor en NY"
        },
        {
            "date": "3주 전",
            "language": "pt",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadWFIaFZMVFZOVEY5VldIWmpjSFpTWm1RM1FYYxAB",
            "text": "Comida ok\nUm pouco cara mas um dos empregados de nome Juan foi um idiota em que acha que temos que deixar 40% do valor de gorjeta dado que segundo o mesmo os funcionários não recebem ordenado apenas as gorjetas"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTFJHNUZPV2RHZFhkS1IyWjFObmxWYzFWUVJFRRAB",
            "text": "delicioso y excelente atención"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOM2IyRndWSGhLTkdSR1JsOXZWbVI2T1VsSGJVRRAB",
            "text": "I go to a place that's known for pasta, and that's not what I go there for. I love the meatball appetizer plate. Don't get me wrong. Their pasta is amazing. Always great service and my buddy's go to spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OS1kwdDVNV1I1Y0ZGbmRrRjFVRmRCYVVGVllrRRAB",
            "text": "Food was good I loved their Pasta and meat was juicy.\nThey have unlimited soup and salad as complementary with your main dish and you can choose from different types of soups.\nService was amazing the waitress was so polite and friendly.\nThey take a little much time to get the food.\nWe got seafood and Sirloin pasta they were delicious but the fried calamari was thinly shaved, which meant it was missing that characteristic chewy and over cooked so I didn’t like.\nAnd the place was so hot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oR1lVODRXSGQzYWxGSVRYVndRbnBZTkdkNGJHYxAB",
            "text": "I had a wonderful experience at Olive Garden. The staff named \"Carlos\" was warm and welcoming from the moment I walked in, and the service throughout my visit was attentive without being intrusive. The food was fresh, flavorful, and served hot—especially the pasta and breadsticks, which were absolutely delicious. Overall, it was a great dining experience, and I’ll definitely be coming back again with my kids."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVmR6WnJZV1Y0VVdZd04xZHdOWEZsUjFWWFlXYxAB",
            "text": "Special thank you to Mr. Carlos who serve us with a smile the entire time! :) We keep on coming back for great food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NNU1XRmhTRlJ5U2tkelVGbGFaSG94UmxGUGFFRRAB",
            "text": "Great restaurant. More Gluten Free options will be appreciated."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GYU9XWnlOekJHVUhkTVpVdDFPVE5HYlZKalptYxAB",
            "text": "The angel hair pasta in mushroom sauce and broccoli was AMAZING!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNWVUTjRjM2RPWjFjeFJFcEVaR1JXYldSTGVFRRAB",
            "text": "The atmosphere is perfect for both casual and business meals."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTmVqWmxPV3R5VTBwSFNFVk1hamhpU21sUmVIYxAB",
            "text": "I came by this afternoon and Juliet served us. She was very attentive and made sure my entire dinner experience was excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VVlTMU9SV2R1V2xrNE9IaHplakEzVTNBdGRIYxAB",
            "text": "The food tastes amazing, the portions are large, and they come with salad 🥗  Or soup 🥣. They also serve delicious bread 🥖 with a light garlic butter flavor. The staff is friendly, the place is clean, the bathrooms 🚻 are spotless, and the prices are reasonable. We will definitely be back. Keep up the good work, very good job 👏🏼."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Nk9IRnlSR0ZMZGpCUlNtdHpNWEpMTTNGRmRFRRAB",
            "text": "⭐ 2 out of 5\nThe service was extremely slow. Dishes were brought out one by one with long delays, and even basic things like plates and forks took 15–20 minutes to arrive. The first dish I ordered was only served almost at the end of my visit, after several reminders. Very poor management and kitchen work.\n\nOn the positive side, our server CJ was polite, tactful, and really tried to help. Unfortunately, the food quality was also disappointing — 2 out of 5."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbWJIUk9lRTFhYUhoNmRUWlZZMjFoWldSSWJsRRAB",
            "text": "I love the infinite pasta real with infinite soup"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Rk5YRkxZM0p6TTFvMGMxZ3RZa3hoT0ZSMVprRRAB",
            "text": "Me encanta la atención,  el ambiente y en especial la comida,  cada que tengo la oportunidad los visito"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNFQzcDNiMGd6UnpSS1ZVb3hVbTQwU0hGbFdWRRAB",
            "text": "i have mixed opinions.. tldr: food was WRONG, service was nice.\ni’m a vegetarian and i went for the never ending pasta with my boyfriend.\ni got the 5 cheese marinara (which is listed V for vegetarian) and i got mostly thru eating my bowl to realize there were sporadic pieces of MEAT in my food (the sauce is thick and it wasn’t enough meat to be obvious, like a bolognese would be). i called for my waiter and he had a new bowl sent out (which the ASM delivered to me, and comped me a dessert for the mistake).\nSECOND BOWL COMES, i’m reassured BY THE ASM “the chef has been changed” and there will be NO MEAT in my VEGETARIAN DISH.. guess what? there was meat again. i’ve been vegetarian for SIX+ YEARS so, this did make me very upset.\ni went to the restroom to have a moment, and my bf sent the dish away again, ordering me a plain buttered pasta. now the GM comes out, assures me, again, they “checked the dish” and they “didn’t see any meat” but they would comp my entire meal for the inconvenience.\nthe waiter was kind, ASM and GM were pleasant, but i don’t know, the chefs need to be fired or the kitchen needs to be reevaluated. the fact that it happened ONCE was crazy. but TWICE? unforgivable.\nit wasn’t about having my meal comped or free desert. it was about being a VEGETARIAN OF SIX YEARS and unknowingly eating meat DUE TO A CHEF MESS UP. NOT ONCE, BUT TWICE. can’t help but think what would happen if it was an allergy? or a religious restriction? and for the ASM and GM to both tell me the chefs were changed and the dishes were checked.. and i’m not just talking one little piece of ground meat. i’m talking enough in the sauce that when i was nearly done eating and the sauce had gotten thinner, it became notable.\nVERY disappointing food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaVJERkhURTVyYTBwcVNXOHhORmRXY0hoUGQxRRAB",
            "text": "Food was yummy got the tour of Italy and altered it, service was pretty good and the place wasn’t packed so very peaceful eating experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CblFYUm9Wa2xmTmtObVdXbDFkelpGU2tSTVpHYxAB",
            "text": "Very bad service. Waited 45 minutes for the drinks alone. Seemed like they wanted to get us out instantly, while also taking wayyy too long to get us our food. In addition another server looked at us bad and spilled the cheese 3 times while saying nothing, no sorry or anything, seemed on purpose. Wouldn’t recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWlFVdFhUbU5NVDNKRVFXcERla2hNYm1oalYzYxAB",
            "text": "So yummy and great service!! The unlimited salad/soup is always a great deal 🥰"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNlZGSklWSE5KV1hoMFNFSkdPVE5DV0hWbFZuYxAB",
            "text": "I went to Olive Garden today for my sisters first day back to school and was seated promptly however a server didn’t come to our table till 12 minutes after we were seated. We saw our server attending to two other tables in the same section as us multiple times before they appeared and besides taking our order (which I had already started inputting it in the kiosk at that point) they showed up only once more before checkout that I had to flag them down for (which they hovered around due to a kiosk malfunction, I presume or to prevent a bad customer review)\n\nThe service was ultimately disappointing and my sister and I felt disregarded because the same server was checking into the tables around us multiple times (5 plus times) before us. Although the service was bad our food came out delicious and hot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0VVQxQldla1p3ZDBkV1JtdGhkMHhtUmpBeVNGRRAB",
            "text": "Came here on Labor Day for the Unlimited Pasta. Even though it was busy, the wait was less than 15 minutes. Sharleen was amazing—she managed multiple tables while still providing excellent service. The food was delicious and always served hot. Highly recommend this place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NVpFcGFRVnBtTkZoR016UXdkR3RHUTBZeVgwRRAB",
            "text": "this made my day miserable. if you had a gun to my head and forced me to go back to this restaurant, I would say pull the trigger. this experience was the worst one I’ve had, and I usually don’t make reviews, but this was was so amazingly bad that I had to. don’t go here if you want to have a good time, it is not worth it. if you’re hungry, don’t bother. just go to the nearest McDonald’s or whatever restaurant is closest, and if this restaurant is the closest, don’t bother. we ordered our food and the machine was blinking, but our server did not even bat an eye, and even if they did, they just ignored us and walked away. the only good thing about this experienced was the girl that took our orders, which btw wasn’t out server. pretty interesting."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRlpuZENNalpQV0VWSVlsY3dNR3c0VWs5eVIwRRAB",
            "text": "Came to Olive Garden on Labor Day in the night and had a horrible experience. We understand it was Labor Day and it could have been busy but we have been various times on busier days and we never had such a horrible experience. It took them forever to even bring us our salad and then we didn’t even have utensils so we asked them to bring it 2 times before we even got it. Our food took forever to come out and other tables that got there after us got their food before us. Then we were told they didn’t have anymore grated cheese like the cheese they always give so they gave us other cheese in a plate and then we see other tables get the grated cheese. After a while We finally got our food and my chicken Alfredo was horrible and very very dry like I had to ask for extra Alfredo sauce on the side. Overall The least they could have done was communicate and let us know the kitchen is delayed but they didn’t and we only knew that after we asked another waitress about our food which she was kind enough to go check up on our food. Thankfully we didn’t have to wait on the check because we were able to just pay on the device but overall we never had such a terrible experience at this Olive garden and we come often to this location but we left very unhappy this time ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNGFVbDVjbmxvYUd4bU5GbFpORVZhVDA1WWQwRRAB",
            "text": "I should not have park the car here. That was my fault. I should have known better. If you are not going to either restaurant your car will be tow. Try it if you dont believe me. It's actually a good business here in this spot. The street parking are full and mall parking charge around $10 or more. There is a big mall and people Will PARK HERE thinking nobody is checking. But they are. Right after you leave say good bye to your car. Call the number on the warning sign to get your car back but only if you have cash or zelle. Otherwise have to get the car from compound lot which is in flushing so even more money to waste. Learn from my mistake unless you want to spend unnecessary expense here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMlRtWTVTbkpNZGtRMlkycEpOelZLVkhveFlsRRAB",
            "text": "The chicken Alfredo was so good and made my mouth watery. The frozen shakes are very good and the chicken just perfect."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GR1ZXRnlhVVpHYnpacWRuazVlRWRrUlVsRk1GRRAB",
            "text": "It was a good vibe"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trM05XbGZRVWxIVDJ4WE0zcHBRbkU1U3poa1NIYxAB",
            "text": "This used to be one of my favorite restaurants. I've been coming here for years. Yesterday, Sunday, August 24th, around 2:30 pm, I decided to take a stroll with my 8-month-old baby. It's not the first time I've visited this restaurant with my baby, and I also visited several times during my pregnancy, as I mentioned, I've been a customer for many years. It turns out I had to wait a few minutes for a table and while waiting, I was going to feed my baby (breastfeed) in the waiting area and informed the young woman at the reception. I don't remember her name, she was a young girl, fair-skinned, thin, and with slightly long hair. I suppose with this description, you'll know who was there at that time. Well, the girl basically told me I couldn't do it there and offered me the bathroom to do so. To which I replied, \"Seriously, the bathroom to feed my baby?\" And she said yes, it was a big bathroom... Olive Garden should better inform and instruct its employees about breastfeeding, which is protected by federal and state laws and is a right of every mother and baby, which is why breastfeeding is allowed in public, anywhere. At that moment, I decided to simply leave the place, as I didn't want to ruin my outing or argue in front of my child, however, I will file my complaint formally as I should."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKS1IxSXpOalZsVVZSRFVGSkRkQzFHVEhaTFQyYxAB",
            "text": "IT was pretty busy when I went but then again it was a Saturday night. Anyways food was pretty good. Got pretty full off the soup and the pasta was good too. Just wish there was a bit more sauce. Our server Julio (I think that was his name) was super helpful and attentive. Shout out Julio. Thank you for your service king. Get that man a raise cuz king was clocked in and locked in 🙏 (sincerely the table that had 2 bowls of soup and took the pasta home)"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVlNraFhTRGwwYnpOZlRqQjRSSGxrYm5ad1JtYxAB",
            "text": "Pésimo servicio"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeGNXRTBkWFk1UjNJeGVIaE9PR3AwWTBsQ1FYYxAB",
            "text": "The service was amazing, I got served by Claudia she has such a friendly personality! The food was great and the food was at the table in no more than 20 minutes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25waVdGOVpUMDVtWTBKelNGZGtTQzFVUWw5RVNIYxAB",
            "text": "I absolutely loved this place! Everything was perfect - the food was delicious, the prices were very reasonable, and the interior design created such a warm and stylish atmosphere. The whole setting felt comfortable and welcoming. I’ll definitely be coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeVFqbFdTME5IWjIxWWVuQm9UMmQzTUZFMlVHYxAB",
            "text": "very bad food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQ2VFbEdTWEV4U21SR2RqWkJWRmM0WTNCUE9XYxAB",
            "text": "Always love coming to this location. The staff is always very friendly and welcoming. Today we had the absolute pleasure to be served by Juliana. She was such a kind soul, her energy is beautifully transmitted. It is most definitely an asset to have her in your team. Will absolutely recommend this location."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ad01FaEdTRUZZTkZGc2RFVk5SM0I1WjBOWlkwRRAB",
            "text": "No está muy buena la comida,lasagña salada. chiken parmigiana pollo duro.\nAtención 1/2"
        },
        {
            "date": "3달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0amVHZFdOVTFCTVhKVGVsWTRTM1ZKVDNOa1VGRRAB",
            "text": "Servis peçetelerinin daha yemiz olması gerekiyor. Diğer her şey çok güzel 👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4M2VqRnBiMGc1YVVOdlNqVkRlVGd3UTIxbVYzYxAB",
            "text": "I went to this Olive Garden and was surprised to find a $2.99 charge for “Table Games” on my bill. A few months ago, I had visited a location in New Jersey, played games on the tablet, and was not charged — so I had no reason to expect this.\n\nThe server said the fee was shown on the screen, but it’s incredibly subtle. There was no clear prompt asking,\n\n“Are you sure you want to pay $2.99 for games?” — which would be the honest thing to do.\n\nThis feels like a modern way of charging people without clear consent. Technically allowed, maybe — but certainly disappointing.\n\nI was going to leave just one star, but I have to be fair: the food was delicious.\n\nHowever, in the area where we were seated, there was no music at all, which made it uncomfortable to talk — everyone’s voices echoed and people spoke loudly just to be heard. Also, in all my years going to Olive Garden, we’ve always been offered fresh cheese with our pasta. This time, no one offered.\n\nTo be honest, I’ll probably stick with the New Jersey locations, where I’ve consistently received better customer service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkd1VWRXhabVozTkdnNU4ySnNkSGx1WDE4d1owRRAB",
            "text": "I’ve been a loyal Olive Garden patron for years, drawn to its consistent comfort food and welcoming atmosphere. However, my most recent visit was a disappointing departure from the standard I’ve come to expect. The dishes, typically vibrant with flavor, were lackluster—specifically, the pasta was woefully under-sauced, leaving the meal dry and uninspired. It’s as if the kitchen forgot the soul of Italian cuisine: a generous, well-balanced sauce to tie everything together.\nAdditionally, the service, while polite, was marred by a frustrating mix-up. I clearly ordered sweet tea, a simple and budget-friendly choice, but was served the most expensive tea on the menu. While the price difference may seem trivial—mere cents—it’s the principle that stings. In an era where every penny counts, especially for those of us pinching them, attention to detail is non-negotiable. Mistakes like this erode trust and make you question the value of the experience. Olive Garden has the potential to do better, and I hope they take this feedback to heart for future visits."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOEpmYmtRRRAB",
            "text": "This time it was takeout, but it is always a nice selection in terms of a tasty hot meal.  I choose the same item every time, and I am never disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjdFJpMXRXRmRzYUcxVk1XcGpVRzU2VXpoeFJXYxAB",
            "text": "Worst experience can't tell about the food never got to tasted we waiting for over 40 min no even a single waiter took one second to aleast offer water."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcVdteG5ZamRWTTA1d1NHaGZUa0U1V0hoWWQxRRAB",
            "text": "Go seated in less than 5 minutes, the service was great and the place as well. Air conditioned. Expected more of the food. I ordered lasagna but as you can see it’s like a huge chunk of meat and barely any of the pasta. Needed more cheese as well. The drinks were overall great and the breadsticks were a bit too salty for my taste."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSVNXaEVUMnRtV1U5bFVHMXJVMnhWV0hWMlZGRRAB",
            "text": "I come here for many family special gatherings."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMldYbHJia2xzTkRSYVdsOVZPRk5pWVdWRE9VRRAB",
            "text": "Our server was wonderful, we celebrated my mom's birthday, food was good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQ1pDMVZkbGhDUWpoMGVtVTVVamR3ZVRndFMzYxAB",
            "text": "We had a great experience at Olive Garden thanks to our amazing bartender and server, Kevin! He made us delicious margaritas and gave excellent service the whole time. The lasagna fritta was soo good cheesy. Big thanks to Kevin for making our visit even better :)"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJMGR6SXR3RRAB",
            "text": "다른 올리브 가든보다 ㅎㅌㅊ"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOdWZ6NC11cS1qdGZ3EAE",
            "text": "It used to be good here but now it’s nothing but disappointment.\n\n1) I’m no dessert expert but this is definitely not how you’re supposed to do it, the powdered sugar was splashed unevenly on the fried donuts.\n2) In the men’s restroom there were no paper towels, no soap and the urinal was filthy.\n3) The bread and soup were too salty.\n4) It took me three attempts to get a glass of ice water. What in the world?"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCc1dtcFdOM0pKVmt0U1RraDRYMWxsTlZsQmVGRRAB",
            "text": "My friends and I were seriously craving pasta and realized we’ve never actually tried Olive Garden before. Crazy, right? Hahaa well it definitely didn’t disappoint! I kicked things off with the Chicken & Gnocchi soup and some calamari on the side and both were super tasty and hit the spot.\nFor my entree, I went with the Grilled Chicken Fettuccine Alfredo added broccoli. It was rich, creamy, and full of flavor. Honestly the food was surprisingly good for Olive Garden. No wait, no reservation needed overall, a smooth and satisfying experience with great value!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdE9mQ0xBEAE",
            "text": "I had the buy one take one menu and it was really good. You can eat unlimited bread and salad or soup and I ordered two pastas. I ate one in the restaurant and took one to go for dinner. It was good for $16.99. I wish there were more limited menus like this."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdklIeXdRRRAB",
            "text": "I had a craving for Olive Garden, it's comfort Italian, just like Taco Bell is Mexican. So we haven't been to this location by Queens Center Mall. Boy it was packed, but we were seated quickly, the place was 75% full it seemed. We switched from booth to table for more space. They were very accommodating, the server was super professional. The bread sticks, salad, appetizers, and entrees were delicious. Service was spot on, server was attentive and diligent. We packed the leftovers for later and even partook in their take home pre-prepared meals."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdjVhUnFBRRAB",
            "text": "It was my first time dining at Olive Garden, and the experience was amazing. It wasn’t busy at all, and the staff were very fast and helpful. The pasta portions were generous and delicious, and the tiramisu was perfect. The location is super convenient, just across from the mall."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydVBhU1pnEAE",
            "text": "Very good food, cozy place. On my last visit the drinks were not to my liking due to the way they were prepared, I had to replace my drink, most of my companions said the same, there is a lack of more staff to serve the tables due to the delay in serving you at the table as there were few waiters.\n\nThe bathrooms need much more attention since they give a lot to say, especially for being such a busy place and being in such a busy area.\n\nI ordered the seafood Alfredo pasta it was delicious, the garden salad was bitter. This time was very different from the previous ones I have visited. It's the first time I've seen the place a little neglected."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa3ZXejBRRRAB",
            "text": "I’ve had two disappointing experiences at this Olive Garden. During my last visit, I had to speak with a manager about an issue with my meal, but nothing was done to resolve it. I returned today to follow up, but again, the manager seemed uninterested and offered no real solution or apology.\n\nTo make matters worse, this time I was surrounded by waitstaff who were standing around chatting loudly about non-work topics, creating an unprofessional and uncomfortable atmosphere. It felt like either my food isn’t prepared properly, or I’m stuck listening to gossip while trying to enjoy my meal.\n\nThis used to be a place I looked forward to visiting, but unfortunately, the quality of service and management has really gone downhill.\n\nThe only thing lively this time around was the bartender Tia! Kind and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbFAtMmJREAE",
            "text": "It was a great experience. we were a pleasant party of 11 Jehovah's Witnesses and the waitress assigned to us didn't disappoint!!!! 🤗💕🙌.\nWe came hungry but happy to be having one last get together with our 90 yr old young sister friend who is relocating to the south!  😊 The waitress, ...sorry I forgot her name was wonderful. We had the perfect area with the large oval shaped table off to itself  that fit us all and made it the perfect atmosphere for us.\nThe waitress was one step ahead of us the whole time .The appetizers came out quickly and every one seemed satisfied with their entree. A few of us had drinks that were good too. Not to mention free refills on soft drinks. Thanks for a great experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NHNMQ2FREAE",
            "text": "The food is terrible, I have no idea how this restaurant is still in business. It seems like a upscale McDonald's. But the service was fantastic. People working their work hard and are nice people. That's why I'm giving this Olive garden or…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3djVLc05REAE",
            "text": "Olive Garden it’s definitely a must!\nO.G it’s a place that offers an open invitation to stay and take a break enjoying the Italian gastronomy with a plenty of options for everyone.\nSince the moment you step in you can feel the Italian ambience and the spaces are big and comfortable enough to bring large parties, perfect for special occasions.\nOlive offers up new items on their menus where the variety shines around the food and drinks; also a big plus is that you can order your own pasta with different sides, so you can enjoy the food in the way you want it!\nThere’s no doubt that Olive Garden wins a place in your must go restaurant list with the warm and fast service, delicious food and spaces that only can give you memorable moments.\nThank you Olive Garden, it’s always a pleasure."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKODRldWh3RRAB",
            "text": "I know it’s olive garden and not a local shop, but this is a well deserved review! From service to food, we were really well taken care of… I had the “Tour of Italy” and it was way too good! It is a mix of different things but the lasagna did it best for me… My friend had chicken and shrimp carbonara and it was really good as well (though I would rather have just lasagna). Overall the service was great, we were well treated and served, food was awesome, and the environment itself is nice, quiet and enjoyable."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRaE9tWjlBRRAB",
            "text": "I had a really great time the food was delicious and so was the atmosphere. My Godparents enjoyed themselves to. Thank you Olive Garden."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwd3RLRWhBRRAB",
            "text": "It took over 25 minutes to get a server. We had to go to the concierge twice to request that we get a server to take our order.\n\nFinally, we got a server, who apologized for the delay. Our server, Paul, was extremely pleasant and nice, and did his best to give us good service. Accordingly, we gave him a 31% tip, and expressed how happy we were with his service.\n\nThere were pieces of torn napkins and food on the floor next to where we were sitting.\n\nThe bathroom needed attention. The trash can was overflowing and there was too much water around the hand wash sinks."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndWFEVzR3RRAB",
            "text": "Our waiter was very friendly and they served us our food very quickly. I mostly recommend the Shrimp Carbonara. Would definitely come back"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVc0x1cXp3RRAB",
            "text": "Went for lunch after quite sometime. Stuffed mushroom was mind blowing. Loved the drinks too. The soup that came with entree was a big portion. Taste of Italy was so so but I liked the chicken & Shrimp Carbonara. By the time I finished my entree I was so full, didn’t have room for dessert."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMnZHUHlnRRAB",
            "text": "I have been here several times but have always left unsatisfied because of the servers and food. But today Bryan our server was exceptional!  He was beyond fabulous. Very professional, courteous and cheerful. His recommended white wine was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMGNURWx3RRAB",
            "text": "Very long wait before waitress even came to the table, brought out the totally wrong drink to take it back and used the same glass with noticeable residue at the bottom of the glass!\nDropped my soup spoon, did not check up on us once to see if everything was alright. Definitely better service by Green Acres or even Gateway.  I was very surprised with my first visit and my first impression. I surely will not go back to this particular location, ever."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdE0zUTFaRWRmY0hkT1MySktURVJ3UkRaU1NWRRAB",
            "text": "The food, service, and atmosphere is on point and exactly what you’d expect of a chain dinner with some very talented staff members. The biggest issue with this location is the parking situation, as it does share a lot with another restaurant. Street parking is scarce, but come prepared to circle the block a few times."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVczVDd21nRRAB",
            "text": "Great restaurant with parking, the only thing is on the weekends is super busy, food it's great, I tried almost every plate, love the drinks. Well the espresso martini was not the best, but I order many drinks here, this is the firts one…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTmFXTXlRMnBFT1dsMFZtUmxiRlI2T1cxdFkzYxAB",
            "text": "Worst Olive garden experience. Waited almost an hour even after making reservations a week ahead of time. We kept getting told another 30 minutes twice. We had a group of 12 in which one person had hair in her chicken parm sticking out. We went in July, no ac in this restaurant. When I asked about no ac, lady in the front said the manager told us there was no ac - that wasn't true. The server brought out two bowls of salad and didn't even offer soup to any guest. Save yourself a horrible dining experience and stay away from this location."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1aHBQRFRREAE",
            "text": "Went in for lunch around 12:30pm and was seated right away. Service was great and the food came out hot and fresh. Table and booth was clean and not sticky. I was so full from the salad. I couldn't even eat all my food. Bill was under $24 can't go wrong here."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2LVpmRXpBRRAB",
            "text": "THIS PLACE ID YOU AS IF IT WAS A CLUB. As soon as I walked in the place they id you before even asking for your COVID card which is just wrong (especially or people who don’t have ids). The place seemed clean and wasn’t too crowded for going around 12pm on the weekend. The food didn’t take too long to come but there isn’t many options, it does taste good though. Overall if you don’t go here unless you have an id or if you don’t like pasta."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvdFUyWk1UMUIwU1VWNGFtWjVUMU5uZEVscE0xRRAB",
            "text": "Came here 3:00PM on a Wednesday, James made our day! The service here is the absolute best. Every staff member is so kind and helpful. James made our experience 10x better checking on us, making us smile, and with the quickest service."
        }
    ],
    "reviews_count": 74
}