{
    "name": "Boca Juniors",
    "place_id": "ChIJd8XFk1NewokRQFKYhhd_Yg0",
    "grid": "QN4",
    "address": "81-08 Queens Blvd, Elmhurst, NY 11373, USA",
    "rating": 4.3,
    "user_ratings_total": 1738,
    "phone_number": "(718) 429-2077",
    "reviews": [
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNmQzQTRVelEyWms1UU1ubG1hR2MyVGt3MlJIYxAB",
            "text": "Supeeer delicioso !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wb2RFMUhkVVpoTFRKNlFrODRjRWs0YWt0d2VrRRAB",
            "text": "Authentic Argentinian cuisine, very delicious"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQlJXMDJUMTlGZUZkMlVVSkdTWEJmYlRkR2NFRRAB",
            "text": "Such a fun and lively experience. We come almost every year for my father in laws birthday. The steak is splendid! Large servings sizes and super flavorful.\n\nMy sister in law had the chicken cutlet and it did not disappoint. There was flavor in the chicken along with the breading.\n\nMy 6 year old had the pasta. And that was a crowd pleaser.\n\nI love their blood sausage and churrasco. Get some extra chimichurri on the side with yellow rice and beans- making of a filling and flavorful meal.\n\nCan't forget the homeage to soccer greats Maradona and Messie plastered throughout the wall.\n\nThe staff made the celebration so much fun.\n\nOnly downfall is parking."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaVVrTlNkbWhDWDA5U2FrcDBWRTlxUmxNMk1WRRAB",
            "text": "Viaje con mi familia desde massachuset para conocer este lugar que sabia que la comida es muy rica pero que decepción de las dos personas que me atendieron ya que al parecer a esta hora 2:30pm  más o menos no se encuentran los dueños y no atienden bien a los clientes no dejan ni comer tranquilo que a mi mamá  le quitaron los platos antes que termine , muy mala atención  ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeVVuUlFXVFo1V1Y5QmVtdzNWR3htYWpSME4wRRAB",
            "text": "Good restaurants, the food is really good , I never went in game time. But I feel it's so much better."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmZy1hajN3RRAB",
            "text": "Best Argentinian steak house !! The food is amazing. The service is wonderful . Great authentic food and atmosphere.  If you're a soccer fanatic, this is the spot to be at , especially during the world cup."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWE1UVTNjRE5LT0VVM2VuVjJaM1UzTVZSM05VRRAB",
            "text": "Good place to share BBQ. Needs to improve table service"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeFRFVjVOMGcxVm5wbFNYbGllbTFhYlZjMVdYYxAB",
            "text": "La pasamos muy bien con mis amigas y la comida riquísima! Sin dudas volveríamos a ir!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMWIyNU1lRXR3VFRkNWJFZE9WbFpZU25WRFlVRRAB",
            "text": "Very pleasant! Food was Great  good time with the family"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WR1NqZzBXSHBSU1VwWE0wMHpNSEJmZVZWa1UyYxAB",
            "text": "La carne más deliciosa que me he comido en mi vida. Y el servicio impecable. Volvería mil veces 😋"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UWRXWldUR3RwZDBoT2MzRlZkMVJZY21GaGIzYxAB",
            "text": "No recomiendo este restaurat.estuvimos con la familia esperando por más de 1 hora nunca nos atendieron,los niños tenían mucha hambre. no los podíamos ir porque en un pequeño Parqueo nos habían Parqueado un carro atrás y no podíamos ir nos…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RWNYbzJkbEJaTjBKeVltcERVSGxJV0d4UWNXYxAB",
            "text": "I have been coming to this place for years but things have changed here. This is just a personal preference but I have a hard time telling others to join me in a dining experience where there is no physical menu. They sell wine, however it did not appear in the digital menu. There was no price and no selection so I still don't know if they have one brand or more. When I asked for a physical menu the waiter said they no longer have physical menus. The food was very average nothing like the food I remember from my years eating her. The one thing and perhaps the only thing I felt they did well was the chimmicurri. The parrilla was decent but Boca jrs used to be so much better than what I experienced. I hope they do better next time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUVgzWmhhR1ZWTlVOd1JqWXdXUzA1YkdoM2VIYxAB",
            "text": "If you love football and amazing Argentinian bbq then this is a must.  I love this place ❤️🇦🇷"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SVQydFRXVXBSY0MxdGRXOXZjbG80VEhsTE4xRRAB",
            "text": "Bad service. I will never come back"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUU9IbGpORVJYV0hGT2NqRmlURlEwVnpWR1JIYxAB",
            "text": "Excelente ambiente y parrillada, los trofeos le dan un plus al lugar para tomarse fotos con ellos"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeFRHbHVPV3huUVdsa1QyOTBTbk5tTWs1cVMwRRAB",
            "text": "Este fin de semana estuvimos celebrandole el cumpleaños a mi hijo que es fanatico de Boca Jrs.\nLa atencion de todos en el restaurant fue excelente.\nEl asado delicioso!\nLes agradezco a todos los meseros y dueño del restaurante por hacer del cumpleaños de mi hijo una experiencia inolvidable."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RelgxaFBkV0ZoZFZSeFpVTm9NMk5zWTA1TVdWRRAB",
            "text": "Just delicious 😋  and it's good to watch Boca playing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMFFqWk1OVzFJV2tJdFdXZFZRV2RMTmw5bFZFRRAB",
            "text": "Great birthday!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWFRIbG9WbWx5ZVMxRmJVaEpaa2wyTFZGUWExRRAB",
            "text": "-servicio : pesimo deberian mejorarlo\n-comida: regular\npedimos una parrillada para dos y dejò mucho que desear, nada de carne y quemada en su mayoria\n-El lugar :esta decorado y ambientado es bonito."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VlJuazRXRzk0T0VkaldsTm1lbTlwUkRZNE1sRRAB",
            "text": "Todo delicioso excelente atención gracias 🙂"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQX3JrNVNrZ0lPcV9BRRAB",
            "text": "So we went to this restaurant on Wednesday, May 28th and all I can say is NOPE, NOPE, NOPE! What was supposed to be a nice celebration lunch for my cousin’s college graduation turned out to be a disaster. To begin with, the waiters were very rude, inattentive and with a lot of attitude. Secondly, when we requested to have the leftovers packed up to go, they only packed up a few pieces of meat and kept the majority of the food which we realized later on at home, and to top it off, the restaurant still has their old menu up with old prices but on their QR code menu (which you scan using your phone’s camera) they had a completely different menu with prices doubled!!! Very sneaky and deceiving. If you want to be treated like trash and have your money stolen come to this restaurant!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNNnBzTy1NOHNQYzJBRRAB",
            "text": "La verdad una pésima comida un mal servicio no vuelvo jamás a este lugar"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb2E2dFhnEAE",
            "text": "Excelente atencion, recomendado,"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMGQ2Vlp3EAE",
            "text": "Great place!  Food is good!  I love coming here!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcS1pTklBEAE",
            "text": "Muy buen ambiente ..... la carne deliciosa .... hasta el café es rico ..... recomendado .... volveremos"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva2RuUUNnEAE",
            "text": "Very very disappointed with this place, had very high hopes coming to this restaurant, drove 45 minutes just to eat in this place. They have their hours to open at 2pm online. We came at 2:10 and all doors were closed when we asked one of the workers that was coming by he told us “we might open 2:20-2:30” meaning they open at whatever time they want to open. Was truly disappointed it was not about the time waiting it was about the unprofessionalism of this place. Update your hours and the employees of the place should have the info of what time the restaurant opens."
        },
        {
            "date": "수정일: 6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5emF2VE5REAE",
            "text": "VALE LA PENA"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJakk2WXJ3RRAB",
            "text": "Excelente"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3a0xDeHV3RRAB",
            "text": "La comida es rica, el personal amable, los tiempos de espera son aceptables y lo que me encantó fue la música, la pase muy bien."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRZ3R1ZF93RRAB",
            "text": "Espectacular, el servicio de los chicos te hace vivir realmente una experiencia, la comida deliciosa Felicitaciones!!!!👏🏻👏🏻"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRX0wyM2hBRRAB",
            "text": "El lugar es vistoso y bien decorado.\nLa comida no tiene nada de especial, sabor promedio y los precios algo elevados. El puré de papas estaba bueno. El servicio no es bueno, pareciera que te atienden de favor como si los molestaras cada vez que pides algo, no hacen recomendaciones del menú, no tienen especiales, no te ofrecen ni sirven agua hasta que uno lo pide.. El busser fue muy amable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaFBhWW1RRRAB",
            "text": "Close door is early 😣"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnODdua3l3RRAB",
            "text": "Always a friendly environment, Great value steak portions that would cost double the price in the city. Would recommend for birthdays and get togethers"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMmNYUnpnRRAB",
            "text": "My favorite place to watch a good game & have great food & drink"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnd2RHbGRBEAE",
            "text": "Very good food and service. The Morcilla and sausages are delicious, totally recommend. 👏"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndnBUeXB3RRAB",
            "text": "They bring good bread with chimichurri sauce and that was excellent! Ordered Skirt Steak and Filet Mignon (premium price) that came with salad or mashed potatoes/fries. The mash potato was INSTANT mash potatoes from a box! Also ordered calamari $23! Sadly they were also frozen and tasted 🤢\nService is good and the ambience is very nice but the prices are too high for the quality of their food.."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOXVyVFhnEAE",
            "text": "Extremadamente amables..muy buena atención y rapidez..5 de 5 para ellos.."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBamJxU19nRRAB",
            "text": "Este lugar esta sobrevalorado, el precio para una picada de dos persona es exagerado para tan malos cortes de carne SOBREVALORADO no vives una experiencia diferente es solo un lugar  con fotos y mala comida el dinero en realidad no se perdio pagar por conocer nunca es perder."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNFlLQ0pnEAE",
            "text": "스테이크와 고기를 좋아하시는 분이나 아르헨티나 축구팬, 특히 마라도나를 기억하시는 분들에게는 최고의 레스토랑이 아닐까 생각합니다.\nA steak or meat lovers who like Argentina soccer and Maradona fan will be fascinated this restaurant."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJb2NfX01BEAE",
            "text": "맛은 있으나 가격이 비싸다."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0cXNITEtREAE",
            "text": "I came in with my brother and mother on a Friday night for dinner. Multiple waiters came up to us waiting to take our order. The service was extremely quick. The food is delicious and tasty. The chimichurri sauce is really good. We ordered the mixed grill meats for two; steamed spinach, provincial potatoes, which are basically potato chips, the red beans which was lip smacking as well as the yellow rice. We paired it with a pitcher of red sangria. We don’t mind paying the tip in cash while charging the rest to the credit card."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMk9tVDN3RRAB",
            "text": "I recently visited Boca Juniors Steakhouse with high hopes, but unfortunately, it was a major letdown. As a huge fan of Argentinian cuisine, I was excited to try the Parrilla Boca Juniors ($117.95), expecting top-quality meat. Instead, I was disappointed by the poor cuts we received—some pieces were overly fatty, and the short ribs were the toughest I’ve ever had.\n\nThe service was great, and the Argentinian-themed décor added some charm, though the abundance of Boca Juniors soccer jerseys felt a bit overdone.\n\nSadly, I can't recommend this place, especially at such high prices. If you do decide to go, maybe stick to a chicken dish instead."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueGN2SXRnRRAB",
            "text": "Came here to celebrate my nephews birthday. Liked the overall Argentinian soccer theme. We ordered the Parrilla Boca Juniors combo, which was a good amount of food but was rather tasteless for the premium price that we paid for. Had mashed potatoes and french fries for sides."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyb19xemRREAE",
            "text": "Awesome Argentinean Steakhouse Restaurant  !!!\n\nNice atmosphere, good seasoning.\nExcellent Meats quality.\nFriendly and helpful waiter.\nDecorations were beautiful.\nDecent prices and good portions.\n\nWe were really surprised with the food and service of this Restaurant compared to others high end Steakhouses.\n\nYou will really enjoy this place."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsd05qV0xREAE",
            "text": "Good wine and great, comfy, nostalgic, South South-American food. pretty nice, soccer-centric  vibes and atmosphere.\nSe come muy bien aquí\n\nWatching a world cup match here has to be awesome"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dTVtem9RRRAB",
            "text": "la comida muy rica, solo que esperaba algo mejor\nel servicio no muy bueno, y aparte de que andaba un kid corriendo y gritando en el restaurante,\nel postre muy rico igual que la sangria,\npedimos una parrilla para uno, el lugar muy buena decoracion y limpio. pero no para regresar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMGR1TDV3RRAB",
            "text": "Overall a very bad experience and never going there again. The waiters circled around the table making the atmosphere very uncomfortable. A literal second after dropping the check the waiter came back not letting the table discuss how the check would be split. Did not leave tip because the waiter was extremely rude when asking about the sides of the Parilla. A 300$ bill for shitty service and like 3 pieces of meat. Take your business elsewhere and for the owner please hire better waiters."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabllDRmx3RRAB",
            "text": "Place was loud. Service was okay but  food is terrible for the price. Take out looks dry, not freshly cooked and is tasteless to me.\nOrders portions are much smaller than other Argentinian restaurants.\nNever going back there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwM3JHdWNREAE",
            "text": "One of a kind\nA great and exceptional experience if you want to get transported to an Argentinian “Chirrasqueria” with an incredible theme out of the biggest football/soccer club in the country"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbHV6d29RRRAB",
            "text": "This was my first time here and I was having very high expectations due to all the great reviews. Decided to order the mixed meats for one with a side of rice and potatoes and was sadly disappointed with both the meal and sides. Meats had barely any flavor to them and the sides just tasted bland. Servers were nice and were good in welcoming you and seating you however after that, they weren’t very attentive. The place gets very crowded and is usually filled with larger parties (at least during the time I was there). So also expect a bit of a wait and a crowded restaurant. Wish I could have enjoyed the food and service more but boca juniors just wasn’t it for me…"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfME9QcjJ3RRAB",
            "text": "La comida fue aceptable, obvio q no es un asado argentino porque no estamos allá, pero dentro de todo bien, la propina es impuesta pero debería ser decisión del cliente.\nRecomendado para pasar un rato diferente!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNTh1TnNnRRAB",
            "text": "Went for a late dinner about 9pm. Ordered and ate fairly quickly. Only thing I wasn't happy about was after they took away the entree the brought over the check. I was really looking forward to dessert but they said that the kitchen was closed😔. No flan for me. Would have been nice to ask us if we were interested in anything else."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqM3ZLZFlnEAE",
            "text": "Highly recommended this spot for authentic Argentinian food. This is THE place if you’re a soccer fan, huge TVs and memorabilia everywhere, so much that you don’t mind waiting or a table. The quality of the food was superior to places in Manhattan for half the price. The place is spacious, the staff is nice and the food doesn’t take long to be served. We spent less than $200 for 3 people and had 2 bottles of wine. Will definitely be back!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnM3Z6TU93EAE",
            "text": "The meat and portions were very good ,the sides rice ,fries etc etc were below average taste. The service is just a little bit above horrible, nothing special not really worth going back"
        },
        {
            "date": "6년 전",
            "language": "pt",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwcjd2b19RRRAB",
            "text": "Excelente churrasco típico argentino, atendimento muito bom, só não gostei da quantidade de rótulos de cervejas, muito poucos, poderiam ter mais cervejas que harmonizam com carnes vermelhas, presencialmente IPA, APA, etc... Mas no geral é um excelente lugar para se comer um bom Steak. Parabéns aos administradores."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidHVPRXVRRRAB",
            "text": "Good place there are aso much historical stuff, pretty big size for the steak"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURremNXS2N3EAE",
            "text": "Muy mal sitio... La verdad da lastima la comida y el servicio es peor.\nSinceramente no lo recomendaría nunca.\nEsperaba mucho más del sitio por que tiene buenas fotos y performance; pero el servicio y la calidad de la comida es muy mala. No merece ni una estrella.\nSe demoraron una hora para llevar la comida a la mesa y la comida llegó cruda. El servicio de los meseros fue horrible, con grosería y de mala gana.\nUno como cliente de verdad no tiene que verse así afectado.\n\nNUNCA RECOMENDARÍA ESTE SITIO ALGUIEN, CERO ESTRELLAS"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0dWVxWHZBRRAB",
            "text": "A true Argentinian staple in the heart of Queens. The skirt steak and filet mignon were perfectly soft on the inside. The mashed potatoes were light, fluffy, and satisfying. It was one of the best steaks I've ever had. I look forward to coming back here again for a warm feel."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBd2NiaDBBRRAB",
            "text": "Soy aficionado de boca juniors y esperaba algo más de este lugar la decoración es exelente las fotos las camisetas los colores el lugar agradable, la comida estuvo bien la entraña estaba jugosa y rica mi esposa pidió milanesa boca juniors y…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvdU5ld25RRRAB",
            "text": "The food was so good, but the service is awful... like ridiculous, every time we asked for something the waiter was making faces, he didn’t bring some things we asked for, it was a mess honestly... I still upset"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnOFAtVHBnRRAB",
            "text": "Great service, very kind, constantly asking us if we needed anything. The place is really nice decorate. The food also was excellent, Parrillada was delicious and the sangria really good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXOVpULVJREAE",
            "text": "Tasty meats and a sports bar atmosphere. Appetizers, like the Chinchulines, are a tad overpriced but delicious. Their chimichurri is one of the better ones I've tried. Of course the star of the day was the meat. We had the Parrilla Boca Jr's. Flan was tiny and seemed to lack flavor, but the accompanying dulce de leche made it better. The Tiramisu was big and very well done. Service was attentive, however they didn't offer the whole table water. Regardless, I would come back again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMWJTSmtRRRAB",
            "text": "This place was really great.  Went there for bday party.  They really make it worth it.  The food was delicious.  Steak was cooked just right.  8 people got their junior social.  That was enough food.  So about 30 to 40 dollars per person.  Their Sangria was also delicious.  Not to sweet & has a kick."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDMHM2c0V3EAE",
            "text": "Steak are very good. Service is very good.  They have a nice variety of meats.  Cooked to my liking."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKckxXb2pnRRAB",
            "text": "Super buen lugar!!! La comida excelente y la atención increíble 👏 🙌  recomendado... si estas buscando una restaurante de parrillada argentina es el lugar indicado .\nAdemás la selección de postres es variado me encanta el tiramisu y muy rico\nTe recomiendo pruebes la parillada boca te va a encantar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0Z2JhYVlBEAE",
            "text": "Love it!!!\nWill be back to try the skirt steak!!!\nHighly recommended"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaEszaWFREAE",
            "text": "Excelente experiencia gastronómica y muy buena atención.  El lugar espectacular"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXbUpEQWRBEAE",
            "text": "If you're looking for some great Argentinian bbq then this is your place. The atmosphere is great and if you're a football/soccer fan then you'll greatly appreciate the decor in the restaurant."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdEo3bVR3EAE",
            "text": "La comida y la atención es buena.\nMientras decides que comer o a que te traigan la comida, comparten pan con mantequilla o pan tostado con un aderezo de tomate, aceite y ajo.\nLa picada de carnes es rica, viene con 2 acompañantes que puedes escoger."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOW8yNUJBEAE",
            "text": "Great tasting steaks and drinks, I like the atmosphere with all the traditional Argentina feel. Gracias!"
        },
        {
            "date": "3년 전",
            "language": "zh-Hant",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMm9ld0F3EAE",
            "text": "在地人知道的牛排館\n有機會可以一試"
        }
    ],
    "reviews_count": 71
}