{
    "name": "Double",
    "place_id": "ChIJRSf_Ds5fwokRZqTrUKpGcDI",
    "grid": "QN4",
    "address": "53-16 108th St, Corona, NY 11368, USA",
    "rating": 4.4,
    "user_ratings_total": 247,
    "phone_number": "(718) 760-1021",
    "reviews": [
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NVNVMTRUbWd5TVRadmQyRjFUa2xJVGtsRU5tYxAB",
            "text": "Super buena la comida, super Amables muy recomendable 👌"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjM1YwZDVibmsxYWt0M1oyWk1hemxWYURCclJVRRAB",
            "text": "La mejor comida de el área😋"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdGFHOUJWVEl3UlhSeE4xOVBXR3BzWkVGd1VYYxAB",
            "text": "Excelente 👌"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNWExWTNaazE1TmtJd1dtUjFaemxoWjBKQ1dGRRAB",
            "text": "Son muy limpios y amables"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VmFHc3RlR1ZXUkdwS1dqbFVlVkIyVUZaaVltYxAB",
            "text": "Asked for bbq sauce on my kids fries 1.50$ insane!!! I can buy a whole bottle for that price. Been getting bbq sauce, ketchup and hot sauce on my fries for years now charging for it is where I draw the line !!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MDd1czNBRRAB",
            "text": "The food is just amazing! 😋 great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuazZtV09REAE",
            "text": "Yuk. Greasy overly sweet food."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNud2RLaDBBRRAB",
            "text": "La verdad el arroz muy feo y crudo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOXVqQk5nEAE",
            "text": "They should  receive cards!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcmFUMjd3RRAB",
            "text": "the food is great and of good quality, if theres any complaint its the shrimp which still has the intestines but aside from that all the menu items i’ve tried have always left me satisfied and craving more, i’ve been buying here for the last 6+ years and i’ve gone to other places but this tastes like home to me and I always recommend this place to friends"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNWJiU3d3RRAB",
            "text": "Love their foods. Ever still I move here this is the only Chinese restaurant I order from. I recommend ordering the fried chicken wing and the boneless spare ribs . The cashiers are friendly and the environment is clean and nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeGZldFh3EAE",
            "text": "This is my favorite Chinese restaurant in this area. Love their foods especially are their chicken wing and beef broccoli with garlic Sauce. When they take orders they are very patient and nice. Also they know how to speak a little Spanish. I will always come here to order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeVlHVnJRRRAB",
            "text": "I do not recommend it. The food is not delicious and these guys only want to accept cash. I think that's how they get away from taxes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcTdudDR3RRAB",
            "text": "Apple Maps said this place takes card, they said they only take cash! Menu had vegetable egg rolls but they said they only had spring rolls as the vegetarian option. Overall good food and the person at the register was patient. Additionally, I had never been to a restaurant like this that didn’t give a fortune cookie with the meal, this was unfortunate as it was an expectation, made it feel the meal wasn’t complete without it."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNHRfWHlnRRAB",
            "text": "Me encanta este lugar todo riquísimo siempre"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dTlYVWd3RRAB",
            "text": "Excelente comida me encanta"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0eXZDTWJ3EAE",
            "text": "Ordene una comida con un arroz especial de la casa y no puedo creer esto ha cambiado mucho después del 2020 dos camarones en un arroz chino que está pasando en esta ciudad esos lugares ya no son buenos para comer"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbE1qU1FBEAE",
            "text": "I love Chinese food 🍱 For my is the best place to order Chinese food👌🏻\nDelivery is fast I am not complaining.👍🏼\nIt's not that I want the food to fly.😉"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxN3VxVGFREAE",
            "text": "I ordered the boneless spare ribs with white rice taste so good and was delivered to me fast the women who picked up the phone was also nice !"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNks3bmtnRRAB",
            "text": "La mejor comida China del área, limpios, buen servicio y rápidos"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKamZuUEhnEAE",
            "text": "Good service"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dGJxNVBBEAE",
            "text": "No bueno"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcUlYWlJnEAE",
            "text": "THE WORST CHINESE FOOD EVER….\nMe and my family all got poisoned and I have been throwing up and with a stomachache since last night..NEVER EATING HERE AGAIN!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeS1XNXVRRRAB",
            "text": "I been doing take out with this Chinese restaurante for the past 16 years ! I love them & their food !"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbzZfY2t3RRAB",
            "text": "La comida es rica y económica, el servicio es rápido. Me gusta mucho para comer cuando no tengo tiempo de preparar"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeWNqS3F3RRAB",
            "text": "Para comer algo rápido y economico"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbEtmNXlRRRAB",
            "text": "Really love this place order all the time."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNEpyRm9RRRAB",
            "text": "La comida deliciosa y buenos precios"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlZ09lTjBRRRAB",
            "text": "Great food, friendly staff."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlakllQmhnRRAB",
            "text": "Good Chinese food all the time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeE1qdGdnRRAB",
            "text": "These guys got fake reviews … people saying good drinks and food what are you talking about ????lol they got homemade ice tee probably using sink water and sodas … anyway horrible people they treat people like peasants and the food not even…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPNXJlcEZREAE",
            "text": "I love the chicken wings from there"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyeV9xNC1RRRAB",
            "text": "Drinks were great. The food was fantastic"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcU5Qckh3EAE",
            "text": "Delious efficient food services no long waiting"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXN2I2ZlJ3EAE",
            "text": "Honestly one of the best in NYC💯"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXM3Bxak1REAE",
            "text": "Super good food flavor and reasonable price the staff super gentle and the delivery super fast and hot\nI miss them but recently we move and they dont deliver over here even if its close 😪…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXc01mMTBRRRAB",
            "text": "Not bad at all !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpeTVIZ3dnRRAB",
            "text": "Best Chinese food in Corona! Service including deliveries are always super fast. Their food is always on point- I always order their shrimp & broccoli and my bf always orders their pork fried rice & chicken wings. They also offer vegetarian…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndF82SjNBRRAB",
            "text": "I was raised in Corona and this Chinese restaurant was literally the epitome of my childhood. There is nothing you could go wrong with this place. The prices to me are very fair, because of how the food just taste so good! I know that fried chicken isn't really Chinese, but this restaurant right here, knows how to whip up some great fried chicken!!!\n\nNow living in Miami, I miss a quality of a New York Style Chinese restaurant and I always compare any Chinese restaurant from Miami to Double! Double has literally never failed me. They will always give you a meal that will make your hunger shut up!\n\nSo go ahead and treat yourself! 👍🏼"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZLXBfWi1nRRAB",
            "text": "There are 2 types of Chinese food. Fancy elegant restaurants and Mom and Pop shops. I prefer mom and pop shops. This place is the best as far as the latter goes. There are 3 Chinese restaurants within a 5 minute walk of each other and I have eaten at all 3. Very similarly priced to each other but the quality at Doubles is the best and the flavor is the best.\n\nGo to Doubles if your hankering for some Chinese food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJdnZxUTVnRRAB",
            "text": "This was a very decent place I loved it the food is delicious they make it really quick and the prices are good. It is clean and a bit small but it is still one of my favorite places to eat. Loved my experience there! 😊…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNDVHY1BBEAE",
            "text": "Always good just stay away from the shrimp not cleaned front/back gotten a bit pricy from back in the day but sill so good! Best seseme chicken around! Love shuffling back and forth between beef and broccoli or chicken with broccoli! My girlfriend always gets fried chicken"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNTVhR2Z3EAE",
            "text": "The food here is so yummy!! I recommend the shrimp and broccoli in garlic sauce. So good and so fresh! Plus the delivery was super fast! I will be ordering from here again"
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbHNlLVdnEAE",
            "text": "I absolutely love this restaurant, their food is amazing.  I usually get the Diced Chicken with Garlic Sauce on the Lunch menu and it has been the best that I've had so far.  Anytime you're in Corona make sure you check them out."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3Nzc3Q093EAE",
            "text": "THIS PLACE IS AMAZING sorry but it seriously is!!!! I usually get chicken wings and white rice it makes my day!! My family likes sesame chicken or whatever its called but this place is amazing!!! Too bad you dont live in the area 😋😋 they might not have bathrooms but that doesnt matter because the food is so delish that you forget about everything that bothers you!!! Visit this place asap and reasonable prices. If you order rice it might look small but that little pot of rice feeds my while family of 5! ( big amount ) if i could id rate this place 1000000000 but i cant 😐😐😐 but visit this place asap and btw its very clean ive seen how they cook and all and plus quick delivery it takes like 8 minutes max to get your order!! So yep visit this place it is AMAZE so yeah and follow my best best friend purplebananaslime on instagram she moved away from me😣😣😭😢 but nevermind that and subscribe to my OTHER friend who also moved away on youtube e and v time so yeahhh order from this place its amazingg!!!so yass oh and if you follow or sub any of my friends make sure to comment or dm them i came here from google maps so yeah this place is 1000000000000 stars!!😀😀😁😁😇😇🖐🤘👍👌❤❤❤"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcjY3RVFnEAE",
            "text": "This was THE WORST Chinese food I’ve ever eaten in my life. The sesame chicken was terrible it was hard and tiny. the rice was super hard and tasted like box rice. It was just bad. And the dumplings were dry af"
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNjdLTThnRRAB",
            "text": "Good foods & good delivery service, price is pretty reasonable even for an Asian cuisine critic as us. We have ordered mote than 20 times since we are stayed in the area last year. Reasonably Recommanded!"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNXFhZjJRRRAB",
            "text": "Definitivamente    no me gusto. Hace como un mes fui a traer comida y el muchacho que estaba  atendiendo   estaba escurriendo de sudor!!  y solo se limpiaba con la mano o a veces el sudor caía libremente por su cara , asi estaba despachando la comida.Definitivamente no vuelvo a pedir comida en ese lugar."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjMXZXOFBnEAE",
            "text": "Clean where you can visibly see them cook your food and everyone’s orders, friendly, and the food is SO FRESH!  Excellent service.... they are always busy!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcXFDT29RRRAB",
            "text": "Food poisoned me n’ my family after ordering last night. Had to stay up all night in pain and nauseous. Awful. Greasy. But friendly service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdHJiSzN3RRAB",
            "text": "Excellent food. Fastest delivery. My delivery guy runs to the door literally lol. Food is delicious and it has to be the best chinese food in Queens!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdThmTWFBEAE",
            "text": "Best Chinese food in all of corona I've been eating here for the last 17 years and they have always been number 1 I recommend their boneless chicken with fried rice"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJNmRhWll3EAE",
            "text": "I ordered shrimp lo mein and hot n sour soup. it's awful.. shrimp lo mein has no taste but lots of sugar in it..  hot  n sour soup is not hot or sour... I will not order from this restaurant again..."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRc3RLb2pBRRAB",
            "text": "This place is awesome! The staff is friendly and the spot is really clean! I'd recommend to eat here if your around the area!!!!!"
        },
        {
            "date": "9년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3aEltZHJnRRAB",
            "text": "Me gustaria darle mas estrellas pero lo unico que no me gusto fue que cuando llame y pregunte por el tiempo me dijeron que en 30 o 40 min ..…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMWV2Vk93EAE",
            "text": "Clean looking place, tasty food, very nice staff and a good satisfying portion on the lunch special. Also the prices are decent."
        },
        {
            "date": "13년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcWNTNTdRRRAB",
            "text": "Delivery-food always arrives warm.  Best take out in the area.  Fast, friendly delivery guy."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnLXI2anBBRRAB",
            "text": "Great customer service and most of all important great, delicious food 😋😋! Fast delivery always warm at arrival and Friendly delivery guy.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLOHV5NUlREAE",
            "text": "BEST CHINESE FOOD SPOT IN QUEENS ! Been going there for my whole life , nothing beats this place , 100% recommended"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDNmNtYU53EAE",
            "text": "You guys have to try that teriyaki chiken,i've been ordering since 2007 and they still have the original recipy,i love this place"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUM4czdJSBAB",
            "text": "I order here every week! I love DOUBLE CHINESE!! I RECOMMEND THE HALF FRIED CHICKEN WITH FRIES!!😍😍😍…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNteHZhTFd3EAE",
            "text": "Delivery took few minutes, the food was low on salt and taste very delicious."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0dmREUEdnEAE",
            "text": "Love the food they always give fresh food not cooked over and over again💖…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMkxDcHJ3RRAB",
            "text": "Great Chinese restaurant. Always order from there. Delivery is pretty fast."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpNzRYYlRREAE",
            "text": "Everytime I try and order food from this restaurant the man who answers is extremely rude and impatient. They should fire him.  He has no phone etiquette. I would never order from here again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMmNiWXJnRRAB",
            "text": "I like ordering from here the food is good and the people are very nice and helpful."
        },
        {
            "date": "9년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRME1DVU1BEAE",
            "text": "La comida esta rica y se ve que si esta limpio el espacio,  pero No atienden bien"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2N29hTVR3EAE",
            "text": "Used to live in 103rd and still thinking about the taste of this take out Chinese foods 🤤…"
        }
    ],
    "reviews_count": 68
}