{
    "name": "Awang Kitchen",
    "place_id": "ChIJSy7wWlJewokRI5deNKFavzM",
    "grid": "QN4",
    "address": "84-05 Queens Blvd #1C, Elmhurst, NY 11373, USA",
    "rating": 4.6,
    "user_ratings_total": 598,
    "phone_number": "(347) 492-9264",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZd1ZFNHhkRE15TmxSbVVYZFpOM1JNTVRVNWRVRRAB",
            "text": "This restaurant pairs perfectly with family time nearby. Great cooking at accessible price points. Lots of workers keep this restaurant functioning with consistent kindness. The serving size here is notably generous. My time spent here was delightful."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVWRGQm9TbGsxYTI5MFpWTlRhbFJxTUZaR1VXYxAB",
            "text": "Good food and excellent services"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUFNGRnJNRWRtT1VkV2RUVkRSSGRxWXpKWlluYxAB",
            "text": "I went to this place with my Indonesian Friend and ordered Pregnant meat ball Soup & spinach sauté & finally a dessert &\nO.LORD did I fall in love with  it !!! It amazing and will go back in a heart beat. Definitely endorse this place. Must check it out. ❤️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcGQzZHhPVm8zUjJ4eE0yMVVSbVowYTJGWldXYxAB",
            "text": "Very good food"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdFpVSTFOMkl4YkVaWWQxQnJOMVJYTWtwRVZGRRAB",
            "text": "Place is nice, the service is good but the food is fairly OK"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNGVtaGhaSGxWVFhWSExWTnlaazA1ZEhwMFowRRAB",
            "text": "Each meal here feels worth the price and the calories. The pricing, portion generosity, food quality, and service standards deserve praise. The cuisine was delicious, yet Awang Kitchen really shines with its reasonable costs and attentive team. Each selection pleased our entire party. The price is fair for what's provided."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTlIxSkZNMjB5T1VGTk5qRXdOa2R6VjA1RVdGRRAB",
            "text": "A novice to Indonesian food and I’m already loving it!\n\n-Nasi Telor Komplit Dengan Rendang and Ayam (Rice plate with beef Rendang, eggs, and fried chicken): The eggs can be cooked to your liking and I chose runny and it’s doused in some kinda savory sauce. The fried chicken is crispy and well seasoned. The beef Rendang is slightly dry (I blame the cut of meat) but the coconut sauce was really good. Love this!\n\n-Gado-Gado Jakarta (Mixed Steam Veggies): fresh steamed veggies, tofu, tempeh, rice cake, prawn crackers, served with a peanut sauce. Who knew blanched veggies would be this good?! The peanut sauce was sweet and creamy. It was the perfect accompaniment to the veggies. Highly recommend!\n\nThe food was really tasty and fresh. It was a good value too because I can make two meals out of it. Would return to try more dishes for sure!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsc2FVZG1RVmcxTm1wS1RqTmlaRUZoTkRBd1RWRRAB",
            "text": "Good Indonesian food and rich of taste , traditional taste\nFresh ingredients and quality of foods of taste\nRecommend to find Indonesia food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRU1FOUtTWFp3UWkwMVVrNVhYMHhpZGpsd1luYxAB",
            "text": "The food quality here stands above other nearby spots. The kitchen delivers excellence and the staff delivers professionalism. The place feels welcoming with helpful servers and straightforward design. The personnel showed friendliness and responded rapidly. Awang Kitchen exceeds normal expectations."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ab2NqTXRlRUV0YWpWMldGUllUSFZRWlhGd1ZVRRAB",
            "text": "The food is so good! I’m Indonesian and this place is authentic !!! Will be back soon"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wZmNIUkphVll3Y0dGeVRtVXpPVTVvVlVkSmJFRRAB",
            "text": "Thank you ko Awang for making the best Gulai Kikil in NYC... Definitely One of the best Indonesian Restaurant in NYC esp food from Jakarta..."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wQ00zRlJabEZ4WTNCaExYUXhVV1ZRVjJsNVVIYxAB",
            "text": "The food was alright.\n\nI got the nasi bungkus padang with beef rendang, chicken satay, and the nasi goreng with salted squid.\n\nThe food reminds me of home cooking but the flavors of the rice wrapped in banana leaves was a bit plain. The beef was a little overcooked and stringy but the sauce was fantastic.\nThe chicken satay was great and have no complaints.\nThe nasi goreng tasted monotone, the rice was a little soggy.\n\nThe service was good but plates need to be cleaned better."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WS0xVazRjM3BOY0dzNGQxWm5VV1pJYlVGVVUwRRAB",
            "text": "The people here contribute to the ideal atmosphere. What little we ordered was acceptable in quality. Awang Kitchen excels with its position, employee helpfulness, and fair rates. Employees provide superior assistance. The complete experience here is worthwhile."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSVlsRnJlblowVkVsa1VWcEdSRVo0UkZkbU4zYxAB",
            "text": "Amazing place, good service, good food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSVZXNDBXbEYwYzJRdE4xazRiVmx1V1ZGTFpFRRAB",
            "text": "Love the food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUE1XMUhiblJoVFRoNFh6WjFWMlptWW5sMExXYxAB",
            "text": "Small portions, $27 for 4 pieces of beef in the randang, $22 for an over cooked short rib, not worth the price. Everything was over cooked and over salted"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbFNVMU9RbWhDVUVkU1dqVlZjMkpMVkdwVWFHYxAB",
            "text": "I've been ruined for other restaurants after tasting this. The interior space is well utilized. Their food impresses without breaking the bank. Our worker's friendly jokes created a good atmosphere. Just, I love this place, and I know you will love it too!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eVRXcElZbGxJT1RoTmJVaGFMVmhoYTI1VVYyYxAB",
            "text": "We were recommended this place by an Indonesian, and it surely did deliver! Compared to Indonesian food in Manhattan, this was much tastier, beating our expectations and restoring our impression of the cuisine. The savory fish cake appetizer and the nasi bungkus padang with beef rendang was so good. The chicken noodle water spinach wasn’t bad but I would’ve preferred getting another nasi dish instead, as the noodles were soggy. The food was also super affordable, costing less than what we typically spend for lunch even with appetizer, two entreés, and dessert."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeGJFbElSVzlNUTE5S2JqVnBha05PTFdkRmNYYxAB",
            "text": "Quality cooking here"
        },
        {
            "date": "2달 전",
            "language": "id",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMmMwSkdNWEF0ZW5SRmNuTnBRVzlYYVdjNFgwRRAB",
            "text": "Jauh-jauh kesini pengen makan makanan indo & berkunjung ehhhhh!!!\nTapiiiii\nGa ada host susah buat walk in karena server jarang di sekitar meja makan, Makanan keluar ga urut, dessert di pertama (sama kyk disuruh pulang atau penutup hahaha), kedua makanan yg keluar main course nasi komplit (telur nya mentah & amis), ketiga makanan yg keluar soup (Soto hambar dan ga ada kondimen kecap, garam dll), terakhir makanan yg keluar appetizer (Batagor) harusnya ini diawal. Ruangan panas, dan ga ada tanya kepuasan pelanggan gimana! Server cewek bener bener jutek, dan masa bodo atau ga peduli dengan pelanggannya hahaha! Ga cek meja yg penting makanannya udh di served hahaha\n\nBtw thank you untuk mas server cowok yg baik hati dan friendly 🫶🏽 sukses selalu ya!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNzVUemxnRRAB",
            "text": "The best for Indonesian food in NYC..love it 👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cc1JsSk1UMmxJVEhWdWRrOURaV3BqZURKb1JFRRAB",
            "text": "First time trying Indonesian and either everything slaps or I just happened to order the most cracked-out delicious thing on the menu.\n\nStarted with the rice and eggs, expecting something savory, and got hit with sweetness — instantly hooked. Every bite kept getting better. And the amount of protein they packed in? Ridiculous. Two eggs, beef, and fried chicken?\n\nGIMME DAT💥💥💥💳"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWR1VsaG5hVTlxTldseWREWnZVMWRHUldkaE1IYxAB",
            "text": "They serve pigeon instead of chicken the meat is super small and the inside is dark . Please remember chicken is dry"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdy1XbmlBRRAB",
            "text": "I loved their food. It’s simple and smooth to your stomach. Went for the second time and it was great too. The skewers were average though."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcVpGSlNWRjkxTkd3emVrWkZZbFp5YmpGVGFIYxAB",
            "text": "My mom told me that the server (lady) was sarcastic with hat on July4th 2025. This place is famous which celebrities pictured them on the wall. Do not forget people who are not famous! Treat them same. We came with our rental driver named Andy Liau .\nOverall I satisfied"
        },
        {
            "date": "4달 전",
            "language": "id",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSWIyVjZiV1p2TWpnd2MyZFRka1o1UzJJeldVRRAB",
            "text": "Seng ada lawan... keep it up"
        },
        {
            "date": "4달 전",
            "language": "id",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQ1RXeE5lbmxXWldSaU5GSnZka0ZoVDBsb1MwRRAB",
            "text": "Kita nyobain iga bakarnyaaaaaaa juaraaaaa 🔥 rujak cingurnya best!! 🔥🔥 ga ada obatnya disini. Udh paling enak makanan indo di NY"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQk4xcDNWbFV0VUZCWmNFMVBNM2hqVld0Qk5GRRAB",
            "text": "The best asian food in new york 🍲…"
        },
        {
            "date": "5달 전",
            "language": "id",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMFgyOXNjSGh2VTJSVU5FbHlXVTlUUzB0ZmVFRRAB",
            "text": "Rasanya indo banget. Ada nasi bungkus"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQdTRrN09IMVBxcmx3RRAB",
            "text": "Rendang and satay were awesome. Looking forward to trying again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZmkydEtaNnRtaHlRRRAB",
            "text": "Marvelous.....! 👍👍👍"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaVlEU2p3RRAB",
            "text": "Fried banana and Ice Teler best way to end the night"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMVAtN2xRRRAB",
            "text": "Went on a solo date here. The food is good. The wine was also good. I’d say they didn’t put a lot of meat in my goat soup. The customer service is nice. It’s kinda awkward because it’s a small setting so no privacy while eating your meal but it’s nice place overall."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbV9mUTd3RRAB",
            "text": "Going to keep coming back here. The food is delicious and comes with attentive service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc2FMMnp3RRAB",
            "text": "This was my first time visiting this restaurant it came highly recommended by several friends and family members and boy did it not disappoint. The food was amazing had the beef rendang, fried duck and chicken satay. Everything was 10/10. The only comment I have is the portions are small"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJb196N0tBEAE",
            "text": "Craving for Indonesian cuisine? This is one of the right spots. This restaurant is in one of my top 3 lists.\n\nI just love Indonesian food, how the cuisine is so rich and the spiciness of their foods. And in order to satisfy my cravings I need to find the good ones. And given they have good reviews, it lives up to it.\n\nWe would always order Nasi Goreng, Satay Chicken for appetizer, also Fried Fish Cake really is good, must try! But my go to would always be either both or the Satay chicken with that peanut sauce, it’s just so good. Soft Shell Crabs are one of those dishes you’d really wanna order whenever dining in! Also if up for chicken option, Crunch Fried Chicken comes with rice and some soup a good option too!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN2JTbkNREAE",
            "text": "Great place for your Indonesian fix. Especially if you're from Indonesia and feel a little home sick or just miss the food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdE51SGlRRRAB",
            "text": "Great food and great service. I’ll definitely be back to try the rest of the menu"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJME1Hc193RRAB",
            "text": "Awang Kitchen is hands down one of the best Indonesian restaurants in New York! The flavors are authentic, the portions are generous, and the food is always fresh and delicious. I highly recommend trying the Mie Ayam, which is perfectly seasoned and so comforting, and the Nasi Goreng, which has that perfect balance of smoky and savory flavors.\n\nThe staff is incredibly friendly and welcoming, making the whole dining experience even better. Even when it’s busy, the service remains top-notch. If you’re looking for a taste of Indonesia in NYC, this is the place to go! Can’t wait to come back and try more dishes."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJME82QW9nRRAB",
            "text": "Authentic food with good vibes ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3N3RqQTdRRRAB",
            "text": "Tried Indonesian food for the first time and loved it! Had the Nasi Bungkus Padang and Gado-Gado Jakarta, both were packed with flavor and the portions were massive. Will definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3el9ISU5nEAE",
            "text": "I came all the way from North Carolina to try this place, and it did not disappoint! The food was absolutely delicious, and I’ll definitely be coming back soon. The service was outstanding as well.\n\nI ordered the Hot Plate Tumis Kangkung Belacan and asked the server to make it extra spicy and she happily agreed. When the food arrived, it smelled amazing!\n\nTip: Order a side of white rice!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRemU3d1lnEAE",
            "text": "Amazing food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMWVhOThBRRAB",
            "text": "Softshell crab lunch special"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBM3JUdWlBRRAB",
            "text": "Compared to other Indonesian joints, this place has the most range of dish. I had bakso and it reminded me of home."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmai1XaGdBRRAB",
            "text": "Great people, good foods"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNTVLYkNREAE",
            "text": "Best way to entartain your tummy need🤠🤠 The green chili beef tongue was thunderous!!! Love this place"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbThybWRREAE",
            "text": "WOW! Every bite of every dish was incredible! This restaurant gets a perfect score for sure. Yum yum!! Super affordable too. Fried tapioca cake was delicious as was the tempeh mendoan. Lychee sodas was mouthwatering"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMy1LYTBBRRAB",
            "text": "Legit Indo food! Glad to have found this place! I keep coming back every time I'm in NYC because I can't get this out west.\n\nGoat curry is the GOAT. Beware of the green sambal that they put on the balado dishes, it's deadly. They also put it on the nasi bungkus, so avoid that if you can't eat spicy food. (If you can, so much the better!)"
        },
        {
            "date": "10달 전",
            "language": "id",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmLVpYZlBnEAE",
            "text": "Pisang bakarnya enak"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNFpyNDBnRRAB",
            "text": "Craving satisfied! After church, we were craving Asian food and decided to try Awang Kitchen. So glad we did! We ordered the Beef Rendang, Nasi Goreng Tektek, Mi Goreng Tektek, and Batagor. Everything was delicious and served piping hot in about 10 minutes. It wasn't busy at all on a Sunday afternoon, so we were seated right away. Wonderful experience overall!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcHVPa0R3EAE",
            "text": "One of the best meals I’ve ever had. My Indonesian friends brought me here and ordered for me so I don’t know the names of the dishes, but all the food was fantastic. Attaching photos :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidUlDYzVRRRAB",
            "text": "If you’re craving an authentic Indonesian cuisine, you need to check out Awang Kitchen! ✨🌟\nI’ve been coming to this spot for a long time, and it never disappoints. The food is genuinely authentic and so flavorful.\n🍽️ Why I Love Awang Kitchen:\n* Extensive Menu: They offer a wide range of traditional and homey Indonesian dishes, so there’s something for everyone!\n* Generous Portions: The food here is not only delicious but also extremely affordable with generous portions.\n* Friendly Service: The staff are super friendly and always make you feel welcome.\n* Laid-Back Atmosphere: The atmosphere is relaxed and inviting, perfect for a cozy meal with friends or family.\n\nFeaturing:\n-Stuffed Fried Tofu\n-Fried Tapioca Cake\n-Crunchy Fried Chicken\n-Fried Calamari salty egg sauce\n-Chicken noodle water spinach Hot plate\n-Ice Teler\n-Avocado Milkshakes\n\nFollow @spinx17 for more NYC food recs!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdFB1d25nRRAB",
            "text": "Walked in and was immediately able to find a table. A waiter came ti serve me and I gave my order very fast. Ordered the Fried chicken. The food was good and the sides were good too. The customer service was also good. The hot sauce was just red Chilli on the side. Could have been maybe a bit spicier. Overall - 8/10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMczVqU0NnEAE",
            "text": "Indonesian here 😁. It's my first time trying Indonesian food in the US. We came quite late but we were served pretty quickly. We ordered mie ayam dan bakso. Both tasted exactly like what I had in Jakarta. I guess the meatballs are home-made which for me is tasty and chewy. Mie ayam has a lot of toppings : mushrooms, chicken, meatballs, pangsit (wonton's skin crackers?), fried shallots, and some veggies. They also had teh kotak. Overall, the mie ayam and bakso we had were authentic, service was quick and nice. The owner, Pak Awang seemed really friendly and he greeted all of the customers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUN4bU90aRAB",
            "text": "There aren't too many Indonesian restaurants compared to other cuisines in NYC. The food here is pretty good. The crunch chicken has a light coconut taste that I really like. The beef is okay, not really spicy. The only thing I don't like is the vegetable on the egg; it has a strong mustard taste. The restaurant is pretty small. Service is quick."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbElmZk9REAE",
            "text": "Love it!\n\nSuper yummy Indonesian food and fresh sushi for all of you. I have been here twice and so far we have tried crispy fried duck with green chili, ketiprak, ayam kalasan, meat ball soup, tahu isi or fried tofu with veggie filling, spring roll, tahu gejrot and spice tuna roll.\n\nAll is delicious! And they even have more on the menu :).\n\nThe place is pretty much nice, clean and well-lit too. The staff are so friendly, and even the owner often comes out and greet the guests.\n\nThe price is manageable, ranging from 2.99 to 24.99 for steak.\n\nHighly recommended! More than happy to be back here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNGFqandBRRAB",
            "text": "I got ketoprak, tempe mendoan and es doger for my dinner while my friend have some duck and something else I forgot. We went back the next day for lunch and we have bakso malang, bakso urat and bakso beranak and of course es doger. I always recommend my friend when they go to new York to dine at Awang kitchen. Highly recommended."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzd2JPMDNnRRAB",
            "text": "For those who are missing Indonesian food, you need to try Awang Kitchen. Their Sambal Ijo Lidah Sapi Nasi Padang amazingg. I loved also tempe mendoan and batagor.\n\nAnd sambal cobek enak. Parking is easy, just aware free parking 15 mins. So if take away, aware for the parking time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlckw3dkV3EAE",
            "text": "My pregnant meat noodle soup dish was blah but hey everything else was amazing! I just need to learn how to order better.\n\nGreat spot for no fuss, eat your meal and be on your way. Would return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXbzh2ZE9REAE",
            "text": "What a nice a discovery! The rijsttaffel was a great way to sample the variety of this restaurant. It's a gentle introduction to the weirder and larger entrees, and it's large enough that it can feed two people, and you can always add more sides. My favorites were the fried cheese/tofu pocket and the fried chicken (and I'm not a chicken person). The marinated meat was a bit dry for me. The food is inexpensive and by the end of the meal all the food in the bowls was gone  :-)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGa2RhODV3RRAB",
            "text": "Mouthwatering Indonesian food. They serve a noodle soup entree (yellow with shredded chicken) that can’t be found anywhere else. I will be back"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdGF2RVFBEAE",
            "text": "We were not familiar with Indonesian cuisine but would like to give it a try, and our friends recommended us Awang Kitchen. It was so popular with no available tables when we picked up our orders on a Sunday night.\n\nTheir options on the menu were various from authentic Indonesian dishes to sushi & rolls. We had their Grilled Pompano Padang, Nasi Goreng Tek-tek / Tek-tek Fried Rice, Ayam Goreng Kalasan (al) / Coconut Marinated Fried Chicken and Gado-Gado Jakarta / Mixed steamed vegetable to share with a group of four with a total of $55, which was amazingly reasonable price.\n\nWe can tell the food was decently their tastes, but just not really our types. We love the fried rice and the sauce from the mixed steamed veggies. However, the chicken and the fish were cooked too dry for us. We were not sure if it's overcooked or it's how Indonesian cuisine is supposed to be to present their protein."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOG8zUE5nEAE",
            "text": "The best Indonesian foods restaurant in New York City, owned by Mr. Awang, this resto is located at Queens area. Almost everyday will full with Indonesia people who missed the original food. They sell lots of various foods, light bites, and beverages such as Pempek, Nasi Goreng, Nasi Telur Special, Sop Buntut, Soto Betawi, Soto Betawi, until Nasi Bungkus and also Es Doger + Es Teler. Must try while in New York."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhckpUSFlBEAE",
            "text": "I’m Malaysian so eating some Indonesian food brings back a lot of food memories. Anything ayam (chicken)is what you want. The fried chicken is fried great if you like to gnaw on bones this is for you. Rendang is a lil wet if you like the dry version but it fit what I like. Goat satay is a new for me delicious. 10/10 will come again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtM3YtU1VREAE",
            "text": "Unfortunately the food was delicious so ate it too fast before remembering to take photos 😂\n\nMet the owner who had to personally explain all the Indonesian specials on the board because they were all in Indonesian 😆.\n\nReally welcoming and homey Indonesian food and good value for money. don't ever eat Asian food in Manhattan it's overpriced! Elmhurst is just a subway ride away!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaS1meWJBEAE",
            "text": "I didn't take many pictures because I was too busy enjoying the wonderful food. The staff was helpful, the food was amazing, and I can't wait to go back. The restaurant is small, but that is not a negative point. I enjoyed that attribute of the restaurant. You must visit!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5MjQzMlN3EAE",
            "text": "Authentic Indonesian food! Our favourite dishes were the grilled pompano fish with padang sauce,  beef rendang and coconut marinated fried chicken. Great customer service and Sapporo beer on draft"
        },
        {
            "date": "4년 전",
            "language": "id",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dEtQVE5BEAE",
            "text": "Senang sx akhirnya bisa dpt resto Indo di NY pas jalan2...\nMaknan benar2 seperti di indo...\nMampir sekali & dan pas balik pulang ke Ohio kita take away sxliab yg banyak untuk bekal perjalanan 😁\nMakasih bnyk Awang kitchen..\nSukses selalu & Tuhan Memberkati owner serta semua yg bekerja di sna 😇🙏"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqemF5Qk13EAE",
            "text": "If you miss Indonesian food, this is a must. They serve lots of variation of indonesian food. However for me it still doesn’t taste very Indonesian and I understand due to the limitation of the ingredients. But overall a great place when you miss home."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNDdyYVdBEAE",
            "text": "Delicious Indonesian foods,  friendly workers and chef, small but it's OK. Little bit pricey but it's worth it."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtbXVlVzdnRRAB",
            "text": "The food served here is absolutely top notch. We tried quite a lot of things from the menu and were never disappointed. Amazingly quick service to. If you're in Queens you should."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbjVxdGtRRRAB",
            "text": "Went here too many times and always bring guests that always got satisfied!  IGA BAKAR COBEK IS SO GOOD its not in the menu but its soooo amazing  and consistent in taste. The nasi padang is not consistent some days are better some days are flavorless."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcGJYMFF3EAE",
            "text": "So happy to finally find real Indonesian food!!! The food and the service were great.\nI wish I live close by so I can eat here more often."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNFpUSjBnRRAB",
            "text": "Average, every dish is ok.  But presentation on Pecel Lele better put together rice in hot bowl. It looksd empty to me.\nAnother Thing krecek in Gudeg too dried.\nGood luck, Another Indonesian Restaurant in New York."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlanVMMm93RRAB",
            "text": "The sauce of the appetizer- chicken satay, was kind of smelly.. kind of fish sauce? I couldn’t hate it more…\nThe fried chicken’s skin was crumpy, I love it. But the inside was lack of flavor, and hard to chew.\nThe lamb stew was great. It’s the best tonight."
        }
    ],
    "reviews_count": 76
}