{
    "name": "New Taste",
    "place_id": "ChIJ1T9csbVfwokRaCIpn048lqk",
    "grid": "QN4",
    "address": "94-62 Corona Ave., Elmhurst, NY 11373, USA",
    "rating": 2.9,
    "user_ratings_total": 74,
    "phone_number": "(718) 592-8728",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204elVHOW1ZMWx6VldwTVFrSjNXRzh6VmpCQlMyYxAB",
            "text": "There is a sign on our building says no flyers, etc. You get in the building somehow and throwing flyers into the apartments under doors, that people upset about it. Next  time there will be consequences"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQ1VsUnhUbEo0T0dOMGEwRlJTMU4wZVZGNVZHYxAB",
            "text": "Gave this place more than one chance because they have a dish I have a hard time finding. I ignored the food poisoning i got the 2nd time I ordered. But I cant ignore a cooked roach in my shrimp fried rice. Half way through eating I see a cockaroach mixed in my rice. Not like it crawled in at the end, but like it was cooked with the rice. It was my 3rd order from this place. Its going to be a day or 2 until i can stomach food again. Nope. Nope. Nope. Nope. Nope. Nope. Nope."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SZldTMVlRMnBxYjFVMmFHeDZhM0ZKV1hSZlJGRRAB",
            "text": "Rude employees who work while sick. Very stingy with soy sauce, napkins, straws"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd09HMXpWR2xHVURSVVExRXhNVGhyUW5KWE1tYxAB",
            "text": "Easily the worst Chinese takeout I’ve had. I ordered online because it was raining, but the delivery driver refused to bring the food to the porch, so I had to step out into the rain to get it. On top of that, the food was undercooked."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWFdIZEJZbkU1U0dkVGFsaFJRWFpUYUhSM01sRRAB",
            "text": "Very rude person that answers the phone and when I’m in the store they always have people smoking in the front. Not an okay environment"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNWRuWk9kMGhuUWxONU5qUTRSMWM1WTNkTk0wRRAB",
            "text": "THIS PLACE IS A DISGRACE DISGUSTING\nDirty menus food as terrible as their attitude absolutely DISGUSTING  waste of 40$ DONT EAT HERE IF THEY ARE GIVING IT AWAY !!!!!!!00000stqrs"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMFNtMTBlVTA0Y1dNNWNWTTVhRGs0VVRkUllsRRAB",
            "text": "By far the worst Chinese takeout I ever had. Ordered shrimp with broccoli with egg fried rice. The order was done in a minute, which should’ve been the first sign of something wrong. They were stingy with the hot and soy sauce. Eggs were burnt, only had 4 pieces of shrimp, for some reason it smelled funny. The man who took my order went out and started smoking so the smoke was coming in with the wind and fan. First time I have ever thrown the food out from a Chinese takeout as well. Do not go here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaDlxRVVREAE",
            "text": "Used to be my go to for wings,  now the wings are the smallest wings I've ever seen while the price is sky high"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcmNxME9REAE",
            "text": "Ordered delivery. Small portions bad customer service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NHZHN2FREAE",
            "text": "Fast and good portions"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnemZuWExREAE",
            "text": "The costumer service is horrible, one of the worst I've ever experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0ODltS0lREAE",
            "text": "I just ordered Chicken & broccoli with white rice with another order of chicken wings and fried rice then they proceeded to give me SHRIMP and broccoli (im allergic to shellfish) and when i called to complain, they told me \"oh you must've forgot that you ordered shrimp\". What a waste of 10 dollars and TIP included."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbmEzR1dBEAE",
            "text": "I Did A Remix With Teriyaki 🍖 and Chicken Low-Mien The Food Not Only Was Delivered Fast The Quality Was Top Tier 💯 ..If U like 🍤 ireccomed 7💫🌕"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwZ0ozRkpnEAE",
            "text": "Food good but the owner 🤦🏼‍♂️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwejZfVG5nRRAB",
            "text": "Been ordering here for more than 20 years and the food has been consistently very good. My orders have never been late nor incorrect, food is very tasty and the price is good."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaEtxTEZREAE",
            "text": "Muy bueno tooodooo"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScjZfUDJnRRAB",
            "text": "I ate a meal that I ordered restaurant and began experiencing symptoms of food poisoning shortly thereafter. this Chinese restaurant uses unhealthy oil in their cooking.  Also as a customer, I expected to be treated with respect and empathy, but unfortunately, this was not the case. The guy I spoke with was extremely rude. They only care abt the penny from your pocket."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtOWVibEtnEAE",
            "text": "This restaurant is #1 at #2"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMydnZYd3RRRRAB",
            "text": "This place Used to be My Local Restaurant of choice until My last Order....Go to Order: Shrimp Fried Rice w/ an Egg and Spare Ribs (Main reason for ordering from here) are the Best. However the Attitude of the Delivery Person leaves a lot…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbUk3THR3RRAB",
            "text": "I got food poisoning after eating fried rice with chicken wings. Also the guy is extremely rude. So please don’t come here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXM3RqTTdnRRAB",
            "text": "Rude employees"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNheklTZzh3RRAB",
            "text": "I’m not sure why all the negatives reviews. I order from here every week. The best chicken wings I have ever had. Also their delivery is very fast. Sometimes i vary from house special fried rice or egg fried rice or vegetable fried rice.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxOUlfZHlBRRAB",
            "text": "THIS PLACE IS A SCAM please read, few years ago they were operating correctly. I recently purchased BEEF lomein and was given seasoned pork to look like beef instead. I thought it was a mistake so I ordered it again with the same result a…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxeUxUaEdnEAE",
            "text": "If I could give them no stars I would ... I called trying to get some food delivered and this man talk so rudely and hung up the phone on me . When I called back he tried to act like he didn't just do that , so I told him I'm not ordering…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLb3E3Tkt3EAE",
            "text": "This is the ONLY Chinese take-out in the area that has Mu-Shu Pork. I just tried it for the first time and it was excellent. The wait was worth it because I knew that they were making it fresh."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNE5MSEt3EAE",
            "text": "Food might taste OK. I wouldn't buy food from here again they use their bare hands to pick up everything from food to phone to mop...speaking of mops one of the employees mopped over my sneakers while waiting for my food... How is this place still open??"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5cFk2Nll3EAE",
            "text": "Fast delivery and I order a lot from them and the food is great"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTcmJTVzd3RRAB",
            "text": "Just had some egg fried rice and found a fingernail as I was chewing. I made sure it was not anything else before automatically saying it was a finger nail but it definitely was. Very unsatisfying. I called to make a complaint their…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpMEt1V1BBEAE",
            "text": "Please note: they are listed on BeyondMenu but they do not actually take online orders! Walk-in or call and cash only. Very confusing experience when I placed an order via the app and then showed up only to have them say they don’t do any online business at all.\n\nAlso docking a star because one of the soup containers (which feel flimsy) has a small hole, thus causing it to leak all over the takeout bag resulting in a very sticky mess when I got home."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVbW9hTU5REAE",
            "text": "Cant go wrong with this chinese spot, great service."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMjdxYWZnEAE",
            "text": "They don’t payed attention"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcmZHUl9RRRAB",
            "text": "First two deliveries were acceptable. Third attempt was a disaster! Ordered fried dumplings, received STEAMED dumplings, sauce was missing. A gooey, sloppy wet mess with less taste than wet cardboard!Called to request an adjustment, order taker hung up. Called back again, \"I don't understand English\"!! I will never patronize this dump again!!! Fast service does not mean \"Please screw up my order\". Thanks for nothing!\nUpdate:  I'm a forgiving soul so I thought I'd give them another chance. Down with the flu so I ordered soup. What do you know, order arrives and soup is missing! I quit!!!"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvb19yRVhBEAE",
            "text": "Comida apestosa es lo peor que e visto y tratado"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvcVpxcTVBRRAB",
            "text": "Rude staff, theres only like one guy who is respectful every time i come in. Food is alright, when in doubt i come here bc its close."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJdGMtbVFnEAE",
            "text": "I cant see how this place has any negative reviews.\nFirst time here today && the food was great for chinese take out; plus their hot oil is actually spicy😋😋😋. The employees were very kind too. Will be returning.…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncGZpRXdRRRAB",
            "text": "Customer service is not good at this place. The guy will never recognize he made a mistake with your order. It is always the customers’ fault."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBelppMXZRRRAB",
            "text": "The new sause they ask is bad. They should have English speaker there not a chinese speaker since I had to repeat my self a lot of time"
        },
        {
            "date": "7년 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRck5DVDB3RRAB",
            "text": "前台帅锅服务不错！"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNneWFHeVZ3EAE",
            "text": "Gave the delivery guy a 3 dollar tip he got mad called me cheap and left. Lol wth??"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNDdLbGl3RRAB",
            "text": "We’re regulars, food always arrives quick, sometimes they mess up the order but they’re quick to fix it."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMi1Ic2N3EAE",
            "text": "Comida  quemada nolo recomiendo y el que  contesta el teléfono  es muy agresivo"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdU9hSmt3RRAB",
            "text": "Very bad customer service, need to learn about hospitality!!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROHR6UmZREAE",
            "text": "My go to place for tasty Chinese food"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReHFHR1B3EAE",
            "text": "Terrible place, so dirty. Friend's or Family owner, no sure (old Chinese guys) , they were watching, walk around & FART FART  front of our table, so nasty, my girlfriend & i walk out after immediately . very bad experience. PLEASE DON'T GO THERE......"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBaVl2U25BRRAB",
            "text": "Food is excellent but the person standing on cash counter today is very rude. I think the owner should change that person because he doesn't know how to attend the customer."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBa2F2T2VnEAE",
            "text": "Love this Food...  Right in my block!"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNVliZ3lnRRAB",
            "text": "Customers service no good..😨😨😨😨😨…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBb182Q0NBEAE",
            "text": "The food is well made and hastily prepared for everyone to enjoy"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnX3R2SGhBRRAB",
            "text": "Love the lomien! The sweet plantin yyuuummmyyy! Fried chicken was so delish!!!"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MmRfTjN3RRAB",
            "text": "rico"
        }
    ],
    "reviews_count": 50
}