{
    "name": "El Guayaquileno",
    "place_id": "ChIJVQxYlbNfwokR-GlMbJGRsgk",
    "grid": "QN4",
    "address": "94-54 Corona Ave., Elmhurst, NY 11373, USA",
    "rating": 3.8,
    "user_ratings_total": 606,
    "phone_number": "(718) 760-4982",
    "reviews": [
        {
            "date": "2주 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGelFTMDFjSFp0VVRscVFWTTNZVkpEUkhsc1UyYxAB",
            "text": "La atención mala pedí agua con mi plato el cual tuve que pedir que me preste un vaso , luego un sorbete, luego la sal bien desatenta la atención no sé si es por discriminación !!! La comida estaba buena la atención terrible"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScFUyNUZibkJ3YTNCVFJqSnROVmRxY0RrNVptYxAB",
            "text": "Don’t order the encebollado de pescado it has a very fishy taste and it is heavy. Probably the worst encebollado I had in Queens."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wZk4xZFFUelZoWDA1WmVYUlVaMlJ1VTFWblFYYxAB",
            "text": "Los chifle todos viejos, malos deben cambiar día a día"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJRy11TW01bXRiTDV3RRAB",
            "text": "La comida es horrible no es fresca es recalentada compré un chaulafan y esa apestaba encima el arroz parecía  echo de 15 días antes y echo pelotas terrible 🤮 y para colmo me querían cobran una comida que pedí y nunca me lo sirvieron y demoran una eternidad"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNXZUcWNREAE",
            "text": "Vine por primera vez intentado pasar un momento  agradable y ellos me entregaron la comida fría con repentinas veces\nNo lo recomiendo , encebollado malo y frío"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNXRTMUtREAE",
            "text": "La comida nada que ver devolvi el plato tres veces por estar frio y me lo traian igual,   la mesera mala atencion estaba apurada por salir, el cocinero molesto devolvio el plato en menos de un minuto, mala atencion mala comida"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMnMzR21nRRAB",
            "text": "La comida muy buena, pero la atención terrible, desde el momento en que llegamos la mesera con una pésima actitud, hasta el último momento, lo cual hizo nuestra visita una mala experiencia."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNGVfMjJnRRAB",
            "text": "El ceviche de camarón es pura agua, no tiene absolutamente nada más que agua y 4 camarones, es ceviche, no sopa. Tampoco tiene gusto, es el peor 👎🏻"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdU1tQWJREAE",
            "text": "Buena opción para probar comida ecuatoriana, pero con algunos detalles por...\n\nVisitamos El Guayaquileño en familia (mi esposa, mi hija y yo) buscando probar algo de nuestra querida comida ecuatoriana. El lugar está bien ubicado, lo cual es conveniente.\nComenzamos con unas empanadas de verde rellenas de queso que estuvieron muy ricas.\nTenían bastante queso y no estaban grasosas, lo cual fue un buen inicio.\nMi esposa pidió un pescado frito apanado con arroz y menestra. Lamentablemente, al pescado le faltó sabor y la apanadura no estaba tan rica como esperábamos. Por otro lado, yo pedí un caldo de bolas que sí estuvo delicioso, muy bien preparado y con buen sabor.\nLa atención fue rápida, aunque notamos que los meseros estaban un poco despistados. A pesar de eso, fueron amables. El menú es variado y tienen bastantes opciones para quienes buscan algo típico de Ecuador.\nEn general, la comida no está mal si se quiere disfrutar de algo de nuestro país, pero creo que podrían mejorar algunos platos para que la experiencia sea aún mejor."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMi1lcmJnEAE",
            "text": "No recomendable"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaHVuTVBBEAE",
            "text": "La comida no es fresca"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRd3ZmYkNnEAE",
            "text": "La atención muy regular, no son atentos y dan por hecho que uno conoce la gastronomía del país y se ve que les molesta que las personas pregunten más acerca de los platos, la comida no está tan rica, relación precio-calidad 👎…"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnb2M2WDB3RRAB",
            "text": "Excellent and fresh Ecuadorian food, we always order lunch special, they have a variety of dishes and all tasty, most of the dishes are coast side of the county style. Cold oatmeal Ecuadorian style is delicious and very recommended. We always go back."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaGFlQWVREAE",
            "text": "Acabo de comprar 2 encebollados les dije que los 2 con arroz y resulta que solo me empacaron uno me cobraron 41 dolares las personas del carro atienden mejor ellos si merecen su tip"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueE9pd09BEAE",
            "text": "Comida súper deliciosa"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaEt5Tnp3RRAB",
            "text": "Over salted food, tried to send back but the cook was stubborn and refused"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdl9ITzRnRRAB",
            "text": "Calidad de restaurante ecuatoriano te sientes como en casita"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcTUycHZ3RRAB",
            "text": "Buena"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2eWVUa2h3RRAB",
            "text": "Excellent bolon!!! Good food !! Like always excellent service. Still good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dGNMV0l3EAE",
            "text": "I always Bolones from here and theyre great everytime :) fast service and kind staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dGRUU0RBEAE",
            "text": "Their prices are high and food is okay. Lacking flavor. I believe they have inexperienced cooks in  kitchen."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NUx6b1FBEAE",
            "text": "Terrible lugar, se equivocaron al hacerme un delibery me mandaron algo que no pedí, la persona que atendió era una mujer cuando llame a hacer el reclamo me trató horrible que no iban a devolver, les pedí que escuchen la grabación en las cámaras pero ella dijo que no funcionaban y no me devolvieron el dinero. Nunca más vuelvo a ese lugar y se lo digo a cada persona que conozco que no vallan allá"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaVAyQ1J3EAE",
            "text": "Llame para un delivery a 8 min de si de estaba y dice q no por q no hacen delivery tan lejos\nEntonces q solo hacen delivery a sus vecinos o q"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMDcyVmVnEAE",
            "text": "This place was terrible. Overpriced and food was not fresh. I ordered Caldo de Salchicha and it was salty it didn’t have cilantro it had scallions!! They also served it with rice? This caldo is not served with a side of rice. They did not give me limes either. I told the waitress and she said the cook tasted it and it wasn’t! Didn’t even offer an apology or an option to change my dish. This caldo also had a pigs feet in it…?!! The quaker wasn’t a Quaker it was too watery. The food presentation was awful I ordered a carne asada with plantains. The one piece of meat was in a plate 4 tostones in a bowl. In other restaurants all meats come with a salad. And the waitress was sweeping right next to our table lifting the dust up…. Just terrible the food was not authentic what a disappointment. I was really looking forward to eating at this place. I came from far … don’t go to this place! Oh and on top of that they wanted $ 18.00 - $25.00 tip!!! lol the nerves…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidHBDTE9nEAE",
            "text": "Delicious 😋 😋 😋 😋"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaEx5QkNnEAE",
            "text": "Pedimos un ceviche y estaba muy amargo, horrible.el caldo de manguera sin cebolla y cilantro,Si vas a vender comida típica de ECUADOR asegúrate de hacerla lo mejor posible y mantén la RECETA original, a la comida típica no se le debe cambiar la receta, no volveremos nunca más."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaWRhYy1RRRAB",
            "text": "Servicio limpio, simpatico y cómodo!\nSabor a Ecuador!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMM3VhY2FnEAE",
            "text": "Soy un cliente constante, que me ido a comer. Pero últimamente el servicio de atención al cliente es pésimo y la comida ya no sabe igual que antes, pedí 2 encebollados para llevar y la verdad sabía como como a ceviche ..no me gustó para nada ya no iré más a ese lugar .."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMUtiZFpREAE",
            "text": "Ordered on Grubhub. Honestly the shrimp ceviche tasted badddd like it was expired. Maybe the shrimp.\n\nThe tripe no flavor and the bollo de pescado same lacking flavor. My 2 year old didn't want to eat it. He was complaining and that's his favorite dish!\n\nThe hot sauce is good but can't order again. Sad."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbzZHb0dnEAE",
            "text": "Pedí 2 encebollados y no enviaron limón en que mente, me toco comer encebollado sin limón gracias…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaVozbXFBRRAB",
            "text": "Terrible .. tanto el servicio como lq comida.. el encebollado el pescado tenia sabor a guardado"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMc3M3bkVnEAE",
            "text": "Muy rica la comida buena la atención"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6c05DNU5nEAE",
            "text": "Muy buena comida y abundante, el ambiente es agradable, te sientes como en Guayaquil."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNkw2aVp3EAE",
            "text": "La comida estaba poco por el precio, y no estaba buena le faltaba sal"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaXRqb3BBRRAB",
            "text": "Pedimos un caldo de bola estaba súper espeso y solo nos dijeron que así es somos ecuatorianos sabemos como es un caldo de bolas el servisio es muy decepcionante ya que no nos sirvieron el jugo hasta después de haber terminado ya la comida deja mucho que desear el lugar se ve aceptable pero deben tener en cuenta mucho la atención y el servicio a las personas que están atendiendo"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEM3FENWNBEAE",
            "text": "El encebollado. Pura yuca por debajo. Nada de pescado  casi , espero q modifiquen eso en el futuro.  La ultima vez saque casi la mitad del tarro de yuca"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MV9EcnNRRRAB",
            "text": "Camarera atiende con cara de puñete, propietario ponga atención que hay gente con ganas de trabajar fuera."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaktxTFhBEAE",
            "text": "La atención y el lugar son buenos, los platos son grandes pero la sazón es sin sabor, ni sal tenían las carnes y en el lomito saltado la carne es la de peor calidad que pudieron encontrar, llena de cueros y dura. El plato se quedo entero…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNXMtWHdRRRAB",
            "text": "Omg!!! I freaking love this restaurant! My mothers side is from Guayaquil & I always loved her & my grandmothers food until I came here. Their service is great! So far their dishes are almost better than my grandmothers cooking and that’s a lot coming from someone who only use to eat homemade Ecuadorian food. I can’t wait to try all of their dishes! I came on a Sat. night for the first time and it was so good I came back on a Monday night lol!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWb1o3cFFBEAE",
            "text": "The purpose of this review is not to hate or harm this restaurant in any way, shape, or form. That being said, I hope you take this review as an informative review.\n\nAtmosphere: The restaurant's exterior and interior are well organized. Clean for the most part. However, the music they have there makes it feel like you're not in a restaurant but in a nightclub.\n\nService: Honestly, service was okay. I went there because my cousin invited me. I did not feel like the waitress went beyond to make us feel at home. In other words, it was an average service.\n\nFood: I ordered the Guatita, and my cousin ordered the Encebollado De Pescado. They tasted okay, neither bad nor good. I felt like something was missing, probably a little more flavor.\n\nPrice: It could just be my personal point of view. Considering the factors mentioned above, I think their prices are kind of high. You can go ahead and experience it yourself. You may have a different point of view."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoaUkzUGN3EAE",
            "text": "La comida excelente,restaurante muy limpio.\nEs la segunda vez que voy,la primera vez me atendió una señora muy amable,esta vez no tuve mucha suerte\nLa atención fue pésima!eran otras chicas las que me atendieron,con cara larga,súper desagradables! se me derramó mi jugo sin querer y lo único que hicieron fue tirarme una servilleta a la mesa y nos dejaron sentados en esa mesa sucia llena de jugo,yo siempre trabaje como mesera y si a mi cliente se le derrama algo lo primero que voy a hacer es dejarle todo limpio!! Es sentido común.\nTodo muy excelente es un buen restaurante pero deberían mejorar su servicio."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLU1EU3hBRRAB",
            "text": "Definitivamente se siente como si uno estuviera comiendo en Ecuador  🇪🇨\nExcelente comida, excelente servicio y muy buen ambiente!\nSuper recomendado!\nViajo desde NJ hasta NY solo por el caldo de salchicha! ♥️"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3MGNtOEtBEAE",
            "text": "Nice clean place ... but coming from an Ecuadorian background I was not to please with the place .. ceviche was very bland although they give you lime juice on the side I made due and came with  nothing for a side had to order a side of…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOHBldXhBRRAB",
            "text": "My first time there (I go to my mom if I want ecuadorian dishes). I was truly satisfied with the combo guayaquileño dish. The bolon had the perfect amount of chicharron while the beef, it's sauce and the two sunny sides gave it the expected flavors of that dish. Had the quaker. Wow! Never had it w the maracuya. Delicious. The morocho was also great. There were 8 of us there and we were all completely satisfied! Staff were great too. Friendly and always checked in on us. Definitely will go again soon!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOWVETHhBRRAB",
            "text": "Super rico , incluye arroz y maíz tostado , chifle se vende por separado, gaste $41 por 2 encebollados con chifle y quaker ( también estaba rico) lo recomiendo !!! súper amable la chica que me atendió :)"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtakpYR3J3RRAB",
            "text": "Pésima atención al cliente… pedi una orden en uber eats y me enviaron la incorrecta, la señorita le hecho la culpa al driver diciendo que el se había equivocado sin embargo ella fue la que grapo y escribió los nombres en los tickets… El driver tuvo que regresar a darme la comida correcta porque la mesera se equivoco."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4LVpUcXlBRRAB",
            "text": "Encebollado con poco pescado 🐟 y con tostado guardado, porción de chifles 3 usd guardados y mal sabor la verdad parecen reutilizados, lo siento hay mucho que mejorar, este restaurante no me representa como 🇪🇨"
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eXBiTzB3RRAB",
            "text": "Food truck  in\nEl Guayaquileño Food Truck #1\nLa esquima del sabor\nWarren St & 40th Rd\n\norder chivo looked like jello October 21,2023"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtaDdUSktnEAE",
            "text": "La comida guardada y con mal olor a parte la atención pésima las meseras groseras"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaWZpRU93EAE",
            "text": "Sopa de bola was so good...loved it...\n\nThe cold beer was the icing too..."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWOTlEVzZ3RRAB",
            "text": "Deberían cambiar de Mesera. la chica que atiende es super ruda. mala atención se ve que trabaja por obligación que no le gusta lo que hace, apesar de cobrar un porcentaje de propina no trabajan bien!  la comida no está mal el lugar tampoco! pero al ver esa mala cara que te hace la mesera ya uno se siente incómodo. antes iva más a menudo con mi esposa mis hijos mis padres ahora ya emos dejado de ir porque toda mi familia se siente incomoda! hoy en día visito mucho la Hueca otro restaurant ecuatoriano donde el trato es contrario al de aqui. espero puedan cambiar en ese aspecto y poder visitarles más adelante ! suerte."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bzRqRklBEAE",
            "text": "Definitivamente es como volver a tu país! La carreta también es muy buena. El encebollado es muy rico!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBd2VDeTN3RRAB",
            "text": "I absolutely love eating at this quaint little restaurant the food is amazing, I order something different each visit and have been quite  pleased with all my selections,  so far so good...I'm giving this place a 5***** rating because it…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcGE2N2N3EAE",
            "text": "Pedi un delivery y le dije a la muchacha por teléfono que el huevo bien asado bien duro y me responde que ellos asan que ellos fritan yo creo que ella entendió desde el principio a lo que me refería pero solo quiso ser grosera y contestó mal.\nMe llegó mi delivery y con el huevo mal frito, si yo pido delivery es para no cocinar en mi casa y me toco ponerme a fritar el huevo nuevamente en mi casa."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHei16ZHVRRRAB",
            "text": "Coming from an Ecuadorian, this food is very good. Their grilled steak is very tasty. It even has grill marks on it. No complaints. If the prices were a little cheaper it would be even better. It is well worth the price!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aHNLTE1REAE",
            "text": "We discover this restaurant on google search after picking up a friend from Ecuador that haven't eaten ecuadorian food in a long time, so we brought him here straight from the airport. We ordered the encebollado, caldo de salchicha, seco de chivo and guatita. The encebollado and caldo de salchicha were excellent, the guatita was ok, and the seco de chivo was so so. Overall good food, but I won't be ordering seco de chivo again.  Fyi, Caldo de salchicha is only available on weekends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbDZicW93RRAB",
            "text": "Sharing this rating for my father who does not know how to leave a review. I would leave 0 stars if I could. My father and I went Sunday for Father’s Day and he had an encebollado and he is still suffering from Sunday… it is Tuesday and he…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpaGUtblVBEAE",
            "text": "Ya he pedido 2 veses y me encanta la comida, el envío viene bien ordenado, la comida caliente, las porciones bien generosas, no soy de ordenar mucho comida por entrega, pero definitivamente  la comida de éste restaurante me encanta 😋😋.creo que no ordenare ya más en ese sitio las 2 últimas veces que he ordenado la comida llegó fría y pedí un pequeño cambio en la orden y me dijeron que NO, pierden clientes por no complacer a la clientela , esas lentejas estaban que parecía agua voy a tratar otros restaurantes ecuatoriano.bueno,he tratado nuevamente y\nEsta\n\nordené el seco de chivo la carne durisima imposible de comer. Es un lastima  que  entreguen la comida  mal hecha"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxZ0pEUzZBRRAB",
            "text": "Only reason I’m putting one star is because both of the waiters that were serving my brothers and I were very rude and in a way were rushing us to decide what we want and to leave quickly.\nSince that’s what we felt we decided to make the food to go. We ordered 2 encebollados 2 chaulfanes and a ceviche de camarón. Come to find out the encebollados don’t come with chifles? If you’re a real Ecuadorean you know that every encebollado comes with chifles.\nFor the price that we paid we atleast expected that. Food wasn’t bad but wasn’t the best either. We came from out of state in hopes of eating something that reminded us from home but it wasn’t at we expected. would definitely not come back again. I’m only saying this so people don’t make the same mistake as us."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtMXN5N0J3EAE",
            "text": "La comida tenia buen sabor. A excepción de la carne asada de mi hijo. Tenía un olor como carne que ha estado guardada en el refrigerador por varios días sin preparar. Del resto todo muy rico y las porciones exactas (ni mucho ni poquito)."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndF9iVl93RRAB",
            "text": "Good Ecuadorian food and a nice service. However, don't expect the food to have the same flavor kilometers away from home. The place is nice and cozy, it could be good for groups. They have a nice lunch special for less than 10 dollars in which you can get soup and second dish."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbE96SVB3EAE",
            "text": "Es mi segunda vez en 15 días que voy.\nLa atención de la mesera muy mala, para variar hablan mal de una cliente que estaba por llegar y yo allí comiendo 👎👎👎.\nServicio al cliente pésimo, parece que uno va a pedir un favor en lugar de recibir atención.\nLa comida:\nSon sabores básicos, es decir nada fuera de lo común en la comida que me haga volver lugar xq está bueno (guatita y seco de gallina)"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1cmU2S1p3EAE",
            "text": "El mejor Encebollado Ecuatoriano en Queens\nSuper fresco. Super rico, recomendado."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLdUtLdkV3EAE",
            "text": "Very unhappy  when we got there they charge over  prices  the menu  shows  prices  from $10.99 when we get the bill  $13.75 for each order home fries  ham 2eggs and toast  plus each  coffee ☕$375.each you can't trust. Small business plus food  bad  and cool be  alert  in this place"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTNWUzdzlBRRAB",
            "text": "The food is bad at this restaurant. I don't recommend anybody to buy anything from here."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0a09ySWJnEAE",
            "text": "The seafood was not fresh at all! PLEASE DO NOT GO TO THIS ESTABLISHMENT! I brought it to their attention and was just told that that is how the dish came. This isn’t the first time I have seafood I think we know when we have good seafood! Very unprofessional."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHcU1fT1Z3EAE",
            "text": "llegamos a las 8:20pm & la mesera nos dijo que debíamos ordenar solo para llevar por que cierran a las 9:00pm . pero si ya van a cerrar tampoco pueden hacer órdenes para llevar ? faltaba como media hora . y su actitud no fue tan servicial .…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1cDlYb0F3EAE",
            "text": "La comida estaba fria no sabia bien y aparte de eso me salieron dos pelos en mi encebollado cuando le deje saber a la camarera ella solo dijo que eso era del maiz tostado que no era pelo🙄"
        }
    ],
    "reviews_count": 68
}