{
    "name": "Ayada",
    "place_id": "ChIJpROekqpfwokRxzDFY0gQKP8",
    "grid": "QN4",
    "address": "77-08 Woodside Ave, Elmhurst, NY 11373, USA",
    "rating": 4.4,
    "user_ratings_total": 1622,
    "phone_number": "(718) 424-0844",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RmVHNU1jV2cwVkVwNlFXZFdWamhHTTBwU2MxRRAB",
            "text": "Cozy, quiet Thai restaurant.  The staff is lovely.  Great date restaurant.  The food is authentic and delicious.  I was only surprised that the pad kaprow was served with sliced pork instead of the usual ground pork.  The appetizers were great."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRWFIWnFPVlkzUkVsWlgyTnBNVU00YnpWZmMwRRAB",
            "text": "This place is the best Thai Ive ever had in the US. Our food was so flavorful, it literally melted in my mouth. Absolutely loved everything about our experience cocktails, appetizers and main dishes. Even my hungry teenagers were happy. Highly recommended!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWc1dtSlJkelJzVTB4aGQwTkVhRzFZZUU1WlUxRRAB",
            "text": "I called them 30 minutes before they closed and they refused to take my take out order. I’ve never had a restaurant not take an order 30 minutes before closing time."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214T2MxQlZhSE41ZEcxek5FcDRhek5ZU1hsT01VRRAB",
            "text": "Cozy setting, good service, and plenty of Thai dishes on the menu. My friend and I shared the fried red snapper with mango salad. It was tasty and filling, definitely enough for two people. We also shared a taro custurd dessert that tasted kind of bland. Prices are pretty high here, due to inflation."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0YVlrRjROa0ZTTjNBeVJ6UnBjMnhVYVZJME1sRRAB",
            "text": "This is a lovely spot - the food is great and the ambiance is quite cozy. I was very happy with my larb and papaya salad order, thank you!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcFp5MVNibEExVldOblZteE1YMU5qVTFkamVXYxAB",
            "text": "You'll feel like you found something special here. The waiters here understand good service. The team makes exceptional efforts for customer comfort. Really excellent. We're excited to return to this restaurant."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMWFVbHNVR1Z4Y21WZlgyMTVUWFpaU0hKRk1tYxAB",
            "text": "This place is good. The raw shrimp salad was my favorite."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RFZuVldhbU5oUlhOalQxSTVjRjl6U25abVUzYxAB",
            "text": "The waitress that took my payment is the reason why this place got a 1 star for everything. She blocked me from tapping my phone because I refused to pay a tip for no customer service. I received no service and she was pushing for a tip. You cannot force someone to tip if they are dissatisfied with the service. They need a lesson in customer service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ak5USlhTRVpWYzBWbVZYWlhjbXRWY1MxZldtYxAB",
            "text": "Authentic thai resto with many food options and attentive staffs"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWM1R5MHlkVWhDU210ck1FaDBibE5OTWpCTlRXYxAB",
            "text": "I discovered quality that deserves my repeated business. The team focuses carefully on customer needs. The dishes were reliably good, I want to emphasize. The experience here blows me away. The service team excelled with quality food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNExVTXhVV054VkZaNUxVWTBNWE5uTmxsdGJtYxAB",
            "text": "Good food in the lunch time and very good price and the amounts of the food is really acceptable tbh a good place to stop when u r in Elmhurst"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeFlqaEVhR1ZyT0ZSM1pGZHJWelI1YkZFMFZHYxAB",
            "text": "The food was so good and flavorful and wonderful portions. Staff were extremely friendly and the vibe of the restaurant was amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OR1VYcHpUV3hMVDFKdWVURnBXVXRGUWs1VVVHYxAB",
            "text": "Every item on the menu tastes carefully prepared. This restaurant is genuinely amazing. The food was so good words fail me. Staff attention and menu variety are remarkable. This spot outranks all alternatives."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRWNGWlpSM0Y1V25abVRWVXRUMnRhVmxObVIzYxAB",
            "text": "Rating: 7.5/10\nDate Last Visited: 8/30/2025\n\nWe ordered the Satay Chicken ($12), Drunken Noodles with Chicken ($17), Massaman Curry with Chicken ($17), and Lychee Thai Iced Tea ($6). The drunken noodles were great: the noodles were chewy, flavorful, and toppings added even more. The massaman curry was good too. The satay chicken was so juicy that it had me questioning if it was undercooked (it was not). The food was very solid, similar to other good Thai places, except nothing set this place apart from other solid Thai restaurants in the area. Overall, I would recommend this place for someone who’s looking for good Thai food in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMExVOXVWek56TVhWVk5sUjVOMjVsT1dVd2NWRRAB",
            "text": "They serve dishes that satisfy deeply. They put their energy into food quality rather than marketing. The servers are kind and the menu is delicious. Staff demonstrate genuine kindness and careful observation. This place will make you smile."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psclZpMDVPVVV3Wm1wNE5XcEpkRTlsYkUxd2MzYxAB",
            "text": "the drunken noodles and duck curry were both amazing. very large portions too. we love elmhurst thai food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMGVYTkplbnAyTkV0S09Xb3dXRGRMWkVZMmJFRRAB",
            "text": "The food is actually as good as the hype. The real standout is the service, though. So fast and friendly!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaFEwUTBkRVJCZGxObFRuUnFSRnBQZGpSNlEwRRAB",
            "text": "I’ve been coming to Ayada Thai in Elmhurst for years, and the food is always incredible fresh, flavorful, and worth the trip from far out. On my most recent visit, I called in an order and asked for suggestions to add to it. The staff member was kind but busy, so she asked me to call back. I did, just two minutes later, but was told the kitchen had closed and I couldn’t add anything. While I understand kitchen hours, it was frustrating after driving over an hour and being told to call back.\nMy advice: if you're ordering by phone, ask to be placed on hold rather than calling back. Despite this hiccup, Ayada is still one of my favorite Thai spots, and I highly recommend it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eU1IRnRlWGRxZWxKV2VHb3paWGwwVFVoMVNIYxAB",
            "text": "Kai kook kapi was really good. However, ordered mango sticky rice to go and the plastic used for sticky rice MELT. So we didn’t eat that since I didn’t think it was safe. Please use something that’s food safe and heat resistant!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWYWF6SmlOMVZDYTI1d2NESmliREJQY0c5U2FHYxAB",
            "text": "The lunch special is somehow tastier than the entrees. Has more flavour. I experimented this 3 times."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ZmJrTlRUWEI0YTA1ck1ISnFlSHB1U2xGYVlVRRAB",
            "text": "Best Thai food I’ve ever had. Drunken noodles are one of the best foods I’ve ever had. Also the service is good very nice people"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padWQxaDZSbEE0ZW14eU4wZ3pWbHBmUnpaMVkxRRAB",
            "text": "Service was good but food was horrible! I ordered 3 dishes i couldn’t eat even 1"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWR2QzZGxZa1pTTVZsclF6UmlXRzVmZEV0eWFsRRAB",
            "text": "Great food and great service. I came here on a Wednesday evening and was seated promptly. Service was excellent and the food was delicious! I really enjoyed my cocktail, the shrimp dumplings appetizer with a yummy dipping sauce, and the pad see ew with chicken. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbWVHZ3RWbXN6U1hnMFFqWm1aa2x3VVU4elFWRRAB",
            "text": "The food was incredible. Everything we had was 10/10. Three of us split three entrees, an app and two desserts and we ate it all! It was delicious.\n\nWe enjoyed the spice level, and the flavors were so rich and delicious. I tried one of their cocktails, which were also excellent. Everyone was so friendly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOckVpS2l3NXR5aS1BRRAB",
            "text": "Stopped by on a late night. Everything we had was great. Fresh vegetables with great flavors. Def will go back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLLWx3UERrM2FiM0xBEAE",
            "text": "The food is consistently delicious, with the Pad See Ew with Chicken being a standout – the noodles were perfectly soft. While the ribeye was tasty, it felt a bit pricey. Don't miss the chive dumplings – an excellent appetizer! Service was attentive; our waitress proactively refilled our water."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJV1pyLXVLODlyMXdnRRAB",
            "text": "Good food and alot of portion.\nSo yummy 😋…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYld4ZjZwajZpdF93RRAB",
            "text": "Excellent ! Clean ! Amazing ! Tasty food !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLaTJrYjZxbEtHZkZREAE",
            "text": "Excellent Thai food.  Staff was very attentive.  Drinks were delicious.  Recommend the chicken satay and the Pad See Ew"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLU0F5czJPdC1TTmp3RRAB",
            "text": "Stopped here before our flight. Service and staff were really friendly and attentive. The food was fresh and delicious and really reasonably priced for its quality. Would size down with spice levels even with a medium tolerance."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKLVNzTU84allidkdBEAE",
            "text": "Ayada is still one of my favorite Thai restaurant in Queens! They offer a wide variety of dishes from classic favorites to unique specialties! All full of flavor and beautifully presented. The staff is super attentive and helpful, the restaurant is spacious and good for big parties or small parties! Definitely worth checking out if you're in the area!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKM0F5ZG56c19fcTJnRRAB",
            "text": "Great food and service"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobGJQNzhBRRAB",
            "text": "Still one of my favorite Thai restaurants."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcFBLSlpnEAE",
            "text": "I came by for dinner on a Friday with a friend of mine - it was maybe half full when we arrived around 7pm but did fill up while we were there. It's not a very big place, so the noise level was kind of high (although a lot of it was probably that our adjacent table was Very Loud).\n\nI ordered the pad ka prow with ground pork (You can also pick sliced pork or crispy pork, not sure about the other meats.) | was being conservative with their spice levels haha so I only ordered at a medium level, but unfortunately that wasn't as spicy as l'd like -- so l'd definitely suggest the highest spice level if you can handle it. Otherwise it was great - pork was flavourful and the herbal/basil flavour came through. Portion size was a little big so I had some leftovers to take home, which went extremely well in a quick stir-fry with some veggies to complement the savoury meats.\n\nMy friend ordered the massaman curry w/ beef which was also really yummy. The curry was really rich and fragrant, and the beef was tender and delicious.\n\nOverall price point was good, I think definitely very much worth the quality and quantity of food. I'd love to come back to more of their dishes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd0liODVBRRAB",
            "text": "Great place, just went for a large family dinner about 15+ people. Food was amazing, service was exceptional. The staff was nonstop working and on top of everything (food, drinks) I will definitely be back and hopefully order out if they deliver."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dTRfeE5REAE",
            "text": "Order of pad thai veggies... excellent\nOrder of shrimp pad thai.... excellent"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MUxldHpRRRAB",
            "text": "Thai food like no other ✨"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ajVIb21nRRAB",
            "text": "It’s ok!\nHigh prices!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMF9mXzhRRRAB",
            "text": "Absolutely loved the food there. Our table ordered a little bit of everything on the menu and we went on to share our meals.  When I tell you that everything I tasted was amazing!!!! It was just exquisite. The service was fast and impeccable. I'll definitely come back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d192Z0dREAE",
            "text": "I’ve been twice and enjoyed both times, they have a few good cocktails and their food is legit. I have only had the noodle dishes but the spice levels are great and the fried fish was also delicious. Truly recommend taking the time to come enjoy fairly authentic Thai. I am eager to try the other restaurants in this neighborhood as well. Elmhurst is great don’t be scared!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3Mm9EZi13RRAB",
            "text": "The food here is really good. This is one of many Thai places along Woodside Ave. The restaurant is small but ALWAYS full. The food is consistently good. They could expand the menu a little bit but I honestly don’t have anything bad to say about their food, which we take out a couple times a month at least. Only thing is a couple of people on the phone can be slightly rude but given how busy it is, ok.. the standard dishes like Pad Thai and Green Curry chicken are always good. Sometimes the chicken could be trimmed a bit better but it’s not stopping us from coming back!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRb3AteTd3RRAB",
            "text": "Love the Thai food here. The raw shrimp salad is legit. Eat it with all the spice and garlic to get full exp. Fried rice and drunken noodle are pretty good too"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRd3J5ZE5BEAE",
            "text": "Great place!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnejduMDB3RRAB",
            "text": "I can't describe with the word... everything is delicious and yummy... because we love Thai Food ...."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnLTgtTWN3EAE",
            "text": "The food tastes literally omg its superb"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbXU2MFdBEAE",
            "text": "So delicious.. recommend 💯 %."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dUlmV0p3EAE",
            "text": "Had gone here for years in the past and I’ve always had their Pad Thai numerous times. It was delicious before. Unfortunately over the years the flavor and quality of their pad Thai have deteriorated. Please Ayada, bring back your once Star Michelin Quality food- the management needs to have some quality control on your food. After this pale experience with their pad Thai (tasted just like a bland wet stir fried noodles, there was no tamarind taste at all or fish sauce- NO UMAMI FLAVOR AT ALL!) I might not come back here again. Ayada please bring back your once Star Michelin Quality Food!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa3NMZnN3RRAB",
            "text": "Good food"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoM19pVEZnEAE",
            "text": "This is an excellent no frills Thai restaurant in Woodside. The prices were reasonable, the staff was friendly, and all of the food was absolutely delicious. We had the raw shrimp salad, crab fried rice, and the pork leg entree, and washed it all down with a couple ice cold Singha beers. I’ll definitely be coming back to try other things on the menu and would highly recommend checking this place out if you’re looking for great authentic Thai food.\n\nUpdate: Came back to try new dishes. Had the papaya salad (medium spicy), duck curry, and crispy pork with Chinese broccoli. The salad and curry were good but I wasn't a huge fan of the crispy pork with Chinese broccoli though - the broccoli was delicious but the crispy pork was really dry and chewy."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmalpyOHN3RRAB",
            "text": "Food was delish...I'll go again."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOcmEzeE1BEAE",
            "text": "저는 눈 오는 날 딜리버리로 주문해서 먹었습니다.\nChive dumpling/ pad thai/ drunken noodle를 런치로 주문했습니다.\n생각보다 맛이 너무 좋았습니다.\nPad thai 맛은 짜지도 않고 제 입엔 너무나 맛이 좋았습니다.\ndrunken noodle 좀 퍼지기는 했지만 그래도 맛있습니다.\nChive dumpling은 크기는 작지만 에피타이저로 훌륭한 메뉴입니다.\n다음에는 매장에 가서 다른 메뉴들도 먹어 보고 싶습니다!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeTlxOEl3EAE",
            "text": "I saw a lot of people recommended so my family and I gave it a try.\n\nI would recommend you to come early because it might get packed. We got seated right away as a group of 4 during peaked hours. The service was really welcoming and friendly. The atmosphere of the restaurant was alright because my brother and I got some mosquito bites and I also saw a fly bugging around our table.\n\nIn terms of food, it was decent. Our favorite was the Pad Thai, the classic: it was so flavorful and balanced. We also loved the Thai Ice Tea. The Drunken Noodles, the Tom Yum Soup, and the Mango Sticky Rice were okay, nothing to complain about. As a group of 4, our dinner wasn’t expensive.\n\nI would recommend this place for Thai food, and I would love to come back to try more dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqenFLTHhnRRAB",
            "text": "Came here for my girlfriends 30th, and we had a wonderful experience. The staff was super friendly and very patient, which was very appreciated because we were a party of 12.\n\nThe food was delicious and very flavorful with a good amount of spice. When you order, you are able to choose the spice level from Mild all the way up to Thai Spicy (which I don't even dare to try, haha). Both the Thai Iced Tea and Lychee Thai Iced Tea were very good but a little too overly sweet for us, so we had to dilute it with a little bit of water.\n\nWonderful little restaurant with great food and a wonderful atmosphere. I'm definitely visiting again to try out the other dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaFBHZlpBEAE",
            "text": "This restaurant is located in Woodside's Thai Village, which has many Thai restaurants, but this one is among the most traditional.\n\nI placed a pickup order here, and after taking about 30 minutes to bring the food home, the taste and temperature were still great, with the authentic wok hei flavor in the stir-fried dishes.\n\nThe takeout containers were well-packaged, with no spills, and the presentation of the dishes remained intact, showing the staff's dedication to preparing and packing the orders carefully.\n\nThis restaurant offers a wide variety of dishes, covering almost all the main Thai dishes. If you're unsure what to order, you can try their signature dishes featured in newspapers or ask the staff for recommendations.\n\nNote that if you can't handle very spicy food, avoid the Thai spicy level; mild spicy seems to be the best choice for most people.\n\nOverall, this is an excellent traditional Thai restaurant and highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyX3VmeHhnRRAB",
            "text": "This place reminded me why Thai food is my favorite food. Oh my, this is probably the best Red Curry I’ve had in New York. So rich and flavorful. Authentic and delicious. Plus I love the atmosphere in the restaurant. It’s cozy and the light is dimmed (which is my fave lighting). I’ll definitely be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlb3NEb0FREAE",
            "text": "Omg the grilled beef is AMAZING, I wasn’t expecting to have such great grilled beef at a non bbq/steak place. Love the raw shrimp, I can tell it’s fresh because no allergy reactions. I ordered Pad Thai and it’s delicious, I like how chewy it is."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwak4zYWxRRRAB",
            "text": "Two of us ordered 4 items for lunch. Three out of the four dishes were above average. The fish cakes were were too thin and they became drt after being deep fried. The service was good and I do recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0c00yc0dREAE",
            "text": "Party at home isn't bad idea at all after ordering out from Ayada Thai. Everyone is happy with deep fried fish with mango salad on the side. We order 2 kind of sausage and both of them are delicious. Grilled beef we wanted medium rare but we got kind of rare, so we had to cooked more by ourselves. Papaya salad is just ok and a bit salty. I was disappointed on Ka Nom Jeen noodle (side dish) the noodles were too hard and too big, not like Thai style Ka Nom Jeen. My favorite dish was Koong char nam pra (row shrimp with spicy fish sauce) Overall, they did a good job."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwa01LY2lRRRAB",
            "text": "Was in area for Burmese food festival. Decided to grab some Thai flavors after passing Ayada. The chicken with broad noodles was good. Enjoyed the chives fried cake. The Penang chicken curry came with a small bowl of rice. Likely need to order another for $2 if you’re hungry. $8 for draft or $7 for bottled beer. We ordered the draft Allagash white, didn’t have it so got the Sapporo bottle instead. Bad news is we got billed for the $8 draft. My experience at other restaurants that bill you incorrectly, they usually comp the item. Also noticed the recommended gratuity on the check was the total meal with the tax. I think restaurants really need to do better on this. Can’t imagine why a customer needs to pay extra gratuity for tax. Seating is a bit tight and the table we were at for 2 was by the entrance. Small table that can barely fit 3 dishes. Overall food was okay but service and environment can be improved upon…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpN05YUV9BRRAB",
            "text": "One of my favorite thai restaurant. This was the usual dishes that we order. The softshell crab with papaya salad was a must. The cocktails tasted so good. The servings for the liquor were very generous ❤❤❤. The fried pork with leafy veggie was so good, the crisp of the pork skin was very crispy. The padkapraw was good as well as the frog legs. FYI this 2 dishes, the flavors tasted the same. Im not sure why they did this but it was okay. The place looks very nice. The servers was very attentive. Food came out fast. Over all, i gave Ayada a 5 because of the flavors. I love those thai herbs that you normally get from thai food. Also the cocktails was so good. Plus the place and server was nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSN3FubjNBRRAB",
            "text": "When thinking about thai food ,I have to drive a long way  to Queens because of this place\nFood is 4/5 portions  less than before, Mango softshell ,papaya salad ,BBQ pork (the best)etc...service great\nOne thing, all the foods came out at the same time, so  ...\nthen my main course  got cold before I started..\nOverall service was great!\nThe staff was great too...friendly service...."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybm83ek93EAE",
            "text": "Great Thai restaurant located in Elmhurst!\nWe came here with a group of 10 people and they were able to sit us all together.\n\nThe food was nice and tasty, and tasted authentic. They had a large variety of dishes. I really liked the Panang Duck Curry ! The flavor of the curry broth was so good, and the texture is nice and crispy. The Crispy Pork with Chinese Broccoli was pretty good. We ended the meal with Mango Sticky Rice, but this wasn’t as good compared to other restaurants.\n\nNice decor and seating. The servers were awesome, really nice and inviting. The parking was a bit tough, mostly paid street parking and residential parking."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOGItdHNBRRAB",
            "text": "Elmhurst is the holy grail of Thai cuisine in NY and Ayada is in the thick of it. It was recommended by a friend and we were not disappointed. The duck with panang curry was super crispy, just delicious, while the fish with mango salad was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdzgyZU1BEAE",
            "text": "Best Thai food I’ve had in a while. Duck with Penang curry at a Thai level spice was nothing short of perfection. Unlike many new Thai places Ayada tastes extremely authentic like when I used to visit my Thai friends home as a kid. Getting the right spice balance with all the aromatic elements especially not ruining the coconut milk lightness and Thai basil is what I am happily pleased about. My wife had drunken noodles with salad and a roll; the drunken noodle were perfect and the peanut sauce on the salad was an exciting twist to a familiar flavor. We started with crab cakes which were a nice sized Ap. Then also got mussels which were delicious with there house made tangy zesty spicy green sauce. Thai iced coffees and lychee drink were huge for large which we also enjoyed. We over stuffed our selves with mango and sticky rice which also did not disappoint. I had forgotten that their mango was tough like papaya with a nuttier deeper sweeter taste than a mango from the americas. Overall the service and atmosphere were accommodating and quaint. My wife and I will be returning."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5NjY3OElnEAE",
            "text": "This is our go-to restaurant for authentic Thai food. Very good selection of traditional Thai food. Soup, noodles, fish, duck and fried rice. The spiciness is based on Thai scale so go easy. The medium level makes us sweat already. Drunken noodle, Tom Yum soup, Curry Duck and Crispy fish with Mango Salad. They have outdoor dinning too."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlanR2M19nRRAB",
            "text": "Food was great\nService is fast\nEmployees are courteous\nAmbiance is nice\n\nOrdered crispy duck with basil sauce -4/5\nCrispy pork with basil sauce - 5/5\nCrab fried rice -4/5\nShrimp pad thai -4/5\nSnapper with Mango salad -5/5\n\nIs it the best Thai place in NYC? No.\nStill giving 5 stars because you can come here, enjoy the food in a nice and clean restaurant where service is nice and fast."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNXE3Ylp3EAE",
            "text": "Came here with some friends for weekdays lunch. The food is fine but the music is way too loud. There’re so many people in Chelsea market, which makes me a little hard to breathe, so we decide to choose a place where we could have seats together. The raw shrimps are fresh and they doesn’t have weird tastes. I order the roasted duck with panang curry. It never goes wrong with panang curry.\n\nThe food is fine but I won’t come back again due to the environment."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeWRpT3hBRRAB",
            "text": "we ordered a Papaya Salad with Raw Crab, awful choice as the crab was not fresh and tasted extremely fishy and off (not just the crab meat but the whole salad is full with the fishy taste).  It was very off putting! We told the staff but she said it’s supposed to be like that.  I had raw crab (and other raw fish/meat) before and it was not like that, and we ordered the raw shrimp as well which the raw shrimp was fresh and didn’t taste fishy at all.\n\nThe raw shrimp was good.  The Tom Yum Soup with Seafood was expensive and not as good as I expected.\n\nI can just say I had much better Thai food before in other places."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqLXJIazlBRRAB",
            "text": "We enjoyed the 2 dishes we ordered- pad kee mao /drunken noodles (enough wok hey and level of spice) and frog legs basil (fragrant!). Also had the Thai iced tea and it was good. Portions are fine (not American large sized) and prices are a little on the high side. Will come back and try other dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6ODZQYXBBRRAB",
            "text": "Found this place based on Conde Nast's article. This Thai place turns out to be a gem. We ordered too many dishes. Crab dumplings, calamari, papaya salad as apps. Then we (3 of us) had fried red snapper with mango salad, crab fried rice, drunken noodles, pad see ew, S'pore noodles look-alike. For desserts, we had mango sticky rice & coconut custard. All are great. We like the S'pore noodles, red snapper, drunken noodles, crab fried rice the best. Siam Thai's crab fried rice may be a tad better. Their rice is whole, whereas this one looks like cracked rice (broken). The presentation for the mango sticky rice is the best looking. The rice is bluish. We wished they've given us more coconut milk. We had a pint for Thai iced tea & 2 other cocktails. The portions are healthy ample. We had to pack everything up except for the apps."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQby1LWjlnRRAB",
            "text": "Came here with a few friends on a Monday night for dinner.  We ordered a lot of food and everything was awesome.  The staff was wonderful and patient with us, as we asked for recommendations.  The papaya salad was my absolute favorite, but everything was so delicious."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4NmJtUGtnRRAB",
            "text": "Little late to post but better late than never. This is our new to go Thai restaurant. All the dishes are amazing. It reminds me of thailand all the time whenever I am here. It has that authentic flavor in their food. Always amazes me. Love their fried whole fish, papaya salad & Tom yum to name a few. Everyone is friendly & nice."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtOWZhQ093EAE",
            "text": "We love it here! When my husband and I lived in Queens, we would come here almost once a week. I’ve been coming here since I was a kid, when they had only one store front. Their iconic spicy shrimp salad is amazing (still my second favorite place for it; the first being at Tum Der in alphabet city) but very delicious none the less. Of course, anything crispy pork belly has to be ordered! We loved our basil crispy pork stir fry. Staff was super friendly and I’ll always be back when I get a chance. It’s places like these that makes me want to move back home!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2a2ZiX013EAE",
            "text": "One of the best Thai restaurant in Queens! Everything here is delicious and so much better than the food in Thailand! Get the duck panang curry, it was the bomb!!\n\nLocation: It is located in Woodside, Queens. The restaurant is a little bit small but with seatings indoor and outdoor. The interior is okay, you will came here for the food and not for the ambience. lol\n\nService: The servers are nice, they gave you good recommendations even though I know what I am going to get.\n\nFood: All that we ordered was delicious, they had big servings as well so we couldn't finish it even though it was so good. DUCK PANANG CURRY: this is a must! The duck was fried or roasted then they add the panang curry on it. OMG the best thai food I ate! FRIED FISH with MANGO SALAD: what a good pairing! The mango compliments the fried fish! Fish is huge and taste fresh. CHINESE BROCCOLI with CRISPY PORK: the broccoli was cooked perfectly. I like it when it is medium cooked, crunchy. CALAMARI: it is fried and not crunchy which I liked cause I want the squid to be still soft. PAD THAI: it was delicious, the noodles were cooked al dente, and I usually get it with PORK. THAI ICED TEA: it was not that sweet and silky smooth drink, I hope there is boba on it tho. LOL.\n\nPrice rating: 6/10, cheap! I thought it will be expensive but the price is not bad.\n\nWill definitely come back here if I crave THAI food! You have to get the Duck Panang Curry, the best thai food I ate!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdk1uYWNnEAE",
            "text": "Wow, I’m impressed with everything I had here. Specially with Ribeye drunken noodles , this was the best one from what I ordered. Steak that came w drunken noodles was juicy, tender and drunken noodles was spicy and was cooked in a way I like. This dish was phenomenal!\nHad a nice experience in this cozy restaurant.\nWas my first time here but this will definitely be my go to Thai place in Queens."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNjR2M0ZnEAE",
            "text": "Best Thai Food I had in a very long time.  Authentic Thai dishes, portions are satisfying and enough to make a to-go box! 💪🏾👍🏽\n\nBe careful when asking for your spice level, it seems to be extremely hot 🥵 Guy sitting next to our table literally was hurting and couldn’t really talk after… he asked for extra spice! 🤣\nFood was tasty with fresh ingredients, dishes came out pretty quick.\n\nPad Thai - chicken and shrimp, everything you expect a pad Thai would taste aka PERFECT!!!\n\nSweet sausage fried rice, was delicious, flavorful and filled with sausage, a different and satisfying dish!\n\nService was average!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ejViS3VRRRAB",
            "text": "Amazing! I’ve always came here when i was a kid but it’s glad to say it’s still delicious to this day. The awards in the front are definitely a eye grabber. I ordered a raw shrimp, chicken satay for appetizer. For entree i had the mango salad fish with rice to share with my friend. The raw shrimp was so good it was sour and spicy and kinda like a sashimi texture. The satay was good can never go wrong. The fish was crispy and sweet. Definitely filling with a jasmine rice on the side. The thai iced tea was refreshing to. Would definitely go back to try other things too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlLU5LRUp3EAE",
            "text": "Really enjoyed my experience here.\n\nWas sad that it was no longer in season for mango sticky rice but the crispy catfish salad was very unique taste. My first time having it and it was my favorite from what we ordered.\n\nCrispy duck panang curry however, was a bit dry. Would’ve been nice if there was more curry or other ingredients in it.\n\nThe store was located in a very densely Thai area in Elmhurst. Very cool since I didn’t know this prior.\n\nWill be back in this area to try more authentic Thai food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeV9feGN3EAE",
            "text": "Ayada might just be my go to Thai restaurant in the Elmhurst area. There is a little bias to this statement as it was one of the first places I have ever tried Thai.\n\nEverything that I have tried here has been awesome. The flavors are good, the amount of food is substantial and the service is quick.\n\nTheir Thai ice tea is one of the best I have had.\nBeware of their spice levels! Spicy is already very spicy, so unless you're daring there are two more levels above spicy!"
        }
    ],
    "reviews_count": 79
}