{
    "name": "Asian Halal Kitchen",
    "place_id": "ChIJRcFVOQBfwokRTIeVbF2zuuw",
    "grid": "QN4",
    "address": "90-02 Corona Ave., Elmhurst, NY 11373, USA",
    "rating": 4.5,
    "user_ratings_total": 62,
    "phone_number": "(718) 708-2030",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCa04xUjZlblZsVlVGRlVuTXhkbEZZUkZnMFZsRRAB",
            "text": "The food is delicious I can’t wait to come again."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVk5XdzRTR2hVYlVObFVHZ3haSGxKWHkxQ1ExRRAB",
            "text": "Great food,great people,great service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSE5HdzNSR2RaVURWMFpHdHFjVjlaUkdoV1JFRRAB",
            "text": "Chicken 65, lollipop chicken, chili chicken, and momos were very good."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbVduSnFkM04wZUhaeFVsbHRlSEl6VmpKVmEzYxAB",
            "text": "Great food, generous portions, extremely welcoming owner. Would reccomend"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNE9XWlRUalIzWVVod05GTnVkSGxFTUc5Qk1FRRAB",
            "text": "Absolutely delicious experience at Asian Halal Kitchen! The chicken biryani was aromatic and perfectly flavorful, truly a standout dish. The chicken noodles were cooked to perfection—tasty, savory, and satisfying. And the hot & sour soup was a must-try; it had just the right balance of spice and tang that left me craving more. Friendly staff and cozy ambiance made the meal even better. Highly recommend for anyone looking for authentic Asian halal cuisine!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KV1YzVXhhRXMwY0daMlowaERPRWgwYTE5S1RHYxAB",
            "text": "Veg samosas are best mouth watering biryani good service foods are cheap in price and delicious too"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZM1JVVm1WREIyUlVocFNrTlZlRzl2YTB0MWJHYxAB",
            "text": "Very good food visit everyone for tasting🙏."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obGMwNW5kRk41UTBWSVR6UlNWRlpFYldOalluYxAB",
            "text": "Great food ❤️❤️"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUVExazVVWGRsTjBrM2FESlFNM0ZtYkd4d09IYxAB",
            "text": "Definitely won’t be going back. Not worth the price or the wait. The food was cold, the service was slow, and the place wasn’t clean. My order was wrong, and the staff didn’t seem to care. Portions were very small and didn’t taste good at all."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWZmQyNHlWV05TWmxoNWNXNWhTbGN6ZDJOU2FVRRAB",
            "text": "Great food also great área 💯🙏"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4amFISnVWVXBxZDFad1JHNUhlVmhaU0ZBMlZsRRAB",
            "text": "I bought vegetables noodles, taste was so good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214amQzVk5NbW8zY1RSUVdVUnZSa3N5ZEV0S00wRRAB",
            "text": "It's a very small restaurant but taste is great, we ordered momos and chicken 65 both were very delicious 🤤 loved the customer service.\nWill return again!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdVREaG1RV3g1UWxSZldGbENkelowWTNaRmNtYxAB",
            "text": "Really good food, I really like their chilli chicken and mango lassi"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SV1FXSTRTMW8zYWxaMGRFd3pTVUl6UjE5VE1WRRAB",
            "text": "5 Stars – Great Food, Great People\n\nAsian Halal Kitchen is a hidden gem. The food is fresh, flavorful, and made with care. I tried the chicken  chow main , chicken chili, Lolipop and VEG — Momo every bite was legit. Spices are balanced, meat is tender, and the portions are generous.\n\nThe staff is respectful and quick. Clean setup, nothing fancy, but they keep it tidy and organized. Perfect for a casual lunch or takeout. You can tell they take pride in what they serve.\n\nHighly recommend if you’re looking for solid halal food without the hype. Will definitely be back.\nPS: Fuschka is also available!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKRDJtNXppcl9leWlBRRAB",
            "text": "Everything here is really good! Their momos  (especially jhol momo) and fried rice sooo delicious!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYmoxb2lQdzdmb1dnEAE",
            "text": "I recently dined at an Asian halal food restaurant and had an exceptional experience. The Chicken Dum Biryani was flavorful and aromatic, while the Fried Chicken Momo was crispy and juicy. The complimentary tea was a lovely touch. The service from Uncle was phenomenal - friendly, attentive, and welcoming. Overall, I highly recommend this restaurant for its delicious food and excellent service. 5/5starts"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPXzVwdVRVN3U2d3hRRRAB",
            "text": "Awesome food 😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd0xmNHp3RRAB",
            "text": "Early Close.👎…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd05lUDN3RRAB",
            "text": "not punctually . early closed."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdlB2Z0l3EAE",
            "text": "Excellent Food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMXFyUkxREAE",
            "text": "Been coming here since they opened and the food is great especially for the prices. Halal food and pizza is worth the stop here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaWNHTzNnRRAB",
            "text": "We thoroughly enjoyed the hospitality and the food. We will be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaXBIRXd3RRAB",
            "text": "The first time my husband picked up food from here, it was outstanding. He said the owner was extremely friendly and we were delighted with the food. We had the butter chicken and chicken tikka masala, and there was enough for leftovers the next day. We were able to feed the butter chicken to our toddler as well.\n\nToday, my husband went to pick up butter chicken for himself and for our toddler. He said it was a different person behind the counter today. He comes home and opens the bag to this - a container of rice and half a pint of “butter chicken” for $12. HALF A PINT. Pictures don’t do justice for how insultingly little was in the container. Nothing was eaten prior to taking pictures, just moved around with a fork, because we were doubtful this was butter chicken. We have white rice at home. We’re really paying for the Indian food. But HALF a pint??\n\nTo be clear, our first visit, the servings for the butter chicken and yolks masala were 2 full pints. And my husband came back with HALF. Less than half?? Enough for a few bites for a grown man. For $12.\n\nAnd to top it off, it wasn’t even butter chicken. It was spicy and not appropriate to give our toddler at all.\n\nWe were looking forward to going back, because the owner was incredibly friendly. My husband remembers him fondly. But after this experience, we feel absolutely ripped off.\n\nMy husband reached out to the owner via his phone number that he was actually provided during his first visit. I’ll revise my review if anything comes out of it.\n\nEDIT: I compared the container to our pint containers at home, and it’s in fact, smaller than a normal pint container. So he received less than half. And no response from the owner a day later. Pretty disappointing outcome considering he gave my husband his contact information for cases like this."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeXB1c3JBRRAB",
            "text": "This food was very delicious, I liked this food, and service is very nice, employees are very friendly."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOXZmdmRBEAE",
            "text": "Very fresh food. Friendly cashier, good prices."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNHZEUUJREAE",
            "text": "Mutton Biryani delicious 😋😋😋"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOG9YVG9RRRAB",
            "text": "Their momos and garlic knots are so good 😋 and the food is always fresh and served in big portions. The staff are also very kind and accommodating. Highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "ha",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeE9HMy1nRRAB",
            "text": "Momo & Fuska"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeE42Z3J3RRAB",
            "text": "❤❤❤❤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdTdLSGpBRRAB",
            "text": "It's a nice deli-style South Asian food. They serve Bengali food, Indian cuisine, Chinese, Halal, and American. They also serve dollar-style pizza, which is popular among the High School students. The portion is a good size. It was not too spicy. They have a few seatings for quick dining. They accept credit card with no minimum. The price is a good value for the size, about $10 meal per person. You can place order online, and note they open in the morning for breakfast menu till late night. The chicken tikka masala was delicious and comes with rice and salad side."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYX3UydHRRRRAB",
            "text": "best food in the town,love it❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURuc2U0YxAB",
            "text": "I had the steamed chicken momo and they were absolutely delicious. Wishing this new business all the success."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOXQ3b3BRRRAB",
            "text": "I decided to give this place a try today and it was a great experience. I got a chicken over rice. The food was delicious, the service was great and the price was very affordable. The employee was very nice. Will definitely return and maybe try one of their other dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueE9PZVV3EAE",
            "text": "This is my first time trying their food. It's generally well priced. Food temperature was great - HOT! It was a little difficult to bring home the Butter Chicken - it wasn't in a plastic sealed container. It was fresh and hot. They accept credit card, so that helped me choose compared to the new Dominican establishment across the street. I just don't carry cash on me anymore."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNEptbGR3EAE",
            "text": "I tried their paneer tikka masala and it was really good. I definitely recommend their paneer tikka.also, the staffs were really nice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURILW8zM3pBRRAB",
            "text": "This place is a hidden gem. They're open later than the surrounding places which is nice for the night owls. I ordered the chicken biriyani, the cook and seasoning was done very well. The prices are fair and they don't skimp on the portions. The container was filled to the top and there were nice, big pieces of chicken throughout. Lastly, the guy working there was very polite and kind. No complaints and will definitely be back"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiZ2RfM0FREAE",
            "text": "I am trying   pizza and  fried chicken momo they served me delicious food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdXFUSUV3EAE",
            "text": "Beef curry is the best"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicF9DV0JBEAE",
            "text": "Great food, friendly service, and a welcoming atmosphere at Asian Halal Kitchen and Grilling. Highly recommend for authentic and delicious halal dishes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibElpUmZREAE",
            "text": "Chicken biryani,chicken curry very tasty and delicious and staff also good"
        },
        {
            "date": "1년 전",
            "language": "bn",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibEpEZXJRRRAB",
            "text": "আজকে এসিন হালাল কিচেন রেস্টুরেন্টে আসছিলাম চিকেন বিরানি খাইছি অনেক সাধু সবাই আসবেন  এসিন হালাল কিচেনে রেস্টুরেন্ট এশিয়ান হালাল কিচেন খুব মজাদার খানা পাওয়া যায়।"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNUstY1ZnEAE",
            "text": "Beff chui jhal is sooo best everybody should try it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieFBiekV3EAE",
            "text": "Truly humbled by the food and service. Prices are worth every dollar. I recommend this new restaurant for families!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNianF2RkJnEAE",
            "text": "Wonderful service and foods are awesome"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNianN1d0h3EAE",
            "text": "Excellent foods"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNieW91SFFREAE",
            "text": "Very accelent service"
        }
    ],
    "reviews_count": 46
}