{
    "name": "Eim Khao Mun Kai",
    "place_id": "ChIJC6L8fatfwokR0sSqnU_UNlM",
    "grid": "QN4",
    "address": "81-32 Broadway, Elmhurst, NY 11373, USA",
    "rating": 4.4,
    "user_ratings_total": 641,
    "phone_number": "(718) 424-7156",
    "reviews": [
        {
            "date": "1주 전",
            "language": "zh-Hant",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podlkzbDVXamRTVDBObWVFOUdlakJFTmpNeWEyYxAB",
            "text": "之前經常叫外賣，醬汁美味，雞和湯都很好吃，但是近幾次下單，雞的味道完全變了，好像是隔夜雞又乾又柴"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vdE9IZGFZakJJV0hGNWNWRk1OWEpaZFdOcGFXYxAB",
            "text": "Food is cooked good, the quality and portions were better than my expectations, especially for the semi low prices."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xneU5FMXdVbTUwYlZBNVNqbG1lRVpWZEdaTFRtYxAB",
            "text": "The food is fresh, clean, and delicious! I’m usually nervous about finding hair or dirt in meals, but here everything well-prepared. The flavors are clean, the combos are satisfying, and the prices are really fair !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUFh6VlNkamx5WkRoalgwdHVTbEZqWVhoaVVVRRAB",
            "text": "Small eat in or take out restaurant that serves delicious haianese chicken and rice."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRFUweE9kMWRqVjJWUlNraG9SMVZmYUdadGNHYxAB",
            "text": "best chicken i had in NYC，clean！good！tasty！"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsU1MwSjRSSEZuWVRSaWREaHVNMlJTVnpsQ1pVRRAB",
            "text": "Chicken was dry and bland. Soup was flavorless. I would not recommend this place."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbGJVMVRSa281YlRWb05rNDRTV0V3TUhkNWVuYxAB",
            "text": "WARNING: Entitled workers, asking for mandatory 20% tip when you eat in. it is strange they ask for mandatory 20% tip when you eat in. They just put the plate on your table. I don't mind tipping, but they asked for 20% when I went to pay for my food. I will not come back. Don't recommend. Portions are tiny and small for the cost and cash only but still charging tax 👎."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNGNIaEVTREI1UmtGSFVGZHlTelJKV0hscU5GRRAB",
            "text": "Always hits the spot!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeVpVaEhjSEpsYm1oemRGTjVXbXB0TTE5VVZsRRAB",
            "text": "Good portion, and you can refill the soup which is good!\nThe chicken is good, but not the best. It’s not too pricy so a good choice for workday dinner!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeFVXaGxWRXRCT0VOaE1HdHZRbU5yVG05M1EzYxAB",
            "text": "Thai Store sign but no Thai food. Old reviews are no longer valid. Only one entre on menu that is Hianam chicken. Food is compromised by poor service! Salty likely MSG. Cash only if eat in. No rest room. First time try out but was horrified. Tiny portion as shown. Is the receipt size 1.5X and cost 15$. Service by the lady short hair with glasses was very poor. She touched me when I put some sauce that was open to serve on table. Horrible. Mean. Possibly raicist. As show those tiny bit of sauce will cost extra and aint allow to use the sauce on table. Wierd.. Overalls  pricy, poor Service, tiny portion with msg; sitting almost none. One bad server who may be the owner or the manager herself  speak volumes that customers are for exploitation. Profit is more important than reputation. There are many other asian authentic eats around. You will be generously served, comfortably seated; able to use restroom restaurants close to it. Don't give your money to undeserved. No longer friendly like those old reviews."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UmF6aG5VM0prVXpCa2JqZHVhVkZRTW5wM1JGRRAB",
            "text": "$4 for extra hot sauce. It’s ridiculous. Also the charge sales tax when they only take cash.  I will be contacting the BBB and IRS"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVd2Izb3RhWGRmZURaR2JWZGljazgyWVRCcmJVRRAB",
            "text": "The best of its kind in NYC for the boiled chicken. Their unique spicy sauce sets itself apart from the rest of the other hainese chicken restaurants. Their Daikon Radish soup is more flavorful than the rest. The only thing they don’t have is the Zaab seasoned fried chicken version of this dish that some other restaurants have.\n\nUsually very quick to get your food (except during peak hours). Very small restaurant so takeout is better.\n\nIve been eating here for exactly 10 years and was once so obsessed with this place I ordered from here every single day for 3 months."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVk9EWmZRbk5mVGxkbFlWVlVVV1ZuTURCVGRWRRAB",
            "text": "Best ginger rice i have ever try in NY the taste is so delicious, the broth , rice they are cooked very well"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25remIySmhTa2hGWW1oNFduUjBRMUI2ZVhFMk5VRRAB",
            "text": "Love love love this place!! They serve the healthiest take-out food you can every get, plus they’re soooo delicious!!! I love their matcha tea as well.. 🥰🥰🥰 I will never get tired eating this food ever!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRk1EUndjR05JYmxVMWVreE5abEZZVmtKek9YYxAB",
            "text": "Delicious! Small space but food packed a punch!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRFdtTmZNazE1ZUVGaU4yWXhOVTFpTVZORVFtYxAB",
            "text": "The best chicken and rice I have ever had."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNWJHcFlPVGN4TFRsalltMXJXalpFU0VwUU1rRRAB",
            "text": "Does anyone else struggle with figuring out what to eat?\n\nThis is my answer.....\"Eim Khao Mu Kai\"\nDelicious, low prices and Big portion.\n\n^^"
        },
        {
            "date": "4달 전",
            "language": "th",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOLWYwY25oMVBlYlVnEAE",
            "text": "ข้าวมันไก่ของคนไทย อร่อยเหมือนอยู่เมืองไทย"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOXzRoczY5a0pmSlBnEAE",
            "text": "I'm conflicted about this place. On one hand, I love hainese chicken, and that is the only thing they serve, and they do it well, meaning it's authentic.  On the other hand, the portions are small, and the price is high for this neighborhood, and the chicken are bland and flavorless until you add the various condiment and sauce that they provide.\n\nThere's no secret recipe.  It's just broiled or steamed chicken, cooked to perfection, meaning it's cooked just right, not too raw, and not too overcooked.  The taste comes from the added sauce. It's really a very, very simple dish but over glorified by many other reviewers.  The chicken soup is really tasty.\n\nIf you want to try something authentic and feel like you are transported to Thailand, then this place is worth a try.  Otherwise, some of you might be disappointed.\n\nI'll be back, but only very occasionally."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNRFcwYXJNNC1uN0ZnEAE",
            "text": "A hidden  gem of Elmhurst, only popped in because a certain place had a 45min wait.\n\nOne of the better Hiananese Chicken Rice places I've been, and if taking into account price to taste/quality ratio I'd have to give this place 5 stars.\n\nRecommend getting the combo for the chicken meat and the liver, so good. The ginger scallion sauce pulls the dish together.\n\nThere isn't much else on offer here, just the small menu that they focus on. Which is how it should be.\n\nWe also got extra chicken, photo shows the portion for 3 with $7 of extra chicken."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOQzVsZlRiMTlES01REAE",
            "text": "This place literally has one thing on the menu: Hainanese Chicken Rice, and they do it amazingly. You could smell how fragrant the food is the moment you walk in. The chicken is tender, the liver cooked to perfection (so much so that we ordered an extra serve), and the ginger scallion sauce addictive. It's a very small place with only 3 tables but service is still attentive and efficient."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSVdHbHJjRXhIVEc5VmVsVlRWMlI0VURVdGRFRRAB",
            "text": "I love places that do one thing and do it amazingly. The chicken rice is transcendent."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKeUpqOWU5M19IZmVREAE",
            "text": "Probably one of the best Hainan chicken and chicken rice I’ve had in the U.S. The ginger scallion sauce is a must, and if you can handle some heat, definitely try the chili sauce—especially when mixed with raw garlic! The place is small and cramped, so don’t expect to fit comfortably if you’re in a group larger than three."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVeDd2cWRREAE",
            "text": "I understand inflation but the prices cant increase THAT much. I believe it is not 14 or 15 a person. Used to be 9. Thats too much of an increase. I biked to the shop and could not bring myself to go in after seeing the price. I went to Pho Best instead because they havent changed their prices. Got Squid lemongrass for 9.95. and a bowl of broth with beef slices for 3. That is more worth it in these hard times."
        },
        {
            "date": "6달 전",
            "language": "ha",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMmZ2TzhBRRAB",
            "text": "Original Kao mun kai 👍🏻"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbjVEeUxBEAE",
            "text": "The food is ok but very expensive."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeTRfYkhREAE",
            "text": "Be very careful when eating at this restaurant. They might change the price on your receipt when you're not paying attention.\n\nWhen I entered, I was the only customer. The waitress didn't greet me, which was fine. She handed me the menu (not placing it on the table or in my hand, but just holding it and showing it to me), and I thought she was in a hurry, so I cooperated and quickly ordered. I said \"Thai ice tea\", but my finger accidentally pointed to \"Thai lychee tea\", and I didn't notice at the time. When I was drinking, I brought up the issue to her. She agreed to change it for me. When I was about to offer to pay for both drinks, she rolled her eyes and was very impatient. So I didn't say anything. I should have apologized for accidentally pointing to the lychee tea, but her attitude at that moment left me speechless. I even wanted to walk out of the restaurant, but I thought they had already prepared the meal. In the end, I still left a 18% tip, one Thai tea and a single meal. The total was 21 in cash. I understand the hardships of the service industry.\n\nOn my way home, I suddenly remembered that I had bought their food before, and a single meal should have been around 10 to 15. I'm not sure exactly, but what I saw today on the receipt was 17! I checked their website menu, and 17 could even buy a double meal!\n\nListen!If you guys need me to pay for two drinks, you can just ask me, instead of making such an dishonest move! I'm ashamed of you!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBZ2NfQ0JnEAE",
            "text": "Whenever I'm in the mood for nice, high-quality chicken or some good Asian comfort food, and I have cash in hand, this place is always there to provide that comfort.\n\nAlthough the restaurant has a cozy and compact interior, making for an intimate dining experience, there is usually a table available.\n\nI wish they accepted credit cards, but they only take cash (as of this review), so keep that in mind before deciding to dine in.\n\nOtherwise, you can order online for delivery.\n\nIf you're looking for great value and high-quality chicken, definitely check this place out."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaDhuMW5nRRAB",
            "text": "Probably knew we were not locals. The portions were small for two people and mostly dark meat!!  Looked at the table next to us, whose order was for one person and it looks like the same size as ours (probably a local patron and got the breast). The chicken was just okay, nothing special. The soup was tasty."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbTRPMXZBRRAB",
            "text": "Would give ZERO stars if allowed. Grossly overpriced, terrible chicken that is undercooked, cold and tasteless. This does not justice to the actual dish in Asia. Not only are they ridiculously overpriced for a few pieces of chicken and mostly rice, they ASK FOR TIP while there's no water on the table or actual service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneTgycnBRRRAB",
            "text": "I have an addiction for Hainanese chicken and rice and I've hit a few good spots. This place is certainly no exception either. Options are rather limited in this place, in fact I think chicken over rice, along with gizzards was the only selection so I got the chicken over rice sans gizzard along with lemon Iced tea. The chicken over rice may be the only thing on the menu but they do it very well. The chicken was flavorful and tender, the rice was cooked just right, add soy sauce or spicy sauce for an added kick of flavor and there was also 3 cucumber slices and broth on the side which made for a great palette cleanser.\n\nProps to the servers in the spot. They were very accommodating and helpful. I've lucked out with the restaurants I've gone to with the waiters and registers just providing their best for the customer. I hope that streak keeps going."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcEwzQjZ3RRAB",
            "text": "One of my FAVE places in the neighborhood! We always come here! Also love the chicken rice soup."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbGNMMU1REAE",
            "text": "Really good chicken. No frill restaurant - only 1 option on menu. Hit the spot.\n\nCash only, no bathroom."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcnJqZld3EAE",
            "text": "We ordered food and missing soup and sauce!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Ml9xRUF3EAE",
            "text": "Perfect place to eat an original Thai food!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQd1pESGZREAE",
            "text": "The BEST Chicken dish in NY\nThe chicken is juicy, the soup is delicious & the rice is perfect 🥰 ❤️👍"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeGM3T0VREAE",
            "text": "Got this to go and was my first time having it. Very delicious and definitely would get again. Had the ginger rice, hainanese chicken, daikon soup, thai iced tea - all of which were great. Came with sauces as well which married well with the chicken. All for a great price!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzM09YZlhnEAE",
            "text": "The chicken is tender and juicy, while the rice absorbs the fragrance of the chicken broth. Paired with flavorful chili sauce, ginger paste, and soy sauce, it offers a rich depth of flavors."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbkx2djNnRRAB",
            "text": "Good service, chicken is good and not to mention the price. ⭐⭐ ⭐ ⭐ ⭐"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdHBiNXZnRRAB",
            "text": "Very authentic Hainanese chicken over rice. I'm in love with their ginger soy sauce 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaTRlTXNBRRAB",
            "text": "THAT CHICKEN AND GINGER RICE BE HITTING DIFFERENT, I LOVEE THE FOOD 😝😝😫😫"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMDdHZUV3EAE",
            "text": "It tastes terrible. It tastes like frozen chicken boiled. I said I wanted black meats, but I got a bunch of white meats and there was no chicken skin. The dryness of the white meat they gave me was visible in this picture. It tastes terrible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURud2JPNUR3EAE",
            "text": "The chicken was like a blank canvas where you can add your spices gowns\nHowever you like.  Rice was also well seasoned.  👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIODRUeGhnRRAB",
            "text": "Love the taste. But they only accept cash and the space is too small. The service is great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIM1p6SVlBEAE",
            "text": "Eim Khao Mun Kai is a fantastic spot for Hainan chicken rice! I ordered the steamed chicken over Hainan rice along with a Thai iced tea, and everything tasted amazing. The chicken was tender, well-seasoned, and paired perfectly with the fragrant, flavorful rice. It's a simple yet nutritious meal that truly satisfies.\n\nThe staff were incredibly warm and welcoming, which made the experience even better. The Thai iced tea was the perfect refreshing complement to the meal. If you're craving a delicious, wholesome dish with great service, Eim Khao Mun Kai is definitely worth a visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIOE0zUC1nRRAB",
            "text": "BEST hainanese chicken I have had in NYC! Those who say it’s basic and you can get it anywhere in Thailand - then go to Thailand and save this place for those of us stuck in NYC!\n\nThere’s no bathroom and it’s a small restaurant so just keep that in mind! It’s good for solo and two people for a quick lunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3M18zMHdBRRAB",
            "text": "Flavorful rice CHECK!!\nFLAVORFUL CHICKEN CHECK!!\n99% DEBONED CHECKED!!!\nSOUP CHECKED!!\nHELLA GOOD!!\nGo and try for yourself!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNNHRPa3lBRRAB",
            "text": "Update from 4 years ago’s review.\nFound hair in the chicken, they serve less meat now for higher cost, I understand things cost more now but their quality is going down throughout the years."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3X3RDdTFnRRAB",
            "text": "Before you try this restaurant, please read\n\nThe food is really okay nothing special. It’s like cheap Khao Mun Kai you can get in Thailand. Sorry but it’s true. Since it was in Thai neighborhoods so my expectation was higher than that.\n\nOn the receipt, they asked for 18% tips. Like they handwritten it on the receipt pad. Which it is not making sense to me. There was no service. The server never refill our water. They never asked how we like the food.\n\nI’m totally not supporting this business. And I’m sorry for this bad review. But there are much better Khao Mun Kai places out there around the city that you can go but not …"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiekt2NlVREAE",
            "text": "Best hainese chicken"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOE1IdWNnEAE",
            "text": "It’s my belief that this is a\nmillion $$$ chicken recipe 🥇🥇\n\nThe steamed chicken is tender & flavorful. The jasmine rice is nothing short of spectacular 👍\n\nI loved the soup that came with it and requested a 2nd serving.\n\nSeating is limited to a 12 person capacity. Sometimes I do takeout and eat across the park. Recommended on a sunny day.\n\nAll this goodness for $13.07, tax included. It’s a healthy option over fried chicken & rotisserie chicken 🐔.\n\nUpdate: was 5 stars ⭐️ but changing to 4 stars after I read other reviews and agreed the price has GONE UP & portion is SMALLER 😤😤\n\n$11.50 would be the sweet spot. Many venues offer a good lunch for $9-$10 🙏🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidDhmSkhnEAE",
            "text": "I first came here back in 2015 with two friends, and we were all blown away by how delicious and pure the food tasted and how cheap the price was (I think we paid less than $10 before tax and tip then!!). This was now my third visit with my husband and toddler, and the food was just as delicious as the very first time. This time, we got the plate for two people which came with two portions of delicious and fragrant chicken rice, a generous portion of both white and dark chicken meat with some gizzard and liver, some slices of cucumber and cilantro, and endless amounts of the addictive ginger scallion sauce, hot sauce, and a soybean paste (I think?). We both agreed that we could probably drink the ginger scallion sauce because it was just lip-smacking good and well seasoned. We did not refrain from putting massive doses of the sauce on our chicken. We also enjoyed the hot sauce that went well with the ginger scallion sauce and the chicken. The chicken is just perfect; there’s no other place I’ve had khao mun gai in NYC that compares to how perfect this spot is - super juicy and moist, tight skin, delicious and addictive condiments (plus low price!!).\n\nWhile the prices have gone up, it’s 100% understandable given inflation and the fact ingredients just cost more. Plus, if you had the same quality and quantity meal in Manhattan, it would easily cost at least 50% more.\n\nThe service is quick and friendly. There is very limited seating and the space is small, so I would not go here if I had more than two or three people with me. The tables are small and the seats are only stools, but honestly, I think it makes the place more charming and like what it would be like if you were in Thailand or somewhere somewhere else in Southeast Asia. No restroom unfortunately, either, so make it quick and snappy!\n\nEven though we don’t live in the area, we still make it out here because the food is that good. Elmhurst overall is quite underrated for food, as there are so many delicious and eclectic options nearby, but this is definitely one of the biggest highlights."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNmVyTTN3RRAB",
            "text": "This is probably one of the best places to eat when you’re in Queens! It’s definitely comfort food for me! The dish itself is very simple but it’s very tasty and you customize your own sauce to flavor your chicken. I love the chicken broth…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjLUp2YnJ3RRAB",
            "text": "This has been my favorite go-to Hainanese chicken spot since it opened a few years ago across from the Elmhurst Hospital. Unfortunately I moved to Brooklyn the beginning of this year and therefore I can’t visit as often as I used to. Now that COVID-19 has hit the world and small businesses are suffering from loss of revenues I try to support my favorite restaurants by ordering take out and delivery. Due to the distance, my bf and I drove to Queens today for Hainanese chicken take out. We ordered a set three that comes with three sets of chicken, rice and soup. However, when we got home we saw only three bags of white rice and soup with no chicken. We called and let the store know of the situation and the owner was very nice and apologetically offered to deliver the chicken. We explained that we live very far away close to Coney Island. After a quick moment of pondering, he insisted on delivering the chicken. NGL but after approximately two hours of waiting we doubted the legitimacy of the call and the agreement to delivery. Yet we soon received a call from the owner saying he was downstairs. In addition to brining the the chicken we were missing, he also brought two addition meals, crispy chicken over rice and roasted chicken over rice and a Thai iced tea.\n\nElM Khao Mun Kai Elmhurst is an amazing restaurant with exceptional customer service no matter the time and situation. We highly recommend that you try this place out if your haven’t. Thank you owner for going through such great extents for fulfilling orders and delivering the missing order!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlLU1lNjBBRRAB",
            "text": "I’ve come here a number of times now and there’s nothing more than I like than their steamed chicken. This place makes the homiest and most delicious steamed chicken but if you love crispy or grilled I definitely recommend trying it.\n\nMake sure you get garlic and use their sweet soy sauce. If you like spicy I definitely recommend using their hot sauce and add the chili for extra spicy :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeWRuMy1BRRAB",
            "text": "Really delicious and pretty cheap chicken rice. You can choose steamed, roasted or deep fried chicken. Each portion comes with liver, gizzard, and a small soup. I really like the dark sticky sauce, and you should ask for extra since they only give a little of that one. The brown sauce, which has a larger portion, is quite spicy"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSek16WUhREAE",
            "text": "Super legit authentic hainanese chicken with steamed rice. Very cozy and perfect for a cold day. Definitely get one of their set menus. Not much seating and the service is a bit gruff, but worth a trip nonetheless."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoaS02YklnEAE",
            "text": "I absolutely loved the steam chicken rice here! It is just so comforting and enjoyable to eat. The chicken is soft and the rice is so tasty! The chili sauce is also definitely on-point! Only thing I wish was for the portion to be larger given the price!\nOverall, very satisfying!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHb2JDZlJnEAE",
            "text": "This is our favorite Hainanese chicken. This joint is a Thai version of it and it is delicious! The chicken is served boneless and with gizzard and liver. We love the chicken and rice. The rice is full of flavor and goes so well with their hot sauce. It is like a salsa like hot sauce."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2blpuXzBBRRAB",
            "text": "I have had my share if Hainanese Chicken, Chicken Rice, Khao Mun Gai/Kai. The Thai translation is oil rice with chicken. Have at it at fancy restaurants in Manhattan to the street food all over Thailand and Indonesia.  I must say this place is up there. If you consider the price it would be near the top. It's a hole in the wall and only takes cash but the quality of the dish is excellent. The chicken was moist, the liver was cooked properly, the rice had the chicken fat, the sauce had the ginger and the soup needed nothing. I opted for the traditional poached set 2 and ate nearly all of if. If you a connoisseur of authentic Thai Khao Mun Gai it is tough to go wrong here. Service was friendly and fast. One thing of note, most everyone did take out as they only had three tables when I was there."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteHRpSWpnRRAB",
            "text": "Thai-style Khao mun gai, one of the best in the city! They have new fried and roasted options, as well as a combo of all 3 kinds. I really enjoyed the fried option, def worth a try! Don't forget to load up on sauces, they are all amazing. Drinks are also great, esp Thai iced tea/coffee."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aGFiaUpBEAE",
            "text": "Delicious! I dropped by to try their chicken sets for dinner. I loved the steamed chicken. The roasted chicken had a nice spice rub to it. I’m definitely going back to try the crispy chicken. Make sure you ask for a container for the ginger sauce. I’m not sure they automatically include it with the steamed chicken."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxb2ZiajFnRRAB",
            "text": "This Thai restaurant is a taste of Bangkok bliss! The flavors mirror the authenticity of Thailand. Every bite is a delightful journey back to the streets of Bangkok. A culinary haven for those seeking genuine and delectable Thai cuisine. Highly recommended!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldDhxT1NnEAE",
            "text": "Can’t believe I got uncooked chicken from this restaurant I used to love a lot.\nAnd now i am setting the the bathroom having diarrhea after this.\nIts was so famously and now I believe opened second one next to it. But when price went up the food quality is going done. I could have call 311. But this is a small business and i don’t want they have trouble but this is really unacceptable! I hope the owner sees it ! And please make correction! Chicken uncooked is really hazardous ⚠️ to ur customers health! ! !\nI wish you can see from the picture how pink and undercooked they were."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMzZpUkxnEAE",
            "text": "I want to give this 3.5 stars. There's only one thing in the menu, steam chicken over rice. The grill and fried version are unavailable. The coffee is average comote to other Malaysian restaurant in flushing. The soup is MSG flavor. The main course, rice is good but lack a bit of the chicken taste s I tried all the Malaysian restaurant in flushing. The chicken has no chicken taste. But the meat is tender. This is Thai version so the cooking may be different. But they were selling as Hainan chicken. Which is Malaysian dish. So overall I give it 3.5. it's good food but I won't come back if I want authentic Hainan chicken over rice."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2Nk0yTGJnEAE",
            "text": "The steamed chicken with a side of soup was delicious. It was moist and juicy and the soy and spicy sauces that comes with the meal add to the flavor. Make sure to ask for the ginger/scallion oil. I don't know why they don't automatically give that to you. It adds so much more flavor to the dish.\nI got my meal to go and it was packed in paper. Seems more eco friendly which is great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoaTh6X3NBRRAB",
            "text": "Small menu but that makes choosing easier and the food is incredible. We had the chicken and rice for two and it was definitely filling. The rice was really flavorful and the chicken was tender. Really loved the chili sauce on the side. It added a nice bit of spice to the dish. We asked the restaurant to swap out the liver with more chicken and they were ok with that"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MEtITEdBEAE",
            "text": "My friend took me to this place. I told him I was not a fan of Thai food, but he insisted this is authentic and different. So me and my friends with along and he was right. The food is different, nothing fancy. If anything, it's just boiled chicken and rice with some sides. It's called set 1. I got that set with 1 Thai ice coffee. It was delicious. I had to get another set and finished it, too. The price was well worth it, and the quantity is good as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcnVycDd3RRAB",
            "text": "This place is more of a takeout spot than a sit-in restaurant. The food is authentic, and the service is okay. My only reservation about this place is that they only accept cash, and they charge tax. Not only that, but the tips are calculated based on the total, including the tax. To me, that’s a bit of a shady practice, and I’m not going to support business like this. Needless to say, this was my one and only visit to this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHX0tEU3FRRRAB",
            "text": "Quick and flavorful. Super garlicy chicken rice and well spiced roast chicken. Even had some crispy bits on the end. Make sure not to miss out on the ginger sauce. Super duper awesome!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwek9Lbll3EAE",
            "text": "Solid spot for Thai steamed chicken (which is reminiscent of Hainanese Chicken, except way more sauces). The chicken is tender, the skin is delicious, and the gizzard/liver were decent too (usually not a fan). There were a large assortment of sauces/condiments to go with them, and the side rice/soup were also great. The drinks (tried lemon iced tea, Thai coffee, and coconut juice) were average, good for a hot summer day.\n\nAll in all, solid spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMTRHRzRRRRAB",
            "text": "Confirmed they only have one item, and that's steam chicken. Besides the 1 item menu, it was pretty tasty. The chicken was moist, rice was tasty and cooked perfectly, and the radish soup was also tasty. The chicken was deboned, and they gave some of the inners (gizzard and liver). Compared to Taste Good Malaysian's hainanese chicken, Eim Khao is way better. Taste Good's chicken is overcooked, and the hot sauce is really weak and tasteless. If it's hainanese chicken you're craving. Look no further, but remember that's all they have."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNGN5OHJRRRAB",
            "text": "5/5 Highly recommended.\nKhao mun kai, which means “oiled-rice chicken” (eim means “full”), is the popular #Thai adaptation of a common Hainanese street food and the specialty of this #Elmhurst storefront shop, by which I mean that’s all they’ve got. In #Malaysia and #Singapore, the same dishes known as #Hainanese Chicken Rice (so far in New York I haven’t found any MY/SG restaurants got it right like EIM Khao Mun Kai Elmhurst). Whole chickens are boiled, jasmine rice is cooked in the stock, a zingy garlic-chile-ginger condiment is on point. That the paper-plated result, along with a cup of broth and some slices of cucumbers, looks a bit like convalescent food belies how satisfying this oiled-rice (you can smell the chicken broth from the rice) #chicken is."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvd3UtVTFBRRAB",
            "text": "I like the nostalgic set-up with the stall.  It's reminiscent of the Night Markets in Southeast Asia, without the foot traffic, noise, and other street hawkers.\n\nThe menu can't be simpler.  But to say there are just 3 menu choices is an overstatement because no matter which one you choose, you get just one same dish, the Hainan Chicken.  Menu 1 is for one person, 2 is for two people, and 3 is for three.  Duh!  The only difference is the price. If I do the math correctly, menu 2 give you the best bang for the buck.\n\nSo they serve just one dish - their specialty.  Anyone can thus safely assume they execute it very well.  I am no expert on Hainan chicken, so I can only judge using my subjective taste buds alone.  Unfortunately, I've concluded I am not a fan of Hainan Chicken.  I've dreaded the \"white boiled\" chicken since childhood, and this isn't far from it.  The pale color is not enticing, and the taste is too bland.  The serving you get will come with gizzard. Again, not a fan. I am just glad it doesn't come with a chicken head as well lol.  I do like ginger however, and it's everywhere - in the sauce, in the broth, and of course, in the ginger rice!  Ironically, I pretty much like everything except the chicken.\n\nAnother thing quite unique about this place is that for takeouts they wrap everything (except soup and sauces of course) in wax paper.  It's no big deal to wrap cut-up chicken in paper; but rice as well?!  Hmm... to me I thought it was odd and fun at the same time because I've never eaten rice out of paper in my life.  But it's a different story for my mother-in-law.  She simply felt it's \"low\" to eat food out of paper, so she had eat after we returned home after all the errands.\n\nOh, one other comment. I told my wife the 3 chickens hung next to the stall were so nice and plump. Then much later after seeing the same 3 chickens being featured all over Yelp photos -- right, I realized they were mock chickens and they had me fooled!  Gullible me!!!\n\nBottom-line: If you know and like Hainan Chicken, you should like this. If you never tried Hainan Chicken, you should come and try once.  For me, I've checked off this place from my bookmarks and I'm moving on."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbl82YUdBEAE",
            "text": "Great hainanese chicken rice being served here. If you’re after any other type of dishes, you’re out of luck. This place specializes in 1 dish only. And man, they definitely do it well. To make things better, they de-bone the chicken for you, which is amazing as most Asian restaurants will just chop through the bones which makes it splinter, making it difficult to eat at times as you find bits of bones while you’re trying to enjoy your food.\nThe rice itself is absolutely tasty, the chicken is amazingly tender. This place really reminds me of how it is over in south east Asia!!!\nHighly recommend this restaurant!!! Absolutely amazing food!"
        }
    ],
    "reviews_count": 75
}