{
    "name": "El Gauchito 1",
    "place_id": "ChIJqwQssrVfwokR9FuqCI2Tud4",
    "grid": "QN4",
    "address": "94-60 Corona Ave., Elmhurst, NY 11373, USA",
    "rating": 4.4,
    "user_ratings_total": 829,
    "phone_number": "(718) 271-1917",
    "reviews": [
        {
            "date": "4시간 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWV1RuWTRhVVZaT0RNek9WOVFOV1V5VUhoV2MwRRAB",
            "text": "Un excelente restaurante para ir con familia ,las carnes deliciosas y suaves ,la antencion excelente. Recomiendo al %1000"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdlR6ZE1aR0ZYZFUxMWEzWmxVVTVFY0hSQ1dYYxAB",
            "text": "Everything here was delicious. My family and I visited and had the canelones with ternera, asado (morcilla, chorizo, costilla), and tallarines with salsa mixta. For dessert, we got budin de pan, churros con dulce de leche, and vanilla ice cream. Everything came out quickly, the portions were generous, and the prices were great. We’ll definitely be coming back. After eating, we made sure to buy some batata, queso fresco, and alfajores to take home. The atmosphere was amazing and the servers were very friendly."
        },
        {
            "date": "5일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VU4zbG1jVnAwWVhGWU4xWjFWbEIxUVVWVGJGRRAB",
            "text": "Comida deliciosa y de la mejor calidad."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMVlWOURkRXhsTkdWMmFXbGFWR1pxY2xOM2NVRRAB",
            "text": "I love coming here for dinner and special occasions. The food is absolutely amazing and the drinks are as well. It’s a great place to have a celebration or just a dinner with family. Some days might be more packed than others and you might have to wait. BUT the wait is WORTH IT. The service is attentive and amazing. Overall such a great place for dinner!"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KeldFa3RVbmxUUVZGTmVWaFFUWGRvV1U1R1ZuYxAB",
            "text": "Damasiado caro"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeWRIcDFjSEl6UlVWM1UxUkVhM1JqTUdaWlVXYxAB",
            "text": "A mi gusto el Gauchito Restaurant es lo mas cercano en Nueva York a ir a comer a un restaurante en Argentina. This restaurant is the closest thing to feeling like you are in Argentina."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQ1RqSlBUVWhQWkRKaUxXZFFaVzFqU1RGd1pGRRAB",
            "text": "This is one your response to a customers experience in the restaurant, you’re unprofessional. The restaurant needs better servers. Hire new staff, and get a new floor manager. He looks depressed and miserable working there. The atmosphere needs to change , the people there don’t want to serve. They act as if I’m focusing them to do their job correctly."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cDV6ZExBEAE",
            "text": "They sell very good meet, cheese and mate. Good prices. I still don't know the restaurant, but I believe it's good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMU1WSlFhV2xuVnpsb09ISnZRakpHT1ZSNVlXYxAB",
            "text": "All the cuts, chorizo and morcilla are incredibly delicious , great choise for dessert the Dulce de Leche Pancakes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GME9GVkRiM3BGWm05T2VWUnlibE5sWVRKTGFYYxAB",
            "text": "Great Argentine restaurant and meat shop."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Nd1R6STVWbUU1VkY5b2IzazRXRXRyUjJnM00zYxAB",
            "text": "We had a wonderful experience at this Argentinian steakhouse. The food was excellent—steaks cooked to perfection with authentic flavors—and the drinks were just as good. The service was friendly and attentive, making us feel welcome from the moment we arrived. The atmosphere is quiet, relaxed, and very family-friendly, which made the whole evening even more enjoyable. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oc1ozbFNSR0UyWkRsM1RtcFFSbXhGUWxOMlFYYxAB",
            "text": "Es un lugar donde podrás disfrutar de una buena cena personal mente se los recomiendo  att el musicologo."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeFYzaG9TMkpxVEUxSlIzUXRWVU0zVmt4WVNFRRAB",
            "text": "We went around 2pm it was amazing food was fresh and hot I had the churasco my wife salmon it was delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQ01ua3RObWx5ZUhVNWFrRXpUa1ZMVjFwWmFXYxAB",
            "text": "Personal favorite Argentinian steak asada place in NYC. Favorite always the skirt steak Entraña. Staff were all very kind and attentive."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcE5GVmpRa1Z5ZWtwc01ITjBjUzFtZVhkUlJtYxAB",
            "text": "Primera vez que vengo a este lugar con mi familia, me lo recomendó un Argentino compañero de trabajo. La comida es fenomenal, pedimos la parrillada y estaba deliciosa el servicio impecable SUJEI nos dio el mejor servicio mi familia y yo nos fuimos muy satisfechos. Super recomendado!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVWVHdE5hMUYzYVU1Qk5VMXVTbFZpTlhSc1NIYxAB",
            "text": "Un lugar agradable, la comida 😊🤤 excelente la carne !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxM2IyYzNSRVE0WW1OSmFpMDVSa3R2UkRSdWFrRRAB",
            "text": "Great steak. Great wine. Come hungry and get some alfajores for the road"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMmFFRnJNMTlHUkdkc1dtMTRTVkJWU0RGd0xYYxAB",
            "text": "Gauchito Restaurant in Elmhurst, NY:\n\nIf you're looking for an exceptional dining experience, look no further than Gauchito Restaurant in Elmhurst, NY! From the moment we walked in, we were enveloped by the warm and inviting atmosphere that perfectly captures the essence of Argentine charm.\n\nThe highlight of our visit was undoubtedly the phenomenal service provided by Agustin. His personal and dedicated approach made us feel like valued guests. Agustin’s suggestions for our meal were spot on, leading us to the incredible Mixed Meats dish, “Parrillada.” It was cooked to perfection, showcasing the rich flavors and quality of the ingredients.\n\nTo complement our meal, Agustin recommended a Catena Zapata Cabernet Sauvignon, which proved to be an excellent pairing. This wine came from a remarkable vineyard and elevated our dining experience even further.\n\nGauchito is a standout establishment that combines charm, quality, and excellent service. I wholeheartedly recommend this restaurant to anyone looking to indulge in delicious Argentine cuisine. I can't wait to return!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWGVrRm1kbXRZV0RCWFVreHRkekZLWDNsNk1XYxAB",
            "text": "One of the best grilled meats in NYC 😋👌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWVUwNDBjbWxvZDI0MloxRTRRMUpJVFc1NGVtYxAB",
            "text": "The service was fantastic and so was the steak."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeVMxaHJTemhuYTBsNWMxVnZjbWxYVTB4ZlZsRRAB",
            "text": "La comida buena pero la atención es lo peor del mundo! Éramos 2, gastamos en total como $250 (tanto carnicería como restaurante) y aún así el mozo nos siguió a la carnicería a exigir una propina de $20.\nMe parece una falta de respeto TOTAL.\nJamás volveré a la parte del restaurante."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGR2MyZzRZVGRJTFZOMFh6VnRkMlUzUkZST1ExRRAB",
            "text": "Very bad service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaamRFcE9ObFJvYlZCa2NYUk1iRGxtVFVWSGJIYxAB",
            "text": "Beautiful dinner for my birthday 🎂 Thank you"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSFJYcHFPVUUyWjNOSFYxUXlibWxEVjJWcldIYxAB",
            "text": "Best Argentinian steakhouse in New York!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdFYwdG5kelk1TFRkcE9GWkNRMkl0YlRKVE0xRRAB",
            "text": "Amaizing experience. We drove for 1 hour and 30 minutes, and it was worth every bite and the service. Needless to say, we were very well looked after, with the famous soda siphon detail and everything in a very Argentinean atmosphere. We will return."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJR2FrWU8xcXNQSm13RRAB",
            "text": "Best Argentine steaks and meat"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKNnB4S3V5OElTRVZnEAE",
            "text": "Incredible value, atmosphere, and food. $45 got us a plate meant for one person my wife and I could not finish."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMya3ZEYld3EAE",
            "text": "Worst restaurant experience I've ever had. Went here not too long ago. Food was ok, but that's not the problem. The problem was the people attending us. They're all con artists who speak in a manner to make you spend more money. I asked for a glass of water to which the woman attending us replied they couldn't do that. She did it so I would pay for the bottle as opposed to getting a free glass of water. Mind you every establishment in NYC is required to give you a cup of water if you ask for it. So then I ordered my tomahawk steak. The menu said it was 60$. They said it can feed 2 people so I decided to get it. They didn't clarify and charged me 120$. I asked for it to be cooked medium and It came out practically blue. It was inedible. The steak came with 1 side. The lady asked if I wanted rice and beans to which I replied sure. They charged me extra for an extra side. The way she spoke made it seem like rice and beans were one side. I've been to many restaurants all over nyc. From 5 star high end expensive places to local Chinese food spots. This had to be the worst service I have ever experienced in my life. Full of scammers. Be cautious. This establishment chooses profits over people"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNT2g2dFhhclpHUHRRRRAB",
            "text": "just buy meat..the meat is good and fresh"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvLWJuMC13RRAB",
            "text": "This place has a huge menu, and everything is delicious!  The meat is amazing, and the sandwiches are super tasty."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOSENzYTJfbUpUWEpREAE",
            "text": "Lo mejor"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQRGt1X0x1cWJPTVJREAE",
            "text": "Very popular - come ready to wait to be seated. But the wait is very much worth it. Una experiencia muy argentina!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbXA1OHl5N0pQOVFBEAE",
            "text": "Like 12 tables in the dining area integrated with a butcher shop. The food was amazing, Eric was our waiter, always on top of his tables, without overreaching, and very attentive. I had the chicken and the steak, second to none, downed with delicious pineapple juice. I highly recommend for meat lovers. They have pasta as well (looks delicious), but i didn't try it. Tres leches was the finishing move, very moist."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPemhzSkx4aXNUQ0d3EAE",
            "text": "Amazing food"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOQ3AxdWlYbmJYak1BEAE",
            "text": "Otro nivel en carnes"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbHZpUWZBEAE",
            "text": "I tend to come to El Gauchito for special occasions because beef is expensive and they do it very, very well. I rarely venture beyond the entraña (skirt steak) because it's so good. Seasoned simply, it's fantastic with the chimichurri on the table. Get a glass (or bottle) of malbec and you're near perfection. My only beef (pun intended) is you can't get spinach as your choice of side with your steak. You'll have to order separately with an included potato option if you want the greens."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMExMcHpBRRAB",
            "text": "Authentic Argentinian food, great service and authentic decor"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvanNpVmRBEAE",
            "text": "The food was ok, the meat was fresh, and the empanadas also is ok. A little price"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNTZlX05BEAE",
            "text": "🇦🇷 Argentinian at Best! Steak ! Entraña ! Delicious Gauchito Corona NYC ! Queens Best! Steak house ! Last night we drag our friends from NJ ! To impress them! They love it and coming back next month! We pick out Gauchito for our previous experience there ! Great menu ! Ambience! Service ! Dessert! Yum ! I was surprised when I read some rude comments about it ! So I say I want to see if they are what they say on the reviews, cause we eat there las time long time ago and you know places changed but this still at their best !!!! Everyone was nice 😊!!!!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJODhQYlFBEAE",
            "text": "No tengo palabras para mi expresar mi experiencia en el Gauchito 1, Execelente servicio por parte de mi querida Zugey, una venezolana demasiado alegre y muy atenta con sus clientes. Prácticamente es mi lugar favorito en el ámbito de carne y morcilla. Siempre la paso muy agradable. El vino 🍷 delicioso 😋 me pone contenta. Lo recomiendo al máximo 👍🏼 busquen a mi querida Zugey que van a pasar un momento muy agradable."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOXZ1YURREAE",
            "text": "Whether date, family, or solo you can't go wrong."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJck0yV3d3RRAB",
            "text": "You need to start packing your food better. You're using what people uses as garbage bags to pack your food, and the plate moves around when delivered and all the liquid just drops into the bag. Start using paper bags where the food will not tilt when ordered via delivery. Your food costs a lot of money, and I don't mind paying it, but start doing your jobs better. Management or ownership needs to be looking at how the food is being packaged for delivery, because this is totally unnacceptable."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eWFLNDJBRRAB",
            "text": "excelente servicio y deliciosa comida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIb3UzZU93EAE",
            "text": "Both El Gauchito 1 & 2 are a staple in my life. If you’re looking for a place to celebrate the holidays, special occasions or a girls night or even a Friday-after-work meet up spot, you will have a fm and pleasant experience. If you like soccer, a game is most always on, the location in Corona, has soccer related shirts. If you want a quality cut of meat for that special dinner, you will not be disappointed. If you want some delicious sangria this is THE SPOT. The food is superb. Service is excellent and if you’re lucky, you’ll get to meet the owner and the manager. This place comes highly recommended. I highly recommend the dos tires de asado. Seasoned very well, You can’t go wrong with nothing on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNHB2ZGVBEAE",
            "text": "This is probably the best Argentinian restaurant I've been to in NYC. The food is delicious. you can tell they care a lot about the dishes they serve you. Their milanesas are superb"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaTRha1lBEAE",
            "text": "If you’re craving authentic Argentine food, this is the place to be. The meats are spectacular—juicy, flavorful, and perfectly cooked—and the appetizers, like provoleta and empanadas, are absolutely delicious. Great atmosphere, excellent service, and an unforgettable dining experience. Highly recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMS1lc0hREAE",
            "text": "This restaurant has the perfect Argentinian atmosphere and has great food! Not to mention the wide variety of Argentinian products and candies they have up front at the desk. This place has very good service and friendly employees I definitely will come back here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSMDdUNVZnEAE",
            "text": "Had an amazing time for lunch at El Gauchito. We got the parrillada and you could tell the meat was very high quality. However, if you know your meat cuts you could tell that it was not what was advertised—- skirt steak was definetly not the good part of the skirt steak. Still, would definetly come again 😊 Service and ambiance were great too. Still, I prefer buying meat for delivery!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNROGRyVlBnEAE",
            "text": "Amazing restaurant, food was superb, the presentation both of the meals and the place where simple and very authentic. We where a group of six and the service was perfect, a lot of people always everything come fast to the table and with and smile. I will definitely recommend this place and come back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCN29mMVJBEAE",
            "text": "I recently visited El Gauchito and had an arnazing experience. The atmosphere was cozy and authentic, and the staff were all friendly and attentive.\nFor our meal, we started with a beef empanada and a chicken empanada, both of which were delicious. The empanadas were perfectly cooked with a crispy crust and savory filling.\nNext, we had the camarones al ajillo, which were garlic shrimp served in a flavorful sauce.\nThese were also a hit And paired well with the empanadas.\nFor our main dish, we went with the Parilladas de carne for two, which was a platter of grilled meats served with sides. This was the perfect choice for meat lovers and came with a variety of cuts and flavors.\nOverall, I highly recommend El Gauchito for anyone looking for authentic Argentine cuisine. The food and service were top-notch and I will definitely be returning for more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMjd6N2FBEAE",
            "text": "The Guachito, Simply the best Argentine restaurant. The parrillada (steak) food, price and above all good service and a familiar and friendly atmosphere. Highly recommend!"
        },
        {
            "date": "5년 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzOXZUeFVBEAE",
            "text": "Bulunduğu mahalleye gittiğimizde biraz çekindik. Gerçekten lezzetli yemek yiyebilecekmiydik. Araba parkı biraz sorunlu. Araba için yer bulabilmek biraz zor oldu.\nFakat lokantaya girdiğimizde öncelikle ortam bizi çok etkiledi. Dekorasyon süperdi. Yüzümüz gülümseyerek yerlerimize oturduk. İstediğimiz yemeklerin hepsi mükemmeldi. Özellikle etler, ahtapot salatası süperdi.Bu kadar mutlu olabileceğimi hiç düşünmemiştim. New York’a gelince mutlaka tekrar geleceğim."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHd09fOWZ3EAE",
            "text": "Fantastic food, staff is gracious and fast, can't recommend this place enough. Had the sirloin and I was floored. Steak cooked to perfection, and the sear was flawless. The seasoning was outstanding and I can't wait to eat here again."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCel9uTElnEAE",
            "text": "A gem in the middle of queens! I’ve been to several Argentinian steakhouses in NY and this is by far my favorite. In fact, it is the only one I would recommend to anyone. The food is fresh, hot, authentic, juicy, and flavorful. The atmosphere is warm, cozy, and full of Argentinian mementos. The restaurant is split up into two sides and the back of the side of the entrance is a small area where you can purchase fresh meat and other Argentine items (Argentine mate bags, hats, tshirts, candy, etc).\n\nThe other side is fully decorated with souvenirs from different Argentinian provinces. There are also painted tiles around the perimeter of the room of famous Argentinian people. If you are Argentinian or have been to Argentina, you’d likely feel at home in this restaurant. The waiters are friendly, speak Spanish, and give you space/time to enjoy your meal.\n\nThe menu is beautifully hand drawn and there are many authentic Argentine food options available. Even though this place specializes in meat, there are many vegetarian options available.\n\nWe ordered the beef milanesa with onion and cheese, the complete parrillada for one person (which came with fries and a mixed salad), and a sifón. Having been to Argentina, one of the things I missed most about Argentina was the sifón. I love a good carbonated water and the sifón has the strongest carbonation I’ve ever had due to the strong bottle material. I couldn’t believe that it was on the menu and I had to order it. Truth be told, it was fun having sifón in NY but it was not the same as the sifón in Argentina. The carbonation was not as strong and was perhaps as weak as some sparkling waters.\n\nBut, before our food arrived, we were given (on the house!) warm bread with butter and chimichurri sauce on the side as well as this tomato, ham, and cheese in a green sauce as appetizer. The bread was fresh and tasted great with the chimichurri sauce. The chimichurri was tart (but not overly so), herby, and went with everything (you’d best believe I put it on everything we had to eat!). The green sauce on the tomato, ham, and cheese plate was similar in taste to the chimichurri but it was less tart due to the addition of oil and was even more addicting.\n\nI believe the green sauce in the appetizer was the same green sauce used in the salad so obviously the salad tasted amazing. The salad had very fresh ingredients and these ingredients are all part of classic authentic Argentine salads. As the sides, the fries were perfectly crispy on the outside and fluffy inside (my favorite kind of fry!).\n\nThe onion and cheese beef milanesa was good and would pass in Argentina. The beef cutlets were covered in cheese and there were actually two layers of beef cutlet. The beef cutlets could have been made a little thinner but were a good thickness nonetheless. The beef cutlets were tender and not chewy at all. The onion flavor was very strong and perfect for anyone who loves onion.\n\nThe star of the meal was the parrillada. It had a piece of everything including entraña (skirt), tira de asado (ribs), mollejas (sweetbread), kidney, and several types of chorizo. All of the meats were juicy and cooked well (not overdone but also not uncooked). They retained a nice meat flavor without tasting like a cow. I will say there was a little too much choziro and not enough meat but I’ll forgive it because everything was so good. The chorizo was very flavorful and a little crispy. Also the meats were on a little bbq that kept everything nice and hot. Meat that is hot tastes 100 times better than meat that is cold and this bbq kept everything hot (not just warm but hot) for the entire meal. In fact, after I cut up pieces of chorizo, I would put them back on the bbq so they would sear a little bit. Also, included in the paradilla was several pieces of pickled cauliflower and peppers. The sourness of the pickled vegetables and the pieces of lightly salted meat was heavenly.\n\nDue to this lengthy highly positive review, I now know that google has a character limit. If you don’t know by now, I highly recommend this place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBMmVpbTRRRRAB",
            "text": "Tons of fresh meat including blood sausage, maduro, rice and beans. How could that ever be a bad dinner? I went on a Saturday night at 8pm. The wait was only 5 minutes for 2 people to be seated. The service was friendly, but a little slow.  The service is similar to how it is in Europe if you've ever been."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCOS1xWVFnEAE",
            "text": "Reservamos una espacio para 10 personas y celebramos un cumpleaños. Muy buena atención, mesa amplia, la comida muy rica. Tanto la carne como la pasta estuvieron muy buenos!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdU9fMzRBRRAB",
            "text": "Excellent service since you walk through the door until you leave. The food is amazing! I recommend the Parrillada with Russian salad it never disappoints you :)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxakpqZHhnRRAB",
            "text": "Absolutely amazing, came here with my mom on three occasions and each time was delicious. Definitely a great place to eat, especially for meat eaters. Their skirt steak was delicious and the menu is extensive so they’re really are a lot of…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4LUlqUXhBRRAB",
            "text": "Amamos el Gauchito en casa! Solíamos ir seguido con mi esposo, al restaurante, pero ahora con los nenes chiquitos se complica y compramos para llevar o en la carnicería para hacer asado en el pier 6. La atención es excepcional y la comida excelente, la carne es espectacular también ( y yo soy cero experta en hacer asados, me sale bien igual lol) GRACIAS por traer un pedacito de casa a tanta distancia ❤️🤤🥩🇦🇷\n\n*update: miren ese sándwich de milanesa, como no ser fanática del el gauchito? 😅\n⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtNDdyWnFnRRAB",
            "text": "The best traditional Argentinian Steak House in town. Is no surprise as they have a butchershop on premises, you always get the best cuts straight to the grill, right to tour table. If you're not into steaks they also have a great selection…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxb0lyaGZBEAE",
            "text": "I been here before don't frequent often\nBut is always a pleasant place food is perfect and fresh they have a Bucher shop inside this restaurant the waitter are  very attentive they have drinks I accompanied my Parrillada with wine 🍷\nAnd they have a good selection\nIf you are in the mood of steaks try this one and spread the news"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWdjZ2dDNRRRAB",
            "text": "Fantastic Argentine Parillada at this local Argentine hangout in Corona, Queens. Excellent variety of Argentine beef cuts and a classic parillada with steak, sausage, morcilla (blood sausage) and the offal (sweetbreads, kidney’s and chinchuline), all tasty and excellently done. This place under fine ownership knows how to do Argentine right."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweEtqOGV3EAE",
            "text": "The best Argentine food you’ll find in NYC.  Can’t go wrong with anything here.  Welcoming staff and amazing food.  An essential for the area"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bmNiZkVBEAE",
            "text": "Good clean Argentinian steak house. Eat your fill with good wine without busting your wallet.  Sells fresh meats on the other side too!"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbDgtYXhnRRAB",
            "text": "El Gauchito es el auténtico restaurant Argentino que ofrece variedad de cortes y a mi gusto ofrece la mejor entraña: super tierna, jugosa y generosa. El ambiente es tranquilo y el servicio es muy bueno. Los chic@s son corteses y amigables. Recomiendo El Gauchito a quien desee comerse un generoso tierno y jugoso pedazo de carne."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbGFHTU9nEAE",
            "text": "This restaurant has two parts a dinette section where meals are quickly prepared for those on the go and an actual sit down area for a formal dinner and they can accommodate large parties. We got there a little after 7 and was able to be…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhbzR1ejZBRRAB",
            "text": "I went to dinner with a friend after a year and a half due to COVID. The food was still good however the service was terrible. There was ONLY 1 waitress taking care of the entire restaurant. They had 2 other runners which barely helped her. The owners were just standing around instead of helping out. I remember when the service used to be wonderful and inviting but now it’s not worth eating at the restaurant. Might as well order take out and save yourself the headache of a long wait."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzalpLNExREAE",
            "text": "First time visiting here what a wonderful experience , service on point , food very delicious there’s so many options but mostly meats. The atmosphere very nice music in the background was perfect level,"
        },
        {
            "date": "수정일: 4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpaTY2NG53RRAB",
            "text": "Excelente lugar. Comida hecha a la perfección, yo pedí dos tiras de asado acompañado de papas crujientes, todo muy sabroso, su staff me atendieron cordialmente. Simplemente fantástico."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXZ1YkJREAE",
            "text": "I’ve come to this restaurant for years and have always had a pleasant experience. However, in NO FAULT to the restaurant, we Had an unpleasant experience because of a couple at the table next to us who was complaining to the manager and insulted the waitress to her boyfriend. Manager resolved her issue as best as he could but she was still complaining and making a ruckus. If you see a review about how they “ignored her” and had poor “customer service”, ignore her. The restaurant was completely full and the staff were doing the best they could. 10/10 recommend this restaurant, great food and polite staff."
        },
        {
            "date": "2년 전",
            "language": "zh",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbE5mTnV3RRAB",
            "text": "酒和奶酪西红柿不错。烤牛排套餐不行，内脏太多，腥"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaGZTeGpnRRAB",
            "text": "Ordered takeout steak for two. They gave us pork. As Muslims we cannot eat pork nor eat meat that has touched pork, so we called them and they told us they would not recieve the order back even tho we merely opened it, haven't even touched it !  70 dollars down the drain. Awful place never again."
        }
    ],
    "reviews_count": 72
}