{
    "name": "Brisa Del Cibao",
    "place_id": "ChIJPws5GsdfwokRxs6Sd9gE-eo",
    "grid": "QN4",
    "address": "37-79 103rd St, Flushing, NY 11368, USA",
    "rating": 4.3,
    "user_ratings_total": 700,
    "phone_number": "(718) 205-4941",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWVYwTndNWEJMYVZWVFpVRnhiRXBCVWtWNFVWRRAB",
            "text": "The food was pretty good.\nDid take a while to get served though.\nOtherwise, pretty good, will come back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VVYwNDNSV3RZU3pSVVVYcExabnBhVjBJMFNYYxAB",
            "text": "The best Dominican Food in New York"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRFVIVkJhME4zVFcxRGNISk9kRTAzUTA5VWVHYxAB",
            "text": "Been coming here since I was a kid . They remodeled now and it looks like a proper restaurant now not a Spanish food spot anymore . Food still just as delicious as before"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWVFXbzVUV1YzZVZaWmNXcHZPRmwwTUc5Q1JtYxAB",
            "text": "first off , if you're black .. don't go here . the food is amazing i ordered off uber eats a few weeks back and was blown away so i decided to visit the restaurant in person and have lunch. the female staff especially if you're a pretty girl they are so intimidated they will not say hello , they will not ask you if you're okay. i ordered to go but decided to ask for a plate because i was on my lunch break didn't want to spend too much time there .. i'm calling this lady \" excuse me \" very very polite this chick literally IGNORES me calling her , as she's coming back im like hello miss can i get a -- before i can finish my sentence she's handing me a plate . i felt so low in there but knew this is the reality of things you are not accepted everywhere . . but they will for sure NEVER have me a costumer again. i was so so upset."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTFJXazFXVGhIZUhoQlFYQlFiR1ZMWDJ0d2FHYxAB",
            "text": "No flavor"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeF9Hc3ZRRRAB",
            "text": "Our family’s favorite Dominican restaurant. Home style authentic cooking. Courteous service and delicious food. We always find a reason to dine here :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRd1FrbFRSVTlLZDI5R1FVNWpObTlRVmxRemFsRRAB",
            "text": "Good Dominican food. I have dinner here at least 4 times a month before going to Citifield!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wZlExbFVNWHBKYkdoeWIwMW1ZVUpTVVUxMFVYYxAB",
            "text": "The server was somewhat not paying attention to us when we got there and as well when we tried to get the check it took more the 10 mins.  The waitress passed by about 6 or 7 times before she handed us the check. Other than that, the 2 cuban sandwiches we ordered were very good and tasty. I would still recommend this place because of the atmosphere."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJMnhqZWFMNEtXUjVBRRAB",
            "text": "Mi restaurante favorito pechuga a lo fuerte lo mejor el cafe y los tostones  los  kariokee  y su servicio the best"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNl9ET2t3RRAB",
            "text": "Les recomiendo es un lugar bonito y limpio y ni se diga de la comida un mangar 😋\nY el servicio ni se diga muy bueno también"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvanE2ZlhnEAE",
            "text": "Authentic flavors, generous portions, and friendly service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NDYzYVl3EAE",
            "text": "Amazing Dominican food, tastes very authentic!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcnRmYmNBEAE",
            "text": "Skirt steak was delicious!! 😋"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmel9XT1pREAE",
            "text": "Went there first the first time today on a friend’s recommendation. What a positive experience-friendly staff, clean and inviting place and delicious fresh food! The owner took a personal interest in making sure my monfongo WITHOUT meat was on point. I definitely recommend this restaurant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2Mjh2S3NnRRAB",
            "text": "Food is amazing as always"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQLUpUSmlRRRAB",
            "text": "El.mejor bistec de ny"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaHZLN3FRRRAB",
            "text": "Let’s start off with saying this. The moment I walked in I wasn’t greeted. The Colombian waitress from pereira with blond hair was low key kind of rude and I could tell she did not like me. Anyways when the food came out it looked so delicious but happened to be dry.\nThe chicken was very seasoned but just dry and the Moro de Guandulez had no flavor. The atmosphere was very depressing and all\nThe women who worked there did was gossip about other coworkers in front of customers it wasn’t very demure, cutesy or mindful. A waist of money. This place is on the chop block and I won’t be coming back here ever again. If you want Dominican food you have to go to Washington heights or the Bronx Periodt!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQOUlUU1p3EAE",
            "text": "Horrible , I order twice , first time fish with pure the fish was ok, but the pure taste sweet and disgusting, I do not said anything, I was on my brake. Today I order chicken soup because my kids are sick , and they send a red soup full of rice and frozen vegetables, my kids of course did not eat that , and i really understand them. I called to see if I can changed, and they said I only an employee , call in an hour the owner will be here. I don’t understand this answer , what is goin to loose the place , a soup ? Why owners don’t give authority to employees to make decisions, people that is paying for delivery is because they want to eat now not in tree hours."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNWItN0V3EAE",
            "text": "El PEOR  servicio al cliente NO VALLAN !! que mal momento y que falta de educación de parte de esas SEÑORAS  meseras y al parecer a la cajera poco le importa la falta de respeto hacia los clientes , tras de que le hablan a uno horrible lo OBLIGAN a pagar un servicio que no se merecen , definitivamente si les puedo ahorrar que entren hay me lo van a AGRADECER !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaksyZVNREAE",
            "text": "My friend and I love coming at La Brisa, we’ve been going for over 15 years. The food is great and never disappoint. Our bill came and there were gratuities included already, to which we don’t mind but there were only 2 of us dining and for a bill of $85, the tip was almost $16. We know how hard the waiter/waitresses works but it’s a bit much. They should change that policy or when you go there with a friend make sure you get 2 different bills."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNl9xZnJBRRAB",
            "text": "Went for late brunch with a large group and got seated right away.  The wait staff was very courteous and quickly answered questions on the menu.  I ordered the Arroz con pollo, which was delicious, and a salad came with the entree.  Also had the fried sweet plantains, which was sweet and delicious.  I tried a piece of steak from the person next to me, and that was good as well.  Also ordered the rum punch, which was very good.  For dessert we had the flan which was so delicious.  There was music in the background which was not too loud as it is in some restaurant and we were able to hear each other.  The food looked so good I dove in without taking pictures.  I would definitely go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudVlDM19RRRAB",
            "text": "Staff was excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueklqOTJ3RRAB",
            "text": "Amazing food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueG9iRFZ3EAE",
            "text": "Food is great, great staff, atmosphere is cool, setting is comfy"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Z2VyZWFBEAE",
            "text": "Great place 👍 Great food 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MmZYRXl3RRAB",
            "text": "Best food.. waitresses.. and environment.. always clean and plays great music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aU4yMm1BRRAB",
            "text": "I never had a mondongo that tasted like Chef Boyardee Spaghetti before, but at Brisa Del Cibao, I can overpay for exactly that on an uncleaned sticky table. I'm gonna go back to getting mondongos from El Rancho Latino across the street."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMnBfak1REAE",
            "text": "The person that pick up the phone kept hanging up the phone. Thats very disrespectful..all I ask was for them to send a sancocho and not to put all chicken like the first time and she hung up on me.. maybe cause they don't have meat for the sancocho and used something thats not meat..\nI hope the owner get something done or they won't make it in this neighborhood.."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwc2JIeXNRRRAB",
            "text": "( look at pictures ) First of all I ordered a ham and cheese sandwich I bit into it didn’t look inside because as stated I’ve ordered the same ham & cheese sandwich for 10 years every week at my hair appointment with no problems. When I bit into it I tasted something completely rotten I literally threw up. When we opened the sandwich we saw this. ROTTEN BLACK MEAT. And not even on a ham & cheese it was a “cubano”. when I called they hung up on me then the second time I called I was told I had to wait until the delivery guy finished ALL his deliveries just to come see what’s wrong with the food. I decided to walk in there myself the lady looked at the sandwich and said that’s a Cuban. That dark whatever it is looks like a Cuban sandwich?! Disgusting. It’s old rotted meant . Eso está PODRIDO eso no es jamón. Ni un sandwiche cubano tampoco!!! Tengo más de 10 años comiendo de aquí  y nunca e tenido ningún problema con ellos pero hoy la macaron !"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidElfN1VnEAE",
            "text": "Siempre fue muy agradable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNDduYlB3EAE",
            "text": "Amazing food , service and their red sangria to die for .. I was visiting from Florida and all I can say is wao this place is amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMUlMTlpBEAE",
            "text": "Brisa Del Cibao is a very good place for some great home cooking."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMWZuSGlRRRAB",
            "text": "The ceviche mixto is super fresh and the chicharrón de pollo is awesome.  Waitresses are super friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMLXRleXdnRRAB",
            "text": "I wanted to take my mother and her best friend to eat food they would enjoy. This location was recommended, so we decided to go. The food was good, not salty at all. The service staff  needs improvement. The service staff were too busy gossiping, I had to flag her down for water and the bill."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6aWZYRHpnRRAB",
            "text": "Best Dominican food in queens"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdnRlLURnEAE",
            "text": "This was EVERYTHING. I wanted to dive in and basque in the asopao de camarones. Everything from start to finish was fantastic. Don’t bother going anywhere but here!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUeGN6T0hBEAE",
            "text": "Son muy amables las trabajadoras y tienen buen animo y atienden muy bien. La.comida es exelente y el ambiente super"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdWN6T2RnEAE",
            "text": "Saludos a la Morena."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa2FQZXBRRRAB",
            "text": "Amazing food, great atmosphere, highly recommend (just go early to find parking)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbXNiRGZ3EAE",
            "text": "I came back here again because this is where my coworkers threw me a small baby shower during work. I brought my mom here yesterday for mothers day and overall I wasn't happy with the service. It is apparent I'm not dominican and the waitress should of been more engaging and should of told me what's recommend to eat. But anyways I love dominican food and I already knew what to do order. But the waitress was too quick in getting my order that she messed up my take out food."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb29xSEVnEAE",
            "text": "Muy buena comida  y buen espacio para sentarse cómodos"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMnVIbEVBEAE",
            "text": "I used to come here religiously. I then moved away. I made it back and the place did not fail. Everything was delicious."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MnVlNUlREAE",
            "text": "Buena la comida, el rabo guisado , la costilla asada , el chicharrón d pollo son muy ricos y el servicio es bueno y los precios razonables ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdS12S1FREAE",
            "text": "Wow! Everything was delicious. I ordered the almuerzo de chicharron de pollo deshuesado with white rice, red beans, tostones, and salad. The empanadas/pastelitos are also yummy, I recommend cheese or chicken. The waitress who goes by “la negra” was very nice and welcoming. I highly recommend this spot for some homemade style cooking."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxemNxYzdnRRAB",
            "text": "The food was ok, the lobster was over cook. But customer service was good."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeGJxSXNnRRAB",
            "text": "Great Caribbean comfort food, tastes just like home cooking! Great portions (great to share), agreeable prices, nice food/ drink selection & friendly staff. Good for a quick bite after work or even for a big family dinner. Definitely would come back again!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNlp6VG5RRRAB",
            "text": "Not fancy, but delicious food in a family atmosphere. We enjoyed everything we tried and service was quick."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2a2ZMb0l3EAE",
            "text": "Buena Comida. Recomendamos El Pollo Salteado con Arroz,  Habichuelas y Tostones. Si te gusta un Buen Capuchino La Brisa hace El Mejor.\nNuestra parada #1 cuando estamos en New York."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNDZTMWVREAE",
            "text": "Amazing food! I went back after a decade and the food still great. Was also good to see the same faces working there"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3amRIUnBnRRAB",
            "text": "If I'm in the area is almost mandatory to stop and eat here :)\nAmazing food and reasonable prices!\nIn my opinion is one the best places for dominican food!\nTry my last dinner there!\nSteak w/onions, white rice, red beans and a small order of tostones!\nDon't forget, 2 ice cold presidentes!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaM2NYZ0x3EAE",
            "text": "Compré un salmón pagué $22.87 y esta es la ensalada que me mandaron 😂 solamente lechuga y un pedacito de tomate, jamás había visto esté tipo de ensalada.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweHFLVVRnEAE",
            "text": "Delicious Dominican Food! Some of the best Latin soup offerings I've ever had. Our waitress was super kind and let us try stuff we were unfamiliar with. Great value for money! Nice tables and booths."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5a3RYa01BEAE",
            "text": "Good customer service, fresh and delicious Dominican food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCa01EdERnEAE",
            "text": "Amazing food! We ordered delivery for our annual gift exchange at our office and were amazed. The customer service is great and friendly. The delivery was prompt and the food... Oh the food was so tasty, we all come from different background and not one person complained. We ordered the pernil, chicken, morro, salad, potato salad and maduros. Will definitely continue to order from her for out company events."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPZ3B1Sm9nRRAB",
            "text": "The only reason they are getting three stars it’s that they took way to long to get our food out, but maannnnn it was worth it, the shrimp ceviche was extremely good (Salt and acidity was on point) the rice was perfectly cooked, shrimp and Garlic sauce was well executed, and the oxtail was out of this world. Food was so good here that I didn’t even take a picture, I just wanted to keep eating and didn’t pay mine about the pictures because the food was amazing. Friendly staff, and good food!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNbWVHWHZnRRAB",
            "text": "One of the best Dominican restaurants to eat at in queens. I have been coming here for more than 15 years. The two owners cater to the needs of their customers. The chef is damn good. The restaurant is very clean and has a good ambiance. The only issue is finding street parking."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaU92MUJREAE",
            "text": "I had excellent guisado pollo with rice & beans; my friend loved his mofongo pollo. It was mid-afternoon so quiet, it took a little long for anyone to come over, but once the waitperson came they were nice and fully engaged. Friendly. Limonda was refreshing. The salad was wan with pale tomatoes and iceberg lettuce, but the dressing was great. You also get a ton of food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdWJMM2dnRRAB",
            "text": "Food  and service was excellent, the only problem is there's no parking."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHME5hWVpREAE",
            "text": "Best thing on the menu was a coke. The rest was bad from the waitress to the dishes"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3LU9xTFBBEAE",
            "text": "La Brisa has been on the neighborhood for a long time. Food never disappoints. Typical Dominican food always tasty. Friendly wait staff and very big portions. An enjoyable place to dine and the food is soooo good you'll forget to take pictures and just dig right in!!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3ellEMHNnRRAB",
            "text": "The food is not good at all! :( Hopefully I don't forget this experience for the future. Asked for a grilled chicken sandwich and it came fried with ham and cheese😩 The rice and beans and grilled chicken didn't taste good either. And my…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRbXBtV3NBRRAB",
            "text": "good Dominican food very good service too. There is nothing to munch on as you wait for the food to  be served. ie, bread or corn chips.  i ordered the grilled ribs  really well seasoned my friend ordered pork chops and it was a very nice…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURFeHUtM25nRRAB",
            "text": "Great service, however, food was spoiled! I shared a Cuban Sandwich with someone who agrees the taste was off. I initially thought it was the type of cheese used, but it wasn't. This is the first time I've eaten from there, I usually order coffee to go, which is really good. I'm willing to try again, but am disappointed."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTaU52QjJnRRAB",
            "text": "This place is a serious fall from grace I used to love coming here but every time I come back the food gets progressively worse my last order had no seasoning not even salt and the waitress was beyond rude my real problem is with management…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzeE8zblVnEAE",
            "text": "Absolutely LOVE this restaurant. Been coming for a few years and it’s by far my favorite restaurant of NYC. Have made a few friends due to the amount of times I have eaten there. We have never been disappointed with any of the meals we…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtODRUYy13RRAB",
            "text": "I finally went to tried it after the good reviews, they must be fake. Everything was bad beans rice the meat the best part was the coke. I do not recommend at all too expensive for the quality and taste. Bland food no flavor."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eGIybmt3RRAB",
            "text": "I like this place for a nice dinner or lunch, service could be better but the food makes up for that in some ways. The pork chops to die for, love the house dressing for the salads. I've had their shrimp and steak. They only make pernil if they're catering a menu for you. 😞 But a good place to eat and deserts are delish!…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBemFMcVpBEAE",
            "text": "On my first experience I ordered white rice with the fried chicken...the chicken was hard and old like it had been fried and sitting there, but I said maybe they had a bad day..on the second visit I found a big fly in my beans to go over…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOMUx1QzR3RRAB",
            "text": "My favorite restaurant, I go almost every weekend, the whole staff are friendly it's a very decent place and the food is delicious."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZd0lTbldREAE",
            "text": "Classic go to Dominican restaurant. Many years in business with success and it shows. Food is always good and service just as you expect from nice Spanish ladies great for take out or to stay in. One of my favorite food places growing up."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDaGZXcndnRRAB",
            "text": "Am african american i went inside just to try out the food cause i was really hungry and was passing by. and boy oh boy they did not disappoint not one bit. Staff super cool and professional.. The food had me licking my fingers definitely will be my new go too.."
        }
    ],
    "reviews_count": 71
}