{
    "name": "Saranrom Thai",
    "place_id": "ChIJUU0Hd95fwokR3tAJqfPpDvs",
    "grid": "QN4",
    "address": "81-10 Broadway, Elmhurst, NY 11373, USA",
    "rating": 4.7,
    "user_ratings_total": 956,
    "phone_number": "(347) 808-0545",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVFEya3llamxtVVhWd05USkdkSEZHWWswek1HYxAB",
            "text": "My go to spot on the block!! The shop is a bit small but the service is really nice and the food is too good for the price."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQmNUSjVSR3huUW1SQ2FWcHZaSEl6Ym5ack0wRRAB",
            "text": "Amazing service by everyone, even the host!!! Loved the Thai iced tea, the best I’ve had in a long time and the mango sticky rice was so yummy. Portions are good and enough to share! Only giving it 4 stars because my crab meat fried rice was lacking in flavor a bit."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORVlqRjRXRzl0YTNCeU5IQkdaVFl0TUZSWlZHYxAB",
            "text": "I have ever tried some of other food here, it has been ok so far but once I ordered Nam Ya Pa from uber eats but was very disappointed with it. There was no taste but sour!!! Like lime soup. It's even like rancid food. I was crying for this. And the noodles are so thick"
        },
        {
            "date": "4일 전",
            "language": "th",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeVYwUldjREY2VkVFd1QyZFpZM1ZVY1dsbWRuYxAB",
            "text": "อร่อยมากเลยค่ะ ชอบ"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobFMwWXdWSE50ZFZrMVFqaDJlakpJWkZGaFdsRRAB",
            "text": "The food here is delicious. I like the coconut sticky rice, mango salad, and other dishes they serve here. I have had about 5 different items on the menu, and everything tastes great."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVFFVaEhhVUUyV1dSeVdXTlhWRmxJWlRRdFFrRRAB",
            "text": "i loved everything about this place"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxS05ETTJTbmhqVVhSVldXMHlZM055U1Y5cVZVRRAB",
            "text": "First time checking out my neighborhood and I’m honestly impressed! The staff were super friendly the moment we walked in, and the place had such a warm, cozy vibe.\n\nWe started with the Pad Ped Pla Duk and Fish Cakes, both were packed with flavor. For our mains, we shared the Khao Soi noodles and Kee Mao Thai, and they were amazing! Generous portions, really tasty, and the spice level (mild) was just right.\n\nDefinitely coming back and telling my friends about this spot. Such a hidden gem in the neighborhood!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONk5GTnZVRXRRYXpWWVFreExXRzEzWDNGQlpGRRAB",
            "text": "Cheap and authentic, my favorite Thai spot in the city"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcFoxOUxUVVEyU0dGaFNXaHNXa2h1YTNoaldsRRAB",
            "text": "I love Saranrom and have been a consistent customer since 2022, but the past few times I've been I can tell their spice level has gone down significantly.  Back in 2022, I remember the spice would always knock me out in the best way, but now it doesn't even give me a kick at all. My partner and I ask for Thai spicy and the servers always ask if we're sure about it, saying how it's *very* spicy but it's been lacking. If I want my spice fix I go to Khao Kang.\n\nThat being said, the flavors are all there and the food is still delicious. The staff is always friendly and attentive, but the tables are so close together that if I have to get up for the bathroom it's very awkward for the table next to me 🥲"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNd1JUUklNbUp3VjFkdGJEUkpaMXBXYWpsdlZuYxAB",
            "text": "The food here tasted similar to the food we’ve had in BKK but wasn’t as spicy. If you enjoy spicy food, you can consider asking for extra spicy rather than the regular spice levels. Our server, Mia, was super friendly and helpful:)\nThe place is also very crowded so please keep that in mind if you have a large group!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCb01XcHhkelF4Wm1wUmRGaDBkRGs1WjBOdlJGRRAB",
            "text": "Neighborhood hot spot for sure. Long wait but it was prime time on a Friday night so that was expected (we didn’t live in the area otherwise would consider takeout). When we finally were seated service was prompt and dishes came out quickly. Really generous portions; a good spot for a group to share. Wish there was a wee bit more time in-between appetizers and entrees since we had a small table for two and plates were piling up/getting cramped but we packed stuff up to make room =)\n\nEvery dish was very flavorful, aromatic, and complex. A harmonious balance of sweet, sour, salty, and spicy (they don’t play with the chilies here). No mango sticky rice, but was pleasantly surprised with their take of tangyuan.\n\nStaff were really friendly and regularly checked on us (without feeling rushed). Would definitely come back to try more of their extensive menu."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUVVYUlVTSGRrT1haWVlYUTFMV1ZVYnpkS2JtYxAB",
            "text": "Tried Saranrom years ago and was not impressed but gave them another try today for dine-in and love the meal. Staffs were friendly, welcoming, and attentive since you walk in and constantly check in on you to make sure you have what you need. Food was served quickly and delicious. Portion is very generous especially compare to price. Highly recommend their chicken garlic - simple but made just right and reminds you of authentic street food in Thailand!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzdFVVdE9MVUpGUm5aT1lVWlhSM0pqWWt4NVpVRRAB",
            "text": "Had the worst experience ever! Went for mango sticky rice but their mango went out of stock. A Thai restaurant without mango sticky rice is a big no for me. Then we ordered Pad Thai and Fish cake. Fish cake was so small. I have added comparison picture  at the end so that people don’t get fooled. I said clearly no peanuts on my Pad Thai but they added peanuts. Clearly no idea of what they’re doing.\nI was honestly disappointed with their service and behavior. Don’t get fooled!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdU5XbE1aVTVJTjI5eVJGZHNjWGszVmpJeFRrRRAB",
            "text": "Always one of our favorite places to go when Thai food calls from the universe!\n\nThe service is excellent. They always pay attention to the customers and make sure everything is running smoothly at our table. We also get to enjoy the music, a great selection!\n\nI guess that's why they got a Michelin Bib Gourmand! A must-visit when you're around here."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waFlrMXpTM0oxYzNOR2NGUkViRXBHV0dKMllYYxAB",
            "text": "Very good restaurant and service. Dont try to be brave like me and go ultra spicy. When it's spicy, it's spicy"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cdk16QTJkMU5wY0RkRmFVVTBPRzk0VHpadmFXYxAB",
            "text": "I had a wonderful time! The food was very good, and the service was excellent. The waitresses were friendly, attentive especially Mia , and gave great recommendations. I will definitely be coming back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bFJHRm9TRE5wZDJZM1lteEVORXAxUlhKaVVFRRAB",
            "text": "I loved everything about Saranrom Thai! The food was delicious, the atmosphere was cozy, and the service was excellent. I’ll definitely be coming back! 💛"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MFNEQktWalExVFRNelkycEVORVZ2VERFMldXYxAB",
            "text": "Amazing. Get food from here now. Everything is good."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMFFrcElaVGRFYmw5MkxXbDVha2MzVFdKVGMwRRAB",
            "text": "Food is sometime inconsistent, but mostly good. The servers are all friendly, ours today was Mia, she's nice and knowledgeable"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eVNqSTJXVkkxZURVM1RXeE1URWxHVlhCbUxWRRAB",
            "text": "Absolutely top notch restaurant, highly recommend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wdFVuTjBUM2xpVDFKdVkyOWlhWEJKVWxOZlNHYxAB",
            "text": "This is by far the best Thai food I’ve ever had! Not only was the food delicious, but Emily, our waitress, was extremely welcoming and provided amazing service. I highly recommend coming to this restaurant — everyone is so nice, and the food is absolutely fantastic!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1QlltbENWVGd6UjJWc05HUktMVVIyWW1rMk1uYxAB",
            "text": "Absolutely amazing experience at Sa Ran Rom Thai! From the moment we walked in, the cozy ambiance and warm hospitality set the tone for a fantastic meal. Every dish was bursting with fresh, vibrant flavors — the mango salad was refreshing and perfectly balanced, the pad kee mao with shrimp was spicy, savory, and addictive, and the whole crispy fish was a true showstopper: perfectly fried, tender on the inside, and topped with a delicious garlic sauce and fresh herbs.\n\nThe drink was refreshing and paired beautifully with the bold flavors of the food. Presentation was on point — every plate looked as good as it tasted. The service was attentive, friendly, and made the whole dining experience even better.\n\nIf you love authentic Thai cuisine, this spot is a must-visit. Highly recommend it — we’ll definitely be coming back! 👏🍤🐟🥭"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMlkyNW1XazlsTXpkQmF5MXdjSFF6ZFRKcVltYxAB",
            "text": "Best Thai food we've ever had!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TlVWUm1SM1pwY1dSdmVYbE1XbDh6VFdKcFZrRRAB",
            "text": "I went to this restaurant with my boyfriend, and wow. It did not disappoint! It’s a small place, and there was even a line to get a table, which already tells you their food is top tier!\n\nThe customer service is A1. From the receptionist to the servers, everyone was so kind, friendly, respectful and helpful. You really feel taken care of here.\n\nThe food? 100% authentic Thai. They even have different types of papaya salad to choose from! Which I love.  Everything we tried tasted just like home.\n\nHonestly, I’ve tried a lot of Thai restaurants around Queens, but this one takes the crown. Coming from a Thai woman who loves to eat — this place is the real deal! 🇹🇭✨"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WExYbEZka055VW1odlozYzJUMVpOTlhkM2RVRRAB",
            "text": "This place is the real deal for Thai food.  Flavors are amazing."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUGMzUjRVMHhxTjNaNmNtNUtWbGhsZDBoNGRrRRAB",
            "text": "The food is very nice and server Looknumb L. Is very nice she recommended food so nice!!"
        },
        {
            "date": "수정일: 4주 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkLTVTVnBBRRAB",
            "text": "点了超多次了 今天来总结一下\n好吃：crispy duck curry; crispy pork with string bean; pad thai, crabmeat fried rice；moo ping\n一般：drunken noodle， iced thai tea\n不好吃：✖️crispy duck salad, nam ngiao，fried tofu，蟹肉饼，crispy pork with water cress)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjd2VsbzNXWFp3TkdWeFowNU1WR2t0WTFWQlZXYxAB",
            "text": "My fiancé and I eat from here so often that I’m so sure they have our order memorized everytime we call lol. Saranrom Thai is one of the best— if not the best— Thai spots in Queens that we’ve tried. Thank God we live nearby. We love the drunken noodles and chicken panang curry from here. The curry puffs are also delicious. Even though we just pick up our food, the interior is so cozy and intimate but the restaurant is always packed. Must be a popular spot, we’d say it’s well deserved. Also have not met a single staff member who wasn’t the nicest human to us. It’s very nice when service matches the quality of the food :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTGFITkdTazV0Tm5FeWIyZGFUVnAwVjFCU1IwRRAB",
            "text": "Our first time dining here was nothing short of fabulous! From the moment we walked in, the host welcomed us with such warmth, kindness, and genuine charisma that immediately set the tone for a great evening. Our server was equally wonderful—friendly, attentive, and incredibly professional, making sure everything flowed smoothly.\n\nThe food? Absolutely spectacular. Every dish was bursting with flavor, beautifully prepared, and served fresh. It was clear that a lot of care goes into both the recipes and the presentation. The Crabmeat Fried Rice, Pad Thai, and Massaman Curry were standouts—delicious, comforting, and authentic.\n\nAs first-time guests, we couldn’t have asked for a better introduction to Thai cuisine. The combination of outstanding food, excellent service, and a welcoming atmosphere made this experience truly memorable. We left grateful, satisfied, and excited to return.\n\nHighly recommend this spot for anyone looking for a genuine, delightful Thai dining experience. Thank you to the entire team for making our evening so special!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUmRHVXRZbEprU1hsTWJFcEdjWEF3UlhsdlpsRRAB",
            "text": "Best thai food in town"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTWJ6bFNWVGRoVG1acE5rVllUbTh3VTFaYWRuYxAB",
            "text": "Its a shame you pay extra to add more and they put less then when you buy it regular so I feel like I got robbed then when you call them to complain about it they say oh next time you come we will take care of you then come next time and they say you didn’t speak to me and they don’t make it up to you the food is not cheap so you’re getting robbed big time sometimes I spend $90 a week I’m not buy here anymore and they need somebody that speaks good English when you ordering you don’t understand them And they don’t understand you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaU5qbDJVV3BQTmxKa1EzaFZjRlphUzNSWlZHYxAB",
            "text": "Great place. Staff is great! Jess is very nice"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMmIyaEZjWGhZWTI4eFVDMXdNMmxIUzE4MVVHYxAB",
            "text": "The seasoning was just right on every dish. Great experience overall."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbE56SmtNbEEwTVZaeFUzUnhURFZGWkVKaU0zYxAB",
            "text": "Food is always really good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SlpYRm9YMGRhTlcxck1sbEdVekJPV2xKSlpsRRAB",
            "text": "wanted to try this place for so long and totally lived up to the hype!! everything was so delicious and flavorful, amazing ambiance and service 🤗\n\nwe got the mango catfish salad which was super refreshing and tangy, def worth a try but idk if i would order again. for mains we tried the panang curry and kee mao thai noodles and both were so flavorful and fresh!!! love how everything is actually spicy here and not overly sweet at all!! thai iced tea was so refreshing and the mango sticky rice was life changing the mango portion was so generous and the rice had little caramelized crispy bits…🫣 i highly highly rec this place it’s worth the trek! they don’t take res and we waited ~90 mins on a friday evening."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsZmJGcDJiMEpRWVRVMGNsRk1WRGRMWVVkQlEzYxAB",
            "text": "A great Thai restaurant where everything—from the food to the atmosphere to the service—feels authentically Thai. Their chef’s specialty dishes are a must-try, many of which you won’t find at typical Thai restaurants. Definitely worth recommending."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNFVYTjBSVjl6ZEhGU2QzY3lUMHRoU0VSS1NGRRAB",
            "text": "If you want good Thai food, Elmhurst is the place to go and more specifically Saranrom Thai. I've been to this place many times and every time the food was amazing! Throughout my visits I have tasted different noodle dishes, their curries and fried rice and a number of their appetizers and ALL were good! My friends have also enjoyed their dishes every single time!\nThe service is always very attentive, prompt and friendly.\nIt can get busy around lunch time and weekends. One time, during rush hour, they offered us complimentary drinks because we were waiting a little longer than usual. Very thankful for that and it shows that they truly appreciate their customers."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeGMzWTROV3hXYVZBMlFYWnRUMFZ0YVdadlVVRRAB",
            "text": "Food: few food options.\nService: it's okay\nAtmosphere: place too small"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONVoxVm9jWEI0WkRGVExXVmFjbGRoTFdOMFltYxAB",
            "text": "I looooooove ur food so much!!!\nevery time for uber eats is perfect!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMllVVjVSVXMxU1dWSFJtSjRNVWhFVWpObFJFRRAB",
            "text": "My name is Tai. I order from this restaurant damn near every week. I have tried EVERY Thai restaurant in NY. This one gotta be THE BEST ONE.  VERY AUTHENTIC.\nThey make The best papaya salad they have  different versions of papaya salad which I LOVE. I get some tum plu para all the time because I can't get it anywhere that's this authentic. Their foods remind me of when I used to live in Thailand 🙂‍↔️🙂‍↔️🙂‍↔️\nReasonable price.  Not too expensive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMk5rUktlbU42ZW5WRmMzVkpTRmhTVERVMGJVRRAB",
            "text": "Phenomenal. My husband and I are avid Thai food eaters and were blown away. Every dish was outstanding, the vibe was fun, the servers were friendly and the price was right. What a gem. We will definitely be returning!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSE1HdDFSV2xUUlZCUVkxaDRRbE4zYUV0c2QwRRAB",
            "text": "The food and service is amazing. The duck curry was our favorite. Super tasty to the point I was surprised how good it was. The dish has a perfect recipe"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waGRVSnZWbkZEWlRCVU5FaDNYMFIzWms5Uk9VRRAB",
            "text": "Authentic. Delicious. Obsessed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMVExWndabFJaZEhGclltWlVhV0pqWWsxa1dXYxAB",
            "text": "I think this might be the second best Thai food I've had in NYC. Now, I've been to a lot of different Thai restaurants in the city. Most of the Manhattan ones were mid, and the Queens spots were always popping. But Saranrom Thai just gets it, dude. The atmosphere is very modern and chic - they have lots of cute and artistic ornaments and decorations. The staff are super welcoming and extremely attentive. The only negative would be that the space itself is a little cramped and fairly narrow, but they're making the most of the limited real estate.\n\nWe ordered their mango catfish salad, duck basil, drunken noodle, and the shrimp and glass noodle bowl. The catfish salad and drunken noodle honestly blew me away. That was probably the best drunken noodle I've ever had, no BS. The vegetables were cooked perfectly, the flavors were strong and poignant, and the portions were large and filling too. Best part - everything came out to under $100 for three people, and we were stuffed to the gills afterwards.\n\nSeriously, do yourselves a favor, and come here. Make sure to get there early because the wait-list fills up extremely fast. I can see why they were on the Michelin guide for four years in a row. Another standout restaurant in Queens and why this is THE best borough in NYC for food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbmRURkpjRmxOY1VodVdEWmhNak5hU0VSeVdIYxAB",
            "text": "Hidden gem in Elmhurst, but close to Jackson Heights. Small restaurant, but delicious food and good service. A must visit if you are interested in authentic Thai."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bk1YTm1iMlpsVTBrMGVFc3pYMHQ1TUdaRU5YYxAB",
            "text": "Best thai food around!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTFRWWlJRbmw0VkVkNlVtcDRhbGRJUmpaemRYYxAB",
            "text": "Some of the best food in NYC place is OFF THE HOOK 🪝"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVVNHVnRNRE5RUjNsTlFtcENlRzAyVHpJNFkxRRAB",
            "text": "delicious and reasonably priced"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWFNEbFBRM1JJY1V0V1lrSkZUV0kzWVRkbGNXYxAB",
            "text": "Been here twice. Very salty in general."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TFRXNVNZMFJEVlhGaGJtUnZNbEl5VWpCaU1XYxAB",
            "text": "Good pad Thai. Need to go back to try more things."
        },
        {
            "date": "4달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KYWFVYzNaMWx6WlZwME1raDVSVjlhUkc1TmIxRRAB",
            "text": "여기는 그 미슐랭받은 catfish 어쩌구가 존맛이에요. 그거 꼭 드세요. 다른 메뉴는 생각보다 막 엄청 인상적이진 않았어요. 공간은 작아요. 참고하세요."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbTY3V3F3RRAB",
            "text": "😊😊😊😊😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWk5HTjBVamRMUkZZMmJqZGZVWGR4V1MwMGEzYxAB",
            "text": "Went there during lunch specials and had a great time. Was meaning to try this place out for so long but just didn’t had the chance to but we finally made it. The staff were super welcoming and friendly and very attentive too and the food was the best Thai food I had in a while. We devoured everything and the mango sticky rice was heavenly( I had mango sticky rice in Bangkok but they had the best ones). The mango was so ripe and sweet and the rice was so moist. Still dreaming about it. Would definitely be going back!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KamQxSkNNVzlQYkcxeVdtZ3dXbTlmTkUxU1JYYxAB",
            "text": "Took my mom here for her birthday and we had an amazing lunch! We walked in without a reservation and by noon the place was already packed. We only waited about 15 minutes for a table, and there's plenty to do nearby while you wait.\n\nThe space is bright, cozy, and inviting. We ordered the red curry, pad see ew, drunken noodle, and the raw marinated crab with mango salad. Everything was so fresh and full of flavor. The red curry was my favorite dish."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLUzFwYkhqNDR5R25nRRAB",
            "text": "The food was very good and they had a steady stream of customers.  If I am in the neighborhood I will definitely come again.  The Bangkok beef salad was delicious—crunch fresh vegetables and cooled stir fry beef.  My drunken noodles had a great flavor but the beef was a little tougher.  The pork skewers were delicious.  The only disappointment was the fried chicken wings which were very salty and a little less than average. The drinks in their unique glasses were too adorable. Great neighborhood spot—would recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWmNtWjJaM0kxWlZoVWNYUkdhM1JqUkhoQ1RYYxAB",
            "text": "I came here for the famous mango salad, BBQ pork, and crispy garlic pork — and I was not disappointed. Every dish was bursting with flavor and beautifully presented. The mango salad was fresh and zesty, the BBQ pork was tender and perfectly seasoned, and the crispy garlic pork was simply addictive.\n\nThe staff were professional, attentive, and genuinely friendly, which made the whole experience even more enjoyable.\n\nHighly recommended — I’ll definitely be coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aWRESXhWMWhpTkZCd2QzWkxUVUZrVjJ3MFVGRRAB",
            "text": "Regarding the ambiance and customer service, the music and overall atmosphere were delightful for a first-time experience. The environment was so pleasant that it evoked a strong emotional response, and a wonderful aura seemed to permeate the space. The other patrons were also quite considerate. I found myself enjoying the music. The servers and host were attentive, promptly refilling my water glass. Although there was a wait, it was worthwhile, which leads me to my next point.\n\nThe food was exceptionally delicious and of the highest quality. While I only sampled the fried rice and a beverage, the flavors were unlike anything I have experienced, in a positive sense. Each element was exquisite, and the dishes appeared to be prepared with care, making me wish to explore the entire menu indefinitely."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOTZpNEZnEAE",
            "text": "Have heard a lot about Saranrom and it lived up to all the hype. Came here with a party of 3 and ordered 2 appetizers, a salad, and two entrees. Not only were the portions huge but they were also all so so delicious. The moo ping stole the show, it was so tender and well seasoned- perfectly sweet and salty. We got the miang ka-na which was a little too sweet for us but loved how vinegar-y and bright the flavors were. The yum pla duk fu (catfish and mango salad) was the best - loved the tangy flavor and the textures. The entrees were clam with basil sauce and the pineapple curry duck. They were both amazing, semi similar in terms of taste profiles of the curries. The duck was a little more citrusy - the meat was very well cooked. Prices are beyond reasonable , food is amazing, quantity is more than enough, and the staff are incredibly kind and attentive. (Our server Mia was the best!!!)\n\nI will say we booked via google and it seemed like the system didn’t go through to the restaurant itself so would be wary of that. The staff and owner are incredibly sweet though and sent a sticky mango rice!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xndGJEaG9aa0YyYVVrdFFXbE9NVFJ5V0U1cVRGRRAB",
            "text": "I love the food here. Had no complaints with the food. We ordered so much and our bill was still cheap! Everything we tried was fresh, flavorful, and perfectly cooked. The portions were generous, and the menu had plenty of options for everyone. My favorite dish was the clams with basil sauce. The staff was friendly and quick, and the atmosphere was cozy but casual — great for a relaxed meal with friends or family. Overall, Saranrom Thai is definitely one of my new favorite spots for authentic Thai food at a great price. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JM1VrNVZSSGxMTmxCdWFVRnBlV2M1YmpoT09HYxAB",
            "text": "Cozy spot with really delicious and reasonably priced food.  We all got the lunch special of noodles, rice, and curry.  Ended it with mango sticky rice of course.  The dishes were so flavorful and the service was wonderful, we were all very happy.  Highly recommended."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKc01VUlVNMWx0YW1wTWIwUnVURTl2ZURSYVlWRRAB",
            "text": "This is by far the best Thai food I've ever had. The mango salad was my favorite dish plus the fired ice cream which is to die for. THIS RESTAURANT IS BEYOND INCREDIBLE!! IT HAS Michelin stars and the prices are affordable."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTGNpMU9UbnBpWW5CMWJ6UlBabDk1YTBkWGVVRRAB",
            "text": "The food here was deliciously and so reasonable priced with great portion sizes. I had the pineapple duck, as recommended, and I’ll definitely be back to have this same exact dish again. I paired it with a cucumber cocktail which was perfect on a warm summer afternoon. The service was speedy and our server was kind and helped me choose a dish. They also accommodated our friend’s allergies. I can’t wait to come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWYWNqSkZUVTV0ZURabmFtNVdaVmxrWkhZemRHYxAB",
            "text": "Food are excellent with right amount of heat and sweetness. Went on Friday afternoon and was able sit right away. One of the better Thai restaurant I have tasted in New York."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V2NpMVNRa0pVVEhaRE56TkJaME5GTFVwbU4wRRAB",
            "text": "I love this Thai restaurant! Every dish was so flavorful and truly authentic. The pork boat noodles were my favorite, rich and delicious. If you’re craving real Thai food, this place won’t disappoint!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvenNQcktnEAE",
            "text": "Soooo good! They automatically gave us water without ice and I knew I was in for an amazing meal. Ordered the drunken noodles with crispy pork. So flavorful and delicious, and the meat was amazing! Spring rolls were so fresh and hot. I was in Thailand over the summer and I absolutely approve of this place. Prices were so great, and great lunch specials! The drinks looked so cute as well!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1ME0xbGtiSGhaVmtkVGRrOHRiV0pVTjB0eGNrRRAB",
            "text": "Great impromptu spot to have dinner here. Went on a whim in the middle of the week and did not realize they were Michelin rated and a small square space so hence the wait time for a table. The host let us know transparently but we decided to put our name down, got a call in 45 min. Got seated and tried their signature cocktails with soju. Superb. The dishes were unique to other Thai places you see in the city so that was a treat. Staff is so friendly and accommodating, very attentive despite traffic. Food is made to order so you get that authentic flavor and freshness from all the herbs and spices."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVlVEazFibDl4VlRCdWFVMXJZVEJVUTI0MmMyYxAB",
            "text": "A very affordable and flavorful meal! The Michelin bib gourmand dishes are complex in flavor and textures and are definitely must tries. The yum pla duk fu was the best dish of the meal. The miang ka na was a mouth puckering mix of spice…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJa19teHF3RRAB",
            "text": "This Thai restaurant in Queens is definitely a gem, if not a hidden one given how busy it was when we visited this past Saturday! It’s cozy and intimate, perfect for a romantic dinner. The food was fresh and flavorful, with a variety of dishes that you don’t usually find in NYC Thai restaurants. On top of that, I found all the prices to be very reasonable. And the service was top-notch - our server, Jacob, was super friendly and helpful. Just a heads up, they do take walk-ins, but it’s very popular, so I recommend making a reservation. When we went on Saturday at 6:30 p.m., we had to wait about an hour for a table."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMkp2c2JBEAE",
            "text": "For me, this is probably one of the very best Thai restaurants in NYC. I travel to Thailand almost every year and I am not easy to impress. The mussel pancake is outstanding. Not every Thai spot serves this dish. Even in Thailand, seldomly you find a place that is really good.  The service staff is very attentive. Mia was super helpful with our order and another guy (didn't catch his name) also cleans and fill water when he can. The experience was just spetacular. I don't live far so I will be back for more."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvODdHRHlRRRAB",
            "text": "Delicious. Spontaneous stop and I’m so glad I did. The small space is cozy and decorated well. The music was fun and lively. The staff were attentive and friendly.\nI decided to get my staple, green curry with tofu and Drunken Noodles. I picked mild for spice level because I know Thai in Queens is serious. Spicy is foundational.\nThe curry was flavorful with so many vegetables and fired tofu cubes. Served with perfectly cooked jasmine rice. The Drunken Noodles were rich with slightly sweetness from the tomatoes. The recommended squeeze of lime brightened the dish.\nI would definitely come back and try their signature dishes and others. So many to try."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204elJVMWtlWHBWYWtkalF6Tk5hR2hXWldoQmVYYxAB",
            "text": "Hands down, my favorite Thai place in New York City - and I go to a lot. I always take my friends here for special occasions. The Michelin guide rated dishes are amazing, and I finally got to try them all:\n\nMiang ka-na - This dish is sweet and savory, and you get to wrap the incredibly seasoned pork in broccoli leaves for a delicious roll within every bite.\n\nYum pla duk fu - You are in for a treat here. There are so many different textures to this dish, from the crispiness of the breadcrumbs to the softness of the mango, while also providing a spicy and sweet mixture throughout.\n\nSouthern spicy minced pork - My friend was nervous about the spicy level of this, but it turned out to not be too bad. I would have even kicked it up a notch, having tried many Thai places that are much more challenging on the palette.\n\nOtherwise, I've also tried the pineapple duck curry, which was delicious, and the mango sticky rice as well. I'm salivating writing this review, and already looking forward to the next time I come here."
        },
        {
            "date": "4달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNlRYcEljSE5qVVZWa01YaFdSVmhuVjNCNVFXYxAB",
            "text": "O lugar é pequeno mas super aconchegante, recomendo fazer reserva porque sempre esta lotado. A comida é um show de delícias, um prato melhor que o outro, o serviço é excelente estão sempre atentos ao cliente. Realmente merecem ter 3 estrelas Michelin."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUFp6VXRjWEIzV0VGUE0xVTRRbTl2WDE5aVMzYxAB",
            "text": "This was my second time trying to dine and this time I was successful. The dining area is very small, not much room to move around, but when I tell you the food was delicious. You also get a lot for your money. I can’t wait to go back again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQ01FMVpUSEpwV0VGVlRtWlBiVTlqTTBWa2NWRRAB",
            "text": "Yall need to check this Thai restaurant out!!!! This is fire with the most authentic Thai dishes, the staff here were very friendly and did their excellent service.\n\nI had Thai E-San Sausages for app and Papaya Salad (Spicy one) I literally died for this one sooo good, and I had Drunken Noodles which come as Thai style as I asked the server and it come out really good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMGJpSTlRRRAB",
            "text": "Went here a few times but it’s been a couple of years since. Today is the first day we had lunch. Great lunch prices and serving sizes; comes with choice of spring rolls or fried egg. Even regular menu prices, and drinks, are lower compared to other Thai places.\n“Mild” has enough spiciness for me. Was told “medium” is thai level so 6/10.\nCrabmeat fried rice and crispy garlic with crispy pork (if you like garlicky) are favorites.\nService is always cheery and attentive.\nArea in the restaurant is small, a bit tight in between tables. Best to make reservations which we’ve done before for larger groups especially.\nMeter parking available in the area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dy1EV2h3RRAB",
            "text": "Great Place with lots of options.\nMy picks were Crispy Cat Fish with Mango Salad and Raw Shrimp Salad.\nThe cat fish was super crispy even tho it is drenched with the dressings and the shrimp was fresh and flavorful.\nHighly recommend if you are looking for authentic bold Thai flavors.\nDon’t sleep on the desserts too ;))"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NzYyZDJRRRAB",
            "text": "The service here was really good, the staff was so nice and cleaned up our table really fast. The food was really good but I would say the portions are smaller. The noodles for my Pad See ew were really big and it was a bit hard to eat but the flavors were still really good. They have a special lunch deal from 11:30-3:30pm where the food is basically $11-12 bucks which also includes spring rolls or fried egg. The atmosphere is nice but the area is quite small so it’s hard to get around."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLM29pX25obGZuZnlBRRAB",
            "text": "This was one of the best Thai food I have ever had. The sweet and spicy fish was out of the world. The staff was courteous and the service was quick."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnemJHSTBWbVZsYjE4M1VXbDVaVFJCTW1oT2NXYxAB",
            "text": "Came at the good time didn't have to wait. The staff was very friendly and attentive but wished they would ask/say something before taking a dish away, didn't get to use my lemon for one of the noodle dishes I ordered.\n\nIn love with their drink, it's very flavorful and innovative. Boat noodle dish was also really good, but there was a gamey or burned hint of flavor, wasn't sure it was from the broth or chili flake they offered on the side.\n\nSom Tum Pha Ra was good, I made a mistake ordering mild because they gave the impression the medium would be too spicy for me. However, this was the first time I was given raw long string bean instead of cutting up and smashing/mixing in the Som Tum.  It was a little bit weird. Also, because it was mild, the sauce base was strong and it was quite sweet, it wasn't bad to balance it with sticky rice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNU3IzOHVENE9hcXBBRRAB",
            "text": "Saranrom Thai | Elmhurst, Queens\nMichelin-Starred Thai Excellence\n8110 Broadway, Elmhurst, NY 11373\n\nTucked into the heart of Elmhurst, Saranrom Thai is a culinary gem that absolutely lives up to its Michelin-starred status. Every dish hit with bold flavors, perfect textures, and beautifully balanced spice.\n\nStarted with the Yum Pla Duk Fu – crispy-fried shredded catfish with breadcrumbs, paired with a spicy green mango salad. Light, crunchy, tangy, and with a slow-building heat that wakes up your taste buds.\n\nThe Southern Spicy Minced Pork packed serious flavor. Stir-fried in yellow curry paste with lime leaves and green peppercorns, it was fiery, aromatic, and addictive.\n\nFried Calamari came next – tender squid and crispy tentacles, perfectly marinated and fried, dipped in sweet chili sauce that brought the perfect contrast.\n\nWe also tried the Curry Puffs – golden, flaky pastry filled with curried ground chicken, potatoes, and onions. Comforting, savory, and a great appetizer to warm up the palate.\n\nDessert? Out. Of. This. World.\nThe Mango with Sticky Rice was pure magic – ripe, juicy mango with sweet sticky rice drenched in coconut cream and topped with yellow mung beans. A perfect bite every time.\nThe Fried Ice Cream was the nostalgic finish – crispy on the outside, cold and creamy inside, with a drizzle of chocolate that tied it all together.\n\nWhether you're a Thai food lover or just hungry for something extraordinary, Saranrom delivers in every way.\n\nSpice level: Be ready – it builds!\nVibe: Elevated but cozy\nWould I go back? In a heartbeat.\n\n#MichelinEats #ElmhurstEats #ThaiFoodHeaven #SaranromThai #FoodieInTheBigApple #QueensEats #YumPlaDukFu #MangoStickyRiceMagic #NYCFoodie #SpicyFoodLovers"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdXZ6am5nRRAB",
            "text": "Really delicious! We tried all three items from their Michelin Bib Gourmand section and it did not disappoint. For the Southern Spicy Minced Pork, they include the peppercorn into the dish, so be careful not to eat it unless you’re someone that can take that kind of spice.\n\nDining area has great vibes, but is relatively small."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMUpUc3dRRRAB",
            "text": "great thai place in elmhurst! really enjoyed the pineapple duck curry. expansive cocktail menu with lots of cool drinks as well. would definitely come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLXBiUFdREAE",
            "text": "Excellent food, excellent service, wonderful atmosphere. Our server Jacob was super friendly and attentive -- the entire staff was, and Jacob himself was very engaging. If we had more room, we would've stayed for dessert! Highly recommend the mussel pancake, the chicken panang curry, the yum pla duk fu, fried tofu and the crispy pork with basil. Those with a sweet tooth will enjoy having drinks here -- Thai iced tea, iced coffee, Shirley Temple and Purple Limeade."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNXBXcXRnRRAB",
            "text": "Decent Thai food, but I feel like seasoning can sometimes be off. For example, the boat noodle is a bit too salty; if it is seasoned better, it would be great. Lots of meat in there as well! Kee Mao noodle is well-seasoned, and medium spicy level  is pretty spicy already. I didn't really like the fried tofu since it is not as good as Mam's. The stewed pork is too fatty for my liking. They do have a lot of options on the menu, which is great. The restaurant is quite small so during peak hours, the wait can be long. Recommend calling them to reserve a table."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc3NPcXFnRRAB",
            "text": "The broth from the pho is rich and you can tell that its authentic from the first sip. The food comes out pretty quick. Overall you get more portion for your dollar, will try to come back."
        }
    ],
    "reviews_count": 85
}