{
    "name": "Morena's Kitchen Bar & Restaurant",
    "place_id": "ChIJt_G1aDNfwokRwr6E98C0dNw",
    "grid": "QN4",
    "address": "111-20 Roosevelt Ave, Flushing, NY 11368, USA",
    "rating": 4.7,
    "user_ratings_total": 93,
    "phone_number": "(718) 803-2015",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTmFYZEtNRWRhY0RkNlVGTjVSRlJJYWt4alRGRRAB",
            "text": "Beautiful place with beautiful people. The food and drinks were tasty and everyone was so sweet. We tried the mofongo de cerdo and bistec encebollado, as well as the sangria and the Lorenita cocktail and everything was delicious!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSGVWUmZVMjg0WWpkelZUSmpSRlZMTVRrNVMzYxAB",
            "text": "This food is the best I’ve ever had in a long time my first time trying Dominican food and I’m hooked thank you to Lorena and family did amazing job serving and you can tell the character and love that went into this place !"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSlZqQkdUM1puU0RaQ1pFMTJaMnh5ZUhWbE1tYxAB",
            "text": "Lower marks for this restaurant make me question the reviewer. The kitchen delivers satisfaction. Food here is fairly priced. The workers showed authentic warmth. I'll be back here for sure."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KS2NXbERiVFJaYnpCUWMyNVJSSGRDV1dKVlJYYxAB",
            "text": "Absolutely amazing!!!!!! Came here for a quick dinner before the Post Malone concert in citifield and it clearly stole the show. Servers were so attentive and the food was made with so much love. They were so nice and the owner is actually a famous voice actor."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUWNYTmhUbmwxVVRjNE5USTBZMGxpUWtkYU4yYxAB",
            "text": "Great authentic Dominican food with personalized attention to detail! I  loved the presentation of food and would recommend rabo (oxtail)... proque eataba rico 👌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psT1FuSlFXak50UW05eVNuUlZUWFowVkZGS1gyYxAB",
            "text": "my mom would definitely judge me for going out to eat “food we have at home,” BUT it is very familiar and genuine Dominican cuisine. Would recommend whole heartedly and the Soñadora is too yummy.\n\nI completely forgot to mention how friendly the staff is. Also, how clean the place is."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kc09WbFJVMmhWZFVka00zVnJiSE5yWVZwV1YxRRAB",
            "text": "In my opinion , this place had the best mofongo I’ve had yet in New York. This is the closest you’re going to get to the best mofongo from DR or PR and had oxtail gravy with it. Food was made with love. Pernil was really good, mofongo was really good , yaroa was really good, flan was slamming and can’t forget the bev but the morir soniando was one of the best. Nice restaurant , great service , great food, solid prices. Can’t ask for more."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oR1JIbGpiazlvZEcxMlYybERWazVwVDNCYU5HYxAB",
            "text": "First time having Dominican food and it will not be the last! The food is delicious and the staff are lovely!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONFJWWkJWbGhQWlMxWE16WXhkWEUxV0U1RmVGRRAB",
            "text": "This place is a hidden gem.  Food was fresh and delicious.   My favorite was the tostones relleno de rabo, my kids loved the pechurina.  Service was excellent, boss lady and daughter very friendly and welcoming."
        },
        {
            "date": "2달 전",
            "language": "pl",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQlNGaEdZVGxFYmpCbmNIVnRiMGw2UVdoU2RVRRAB",
            "text": "Jest ok"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VU9EQjVkMnd0TFdRemVHOW9iVWRZVHkxNFVFRRAB",
            "text": "I’ve been coming to this place for the past 2 years, this place is amazing. The service 10 out of 10, the food 10 out of 10. Full family vibe. Lorena & family are amazing people. The food is amazing, I recommend trying everything on the menu little by little, you won’t regret it.\nThank you family…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSVVXRnVOelpxVmxJeE5WSnROakY1YTBjeGQxRRAB",
            "text": "This spot has been on my list for the longest, and I’m so glad I finally made it. The service is truly top tier you feel right at home the moment you walk in. Everyone’s smiles are so genuine, and Morena, the daughter, is incredibly sweet. She shared the history of the place, which makes it even more special knowing it’s family owned. The food was outstanding! I loved my chicharrón de pollo, and even my picky husband was impressed with the chivo. We’ll definitely be back to try the rabo!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMFUwTjFOVTlxYkhjNWFEUlZNMGh6TlU1dldGRRAB",
            "text": "⭐⭐⭐⭐ – Morena’s Kitchen Bar & Restaurant\n\nIf there is a place that combines flavor, hospitality, and an atmosphere that warms the soul, it’s Morena’s Kitchen Bar & Restaurant. From the moment we walked in, we were greeted by Lorena, the manager — a charming, humble woman whose warmth makes you feel like part of the family. Her smile and kindness are not just professional gestures, but a genuine reflection of her beautiful heart.\n\nThe kitchen is led by Morena, Lorena’s mother and an extraordinary chef, who together with her daughter and son form a loving family team that cooks and serves with true passion. Every dish is crafted with the same care and devotion as if it were for their closest loved ones. We tried the chicken breast with white rice — juicy and perfectly seasoned — and the goat with rice and beans, a true treasure of traditional cooking, full of flavor, freshness, and that homemade touch only a mother can give.\n\nThe restaurant’s atmosphere is simply enchanting: a beautiful décor inspired by traditional Dominican style, with vibrant colors and authentic details that transport you straight to the island’s roots. Every corner is thoughtfully designed to delight the senses and make you feel at home.\n\nMorena’s Kitchen Bar & Restaurant is more than just a place to eat — it’s a piece of the Dominican Republic in every dish, every smile, and every detail. Perfect for a family outing, a gathering with friends, or even a solo visit, because you’ll always leave with a happy heart and a satisfied appetite."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VU5qRllla3hGTWtaR1pEQnlSbWxxU0hnMlpsRRAB",
            "text": "Morena’s Kitchen in Queens is a true taste of the Caribbean and more specifically the Dominican Republic, with a welcoming vibe that makes you feel right at home. The staff goes above and beyond to make sure you’re taken care of, and since my last visit in 2024, they’ve added a sleek bar that lifts the atmosphere even higher. The decor keeps evolving with a cool, cozy feel that’s hard to beat.\n\nWhether you’re grabbing breakfast at 10 AM (perfect start to the day!), enjoying their great-value lunch, or filling your belly with a hearty dinner, Morena’s delivers every time. They also offer delivery, so you can savor their authentic dishes wherever you are. More importantly they take all the contactless payment options you're used to at other places.\n\nIf you’re new, try their prefixed menu packed with all the Dominican staples — each plate served with that unmistakable touch of love. Perfect for takeaway if you know what you want.\n\nPro tip: Take a quick stroll from the 111th St. 7 train station — just one or two stops from the Mets stadium — and pop in. And don’t miss the chance to refresh in their spotless, thoughtfully designed restrooms (a nice touch after navigating gritty NYC subways).\n\nHeads up: they’re closed Tuesdays but open every other day of the week.\n\nMorena’s Kitchen is the kind of place where authentic food, warm hospitality, and good vibes come together perfectly. Highly recommend stopping by! It's a gem that's easy to miss among so many food options in the area, there is only one Morena's!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcE5sQm9aa2gxVW1OemQyZ3dSalJOVEVWRVVIYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nI had the pleasure of using the catering services from this incredible family-owned Dominican restaurant and it was a hit! The food was absolutely delicious, full of authentic flavor, and made with so much love. You can truly taste the tradition and pride in every bite.\n\nEveryone at my event raved about the dishes—from the perfectly seasoned PERNIL, PASTELÓN, QUIPES & EMPANADAS everything was fresh and beautifully presented. The service was just as amazing friendly, professional, and attentive every step of the way. Lorena handled everything so seamlessly.\n\nIf you’re looking for genuine Dominican food and a team that treats you like family, this is the place. Highly recommend for your next event or even just a great meal out. ¡Gracias por todo!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NlRXcFNTblZGWkdWaGVFbE1UalZoTVhCSWRWRRAB",
            "text": "My family and I visited Morena’s Kitchen from Miami and we LOVEDDDD this place. The staff made us feel at home and the food was so delicious that we went 3 times within 2 days!! You MUST try their tres leches (I still dream about it) lol. If you want to feel like you’re in DR, you must visit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTWNHWTVVMHR0V1ZsVmIzaGFTVlp3TFd0b1VIYxAB",
            "text": "One of the best restaurants I've been to all year. Atmosphere is lovely and food is delicious."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUGFGTk5SRUpWVlRGV1F6aHNibVp4UlhwSGFYYxAB",
            "text": "Excelente comida, ambiente y servicio."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMlRqVjNNM294TVVSbWMzWkpVbkJMWHpORUxYYxAB",
            "text": "Plato delicioso, pero lo mejor fue la atención, súper amables. Plus la decoración también está muy linda, creando un ambiente acogedor que complementa perfectamente la comida. 🇩🇴"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbFgzVm5ObEV0YmpGNGNVdzVRM1JGTlZSWWRFRRAB",
            "text": "Amazing food and most importantly amazing and kind service . Went today for the first time and they did not disappoint. Even my 8 year old daughter who’s a picky eater approved . The food was amazing and and authentic. Can’t wait to go back and try other options from the menu ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ablRXTjZXV0U0VURaS05VRllkRzVPY1RrelgzYxAB",
            "text": "This is the cutest, cleanest little spot with amazing melt in your mouth chicken marinated 24 hours . The guacamole and plantains were delicious. I often feel guacamole is lacking. Not his guacamole. It was extremely hot with heat advisories and we ordered the tamarind juice and passion fruit juice. Boy did it hit the spot. Definitely recommend this place, whole heatedly. Hostess/waitress said that all of the recipes are her mother's and aunts. Home made sesame salad dressing made my husband order a salad even though he was stuffed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTVRqbEllV3RmVmtnNVF6TmljM0ZrWmpFMVgyYxAB",
            "text": "Ordered via delivery, mofongo was delicious as well the chicharrón. Gracias ☺️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SFJXMXRWbFZNTVV0bGJVeEhkVFo1UnkwMFozYxAB",
            "text": "Fantastic food, I was a bit worried since I am a picky eater but I was able to get white rice and while my dish included beans I didn't want any and they accommodated that. The pork I had was fantastic, simple yet so good. When I ordered water I was provided with a water bottle which was nice and the dishes everything came in was super cute. Service was extremely quick, 10/10 would recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVVoxWmZZakZ2WDJOVWMyVktVR2w2TTE5cVlsRRAB",
            "text": "It was like eating in an Abuela’s kitchen!  The atmosphere food and drinks were so comforting!  I truly enjoyed this experience!!! And they played Selena!!! Just know I’ll be back!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sd2JrOUljRWRQV21oRVRtVkRZamhNV2pnMk5YYxAB",
            "text": "What a delicious taste of home! Loved everything we ate at this warm and welcoming family-run restaurant. We had beef empanadas, a small sancocho with white rice, and two mofongos (chicharrón and shrimp, both absolutely delicious). Definitely don’t think twice about supporting this delightful small business — you won’t be disappointed."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLVGluNUNqN3FYUzVnRRAB",
            "text": "Un lugar donde cuenten la carne y cobran $15 por un lunch , hay señores a donde vamos a llegar. 🤦🏻‍♀️🤦🏻‍♀️"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNR1I3WlcteUl2NDVRRRAB",
            "text": "Muy buena comida Dominicana"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNFlEaGJBEAE",
            "text": "This establishment was soooo welcoming. I literally felt like I was back in DR. The food is authentic. We tried it for the first time yesterday in-person, it was so delicious, we ordered it on Uber eats today.  To our surprise the quality and taste was still on point. Mind you it was completely different dishes than yesterday and they didn't disappoint."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ01fYmZnEAE",
            "text": "Let's place is awesome. It's about four blocks away from Citi Field. It kind of does feel like it's tucked away in a corner. It's a family-owned and run business so it makes you feel like you're getting seated in their house. Everyone is incredibly friendly. It is bilingual as well. All of the food that I had was absolutely amazing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvck8zUzlRRRAB",
            "text": "A Hidden Gem in Corona, Queens\n\nEverything about Morena’s Kitchen is amazing. From the moment you walk in, you’re hit with the warm, inviting energy and the space itself is absolutely beautiful. It feels like I’m back in the Dominican Republic at my grandma’s house. Lorena did an incredible job with the decor, creating a space that’s both cozy and vibrant.\n\nThe food? Out of this world. Their happy hour deals are unbeatable $7 Patrón margaritas, flavorful oxtail rellenos, and the creative tostada de chivo are all must tries. Even the traditional dishes like the meatballs, moro de guandules, maduros, and potato salad are on point. They also have some house made sauces that are delicious , I purchased one myself. Everything is packed with authentic flavor and made with so much care.\n\nI’ve also tried their wine and was really impressed by the selection. Lorena is super knowledgeable with pairings and made great recommendations to complement our meal.\n\nGreat energy, great food, and amazing service. Morena’s Kitchen is a true hidden gem that I recommend to everyone."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMVllN3pnRRAB",
            "text": "I happen to come into this restaurant while over here by Citi field and I must say this is a local gem!! I didn’t take pictures bc the moment the oxtail rellenos came out…we devoured them!! Did I mention how delicious they were?!! The hostess Lorena was so sweet and accommodating! The food was delicious and the service was amazing!! Adding this to my local good food!! 10/10 recommend!!!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOTZuQ1lREAE",
            "text": "Todo Muy Rico Y  Buen Servio, El Picante De La Casa Recomendado 👌"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaXFUbVh3EAE",
            "text": "My husband and I were looking for a place to eat after the Mets game. I was really happy that we went with Morena’s kitchen! The food was delicious, Lorena was great and recommended a few dishes for us to try. They were all 10/10. It’s a woman owned business filled with delicious family recipes! Highly recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReEttUFpBEAE",
            "text": "I had ordered chicken on the bone with rice and beans to go. The rice and beans was good but the chicken was not nit wasn't as I expected. Tmit had too much bread crumbs, i thought it would be without. And the chef gave me peices that didn't have any meet on it like thr neck bone which I find disgusting to eat. Thanks"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbThlVmt3RRAB",
            "text": "A regular lunch spot for me. I recommend whatever their soup of the day is. The kind staff is also a major highlight."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnemRMd1d3EAE",
            "text": "Food was great. Service was friendly. We got pastelitos, oxtail stew, and sancocho."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMDdLbVZ3EAE",
            "text": "Amazing food! Beautiful family! Feels like home! Everyone must go and enjoy the food and the love!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfa01DWHZ3RRAB",
            "text": "Every single food item was amazing. Loved the crispy pork particularly. And also the dessert! And the service was absolutely amazing."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfa0lDX1BREAE",
            "text": "Came here with friends and had a fantastic time! Tried the fried pork, stewed chicken, and fried chicken. Each one was de-licious. The homemade guac and tres leches cake were also amazing. Highly recommend checking this place out!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfa0lDdU5BEAE",
            "text": "We found this place randomly, but it was the best experience we could get.\nFamily owned and operated, with the best recipes.\nI got crispy pork and the skin was fried to perfection. Combination of spices is not spicy, and flavorful\nFor sure coming back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmd192ZlFREAE",
            "text": "Clean and very friendly restaurant. The quality is great, The price was not very high."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNk5mYTVnRRAB",
            "text": "El chicharron was cold, the yuca was excellent, the lady serving the food super sweet."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc2RMUW1nRRAB",
            "text": "def will come again, nice place nice people"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2N1lpSWtRRRAB",
            "text": "I felt welcome and love everyone & every details 💕 congratulations 🎊 I will recommend to everyone who love food, familia & home environment 🙏\nThank you to all Morena's team ❤️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2d0tXSmVnEAE",
            "text": "Ordered take out. Food was good came fast and woman who took my order over the phone was very sweet. Will order again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeWRQeFl3EAE",
            "text": "Cute little spot that's like a hidden gem in the neighborhood. Food/cocktails were great!"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdjZMcmZBEAE",
            "text": "Excelente todo. Increíble! Desde que entras al lugar sientes esa buenas vibra, esa limpieza, súper atenciones de todo el personal y ni que opinar de las comidas."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbF9LQm9RRRAB",
            "text": "¡Qué experiencia más linda! Probamos el pollo al horno, el rabo y un sándwich de pollo, y todo estaba espectacular. La comida tiene ese sabor casero que tanto cuesta encontrar, como si lo hubieran cocinado con el mismo amor que en casa. ¡Volveremos pronto!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMExEbWlRRRAB",
            "text": "I visited during a layover and it was fantastic. The owner is super friendly, the food was very fresh and tasty, and the price is reasonable. You should def make a stop here when you can!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOS1UNGlnRRAB",
            "text": "I recently had the pleasure of eating here and I must say, the food tasted just like a home-cooked meal! Every dish was packed with authentic Dominican flavors that brought me back to family gatherings. From the perfectly seasoned tostones to the tender oxtail, everything was spot-on. The portions were generous, and the warmth in the service made it feel like I was sitting at my family’s dinner table. If you’re looking for that “made with love” touch in Dominican cuisine, this is the spot. Can’t wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OE9haDRRRRAB",
            "text": "An absolute must-try for authentic Dominican flavors! This new family-owned spot in Queens serves up phenomenal home-cooked Dominican dishes that'll have you feeling like abuela is in the kitchen. Whether you're a Dominican food lover or trying it for the first time, this place is a flavor explosion you need to experience! You won’t regret it!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqX2V2YVBREAE",
            "text": "This place is cozy, super cute, the food is amazing and the staff is sooo sweet, we got a complimentary Sangría glass!\n\nVamos a volver, sobretodo por ese Moro de guandules y la pechuga de pollo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidk5YQ3dnRRAB",
            "text": "Food was 5/5. The best way I can put it is everything (not counting the salad) from the rice and the beans to the oxtail were nicely flavored, especially the oxtail. The meal was delicious and really enjoyable to eat, and I highly recommend it. I was also happy about the portion size.\n\nNon-food related: I had come here because the website advertised lunch hours, when everything on the main menu would be offered at a reduced price. When I got to the restaurant I was redirected twice because of the language barrier (my Spanish/their English isn’t great) and told that there were no lunch prices, so they should remove that from the site since it’s pretty misleading. On top of that, I had asked whether there would be an extra charge if I used card to pay and was told cash and card were same price, but I was charged more for using card."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaDhmZ2VBEAE",
            "text": "This place is like a hidden gem — the food is absolutely DELISH 👌 The tables, furniture, el baño, everything is super clean!! My family and I love it here already. All of the employees are friendly, funny, and big hearted. You can tell that both the customers and workers enjoy this place greatly 😄 Will keep returning!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMM0tQRkR3EAE",
            "text": "Very clean and friendly staff, I love the atmosphere and the amazing dishes 😄 father Day's treat is delicious! Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcklPXy13RRAB",
            "text": "Everything about this place was amazing. The decor , the staff , the food and service. Had the oxtails, mofongo, and so much more and it was all great definitely recommended. Also make sure to try the morir sonando cocktail."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydm8tdlRnEAE",
            "text": "Mi primera vez en este Restauran, la comida bien rica, el servicio bien atentos y el ambiente bien acogedor, hay parqueo.. Todo esta super bien encantada de haber llegado a comer a este lugar.. El servicio y la comida se siente como si tuviera en mi tierra Dominicana.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaW9EcWFnEAE",
            "text": "Sooooo so so so good! I had never had a tamarind margarita or Dominican oxtail, they were both AMAZING! We also ordered the traditional soup which was also really delicious. Everything was so fresh and our salad had two homemade dressings, they were both so good and that we couldn’t choose which one to use and ended up using both. The atmosphere was so cozy and the whole family was involved in some way or another, they treated us like family which made the experience even more enjoyable. We will definitely be back the next time we visit Queens! Thank you all!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiazdfYzBnRRAB",
            "text": "I went last Saturday night for some properly filling food before making a quick trip to the Queens night market. The server was very slow and felt very uncomfortable in her role. The restaurant was also completely empty besides us, so with that in mind I feel they might be better when they’re expecting to busy busier.\n\nWhen we asked for coffee and water, they brought out this beautiful coffee/tea set (the coffee quality wasn’t good) and a large pitcher of water. We ordered a Picadera por Dos to share and it felt old/reheated when it came out which was very disappointing.\n\nPresentation and decorations were easily 10/10, the restaurant is beautiful. But the prices and service were not on par with the neighborhood, and my partner and I unimpressed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcnFQSlVBEAE",
            "text": "Great flavors! Good vibes only from the staff! Love the bar and atmosphere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeTY3T3ZBRRAB",
            "text": "Just left Morenas. Everything we had was delicious. We ordered mofongo, goat, oaxtail, rice, black beans and chicharron.\n\nAll of it was very good and we cleared our plates. We’ll definitely be back next time we’re in Queens. Highly recommend.\n\nAlso the owner and staff were very kind and welcoming"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6X1ozOUZBEAE",
            "text": "Vinimos aquí para almorzar y pedimos del menú. Le dimos nuestro pedido al camarero y el anfitrión regresó para confirmar nuestro pedido de almuerzo porque dijo que el camarero era un empleado nuevo. El servidor estuvo atento. cuando llegó la factura, no reflejaba el precio del menú del pedido de almuerzo. Nos cobraron el precio completo normal. Cuando aclaramos con la anfitriona, ella dijo que el pedido no se realizó a tiempo y luego nos recordaron que estábamos sentados antes de las 2:00 p.m. Luego dijo que los artículos que pedimos eran a la carta y luego le mostraron el menú que mostraba exactamente dónde se ordenaron. Luego dijo que el menú no estaba actualizado. Finalmente cumplieron con el precio anunciado. Sugerimos que actualizaran el menú para que los clientes no se confundan entre lo que leen y lo que ella dice.\n\nLa comida estuvo bien, pero el ida y vuelta al final me dejó muy mal sabor de boca."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqN3RYcmF3EAE",
            "text": "I am married to the Dominican family. As an Asian-American, I am more suited to American or Chinese food. One day I tumbled into Morena's Kitchen Bar & Restaurant on 111 Street and Roosevelt, I gave it a try and quickly full in love with the foods and people there. From sancocho to chicharro to porkchop, everything was delicious. They also serve wine, cocktail, beer and home-made lemonade as well. Will be back again soon!"
        }
    ],
    "reviews_count": 63
}