{
    "name": "La Esquina Criolla",
    "place_id": "ChIJ_UYmuLVfwokR9vzB2aVvFCk",
    "grid": "QN4",
    "address": "94-67 Corona Ave., Elmhurst, NY 11373, USA",
    "rating": 4.5,
    "user_ratings_total": 989,
    "phone_number": "(718) 699-5579",
    "reviews": [
        {
            "date": "1일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMU0wMXpTRWhYUzBwaVIxODBSVjlRZURJMlRtYxAB",
            "text": "Que buenas carnes, crudas y en parrilla, ni hablar de las empanadas.\nNO HAY PARQUEADERO TERRIBLE"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNFVtbE9VV2RQWXkwd1kzZFlPRUpQYTI1R1duYxAB",
            "text": "I spent one of my birthdays at this spot and had a wonderful time. The restaurant lives up to the chatter. This restaurant knows good taste. The employees displayed consistent friendliness. Visit this restaurant - you'll become a repeat customer."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzd1UzZFBNMDlXTUdrNGFYZzVSSEY0TkZkUWIxRRAB",
            "text": "Regular Argentinian food. Prices are little high, for the price Queens offers better places"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkM1YyMUtPRTFHTm05a1QzaHFUVEZLTFc1NVNrRRAB",
            "text": "Just to be clear that I’m giving only 1 star to Service because the interaction that I have as soon as I get inside the restaurant with one of their waitresses.\n\nShe gave me a disdainful look and spoke rudely. She didn't care what I was saying and continued on her way. I asked to speak to a manager. He explained further and apologized.\n\nI’ve been living in United States for over 27 years, that was my second time there, unfair that I had that service.\nHopefully, I was able to choose another waitress, and everything went fine with her.\n\nApenas entraba al restaurante una mesera con muy mala actitud y de malhumor me dio una mesa que no quise tomar, me dejó hablando, se dio la media vuelta y se retiró.\nTampoco quiero que me besen los pies, pero al menos que sean un poco amables y agradables.\nLas otras meseras me atendieron muy bien, no puedo quejarme ni de la comida, ni de la atención de ellas.\n\nSiendo yo Argentinx, me da pena que teniendo 24 años viviendo en Nueva York me pase esto en un restaurante que vengo por primera vez."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeVJuQlRVMmhwYTNCc1FrSkpSMjVwTlc5VFRHYxAB",
            "text": "Good steaks!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNGJqZHRaVWRvU2tac1FsQXRRa3BTVFdkdGVFRRAB",
            "text": "Una parrillada deliciosa al punto , la sangría única no mienten los comentarios q dicen ser la mejor de New York te dan una entrada deliciosa , en fin al comer ahi me traslado a Argentina de inmediato"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZdFNUTkhURXM1VlZGYVRqUktlbDlGVUdKc1FrRRAB",
            "text": "On behalf of The Center for the Women of New York, I want to extend our heartfelt thanks to La Esquina Criolla for their generous and delicious donation of empanadas to our Taste of the World at Fort Totten gala.\n\nLa Esquina Criolla’s empanadas were, as always, a huge hit—flaky, golden pastry wrapped around savory, well-seasoned fillings. Each bite was packed with authentic flavor and made with the kind of care and tradition that keeps guests coming back for more. It’s no surprise that their empanadas have become a beloved staple at our event!\n\nWe’re so grateful for La Esquina Criolla’s ongoing support and dedication to our cause. It’s because of wonderful local businesses like theirs that we’re able to raise essential funds to support women across New York. Their continued generosity makes a real difference in our community.\n\nWe highly recommend La Esquina Criolla for their consistently delicious empanadas and their big-hearted commitment to giving back. Thank you for helping make our event a success yet again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbFVWUlNWRFl5WDJSUFdsZFpXbk15ZHpneVNtYxAB",
            "text": "Very casual place for good beef cuts.  Ihad the short ribs and beef tongue here."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRVRtdHBRMFpXTWtvMk5rNHhlRUZrTlhselVYYxAB",
            "text": "Riquisimo todo todo todo"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNlJqVktNMGhRWmtaZkxWVjVNbXRUWW1sbk0yYxAB",
            "text": "Deliciosa comida y buen servicio."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNWQzVTBSMFprTjFaNVh6ZEdhMGhSWWxwbFdIYxAB",
            "text": "Love this restaurant,  great food, great service.   We highly recommend."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMFlXaDBZWHBpYlhaa1ZXeFZTblJSTmpScldtYxAB",
            "text": "Encantador.  Muito buen los precios"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwaWRuZEphVnA1ZWtkQ2JqUmxWbmd6UjJaTFgwRRAB",
            "text": "Muy rica la comida, pero la atención de Amalia fue muy mala, prefiere estar hablando con sus amistades, antes que recibir tu pedido, ella no merece estar en ese lugar, hará que pierda toda su clientela"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVVFrTTVURTQzY0hkUU9HRm9hamhhVUdWclptYxAB",
            "text": "Good food a bit small inside feels crowed, service is decent"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vdFJ6TlZWV1JETmw5SGEyaFNUVGRGWDJ3MVZtYxAB",
            "text": "I've been coming to this non-presumptive Argentinian steak house since the 90's. It has probably been around since the mid to late 70's or even before that. And that's because they have retained the repeat clients and new one's because of how good their steaks and prices are. Their steaks are \"scrumptuous.\" I have a sirloin steak with mashed potatoes and the Russian salad with a glass of red house wine, and I leave very satisfied each time. And can't wait till the next time that I can go for a juicy perfectly cut and quality steak cooked over fire."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQMmV4WUR6X3JTU3pnRRAB",
            "text": "Hoy miércoles 11 de junio fui a conocer este restaurante de parillada Argentina. Para empezar no da un aspecto de muy limpio pero bueno .Pedí una parrilla para una persona y le especifique que quería el asado y la entraña de la parrilla terminó medio que me gustaba la carne jugosa con ensalada rusa.Medium. Cuando me trajo la parrilla que tenia un pedacito de entraña chiquito ,recontra re cocido y el asado no estaba jugoso pero estaba comible.Comi las mollejas y el asado y pedi la cuenta.La ensala rusa no tenia una pisca de sal , de lo mas desabrido.Llame a la mesera y le dije que eso no era así , la señora me escucho pero no me respondió absolutamente nada.La atmosfera si vas con la intención de que haya una atmosfera familiar y con alguna clase  música Argentina ,nada que ver una depresión total el ambiente. Lo pero vino cuando me acerque al que trabaja en la parrilla y le dije disculpa yo pedí una parrilla a termino Medium y me mandastes un pedacito chiquito de entraña cortada a la mitad que la dejastes como zuela de zapato y recontra cocida.Es preferible que sirvan ese mismo pedacito pequeño sin cortarlo a la mitad y quede como suela porqie ahora yo pague por algo que se va a ir a la basura .Y para mi sorpresa muy groseramente me respondió aquí los dueños trabajan así y le dije disculpa me imagino que los dueños son Argentinos y déjame decirte que la mayoría de nosotros los Argentinos y Uruguayos nos gusta la carne jugosa a término medio pero yo dudo mucho que el dueño diga que tu debes darle la carne re cocida a a los clientes porque por algo la mesera te pregunta el termino de la carne que uno como cliente lo quiere.El ordinario me dijo bueno tirelo y ya .La cual el tono, la grosería y lo ordinario y mala atención fue increible.En ves de decir disculpe señora por esa experiencia la próxima lo haré mejor .Un reverendo ordinario que es una vergüenza que uno pague que la comida no sea como la pedistes y encima que hace la parrilla sea un grosero ordinario que no sabe nada carne , que no es Argentino o Uruguayo que son los mejores haciendo carne.Y  que le falte el respeto a los clientes .Yo no recomiendo absolutamente a nadie que vaya ahí. Y Ojalá el dueño en algún momento cambie ese parrillero no solo porque no tiene experiencia sino por lo grosero, ordinario y mal educado.Fui desde Manhattan a disfrutar de una parrilla y pase horrible"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKX0pfT0RXa19mUVJBEAE",
            "text": "Creo quenes muy buena comida a precio cómodo"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJX3ZtSkx2bjZEWWlnRRAB",
            "text": "Típico restaurante argentino con buena comida"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcG9yazlnRRAB",
            "text": "Great place for asado or other Argentinean favorites. Relaxed atmosphere and good staff"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3c2FxZGJnEAE",
            "text": "Excelentes carnes para hacer asado, buenos precios y excelente atencion al cliente"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aU5EYlNBEAE",
            "text": "The best!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueTdLLUx3EAE",
            "text": "It's a corner butcher that also serves great parilla. The waitresses are the nicest."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aXEtMEV3EAE",
            "text": "Primero q nada la atención pésima, por el hecho q te incluyen la propina no les interesa atención al cliente. Segundo pedí un sifón de agua y parecía q lo tenían en la jardinería por lo sucio q estaba, no les dio ni un poco de vergüenza."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaE1mVmVnEAE",
            "text": "Pesimo servicio de las señoras, estaba esperando mi comida que llame para retirar y me corrieron de la Mesa"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdDRTWUp3EAE",
            "text": "The food its okay, but the service is terrible!!! The waitress had very bad energy to serve us because she was watching TV!! never again!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMmZlSC1RRRAB",
            "text": "Old school Argentinan steakhouse/ butcher shop . Love it"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN08tcVlnEAE",
            "text": "La mejor parilla en NY !"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMFpDamhRRRAB",
            "text": "Las meseras: esas dos señora que están ahí deben de ir a cuidar a sus nietos no tienen buena atención y te traen la cuenta sin que usted se la pida, cambien esas dos señoras mayores!\nYo no regreso más por muy mal atención"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBa2QtYWd3RRAB",
            "text": "La comida rica, pero la atención de las dos señoras que están ahí, pesimo, no saben tener modales, deben de tener más atención, sin pedir la cuenta me traen como botando a las personas, deben de poner personas más amables😠"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOE8tZ1hREAE",
            "text": "Las empanadas son muy buenas 👍"
        },
        {
            "date": "수정일: 9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwcnY2YTl3RRAB",
            "text": "Best parrilladas"
        },
        {
            "date": "수정일: 9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwcVoyY2FnEAE",
            "text": "Todo muy rico"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMDQzZnRRRRAB",
            "text": "Waitress was rude but rest of the staff was great. Food was served quickly and they were very kind to help me choose the meal. Amazing food! Waitress wouldn’t let me eat inside since I walked in but ordered my food Togo. Usually you can take a quick bite inside a restaurant. This one was pretty empty but she said I am not allowed to eat there so I left. She was also rude in the beginning as well."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcWEza1FnEAE",
            "text": "The quality at this restaurant has gone seriously down"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzakp2a1B3EAE",
            "text": "I come here on the reg. The best by far. Even my children enjoy eating here. They specialize in grilled meats.  Flavor is off the charts, friendly service, and for the quality the price is very low."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeTdHa3BBRRAB",
            "text": "Venimos aca a cenar varias veces con mi marido. Soy argentina y tenia ganas de comer una entraña y fui a la esquina criolla. Nos atendieron asi nomas, las meseras nunca se acercaron a preguntar como estabamos ni si todo estaba bien salvo cuando teniamos los platos vacios y ni siquiera nos ofrecieron postre, nos estaban corriendo porque tenian a una familia esperando. Habia un hombre sentado en la mesa de al lado y las meseras siempre cada vez que pasaban al lado de el le pregutaban si necesitaban algo y la verdad es que senti que solo a nosotros nos trataron mal. No se que paso para que las meseras me trataran a mi y a mi marido asi porque no hubo conflictos. Soy argentina y la verdad que estoy decepcionada. Mejor hubiera ido al restaurante del frente llamado el Gauchito que dan un mejor servicio y son super atentos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYb2FxNXdBRRAB",
            "text": "Best Criolla ever! Came here for my birthday- the waitress was on point.\nThe food-we had empanadas, provolone a la parilla, sangria, croquetas, chimichurri- authentically made!!! The food will transport you to Argentina! Thank you for hosting us and making my day extra special!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuczV1NGtRRRAB",
            "text": "Good food, very small  place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuX3NmNEN3EAE",
            "text": "Great portion for the mixed grill. The skirt steak and short rib are exceptionally juicy and tender."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN3JMaFlBEAE",
            "text": "The food is good, the menu is 👍"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX2RLN2p3RRAB",
            "text": "Pésima experiencia en este sitio, pésimo servicio las meseras hacen un trabajo pésimo tratando incorrectamente a sus clientes! Pedí una parrillada y muy poca carne, pedí unos chunchilines y estaban todos quemados.\nNo volveré a este sitio más !"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURILWZpX01REAE",
            "text": "Muy buena comida .."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3LXA3Z2pBRRAB",
            "text": "I gave a 3 stars review mainly for the food. I ordered Parrillada Completa para 1 and Ensalada.\n\nFirst come appetizer bread + butter and I have no idea what it was, sliced meat. That was really good.\n\nThen, the main course Parrillada Completa came. The steak is okay, cant complaint, but the rest was very standard. They didnt come with any salsa, i was expecting they came with green or red sauce.\n\nWell i was very highly anticipated because got recommended by my Argentinian friend, but probably this is just not for me. Maybe i will give another chance to order another dish next time."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwME16WmlnRRAB",
            "text": "Gran experiencia, la carne ni se diga u si realmente quiere comer carne a la parrilla, tiene que visitar este restaurante, mi esposa y yo pedimos lomito y rabioles de queso al puesto, y realmente estuvo todo riquísimo.\n\nNos atendió la señora Iris que siempre esta con su buena energía y con su carisma, gracias iris por su servicio y por supuesto a las demás chicas también.\n\nLas cervezas quilmes también están disponibles y son una delicia para acompañar las carnes."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxazV1S3hRRRAB",
            "text": "This place has great steak! I had the entraña for two, they cook the steak to your liking. The give you bread and and chorizo parrillero as an entry. The price is not expensive for the amount of food and service. The chimichurri is delicious! 5 stars for sure. My family comes here all the time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaTRQQ2JREAE",
            "text": "My wife is from Argentina and she needs her fix of Argentinian food. She likes this place the best out of all the Argentinian restaurants. Perfectly grilled and tender meats. Great tasting sangria to go with your food. Always get a grill of meats for 2 or 4 people depending if it's just me and her or 2 other people with us. I love their skirt steak, it was cooked exactly how I requested. Side of maduros and morcilla and I'm in heaven."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxNmE2N3RRRRAB",
            "text": "Love this place, I come here for years and I always recommend 👌 ❤ for meat lovers. Sangria is awesome food im surprised they don't have a bigger spot but I guess that's how they keep such a great quality. To the owner a siber hand shake 😆. Felicidades y gracias por su local y buen servicio y calidad de comida."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbHY3VGxnRRAB",
            "text": "La Esquina Criolla has been on our bucket list. We were eager with protein, meat in a Sunday afternoon and decided to try this place which served solid Argentinian barbecue with convenient grab and go by phone.\n\nWe ordered La Parrillada for 2 and the portion was more than enough for 3-4 people with great price. The sides were not special but were perfect add-on to the entrees. The quality of meat wasn’t the best and even had coppery smell but tasted delicious especially with their unique sauce."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNXUzYVF3EAE",
            "text": "El lugar no es muy grande y las mesas están un poco juntas unas de otras. Para comer, la opcion de parrillada es excelente. Sabrosa y cortes argentinos que muestran el verdadero sabor de ese pais. Las milanesas, aunque excesivamente condimentadas, estan bien. Las empanadas en cambio, no las recomiendo porque en este caso, no son las clásicas argentinas: la masa muy gruesa y sin sabor y el relleno, casi parecía picadillo. Los postres son deliciosos. El servicio está muy bien también. Las bebidas son envasadas y no hay recarga como podrías estar acostumbrado.\nTambién tiene disponible venta de cortes de carne y yerba mate, mate cocido y algunos pocos productos regionales. No hay estacionamiento, deberías dejar el auto en la calle y puede ser difícil de encontrar lugar. El barrio, lamentablemente no es muy limpio. Hay suciedad en las calles y las motos pasan a velocidad excesiva por la zona. En el área hay una comunidad grande latinoamericana y negocios de diferentes paises."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENnJtTjFRRRAB",
            "text": "The absolute Argentinian bomb!!! Love this place, from there empanadas to their skirt steak (entrana) sandwich. They also sell milanesas to make at home 😋…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtaGNfVzNBRRAB",
            "text": "Tasty steak and side orders! Their empanadas and chimmichurri sauce go hand in hand! Their salmon is good as well! I love their steak sandwiches as well. This place is always a go to for my friends and I when we’re craving steak!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVdWZqVGFBEAE",
            "text": "Awesome place thank to my uncle food was unbelievably great as you can see in the pictures truly a gem"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcEpTNmp3RRAB",
            "text": "Great portions. Authentic. Love the place. Little on the pricey side but expected nowadays anywhere in NY."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcXFtTUZBEAE",
            "text": "Auténtica comida Argentina , platos abundantes , ambiente familiar , buenos precios y gran atención de Mayra .\nGracias de Buenos Aires, Cordoba y Maryland USA"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3a0o3bjZ3RRAB",
            "text": "This place is amazing great service, clean ,friendly atmosphere, omg and the food was amazing. I definitely recommend it ,this deserves more than 5 stars. Try it you won't be disappointed"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNC1pQkZREAE",
            "text": "Muy buena atención 👏  siempre pendiente de que estemos bien, muy rico el riñon asado y la parrilada, además el chimichurri excelente nada grasoso y la ensalada muy rica. Será mi parrilada preferida.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMZ2Z6NV93RRAB",
            "text": "Always a great experience in here. Steak is consistently great, the sandwiches are wonderful, and the service was both quick and friendly. I don't live in the area anymore, but any time I am it's on my must-visit list"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZajRlYXJRRRAB",
            "text": "Uno de los mejores parrillas argentinas en Queens , buen servicio, buen sazon y carne fresca. Buena atencion al cliente. Recomendado 100%"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsb3UzbEVREAE",
            "text": "I have been frequenting this establishment for about 15 years. I do not go for the service. I do not go for the ambiance. I go for the skirt steak sandwich. Personally, I order it plain (just the skirt steak with a bit of salt on a hero), but there are many ways to customize it according to taste. Def worth a stop if you're in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNll5bFJBEAE",
            "text": "La Esquina has been here as long as I can remember. 40-50 years. I’ve lived in the the neighborhood most of my life. Service exceptional. Food fantastic. I come regularly for their empanadas chicken and ground beef and they have fried beef.  But anything you want here you can not go wrong."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBaDhLcHZBRRAB",
            "text": "this place is wonderful, and right next to it you'll find Confitería Río de la Plata ( best medialunas -croissants- in New York City by far). Little Argentina I might call it."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcjVuRmx3RRAB",
            "text": "Great food, friendly staff, will be visiting again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURid3JlTE13EAE",
            "text": "Been going to this place for years. Abad and Tony who manage the place know their meats. Miguel grills the steaks to perfection. A must for steak lovers on a budget."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdTg3Ty1BRRAB",
            "text": "My favorite Argentinian Restaurant by far! I love the fact that its affordable! the highlights are the sweetbreads sandwich and steak sandwich. Their empanadas are excellent. I also like the fact that they sell freshly made sausage and other Argentinian food that can be cooked at home. Highly recommend this restaurant!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRal9PYnBRRRAB",
            "text": "The food here is always fantastic. Very authentic. Great prices, big portions, very high quality meats. The wait staff is very attentive. My family has been going here for years and years. We all love it!"
        },
        {
            "date": "8년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3bDR5V1FnEAE",
            "text": "Es muy pequeño el lugar, pero se come delicioso"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJLUp6aXlnRRAB",
            "text": "This place is by far the best Argentinian restaurant I've ever gone to.  My father grew up in the area and has gone here since he was young.  We still come here every time I am in the states.  Their empanadas are the best I have ever eaten,…"
        }
    ],
    "reviews_count": 67
}