{
    "name": "JoJu",
    "place_id": "ChIJrc8DMa1fwokRpH5iHAVyEsk",
    "grid": "QN4",
    "address": "83-25 Broadway, Elmhurst, NY 11373, USA",
    "rating": 4.5,
    "user_ratings_total": 1099,
    "phone_number": "(347) 808-0887",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MVRHRkJlamhoVDJaTGNuSm1VVGQ2TWs1SE4yYxAB",
            "text": "Always getting sandwiches from here."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRVZHZGpWek5FVkRST016ZzNaVXB1TWs5NlJVRRAB",
            "text": "My all time fav!!! My grandma has gotten older and cannot make me banh mi anymore :( however, the classic banh mi tastes very similar to my grandmas!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWFVrbHlaMFl0V1RnMU5GcGtNREUwYWpFellVRRAB",
            "text": "Mid, bread they use is not good. Doesnt taste fresh."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMVlqTXlhbXc1U0ZselZHSk1ibmgzVlRjM1ozYxAB",
            "text": "My fave vietnamese sandwich/bhan mi shop still going strong. Love this place. Love the flavors. Godbless you guys. 🫰🏼…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5S1JEaFJVV1Z5YURGVGJIRnZRMWhaZUVwMk9IYxAB",
            "text": "Delicious sandwiches with Thai tea, I recommend the pork belly one as they don’t offer it at the Tangram location"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRLXVTNmJ3EAE",
            "text": "I have been coming here for few years now and they never disappoint me! First of all the food is always delicious and always consistent! (Best french friesI I have ever had) Second of all cannot stress about their customer service! Always smiling, quick and today even though my reward card was expired I still got my free sandwich. Next time I will try their bowl.\n\nUpdate\nI used my reward today and food and drink were as good as always."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odVVUaDFjREpLWXpGb1ZVZG1iMGRHUzA1SVNVRRAB",
            "text": "Delicious! And the fries are good too. Nice vegetarian options as well"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNmRIQktkMUJYV0ZCc05XZDVZazVTV21kM1EyYxAB",
            "text": "I ordered viet Sandwich, look good but the bread 🥖 is old ; hope they pay attention , throw away the old bread"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbmVmUFFREAE",
            "text": "Modern spin on delicious Vietnamese Banh Mi sandwiches and snack. Fresh ingredients, fast turnaround, and friendly staff!\n\nPerfect for a quick lunch. I recommend the Lemongrass Chicken Banh Mi."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTmJESkVlRzVaUjB4b1lsSXRURTg1VmxCTWVVRRAB",
            "text": "Small sandwiches on stale bread? Not sure why people like this place.   I won't be coming back, especially given the superb sandwiches I can get for the same prices at Saigon Vietnamese Sandwich Deli on Broome St."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWVZFVjRObnB5T0ZSck1XbHBhVnBUVm1aa1UwRRAB",
            "text": "Have been ordering from Joju from years but probably not anymore after our recent experience.\nOrdered here on July 1 2025, we got the chicken wings, kimchi fries and a chicken bahn mi. The chicken wings are always fresh and crispy, the kimchi fries too. Unfortunately after our first bite into the bahn mi, something was off. The radish tasted rotten and the bread was stale. I am normally very easy to please but after one bite into the sandwich, I had to throw the rest out. Hopefully it was a one time event, but it was bad enough for me to avoid eating here for the foreseeable future."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRFVXbFRPV2Q2V2t4RGNXRlVhR1F3VDBkRFRYYxAB",
            "text": "one of the good classic ones I have had so far. The portion of the meat, pate and veggies was just off the hook: very generous I must say. I just couldn’t taste the butter. That was the only missing piece to the puzzle I guess. But overall a very good classic banh mi"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodk1qRnJjMWM0Tm5KRUxYRjRTVWh3WlV4VmJHYxAB",
            "text": "Great bahn mi and delicious drinks"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlLWJYbzd3RRAB",
            "text": "banh mis are delicious, are filling too. worth the money, i’d say. might want to ask what sauces and/or spices they use. can end up not liking it so much."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOMlZwWVhJLTZqNHlnRRAB",
            "text": "This place has real attitude issues. Employees act like they can’t be bothered to talk to anyone anymore.\nThey have a self order station, I tried placing an order and my card chip wasn’t working so I asked the people behind the counter for help. Yelled three times to get their attention, someone finally made eye contact but didn’t bother to come over. What’s your problem? Too busy to acknowledge paying customers? Do you even want business? Fix your attitudes!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOaUU4Y2pqZ2VDSlZREAE",
            "text": "Really good. Good portions, good prices, friendly fast service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOYXFpTS1reFpLNURREAE",
            "text": "so mid; literally nothing stood out, not the bread not the veggies, not the meat"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd3BYbVV3EAE",
            "text": "I don't know what happened to their standards on food quality but this Joju is not the same. When front staff was asked why fries look like old oil fried, she replied with \"we have different supplier\"."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaE5hQk1BEAE",
            "text": "Had super high hopes as everything looks so delicious in the pictures. Ultimately, the food was just fine for takeout.\n\n- Bulgogi banh mi: I actually did really like the meat of this. It came with way too many toppings, even for a banh mi, that we had to get rid of. I was super excited for the runny egg but this really added nothing to the flavoring. Maybe would have preferred the bulgogi bowl.\n- BBQ Pork Bowl: This could have used a bit more flavoring in the sauce. A fair amount of meat. But beyond that not much to say.\n- Crunch Monster Spring Rolls: This was somehow our favorite of the night. It was an interesting spring roll and we could've had many orders of this. I had opted to get as many of the dipping sauces I could for free with the other dishes and I'm glad I did, as they worked well with these. I do wish they came with their own sauce."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaHF2U0tREAE",
            "text": "A can't miss spot with fabulous Banh Mi and fries."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNUxUdUlBEAE",
            "text": "This spot remixes the sandwiches and I gotta say it’s a hit every single time. Pretty damn tasty. Good job on the menu!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRLS1xc293RRAB",
            "text": "The prices are great, quick service, and the sandwiches are pretty standard.\n\nOrdering is done through a touch kiosk, which is convenient.\n\nJust a heads up, there is no public restroom."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdzVmMktREAE",
            "text": "Always so good!!! Makes my tummy happy!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcmVqeEVnEAE",
            "text": "I’ve been ordering from Joju over almost 2 years now. I haven’t had any issues until my previous order. I always order Lemon Grass Chicken and Beef Bulgogi Bowls. I noticed that on my previous order, the portion of the  meat and vegetables are so much lesser than the usual. They just put a lot of rice to make the bowl seem it had a lot of meat and veggies. The chicken was also kinda dry as well. I’m not sure if it’s because I didn’t gave a tip. But spending 30$+ Dollars for two bowls with less meat and less veggies is not worth it. I might not order here for a while."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRblBmVmlnRRAB",
            "text": "Tried Kimchi Fries and regular fries - would definitely recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcHVlcWpBRRAB",
            "text": "I’ve always wanted to try Joju even before moving to Queens. I heard a lot of good things about their banh mi sandwiches. I think their banh mi’s are a bit expensive to be honest, more expensive than some spots in the city.  Ive tried a few of their banh mi’s but my favorite is the ‘Beef Bulgogi’ - sweet tangy, delicious and great combination of flavors.\n\nI actually enjoy their bowls a lot. There’s not too many Asian restaurants or spots that serves the bowls like Joju has. The portion size is pretty good too.\n\nOverall, I like the service here. I can’t say too much about the atmosphere since I only come here for take-out."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaXNDZmtBRRAB",
            "text": "It used to be better from the bread to the lemongrass chicken sandwich.  The bread quality changed a long time ago but the lemongrass chicken was still good.  Now....No.  I gave up a few years ago but I had a guest visiting who recalled eating it 6 years ago and insisted on getting one.  Deep down I was hoping he said it's great but he said the same thing.  Maybe it was an off day this Sunday but I'm hoping they bring back the magic that they once had."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeDRYRU1nEAE",
            "text": "just do it yours ok"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbW9IVTNnRRAB",
            "text": "Keepin it real in Elmhurst\nI want to root for this place so bad cause they had the best banh mi for me growing up, and the fries, everything hit. Lately just not the same after franchising. I didn't believe it at first, but after trying it twice in recent times, it's just not the same anymore. The boba is powdery and not great..... I would try it again, really want to like this place....."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQekp1WmR3EAE",
            "text": "This outlet, its original store still makes the best Joju sandwich. The pickle mix vegetables are well marinated, tasty and generous servings. Well balanced portions between the meat and the vegetables for each bite. Yummy. Please maintain the consistency in its flavors."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzLVoybTBBRRAB",
            "text": "Taste good! A bit pricy though."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOHFYNmNREAE",
            "text": "#12 #13 sandwiches are the shit .....\nSpring rolls are good too , just a little small for the price but definitely good... the Thai or viet coffee is good too ...  good food here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeWFuaDhBRRAB",
            "text": "It's one of the best sandwich shops in the area .\n\nAll is good in there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudUozbnpBRRAB",
            "text": "I traveled all the way from LI to have lunch here and it was well worth it, the food was delicious, hot and well portioned."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NDR2TE5nEAE",
            "text": "Amazing authentic flavoricious Vietnamese sandwiches!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bE1DNk53EAE",
            "text": "The chicken sandwich is delicious, highly recommended.  The place is clean, the employees are nice, good customer service experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicDVTeFRBEAE",
            "text": "The Bahn Mi fries with the caramelized pork is delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMjdPOTB3RRAB",
            "text": "The food was horrible had to throw it all out in the garbage. Spent 24$ and it was a waste ! Use to be way better the quality has went down"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiXzd5ZjFBRRAB",
            "text": "the memu on this page is different from website"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyOVp2Tk1REAE",
            "text": "Solid place for Viet sandwiches in Queens. Although it was better when they first opened."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaE8zM2dRRRAB",
            "text": "Best Bahn mi in nyc.. bulgogi sandwich is my go to paired with kimchi fries, so delish!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNmE3cjhBRRAB",
            "text": "I’ve been here over a dozen times with friends and family. There are always tables available when I come and they are usually very clean. My favorite menu items are Beef Bulgogi banh mi, lemon grass chicken bowl, beef bulgogi bowl, and Joju fries. The food never disappoints. They also provide extra sauce on the side if you ask for it. If you dine there, there’s no tip required because the workers don’t bring the food to you. When they call your number, you go up to them and get your food tray and then sit down."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOGRhQ0Z3EAE",
            "text": "food is affordable and delicious. Love how the mix meat and vegetables."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMXF5WlJnEAE",
            "text": "Not bad but I also wouldn’t say it was amazing. When I came in, they were doing iron work with very loud noise and a lot of construction. I understand not closing in fear of loss of money for the day but that was just crazy. The food was a bit pricy as I didn’t find it to be out of this world. The kimchi fries were good but over had better at KuKu. The coffee milkshake was also just okay. The stars of my meal were the spicy chicken bah mi and the boba in the coffee milkshake. The boba was defiantly made well and had great texture. I would recommend this place for just a sandwich and a boba drink. A decent place overall but I would only be back out of convenience and not need."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdlBlZjBRRRAB",
            "text": "Best banh mi you're gonna get! Big portion sizes as well."
        },
        {
            "date": "1년 전",
            "language": "fi",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUMEpDTDR3RRAB",
            "text": "Bussin banh mi's"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqajhHWHlBRRAB",
            "text": "The best sandwich shop in Queens! All their sandwiches are great. Definitely get their fries and add the egg in the sandwich."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdmNQQU9nEAE",
            "text": "Come for the banh mi, stay for the kimchi or banh mi fries. Just FYI: the fries are in a meal itself. Well, I just finished the kimchi fries with the egg added, and I’m stuffed.\n\nThe lemongrass chicken banh mi is my favorite. The veggies are crunchy and nicely pickled, which is important to me.\n\nSince this is a modern Vietnamese banh mi place, prices are higher... but you get what you pay for. Portions are definitely generous.\nI also recommend signing up for their loyalty program.\n\nThere’s metered street parking… and residential parking which may be difficult to find depending on the day you go. There’s a handicap accessible bathroom, but narrow hallway to get there."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyeEktN1pnEAE",
            "text": "The sandwiches here are just  incredible. Whoever complains the sandwiches used to be $9 dollars or it’s not good. Are idiots you should stick to your local bodega. If you know what good food is, you will come here. They are very quick and efficient. I have seen some people order here and act like it’s some pop quiz to the cashier, pathetic. Just because someone is a cashier doesn’t mean they are dumb, or you treat them with disrespect. I guess for some people it’s a cultural thing, the people they decide who to give respect to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OVBmeDVBRRAB",
            "text": "A coworker put me on to Joju 4 years ago and to this day, they are still one of my favorite local spots. Their service is always quick and on point, they don't mess up orders and are respectful of special requests. The flavors are amazing and they thankfully put a good amount of meat in their sandwiches and bowls (my pet peeve is restaurants slacking on their meat portion while inflating prices). My favorite is the Lemongrass Chicken Bowl, and Lemon Thai tea. Chicken is super juicy!!\nThank you JoJu!! Please don’t ever change"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3b0lYM2lBRRAB",
            "text": "직장 분들이 추천해주셔서 갔는데 반미샌드위치가 무척 맛있어요. 고수는 빼달라고 해서 먹었고 샌드위치 하나가 무척 커서 하나 다 먹으면 배가 찹니다. 7달러 안팎인데 크기도 크고 불고기앤 김치라는 한국적인 메뉴가 보여서 시켜봤는데 진짜 맛있었어요. 스프링롤도 곁들어먹었는데 맛있게 잘 먹었습니다. 다만 매장이 작아서 포장해가시는걸 추천드립니다."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1enV1WjhnRRAB",
            "text": "Order at the counter top for some fast casual and delicious Vietnamese classics. The fries were out of this world!! They were super crunchy and the toppings provided another level of umpft. Definitely would recommend and come back again.\nBathroom inside!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybVpMMlJBEAE",
            "text": "We weren’t even hungry when we stopped in on a Saturday at around 2:30 pm. We just happened to be in the area and I’ve been wanting to try this for a while, so we decided to pop in. There were a lot of people ordering food for takeout the whole time we were there, even at such a weird meal hour. That’s gotta be saying something. Orders take about 15 minutes so I’d recommend ordering ahead if you can.\n\nIf we hadn’t eaten lunch two hours ago, my husband and I would have ordered a lot more. Instead, we shared the Joju fries (JoJu’s banh mi inspired fries, topped with spicy mayo, spicy green sauce, pickled daikon & carrots, and fresh cilantro) and the JoJu banh mi (classic Vietnamese ham, headcheese, pâté spread & BBQ Pork). The fries themselves were amazing. It’s coated in batter (?) and double fried, which is the type of fries I like because the batter makes it extra crispy and flavorful. However, all the toppings on top of eating a banh mi was a bit too much. If I was just eating the fries, I would probably add meat + a runny egg. But eating it with a banh mi, I would have preferred the fries plain (with a side of their spicy green sauce, which is crack. Also appreciate that they don’t charge extra for dipping sauces). The banh mi could be one of the better banh mis I’ve had in my life. It’s stuffed with ingredients and I don’t just mean they’ve filled it with veggies. They are super generous with the meat. The bread is also toasted perfectly.\n\nFor drinks, I had the Vietnamese iced coffee, which was perfect. Not too sweet and not too bitter. It was the perfect pick me up. Husband had the taro milkshake with tapioca, which was too sweet for me but he liked it. I’m not sure when I’ll be back since this location is far from me but I’m looking forward to trying their more conveniently located Midtown location. There are still so many menu items I need to eat/drink!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxd2JPZzdRRRAB",
            "text": "We order the chicken and beef sandwiches and both were packed full with meat. I also ordered the rice bowl and spring rolls all good my egg was not runny over and over cooked but no biggie. Follow me at dom_eats_nyc"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTXzVEdjV3RRAB",
            "text": "I have been on the hunt just trying out bahn mi sandwiches all over Queens. Joju did not disappoint. It is pricey for what I ordered for myself, which included a sandwich, fries, and a drink or two. Let’s start with the sandwich. I ordered the classic and bbq pork with runny egg on top but they didn’t hear me correctly I guess. Damn you, Covid and masks! The sandwich wasn’t bad though. It was loaded with a lot of shredded and pickled carrots. Of all the places I have tried bahn mi sandwiches, adding an egg was never an option but something highly recommended by the restaurant and fellow clients so I decided to try it. I think that if an egg is ever an option at other places to add to a bahn mi sandwich, I will add that option. It doesn’t change the flavor but having that slight runny egg (if you like runny eggs) made it more delectable. The bahn mi fries - it might be the best loaded fries I have ever tried. Again, it was a lot of shredded and pickled carrots, which covered the green sauce on top of the fries. The French fries by itself is good and crunchy already, but when eaten with the sauce, it tastes better. I wanted to try a mojito (no alcohol) and asked the cashier which one comes highly recommended. One of them was the lemon ginger. Seltzer water with syrup, lemon, and mint is not a bad mixture at all. In fact, I would go back to try other options with the correct sandwich I ordered. The Thai iced tea is a little on the sweeter side but I can pass on it as other viet places sell the same thing. I recommend checking this place out. If not the sandwich, try the fries. I may also try the bowls next time as well."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbDZDMDB3RRAB",
            "text": "I got a lemongrass chicken sandwich, caramel pork bowl, and crispy chicken wings. The crispy chicken wings were exceptional and the other items I got were also quite good. Overall it was a solid lunch, would definitely come back again."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNzVLTzZnRRAB",
            "text": "The smell when you walk in teleports you into another world.\nBeing brought by a friend, I didn't expect much from a sandwhich shop, but don't let the simplicity fool you. The menu was simple in a good way. Easy to read and self guiding, I was able to grasp an understanding of the many different bahn mi variations. As it was my first time, I ordered the original bahn mi, and when I took my first bite, I was blown away. The crisp and vinegry radish/carrot topping combined with the meat and headcheese was hugged in a perfectly baked baguette. The roll was crispy on the outside and soft on the inside. All the ingredients merged together into a harmony of textures and flavors. Nothing was overpowering as it seemed like the sandwhich was tested to perfection. Small pieces of jalapenos kept me on the edge of my seat as I finished my bahn mi very quickly.\nBetween my friend and I, we shared the bahn mi fries. The light radish/carrot toppings that are featured on the bahn mi was generously added on top of the crisp fries. The saltiness of the fries were counterbalanced by the vinegry \"salad\" and the creamy siracha mayo took the fries to the next level. Combining all the flavors, these fries were like nothing I had before. A perfect combination similar to the original bahn mi, but with a slight spicy twist.\nBoth items I tasted were top quality. After that day, I spent the next few weeks trying the many other takes on the bahn mi. If you're looking for a sweet bahn mi with a strong flavor, i recommend the bulgogi bahn mi. Maybe a flavor that your more used to? I personally like the lemon grass chicken bahn mi. The chicken flavor we all know and love combined with the many toppings that come with the sandwhich. For the best experience, i recommend adding the green bomb sauce. I find it to give the bahn mi a little kick that makes you wanting another bite. However, the extra jalapenos they add along with the green bomb sauce caused some issues with some of my friends. But, if you're a spice head, green bomb is the way to go on all the bahn mis.\nMy personal recommendation: The Hot Chick Bahn Mi."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNy0tRWVREAE",
            "text": "To go place in Elmhurst for some Bah Mi\nI personally rarely stay in store as there are limited seatings.\nI prefer ordering for pick up. You can order through their app or thought Google. But order online DOES NOT give you the option to pay in cash. Must pay with a car.\nI personally love the Joju fries over the Kimichi fries. The Joju fries gives off a more flavorful taste with their mixture of dakion carrots, jalapenos, green sauce and spicy mayo while the kimichi fries is just spicy. The joju fries has different levels of spicy and sweet. Recommend adding a runny egg on top of any fries and sandwiches. Runny eggs added another level of flavor and texture.\nI always get their caramelized pork sandwich with a runny egg.\nMust reccomend the durian milkshake. Durian milkshake is a seasonable flavor. As I personally not a big fan, I must say, the milkshake uses real durian and its smooth and creamy. The smell is quite strong and it lingers but it's worth it.\nJoju does a stamp card system, one stamp for every $10 spent.\nRestroom is located in the back right. Restroom is clean but kinda small.\nThey rarely have paper menus available."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDMk9ibkF3EAE",
            "text": "My go to place a reasonable priced vietnamese sandwich and fries. I like their fresh tops and flavor. Lemongrass chicken and joju fries and bbq pork are my favorites. The quick and cordial. It gets really busy at lunch, about a little over…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnc1lpOGZBEAE",
            "text": "If you're looking for a banh mi in Elmhurst, look no further and come to Joju. A little pricier then usual for a banh mi but you get what you pay for in terms of options and toppings.\n\nThe beef bulgogi banh mi was good but a little oily, flavor was there and it was pretty good bite after bite. The other banh mi we tried was the Kakuni pork belly and that was good but the crispy skin and the size of the pork belly were a little tough with each bite. We also tried the banh mi styled fries and although the fries itself were good, the topping of the radish and carrot made the fries a little soggy in some areas.\n\nThe space is small yet comfortable with a few (about five) tables. Overall we lived our experience and will definitely be back for more."
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncVl2elZBEAE",
            "text": "I stop by JoJu every time I'm in the Elmhurst area. I usually order my sandwiches non toasted if I get take out. If I'm dining in, definitely get their fries. My favorite is the Banh Mi fries. Tried all three of their popular items, and my favorite is their original #1. The \"Classic JoJu\". It be on that beat. 🤙🎶…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNW82NWx3RRAB",
            "text": "I'm wondering what were in their pate or headcheese, very strong aftertaste, very fishy.   I ordered the No 1 classic banhmi, and I checked again on the ingredients listed in the menu, probably there is fish in pate.   The store looked nice and the package looked nice.  I do like the bread and the pickled radish carrot."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwbjUyTmZnEAE",
            "text": "JoJu is an Elmhurst staple. They've been here for over a decade. I've passed by this spot so many times over the years, but I've only been inside for the first time just recently.\n\nIt can be difficult to get a seat, depending on what time you go. Usually early afternoons are busiest as that is when school ends and a lot of the local school students hang out here after. It gets less crowded later on around 4-5pm.\n\nService was quick. I didn't even have to wait in line, but like I said, I went in when they weren't busy.\n\nI ordered the bahn mi fries. They're fries topped with shredded pickled carrots and radish, jalapenos, and spicy mayo. I added a runny egg to it. It was delicious. The crisp tanginess of the vegetables paired nicely with the richness of the mayo."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3d1phMDVBRRAB",
            "text": "The Joju bahn mi was delicious. Looking forward to trying the modern twists--bulgogi and pork belly ones sound great. Green bomb was not as spicy as I expected."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRX282OFNnEAE",
            "text": "I had a not-so-good experience last time I visited Joju (per my previous review), but It's been over 3 years so I gave it another try.  We went in better prepared - making sure we ask for their loyalty card first, NOT after the fact!!\n\n3 notable changes from what I remembered from 3 years ago: 1) Prices no longer included taxes.  No comment on this one.  2) New volume promo -- buy 5 sandwiches get 1 bubble tea free. This can be in conjunction with the loyalty card points  The promo worked because we did end up buying 1 more sandwich than we needed to get the free bubble tea.. 3) Each sandwich was cut in half and each half was packaged separately.  We appreciate this because each sandwich is very filling, the second half is readily packed for next day's lunch!  It also made it easy to mix it up and sample different sandwiches.\n\nWe ordered 2 Lemongrass Chicken with Egg White; 1 Classic Banh Mi; 1 Vietnamese Caramel Pork; and 1 Kakuni Pork Belly.  The egg white made no difference to the taste, nor texture. Maybe a running egg instead may work better next time. The caramel pork tasted good on the first bite but got old rather quickly because of the sugar.  Pork belly and the classic Banh Mi were both excellent.  The bread was nice and toasty.  One minor negative: I did noticed that each sandwich was layered \"vertically\"; as a result, each \"horizontal\" bite would not get all the ingredient at once: one bite would only taste the meat, another would only taste the pickled carrot/daikon.  No big deal.\n\nOverall, a much better experience and I am bumping up my rating to 4 stars."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNjREdDhBRRAB",
            "text": "Top notch Vietnamese Sammie's and grub. Lightning quick service. Flavorful food.\n\nLemongrass Bahn Mi sandwich was on point. Got the runny egg on it, as everyone should.\n\nMy wife's vegetarian ham sandwich was good and the veggie egg rolls were nice n light, a lil greasy and pretty tasty.\n\nThe mango mojito was sweet and delicious but I could do without the nearly $5 price tag if it ain't got no booze in it. Love the way they put the Sammie halves in 2 separate bags in case you wanna take one home"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdC1HZFdREAE",
            "text": "Ok , so I gave this place a second try, first time it was such a turn off. The first time my gf and I arrived to front and sat there to eat, we just sat there and none of the 3 people working there approached us, until I finally said \"hello...\" the girl that time was not friendly or helpful at all.\nAlmost a year later. This young man namedJustin gave a good service, friendly and helpful with the options. We ordered pork and The Joju on brown rice, the flavors are there, yes they are a bit grease but very flavorful, just like eating a Vietnamese sandwich but replacing bread with white or brown rice. It's a big enough bowl to fill you up. I would come back again. Thai Ice Tea was nicely sweeten, not too sweet. I am leaving with a smile. THX!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJdnYyZFZREAE",
            "text": "Every time I've visited the food has been great. Obviously they are known for their sandwiches and my particular favorites are the bahnmi bomb me and the pork belly sandwich.  I usually have them add the runny egg to the sandwiches...so…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSelBUTmtnRRAB",
            "text": "Very good banh mi. Is it the best I’ve had in NYC? Definitely no. But, it’s a creative take on it, and the bread and ingredients are fresh. They did a good job of marketing, but not sure id go out of my way to go here again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLdWUzYmRREAE",
            "text": "What can I say, one of my best take away meals I’ve had in a long time……..just loved the kimchi fries and the bulgogi."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwc09pUThBRRAB",
            "text": "Very unique ways of making banh mis. The loaded banh mi fries and juju monster banh mi are the most famous items."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBOEp2SGtBRRAB",
            "text": "Joju bowl is always empty when I go, which is great because I don’t need to wait long for a REALLY GOOD BOWL of food. Vegetarian ginger beef. 200% recommend this if you don’t know what to get."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRX3YzTjVnRRAB",
            "text": "Small place with the most delicious and affordable bahn mi sandwiches. Great bread and veggies, get the egg!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZaWJMNURBEAE",
            "text": "Almost everyone in Elmhurst’s go to. Joju has so many options and varieties of food to choose from. Not just a bunch of choices for food but drinks as well."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4bTY3b0F3EAE",
            "text": "The BEST EVER!!!!!!!  Wish they would come to Boston area!!!!  Simple, easy ordering process along with very smooth process for those of us that are trying for first time!  Spot on and Well Done!!!!!!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzaUtmZ3dnRRAB",
            "text": "I love the bowl! And also tried fries and the sandwich. Sandwich is wonderful, fries is a little bit too dry for me though."
        }
    ],
    "reviews_count": 76
}