{
    "name": "Cafe Rubio",
    "place_id": "ChIJFVlua75fwokR58_T3grQ2AA",
    "grid": "QN4",
    "address": "98-05 Northern Blvd, Corona, NY 11368, USA",
    "rating": 4.4,
    "user_ratings_total": 1533,
    "phone_number": "(718) 505-1020",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWFJsOU9iRzVvVUVOQ09WaGhRVEJ5VGpaNExVRRAB",
            "text": "High end latin Dominican fusion restaurant, huge restaurant and they bring Live bands mostly Dominican bands but made for all !"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUVQxcERWa293UkVOaWQyRlVWV3Q0UjBWWFdFRRAB",
            "text": "Is a nice place"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTWJHRlZlR0pFWkZwd04wYzVRVmxYVjJOS1dsRRAB",
            "text": "Looks nice but they took 1hr to get our food and the food was bland and some over cooked."
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNmVsWnNiVlJ3VTBoRFEwVnNTVmh4VVdWaFdIYxAB",
            "text": "Se demoran bastante tiempo para sacar la comida y llega fría y no muy agradable y las bebidas malas los precios exagerados para la calidad no regresaría"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMVNHMXRZakEwTUhWNmVraFZXbGxSWnpaYU9HYxAB",
            "text": "Muy Agradecidos con Todos ustedes la comida deliciosa mi cunado despues del aeropuerto dijo vamos para El Rubio restaurante a comer ginea wao 10/10 mi bebe de un anito le encanto feliz con las luces un ambiente muy relajado gracias Al Rubio muy amable como siempre dios lo siga bendiciendo siempre y a todo su familia todo lo mejor de todo corazon mil gracias feliz aniversario  qe cuman muchos anos mas se merecen eso y mas 🙏🥳"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaVJWaDRTakpIVW5CMk5XSnVTalppUVd0QmVGRRAB",
            "text": "Delicious Food and Excellent service...Restaurant very clean...atmosphere great...family oriented...love it....highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R2FVczFOa2xrZFV4R1NWUXhiMjFVV21wbExXYxAB",
            "text": "Excellent service"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNWFEWnJSRXN6YTNRNU1EZzBNbDkxU0ZVNGNsRRAB",
            "text": "Buenos días.\nMe pareció un lugar muy agradable, su comida muy buena y quiero resaltar el excelente servicio de Luisa"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUVNYZFJRMkZqUTJoT05GbzJSM042VHpSWFJWRRAB",
            "text": "quiero recomendar este lugar, mi visita allí fue muy agradable, la comida deliciosa, la atención fue lo mejor gracias a luisa que estuvo muy atenta y fue demasiado amable\nvolveré muy pronto a este lugar"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kblRUWmlNVlV3ZEd4TFluTlBUMUJDY0VSYVgyYxAB",
            "text": "Nice place and God food,"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wS1NXcHZWWGh3Wkcxb1RWSktkR3c1YkZWVVlsRRAB",
            "text": "I love an upscale Dominican sports bar and lounge. The baseball game on while I eat dinner the music is at the correct volume and its all Dominican music. The food I had was great I haven't been here in years and it was better than I remember. I had skirt steak, goat stew, chicken croquets, a chimi sandwich, fried chicken and the alfredo pasta. All of it was outstanding. I love to see an old establishment still pumping out classic meals. Definitely love this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdFVWTjVOVEZuT0ZKWmIzUmhaRmhMYUZWdk1IYxAB",
            "text": "The service is satisfying."
        },
        {
            "date": "수정일: 1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURncElPVy1nRRAB",
            "text": "Soy una justa la verdad no me parece justo soy una mujer dueña de negocio, y la verdad vivimos en una injusticia fui a ese lugar pagué casi 800 dollar por 2 botellas de shampagne  y una botella más de vino que en el menú decía que costaba 180 cada una cuando vino el bill me cobraron 230 por cada botella de Champagne la mesera dijo que no podía hacer nada ella, que era orden del dueño y entiendo ella solo hace su trabajo, lo peor fue que vi a todas la mesas estar gastando en margaritas sodas sin nada que consumir solo eataban ahí por estar es una pena la verdad, ensima nos sirvieron  las shampagne al tiempo  las Pellegrinos al tiempo le dije si tenían un frizer por lo menos para ponerlo a enfriar y me dijo no te traigo más hielo y le pongo agua 🙄como dueño de negocio tienen que saber que eso nunca se puede servir así. Es triste ir a un lugar así y ver esto, poreso los negocios acaban por que no cuidan los clientes, yo jamás regresaría a ese lugar es una pena, si uno va a un lugar es por que tiene cómo pagar pero tampoco estabien que se aprovechen y cobren de más quieren sacar de una mesa lo que no venden en la semana"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaM2FtaHVhak5vUkVwTE4wY3RSRzl4UnpaMVZtYxAB",
            "text": "El lugar es muy bueno, la comida es excelente.\nLa atención de Luisa Bermúdez fue grandiosa, atenta y simpática. Muy buena la experiencia"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paZmJEUlNjelZwTVVaQ00yaE5hRzloTm5KM1pWRRAB",
            "text": "Excelente servicio de Nohely"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNlNGaG9PRVJYYVdKSWJITjVXRVJ2WnpSQlpsRRAB",
            "text": "The food there was delicious and the customer service was great. My waitress Luisa was so nice and attentive. Would definitely recommend this place and will revisit."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaVZFOURRV2M0UzIxYVMwaHlSV0ZQUm1FdFFuYxAB",
            "text": "Todo exelente la atencion y la comida 10/10\nGracias luisa por atendernos la mejor"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taT2N6WXhWbXRyYm1oNVFsSjRkRFJ5VnpWVFltYxAB",
            "text": "Stunning 😍 atmosphere 👌🏾 Smooth Place to chillout with friends and family"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eGFrZGxRMDFNU0cxaldFSjRSazlyVFhkR2FIYxAB",
            "text": "Great food 🥘 delicious 😋 however  service was very lay bac."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQ2JtTk5Za2gwWDFRek56RmhUelpHUkdSNlZHYxAB",
            "text": "We went for my grandmas birthday excelente 👌 But needs kids menú and cool night life!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUGNHRjNVSEYzUlhnd1UzVmFTMFZOVVV0SmJXYxAB",
            "text": "Great service. Luisa was amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNk5FOUpaRXRsZW1od1QwTk9lamxoV0RCc1dIYxAB",
            "text": "Hey, I just wanted to say that I had a great experience here! The Mofongo with shrimp were 10/10 🔥🤌🏾\n\nA special thank you to Luisa for taking care of us. Very kind and attentive. Will definitely come back. Also thanks for helping me with my Spanish 😂"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTVN6WjRibVJMZFZFMFJXdGlaSHA0YWs1YWFGRRAB",
            "text": "Nuestra mesera luisa nos trató sumamente bien y eficiente en su servicio."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMkxVaFliSGRUU2xkc1Z6QnZPSGxSU0V4V2MzYxAB",
            "text": "Café rubio it’s an amazing place, very good food and service by Luisa was perfect, definitely I have to come back 😍"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MFV6YzJPRk5mWkVocGMyWllNbFpqZWs1VFNXYxAB",
            "text": "Nohely . Gracias por tu servicio fue excelente."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUU1qUnZTMjB6TlZsNE5IbGFialpKUmtSUlUyYxAB",
            "text": "Esta semana visité el restaurante y la comida me gustó, el ambiente y la música agradable. La atención de la mesera Luisa fue muy agradabley siempre con una sonrisa que me hizo sentir como en casa. Me voy feliz y con ganas de volver pronto."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NWQyOVFUM2RtTUhWV1VVMWFSblp1ZDJkeVdFRRAB",
            "text": "He ido un par de veces y es un excelente lugar. Su comida es deliciosa pero en particular el servicio es muy bueno. Particularmente Luisa hace muy bien su trabajo y nos atendió de maravilla. Mas personal como ella."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabWJVNU9Oa2R5YW5NMlFrTm5OemMwZFhCSVlsRRAB",
            "text": "Esquisita comida, una excelente recepción y atención, especialmente de Luisa quien nos atendió. Lugar muy agradable y recomendado."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSR05GRTVaMkZXZGtkMmFpMDNkMVE1TWtwQlFsRRAB",
            "text": "Excelente comida. Grandiosa atención por parte de la mesera Luisa. Volvería con frecuencia."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCamJsaFNiR3B1VTBZdFRGSXdaRk4wYm1SYU9YYxAB",
            "text": "Visito a menudo este lugr en compania de mi familia, me llama.mucho la atención la comida y los eventos y conciertos que celebran a menudo, en mi ultim visita fui atendido por Luisa una niña muy amable y dispuesta ayudarnos en todo momento, recomendado el lugar."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTFYyRlRNVEZRTWtKQ1EyOUdZVlZXY3pkV2JXYxAB",
            "text": "Ayer estuve visitando este lugar por recomendación de una amiga, la comida me sorprendió pedí un churrasco con tostones y estaba delicioso 😋, Luisa la persona que nos atendió fue muy amable y siempre estuvo atenta a lo que necesitábamos. Volvería sin ninguna duda."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RmVXSlNhMmhWU2xadWRreHBXSFE0TWpBMlZIYxAB",
            "text": "Visite el lugar por recomendación de unos amigos y sin duda me encanto , la comida es buena, la atención es excelente, Noheli la chica q atiende es bien atenta, pendiente de todo , volvería porque todo me encanto todo"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MU1VRlJjbGt6UW1kNWJESklXbUZJV0ZkdmRVRRAB",
            "text": "Si quieres pasarla bien te lo recomiendo al 100% muy amable la chica nohely quien me atendió amablemente"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKZk5WcFBWQzFHVlhaa1pHRnVaelpJT0ZZNWEyYxAB",
            "text": "Muy buen lugar agradable ambiente, pero lo mejor fue nohely bella y linda persona 🥰"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCME5YWlJXUzFvZUU5eE5ucHVaM3BzTVZSNlVXYxAB",
            "text": "Desde el momento en que llegamos, Noheli nos recibió con una sonrisa cálida y una actitud amable que hizo que nos sintiéramos como en casa. Fue atenta sin ser invasiva, siempre pendiente de que no nos faltara nada. Respondió con paciencia a todas nuestras preguntas sobre el menú y hasta nos dio recomendaciones que resultaron deliciosas.\n\nSu rapidez y organización fueron impecables: la comida llegó a tiempo, en perfectas condiciones y siempre con una presentación cuidada. Además, su trato fue tan cordial que hizo que toda la experiencia fuera mucho más agradable.\n\nDefinitivamente, el tipo de persona que eleva el nivel de cualquier restaurante. ¡Un verdadero ejemplo de profesionalismo y pasión por el servicio!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adlZuSXpWRGMyUTJ0RFdHWmhlV0pHUzAxWFNFRRAB",
            "text": "Bonito lugar y lo mejor la atención de Nohely muy buen servicio"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobVYxaE5NMnR0Y25aM1ZGbG9MV3RHVkZOUGFHYxAB",
            "text": "Agradable ambiente, muy buen servicio y gran atención de nohely!!!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VVNGcENiM2h3TUZCd1RVbE1NbTUwUjFCR1kxRRAB",
            "text": "Fui a cenar y la soñorita Nohely me atendió con muchas amabilidad y cortesía, muy contenta con el servicio que recibí. Todo excelente!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSaE1YRjVXRUpCWVZaTGQzbDJUMjFNYTJaMWNsRRAB",
            "text": "Estuve este finde en el restaurante y me encantó todo, el ambiente, la comida deliciosa y sobre todo la atención de nuestra mesera la Srta Luisa, muy atenta, siempre dispuesta ayudarlo a uno en la selección de la carta,  muy gentil y amable. Me sentí mas cerquita de casa con su atención. De seguro regresaré para probar otros platos y bebidas :) Super recomendado!!!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeVVsUjJRblZ3TkZjemFXNWtRVFZRUmxsM05YYxAB",
            "text": "El servicio me encanto, la comida y el ambiente excelente me facino todo y el servicio de luisa un 10/10  Muy buenas atenciones"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbldsWkVVRVppTVhjeVZsQk5ZbWRGVEdWcVdGRRAB",
            "text": "Holaa\nSin duda volvería de nuevo a este lugar\nDeliciosa comida, ambiente inigualable y la atención por parte de Luisa fue maravillosa y familiar\nLes recomiendo a todos tener esta experiencia"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUFZqY3pVbTVzV2pKWlRWbFFUVzVUWldGUWNtYxAB",
            "text": "Exelente servicio, ambiente muy agradable, comida divina, la atención de la chica Noheli muy profesional y educada…. Mi mejor opción en Queens es café rubio… ah como podía olvidar la temática de los Mets y la MLB genial"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jd2VscERTbVpMYWw5TGEyaDZaVVpaVVVSc2QzYxAB",
            "text": "Un lugar encantador con un ambiente cálido y acogedor. La comida estaba deliciosa Pero lo que realmente hizo especial nuestra visita fue la atención de Nohely: amable, atenta y siempre con una sonrisa. Se nota que disfruta lo que hace. Sin duda volveré pronto y lo recomendaré a mis amigos"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMmFYZDFNVXAwUW10bE1XeDZSamRJYkV0TkxYYxAB",
            "text": "Food was really good, and the service amazing, our server Luisa was the best, really attentive and had good recommendations, definitely looking forward to coming back, i recommend checking this place and spend the evening with family and friends!!!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SFZtOHRWVmx2UmpOR1RYazFSVE5wU1RWTGJIYxAB",
            "text": "Me gustó mucho el ambiente y la comida, excelente servicio de la mesera Luisa!! Volveremos"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5blRGaFJZUzFrTW0wd1pUaFpRMHB4T0hkSFNuYxAB",
            "text": "Visité este restaurante por recomendación de unos amigos, y debo decir que la experiencia superó mis expectativas. El ambiente es acogedor, la comida deliciosa, pero lo que realmente hizo la diferencia fue la atención de la mesera Luisa.\n\nDesde que llegamos, Luisa nos recibió con una sonrisa genuina y una actitud muy amable. Estuvo atenta a cada detalle, nos ayudó a elegir platos según nuestros gustos y se aseguró de que todo estuviera perfecto durante toda la comida. Su trato fue cercano pero profesional, y demostró un conocimiento excelente del menú."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TlF6aFFSbHBrUkVSaU1uRk5iRXhxYW0weVRWRRAB",
            "text": "Buen servicio me atendieron muy bien. La chica Nohely muy buen servicio."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMVNqaDJOSFJuYTBKcVF6UkZiV3hMWnkxamVIYxAB",
            "text": "Me encantó la comida, el sitio es muy familiar y la música muy agradable! Me encantó, y ni hablar de la atención, Nohely es muy atenta y muy amable. Sin duda regresaré pronto!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWM1JtNWlhVkJSTjE5cGRpMXpiVmR5YVdGelJWRRAB",
            "text": "Anoche fui por primera vez, el lugar muy agradable , la música y el ambiente super buenos. Los drinks que pedimos 10/10 y la atención de nuestra server Luisa también fue excelente, siempre muy sonriente y con buena energía. Super recomendado."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUVJUUjRYelo0UVU1bmRrbzFjR0pJU2xFMlpFRRAB",
            "text": "Excelente experiencia , nos atendio Nohely , con mucha atencion y amabilidad , a todo lo  que necesitamos en la mesa ,con cada detalle  , fuimos a los sweet 16 de mi sobrina y fue inolvidable 😀"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMGVtbGxjWEp0UzNod1UzSllhM1pLUjFKSE0yYxAB",
            "text": "We had the “fried calamari” 13 pieces total, had to count them after seeing how poorly cooked they were. Worst calamari I have ever seen in my life. We complaint about it and still got charged for them. The rest of the food was good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJN254OG5zeU03MWJBEAE",
            "text": "Totally hands down one of the best Dominican restaurants I’ve been to I love the baseball themed atmosphere now lets talk about the food simply delicious every thing was amazing straight Situation"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeWMwZGtjRlZIUVc0NVNFRmhielI1Vm5Kd2QxRRAB",
            "text": "I had a great experience at this restaurant! The atmosphere was warm and inviting, with pleasant music that added to the overall vibe. Our server, Luisa, was outstanding—friendly, attentive, and made us feel truly welcomed. She checked in regularly and offered helpful recommendations. The service and ambiance made the night really enjoyable. I’ll definitely be back"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRGRYVktjekZHV2twelV6WlFPV1ZzYUU1VFozYxAB",
            "text": "La comida estuvo súper buena, grandes porciones, el ambiente por igual y la atención de Luisa muy agradable!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobWFrRnNPVmxpY1ZwTFExTnBXV0ZqZDFKYVRXYxAB",
            "text": "Food was good, but the service needs work. We got there around 6 PM for happy hour, and it took 30 minutes just to get our drinks — and they were way too strong.  ( order mango margarita and got a different flavor ) in addition to We also ordered tres leches, but the waitress brought a different dessert and told us, “This one is fresh,” without asking if we were okay with the change.\n\nNot a terrible experience, but not in a rush to go back."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMFNTMXhWbGh2Wmw5Q1VWTk1aMWhVZEZaWVJIYxAB",
            "text": "Me gustan los tragos excelente,A mi niña le encantó la cena..un ambiente único y especial.el Dj me encantó su nombre es DjBoryBudda."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cXU3YU53EAE",
            "text": "Very nice restaurant with lively music, although they have a more quiet side for those wanting a calm dinner. The venezia is a good dish. Cordon blue was okay, but could use some more flavor. Dolce de leche was nice but could've been a bit bigger for the price. I'd go back but try something different."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKbW45ZVREcXFQamlnRRAB",
            "text": "I have been here a few times and let me say that it is a great restaurant. The food and ambience are great. They have a lounge area where hookah is allowed and they also have a kid friendly section. The servers are super friendly and attentive, especially Laura. She made our whole experience top tier!\nDefinitely recommend stopping by Cafe Rubio."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLUDFtLS1GdjhPbXl3RRAB",
            "text": "One of the best gourmet sports bar restaurant in Queens. Tasty food, nice atmosphere, big tv screens. Service staff personnel very attentive to details. The bar offers a variety of 🍸🍺 and very friendly and attentive barmaids; specially Giselle.🫡"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMTdlX3Z3RRAB",
            "text": "Mi experiencia en este restaurante fue en su mayoría positiva, con excepción de un incidente desafortunado con el pedido de las bebidas. A pesar de haber solicitado una piña colada virgen para los niños, la mesera la trajo con alcohol, lo que pudo haber sido peligroso ya que los niños ya habían consumido parte de la bebida. Ella noto el error y corrio a mesa pero ya los ninos habian tomado parde tragos 🥴 A pesar de este inconveniente, decidimos no causar un escándalo y lo dejamos pasar.\n\nEn cuanto al resto de la experiencia, la comida estuvo deliciosa y el servicio fue amable y atento. Sin embargo, es crucial que el restaurante mejore sus procesos para garantizar que los pedidos de bebidas se sirvan correctamente, especialmente cuando se trata de servir alcohol a menores de edad.\n\nEn general, recomendaría este restaurante, pero sugiero tener cuidado al hacer pedidos de bebidas para evitar situaciones incómodas como la que experimentamos. ¡Espero que tomen medidas para mejorar este aspecto y brindar una experiencia aún mejor a sus clientes en el futuro!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObWs2Wi1mcl9DR2NREAE",
            "text": "Excelente servicio. La comida fue exquisita, el ambiente perfecto y la atención al cliente inmejorable. La señorita Diana nos atendió de forma excepcional, muy amable y atenta en todo momento. ¡Totalmente recomendado!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHODhEZ1dBEAE",
            "text": "Delos mejores churrasco q he comido. Excelente  servicio, el tiempo  de espera fue ideal y el costo accesible presentacióntodo fue de maravillas. Pero el sabor es exquisito exquisito 😋  Ahhh, el servicio fue excelente, lamento no recordar el nombre de la colombiana  q nos atendió. Por q lo excelente se debería de reconocer.  Mucho éxito 🙌"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Z2VQRWFnEAE",
            "text": "Everything we ordered was delicious and fast, unfortunately the food was BARELY warm! The vibe was great and I look forward to go back.\n\nAlmost 5 stars, but the food (main courses) were barely warm, almost room temperature."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJblN0X2lJNU5mZUNnEAE",
            "text": "Diana was my waitress, she was very attentive. Always checking up on the table and made sure everything was in order. The service is great and the food even better!! I will be coming in many more times."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtazVfdXlBRRAB",
            "text": "Came in for drinks with friends, the place looked good and clean.\n\nHas a full bar with great drinks and friendly staff. It  was the perfect spot to hang out. Music wasn’t too loud or too low, it was perfect.\n\nFood was ok I guess tasted good, you just can’t see what are you eating since everything is covered with sauce and cheese. Also was a bit over priced, like if you was paying for fancy rice and beans.\n\nOver all it’s a great chill spot. Try it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJd2RhTGdRRRAB",
            "text": "I will have to say this place surprised me.\nAt first glance from outside you really don't expect much but hoping that the food is good, but once you enter you see that this place is really nice it actually also has an outside area in the back which i would love to see the set up in the summer to come.\nRight from the entrance is a bar that looks like it can accommodate anybody's drinking desire which is most definitely good haha.\nMore inside it has alot more seats and tables with better lighting. Which looks looks like it can be a dance floor at night time.\nSo overall in the looks department i would say spot on. The staff was very friendly and did their job well\nNow food wise it was a little on the high end in price but the most important thing is the food and it was really good and up to my expectations I would personally come back again to try more dishes from the Dominican Republic."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRmVrTXpSR3gzUmtoeFVtbHFjbXgxVm1sSGJFRRAB",
            "text": "Victoria was an amazing server! She was attentive, knowledgeable, and most of all kind. The ambiance and food was also great. Will be coming back and requesting Maria as my server."
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwdmRYQ2h3RRAB",
            "text": "Luego de un par de años, pasé a visitar Café Rubio, como siempre, las mejores atenciones en un ambiente agradable y familiar y sobre todo deliciosa comida ! Afuera encontré un auto de colección que me pareció muy atractivo, para dar una vuelta por NY en buena compañía. 😃"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNla04zRmt3RRAB",
            "text": "Just was walking through the area looking for a place to watch some football, so glad I stumbled upon this place, the food was amazing and drinks very good, all of the staff I came in contact with were exceptionally nice and friendly. I don’t speak Spanish so it was a little difficult ordering but still totally worth it. The interior is very clean and modern and the bathrooms are above excellent compared to most restaurants. It doesn’t look like much from the outside and after walking around the area I didn’t expect a place like this to be here, definitely don’t pass it up if you have a chance."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKX3VmTGVREAE",
            "text": "El lugar es muy lindo, aunque ellos tengan su público, si ellos se dedicarán así como le dan publicidad a los juegos de pelotas le dieran publicidad al lugar fuera un éxito. Más personas tendrían porque en ese Instagram de ellos solo es anuncios de pelotas que colocan. Si era por eso yo no iba a ir nunca porque no veía nada atractivo, yo fui porque una amiga siempre va y me dice que le gusta, y el lugar está bellísimo. La comida es económica y buena."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteGFuTV93RRAB",
            "text": "We've been coming here for years - can't believe it's taken this long to write a review. But Rubios is seriously the best - the breakfast here is our JAM. You can't go wrong with anything on their menu, but some of my favorites are the Rubios breakfast burrito (so filling), breakfast plate (eggs, plantains, and beans), and breakfast sandwich (with yummy bacon). I'm usually in the mood to have my eggs cooked a different way every time I come here, and they are a champion in terms of getting my order right each time.\nLove the family - seriously, you can taste the love in their food. It's what keeps us coming back. Also, huge shout out on their lunch and dessert offerings. We don't come for lunch that often (usually because we're here for brunch and fill up on breakfast food), but their chicken and carne asade dishes are crazy good. And when I'm really feeling like I need to indulge, I get a slice of their chocolate cake or fruit tarte to go. Makes my entire weekend.\nThey are OPEN during this pandemic for take-out and delivery so do yourself a favor and get some Rubios."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WVFrZDBVbmd4WjNJMVRXOHhOblJDWlVScGMyYxAB",
            "text": "Visitamos Café Rubio y tuvimos una experiencia excelente. La atención fue de primera, especialmente gracias a Luisa, nuestra mesera, quien nos atendió con mucha amabilidad y profesionalismo. Estuvo siempre atenta a los detalles y nos hizo sentir muy bienvenidos. ¡Definitivamente volveremos!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGblpubEJiMlJvY2tWd2RqTkNXbDgwUVZSWmJVRRAB",
            "text": "I’ve been there a few times and the service was great every time. The waitress Laura was very attentive and polite. I’d definitely like to go when she’s on duty."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMlVqUTVZMEpUVGxKWVpHeGlkMHRMTjJFMk1uYxAB",
            "text": "Definitivamente este es un buen lugar para comer rico , escuchar buena música y tomarse unos buenos cócteles . Mi experiencia fue 10/10 , gracias LUISA por tus amabilidad y recomendaciones del menú 😁 . Volveremos sin duda ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKT2F2bzd0aHJpVWN3EAE",
            "text": "I went there for the first time with my girlfriend and had a very good time.  My waitress Diana was very attentive and made it very easy for us to order Food and drinks. I will def come back with friends."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMUHBtckhzMnVPNDJ3RRAB",
            "text": "Definitely recommend this restaurant. our waitress Laura was so patient and helpful with our large group, making everyone’s order were perfect. a true professional!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyeElfaURREAE",
            "text": "Super experiencia el servicio de primer nivel todo el personal super amable, muy atento y  con toda la disposición para atendernos, la comida estuvo excelente, estuvimos un grupo de 20 personas y probamos variedad de platos empezando con el mejor aperitivo que me he comido la estrella del amor que tiene salsa blanca deliciosa  y el crab cake, también como plato fuerte pudimos compartir el Tomahawk acompañado de un excelente Vino, plátanos a la playa, Jarabacoa ensueño que trae una salsa de cangrejo exquisita, y el salmón rubio que tiene una salsa blanca espectacular , tienen variedad de cócteles y buena selección de vinos también, todos los comensales quedamos muy satisfechos, el ambiente increíble, el patio muy agradable y acogedor con buena música, me encanto este lugar súper recomendado para compartir en familia o con amigos. 200 de 100"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNFpFbHhVemRXY1hneWJ6ZE9hbEpJU2tOUU5WRRAB",
            "text": "I had such a great experience thanks to\nOur waitress  Laura,, she was friendly, helpful with the menu and always had a smile. excellent service definitely recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKQ1o4UE9ldHY2b2VREAE",
            "text": "I visited this restaurant on a Monday at around 1pm for the first time ever and was unfortunately let down by the service. Despite high expectations, the experience fell short due to the inattentive waitress, there was only two tables by the way, i would understand if it was packed but it wasn’t the restaurant was empty. We initially get there and are seated, then we’re asked if we want a menu we kindly said yes. Which i thought that was automatically done when dinning in a restaurant. Then she brings one menu, mind you it was a party of two. We asked for the check thankfully the person i was with looked at the check to find that it was the wrong check for the larger party that was there. Best part is gratuity is included there’s no option out of it regardless if the service was subpar or amazing. I hope the management addresses these issues, from the reviews it seems as if we weren’t alone with this terrible experience. Also skip the mofongo."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bUxiOWVnEAE",
            "text": "Love this place anytime - dinner, hookah, DJ, live music, dancing - doesn’t matter!\nSeafood plate “Plátano a la Playa” was out of this world!"
        }
    ],
    "reviews_count": 80
}