{
    "name": "Jardin De China",
    "place_id": "ChIJ43rlGLlfwokRkwb5mrdsl00",
    "grid": "QN4",
    "address": "37-37 Junction Blvd, Corona, NY 11368, USA",
    "rating": 4.5,
    "user_ratings_total": 1342,
    "phone_number": "(718) 476-3755",
    "reviews": [
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOamMweGhiRkUxYlRkVmJGSnVZMnBtUmpsbVoxRRAB",
            "text": "Excelente servicio y una atención buena todos hablan español"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWeVVXUkRhME5UVURaMVpVc3piRE5qZHpRMFNsRRAB",
            "text": "This is where old school Chinese-American classics meet the world of Latin America!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVmRVMXpjVTFwY3psUFgyUm9MWFJLVDBGV1VIYxAB",
            "text": "Yeah yeah yeah they were shut down so what, some of your favorite $300 restaurants are far worse! THEY’RE BACK! Worth the wait!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVVZHZFhkVXhOVGxkaVNEbHhNSE52TW14d2RVRRAB",
            "text": "Is the best food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WME1VNUNiRzkzWjJkeVUwczJWazEyYUdrMVJXYxAB",
            "text": "This place is temporarily closed for hygiene and mental health issues. If you call you will get a busy tone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOQllrWlJRWE5oU0RsUFVWZ3pOa2xXZUhSblNrRRAB",
            "text": "Went at 9:30pm only to find out the place has been closed for hygiene and mental health by NYC officials. This should be advertised so people don’t waste their time going. In addition when you call you automatically get a busy tone."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTFUybERYMVpqVG10bk5sTnBSbUpSVlc5UmNYYxAB",
            "text": "Definitely a biased review on my part... haven't been inside for quite a number of years, and yet I recall always enjoying the food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dlIydDVPRUpMTWxsaFJsVk5PVGRtVjJOVWRrRRAB",
            "text": "Ordered the fried wonton but it was not good. The sauce was very watery. I also tried the fried rice and that was good, it had shrimp and pork. Not impressive but it was ok. Good service and dont forget to bring cash is a CASH ONLY place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWYWFqTXdkRTVQV2t0YVMwSjVUR2c1TlRsSmFFRRAB",
            "text": "Cash only business. Had my food served when I found out they only  take cash  they preferred to take food which was already on my rable away  instead of allowing me to zelle ( no debit card on hand)\nSo you know what  that  means they will resell the same food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poT1VuTlFaalpzY1V0MVpHRkVWV3B5WVRKTlgzYxAB",
            "text": "I was definitely skeptic and being on a boulevard and the outside but once inside, I was welcome immediately and given recommendations with the upmost attention to detail and customization I have a pork allergy and my nephew had a nut allergy and they were overly accommodating. My nephew also physically disabled and in a wheelchair and they went above and beyond to accommodate us with plenty of space. Love love love the food was DELICIOUS and hot made to order I loved it here def going back"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMVpubVZREAE",
            "text": "I've been going here since I was a child.  Every single person that works there is involved. I mean you don't have a personal waiter.  Everyone is your waiter.  And yes you'll hear people talking, plates clanking, doors opening people walking by but the food is incredible.  Latin and Asian dishes. Must go to know and understand."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCT1kySnplbFJUVUZOSGFFaHNNRnBtUVhaV1FYYxAB",
            "text": "I’ve been coming to this place since I was a kid. Throughout the years the staff has changed but the food had stayed consistent until my last visit. I was served a very bland and improperly plated dish that came 15-20 mins after my wife’s food came out. The servers were very rude and ill be honest, it felt like they brought my food out last purposely. I watched people who came after me be served food before I did. I still tipped because it’s not in me to be that inconsiderate. I will never return here and I am very disappointed and sad that this place changed so much."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWczhtbDhBRRAB",
            "text": "Food is just ok. Not worth the trip.\nPros: Food is cheap and is served quickly.\n\nCons: Food is not that tasty. It tastes like it needs more seasoning.\n\nI ordered the ropa vieja with fried rice. The ropa vieja lacked flavor and the fried rice could have been a bit less greasy. I don't recommend it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WV1ppMWhhbnB3YzFvMWFrVnFiMlYwY3pOUE5HYxAB",
            "text": "Cash only"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTWRFSmpWMWh2ZFdsM1VDMUxRVUl0WVdaUE5VRRAB",
            "text": "Best pork chops in all NY!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa2IyZERkbkZrWlU0eGJVeHRURmx3UkZGa2VVRRAB",
            "text": "Best restaurant in Corona Queens. This place should be a land mark in Queens. Food is great the staff is great."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbmNYUkJURGRVVnpWWlFVOVJaelJPZFdWMVRHYxAB",
            "text": "Me encanta el arroz chino excelente servicio 😇🙏🏻"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bFlrSXlabGROZUZaVE9Hc3dkMHhDTVZGV2RWRRAB",
            "text": "Tried three dishes during my visit, and each one was absolutely amazing. The flavors were fresh, vibrant, and perfectly balanced—definitely a standout. What really impressed me was the speed of service and how attentive the staff were throughout the meal. Every detail was handled with care, making the dining experience seamless and enjoyable. No complaints whatsoever. Highly recommended for anyone craving delicious food and excellent hospitality!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SM01FNUdaR2s1TVdsd00weEpOR3d6VDBONGRtYxAB",
            "text": "The food here is absolutely amazing! There’s a wide variety of dishes to choose from. I highly recommend coming here with friends and family for a fantastic time. Plus, the prices are very reasonable, and you get a lot of food for your money."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1emVsUldTV2hrYkROeVZrNXFRa2RGUkhGNmVIYxAB",
            "text": "Favorite Spanish chinese food"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVlNuSkxRVTVrUWtoMWJGWk9iRXhKZURkM1NFRRAB",
            "text": "Un restaurant con Años de experiencia. Cuidan cada detalle."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdVYyNG5vbmJ6OG1RRRAB",
            "text": "Food was delicious will definitely return."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKbmFtNURac3BiYmx3RRAB",
            "text": "tengo años viniendo a este restaurante y la comida nos encanta, a pesar del servicio que aunque es eficiente se siente como que quieren que termines y te vayas rapido, pero esta ultima vez que fuy la comida estuvo horrible parece que la tenian desde el dia antes no estaba caliente el arroz estaba duro y mi madre no disfruto para nada la comida, me senti peor porque la lleve de dia de las madres ya que no pude celebrarla el dia de las madres viajamos en tren desde manhattan solo a comer en ese lugar que le encanta a mi madre pero la experiencia y la comida esta vez se ganaron un 0 no iremos a ese lugar por un buen tiempo!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNVE90bzJudGFDSWd3RRAB",
            "text": "Me gustaba el jardín de china el que estaba en la 82 st . Y que daba en la 88 st. Y Roosevelt ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNMnN6dHF2aXFIYjJ3RRAB",
            "text": "The food is really good, however they need to work on their cleanliness, last time I was their a mouse passed right by my table and as good as the food was I couldn't finish my meal. It wouldn't hurt on changing the lighting and decor. This place has been there for decades, a little redecorating and extermination wouldn't hurt"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQMml3NFBiMU9Xakd3EAE",
            "text": "Food always good been coming here since 2005"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMweEsyRkhREAE",
            "text": "This place is a must try, big portions, great taste, large selection to choose from. I’ve never left this place disappointed.\nFriendly staff  cash only … A+"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc0tQaWp3RRAB",
            "text": "Best Chinese spot in queens .. bring cash!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMC1ubzdBRRAB",
            "text": "Queens staple ! Amazing food ,, legendary"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OTVlQzFBRRAB",
            "text": "Best Chinese whatever food ever."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bmRXZDFnRRAB",
            "text": "At a time where small businesses are being drowned out by chain restaurants, Jardin de China has remained a staple of the Jackson Heights community for several decades. My first visit to this establishment was with my father as a young child, when he convinced me we were eating \"old clothes\" at his favorite spot, but it was just the best ropa vieja I've ever had. Fast forward 35 years later, and the ropa vieja recipe has stood the test of time. They have a blend of Asian and Latino dishes, and the old-school waiters, who are the best representation of the diversity we have grown up with, speak fluent Spanish and Chinese seemlessly. I bring my kids here now, and I hope to share many more meals with this neighborhood gem."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRZ28tU3JRRRAB",
            "text": "Food is amazing. Service is good. If I was being picky my only small complaint is it can look cleaner and brighter and It lacks some cultural ties to Cuba not much decor, pictures or music. The wait staff are very much Chinese and also speak Spanish."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRM0tXUnFnRRAB",
            "text": "Staple Queens everybody knows this place that’s grown here. The food is OK. The service is all right and the ambulances. What are you looking for a Chinese restaurant? FYI they speak Spanish."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3ZzR5Z0N3EAE",
            "text": "I been going to this place for YEARSSSSSSS I'm 47 and since I was maybe 20 I been going here. The food is still amazing down to their Porkchops w/ White Rice and Black beans and Plantains too their  House special Fried Rice w/ Shrimp with Lobster Sauce! Amazing! All they need is an update of the bathroom."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnejZMYjNnRRAB",
            "text": "Food ws good"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaFpucWd3RRAB",
            "text": "Went in at a weird hour (2:30pm) on the weekend and the place was filled with people - great sign! Food was delicious and staff were incredibly accommodating. Portions were generous. Highly recommend."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncjhtMHhnRRAB",
            "text": "La comida es excelente!!"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBazlUQjdnRRAB",
            "text": "Siempre como hay que puedo así q es uno de mis lugares favoritos lo recomiendo"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBenBHTV9nRRAB",
            "text": "So cheap with the FREE BREAD! Nasty attitude always rushing people. Just because you’re good is good doesn’t mean you should be mean"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHMy1fVm9BRRAB",
            "text": "Got sick Saturday night when I got home"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNll2RC1RRRAB",
            "text": "Food is ok, used to be better. What I find odd is they charge you tax on cash. If they’re gonna charge tax might as well take cards."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcXMzeENBEAE",
            "text": "Good service\nGreat food..\nNeed to upgrade bathrooms and keep them clean"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfenZQR09REAE",
            "text": "An old school restaurant.great place being going almost or more than 20 years"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOU42S2VREAE",
            "text": "I love to eat here."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmb283a2lBRRAB",
            "text": "$120 Awfully spent. We ordered Rice, chicharrón de pollo, sweet plantains, Steak with onions, breaded pork chop,  chicken mofongo, ribs, and flan. The food was not fresh. Ribs had no flavor , Chicken in garlic with mofongo the Chicken was OK, the mofongo no flavor, fried chicken chunks Awful, couldn't even chew it. The rice also tasted as if it was old. Sweet plantains hard as a rock. Vanilla flan also was bland. Now I want to include this was food ordered to go an hour or 2 after they opened. So, we believe it was Food left from the day before. If you stay in and eat, I'm sure there's a less possibility of you getting old food.\nA business that makes so much money should not be serving Old food to their customers whether to stay or to go. If you are driving get PEKING BBQ on 58-11 Woodside."
        },
        {
            "date": "10달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNUlHYVp3EAE",
            "text": "Delicioso"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MWRHaXJBRRAB",
            "text": "The food is great. I love their \"arroz moro\""
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXa2JIcHdnRRAB",
            "text": "My favorite restaurant in my neighborhood Queens"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbEpIZjVBRRAB",
            "text": "I’ve been here a few times and I enjoyed the food. I wasn’t a fan of their chicharron de pollo and their Maduros. I definitely did like their Palomilla steak and shrimp fried rice. I just wish that they would give more shrimp instead of 4 pieces. The servers are always on point and friendly. The only thing I didn’t like was the temperature of the restaurant. I was seated where it was apparently warm (came in the beginning of fall) then halfway through my meal my food was getting cold because their air conditioner was turned on! I have come on around dinner time on a Friday and on a Thursday and both times I got seated right away."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdjZTX2dRRRAB",
            "text": "Food is quite delicious if you love Spanish & Chinese food. Highly recommend anyone to try it if you in Corona Junction Blvd area in Queens. Grew up eating this food since I was a kid over 30 years ago still the same great taste."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMl9YcVZBEAE",
            "text": "Jardín de China has been around for years!! Honestly love going there. They are quick, and food is always great!! My top favorite is the “House Rice”!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z0pfNC13RRAB",
            "text": "Best General Tso Chicken! No weird chunks and good tasting sauce! Fried rice was amazing as well as the maduros. Only issue is the chicken soup is for sure straight out of a Campbell’s can but because a good General Tso chicken is incredibly rare, place is 5/5!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2N05QcWpRRRAB",
            "text": "Food is really good.\nYou can get a big meal if you order any of the specials under $20\nThe place is very humble and has alot of seats so you wont have to wait in line. The staff are very friendly and you get fast service.\nThey are cash only. There is an atm. Also a chase bank next to them."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1Nk1MN3F3RRAB",
            "text": "Delicious !!\n\nFood is consistently good! The waiters/staff all speak fluent Spanish. I have been eating here for years and I am never disappointed. Some people are comparing that prices have gone up, but I still think the pricing is reasonable for the quality and amount of food you receive.\n\nMy favorite is bistec de la plancha, special fried rice and Maduros. I also love their wonton soup which is handmade and fresh! 🍲"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvaDl1TlpBEAE",
            "text": "This was my first time here. The service was genuine and quick. For an appetizer, they give you crunchy noodles with duck sauce. I ordered the steak with mixed rice and plantains. Very delicious. The rice does come with pork and seafood so…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMTkzN0VnEAE",
            "text": "Tienen el nestee y el arroz Chino 🇻🇪 que he buscado por años! Excelente lugar, excelente atencion, los mesoneros no toman nota del pedido, me parecio increible que tuve mi plato exactamente como lo pedi. Tienen billetes de mi tierra, conversamos con 2 de los ellos, vivieron 32años en Vnzla y trajeron la reseta 😍🤤"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhbHEtV3R3RRAB",
            "text": "3 stars bc the food isnt the same from when i first started coming back in 2006. Its still good but i have had better. The general tso was better than the chicharon de pollo."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4djYzOXJBRRAB",
            "text": "Service is fast. The arroz Moro is delicious with fried shrimp. They only accept cash. Only thing is after they serve you, you can’t find them. Flan is so good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxZ3Y2UjN3RRAB",
            "text": "Have been coming here for years since I was a kid with my family food is stills as amazing and yummy as I remembered! Not greasy at all and the house special fried rice is the best !"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJazluaVZnEAE",
            "text": "It was so good i had it twice!\nGreat food with awesome prices!\nThe wait staff even speak spanish.\nThe best part , the food is out in 5 min flat!!!!\nI love this place!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaHA3NHVRRRAB",
            "text": "The meals I ate were delicious and didn't take long to arrive at my table. The staff is professional. I felt welcome at Jardin de China. The waiters are multilingual; they speak English, Spanish, & Chinese. I went there on a Friday evening (Oct. 7, '22), so there were lots of customers, noise, & activity.\n\nJardin de China is a cash-only establishment. No credit/debit cards accepted. No Apple Pay, Google Pay, Samsung Pay, etc. available. No NFC. No Cashapp, Zelle, Venmo. Don't even ask about using checks. Cash. Only. There is an ATM-machine on premises though, if you need it.\n\nThe lighting is kind of dim, but there are decorations. Red lanterns hanging from the ceiling and the currencies of different countries framed on the walls. When you walk in, tables seating 5 are at the left side. Tables seating 4 are in the middle. Booths are at the right.\n\nAs I said, my meals were delicious. I had mixed vegetables sautéed in garlic sauce which comes with a rice dish of your choosing. I chose black beans & rice. So, that's one meal. I then decided to have shrimp with broccoli, also sautéed in garlic sauce, with fried green plantains. Another meal. They kept serving me water. And I had 1 glass of chablis. I couldn't eat everything lol. I was so full. But so pleased.\n\nI won't give Jardin de China 5 stars however, because the prices listed online are not at all what's printed on the menu given to you by the waiter. The prices are misleading. What I have put here is the menu I took on my way out. Which doesn't match what the waiter gave me (the prices are a little higher on that one). I actually paid $11.50 for the mixed veggie meal, $20.75 for the shrimp & broccoli, & $4.75 for the glass of wine."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aXUtQVB3EAE",
            "text": "Huge menu of Chino Latino favorites, and the food is good. We had lomo saltado, fried rice, plantains, wonton soup. Cash only. They check your vaccination card but it's okay to show it on your phone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMEk3VU1nEAE",
            "text": "Amazing legendary place just one complaint the butter for the bread is always cold please please please take them out the fridge on the hourly basis"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NS11X0ZnEAE",
            "text": "Food was delicious. Everything tastes perfect. Only con is they are cash only."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXOWFTZEhBEAE",
            "text": "This place came highly recommended to me by locals (friends and family). Service was attentive and extremely nice. Food was delicious and served in abundance. I took half of it home. Also, their sweet tea was good (Floridian here)."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbjVPeklREAE",
            "text": "The food is worth the price,they fill the plate n the food is just delicious. Will leave with your tummy full and satisfied."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUOXByNDVBRRAB",
            "text": "Employees are friendly and nice! My food was tasty and delicious! I will be coming back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNXJpY2lnRRAB",
            "text": "The food is always good; Every time we go. The Loma Salado is a must have. Service is fast and the waiters are friendly. Prices are fair for the portion sizes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaUxpajlRRRAB",
            "text": "I been eating here for a long time and it amazed me how good the food tastes and that ot always tastes the same. It's not the prettiest of place, but when you taste the food you can transport your self to what ever happy place you want. I paid $75 for three people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidDZlRmFREAE",
            "text": "USE to be one of my favorite spots not sure why the decline in quality. I keep coming because of tradition I had with my family, it’s time to cut ties with this place. It’s not the same anymore. Time after time disappointed with my food or…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbnBEY0RBEAE",
            "text": "This restaurant should train their employees to stop holding the top of their customer's glasses with their sweaty hands. It's so disturbing to see someone else's fingers deep into my glass of ice that I'm supposed to use to drink with. I've avoided drinking the water they serve us at this restaurant because it tastes like cheap quality tap water. The tap water from my home tastes better. When the waiters bring the bread their sweaty hands are also touching the bread we are supposed to eat. Waiters use their hands to wipe the sweat off their face and use their hands to grab the money and use a rag and broom to clean the place their hands should not touch my food. Please fix all of those things as soon as possible. Please buy your workers gloves to work with because sanitation is very important everywhere. Even better if you buy masks for your workers to work with because of coronavirus"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLa3JMUUtnEAE",
            "text": "Muy delicioso todo lo que se pueda comer.  Buena sason y variedad."
        }
    ],
    "reviews_count": 72
}