{
    "name": "Taste Good",
    "place_id": "ChIJvbqGvKxfwokRWCm0QHlt99A",
    "grid": "QN4",
    "address": "82-18 45th Ave, Elmhurst, NY 11373, USA",
    "rating": 4.3,
    "user_ratings_total": 860,
    "phone_number": "(718) 898-8001",
    "reviews": [
        {
            "date": "7시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkV1NsVTFiQzE2WTNoUlZISm1lak5ZZFZGWmJGRRAB",
            "text": "I've become predictable in my praise for this restaurant. Great cooking and friendly people. The employees maintain composure always. The dishes were reliably good, I want to emphasize. The price matches the quality perfectly."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psZlkzWkljVU5yYW5OZk9UUldORUZMZWsxQ1VuYxAB",
            "text": "Taste Good creates meals worth traveling across town to enjoy. You'll find these flavors are exclusive to this spot. I appreciate the aesthetic and food selection. Staff friendliness transforms routine visits into enjoyable experiences. This restaurant merits your attention."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbllrd3hNVmhXV1dwRWFVNUVRV2hHZFV0ZmMzYxAB",
            "text": "I left full and happy after my meal. These employees provide service that outshines all competitors. All dishes show attention to flavor. The restaurant has consistent positive vibes. The staff delivered quality service and I plan to return."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRU1FOTRWV3BSUVVoR01FWmxhVUZ0WlZwV1RGRRAB",
            "text": "Taste Good Malaysian Food in Elmhurst is one of those hidden gems that you’re glad you found. The dishes are incredibly flavorful, and the portions are generous for the price. The roti served with the chicken curry was especially good the bread was warm and flaky, and the curry had just the right amount of spice and depth of flavor. One nice touch is that they give you free tea with every meal, which makes the experience even better.\nThe food also comes out very quickly, and the staff are friendly and attentive even when it gets busy. Just keep in mind that this is a cash-only place, so come prepared. Malaysian food isn’t something you find everywhere, especially made this well, so it’s definitely worth checking out if you’re in Elmhurst or just looking to try something new."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSVVFaEtXbVE1UTFOMGNVWmZNMnA1VURWcllYYxAB",
            "text": "Tried their laksa and rendang and its so good!! I was just craving rice then my friend recommended we go here bc the food is good and it didnt disappoint! The laksa is 10/10 and the tofu so yummy and  beef is so tender in the rendang. Must try in Elmhurst. Cash only btw"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVlpVUnJWVFF6VDNOU2FWSkxYM05NYzBoYU5sRRAB",
            "text": "As soon as I saw three chefs outside smoking cigarettes, i knew i was in for a treat. Everyone knows the more chefs outside a restaurant smoking, the better the food, and yes, the food was incredible. Wait staff also very nice. Taste good, very very good."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocFlqUnVYMVJCTlVwWFYxcExjbmxrY205MlJYYxAB",
            "text": "Not the same anymore! This place is a place that you should not visit anymore. They forgot my order and the place is dirty. I guess they are in business too long. The kitchen doesn’t cook good food and their service sucks. Don’t go!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UlgzaG9SRFpvYmpCdFgxcHllSE5YYTBoclZFRRAB",
            "text": "I remember really liking this place back in the day, but it feels like both the quality and portions have gone downhill over the years.\n\nHainanese Chicken (3/5): Don’t expect an authentic Hainanese flavor here but the best portion was this dish\n\nRoti (3/5): Tastes decent, but the portion was very small\n\nBeef Rendang (3/5): Flavor’s there, but nothing that really wowed me\n\nTofu Pepper Dish (3.5/5): One of the better dishes, tofu was fried perfectly, but there were only a few pieces.\n\nGravy Rice Noodle with Scallion (2/5): This used to be my favorite… now my least. The gravy was super watery, and the portion small again.\n\nFYI: Still cash only"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaE4xcEJVWEJVU2xkblYwOTBOMnRITFRRNVJtYxAB",
            "text": "We found an ant or some bug in our fish head soup and they said it’s just some burnt pieces of food from the wok. We left them 10% tip and they chased us out the door like other people who experienced this below. The food is fine but not sure if the food prices justify it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNGRGUlFabXQ1V20xemJHcHZiRnBCYkRWa1FsRRAB",
            "text": "Love it, amazing service food was a 10 out of 10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcmJEQnVaMjF2VDNKUFVHdGlOMVpOV21aVmJFRRAB",
            "text": "Came on a recommendation for great, affordable Malaysian food, and yes they were right!\n\nChar Kway Teow (Malaysian Noodle Stir-fry) was tasty and best dish. Also enjoyed a Cantonese Chow Fun (Gravy) that sauce resembles a bit of bean curd soup with fish cake and choice of meat. The Fragrant Spicy Chicken seems like a more fried version of Peking Pork Chops but can be a bit too dry.\n\nEnvironment can seem like a local's hangout and boisterous and tight, but food comes quick and enjoy the TV and wall of the wide variety of dishes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTmVucHVTV2xxT1RWT1IyVlZVMFpqWW5OQ2JFRRAB",
            "text": "Great tasting food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWlZtVm1VMUoyYlhOcmFURm5aek0xYTJVelpGRRAB",
            "text": "The nasi lemak was decent and the satay skewers were okay although dry. I wanted to try their hainanese chicken but was disappointed that it wasn't available when I went."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeFEwMW9Ra3A1UWtjdFZVOTJhMnhWYW1aNUxWRRAB",
            "text": "The place is small and if on line, people are on top of the first small table.  VERY loud!  Service was quick and were friendly.  Food was such a disappointment after reading so many good reviews.  Had sizzerling plate tofu... The sauce was so gloppy and thick... Was eating starch!  Hainenese chicken was over cooked for Chinese standard... And the sauce that usually comes with the dish was sweet and garlicy.  Belacan eggplant is definitely NOT belacan.... It was watery and no shrimp paste flavor.  The worst was the laksa... It had pineapples and raw onion with a silver pin noodle like texture noodle... Nowhere near how laksa is suppose to be."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTE1ISXlhREJCTVVwSVMzaHdWVFpHVkUxMlpIYxAB",
            "text": "Food was mediocre at best and the staff was rude. We tipped 10% for a party of 2 and the waiter started being rude, demanding that we NEED to tip a minimum of 18%. Completely unprofessional. Poor experience overall, would not recommend. There’s better Malaysian restaurants in NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMGJWcENWVXhoU214T1JHTlZYMDl4WldkWk1VRRAB",
            "text": "I used to come here and have been ordering at this restaurant for years, but i recently came on a Wednesday afternoon to order some fried noodles only to find out that they are skimping out on portion sizes. It came in a medium-sized white container, but i noticed the  container. The noddles were in, looked half empty, and weren't even filled to the top. Tried to ask the lady at the front counter to recook the order for me, and she refused, and her and another guy told me, \"This is how it comes.\" You could see the container is clearly half empty from the top but they both denied it. I understand the economy is in a vulnerable and bad situation right now, but what's so expensive about fried noodles that you have to be skimping out on portion sizes??? At least inform your customers that you're going to be cutting down on portions instead of making them pay the same price for regular portion and getting less. Noodles can't be that expensive. Im guessing this is not only an economical strategy to save money but also since its recent competition in the area  \"coco malaysian\" disappeared they chose to take this route to save cash. Dont know if I'll return to this place. Dont feel like paying $12 for a container of fried noodles only to get half a container. I really used to love it here. But it seems to be going down in quality much like the other restaurants in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTlZrazNhRWh6ZVhkYVpGRnhWVFZPVjFCc05XYxAB",
            "text": "Excellent, abundant Chinese Malaysian food with an eye-poppingly long menu. Many items are variations on a theme, making use of strong core ingredients like the very shallot-y, savory sambal. I don't think you can miss, but the dry noodles with roast pork sealed the deal for me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNmFVNXFXRXd4WmpsaWFucGxTRFZrY2tOdFIxRRAB",
            "text": "The place has created something that clearly works. Staff attention stood out in a truly distinctive way. The kitchen experiments with consistently delicious results. This restaurant works perfectly for social gatherings. The workers deserve continued success."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscFYwbFhPR1ptZDFWNGJuY3dNMkZ6UzFKcFgxRRAB",
            "text": "The server did not like that we gave them 15% tip. He confronted us to give him more when we paid, and when not enough, he chased us outside the restaurant. We told him the tip is \"suggested\" per what the receipt said. The service was not extravagant, and one of our dish was forgotten until reminded.\n\nHighly disappointed about that. Will not be coming back again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMWJsbEpSVUpZWDIxcGRXVnJjREJ4VldjMWMyYxAB",
            "text": "Food was over the top delicious and the service was warm and welcoming!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veGVTMWlkM05SY2tWQlJIVmZhVTlJTWsxUlNVRRAB",
            "text": "Food was good but they will chase you down for the suggested tip. Tipped 15% because service was slow, but they will chase you down for 18% and more. Had this place for lunch."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S1EyWlZhMEZLTFZCcVMyNWZSbmhLTlVvdGNGRRAB",
            "text": "Food is amazing and taste so good. You should try their seafood egg chow fun. They cook the noodles in wok hai (has a little burnt taste) but it goes well with the egg gravy.\nTheir bathroom is small and somewhat clean.\nService is good!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tab1NGZEVhVTFaVW5sTU1FUnZiRkE0Y2xCeVRrRRAB",
            "text": "Amazing beef rendang. Cash only\nKari laksa was rather bland"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxS1NFcDRTbVpSYnkxclJEbFNZVmcwWVdOUFNVRRAB",
            "text": "They have good Malaysian food! Sometimes they have long line since the space is not spacious. And you must be ready with cash for the payment."
        },
        {
            "date": "수정일: 2달 전",
            "language": "zh",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycVotUlRREAE",
            "text": "服务态度极度恶劣！\n环境极差！\n脏，烂，差！"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUFdVdDFWazlVWkZSa2VqZ3hZWGxUVXpaUGRFRRAB",
            "text": "Been a long time customer of Taste Good. Recently went and ordered the Ginger Duck. It was a massive ripoff. It's just 6-7 pieces of bones and neck. That's a $13 duck dish. I don't think there's even 1oz of meat in there.\nAlso, the tofu shrunk in the sizzling tofu dish. It's tofu. How stingy can you get to serve smaller pieces of tofu. Over $100 check for 2 adults in a mom and pop restaurant. I might as well go eat AYCE at Akino next door instead."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKME9FNW5jRWhRVlVsM09EWm1NVlYwV0VGWFQyYxAB",
            "text": "The food wasn't worth the hype!!\nJust so you know they are gonna argue about tips!! Apparently the tip has to be 18%, and 15% is not acceptable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SS04xZE5aa1JEZFhWck5GVnBjM052VTJOVlJWRRAB",
            "text": "One of my favorite places in all of NY. I usually go for the laksa and a side of chicken fat rice. So so yummy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCR1FUUlRNelp1YjJWeWNYTllNMlozYms1S1NuYxAB",
            "text": "The space is limited. At mealtimes, you had better reserve your seat."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRGRtSlFkakJHTFZvd1lUSlBabkIwTkRVNVFYYxAB",
            "text": "It really lives up to its name. Great food and comes fast. I would definitely recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWYVJqaGtOa05SVVZsWU0xRTJZVkUzWWkweE9IYxAB",
            "text": "Food excellent especially the sizzling bean platter dish but they expect a 18% tip and it is only cash. But the food comes out very quick."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdVBiX1JnEAE",
            "text": "Tastes good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeFMxOW5SbEJuVVZkUWRFaFFUMmxtV2pKbVZIYxAB",
            "text": "Been going to this ma and pa restaurant for a while. Super delicious, food is affordable and good portion size. The restaurant is pretty small though, so I say go with 2 to 3 people"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOR1pFY3habTlYVFRCRU4xaExVMVpTVGtSeGMyYxAB",
            "text": "Food tastes good, not as authentic as other stores I've been to. Good for it's price though."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNWVmTjFBRRAB",
            "text": "good malaysian food prices are good. try laksa soup, beef chow fun, some of my fav and fried tofu"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GYWNEbFJUMmxmWTBVelMzazRTMGRNWlRaNWJuYxAB",
            "text": "This Taste Good provides exactly the experience its name promises. The design elements here work well. Workers here delivered satisfactory attention. Each course showed more skill than the one before. I'm making this a favorite spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oc04yWnRZbWwzV2tka1VFaFpaVjkwVmxKUWVGRRAB",
            "text": "Delicious and cheap food. Small place, but still nice and clean. Duck and beef were super tender and the sauces that accompanied them were very flavorful."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toS1VqZFZhek5rVDJVMWRXdzVObWczTVhJeFYyYxAB",
            "text": "Very cramped space, but the people are super nice.\n\nThe Hainanese chicken on its own is about a 6 or 7, but with the sweet and sour sauce, it’s a solid 9 — seriously, that sauce makes it.\nThe sizzling bean curd (tofu) is a must-have. The sauce is spot-on — not too salty — and the tofu has great texture: crispy on the outside, soft inside"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUU1EazNSeTFNZGtWZmRHNDFTVk42Y1ZCMGFuYxAB",
            "text": "Their Singaporean Hokkien Mee is most definitely not hokkien mee at all. It’s just stir fried noodle with barely seasoned seafood etc.\n\nHokkien mee must have the prawn gravy which it is lacking completely"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbmRWUkRTamgyYmxadmJHWnFXbU52Y0c1MlZWRRAB",
            "text": "IDK WHY this place has a C rating and it's mainly why I haven't made the 50 min trek out here but the only lunch I had out here I can still remember n think about and I might have to ignore the C rating to get some of the feels back again. Bless"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMU1HWjJlR0Z4ZFU5YWJIaGtWV280UmxOZldtYxAB",
            "text": "The guy on the phone taking orders is so mean.  Zero manners and had the nerve to yell WHAT when I was politely telling him my orders.  Restaurant just lost my order,  I will never go there for take out or dining in.  Unbelievable rude to customers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVFNESjJVVUZSTW5aYWVYcFZaMjF1ZWpSdVRGRRAB",
            "text": "Not as good as it was\n\nSO much pricier"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWVVsVjZOblJuU1RaYWFrdHhSVWhQWkRNNWQyYxAB",
            "text": "Been grabbing take outs from here for years and finally try dine-in. After seating, you are given complimentary hot tea and food came out in about 5 minutes after ordering. Portion is huge especially compare to price with chow fun and fried rice at $12 each. The taste was good and servers are always looking up and down to attend to your need. Note that this restaurant is cash only. A gem in the neighborhood!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcVEwUmxRM0J1TmpkNU1EbFhYMlV4WldablNWRRAB",
            "text": "Roti canai was so tiny it’s almost sad.. most other places they’re as big as my face and can be shared between two people but here they’re so cheap, like cmon it’s literally flour and oil, why skimp on something that’s already so cheap to make?"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNFluVllOMVpuZHpKVmJWVllSR2xoZVcxWlRrRRAB",
            "text": "The food here slaps. Eat here."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M0tIdzdnRRAB",
            "text": "May 2025: Dropping a star. Tried the following with a group of friends and it wasn’t great: hainan chicken (under seasoned and not tender, Malaysian curry chicken (normal), curry laksa (very under flavored), sizzling tofu (good but also slightly under seasoned), mee siam (the best dish of all), chicken satay (not bad), roti canai (not flakey, average).\n\nJuly 2024: came here for dinner and maybe this was an “off” day. Both dishes we had weren’t great and I hope it’s really just today. Not adjusting my ratings for now but will continue to update when I visit again.\n\nOct 2023: Came with a few friends for dinner and there was a wait - ordered a few tofu dishes and mee siam and they were good!\n\nMay 2023: Hands down the best Malaysian food in New York City! I grew up in Malaysia and am pretty familiar with the flavors. Found taste good during covid lockdown, ordered a couple of times for takeout, and loved quite a number of their dishes. Finally got a chance to dine in, ordered Seafood Wat Tan Hor (silky broad rice noodles) and Assam Laksa. The wat tan hor had really good “heat” (wok hey) will the laksa had a lot of fish and good flavors (albeit missing bunga kantan). Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOTzNpSnozd3BIbzVRRRAB",
            "text": "If you're looking for authentic Malaysian cuisine, Taste Good in Elmhurst, Queens is truly the place to be. The food is not only deeply flavorful and true to its roots, but also remarkably affordable for the quality and portions you get.\n\nI always order the fried fish cake and the crispy seafood egg noodles, both are consistently excellent. On my most recent visit, I tried the clams with aromatic sauce for the first time and was pleasantly surprised by how rich and savory they were.\n\nThe longan juice is my go-to drink: light, refreshing, and the perfect complement to the meal.\n\nWe ordered more than enough food for three people and still paid just around $100, which is an incredible value for NYC. Street parking was surprisingly easy, which is a huge plus in this part of Queens.\n\nWhat really reinforces the authenticity is the fact that the restaurant is manned by Malaysian aunties and uncles, bringing that warm, home-cooked feel to every dish and interaction. It’s like a slice of Malaysia right here in the city.\n\nHighly recommend to anyone craving legit Malaysian flavors in a humble, welcoming setting."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKcXotWjMxcmRyd0JBEAE",
            "text": "Hainan chicken and satay chicken are good. Not much service but the staff made it mandatory to leave 18% tips,"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJaVoyc3JHeGZqckt3EAE",
            "text": "Delicious food and efficient waiters. Reasonably priced. Pretty big menu and everything I’ve ordered has been great so far."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbXBnSjJCdnNIMHVBRRAB",
            "text": "Great Malaysian food!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsb196TmF3EAE",
            "text": "Too many different menus that I have no exposure of. Just leaving 5 star for now cause I loved soup noodle I had (banmee) and would like to come here again to try some other menus. Roti canai was just alright, had bit more flour taste than I wished.\n\n반미라는 메뉴 이름의 국수가 잘 끓여진 칼국수 같아서 맛있었습니다. 정체를 알 수 없는 메뉴가 너무 많아서 일단 또 와서 다른 것들도 시도해보고 싶다는 의미에서 잠정적으로 5별입니다."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvN1llcEhREAE",
            "text": "I stopped by for lunch after discovering this place on Instagram—it looked promising, and I’ve been craving Malaysian food for a while.\nWe started with the roti, which was warm, flaky, and really satisfying. I ordered the Singapore laksa—flavor-wise, it was decent but didn’t quite stand out.\nWe also had a whole fish dish, which was impressively large and perfect for sharing.\nOverall, a nice spot with a good variety on the menu. I’m definitely coming back to try the Hainanese chicken next time!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLRzd4dktfNnRhSlBnEAE",
            "text": "Checked their spot for the hype. Can't say I had a good time. New dishes to try out but I still love Pappa Rich over this spot. The service was okay. They hardly came by at all. They didn't have water bottles either. The bathroom just smelled and was tiny. The owner (assuming the owner) was not friendly AT ALL but it was nice of him to help out his coworkers. Will not come back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd01QdXVRRRAB",
            "text": "This place has really really good food and really good reviews and I think they’re well deserved. Taste good has some of the most authentic Malaysian food. I’ve tried and I liked all the flavours and the interesting textures that they combined. I would definitely recommend the spicy fragrant fish that we got and I think the tofu also tasted nice. There can be a line and it’s not very organized. I think it’s also cash only. Would not get the popiah again, but the roti and fish were favorites."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bExxekZREAE",
            "text": "this restaurant has Malaysian bangers including the Singapore laksa that I've been craving and sizzling bean curd tofu dish which is hot and delectable, the other two appetizers I can forgo but they included the roti kanai and the beef satay overall a great place to satisfy your cravings is only thing is is cash only and they still include the tax, I would favorite this place if it didn't include the tax. also had the Malaysian iced coffee and it was very condensed milk like or evaporated milk and the lychee drink which was like a simple syrup with lychee in it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdUtHdVNnEAE",
            "text": "Some restaurants captivate with their ambiance, innovative dishes, or meticulous service. However, \"Taste Good\" distinguishes itself by delivering a slice of Southeast Asia through authentic Malaysian dishes that speak of their heritage. This isn't about reinvention but celebration—the rich, comforting, and diverse flavors that Malaysia is known for. Dining at this place feels like a visit to a hawker center in Penang, Ipoh, KL, or Singapore. It's a culinary journey that genuinely transports your taste buds to another world.\n\nThe food here is genuinely authentic. Starting with the Tahu Goreng, its crispy exterior and pillowy interior are perfectly paired with a tangy, slightly spicy satay sauce—an absolute must-try. The freshness of the ingredients stands out, ensuring each bite is a delight. The Achar Salad, vibrant and crisp, perfectly balances sweetness and spiciness, rounding out the appetizers beautifully.\n\nThe Hainanese chicken is a masterclass in texture and taste—tender, succulent, and richly flavored, exactly what you’d expect from this iconic dish. The Char Kway Teow follows suit with its smoky, savory notes, chewy noodles, and a generous mix of sprouts and greens. The Sizzling Bean Curd, a delightful twist with its square crispy cubed tofu, offers a different texture from the usual softer, round versions but delivers all the expected flavors—thoroughly satisfying and comforting.\n\nThe setting of \"Taste Good\" complements its culinary ethos beautifully—cozy, unpretentious, and all about authenticity. It's rare to find such a genuinely authentic Malaysian and Straits culinary experience in the US, making \"Taste Good\" not just a meal but a comforting escape to the heart of Malaysia right here in Queens."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNC0yTW1nRRAB",
            "text": "Our family restaurant growing up was a nearby Malaysian restaurant run by Chinese people, so I'm quite familiar with the tasty offerings of questionably authentic Malaysian spots. One bite of our first dish at Taste Good, and I knew I'd found the NYC doppelganger.\n\nIn order of best to worst, we had:\n\n- Crispy Seafood Rice Noodles: The noodles were disappointingly already soggy, implying the dish had been sitting on a counter for too long, but the flavors were on point\n\n- Roti Canai: Roti was decent, but wish the sambal hadn't been ice cold\n\n- Hainanese Chicken: I've had far better from the Motherland, but at least the sauce was a good blend of soy and chili ginger\n\n- Malaysian Satay Panggang: A bit too sweet for me, but otherwise decent\n\n- Char Kway Teaw: There needed to be much, MUCH more char, but the overall flavor was fine\n\n- Pandan Ayam: Now we start getting to the disappointments. There was no pandan flavor in these deep fried chicken wings. They tasted like the kind you get at Chinese buffets\n\n- Malaysian Popiah: Ice cold and not very pleasant in the mouth\n\n- Kangkung Belacan: Such a waste of this unique vegetable. The shrimp paste sauce was too bitter, and not savory or seafood-y enough\n\n- Singapore Kari Laksa: Ugh, how do you mess up this signature dish? The soup was as bland as broth and lacked any spices or seasonings. It was as vanilla as a Swiftie meetup, and about as interesting. Shame, shame!\n\nIn sum, this is sub-par Malaysian food made by probably-not-Malaysian people. My dining companions, some of whom were Malaysian and Singaporean, noted that the place used to be much better but they seemed to have given up trying. When we tried to order the Ikan Pari Bakar (grilled stingray, a staple Malaysian dish), we were told there was no sting ray. We asked what kind of fish they did have, and the manager shrugged and said, \"Flounder?\" That interaction seems illustrative of the \"giving up\" part."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eHJ5RDR3RRAB",
            "text": "Tonight for dinner I took my son Michael \"Taste Good\" 8218 45th Ave, Elmhurst, NY 11373. This place is right near the r train. Its a small long-running Malaysian restaurant serving some of the best hand made noodles in NYC. I started off with there Malaysian coffee and it was awesome. We both ordered Beef Rendang and it was the best dish of the night! lf you're going to order something, I think you should order this. The beef cubes were tender and nicely coated with there sauce. Also we ordered the Char kway teow and it was out of this world. It is there handmade stir-fried rice noodles,small prawns/shrimp,fried fish cake, tofu and made fresh daily.  Overall \"Taste Good\" has amazing customer service and they are all about authenticity. It's rare to find such a genuinely authentic Malaysian and Straits culinary experience in the US, making \"Taste Good\" not just a meal but a comforting escape to the heart of Malaysia right here in Queens. #onlyinnyc #queens #tastegood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdTU2aS1RRRAB",
            "text": "The food is good. I love the fragrant fish and fish pancake, but the place really shows why they have Grade C. I also saw a small roach after we ate. I might not come back again, maybe until I crave my fave dish from them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaWVLY3FnRRAB",
            "text": "Good food, good service, good experience! Approved by the Sarawakians siblings who really missed dining at authentic Malaysian food!!\n\nI ordered char kway teow, which has good amount of wok hei that I like -- but I ended up liking hokkien char mee ordered by my brother because how flavorful the sauce is. I also tried the laksa and it's pretty good (according to my sister who ordered it: a bit more coconut milk then the usual laksa we ate back in hometown). Talking with the owner later was a blast too - we ended up talking about the expenses living in the US for 4-5 minutes lol"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0Z1pMc2hRRRAB",
            "text": "This local dive is so good you wish it would stay local!  Wildly popular spot that’s been around forever.  The Curry Chicken Noodle Soup is to die for.  The noodles are the thick yellow kind.  The Curry Beef Noodle Soup comes with the thin…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNaXg0ZnFHbU11NGZREAE",
            "text": "Great cash only casual eatery, cheap food, very nice staff (who were accommodating to my peanut allergy). Highlights for me were the roti, beef rendang, hainanese chicken, and singapore laksa!\n\nWe went as a group of 4 on a tuesday at 6:30 and had no trouble getting a table. I can’t wait to be back!"
        },
        {
            "date": "1년 전",
            "language": "zh",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieC1uLXBBRRAB",
            "text": "玲珑小店，生意还好，临近厨房下班时间点了“鱼头汤米粉，朋友介绍的，果然味道不错.）－成碗清光啦👻蒜蓉通心菜炒的好吃，河南鸡点酱汁味道不错. 印度面包可以，只是热度较差一点. 下次再次光临这碗鱼头汤😍😍🍺"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNjUyU3h3RRAB",
            "text": "My family has been coming to Taste Good for years and years now and time and time again they deliver on the food. The restaurant certainly has “hole in the wall” vibes but that is simply an indicator of how delicious the food tastes. My favorites are the roti and sate skewers! Highly highly recommend any foodies or lovers of Malaysian/Chinese/Asian food come by here and support an amazing small local business. Pretty affordable and worth every penny."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocjZXZFl3EAE",
            "text": "Disappointed at the quality of some of the dishes. It was very heavy and did not meet the expectations I had after reading over the reviews. There are better options in nearby Flushing if you are willing to make the trip. The satay was delicious. The chicken had a lot of bones and the meat was very tough and dry. The roti was a very dense, frozen pancake that was just flash fried, small portion considering the price. The tofu was over cooked and dry as well. The bean curd string beans were decent. The ban mee soup was the best out of everything. The milk tea is overly sweet and should be avoided. The service is quick and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMnB1R0tBEAE",
            "text": "A small no frills restaurant- I was inspired to try this place because an online chef recommended this spot as his go to for a comfort meal.  I tried a few dishes and was pleased with all of them.  I am looking forward sharing future dining experiences with family and friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMDRqT3JBRRAB",
            "text": "It does taste good 🤤\nI’m writing this review when traveling in Turkiye and missing great Asian food in NYC.\n\nI was introduced to this by a Malaysian friend and It was my first time trying Malaysian food so I don’t have anything to compare with but I am a foodie and I know when the food is good. Everything we ordered roti, kangkung & pork rib curry was all tasty. We came at the end of the day where they were about to close so the ppl who work there were just hanging out and it was cool to hear Malaysian language. It feels like you are not nyc anymore. That is when you know the food is legit authentic. Can’t wait to try more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxallyLVF3EAE",
            "text": "Taste Good Malaysian is an amazing small restaurant! Seating is a bit limited and it can feel very crowded, but the food is amazing and the vibe is really cool. The menu is gigantic so it’s very hard to decide what to order. My favorite thing from here is the Dry Curry Beef Rendang Noodles, which features huge chunks of braised beef that falls apart in your mouth and absorbs all the curry perfectly. The roti is another thing that you need to get, it comes with chicken curry. The Sambal Beef is for people who are willing to try more strongly flavored things, the flavor was intense with umami and was a really good flavor. Really cool place, don’t judge the shabby exterior when you come."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcnVpVWRREAE",
            "text": "Great spot if you’re looking for a quick bite while making your rounds in the neighborhood. The food was amazing—the sauces, the chicken, the shrimp, the noodles, all of it. Try the Roti Canai and the Singapore Kari Laksa!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6bE1hbGpBRRAB",
            "text": "I would have given Taste Good five stars, but the food wasn't spicy enough for me—it leaned sweet, even for the spicy dishes. We had roti canai, Curry chicken noodle and chicken satay. Everything was good but too sweet for my taste. I just wish it had more heat. Despite this, the place is popular and attracts people from everywhere."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyanFhaTVnRRAB",
            "text": "I was really excited to try out this Malaysian restaurant in Elmhurst. But, I was so disappointed with the quality control and the quality of food served here. The service was below par. I ordered 3 dishes to be shared with a friend of mine, the Singapore Kari noodles, the Hokkien prawn mee soup and the chicken satay. The Hokkien prawn mee soup arrived and we took a spoonful of the broth (the broth is how one determines if the Hokkien prawn mee is made to the standard of what Malaysians expect) and it tasted funny. It was sour? We told the server that the broth tasted bad and she took it to the chef whom later confirmed that it is bad! The whole pot was then taken to the back of the kitchen. That was a bad start to say the least. Worst of it? We had already consumed a spoonful of it. Not good.\n\nThen the Singapore Kari noodles came and it is the worst Kari mee I have ever tasted. No flavor, not enough coconut milk in the soup and a measly topping of 3 pieces of tofu puffs, a couple of strands of shredded chicken, 3 pieces of fish cakes and 2 shrimps that are not fresh. Abysmal.\n\nHowever, the last dish that arrived made us decide not to come back again. Reason? The chicken satay was not cooked and it was served raw!!! What? Food poisoning came to our minds and we spat it out and didn’t touch the dish ever again. Apart from us flagging down the server to bring to her attention of the ‘sour’ Hokkien prawn mee broth, not one server came and checked on us. We asked for the check and she saw the unfinished dishes and gave me a look. I told her we couldn’t eat it as we are scared of food poisoning at this restaurant. She took a look at my satay and shouted to the preparer that the satay is not cooked according to me. He asked her to bring it him for clarification.\n\nAt this point, the owner (I assume) stepped in and was somewhat concerned about the quality of the food when we explained our dining experience to him. He asked the server to take everything off the check. We politely said just take out the bad Hokkien prawn mee and the satay but will pay for the Singapore Kari mee. We did that to let him know that we are not here for a free meal but to bring to his attention the bad quality of food served and its health consequences.\n\nWe left saying thank you and proceeded to try another restaurant around the area. On our way back we saw the owner talking to a friend in front of the restaurant, we politely nodded and he apologized for the bad food served and told us that our complaints were taken seriously and he has spoken to the chefs. This is commendable but we have consumed rotten and uncooked food. Chicken no less! What a waste of time and money and we will NOT return. The pics shows all the food we didn’t consume. If you are reading this, you have been warned. If there is a zero star allowed, this restaurant will certainly earn it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaG9TaG1BRRAB",
            "text": "Their menu has so many options to choose from, it's a little overwhelming lol. Food is really good overall, and affordable as well. I really like the Singaporean laksa: the tapioca noodles (similar to bánh canh), the broth with coconut milk. The pork chop, kang kung belacan, and the soup are pretty good. The hokkien udang mee needs a bit more salt but is okay. The popiah is meh -- I don't really like the steamed pancake wrap."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaE11NDFRRRAB",
            "text": "Horrible plus terrible+\nThis is the most expensive nasi lemak i ever had, just plain rice with archat and cucumber + eggs. No curry no achoives not even sambal chili charge $14.95 don't believe their menu, price is double, if you ask them they will tell you is a old menu, this is absolute bogus and a horrible choice."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDemVTY3RRRRAB",
            "text": "This place was a real treat. I came here at the request that we go here from my friend from Singapore. He said it was a real taste of home for him. Nice outdoor seating arrangement with friendly staff.\n\nFirst off, and most importantly for me, was the roti cani. It was really good. It could have been a bit more flakey but still had a great taste with a great doughy texture. The curry they paired with it was divine though, a real standout that made me savor every time I dipped the bread into the curry.\n\nThe beef rendang was soooooo good. It was a fantastic rendang and the beef was very tender and delicious on its own. They have a nice portion for the price too.\n\nThe chicken satay also delicious. The chicken was good sized and tasted delicious on its own but the peanut sauce was delicious. It was nice and thick and chunky, helped stay on the chicken while eating and was rich and flavorful.\n\nThe Buddhist yam basket seafood was again, also solid. I didn’t have much of it because I’m not the biggest seafood eater but my friend looked like he was in heaven having it and the yam basket part of it tasted really really good, was fresh and had a strong flavor with good crisp on the outside.\n\nThe outside dining portion was very nice with fake grass on the floor and all sides covered to help keep away strong winds and car exhaust. The service was very friendly and fast. Overall a very very good experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNHZLYkd3EAE",
            "text": "The lamb rendang was fatty and boney, but the beef rendang was amazing. 10/10. I got alot of food and the bill was very cheap. Everything is shareable portions. I highly recommend people to come and try everything on the menu. The lychee juice was surprisingly amazing as well.\nThe roti canai was the best i ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxbjdMcGV3EAE",
            "text": "Very old school style Malaysian restaurant. It's a no frills, hole-in-the-wall restaurant and the food is delicious and very flavorful. They have an extensive menu and the staff are friendly and knowledgeable about the cuisine. The Nasi Lemak was plated beautifully and the curry beef noodles weren't too spicy but full of flavor. Prices are fairly cheap as well but they only accept cash so make sure you have some on hand before dining here. Close by to the Elmhurst Avenue subway station and bus stops."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bGVicUx3EAE",
            "text": "Everything we ordered was fantastic. Absolutely loved the tofu egg sizzler with pork and their laksa was also delicious. The satay assortment was alright. I’d prefer a spicier sauce. This one felt too sweet. They also serve a warm tea with the meal. Would suggest bringing cash. Will visit again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NEs3NFpREAE",
            "text": "I haven’t been there in years since the pandemic started and today was a first time back and happy to say everything remain unchanged. Looks can be deceiving, outside not much of a store front however this mom and pop shop has been a Elmhurst mainstay for many years.\n\nThe cooking is absolutely authentic and that’s all you can ask for from a small restaurant. Yes the prices have gone up like everything else but when the food is this good, One can overlook a small increase. I can’t wait to be back in Elmhurst to try more of my favorite dishes."
        }
    ],
    "reviews_count": 78
}