{
    "name": "Lubavitch Remsen Village",
    "place_id": "ChIJm5UJCF9dwokRJogufVTpE-A",
    "grid": "BK17",
    "address": "305 Remsen Ave, Brooklyn, NY 11212, USA",
    "rating": 5,
    "user_ratings_total": 16,
    "phone_number": "(718) 679-9965",
    "reviews": [
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRazhLQk93EAE",
            "text": "⭐⭐⭐⭐⭐ Lubavitch Remsen Village – A True Home Away from Home!\n\nBaruch Hashem, this shul is a beacon of warmth, achdus, and kedusha in the heart of our community. Whether for davening, farbrengens, or simchas, Lubavitch Remsen Village embodies the true spirit of Chassidus.\n\nThe newly renovated space is bright, inviting, and beautifully arranged, with blue table settings that create a welcoming and festive atmosphere. The decor, complete with colorful balloons, reflects the joy and vibrancy of our kehilla. The spacious layout ensures comfort and inclusivity for all who gather to learn, connect, and grow together.\n\nFrom the uplifting tefillos to the heartwarming camaraderie, every moment here is an opportunity to strengthen our connection to Hashem and each other. May we continue to see the shul thrive and serve as a makom of Torah, tefillah, and simcha for generations to come!\n\n📍 If you're looking for a true Lubavitch experience, this is the place to be!\n\n✨ #KiddushHashem #ChabadCommunity #HomeAwayFromHome ✨"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdU51Sl9nRRAB",
            "text": "What an extraordinary place! I was very fortunate to come here and participate in a farbrengen. It was a most meaningful and enjoyable evening.\n\nSo beautiful to see this warm and welcoming community in their beautiful new center.\n\nA must visit when you are in crown heights."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMnY2TE5REAE",
            "text": "a warm and close-knit Anash community, where every individual is a valued member and everyone feels at home."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzbnVQaVdnEAE",
            "text": "Smooth services."
        }
    ],
    "reviews_count": 4
}