{
    "name": "Lucky Chance",
    "place_id": "ChIJ-c14bpBcwokRE_9XwufIUdg",
    "grid": "BK17",
    "address": "395 Remsen Ave, Brooklyn, NY 11212, USA",
    "rating": 3.2,
    "user_ratings_total": 55,
    "phone_number": "(718) 342-9699",
    "reviews": [
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSeFNWcEVSelJGZERJemVGTlZOV1YxVHkxbllXYxAB",
            "text": "This place is so horrible. They don’t take the time to listen to what you want. They just give you what they want to give you  and rushing to take your tip without even asking if you want to tip them. If I could give zero stars, I would."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJX1E3ZXJ1cjQ3ZFNnEAE",
            "text": "Place sucks.  People live here and can't talk with respect"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMDZMX0dREAE",
            "text": "Always get delivery from this place. Food has never disappointed me\nI’m assuming all of these reviews were from the last owners not these new ones"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbnYyWUhnEAE",
            "text": "Awful I found  hair in my food and they refuse to bring my money back after I tipped them"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURILWJIYVh3EAE",
            "text": "Never again wrose tasting food I had"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdHI2ekNnEAE",
            "text": "Horrible and dirty❗️. They package the food without showing me. Ordered soft sweet plantain but got hard plantain that looked like sweet soft plantain  and got diarrhea. The rest of the food was HORRIBLE ❗️ MY first and last time buying food there❗️\n😡"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOExUandnRRAB",
            "text": "I used to like ordering from here, but they aren’t using the apps anymore and the delivery person was so rude. He didn’t observe the contactless delivery request and kept yelling that he didn’t get a tip (which you can update in the Seamless app after delivery). Not ordering from here again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocHNPc0RBEAE",
            "text": "I had a taste for some great chicken wings from a Chinese restaurant and they didn’t disappoint! The wings were fresh and the pork fried rice was delicious. Definetly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCN2NuZi1RRRAB",
            "text": "The food is good but the inside can use an update."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHaDZtU0hBEAE",
            "text": "Boneless Spare Ribs are Okay."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbElUSTJRRRAB",
            "text": "Don’t waste your time. Who’s ever answering is a complete ahole"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlazVyY3pBRRAB",
            "text": "Great Chinese Food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdzZpd0JBEAE",
            "text": "Tasty Chineses food I luv the fry chicken wings 😋"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPX05XZDhnRRAB",
            "text": "I bought $40 worth of food and it was horrible. Everything was horrible.  I told them the food was horrible and they told me sorry.   I will not be  buying from them again. Such a waste of money."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMWJDQ2RnEAE",
            "text": "Lunch special is not the same price as their menu. Avoid this place at no cost to you. 7.25 on their menu actual price is 9.50. No soda no egg roll no soup. Not worth it. How is this a lunch special"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyc2EyZVVnEAE",
            "text": "Horrible, Not only was my food not delivered but the lady is extremely disrespectful and even hung up on me and hasn’t answered her phone and let’s it ring on voicemail. DO NOT ORDER HERE zero respect for customers and a miracle the store is still open on Grubhub"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycDVXUF9BRRAB",
            "text": "Terrible Terrible service Don’t eat from here"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMU4tMmJnEAE",
            "text": "They have very good chiken wings 👍…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNUxUWmt3RRAB",
            "text": "They lady has a nasty attitude she needs to stay home she charges extra for bbq sauce and scallions 25cents fine but charging 75cents for condiments is absurd. The wings are really good  they taste similar to Snyder ave Soy wings but that lady attitude was so bad i was debating protesting to shut that thing down"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXaDhTYTVRRRAB",
            "text": "Food is OK for a take out and it's not far from home"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMWZTTk5BEAE",
            "text": "Great tasting and fast delivery  Need to fix up their store front. Looks filthy and always freezing inside."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbUx5dlBnEAE",
            "text": "EXTREMELY DISRESPECTFUL! They need to go! I’m not begging for the food, I’m a paying customer that does not appreciate my food tossed at me. I refuse to tip toe around a restaurant because I’m fearful my food will be tampered with. When you order they’re yelling and hurrying you off the phone. When they’re busy and put you on hold best believe they expect you to still be there. They’ll hang up if you’re taking too long to order—- literal seconds, and I guess they know the phone number so they give you a hard time every time you order after that. It’s so annoying that Asian people get away with their rude and disrespectful behaviour and everyone sits back and take it. I refuse! I spent months finding a nail and feet technician because I will not be disrespectful by them in their salons. I’ll just drive to shop rite if I feel for Chinese food. I hope your business close expeditiously."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbVB6RFRREAE",
            "text": "These people are so rude and money hungry. I'll rather eat from the deli next door."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtemVMMGpnRRAB",
            "text": "Horrible food. Gives you food poisoning. And the lady put rat in my food. I kept asking why, and she said it taste like chicken. I reported them to the food department. Don’t waste your time and money. You will end up eating What you aren’t aware of and Get sick"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2a3R1ZGhBRRAB",
            "text": "Good food. Good price. They deliver quickly. Best in this neighborhood!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2OUludENnEAE",
            "text": "We ordered from them 1.5hours before they closed. We called to follow up and they said the food was on the way. It never came. Terrible service.  Zero stars."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhNDhmUFRBEAE",
            "text": "The food is excellent! Tasty and always fresh."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLd3ZpVXRRRRAB",
            "text": "I've eaten here maybe 5 or 6 times. I always really enjoyed the food.... until I got food poisoning."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5a096MFlnEAE",
            "text": "Good food and service, however, they won't be negotiate on food prices. I do enjoy repeat service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5b1BpQjd3RRAB",
            "text": "They have good flavor and good services. Great food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5Z05mblpnEAE",
            "text": "Food was good until I found a piece of small wood in it. So disappointed!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTM2UzMGlnRRAB",
            "text": "Lucky Chance is a small place very good food"
        }
    ],
    "reviews_count": 32
}