{
    "name": "El Shaddai Eatery",
    "place_id": "ChIJTV8siSFdwokRKeOzXUy7V1w",
    "grid": "BK17",
    "address": "1010 Clarkson Ave, Brooklyn, NY 11212, USA",
    "rating": 4.6,
    "user_ratings_total": 33,
    "phone_number": "(929) 210-9275",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GU2JqVmFWbWxqUmtWWFVHMWlWWEpTZG13MWRGRRAB",
            "text": "I would highly recommend this restaurant the food is amazing one of the best Jamaican restaurants in the world and it’s clean the staff is so nice and gentle"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3c2RlVWdnRRAB",
            "text": "Not really one for reviews but I had to this time. I have been in NY since January visiting and spending time with my family. I have tried several Caribbean/jamaican cuisines while am here and I also grew up in Brooklyn and was born in Trinidad. Just run to this place! The customer service was great and the oxtail and rice & peas was outstanding!! My only disappointment was finding this place as I was leaving NY so now I have to wait a few months before o can go back! 100% satisfied!! Oh last but not least the portion size was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkazY3MDB3RRAB",
            "text": "First off El shaddai eatry is a really clean place to dine in and take out, the costumer service was amazing, Oxtail was nice and soft and bursting with flavor the meat fell off the bone, the rice was the perfect texture nice and soft, and the cabbage was really good perfectly steemed. It was worth the money you should try the oxtail dinner at El shaddai eatery. The cheesecake dessert I ordered was amazing the cheesecake was so moist and soft if you want to order dessert, I 100% recommend this place the food was well anointed GOD bless this chef. The table was well set and I ate at the best restaurant on in tri-state."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdjdyaWlBRRAB",
            "text": "Before I went here I look up a few restaurants in the area and this one stood out more to me, hearing everyone experience and how great the food was, I figured I stop in my self and let me just say when I first walk in the energy I received from the lady was amazing.!🙌🏽😁😁   The price for the food you can’t beat that too I will be going back again thank you soo much 🥰🥰🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMGRpZWRnEAE",
            "text": "The food was delicious 😋 customer service was very pleasant"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNzRlcFFREAE",
            "text": "The food was yummy. The service was polite and catering. And they had ackee and salt fish still available at 11:30am. I wish I found them last week because today is the last day of my trip"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNXFfVjNBRRAB",
            "text": "By farrrrrr The only place left with Great tasting food. I ordered the medium oxtail for 18 dollars it was soooooooo worth it!!!!!! It’s soft falll of the bone and they are not cheap with the oxtails…if you ever in Brooklyn Must eat at this Wonderful restaurant(sb the pic is me just stopping mid way to write this review)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNlktT2F3EAE",
            "text": "Great food and friendly staff"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyek4zc19nRRAB",
            "text": "Food was tasty and place was clean"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXNHU2TlFBEAE",
            "text": "Great Homminy Corn porridge and stew peas!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNV92OFBnEAE",
            "text": "I had a horrible experience twice. I’ve ordered the fried chicken dinner and it was cold. I went back regardless of the first experience so I decided to order their soup the small soup was $5.50 and inside of the soup was two chicken bones…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbU5ILW5RRRAB",
            "text": "If you ever want to make sure you are eating from a very clean environment, @ El shaddai eatry is the place to be. Friendly staff,great environment and GREAT FOOD!! I'm addicted to their cowfoot/ Goat head soup. The sweet Chilli chicken is…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdzVtejRRRRAB",
            "text": "Excellent food, great service. I had the jerk pork meal with rice&peas and was sooooo good. The rice&peas was outstanding and the pork was seasoned to perfection."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdzVUTW1BRRAB",
            "text": "Great food , great hospitality"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxZzREUVJREAE",
            "text": "First I must say God bless each and every one of you that work at El Shaddai Eatery. Thank God for you all; now the food!!! Can I talk the truth?? It’s the real Jamaican cooking. The liver just melt in your mouth the kidney the same the…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxZzRtNS1RRRAB",
            "text": "Great people making great food. Fast and friendly with amazing tasting dishes. There's always something good cooking. Would recommend to friends."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxZ19DT3RRRRAB",
            "text": "Best Jamaican food i have in a long time. Professional packaging. Food isn't just thrown in the container."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxX1pfbG5BRRAB",
            "text": "Best place on earth 🌎 for dining events launch and dinner foods full of flavor rich and a beautiful setting i would recommend El Shaddai Eatery all day everyday...come taste and see !!…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxX2V2Yld3EAE",
            "text": "The food taste good customer service is superb I recommend  EL shaddai Eatery food is a must have when your in the Brooklyn area and they do Uber eats too 🙌🙌🙌🙌🙌🙌🙌 so if your in queens they got you…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxX1lQSGJnEAE",
            "text": "Authentic food you never regret stopping by staff very welcoming"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxX2RIU0hREAE",
            "text": "The food at El Shaddai Eatery is AMAZING. The staff is great. The prices are very reasonable. A great place to to buy your authentic Jamaican meals."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxX2NIZ1VBEAE",
            "text": "Absolutely a wonderful experience! An ideal location to find traditional and authentic Jamaican cuisines🇯🇲🇯🇲.. backed by their selection of local (American )dishes!…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxX2ZMRU13EAE",
            "text": "The cook is bless and great, the food is great the place is great it just pure blessings. El Shaddai Eatery place nice..."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxX2VLd3ZnRRAB",
            "text": "Sanctified food, great customer service, and friendly atmosphere."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxM29iUDF3RRAB",
            "text": "The Staff of El Shaddai Eatery are courteous and friendly. The portions are quite plenteous for the affordable price. Very happy to support a holy and black-owned business. The very best place to eat and dine."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbjhUWDB3RRAB",
            "text": "I want to support but the portions shared by the dark skin lady in particular are unacceptable!  Half a spoon of ackee for 10 dollars is not okay."
        }
    ],
    "reviews_count": 26
}