{
    "name": "Woodzzy Bar & Restaurant",
    "place_id": "ChIJ2duKoDldwokRohdv9rtecYc",
    "grid": "BK17",
    "address": "1133 Clarkson Ave, Brooklyn, NY 11212, USA",
    "rating": 4.4,
    "user_ratings_total": 76,
    "phone_number": "(718) 552-2687",
    "reviews": [
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvZ3ZHX21nRRAB",
            "text": "Was a great place! The karaoke was amazing 👏   small and cozy"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRc0tEV2xBRRAB",
            "text": "Such a nice hidden gem! Great bartenders who know what they are doing. Friendly and capable. Excellent drinks menu. Beautiful space, bathrooms are clean and modern. Fridays are karaoke nights. Lots of fun."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdy12c1dBEAE",
            "text": "Very good place but the music was a bit too loud they need to bring it down a bit specialy before 11"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNzl1bGt3RRAB",
            "text": "Good experience in a special place 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNW9PQWpRRRAB",
            "text": "Update you damn times!!!!!! If you say you’re open then be freaking open!!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiZ3R2TmNREAE",
            "text": "Just decided to go here for a date night. Google said they were open but they are closed when we arrived."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycXRmUlZnEAE",
            "text": "Sport bar , many TVs but will not even try find fox sport for customers watch a game in a dead Friday night?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUc1BpQzhRRRAB",
            "text": "Good Friday night hang with friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaEppcjJnRRAB",
            "text": "I absolutely love this place on a Friday night! Karaoke be litty! Vibes 100% highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5NWNIS2NREAE",
            "text": "Great spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1dkttMDdRRRAB",
            "text": "My first and second experience went well! The first time was karaoke on Monday, which I enjoyed. The second time was for drinks only for about an hour on a Wednesday, which the barmaid was very courteous."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwa0l6QnJRRRAB",
            "text": "Friday nights is the best"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeE1IUlFnEAE",
            "text": "i literally ordered the food in the place and took it out and they still managed to spill it all over the bag but that’s not the bad part chicken tasted cheap and like rubber for $18 that’s a rip off, you’re using the cheapest store bought pasta and chicken and charging $20 with tax we’re in ocean hill and you’re not good enough to be charging that only thing rasta about this was the colours thanks for the one chicken breast to three plates of pasta ratio that spilt everywhere only giving two stars because it was still an edible meal"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NHBldWZREAE",
            "text": "Just went for drinks and Karaoke very entertaining I had a great time"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeW9DVE53EAE",
            "text": "Wings was on the money"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoanBYUUpREAE",
            "text": "Nice place! Definitely coming back. Staff is very pleasant 🙌🏽"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMTliZnhBRRAB",
            "text": "Food great, ambience good, service on par. Parking will always be an issue."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMHFPcndnRRAB",
            "text": "A chill spot to get some great food, drinks and some great music"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMXZpQ0JBEAE",
            "text": "A friend took me there for the first time and just looking from the outside, it didn't looked appealing. When I got in the space was cozy and the food was beyond my expectations. I have revisited them several times even though the drive is about 25 minutes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeHFhWTVBRRAB",
            "text": "nice place for karaoke, lunch & drinks, it's like a sports bar in a lounge_ish type atmosphere_someone asked me if it was a gay bar , everyone looked happy so i guess yeah because gay means merry or happy"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtem9LYjNRRRAB",
            "text": "Just for the mature audience i love it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtejltNVZREAE",
            "text": "Everything was amazing. From the food to the atmosphere. Love it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldi16YldnEAE",
            "text": "My first time here. Music was 👍,  waitress that served our table was very polite and friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlby1uQWpnRRAB",
            "text": "My dining experience was such a pleasant surprise. I went in expecting loud music, typical bar food and ok service but BOY WAS I PLEASANTLY SURPRISED!! Woodzzy Bar  was spacious, tastefully decorated, music was kept at a  conversational volume. It was wonderful not to have to scream to be heard. People were laid back. Servers were on top it everything. Service with a smile and very attentive. Generous portions were served. We didn't feel rushed. We were able to kick back, enjoy the meal and music. I was there on a Friday night. After 11pm the music was raised, dance floor opened and karaoke began. It was a really fun night. Only downside, for me, was that the drinks were very weak. I am not a big drinker and normally nurse my one drink most of the night. The drinks have very little alcohol. We could barely taste the alcohol in the drink. My friend had to request an a chaser to supplement. Although I drank it in the first hour sitting at dinner, I never got a buzz. I highly recommend this place for a nice girls night or date night location."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURld2ZEUlR3EAE",
            "text": "Great place .. great food...great staff....definitely keep coming back on special occasions #okaii"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlb2ZTTTdRRRAB",
            "text": "Caribbean vibe live music"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlb3YzbU13EAE",
            "text": "Omgggggg !!!! The food was so good …. The skirt steak meal and sandwich is my favorite…. Steak cooked perfectly to my liking ….THAT SAUCE OH MY SOOOO YUMMY …. The painkiller drink and the guava a must have"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aDZPWWVBEAE",
            "text": "A brother recommended this place to me a few months ago so I passed through by woodzy today. I must say that it exceeded my expectation...the ambience,decor, everything about this place is great!  The food was on point too! I will definitely be back! 💯…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dnRUV2d3RRAB",
            "text": "Amazing experience, amazing people, and most of all amazing food, very tasty!! Clean environment. I’m very impressed!  Brittany took care of us, made sure everything was on point! The owner is also an amazing guy, this is truly a hidden gem!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1akwzbnF3RRAB",
            "text": "The staff were professional, polite and friendly. The food came out in a timely fashion. The food was great and so were the drinks. I'll be back for sure."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cmR6MDFBRRAB",
            "text": "I love this place to bad, it is what was needed for this area, A community base where all can get together feel nice and full joy themselves, the food was excellent & yes it may have took long to reach my table but when it reaches you will forget how long it took to arrive ( very delicious )"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NmF1QW9nRRAB",
            "text": "Nice spot in the 90s. Establishment was clean as well as the bathroom. I went on a Friday night around 9 and it was pretty empty. It did pick up some by time I left. My friend and I was able to sit down and talk up on till the DJ started playing music. The music to me was a bit loud. We literally had to shout to each other to have a conversation. Even when the waitress came over she had to lean in to talk to us. Our waitress, Karlene, was pretty attentive and offered us recommendations all night. She checked in with us after we received each round of drinks to make sure everything was to our liking and if not, she attempted to fix it. Same goes for the food, she checked in to make sure everything was good regularly. Overall she was a great waitress and would recommend anyone going to ask for her. On to the food. All items on the menu are priced under $20 which is great. Each food item did take a while to come out but I guess that means they make the food per order so just be mindful of this if your really hungry. The guacamole and plantain chips were good but the plantain was fried a bit too hard. The fish was good (needed some more seasoning) and you get a whole fish along with two sides of your choosing. I was able to take some home for the next day. The apple pie was nice and warm and came with a scoop of ice cream. The crust was a teeny bit burnt towards the end which gave it that  bitter taste. But nothing major, I was able to cut around it with my spoon. The drinks were good. I would recommend the Vincy sunset punch. Not on the strong side but taste good. The rum punch definitely had a kick to it so if you want something strong, go with that. Overall I would recommend this location. People might be scared to try here because it’s in the “hood” but I forgot to mention, security is present outside. And I’ve seen them there every time I pass by once they are open. The people working there are nice, food is good, drinks are fine, prices are reasonable…I see no reason why anyone shouldn’t check this location out and give them a try."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aHBiaDBBRRAB",
            "text": "Honey/mustard chicken wings was a big hit. Shrimp was cooked to right consistency with a little less salt would've been perfection 👍🏾…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1b3Z2ZEV3EAE",
            "text": "Beautiful interior and very clean. But the staff needs more training on service.  Had a 5pm celebration and only the bartender was there setting up his night.(waiter came 20 mins after)\nThe waitress seemed more intrested in what was going on with her phone in the corner at the front of the restaurant than checking to see if we needed anything else. We had to signal the bartender to get her attention everytime we needed her.\n\nFood was realllyyyy goooddddddd!!!\n\nSERVICE SUCKED!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPcjV2ZEdBEAE",
            "text": "Great job 👍👍👍👍…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPN2NYdTFBRRAB",
            "text": "10 out of 10!!!  Great food & music Woodzzy is a vibe!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbGNQZGR3EAE",
            "text": "The workers have great customer service but the food took too long to come and then my Rasta pasta was sweet( did not like that at all ) owner did give me my money back for that meal though. The drinks are not strong at all so order a…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbFlqUHZ3RRAB",
            "text": "Service was good food was amazing. Definitely recommend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeGE3NC1nRRAB",
            "text": "Woodyzzy Restaurant and Bar is the place to be with friends and family. The atmosphere is cozy and the food is extraordinary not to mention the excellent 👌 service the staff provides. If you're looking for a good place to dine, this is the best place in Brooklyn to do so.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaGZ2TzZBRRAB",
            "text": "Woodzzy Bar & Restaurant is the place to be the ambiance is spectacular and the staff are very professional , the food is great and a lot of entertainment I would recommend this place to anyone who is looking to have a great time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaGFId1R3EAE",
            "text": "The food is great, love the vibes, mixed drinks are ok, the music is good but the waitress got to go. overall its a good chill spot to get some drinks, eat some food and vibes out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaFliaUdREAE",
            "text": "The food and Service is amazing… had a great time with my family and friends"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPc2FLaDBRRRAB",
            "text": "Don't bother going over there. They treat their employees bad. They even treat the customers worse. The boss whines like a bitch all the time. I was fired for no reason because they're prejudiced. Don't waste your time over there."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyemNmLWNBEAE",
            "text": "The food is bad and the service sucks they play favorites and they lied on their own employees pure racism and this be the first people to play victim when it’s done to them"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPb2NMemJREAE",
            "text": "Great bar and restaurant was very please with the food it was delicious and top quality service. The ambience was surprisingly great once you got in very friendly staff."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPNkw2dUVREAE",
            "text": "The place here is amazing. The people are great, and the food is amazing. I had to come back the next day for dinner."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPa3ZpRjZ3RRAB",
            "text": "I highly recommend trying the Jerk Chicken Rasta Pasta! Great spot to just chill and vibe with friends. There was also a DJ playing lit music when I went on Saturday night."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMk1lN0hnEAE",
            "text": "Has a very good atmosphere and good food. I ordered Rasta pasta and the red snapper so flavorful, I also had the tres leche cake for dessert, I loved it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMlBtTmlnRRAB",
            "text": "I visited this place for dinner with some co workers and I must say this place was top notch! Everything from the music to the food was on point. I recommend trying the Rasta pasta and plantains. The bar was also very nice and they had a…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaU5QdXRRRRAB",
            "text": "Went to woodz for dinner the food was to die for. I just love the atmosphere will be going back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPd05PamtnRRAB",
            "text": "I had the opportunity to go to dinner at Woodzzy Bar & Restaurant with my family and honestly I loved the food, delicious , the service very good, the place very nice, clean and cozy."
        }
    ],
    "reviews_count": 51
}