{
    "name": "Tasty Delicious Bakery & Restaurant",
    "place_id": "ChIJRerpGpRcwokR_xSvOilVweM",
    "grid": "BK17",
    "address": "9001 Avenue A, Brooklyn, NY 11236, USA",
    "rating": 4,
    "user_ratings_total": 375,
    "phone_number": "(718) 676-0144",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRlMwZEtSVWRGY2trNFdXUnRVRUZDT1ZRdFRsRRAB",
            "text": "Food so good and fresh and very friendly host and hostess"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcVFVcDBRamgzTW1wSGRXODBWekIzZG5reE1uYxAB",
            "text": "The food was absolutely delicious I had fried chicken wigs “flats only” there was some kind of sweet sauce sprinkled on top of the chicken wings with rice and peas, curry goat gravy on the rice with Cole slaw and their pound cake."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVE5uTkVRVVJ6VnpWMGJERnhPRWQwTlZka2JuYxAB",
            "text": "Food is good sometimes. Customer service needs to be appealing. Apart from the cashier, the server as grumpy unfriendly and harsh when they speak. Politeness don’t cost a warm smile don’t cost . You need a customer service training class for your staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNVluUnJYek5ST1ZSUlVtNVFPVFkzTVZCT1QyYxAB",
            "text": "The stew peas sell off! Never miss!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNGFtUTNWRWhOZUZOV2JUZDNNa05WWkhwZmMzYxAB",
            "text": "Yes they take cards service is good food is good have different options, for vegans and non rice eaters. Not too many restaurants make bulgar but they do. They have fish dishes as well as different sweet options."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4QlRsQTNWRGR3YVdkQlVrRm1iMXBDVjNsVE9XYxAB",
            "text": "Stopped in on Friday saw cow skin had to have ordered a medium with white rice so disappointed literally had 3 piece of skin in it that portion did not fit what I ordered"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUk5tSmxUMmwwVTFsblNEUk1OMDVST1VKbU1rRRAB",
            "text": "The food is always delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORE4wTmxiM1ZpT0dFeFFWTXpXV2hFYkZWWFVtYxAB",
            "text": "Horrible customer service! Workers look like they don’t want you in the restaurant. Definitely not welcoming."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQaVR2ZG1kNE5QXzNRRRAB",
            "text": "good food all the time but they always run out of breakfast super early! if you catch them early, you can have Jamaican classics like liver, mackerel rundown and dumpling! one star taken away because they always run out of dumpling. 🤍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJYUY0ZDcwNU1HbTlRRRAB",
            "text": "Bad employees are creating bad vibes on Ave D... we need the friendly staff atmosphere back. I'm scared to come get my pastries cause bad attitude is causing bad vibes ... you don't need that in your business... especially in this recession times... clear out the bad energy and I'll start coming back! Very bad energy in the front in the mornings on Ave D..."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNN2txdTZ2cDdEeGh3RRAB",
            "text": "Haitian food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvanZfUXlBRRAB",
            "text": "Best food ever! Been a customer for 15 yrs. But as we passed this location before our return back home in Jersey this location was closed. Does anyone know what happened?"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbDhpYjBBRRAB",
            "text": "Please use gloves when serving"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJanFpUGRBEAE",
            "text": "Good good price good healthy eating on the go"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcFkySW1RRRAB",
            "text": "It's a great food spot... for a quick grab and go. I wish they did have a seating area bigger so it can hold customers"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRX0lDX3JRRRAB",
            "text": "The overall experience was good. You will encounter some pricey meals. Most of the staff or nice"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncjhPLUJ3EAE",
            "text": "The daily soups are fresh and delicious."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSMF9DampnRRAB",
            "text": "Food here is good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bUt5Z1pREAE",
            "text": "My friend usually buys breakfast from here and it’s ok for the most part. Today he bought breakfast (curry chicken with yam and dumpling) Me and my daughter ate from it two different times and the food taste like cleaning products (and no, I don’t know what cleaning products taste like) but it taste like bleach.  Either they were cleaning with bleach and pinesol while cooking or some drop inna the food but it really taste like cleaning products in there and my daughter said it to herself and when I said it she literally agreed and said “ma I said the same thing but I thought I was bugging”  yall need to figure this out"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaHF5MTN3RRAB",
            "text": "My food was good 😊…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcUl5V2J3EAE",
            "text": "Their mackerel breakfast is satisfying.\nThe Curry Chicken with Rice n’ Peas has the right amount of Scotch Bonnet pepper to please me."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMEtLeDBnRRAB",
            "text": "Born and raised in Brooklyn, NY, I've never been here until this weekend. Nice, full selection of common Jamaican dishes such as Ackee & Saltfish, Fried Dumplings, Cornmeal/Oatmeal Porridge, Callaloo, Cabbage & Peas, Macaroni Pie, etc. The name is definitely warranted. Check em out!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzLTYzY3dBRRAB",
            "text": "I am super late on writing this review as I've been purchasing food from Tasty for more than a decade.\n\nIt is hands down one of my favorite Caribbean restaurants in Brooklyn! Def top 3. Food has been consistent in flavor, and there's ALWAYS a variety of options for meat-eaters and vegetarians alike. They are also consistent across all of the locations. They rarely ever miss. It's genuinely my go to spot when I don't want to cook.\n\nThe bakery is amazing too. They know how to bake a cake and a patty!! The breads are nice a fluffy. Will you get little bit of attitude every now and again from an employee, possibly yes, and are they sometime slow, yes, but that happens everywhere and I personally don't take it to heart or fret."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuZ19hTHZRRRAB",
            "text": "It very good bakery"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINk5qd3F3RRAB",
            "text": "Food was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cnNEOXNRRRAB",
            "text": "Really delicious, hot and fresh food. I especially like their fried chicken with the sauce on it Yummy. Their slaw is good too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dC1mS0dBEAE",
            "text": "Some of the Best Jamaican food in Brooklyn"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bDUyOTZnRRAB",
            "text": "I got the curry goat, it was so good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieEtELU5BEAE",
            "text": "Maybe one of the best customer service I’ve received in a while 👏🏾. Warm and friendly staff as well as excellent food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNTQzY1d3EAE",
            "text": "Very clean. All of the food was fresh. I got the fried fish with peppers, some veg and fried shrimp. The food was amazingly fresh and sooooo delish!! Will come again.\n\nService was not the best though! They should try to be different and actually be nice!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNmZYWFZREAE",
            "text": "For a place that has to food hot to serve you always are in there longer than you need to be and everyone’s attitude is horrible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqekl6WnNBRRAB",
            "text": "I'm from queens but happened to be in the neighborhood when i stopped in to purchase a breakfast. After ordering and making my way to the cashier i noticed the decor of signs posted along the way. One in particular caught my eyes.... (IF YOU WANT OXTAIL GRAVY OUTSIDE OF AN OXTAIL MEAL, IT'S GOING TO BE $2.00 extra.....) I was like WHHHAAATTTTTT!!!! GRAVY, SAUCE , COLOR WATER..... I asked the girl u guys really charging ppl a whole $2 for gravy. I think this is so DISTASTEFUL for the simple fact that my family owned caribbean restaurants and if gravy was an issue the chef should know to always provide extra for the few customers requesting such with their already taxed and expensive meals. MANAGEMENT DO BETTER.... NOT COOL."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNk0tZDVnRRAB",
            "text": "Nice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMExqTUZnEAE",
            "text": "Terrible customer service. Prices always  change"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0b3Nfdl9BRRAB",
            "text": "Worst jerk chicken ever and they now charge $2.00 for oxtail gravy. Used to love this spot when I moved to the neighborhood. Now?! Never again. The jerk chicken had no jerk taste! Barely seasoned. We’re in a Caribbean neighborhood! Do better! And who the hell charges for oxtail gravy?!!!!!! Do yourself a favor and go somewhere else folk."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROc3ZQRWV3EAE",
            "text": "A regular for years. Delicious Jamaican food like the title says. Patties are at their bakery location 2 blocks away."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOM3BIanh3RRAB",
            "text": "Staff operations makes it to long to get take out food.  Average time 20 to 30 min . Need better management in repressing prepared already  take out food . Gotta be faster."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcXNpN3NnRRAB",
            "text": "I was there a few days ago, I go often for my fish however this evening that I went I witnessed something that shook my heart. The Big lady behind the counter sharing food called a customer by his name to share his food which is a good thing he might visit there often. The horrible part is when he got to the front to pay for his food he seem to have only one credit card on him at the Tim which they just stopped taking, so the customer expressed to them that he had payed with the card all week”do you know the denied that man his food and went on to the next person”. I was hurt and shocked they took the plate of food and put it to the side for $8.00  I was at a loss for words, I just did not order that day and walked out.\n\nIt was a horrible thing to see in person the man was shocked!!\n\nNo customer appreciation at all…."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeEpTSjBRRRAB",
            "text": "I didn’t want to give this restaurant no stars anyone on here saying the food is good that’s a lie food 🤮 customer service horrible I believe they are family because there is no structure in this place u can’t get your food how u want it they don’t take any form of card.. very inconvenient then they have the nerve to be expensive… I will eat the bottom of my shoe before I give this nasty place my money"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2OF9LQS1nRRAB",
            "text": "They have bad customer service. In addition, their foods are expensive. I bought food for more than $70 including ice scream. They don't even put the Ice scream on a  plastic bag for me, they put it on paper bag."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dmJlTjR3RRAB",
            "text": "Very good food. That’s what I am giving five stars for BUT there is a inconsistency in serving. Some days they are skimpy with gravy and oxtails and other days you get someone who gives you an adequate serving."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhZ19DNDRBRRAB",
            "text": "Service is horrible . They don't offer any alternative to their oxtail.  And i offered to pay extra.  Extra. .. they only give 6 peices of their choice oxtail. I am so sorry but the fact that you didn't give me an option to add more at a cost is unreasonable. I will not be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdklPcEhnEAE",
            "text": "My favorite place to get fresh, tasty Jamaican food. The staff are well coordinated and provide great service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZ09MTl9nRRAB",
            "text": "First of all this place as been open for a few years now AND THEY NEVER I MEAN NEVER HAVE PLANTAINS NOR CABBAGE!!! Salad ONLY!!! On top of that they charged me $20 for a medium (not large) MEDIUM pepper steak with rice and pease. I could have went to Fisherman’s Cove and got a Large Stew Chicken for $15!!!  Last but not least cause this is really crazy… THEY DON’T GIVE PLASTIC BAGS FOR YOUR FOOD!!! You have to carry it out in a brown paper bag.. for $20!!! On top of that the food is very inconsistent one day it’s good next day it’s terrible.. for $20? NEVER AGAIN!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlZy1IdVF3EAE",
            "text": "The Patties are crazy good!!  The service was a mixed bag. One server was cool and helpful yet typically slow.  The other asked me if I wanted a plastic bag for $ 0.10.  I said nope.  Can  you put the patties in a bigger paper bag? She says you guessed it... $0.10!!   And with an attitude!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCOHRYVVZnEAE",
            "text": "Great food,but could use more servers behind the counter. Usually only 2 ,one on food and the other cashing and bagging. With the large clientele the wait is unnecessarily long and the servers are working as fast as possible. Recommend management use more counter people as l have seen many patrons leaving because of the line."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaHNmdlRnEAE",
            "text": "First, we are human,  it’s a restaurant everyone should be friendly Customer service, food should cook with love food should serve with love. The meat tough no flavor, if I could give  zero I would give zero stars. I will not recommend this for my Siberian husky.👎🤮"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdHJqRmNBEAE",
            "text": "I went to this restaurant yesterday and originally walked in for Curry goat. Since that was sold out I instead got the medium oxtail $18 with rice and peas. It was disgusting, must’ve been a bad day based off the rest of these reviews claiming it’s perfect. But a lot of people don’t have taste or even tastebuds..so who am I to judge. IDC it must’ve been American born Jamaican cause they can’t cook oxtail….."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjZ3BLWVZnEAE",
            "text": "Greetings, I know this review comes at a random point in time but I went recently because I felt like I wanted  to support more black owned business and the attitude that I received in the early morning makes me wonder why we as a people just can’t value each other. Don’t get me wrong the food is great, but It wasn’t what I really wanted to eat as a customer. In world today, black and brown folks deal with so much psychologically and the to go into a store to be spoken about under your breathe is just ugh. If you don’t want to deal with people work somewhere else. Please understand that customer service is very important now especially with everything going on. Black business owners treat your black customers with more love and respect. We put with so much let’s not add to it by being ignorant Thank you."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjeExUbjVRRRAB",
            "text": "I went here with the intentions to order curry goat roti but there was none available. My partner ordered the medium oxtail plate with rice And peas and Cole slaw and so I decided to order the same to not waste time. I thought my plate would not be as exciting because I had a craving for something else but when I tell you that tasty delicious completely obliterated that thought for me is an understatement. For a long time, I have never had a meal where everything on my plate was on point. The oxtails were huge, the rice and peas well seasoned and the Cole slaw was fresh with a hint of sweet. We also had a side of fried fish that was very good! Thank you Tasty Delicious for turning a basic meal like oxtails and rice and peas into a memorable one. I will most definitely be back for more."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoaFppenh3RRAB",
            "text": "The food is good, but the only problem is you don't get what you pay for. Very pricey for the little bit of food you get, especially breakfast time. Sometimes the workers stop other workers because they say they're sharing the food wrong and the boss will get mad. I brought a lot of people here and they ALL complained about the same thing. Share bigger portions, if you're going to charge bigger prices."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPd2QyMHFRRRAB",
            "text": "I would have given this restaurant a 5 if they had better Customer Service. The food is tasty and well prepared and the location is clean. There is one particular lady who may be the owner or has shares there that I have experienced her rude behavior more than once. The first time I gave her the benefit of the doubt  and said her day was not going well. My sister had just come up from Florida and I wanted to introduce her to that food location that I discovered a few months ago. As a matter of fact she wanted to go to Dougies. Then I went there again and was unfortunate to be served by this grumpy, rude woman, who lacks the ability to service customer in a manner that will have them return. Today I encountered the same woman again with her undesired behavior working in the front and serving food. Someone states in a review that you have to be a customer there to get good customer Service but anyone who walks in your place of business whether for the first time or several times should be treated with respect. I know I was not disrespectful to her or anyone there. Not sure if I would ever go back there because Great Customer Service  is of very high importance to me. People like dat must run business from de back!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDenJfVkt3EAE",
            "text": "I ordered the oxtail and black fruit cake. It was tasty and delicious. However the customer service is  poor. Some of the servers appear bothered when you're placing an order. On another occasion I was completely ignored until a more tactful employee approached me"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXXzR6cjFnRRAB",
            "text": "I ordered shrimp pasta and got 3 measly shrimp and a shell...buyers beware. You can't charge such a high price and then skimp on the shrimp! Seriously? They fail to realize that a seafood restaurant is right next door, which I'll be visiting instead."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaWRUNDBRRRAB",
            "text": "Have you ever tried their cornmeal and oats porridge, you need to visit. There is no MSG in their food which is a plus for me. They have the best white yams on the planet and I lov eit with with orkas and saltfish or ackee and saltfish. If you dont eat much, like me you can have a small breakfast split into lunch. :-) They have a great selection of food."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDLVAyYzl3RRAB",
            "text": "The food taste good but my only problems were that the dumplings are way to big like it makes no sense and the Ackee and salt fish is too oily. I like the food but the oil makes me nauseous. Drain the oil off the food and it will be better in my opinion."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnZ0w3ejR3RRAB",
            "text": "I've grown up in this area for over a decade. One of my favorite restaurants in the area. Their oxtail is delicious, no pun intended - their bake and saltfish with porridge is my morning usual. You can smell the awesomeness from down the block, so good. So good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NnF1UlF3EAE",
            "text": "I'm partial to Jamaican breakfast. And since moving to Brooklyn i finally found a very good spot to get my favorite Jamaican breakfast. Disclaimer I'm Puerto Rican.. lol\nBut the akee and salt fish with green banana and yam. My personal favorite and i highly recommend it is an awesome dish. Very flavorful. I'll get 2 friters if my very hungry. Very tasty and well made also.\nIf you want to try something new and you've never had a Jamaican breakfast walk in and try my favorite. Especially if you like salt fish (bacalao) a great start to the day. The employees are very nice and hospitable also. Do arrive early before 10 am to get the full selection many dishes go before noon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoc3NLNFVREAE",
            "text": "I went to inquire about catering for a few business events, and the woman I talked to was so rude, standoffish, and unprofessional.\n\nI would Never do business with people who still act like they live back home in a hut, uncivilized. Understand this, you live & work in America, and as much as you take pride in your heritage & where you from, You Live Here so Fugg U!\n\nI will take my Business to people who appreciate real money and professional business transactions."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMzlYNUVnEAE",
            "text": "The owner got very greedy. Now he's letting people pay $3 for oxtail gravy. When you order calaloo and salt fish they now want you to pay separately for each item. They're a million Jamaican restaurant in the area. I will not spend my money here anymore 😤."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzdXFHanZBRRAB",
            "text": "I ordered oxtail rice and peas their were no menu on the wall with set price only sides that come with your food is cucumbers, cold slaw or old salad. The lady that you pay even though the register subtract for her she still gave me wrong…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbThlR1RBEAE",
            "text": "Clean restaurant. Food always taste great. And no pork is cooked in the restaurant which is a majorrr plus for me! I eat there at least 3x/month. Everything on the menu is wonderful. Can't go wrong. Dont forget to check the other side by…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhcnFUS3RBRRAB",
            "text": "Consistently Delicious food with Great Service and Reasonable prices 😋"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNjUySUR3EAE",
            "text": "The food is normally good but I was rushed to go in the store because I wanted to social distance myself. Once in the establishment 10 people and a child was inside not including myself and the workers, not once did a employee inforce the social distance policy. They need to be reminded that Covid-19 is a real thing."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVN0pHS3F3RRAB",
            "text": "There are no set prices or menus anywhere. -1 Different things are made on different days, with no listed schedule. -1 Customer service can be a bit gruff. -1 It is a pitty because the food tastes good. Ex: Oxtails, Mac & Cheese, Stew Chicken."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1NFlXaTBBRRAB",
            "text": "The best Curried goat in Brooklyn,NY.\nThe staff is friendly\nThe portion size is great.\nOverall- wonderful food,service and food."
        }
    ],
    "reviews_count": 66
}