{
    "name": "D Garden Caribbean Bar & Grill",
    "place_id": "ChIJPdhv7khdwokRWao1-brx1p4",
    "grid": "BK17",
    "address": "4617 Avenue D, Brooklyn, NY 11203, USA",
    "rating": 4.3,
    "user_ratings_total": 372,
    "phone_number": "(718) 451-0735",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdWRYTnpNalZwZEZVMlMyVkxhRlpDVldzM2IxRRAB",
            "text": "I really love the pasta and overall vibe of the place. Service is fast and they’re very respectful. Best Caribbean spot in the area by far. DJ Sauce did his thing. I can’t wait to come back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ka1pWZDFVekp3ZDFWa1lrcG5URkphVWs4ek1tYxAB",
            "text": "Food was not authentic the night I went and brought drinks thst were expensive and it still taste like peanut butter Drift lounge is preferable never again"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKb1ZHTTNMVkpITkhScWVVSlFhazFaVXpaUWRuYxAB",
            "text": "Food was delicious, drinks was good.  For a Monday night, it was a nice vibe. 🇬🇾"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SVpVcG1PWGszY1hwSWFVUXRSbVI0ZVdaU1VYYxAB",
            "text": "The place was awesome! The customer service was excellent, everyone was very respectful, and the music was great — really added to the vibe. Definitely a spot worth visiting again!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbE5XZHNhMHRuZWxKbE1sbHlTak5PYzBJM05GRRAB",
            "text": "place was awesome nice customer service very respectful play very good music"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNeFFqQjFVMUJ5U2xGNVNWb3dRMUJDWW5STGVFRRAB",
            "text": "Mamaaaa Garden is what I call her!!! The name speaks for itself. This is the location to wind down, be yourself, feel safe, listen to amazing music from the DJ!!!!….; and have amazing drinks / eat amazing food!! This is my favorite location to unwind after a long shift, celebrate birthdays and come just because… why not!!! Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RWJtOUdTRE5yWVVsa1kyZHhlRTFvY0hsRGNYYxAB",
            "text": "My senses were fully satisfied by what they served. This place serves food with perfect flavor. The dishes are good, but the surroundings are exceptional. Their workers are why this place deserves top ratings. You should add this to your list."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTWExcEZNbVl3U1ZBek1VZzVjekpNWlRoWWVFRRAB",
            "text": "absolutely loved eating here!! it’s so authentic and i felt honored knowing the owner was personally cooking up my meal 🤗 everyone was incredibly friendly and approachable, and the hookah was marvelous as an arab 😋worth the price for sure and it’s not even expensive considering the economy AND its freshness. meeting the owners of d garden was definitely one my favorite part of visiting new york 💜💜"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocFdEaFRZbXN5Ym5NdE4xOWxhR1ZZTFZJM2IwRRAB",
            "text": "Food and atmosphre was good. Nice lil chill out spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNllVMHRTamRqWkRWdFUydEVTVXhqYkROSE1GRRAB",
            "text": "I come here literally all the time and last night made me super uncomfortable there should be no reason I’m minding my business at the bar and the dj and employee are watching me eat and drink and saying things like “she a freak look how she eat the fritter deh” or “she break off the plate” because it clanked the table. They were extremely inappropriate and I couldn’t even finish my curry goat (which I love there). Unfortunately my time eating is at expired."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMVZqVTNTbWRLV1c5NlNXVkdNWGxOTVhwTmVrRRAB",
            "text": "Angela the owner is super accommodating. Took care of us the entire way through. Great music and the vibes were high. Will be back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSa1NreGtRMDUwZURORVlVcFliMHhKWHpsUldFRRAB",
            "text": "Had a group event here, never coming back. First off the pre-fixe menu is overpriced, $80 for a shared appetizer and one entree per person is crazy. When the appetizer came out , it was not even enough for two people. My entree was ok , seasoned well but some of my group complained about the oxtail being cold. Unreal. We ordered drinks separate and they had the nerve to charge an additional $2 for syrup. The manager should really consider updating their pre fixe menu. 80 dollars for a shared appetizer and one entree per person is crazy. You should atleast include one drink , something. I will never come here again. Such a shame because the music and ambiance is great but the service for a large group sucks."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTkxVNTJlSE13TTJwdlJVcExTMUJsZUdkMWFGRRAB",
            "text": "Staff was very welcoming and the place had a cool vibe. Most importantly the Rasta pasta was absolutely delicious , highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQk1WODJNalZUTUZkNldrbHZZbGw1YkhwUVYxRRAB",
            "text": "This is such a nice vibey place, the service I had here was immaculate, my server’s name was Rae, very attentive from beginning to end and such a kind soul. I felt welcome from the moment that I walked in. The food? 10/10, as a New Yorker with a Caribbean background it’s hard to find those nice homemade dishes that feels like it was made with love but here at d garden you get the best of the best, the food is so tasty and fresh, will definitely be coming back more often. Thanks D garden for the great experience!! The chef 20/10!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsZmVteEZhRGxOU1MxMmFFMUNSVEJtVVhKMFIzYxAB",
            "text": "I found this restaurant on TikTok, and I’m so glad I did. The service was incredible, and the food was delicious. I had the sweet chili salmon with mashed potatoes, my friend had the oxtail with rice and peas, and another friend tried the pasta. The drinks were amazing truly 1000/10. The music set the perfect vibe. I haven’t enjoyed myself like this in a long time, and I’m already planning to go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214S1JVbE5TVzFGVjBrd2FIQXljRkZsVDFSaFJrRRAB",
            "text": "It was a girls night out with my sister, sister in law, and a friend. We all rate D-Garden a 9 out of 10. The ambiance, the music & the service from our waitress AnnaKay was impeccable. I would recommend 👌"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMUtfeVp3EAE",
            "text": "Place was cramped, food took forever to come out, very overpriced, and was cooked poorly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKU1UtT3ZFellpYi1RRRAB",
            "text": "I went for my birthday brunch on a Sunday back in December 2024. I’m praying they got it together by now. But unfortunately for my 31st, it was truly not a spot for me to celebrate. It’s beautiful inside, but between the champagne and orange juice smelling like vinegar and tasting very off, a rude bartender, and a space lacking heat, it was just horrible to experience. I’ll never go back there during the winter time and never with a big group of people. It took all of me not to cry. I appreciated the accommodation, as some people didn’t end up showing up. However, I did not appreciate how watered down, bad drinks, and rude the bartender was. She kept arguing with our waiter because the drinks were so watered down & poorly made, we wanted them off our bill. She argued with him the whole time we were there. I have never in my life had a watered down rum punch. How do you mess that up? Every drink ordered, watered down. Even the lemon drop 😭. Come on. The grits were too gritty. The sauce that came with the grits was great! The oxtail were tough :/. The burgers were extremely well done when two of my guest asked for it to be medium :/\nThe appetizers were great: ackee and bammy + the lemon pepper wings! We all loved. To be honest, it took me forever to leave this review because I was so disappointed. There are way too many good reviews and someway how we ended up having a horrible experience. When it’s 22 degrees outside and you know you have a large party that you’re sitting in the back, crank that heat up at least one hour before! Do not wait until we get there. Come on now. Or just be closed for the day since the temperature was so low. The furniture needed to be replaced. I shouldn’t feel springs or wood underneath. There was a lack of cushion. I was just so disappointed man. Like… I never knew champagne can go bad ….. that was just not a way to celebrate my 31st birthday. Half of my table ended up leaving mid way. & yes we\npaid, but never again. Our bill should’ve been adjusted for the consistent food & drink issues and it wasn’t. I was hoping this would be a spot for me to go to on the regular, but because the experience was so bad for myself and so many of my loved ones, it’s a strong no for me. I felt embarrassed that I even brought them there. I just hope within the past 5 months, the establishment made major improvements and hired a better staff with great attitudes. P.s. the waiter was the only great thing about the experience. He really tried his absolute best, but he shouldn’t have been the only one serving us. He needed a second person to help him run things more smoothly with such a big party."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbW9hclhREAE",
            "text": "This restaurant gave me something that made me so sick with vomiting and diarrhea. The lime was brown & dry on the margaritas, raw fish cakes refund issued, food was tasty but not sure what made me sick. No garden salads only caesar loaded with cheese not for me i don't do dairy. Nice decor waiter was very nice & friendly.Label your menu better to let customers know certain ingredients, many people have food allergies"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbDdiMWt3RRAB",
            "text": "I love it here! Good food and my waitress was so nice !!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNjl6OVJ3EAE",
            "text": "1st let’s discuss this dang CORN . Omg omg it’s called the wildfire coconut corn and it’s the most delicious corn I HAVE EVER had . It has this sauce on it that is out of this world . Let’s get into the portions of the main course . My goodness enough for 2 ppl huge plates . I was like oh my ! I had reggae pasta and it was perfect . Noodles not mushy or dry perfect with good amount of sauce . I will definitely be coming back when I come back to nyc . As a Bostonian I must BROOKLYN showed out on this place …"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbnF2VW1nRRAB",
            "text": "i dont like too much"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcUw2eUhBEAE",
            "text": "My experience at this location was wonderful great staff, music wonderful go to place"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcWNuaHh3RRAB",
            "text": "08/31/24 - Would we come back? Yes\n\nWent out here for my friend and his anniversary and I would definitely come back here again!\n\nMusic was great DJ was playing the tunes, the drinks were drinking, the food was giving life and that atmosphere was great, the night we went wasn’t crowded at all."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJb0tpeU9BEAE",
            "text": "I just went for my birthday and child It was amazing. Everybody made me feel Welcomed And special everybody was super sweet. Everybody was very attending. It was a 10 out of 10 experience. I would definitely come again and recommend to my friends. Thank you to all my servers. You guys are so amazing. PS, Your macaroni is amazing and portions"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMjlTMXZ3RRAB",
            "text": "I had the chilli glazed salmon it was pretty good! Service was excellent! Always my go to for a chill vibe during the week!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaWREU0dnEAE",
            "text": "Food is top tier. The chef has never once disappointed . They use fresh ingredients and the flavor of the food is like a taste of heaven. I cannot express how much I appreciate every-time I come to D Garden, I feel a warm welcome. Drinks are on point and the manager is amazing. Angela ensures you are met with the finest quality of service at all times. This will definitely be my go to for a calm night out especially I’m such a foodie and not to mention the hookah is also great!! I wish I could give more stars !!! Keep up the great work!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3Z2JHWkV3EAE",
            "text": "The food and service was amazing I would definitely visit here often."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MUlmOTF3RRAB",
            "text": "If you love waiting more than 30 min for your food come here"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndWN6VHZ3RRAB",
            "text": "Great vibes. Great food and drinks. 10/10 would recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncnByZHFnRRAB",
            "text": "I flew in to NYC & arrived late. I was looking for something good to eat & accessible as I use a wheelchair for mobility. I discovered this gem & they did not disappoint. The staff was accommodating & friendly. The food was delicious & I had leftovers. The vibe was great & the drinks were strong. I’ll  definitely be back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOVBfTHB3RRAB",
            "text": "My sisters took me there last Saturday for dinner and I have to say dinner was absolutely delicious! We were greeted  by this wonderful lady with blond short hair I am sorry to say I didn’t get her name🙁 But her hospitality was Wonderful!!!! The atmosphere was very nice to the eyes! As for dinner I had the Rasta Pasta with sweet chili salmons and it was DELICIOUS! If you ever in the neighborhood stop by you won’t regret!!!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBelBiV2JBEAE",
            "text": "paid 160$ for food that’s mid. they asked how i wanted my steak done, which i said medium all for the to still cook it well done & it hardly had any seasoning on it. Mash potatoes bland! My friend ordered the salmon & it also was bland & still had that fishy taste. Also didn’t like one of the drinks & asked if they could take it off the tab, instead they tried to give me a chaser that i did not ask for"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfeUlYTl93RRAB",
            "text": "My girls and I had an amazing experience.\nFood,music, ambience were Phenomenal."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcThyN2tBRRAB",
            "text": "Special shoutout to Chad— she took care of me all night!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcTZELTdnRRAB",
            "text": "Shoutout to Chad. W bartender with W recommendations. Definitely going to come back here for sure. Ambience, music, wings all A1!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcS1EVEp3EAE",
            "text": "I came here on a chill vibe with some friends & Chad served us at the bar. She was honestly the best part of the restaurant. She made us drinks off her creativity and they definitely hit the spot! Anything we needed she made sure we were straight. She was good vibe fasho. The restaurant itself has a great atmosphere. The Dj was fire too!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcS1EaEV3EAE",
            "text": "Chad was great, made sure me and my friends were well taken care of and continuously checked up on us. Best service possible, I recommend her any time you come here!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaTR2aW5nRRAB",
            "text": "Chad was the absolute best! The drinks were great. The customer service was exceptional and the food was amazing. We will definitely be back when we return to NY!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMU9uVml3RRAB",
            "text": "My family and I recently visited this restaurant, and we were blown away by the amazing ambiance and food. The vibrant Caribbean vibes, complemented by great music, made the experience unforgettable. I ordered the fried lobster and waffles, and everything was perfect. The waffles were fluffy, lightly sweetened, and paired with just the right amount of fresh fruit and syrup—it was the perfect balance. The fried lobster was cooked to perfection, bursting with flavor in every bite. My husband had the lamb chops with mashed potatoes and vegetables, and the dish was equally impressive. The flavors were spot on, and the presentation was top-notch. My daughter chose the curry goat with jasmine rice and vegetables, and it was absolutely to die for! The rich, flavorful curry paired beautifully with the fluffy jasmine rice, and the vibrant presentation made it even more enjoyable. The service was outstanding, and the overall atmosphere—complete with lively Jamaican and Caribbean music—made it a place we can’t wait to return to. If you’re looking for a spot with delicious food, great service, and a fantastic vibe, this is the spot.."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkemFpNFJREAE",
            "text": "I saw this place going home one night then looked it up. Based on the menu, review and food I thought why not. It was close to my home. We sat in the back which I was fine with. The seats were white and dirty. I was disgusted. My boyfriend could see I was uncomfortable sitting there. Then the tables were low  so it was hard to eat. If you want to eat comfortable you would have to sit all the way to the back of the chair with your plate on your lap. The tables were also not that clean.Next the food was not good and it was expensive. The rice and peas was not not even hot but lukewarm. The estovish fish to me had to much pepper. Then the waiter bought my boyfriend food with no fork or spoon. He didnt even have the Utensil for the wings. The bill also came up to almost $200. I attached it here. There was 18% gratituity, tax and they charge you 3%, to use the card. The music was decent and I like that the \"CEO\" was present. Would not return or recommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNFpXMl9nRRAB",
            "text": "First time at this establishment for a my friend birthday dinner, I received a warm welcome, beautiful atmosphere, DJ played enjoyable music for the crowd and occasion. Drinks & appetizers delicious. My dinner was the salmon for me it needed lil seasoning but the highlight of my dinner “they had real pepper sauce”. I will definitely visit again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmb2JDRk93EAE",
            "text": "Food is amazing. Ate here a couple of times surf and turf love it but recently I ordered the coconut curry shrimp with jasmine rice I’ve order this before many times but this time it was over loaded with spice it was sooooo spicy to the point my nose was running I couldn’t even share with my daughter nor did I enjoy it feeling like I was just eating pepper and rice. Not sure if there is a new cook in charge but not everybody is in to spicy food and needs to make that clear when taking a customer order. I know Caribbean's enjoy spicy food but your around other cultures that don’t eat pepper so hot like that and you have people with health issues where pepper can be a problem. Just something to be mindful about."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dTVfQnNRRRAB",
            "text": "This is a nice spot. The time we went there they weren't busy at all. Food was served in a timely manner and was delicious. Our server was also friendly. My only issue is inside can get cold once the front starts opening and closing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OGFIcW9BRRAB",
            "text": "Descent Lounge, good food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2c2FfSENBEAE",
            "text": "Amazing spot, the food was next level,  and the wait staff was super friendly.  Shot out to the owner and security staff!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdU83emtRRRAB",
            "text": "The service and atmosphere was great but I thought it was a bit overpriced for what you’re getting. Those with me did the bottomless mimosas and that looked pretty good and the drinks were strong."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQb3UzWFl3EAE",
            "text": "Giving this place one star because this is now the second time I been to this restaurant & there’s an older lady with glasses at the bar and she is so rude and mean to staff. She has made me and my girlfriend very uncomfortable on both occasions. Why belittle and talk down to your staff especially in front of customers. It’s very hard to watch and I  lost my appetite. If she’s in management she needs to be fired there’s a way to talk to employees and I’m surprised they don’t all quit !"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaE1icTBRRRAB",
            "text": "I highly recommend this place for gatherings with friends or family. My friends and I enjoyed many dishes, but my favorite was the oxtail. The service was great, and the atmosphere was amazing!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQb0pXdVV3EAE",
            "text": "Hands down best carribean food ever.\nMy favorites;\nMussels, oxtail, goat, snapper, burger, and the brunch omg, everything is Amazing!\n\nWill be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Mlo2OWFBEAE",
            "text": "Amamzing service by Roberto, came here for my grandmothers birthday. Food was amazing, staff was super friendly and legitimately caters to all age groups.. definitely worth the visit. Portions was good and was enough to carry home left overs. They have seating both inside and out music was family friendly for a west Indian crowd. Will definitely come again.\n\nEach staff member was friendly but I definitely have to boast Roberto he was patient and didn't rush us at all"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURic1pPTW5BRRAB",
            "text": "What can I say? I went here for Sunday brunch and the food was amazing and the service was beyond perfect when I say the waitress gave us so much attention and the hookah was good and everything was perfect. The grits and shrimp were delicious. The owner was so sweet and kind. It is definitely the place I'm going to be spending more of my time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbDU3ZWd3RRAB",
            "text": "Food was really good and SEASONED! I don’t know about everything else but the chicken for the chicken and waffles was definitely a hit. The whole meal\nItself as a whole was good. Only Brunch is served during brunch times. Not sure if it’s all day or a specific time of day. You’ll have to go on another day to try other stuff on the menu. Mimosa pitchers of different flavors are available for 19.99. They also give you a slice of cake with a sparkler, play music and have a bubble machine for birthdays. It took a while for the server to come to our table. We ordered some fries that took a while to come to our table. Overall I had a good experience here. Would try this restaurant again. Also there is a backyard and party space available for group dining. Backyard is nicely decorated and have a few areas for photo opportunities."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaX3FyM3R3RRAB",
            "text": "This is my second time at DGarden! The first time it was back in March for brunch for my brother's birthday. They were quite accommodating for a last-minute reservation with a big party and I thoroughly enjoyed myself! So I knew I always wanted to return.\n\nLast night was the first time I was there at the night time. My friend and I wanted something casual and the plan was to get appetizers and drinks.\n\nComing in the decor is cute and modern. They also have a nice outdoor area which is decorated nicely! In addition to this, they have an enclosed area in their outdoor section as well. You can only smoke hookah outside.\n\nInside wasn’t packed and there was a live DJ playing. At first, the music was a bit low but then became so loud that my friend and I could barely hear each other.\n\nTasheba was our server and she was very nice and energetic, there were some slight issues. We placed our orders, which were honey garlic wings and Mac and cheese. Our first round of drinks was DVibe and DGarden. As soon as we were finishing our order, someone from the table behind us called her and she immediately went over and didn’t excuse herself. She didn’t come back either.\n\nOur food came first, and we didn’t have our drinks. I did notice there was only one bartender.  Tasheba also brought two sides of mashed potatoes and we reminded her that we didn’t order this. She proceeded to say that there weren’t any sides of Mac and brought this out instead. We respectfully declined the sides, and my friend reordered her side as fries. She walked away and didn’t ask me if I wanted anything.\n\nNow onto the food, the honey garlic wings were pretty good! I would give them an 8/10. The portion size was appetizer-friendly. The DVibe was good, but I tasted the port more than anything, rating wise, I would give it a 7/10. Tasheba did a check-in as well.\n\nLater on, we decided on another round of drinks. I had a We Go Together this time. This drink was stronger, however, it is a bit on the sweeter side. I would give this a 7.5/10. I also ordered mussels, and these were soooo good! They can be a main course. I would give them an 8.5/10.\n\nWhen we decided to leave, there was an issue with my card, and when Tasheba tried again, my card got charged for the full amount instead of half. She was apologetic and stayed to make sure things were troubleshooted. I just want to advise as well that there is an automatic 18% gratuity. Overall the total for two rounds of drinks and appetizers was about $150. It is a bit pricey to keep in mind.\n\nOverall I feel like D Garden is a great vibe if you’re looking to be casual or a birthday.  If there can be added staffing for the bar and floor it would help!\n\n( This is a 3.5/ 5 Star rating )"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN3BlVndBRRAB",
            "text": "Wow ! Why is this place not talked about ? First i must say i was greeted nicely by security at the door which is rare in New York lol as i walk inside the atmosphere is phenomenal! But the best part is the service and food. Roberto and Hershey was amazing very quick and attentive and made sure our orders was correct. The food was amazing like the flavor i can’t even explain. The music is at a good level i can hear my friends talk and the drinks i highly recommend the confession time i believe that’s the name but it was really good will deff be returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNnAzOTRBRRAB",
            "text": "Had a great time here. The waiter was nice and respectful.  The atmosphere was mellow music was perfect. The DJ had me and my sister getting up to dance the entire time. It's a 90-minute seating and they don't do unlimited mimosas but they do pitchers. Overall great vibes"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodXU2QURBEAE",
            "text": "I recently celebrated my mother's birthday with the family at D Garden, and the hospitality was amazing from start to finish! The food was great, I would recommend both the buffalo and hennessey wings and also the mussels as an appetizer. I had the oxtails for my main course, they were seasoned very well and were tender and delicious. My drink of choice which was recommended by our waiter was the garden bliss, the drink was on point and strong. The music was great and overall it was a vibe! Definitely worth checking out if you haven't already done so."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1djVTQ1VBEAE",
            "text": "What a wonderful experience we had at this restaurant! From the moment we walked in, the hostesses were welcoming and with a positive attitude. Michellin was so attentive, she ensured we had everything we needed and that we were ok. I had a last minute request, My youngest son turns 5 on Thursday, and I asked her if they can accommodate us, and she went out of her way to make it special for him. Our server was also very caring and on top of his game. The music…. You guys got me there, because I love some 90’s hits. Although I didn’t get to enjoy the outside area, it was so cozy, and beautiful. Can’t wait to tell all my friends about it and come back for brunch and to create more memories. D Garden Caribbean Bar & Grill is a 💎. Congratulations on this successful step, And I wish much success for the entire D Garden staff and family!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMmRHWmtBRRAB",
            "text": "Went to this spot on  a Friday night for dinner. First off I must say that everything  that was ordered was delicious, very well seasoned. We had the codfish fritters l, lamb chops and the surf and turf. Everything was well done. All of the drinks are one flat rate of $16 which was a negative for me because not every drink requires the same ingredients and the sizes were definitely different. We ordered the froze all day which was basically frozen moscato and the holy water which i took 3 sips and it was done. Don’t give me the drinks we’re on point but to me, a lil overpriced. For dessert i ordered the “supposedly”baileys cheesecake but it was plain ole regular cheesecake. When we received our bill the surf and turf that was priced at $48 on the menu, on our bill we were charged $54 along with the taxes and an included 20% gratuity. That gratuity to me for a party of two is overrated. Now when we pointed out to our waiter the over charge he stated that the price did increase but he will speak to his manager. He returns with a new bill with $4 discount, we were charged $6 extra for the meal but got a $4 discount. Now tell me if I’m wrong but taxes and gratuity is based on your total bill, however all of that still remained the same after the bill was lowered. Not putting the establishment down, as i said food was great but few things are a little over priced."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabmRDTWRREAE",
            "text": "On the walk in we were greeted respectfully escorted to our seating our waiter was definitely awesome accommodated us to our satisfaction. Food came out in a timely manner. Vibes was great, music was great. 10/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMGYtdTNBRRAB",
            "text": "Lovely spot nestled in Brooklyn. The food is delicious, it is Caribbean fusion, twist. The cocktails are strong and creative. Service can improve but, good.  They have a DJ spinning a mixture of cultural music. The downside to having the music blasting is that you cannot have a conversation with your dining partner/group."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIay1MS3h3RRAB",
            "text": "This is the best restaurant in Brooklyn I have been too the atmosphere to the music to the food omg the food was hands down the best the chef really did excellent. I love the back room it was a nice chill spot my server Roberto was great and very nice and made sure everything was to our liking he was consistently checking on us to make sure we had everything we needed it was just a beautiful experience and I will be back soon thanks guys for making the night special 😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoak5xMnl3RRAB",
            "text": "If you know good food you will see that they not ready with the cooking..their restaurant caught my eye because of their presentation and how clean the place looked but but their food was over priced.. seems like the owners is “Jamaican and Trinidadian” seems more of trini cooking to me rice soft like pudding escovitch fish taste horrible.. the seasoned fried taste good but simple bbq wings barely have much sauce.. my neices are jamaican so they are used to good food.. tofu isn’t supposed to be made as if you don’t have teeth.. my pina colada taste bad my husband had to finish it for me. I would never recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoc3E2SE1REAE",
            "text": "D Garden deserves more than 5 STARS. I love it here. My friend told me about this spot and she loves it . My husband and I celebrated his birthday here and I’m so happy we went. I don’t do reviews , but they were amazing. The entire staff is pleasant. MARLEY was our server . His customer service 5 STARS. Marley was accommodating and ON-Point. The Owners were too sweet  (Mother and Daughter). They wished my husband a happy birthday and we even started to chat and take pictures lol .\n\nIf you love HOOKAH like I do . This is the place. They have a back area where you can smoke hookah. The vibes in the back was comfy and secluded . Like you’re in a different realm. A good one though. The hookah was smooth, the clouds were beautiful, it lasted more than a hour, and the flavor  (Skyfall) 👍🏽\n\nThe FOOD came out on time and was WELL SEASONED. I had the Jerk Sampler. I love corn , but I never had corn like that in my life lol. My husband had Sirloin , Mash Potatoes, and Asparagus made to perfection.\n\nThe Drinks were good as well. The bartender recommended a mix mimosa and it was good.\n\nIf you love to take pictures. No problem. The ambiance is beautiful.\n\nPrices are affordable :\n\nAuto Gratuity is not added to the bill . Even though I FEEL like it should . The service there is great and people like MARLEY deserve it. Some people are not tippers or don’t understand the concept of tipping. Auto Gratuity will cover your employees from people like that.\n\nD Garden ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbjhLWHRBRRAB",
            "text": "Definitely a vibe. Food was DELICIOUS! All of the staff was super dope and informative very helpful for our first time experience. My daughter's enjoyed this hidden gem equally as much as I did. We will definitely be back!❤️❤️❤️❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4Nk0ta1VnEAE",
            "text": "I celebrated my birthday here and I was beyond impressed. My family and friends enjoyed themselves and the food and service was on point to match the good music . I would recommend this venue for date night, any celebration or accomplishment. This place will leave you satisfied. I can not wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcWR5Ym13RRAB",
            "text": "Cute lounge and decor.  I had the sweet chili wings, which were good and fresh, not frozen. The rum punch was good. Happy hour from 9-11pm. Clean bathroom."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaEp2a25nRRAB",
            "text": "This place is  supper fly on the walk in i don’t feel like I’m in Brooklyn  . Then  cali was there to greet us she just a vibe . The food  amazing ! Look at my plate i had the  jerk salmon i forgot to take a pic of it from the beginning. I willll be back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNXFpQzV3RRAB",
            "text": "Service isn’t the best , waiter isn’t that friendly. .. food was good , but it been nice if they brought out the food all the same time . Also their bottomless menu need more clarity… This venue does have a outdoor cabin it’s warm . But it’s okay"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dW82aTl3RRAB",
            "text": "This a cute bar in the heart of East Flatbush. Easy to get to by public transportation. There’s music, food, hookah and cute photo opportunities. I went for Taco Tuesday and the bartender Christy had my drinks on point. I started with margaritas during happy hour and then had a Hold Onn. Will Be Coming back with my girls for the Ladies Night and Hookah."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dFpleHhBRRAB",
            "text": "Dined for a friends graduation celebration, and our server was Shamar, 5 stars to Shamar, attentive and patient! because we were a party of 20 we were seated in their enclosed outdoor patio. It felt exclusive, it was decorated with greenery on the walls and ceilings, making it aesthetically pleasing !!! They have an open backyard really pretty outside... great photo ops... I Had Salmon With A Side Of Spinach And White Rice... AMAZINGGGGG... My friend had lamb chops, the rosemary sauce they use for the lamb chops were perfecttttt and seared to perfection, I will definitely be returning. I recommend any one to go for date night or social night out, or to celebrate any events, live dj playing a mix of everythinggggg he evens shouts you out if you request! Thanks D'Garden for having us."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaOXYzUTl3RRAB",
            "text": "Such a cool sexy hide out! From the food, to the drinks to the staff! Everyone made my daughter's birthday dinner/party a blast!! The brown stew snapper, and jerk wings are a must!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCb3ItSDB3RRAB",
            "text": "Went here before the New Jack City stage play and had an awesome time. The drinks and food was great. Our waiter was the best he took such good care of us. It was my friends BD and he did everything so nice. Also had the chance to meet the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNILVBMd0NBEAE",
            "text": "Daniel was an amazing manager. He was very tentative to my friend and I. When we finished at the table and went to the bar Hershey was extremely sweet! I would definitely return.\n\nI had the curry goat which was very good. Food wise is a bit pricey but I enjoyed what I had. The backyard space was nice. One of the bathroom stalls was missing the toilet seat, but it was clean. They had a DJ for the night who was really good and catered to the crowd. I would definitely return."
        }
    ],
    "reviews_count": 74
}