{
    "name": "AllFlagS BiteS Restaurant",
    "place_id": "ChIJ59IYRRNdwokRBuwAEspKg5M",
    "grid": "BK17",
    "address": "1088 Clarkson Ave, Brooklyn, NY 11212, USA",
    "rating": 4.9,
    "user_ratings_total": 17,
    "phone_number": "(718) 552-2065",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWk5tRnBlVXRDY2tGd0xVRTJiMkp2ZDBSSldVRRAB",
            "text": "The employees here match the restaurant's atmosphere perfectly. Their combinations surprise but satisfy. Staff remembering regular visitors shows they care. Excellent, fresh food at reasonable prices. Simply stated, this place has earned my loyalty, and it'll earn yours."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcFVFSnlRVWRoUVVkM2VWWlVVR2xrV1ZKWlNtYxAB",
            "text": "Food is amazing and delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBd1dYQm1SWGMyYWtZeE5sYzRhbGd4UVRWdmJtYxAB",
            "text": "This is hands down the best Haitian food I’ve had in a very long time. And the best Haitian food in NY! The flavors were so authentic, I felt like I was in Miami. Normally, I have to travel all the way to Miami just to enjoy Haitian food like this, so I’m beyond impressed and completely blown away.\n\nI’ve already eaten here twice, and somehow the second time was even better. I ordered the black rice and Tasso dinner with mac and cheese, and every bite was pure perfection. The rice was cooked flawlessly soft, flavorful, and rich. Even my 92-year-old grandmother couldn’t stop raving about the rice. She was shocked at how delicious it was and especially loved how soft the texture was, making it easy for her to enjoy. Watching her eat with such joy was truly priceless.\n\nI’ve been dreaming about this food ever since, and I can’t wait to go back.\n\nOn top of the amazing food, the customer service was refreshing and surprisingly excellent. At most Caribbean restaurants, you almost expect a bit of attitude, but here it was the complete opposite. I was greeted with a warm smile, and when I couldn’t decide between white or black rice, they even let me sample both. That kind of care and attention made the experience extra special. They even had my favorite soda, which added a nostalgic touch.\n\nThe restaurant itself was very clean and welcoming. Overall, this is exactly the type of Haitian food and hospitality our community needs. I truly hope they continue to thrive and keep up the amazing work. I cannot wait to return! 🤤😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOR1pHY3hORnBIVDJGUk5qUldielF4TWxoUVJsRRAB",
            "text": "I recently stopped by, and I was thoroughly impressed with both the food and the fantastic customer service. The quality of the food exceeded expectations, and the portion sizes were generous for the price. I was pleased not only by the flavor but also by how beautifully the dishes were presented. I highly recommend this place and will definitely be returning!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTE1qTkVTRlpLV2twcGVIaDVZMm8yWW5SdVQzYxAB",
            "text": "The place provides everything a good meal should include. The workers provide steady assistance. Tastes amazing and servings are substantial. My preferred place. The bills here won't shock you despite the popular location. I'm marking this for a return visit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoblpXbEdiblUxUjJ4T1VHNVBORXhKTFhaM1VYYxAB",
            "text": "Great service/wonderful staff and overall great atmosphere."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQMzl4OHZPbUwzZG5nRRAB",
            "text": "AllFlagS BiteS Restaurant is “One of my favorite Haitian takeout spots. The food is fresh and  delicious, sweet staff. Portions are also pretty large so you get your money's worth.\nThis restaurant was highly recommended by my Haitian bestfriend and I was impressed!”\nI also recommend this restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYVI5cUNOaWF2MmNREAE",
            "text": "The food was very good, and i will definitely patronize again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZmpsWjYybWNhbUtBEAE",
            "text": "The food was delicious the griot was amazing black rice and macaroni and chesse very good. And very good customer service, thank you Peter you are the best."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMSHVnNVBhaHZyVTh3RRAB",
            "text": "Service was emaciated,  very professional and the food tasty / delicious. I definitely recommend,  you will absolutely enjoy"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcVhzUFMxcHNqVS1nRRAB",
            "text": "10/10 very good 👍"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNMkZ2Y1gxMGFld3VBRRAB",
            "text": "Foods from that place are delicious, I got fish and griot the other days, I really enjoyed it. That's a restaurant you need to try, good service, good food. Very nice staff!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJM243NHFTaElqbFN3EAE",
            "text": "It’s always been a positive experience each and every time we order from this place. Great food, affordable and pleasant staff.\nTry their Griot dish"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQYnk4NlgtOS1HQWJBEAE",
            "text": "Everything it's perfect."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLNkctT1BXbjVEU3VRRRAB",
            "text": "The food was so delicious especially the black rice and the stew goat yummy yummy"
        }
    ],
    "reviews_count": 15
}