{
    "name": "Kingston 8",
    "place_id": "ChIJ7wshy9VdwokR52f8stc-glM",
    "grid": "BK17",
    "address": "1067 Ralph Ave, Brooklyn, NY 11236, USA",
    "rating": 4.7,
    "user_ratings_total": 15,
    "phone_number": "(718) 684-9460",
    "reviews": [
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPRFE5T2ZBeHVQeGx3RRAB",
            "text": "I like this restaurant because the food is good. You get a very homely feeling when you come here. I ordered their curry shrimp. It was made on order basis so the wait was long (hence the 3stars). But the owner is sweet one of the main reasons why I come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJd2RtTDJnRRAB",
            "text": "i paid almost $9 for 3 pieces of chicken which was unexpected but i’m not surprised. i usually have more chicken when i get food from other places but i guess they’re just not like that. the flavor was there but it’s not the best thing i’ve ever had. the guy taking my order was nice tho, that’s a plus, most jamaican restaurant servers always seem like they hate their lives. will i be back? probably not but they held me down when i was hungry. what more can you ask for lol."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NE1IeUZREAE",
            "text": "Amazing filling food and great price"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfay03ZTZBRRAB",
            "text": "Everything is so nice. Food was good"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMWFLbG5BRRAB",
            "text": "I went here last year in June and they gave me cornmeal porridge full of nutmeg which makes it bitter. I went back to tell them about it and they gave me “i cant do anything about it”energy. I came back today to support them and got the lunch special the plate was small which is okay but then they barely put any rice in there i ate the food it was nice then i went to do physical stuff and my heart was burning this never happen to me before after eating food smhh.🤦🏽‍♀️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeC1PZk53EAE",
            "text": "Fantastic experience! Amazing food, great portions, and the best service. Highly recommend for authentic Jamaican food. Thanks so much for having us Nigel, had a wonderful time.  See you again soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycC0zWUVREAE",
            "text": "I recently ate at KINGSTON8 and had an exceptional experience that I feel compelled to share. From the moment I walked in, the staff was incredibly welcoming and attentive. The service was prompt, courteous, and personalized, making me feel like a valued guest.\n\nThe highlight of the evening was, without a doubt, the food. Every dish was prepared to perfection, bursting with flavor and beautifully presented. Especially the oxtail.  The ingredients were fresh, and it was evident that a lot of care and passion went into the preparation.\n\nOverall, my experience at KINGSTON8 was outstanding. I highly recommend this restaurant to anyone looking for a delightful experience with top-notch service and high-quality food. I look forward to returning soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdzUtWEl3EAE",
            "text": "Just amazing! The owners were sooo sweet. Delicious food, clean place, 5 ⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdzhYREJnEAE",
            "text": "Food was amazing owners are very friendly and welcoming . Food was really amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6Z011UGlBRRAB",
            "text": "The food was amazing ! Can we talk about the hospitality and vibrance of this Jamaican owned restaurant!!! Also let’s mention their menu options are not limited 🎉."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOFBqU0ZnEAE",
            "text": "Great family restaurant, the food was tasty and fresh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNULS1tMXBBRRAB",
            "text": "Came to this restaurant looking to try some Jamaican food for the first time and had no expectations. Wow was I blown away, I ordered the oxtail and stew peas and it was so delicious. Not only was the food excellent but, so was the service, they answered all my questions when it came to different dishes. I’ll definitely be back, great addition to the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcnZpR3V3RRAB",
            "text": "I had the oxtail and it was delicious! Great service too, can’t wait to come back next time I’m in the area."
        }
    ],
    "reviews_count": 13
}