{
    "name": "More Than Fries",
    "place_id": "ChIJvQWyLF9dwokRypKVOgyPw0E",
    "grid": "BK17",
    "address": "1077a Rutland Rd, Brooklyn, NY 11212, USA",
    "rating": 4.3,
    "user_ratings_total": 135,
    "phone_number": "(347) 240-6806",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSlMzVTRkbkI1ZVdaU1NYZzRNVzFhTmtRdFprRRAB",
            "text": "The guy on the phone hanged up before I could finish the rest of my order, like what?"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NFZuSkJUMUJLWTNsWE9FWlZTemhxTjBOd01WRRAB",
            "text": "Second time eating from this place and this place is always fast and very friendly service. Food is well prepared and fast. Wait time is not too long. Definitely worth coming and trying it out."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM2VXTnFjVlZTWkhGck4wTmpiVFo1U1U5cmFuYxAB",
            "text": "I love the different fries they have here, you should definitely try it!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSVEyZHdVMWxVWjJOSlkwbEllR2cyUVdWbU5rRRAB",
            "text": "Good food its take awhile to come here but the food its worth jt"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaWRqSkVUR1owVjNwV1dHeExVbFZzVFZOV1YxRRAB",
            "text": "The buffalo fries and shrimp taste great 10/10 would highly recommend and they accept EBT"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSGRtUXhhV1p0UkVadlNGWk9TbWN3YVd4aVFtYxAB",
            "text": "The service was really slow for a small order. My first order here was good but this time they took longer than expected and the food didn’t taste the same as last time.\nShrimp eggroll was hard to eat."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNldVc3daR1JWUkV4MFJGVldWRFJYVUZWMk5HYxAB",
            "text": "The one man show that never disappoints. Food it fresh and flavorful, service is great and always something good on the menu. Definitely stop by."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GR1VreFRUMFppWjBkblVtWkhWa1ZJVDFSc04yYxAB",
            "text": "It was my first time going to this restaurant yesterday and the food was remarkable! Can’t recommended this place enough!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkR2RXaEtPWEZ0TWtaR0xVaFNlbFZ6T0hSWGJXYxAB",
            "text": "I recently purchased buffalo chicken ranch fries, and I must say, they were quite delightful. The flavors were exceptionally well-balanced, and the taste was truly amazing. The service was also outstanding. Since it is primarily a take-out establishment, I am unable to provide feedback on the atmosphere. A must try place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWE9WcElSV0ZvYm1oUlRVOXBPR2cyT1dSSFEwRRAB",
            "text": "Great food and service. One of my favorite spots."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReVZqWkZjMnRDVWtOV1VVNTVWRlJYT0c0dFkwRRAB",
            "text": "Didn't have an experience the place was closed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMFVrSklWR2RpWWpkSlZtNW9ZM2x3Y0ZkaVRYYxAB",
            "text": "Great service! I called to place a pickup order he was very friendly and knowledgeable, when I arrived my order was hot, fresh and ready for immediate pickup. The steak was nice and tender, the shrimp was well seasoned overall a great experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSS1NGQnlUSHBYUTJsUFlrMXVhVWx0UWxSc1pGRRAB",
            "text": "Spot is fire you haven’t been here you def wanna try"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbFJYcHRXazl5ZFRkaVNVdElkbGt4VEU5cFIyYxAB",
            "text": "(Very honest review) This one I was so hungry 3/3 times I went 2 times they were closed and I traveled 30 mins .. last time wasting time going there, never wanna be open like only one person work there and don’t even want to be there. Food was a 7 the one time they were open. Don’t pock up the phone restaurant never open when it looks so .. 2/10 experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQ05rOUxNMVZoYVZGc1IxZGlSelpzVnpaemVIYxAB",
            "text": "I called prior to coming in to see if they were open. I then show up, and was told when I walked into the establishment that it was closed. Google states the location closes at 11 pm. Please update that."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdnNyT0ZBEAE",
            "text": "Omg, this place is small, but the food is incredible.  Delicious came all the way from Bronx. Just try it . Worth miles and traffic.  Highly recommended."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQlQydG9aM3BGYUhsdVRqRlpOamhXV2pRMGJtYxAB",
            "text": "The food is really good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OeVJqRnRlblpPVkZWeWNGRjZibWw1VTBkQldXYxAB",
            "text": "The service and the food is to die for!! No exaggeration. It’s always good customer service when I go. My favorite is the lobster and shrimp egg rolls with the house sauce and the sweet chili sauce. I promise you will not be disappointed"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWd1RsTkpXbXB1YlVGaFRsRkZNRlpTVXpGU2EwRRAB",
            "text": "Very good burger it looked like it was made medium but i don’t mind hamburger and fries for $12.50. It beats McDonalds"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205c2QyYzNjMnRxZEhOeFQwaHZlV05YZEVObVFYYxAB",
            "text": "I tried this spot for the first time today and enjoyed every bite of my meal! The BLT with that buttermilk fried chicken was delicious.  The cheeseburger egg rolls were also very good. I'll definitely be back to try more!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaGJXMUdORWRWYTBWcGNrTlFYMFpEVFV3M0xXYxAB",
            "text": "My first time at this place and the home made French Fries with lump crab meat w/garlic butter sauce is everything and l will return to try and try the others"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQXzJxSS0tZ3ViVEd3EAE",
            "text": "Best surf & turf loaded friesss !! Don’t even get me started on the cheeseburger eggrollsssss 😣"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbnZqZHF6X2NqdVhREAE",
            "text": "The food here was amazing and tasty I would definitely recommend coming here again. I was highly satisfied with the service and the food. Shoutout to the chefs and cashier for making my visit worth it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbG9XanFnRRAB",
            "text": "Yooo Blair(e)! 🔥🔥🔥\n\nTo the people that don't like onions on their burger, grow up.\n\nI was expecting Ok and got Delicious!!!\n\nBurger was flavorful and the fries were just right.\n\nSee you soon brother."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOUpiY1lREAE",
            "text": "Yo when I tell yall this food is everything yall need to stop In run there"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaFpXaW13RRAB",
            "text": "I order from this place a lot, and I love theire fries! My only gripe is the Pizza fries are always sold out! Everyday I try to get them, and its greyed out on Uber eats."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeTQ3ZGpnRRAB",
            "text": "The best!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NHRIb2pBRRAB",
            "text": "Great customer service. Good food. And great prices. Neighborhood favorite!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3b3Uzc19BRRAB",
            "text": "this place is so good! and the customer service is amazing. I definitely recommend coming here"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OEtqa21nRRAB",
            "text": "I’ve tried loaded fries from a lot of restaurants, but nothing in comparison to the jerk chicken over fries at MTF! The Surf & turf egg rolls, double deluxe cheese burger, chopped cheese fries, just a few of my favorites. Along with that, the cook is always friendly/jokey, Thank you for serving our community."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bDRUc2VnEAE",
            "text": "Food is always fresh and delicious every time! Love this place 🤭"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NHNPQUZBEAE",
            "text": "Cool spot a lot of options food taste and quality is good' will be back in had the surf n turn over fries"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRXzZPbVpBEAE",
            "text": "Their food is the bomb, great customer would definitely recommend!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOTgyWlh3EAE",
            "text": "The salmon egg rolls were bomb!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMWJQQVBBEAE",
            "text": "The taste of the blue cheese is sour. The smashed patty smells like the oil used to fry it used for fish"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmd3VxZ0VnEAE",
            "text": "Great place for an amazing burger & fries it never fails me anytime good people in there with an even better points system."
        },
        {
            "date": "10달 전",
            "language": "fi",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MElIM2VBEAE",
            "text": "Ngl food is bussin'"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMDRmZDVRRRAB",
            "text": "Food is delicious and the customer service is top tier. A hidden gem in flatbush."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaXJPZzJ3RRAB",
            "text": "The food is so Bomb 💣 my favorite is chicken bacon ranch fries the Mac and cheese is so creamy I love to add bacon to it Also the egg rolls are also delicious oh the Mac N CHEESE burger is also delicious The FROZEN DRINKS are the best my favorites are strawberry or Mango I Definitely will be going back VERY VERY SOON GREAT SERVICE AND THE OWNER IS SUPER FRIENDLY"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMHNHYi1RRRAB",
            "text": "The food is so amazing I can’t believe this place existssssssssss, 10/10 I would definitely recommend. Anytime you’re in Brooklyn it’s imperative you stop by . I love the customer service as well !!!!!!!🩵…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzc3VXQTZRRRAB",
            "text": "Service is great & fast! Food Is tasty & fresh"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdm9DMkhBEAE",
            "text": "Nasty horrendous food, I placed a major order and they missed items AND sent me completely burnt food. I dont know what type of staff is working here. But do NOT order from here. They have no clue what they’re doing. Just tried to call and not one person could give me a response other than “UHHHHHH” like what?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINjhiNjB3RRAB",
            "text": "Absolutely loved the salmon with sweet potato fries! A must try! The owner was very nice and kind. Will definitely go there more often. Thank you for the amazing and extraordinary service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINFpiNTBRRRAB",
            "text": "The food here is amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOHN5QUx3EAE",
            "text": "Everything was over cooked n we spent a good 70.00 for four people n was not that great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcE9LeHVBRRAB",
            "text": "The food tastes amazing and is cooked to order every time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eU9idWRREAE",
            "text": "Great food service I saw it advertised on instagram.A little bit of a wait(30 minutes) but the food ended up amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaHBYOGdBRRAB",
            "text": "I ordered their jerk chicken fries off ubereats and it really hit the spot in terms of my fries and umami craving! Chicken was juicy, crispy in the smoked areas, so so flavourful with the perfect amount of spicy kick. Would definitely order again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaXN2b2hnRRAB",
            "text": "Go there to be greeted by a half awake person that couldn't keep their eyes open nor even respond to take my order. Rang the bell on the counter knocked on the window but the work was so stuck, we had to leave"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6a2FidXlRRRAB",
            "text": "Everytime i get food from here it gets better each time. Always fresh hot and made with love."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqek1TdmdBRRAB",
            "text": "Overall the food was Flavorful and hit the spot however, I was disappointed at the burnt-thin patty burger that my son received, if it wasn't for their homemade sauce and ketchup and my baby saying it's good now mom, we were coming back for a redo! I recommend supporting this black-owned business in the heart of Brownsville, Sutter-Rutland Rd‼️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsX3N6M1dnEAE",
            "text": "I like to start this review by,I love and support local businesses in my community immensely, especially black owned business . Sad to say I received some of the worst customer service at this restaurant. I wasn’t greeted upon entry, more so rushed and told “what you ordering” (not asking my name at any time upon order completion) only to see on my receipt she just put“GLASSES” by a young lady behind the service counter.This after standing & waiting for 5-7 minutes .I believe in pertinence  alongside understanding ,some days may be busier than others . The customer service got worse as I continued to open-minded & patient. I waited (45 minutes for 3 items ) 1-cheeseburger egg roll,1-surf & turf egg roll,1-Honey Garlic wings . I tipped beforehand hoping for a decent experience as done anywhere I try out .I was extremely disappointed in the intentional RUDE and DISRESPECTFUL customer service given by the cashier and food handler “Nusha R”as my receipt posted below.I politely inquired on why the delay for my food ? (AFTER waiting patiently, and understanding food being “Made to order”. I counted 10 UBEREATS orders picked up and 5 orders IN-HOUSE after & receive their food before me.) Nusha R’s response was to the effect of “We got orders before yours, so….”Then rolled her eyes ,turned her back and walked off on me . Horrible customer service. So much more I want to write but this is lengthy already lol . I hope everyone else has a better experience. I’m sad that I was treated so rudely at a restaurant in my community that I was trying to support."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSck1lYXlBRRAB",
            "text": "Maybe they were short staffed when I came however I feel since I called ahead to order I shouldn't be waiting 10-15 minutes for a pickup that's sitting off to the side. However the food was well worth the wait and I'd do it again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaGNDelBBEAE",
            "text": "I did not go into the place I did a delivery and let me tell y’all the food amazing I love it. As can see I have already dug in and it surely wont last. I don’t get food like this unless I cook it and its amazing to find a place like it. Flavor is there and the love is there as well hats off to the chef👏🏾👏🏾👏🏾"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdzZ6eTB3RRAB",
            "text": "FOOD HERE WAS AMAZING!! 10/10 will recommend. I first stopped by because of a tiktok i seen and omg the food was to die for.\nI had the jerk chicken fries and the flavors were immaculate. I also had the buffalo chicken ranch fries and the picture speaks for itself. If your ever thinking about grabbing a quick bite, COME HERE\n\nFOR A MORE IN DEPTH REVIEW, check out my YOUTUBE CHANNEL: Amya Melissa !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlazhYV19BRRAB",
            "text": "Hat off to the chef . So flavorful and good . The food was so good it makes you want to smack ya mama lol .\nVery professional establishments and clean .\nI’m definitely going back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENDdHY2VREAE",
            "text": "I come here almost everyday for their fried egg rolls. They’re GREAT especially the surf & turf ones, highly recommend! The customer service is great as well, sometimes you may wait a few extra mins for your food but it’s worth it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdXRYVzhBRRAB",
            "text": "the $8 burger was smaller than the bun and the chicken sandwich currently has my stomach turning, quick service but i may have chose the worst options food-wise."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWOWVfa0VnEAE",
            "text": "I ordered the surf & turf loaded fries. The flavors of the honey garlic & sweet chili sauce really complement the meal honestly. 10/10 hands down & will be going back again to try the other food items on the menu 👌🏼."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcUplTXN3RRAB",
            "text": "I had the chicken wings - 😋so well seasoned that i even ate the tips!! Fries were delish.  I can't wait to go back to have the salmon.  It looked so good,  but sold out before I could order. I know why there was a line.  I can't wait go back and try everything on the menu!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleTZUaUxnEAE",
            "text": "Stumbled across this spot looking for something for lunch, and let me tell you! Food was absolutely amazing. Ordered the Mac and cheese and chicken sandwich, and both items were the absolute best! The customer service was exceptional! Will absolutely be back to try other items on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWN2FLMThBRRAB",
            "text": "Placed an Uber eats order for bbq bacon ranch & buffalo shrimp. Food tasted so good and big portions. Could not finish at once. Definitely enjoyed it & can’t wait to order again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNDhYVXJnRRAB",
            "text": "This place is such a nice treat! The customer service was excellent. I loved the bacon cheese fries and cheeseburger combo. I also had their fried chicken which was seasoned to perfection. I would return again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMF9uMlFBEAE",
            "text": "First, let’s start with the fact I was greeted when I walked into the establishment. That was a big plus! I had their sweet chili wings which was juicy and tasty….jerk chicken loaded fries was spicy enough to please my taste buds🤤. Will be going back soon for more!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNDRfQ0pREAE",
            "text": "More Than Fries hands Down my new go to spot!!! Literally loved everything!! We ordered The wings, the bacon cheese fries, and the jerk chicken fries, all are to die for! You got a new customer for sure. Can't wait to try other things on the menu!!"
        }
    ],
    "reviews_count": 65
}