{
    "name": "Tropical Taste",
    "place_id": "ChIJUzFzxL1dwokR1ItnGksROVw",
    "grid": "BK17",
    "address": "5403 Church Ave, Brooklyn, NY 11203, USA",
    "rating": 4.3,
    "user_ratings_total": 32,
    "phone_number": "(347) 240-4461",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMlNsZFNNVXhFYzFsRldtTk1WbWx2UzJsb09IYxAB",
            "text": "Only spot near me where you can get  $3 or $5 food and the servings are good for the price. Blessings to the owner for selling good food at a cheap price in these rough times 🙏🏾💪🏾"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVlUyUm9RVXhYVEZCSU5qSldSRXRrTjB4VFowRRAB",
            "text": "We dined in but the music was too loud."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKM1luRk9XSE15Ukc5ZmNHazRORkowTUVsdlduYxAB",
            "text": "Anytime Im in this area, coming here is a must! $3 meals all day is a STEAL. The food is good, the veggies are fresh and it’s never a long wait to be served. The Curry chicken is my favorite but I also enjoy the stew chicken as well. I will definitely be back and I highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMzV2cHRnRRAB",
            "text": "$50-100"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmLXZIQzFRRRAB",
            "text": "The $3 dollar special are still a hit!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENmFhNXhBRRAB",
            "text": "this food is sooooo good. me & my family have been going here for years and know the owner who is so nice. The workers are so kind and just the smell will make your day better. 5 stars for me. :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5bUpQeW1RRRAB",
            "text": "First time trying and most definitely coming back!! They have 3$  special everyday. Food is so delicious and even bought another plate within the next hour. I love it!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsODdxOVJREAE",
            "text": "Food was exceptional ! I’m truly befuddled ! Usually Jamaican restaurants are MID ! This food was bomb ! I had The curry goat with white rice and veg, my boo had jerk chicken, rice and peas with veg. The whole time we are eating we literally kept saying “this is good !” I will be back. Oh and the prices are reasonable as hell! If you’re ever hungry go get you a plate here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNweHRqdDZ3RRAB",
            "text": "Food was Excellent and the Proportions was Great standard size and servings.\nExcellent Location in the busy central Brooklyn area ideal for Catering services and breakfast , lunch , dinner and a great dining experience. Great Spot for Lunch and at a Price that's unmatchable Stop By and check them out I Guranteed you'll Be Back Wanting More because of the Tropical Tates it's an Island Pride.  TROPICAL TASTE."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbXRyWjlRRRAB",
            "text": "Reasonably priced Jamaican food for all appetites.   This eatery has been a constant staple in East Flatbush for decades.\n\nFrom $3:00 plates to all catering needs, Tropical Taste is the ideal Island Ethnic One-Stop shop that will never leave your palet unsatisfied."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMmFiLWZnEAE",
            "text": "They have the best food in town and that $3 special is the best deal in the food catering industry period!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLU4zNm53RRAB",
            "text": "My lunch was $3!! Let me repeat My LUNCH WAS $3!! Oh and the customer service at this place was exceptional. I can’t believe that a Jamaican restaurant is cheap, with tasty meal and good service all in one! Would def recommend having the fry chicken, rice and peas with curry gravy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNnBQODVRRRAB",
            "text": "Great place since"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXN0xQTUxREAE",
            "text": "I’m really concerned because I always eat from this restaurant for the past 2 years and the food I brought yesterday was absolutely disgusting the noddles was soft no flavor a waste of money , the fish was soft and soggy not a crunch to it , It’s always different cooks just a waste of money I will not be coming back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdUkzcEdBEAE",
            "text": "Tasty, home-cooked foods in generous portions.\nA gem."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtc1lha2ZBEAE",
            "text": "**Visited during COVID pandemic\n\nFood/drink\n*Jerk chicken with vegetable lo mein & oxtail gravy - good"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtX0pYTFFnEAE",
            "text": "Reasonable prices, beautiful attendants."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtaEtTaDJRRRAB",
            "text": "No good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bzZuYjhnRRAB",
            "text": "First time trying this establishment. I was on my way to Linda's a couple of doors down across the street but there was a line outside of Linda's so I decided to try this place to pick up some food. The Jamaican older lady behind the counter was a bit on the rough side and winded up fussing with a customer When I added on to my order  she told me I should have said something before (even though she was still putting food into the container for my second order).\nWhen I come to an establishment, I like to at least be treated properly and spoken to nicely especially when I am respectful and decided to patronize your establishment, giving you  money I could have taken to the business down the road. For those on a budget, they have a small $3 container  that you can purchase with rice and peas and a meat of your choice, don't ask for much you might get yelled at. There is no indoor dining. Sadly forget the food, the customer service left a bad taste in my mouth."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bHFIV0NREAE",
            "text": "Best tasting jerk chicken in the world the best the best I'm in love with this place I love their food their food is extremely the best"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxeXFMM0Z3EAE",
            "text": "Great food. Ran into here randomly on my way home. I love the energy and the food is really really good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbEotQUF3EAE",
            "text": "Bought a large curry for $15 and taste wise it wasn’t worth that price."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbGZINTFnRRAB",
            "text": "The $3.00 meals are absolutely delicious & the customer service is always outstanding! One of my favorite restaurants in this area!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcHEzU1BBEAE",
            "text": "Good food great people.. Catch the jerk chicken when it first come out."
        }
    ],
    "reviews_count": 24
}