{
    "name": "Bamboo Walk Caribbean Restaurant",
    "place_id": "ChIJgUNvXv9dwokRKXPry0VbFl0",
    "grid": "BK17",
    "address": "1343 Utica Ave, Brooklyn, NY 11203, USA",
    "rating": 4.5,
    "user_ratings_total": 2393,
    "phone_number": "(718) 369-0001",
    "reviews": [
        {
            "date": "21시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcFdGWnVlbnA1T1dORFlXTnJjelJ6ZHpkSlJFRRAB",
            "text": "I’ll definitely come back!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrNU5qUnFhbGR0ZHpoTldTMVhabWRZWVdKVFkwRRAB",
            "text": "I visited for the first time with my family. We went on a Sunday and ordered from the brunch menu.  The service was exceptional and the server was professional and attentive.  The food was delicious. We ordered curry goat, oxtail with pasta , chicken with French toast, French fries , fried chicken with peas and rice.  I ordered the pork griot and it was so yummy. My daughter ate all the curry got off her plate.  We ordered the fruit punch and it had a fruity refreshing taste.\nWe visited during the evening and the sun was setting. The sun light came through the blinds and cast a beautiful light throughout the restaurant. The restaurant has a beautiful island ambiance with  the bamboo theme throughout . The music selection was family friendly  ( Gregory Isaac’s, old school R&B) and we all enjoyed the music even my 82 year old dad. Kudos to the owners. I wish you all continued success and we will continue to  support your business.  The staff is well trained and professional."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSlozaE1aR1pKYzNSTlNrOVRVRU5GVFU1WlRGRRAB",
            "text": "Absolutely loved it. The attention to detail and service were amazing."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdU1HbHpTbU41TFRGNVRFcDRiMkZLZWtreU1XYxAB",
            "text": "Came here for the first time to celebrate a birthday. The food and atmosphere were excellent. The service was above and beyond. Thoroughly enjoyed"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TVZEbHRUVXBFUTNWalVFcENhRUZGTmtSS1NsRRAB",
            "text": "Selena D made our night so special for my friend 30th birthday. The food was perfect and the service was soooo great. Food came out on time anddd was sooo good. Cone check it out!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMVRHUlRNRXhtTFVac09XdGZXVEpxTVd3dGEwRRAB",
            "text": "The food… AMAZING! Service… fast, friendly, and efficient! We had such an amazing time celebrating my cousin’s birthday. Selena D. Was such a great server. I would definitely recommend this place"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMFgxVjFTREZzTVhSU1prRTBObU00VTJ0RFFsRRAB",
            "text": "Amazing restaurant with delicious food and service!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNd2VFeG1VbGh0WjJ4c2RsVTNkR2xSUXpoUlkzYxAB",
            "text": "Beautiful setting and welcoming people. I’ll definitely come back!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veVEydHFTSEYyUkdoeVZWTlBTRTFNYUVjMVVtYxAB",
            "text": "Everything was a 10/10! Fayeanne our server was amazing and took the best care of us!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSeGJsQnFkRzQxTnpoWVVHSXhkemxRVjBsdlVYYxAB",
            "text": "The time here at Bamboo Walk was exceptional. The food was delicious the service was excellent, thanks to Selena D. The ambiance was beautiful and it was the perfect setting to celebrate our birthdays. Hope to be back soon"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNVlVa3lXVVU1UWxwa1UyaFhYelZ5UzBkd2NXYxAB",
            "text": "Celina D. was an amazing hostess. She made sure we did not feel ignored or abandoned. On a Monday night, the atmosphere was great, the drinks packed a punch, and the food was pretty good. This place is pricy but, I had no problem with the price since I truly enjoyed myself. This has become one of my go to spots for now on!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNlIyRkRSRkp2VUdkWVUxcHhabXBJUkY5RlNYYxAB",
            "text": "The drinks and food were amazing. The croissant bread pudding is something I’m definitely coming back for. Our waitress Selena D. Was amazing and so pleasant. Can’t wait to see her again."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMGNtVm9hVEkyUlROclFrMHhPVUUxYWpKS1pHYxAB",
            "text": "Celeana D is an amazing server."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRVNVUTRYMjk1WTAxZlNEZ3plWEE0WVZRdE1YYxAB",
            "text": "The fish was amazing and bigggg!!!!!!!\nSelina D was very helpful and polite"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUFFWSnNlRGg1TUMxMlZFNWFWbk5SV0hOc1lVRRAB",
            "text": "Beautiful setting and welcoming people. I’ll definitely come back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcGVVWkZSMmN4TnpkUlkybHZSV3hqUkhoRlNFRRAB",
            "text": "Great experience! Friendly staff and a very cozy vibe."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGZmVHbE9UamRZU1Y5bVkwZzVSbmh6VDI1emVHYxAB",
            "text": "This was a wonderful experience from beginning to end! Our server, Fayanne, was such a delight and knowledgeable, and the manager Jermaine was lovely. The food was great and the service impeccable!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVVpWQjRjWEp4YVRKQ2JGOUVMVlZwZFhWWGRIYxAB",
            "text": "Definitely my go to place,my second time celebrating my birthday here and they never miss!!!\nFayanne and Jermaine were exceptional 10/10 recommend 🤩🤩🤩"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRmEyTlJVbDlOVVhOaVVGUjJRblpLU2xaVVQzYxAB",
            "text": "The food was great, and our server, Selina D, was really attentive and made sure we were comfortable! Thank you!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeVExYzVTSEl0VmtadVNHdFFZMFJXVkdoTlpsRRAB",
            "text": "Selena d was amazing"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxc1VHZHRaRWxPVW5vMFdHcHFablI1ZFRaS2MyYxAB",
            "text": "Fayenne was great. Definitely coming back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGZmNuSkhjRzVHVUhVeVZrNXNPVlE0VlRodFFuYxAB",
            "text": "First time here and I love the service. Selena D was our waitress and she made us feel right at home. I appreciated her patience and attentiveness. The food was cooked to perfection as well. I have zero complaints and I will be back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdFltbEdNRzFIYTFoTFRWQkxhVmREWVU1Sk4xRRAB",
            "text": "Very friendly staff (shout out to Selena D) and awesome service"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdGNFZGZOMnhSVWtnMmJ6TkdSbWMzU0cxMFgzYxAB",
            "text": "Personable. Will come again. Fay Anne was great."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTlUxOWFTSGsyYlV0blRXMW5RWHA1VkMxaU9YYxAB",
            "text": "Fayanna and Shaday provided excellent service"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTFNFaDJURlZWVkhWTmRtZzROMFpqZVZwSlJGRRAB",
            "text": "Fayanne was wonderful and very attentive. The food and the vibes were nice, would recommend and would come back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bVdHWm1ORGN3UjNJMVNGOXhTRm96Wm1Gb04zYxAB",
            "text": "Our server Faye was professional and attentive."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oZldYQktNRmhqUnkxS1VWWjZXRlZWYWxCMFRHYxAB",
            "text": "Lovely atmosphere and vibes"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMmRtWnlORU15TUhKR1pEWkdSbWc0WlcxQ2JFRRAB",
            "text": "Shady, was amazing. Such great service!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5bDhqaWdnRRAB",
            "text": "The customer service and the food is amazing! They definitely know how to make you feel special for any celebration and my waiter (Selena D) was very friendly and down for the vibes.  Will definitely be coming back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMlJFdExTMUp4TUdKNlgwcHNiRzVpWkRrdGRXYxAB",
            "text": "Selena D"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bDhpWmZ3EAE",
            "text": "I came with my husband and friends to celebrate an event and everything was perfect! Selena D was so nice and attentive. Food was delicious! It was my 3rd time here and the food and service has always been very good!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMWRHOUtTR3gxVG1Walh6TlRia0ZIVGtoamRsRRAB",
            "text": "I recently had the pleasure of dining at Bamboo Walk, and I cannot rave enough about the incredible experience! From the moment I walked in, the warm and inviting atmosphere made me feel right at home.\n\nThe highlight of my evening was without a doubt the fried goat. Perfectly seasoned and cooked to perfection, it was tender, flavorful, and absolutely unforgettable. Every bite was a delight, and I can confidently say it’s one of the best dishes I’ve ever had.\n\nSelena D. deserves all the praise—her impeccable service, attention to detail, and friendly demeanor elevated the entire experience. She made sure our table felt cared for, offering great recommendations and checking in just the right amount.\n\nBamboo Walk is a must-visit for anyone who loves vibrant flavors and top-notch hospitality. I left with a happy heart, a full stomach, and a strong desire to return soon!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVGFXTjVUV1l0WDFWMGVHeHBTVWx0ZURFd1NsRRAB",
            "text": "I had the absolute pleasure of being helped by Selena D, and I cannot rave enough about the incredible service she provided! From the moment I arrived, Selena greeted me with a warm and genuine smile that instantly put me at ease. She was attentive to every detail, listened carefully to my needs, and went above and beyond to ensure I had the best experience possible. Her professionalism, friendliness, and knowledge truly made my visit unforgettable. Selena’s dedication to making customers feel valued and cared for is unmatched, and I would gladly recommend her to anyone seeking exceptional service!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNM1dFbDVORTlLYzNKRFlYbGtMV3RSTVZKUFVuYxAB",
            "text": "Our server was Zelina D and she was amazing, attentive she made excellent suggestions.  We had the chili shrimp, which was perfection. We also ordered the lamb chops, and jerk salmon. We ordered both medium well. Everything was great! Sorrell on point too."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reVMwWkZiRU5YU214aFFVWlZRa2hmUmxWSlYyYxAB",
            "text": "Our waitress Selena D! Was absolutely amazing! Wonderful experience"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOS2VtMTVWV0ZZU2xZMGNVSjFOMmxzVDFORVJWRRAB",
            "text": "Selena D was amazing!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SR2EyRlRVM1o2WHpkTVdtMHhSRmR4TmxkSk1VRRAB",
            "text": "Excellent Grio 😋.  Selena S. Great waitress.  The overall service was excellent.  The manager Natacha was very accommodating."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aVFsbEpNRVl6UzJKSGRuSndTa2w0Vm5kUVpGRRAB",
            "text": "Selena D was a great server"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeVgyUm9UamxNUlRsRVZYbFpabGc0UTIweVdWRRAB",
            "text": "Selena D was a wonderful server. She did an amazing job"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReE4ySm5XbkpTWTIxSFppMXJjbVJQUTBKbldrRRAB",
            "text": "Selena D., great food and great service I’ll definitely be back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWVExOHRhRTlOVUdSS1VGbGtOVTlrTVZsaWJVRRAB",
            "text": "Selena D. Was incredible she made the experience wonderful for my father’s birthday. Please ask for Selena anytime you come to Bamboo Walk ."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxV2JVeERSMjQzWkdWd1MwSjFSRTVSYkdSMlFVRRAB",
            "text": "I had a wonderful time here. The food is really very good. The service is excellent and the vibes were popping. I will definitely come back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjemNtNUdkWFpLT1UwNFVuWm1VMkZrZFVRMFJYYxAB",
            "text": "We came here to celebrate my cousin’s birthday. Natasha was so professional and friendly. She was engaging, attentive and made suggestions on the menu. As someone who works in customer service, I pay attention to the details and other than the food, the drinks, (which was amazing!!!!) and the atmosphere, Natasha made our visit so much better. Come to Bamboo Walk and get a great Caribbean experience!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OS1NtSXlTbHAzYm5CbGVqTmhXVTlQTFc1Rk5sRRAB",
            "text": "It was my cousin’s bday. We made reservations the day before. Our waiter honestly just didn’t seem like our waiter. Nothing about the service gave we want you to enjoy your birthday & our restaurant. They asked my cousin what type of cake she wanted and attempted to charge her for the bday cake lol. The food was good but overpriced. The crab cakes were small over all good but for the price I expected them to be bigger &/or have more crab meat. I had the Jerk salmon w/ steamed veggies & added black rice instead. My cousin had the lamb chops w/ mash & I think steamed veggies as well. Both really solid dishes. The Red velvet cake wasn’t good at all & I had the Croissant bread pudding it was okay but firm not spoon tender, ice cream was the best part. I ordered my cousin the Bamboo punch & I had the Toasted almond both really good. When I ordered my Lychee martini I waited about 40min for it and it was soooo strong I almost didn’t finish it lol. I’m not sure if they were under staffed but it truly wasn’t that many quest. Upon arrival there was 4 tables with 2-4 guest at each and then our party of 2 followed by a party of 4 for a young child’s bday. They way the table after us was waited on is really honestly the only reason we were able to notify her that we needed something. We found out they had martini specials on Tuesday from the tv screens advertising the business, we found out our waiters name after asking her, just simple info that could’ve been provided at the beginning of our encounter but unfortunately we were robbed of that service because her services was needed else where. Plus it was very ironic that after my cousin left was the only time she was concerned about her. When my cousin came back in she was being xtra friendly by asking us were we Haitian for requesting Busy Signal- happy bday song???    I was in town visiting my cousin for her bday. This was our first time at Bamboo Walk and I wouldn’t suggest dining in especially not for an event or something as special as a bday. Hopefully they work on this, get more staff for better service so that the quantity matches the overall quality."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NM2IwUjFSM2hCWm5kUFFXWnBiMUpCUkZCVFdIYxAB",
            "text": "I was very disappointed with my lunch experience at Bambo Restaurant today. The portion size was shockingly small—just one piece of chicken in the serving. I’ve been a regular supporter of This and businesses, but each time I return, the prices seem to climb higher. The codfish fritters, for example, are now $10 for just four pieces, which feels excessive. Overall, today’s meal was underwhelming and not worth the cost."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSWFqazRhR1Z1YTFsVGRuaFpjbUZrTW1KRk9YYxAB",
            "text": "Impressive from the moment you walk in. Relaxed, elegant, and well-run."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VlRYUXhSV1ZFZFdzMFlWaEdjMDVwZEVaU2JIYxAB",
            "text": "Excellent"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMWRrOXBRbXcwT1ZWMFlYbEdWSFUyYzBKVWMxRRAB",
            "text": "Let me start off by saying the food at this place is excellent,  the atmosphere is great...visited for the second time, 1st visited was a group of 6 and 2nd time my wife and I, both visits we had the same server who claims to be a manager but very confrontational when asked simple menu questions,  thanks to Jermaine who saved us the 1st visit but our visit lastnight we had to ask for her to be replaced and the gentleman (Oneil) who served us lastnight was the best..answered our simple questions and was very attentive.\n\nWe will definitely be back and I have told a few friends about the spot.\nTo the Owner thumbs up because the biggest complaint at Jamaican restaurants is customer service and your staff was on point except for that one person....don't let her give your establishment reviews."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGeVRpMU1aSFZtU1d4TFIyMUhXbE13ZVVwak1HYxAB",
            "text": "Selena D was our waitress and she was so amazing!!!!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MlJqQlNjMHBJZEhobWMwVTJSalp3ZWxwVVdWRRAB",
            "text": "I really enjoyed my visit to the restaurant. I went for my birthday two days ago and enjoyed every moment with my husband and daughter. Mrs. Fayanne is a sweetheart; she treated us very well. We'll definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVmVWTkZRMUIxZEVOYVlsSndUMjQ0YlVOS1VsRRAB",
            "text": "I don’t give 5 stars much, but it’s Bamboo walk!!! Not sure if the owner takes her staff on a customer service retreat but they all greet you with the almost respect and compassion. Not much to say about the scene, you can tell it’s dope from the pictures and the FOOD is great. If I can give 10 stars I would. No other place like it in Brooklyn. It’s like my second home at this point! All the staff are suited and booted (they look really nice), makes you really feel like you are in upscale place.\n\nPro Tip: Try the coconut rum punch and the before meal bread!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOGNhMEtnEAE",
            "text": "I came here to celebrate my son's birthday. I have never been here before, and I must say from the time we walked in until the time we left it was a GREAT experience.  We were greeted by the most pleasant hostess.  The ambiance was so very inviting. Our waitress Natasha was a joy. And when I say the food was DELICIOUS, it is definitely an understatement!  We started off with calamari, sweet chili wings and cod fritters. My son had the surf and turf and it didn't stand a chance. I ordered the steamed snapper, and couldn't finish it. (It was huge,  lunch for tomorrow!) It was a great last minute birthday celebration!\nI will definitely be returning 🥰"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGclZIZHlTMHBIVDBKMmJGZFRWRmREVWtaUWRXYxAB",
            "text": "A Rocky Start, But a Beautiful Comeback!\n\nI celebrated my birthday at Bamboo Walk in March, and while the night didn’t go as planned, what happened after truly won me over. Booking my party was easy—they were flexible with my guest count up until the day before. The space was stunning—lush greenery, gold accents that matched my theme, and perfect dim lighting for photos. They even had an in-house photographer who was so sweet.\n\nUnfortunately, our server that night struggled with our large party. Other tables were served before us, and after 90 minutes, we had only just received our appetizers. It was disappointing, especially since it was my birthday.\n\nBut here’s where Bamboo Walk really shined: the manager Jermaine and the owner Paula personally invited my boyfriend and I back the next day for a complimentary meal. And it was a completely different experience. We were seated right away, greeted warmly by the staff, and our new server was incredible—kind, attentive, and so helpful with food and drink recommendations.\n\nWe loved the sweet chili wings and pepper shrimp appetizers, and both of our entrees—the seafood pasta and oxtail Bamboo Pasta—were delicious and full of flavor. The staff kept our drinks full, checked on us regularly, and even helped shell my lobster tail. To top it off, they surprised me with a slice of birthday cake, sparklers, a group sing-along, and a gifted photo from the photographer.\n\nBamboo Walk turned my birthday around and made me feel so cared for. They’ve definitely earned my loyalty—can’t wait to go back! It’s like family now: sometimes things go wrong, but the love always finds its way back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNFFUUkxWazFPVm1aelpHeEtjMjh6YTJkc1RuYxAB",
            "text": "Great location, food and atmosphere. Everything was good, we attended happy hour and karaoke. After two rum 👊🏽punch, I was show ready.   Don't walk,  run to Bamboo walk❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rek1GTnJaMFJsTTJaR2MycHVjbGhqWlU0NFVrRRAB",
            "text": "Enjoyed my time at Bamboowalk and our server, Selena D was delightful. Selena provided great recommendations for appetizers and entrees and we had the scrumptious Legume and Jerk chicken meals for brunch. The food was well prepared and the presentation was perfect.\n\nMuch gratitude to Selena for being such a wonderful server!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbU9DRjZ3RRAB",
            "text": "This restaurant is an absolute gem! I celebrated my birthday here and it was nothing short of greatness. From the moment you walk in, you're greeted with friendly staff and a cozy, inviting atmosphere. Our server Jackson was great with our group of 7. The food and drinks were good. As a caribbean restaurant which is known for giving bad attitude they exceed our expectations. We also let Natasha the supervisor know they are doing a good job and we will definitely return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWk9VeDZNRzE0TkUxRlEzZFBURmcyV0RoTVNsRRAB",
            "text": "Awful experience and deeply disappointing. I’ve ordered takeout here before and was excited to bring my Haitian friend to what I thought was my favorite Haitian spot. From the start, a photographer pressured us into awkward photos—only to tell us they cost money after.\n\nThen the food: bland black rice, grey frozen veggies smothered in butter, and overpriced mains that were overcooked and under-seasoned. Our untouched plates sat for 20 minutes with no service, no drink refills, no manager.\n\nWhen my friend said the plantains were tasteless, the waitress admitted they were frozen imports, not fresh. Another waiter then called her a liar. Staff throwing each other under the bus, serving frozen food, and ignoring complaints—what kind of restaurant is this?\n\nWe asked for the manager four times—never saw him again. Meanwhile, the 20% auto-gratuity explains why the servers couldn’t care less. Add in the cash-grab tactics (photographer, gratuity, even the “hot towel” gimmick) and it’s clear they’re exploiting customers.\n\nI really want to support Black-owned businesses in my own neighborhood, but it’s hard when I’m treated this poorly. Other reviewers got comped meals after bad service. We got nothing—not even an apology, discount, or solution. Just a long wait for the check after one of the worst dining experiences I’ve ever had.\n\nAlso pretty sure the house rolls are just Hawaiian rolls they slap butter on (but they don’t use salt on the plantains because “people don’t like salt” lol ok)\n\nDidn’t even refill our water ONE TIME.\n\nOverrated. I don’t know how the rating is so high. Must be insanely inconsistent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU01sRjFNakExT0VKeVZIcElabWxvYzB4TVZXYxAB",
            "text": "This was my first time trying this restaurant and I was impressed. The food tasted freshly made and it was flavorful. The veggies were well seasoned which I enjoyed mostly. The food was a 10 out of 10. I would definitely buy again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN05iUUhREAE",
            "text": "I went to bamboo to celebrate my friend birthday and believe me everything was A1….. I love it…. Out server Selena was excellent. My table was OMG but Selena has all the patience in the world and her customer service is fully loaded 100%…. The bartender Melbourne did his thing…. The cocktails reached where it was supposed to reach….. Food was greaaaaatttttttttttt…. We had 7 appetizers, 8 entrees and 10 cocktails and it was worth every dollar spent….. I give everything 10/10 and will definitely be going back here especially for the cocktail."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSb1ExSlhXbUpPVkRkVFFXUjBkMlZOTTI0d2NYYxAB",
            "text": "I brought my mother to this restaurant for our first experience and the level of service we received was empicable. The food was exquisite and the customer service was on point especially with the manager who greeted us after we ate. I definitely recommend everyone to go and make a trip to Bamboo Walk!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcGN1NkR3EAE",
            "text": "Our Experience Was Absolutely Amazing .. We Visited BW on April 2nd 2025 which is our wedding anniversary and I was blown away by the atmosphere… the Caribbean feel ( we are from barbados ) 🇧🇧 … with the twist of being in NYC with the chilly wind etc … we were welcomed by a hostess and ushered to our seating very nicely and met by a very bubbly and fun filled server …. The Food was superb and the cocktails 🍹 omg ! Super colorful and alcohol content was well mixed and on point ! I had a Bamboo Storm ⛈️ ! And to top it off it was karaoke night and the deejay made it known ! He is top tier ! A very irie vibe ! They even sang for us and we danced to our wedding song 🎵… that made my night ! I relived every moment in there !\n\nThe Owner sang like An Angel for us as well and I’m telling you , I had like $1000 in goosebumps .. she can sing ! 🎤 damn !\n\nBamboo Walk Gets My 10 Stars ⭐️ my wife loved it , she is who actually chose the Spot ! Her Choices are Always Great TBH ! Thanks for having us and I’m sure when we are back in NY , We WILL be back !  We love you guys ! Thanks so much for a wonderful night OUT ! LOVE FROM ANDERSON & NICOLE 💋❤️✨💯"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMVdISm1aR1p3YWxaemR6ZzFiazlHTnpFM01rRRAB",
            "text": "Oh my gosh, I had a wonderful time. The vibes were spectacular!!! The food was fire, I had the steak and Sangria. The music was lovely and the services was Chefs KISS! Selina S. was our waitress and she was amazing, so sweet and kind. Thank you Selina!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdVpXaE1kVlpaYVRRek9UbFdiR3h5TkhwRFMyYxAB",
            "text": "I have had the pleasure of visiting this restaurant on two occasions, both of which were exceptional. I first recommended it to a friend for her birthday celebration with our group, and we all had a wonderful experience. She was very pleased with her choice, and I was equally impressed. My satisfaction led me to return with my parents, who flew in from the Caribbean, as well as my children. The staff was warm and welcoming, the ambiance was beautiful, and the food was absolutely delicious. My family and I truly enjoyed our time together and appreciated the outstanding service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbC1PUUdnEAE",
            "text": "Discover the upscale Caribbean vibes at Bamboo Walk!\nLocated on Utica Ave in Brooklyn, Bamboo Walk offers fine dining, cozy cabana settings, a robust takeout menu — and the first-ever Caribbean drive-thru in the Northeast!\nEnjoy outdoor seating, vibrant flavors, and top-tier service (shoutout to Selina for making our night amazing!).\nThe crab cake? Next level.\nThe broiled lobster tail? Absolutely incredible.\nPlanning a party? Bamboo Walk’s private event space and catering services will turn your celebration into an unforgettable Caribbean experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSWVUQk5iSGd6TjAxWWVucGpTa2M0T1ROS1IyYxAB",
            "text": "Celebrated a friend’s birthday at Bamboo Walk. We sat at the bar for a drink while waiting to be seated for dinner. Melbourne mixed lovely drinks and engaged us in a lively conversation. Our server, Selena D.was very attentive. We had curried goat and seafood pasta. Both were delicious with plenty to take home. Selena sang Happy Birthday To You as she brought our sparkling and birthday decorated dessert. We really enjoyed the experience and can’t wait to return"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWS2RUTlJMVkYwZFVwMlRITkJlSGxGVldoR1EyYxAB",
            "text": "From the moment we walked into Bamboo Walk, the atmosphere was warm and inviting, and Selena D. made the entire experience exceptional. She greeted us with a genuine smile and provided attentive, friendly service throughout our visit.\n\nSelena was knowledgeable about the menu, offered great recommendations, and made sure our drinks and meals were always served promptly. Her professionalism and positive attitude really stood out — she checked in just the right amount, making us feel cared for without ever being intrusive.\n\nThe food itself was delicious and beautifully presented, and Selena’s service made it even more enjoyable. It’s rare to find someone who combines efficiency, personality, and true hospitality the way she does.\n\nIf you dine at Bamboo Walk, ask for Selena D. — she truly elevates the dining experience!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seGVGTXpiSEZqVmpRMFZFSjNjaTAyV2xOVFlVRRAB",
            "text": "A Memorable Evening at Bamboo Walk\n⭐⭐⭐⭐⭐\nIf you're looking for an authentic Jamaican dining experience in Brooklyn, Bamboo Walk on Utica Avenue absolutely delivers! I recently took my two favorite cousins here during their visit from out of town, and it turned into one of those evenings we'll be talking about for years to come.\nFrom the moment we walked in, the ambiance set the perfect tone for our reunion. The atmosphere strikes that ideal balance between warm and welcoming, making it feel special enough for a memorable night out while still being comfortable and relaxed.\nThe service truly exceeded our expectations. The staff was attentive, friendly, and made us feel like valued guests throughout the entire meal. They were happy to offer recommendations and made sure we had everything we needed without being intrusive.\nAs for the food – wow! Everything surpassed what we had hoped for. The flavors were bold and authentic, the portions were generous, and each dish was prepared with clear care and attention. Whether you're familiar with Caribbean cuisine or trying it for the first time, you won't be disappointed.\nWhat made this experience truly special was how all these elements came together to create the perfect setting for quality time with family. Bamboo Walk didn't just provide a meal; they helped create a memory. When you're trying to show out-of-town guests the best of Brooklyn, this is exactly the kind of place that makes them understand why you love it here.\nHighly recommend for anyone looking to enjoy great food in a great atmosphere!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UlRWOTBVM2hoZEVjeVlVcExSRzlKVUU1SVRWRRAB",
            "text": "The staff here was so friendly. When my family and I went here on August 21st it was very quiet as it was about 5pm. The photographer took photos of us which were lovely. Staff was very willing to take pics for us prior to that. The food was absolutely delicious and no one had any complaints. They also have parking space at the side of the restaurant if needed! This was my second time here and it was a great experience this time around. Unfortunately the first time with my boyfriend, the hostess there at the time was a little rude however, the rest of the experience was wonderful. Great music, great vibes, great food and drinks. Would definitely come back here again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeFRURXpiRFExVW1wbmRsTnVSMUI0WjA1R1NIYxAB",
            "text": "The food was REALLY good especially the chicken wings and the chicken stir fry!! Jackson was my server and he did an excellent job on meeting my needs. Overall really amazing restaurant and it’s definitely a must if you’re in the area!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcE1HTjd3RRAB",
            "text": "Our experience at Bamboo Walk Restaurant was fantastic! The food was delicious, and the atmosphere was warm and inviting. The waitstaff were incredibly patient, attentive, and accommodating. They went out of their way to make us feel welcome, even offering compliments, which added a personal touch to our visit.\n\nWe especially appreciated how they allowed us to enjoy our time without rushing us, unlike another restaurant we had just visited that imposed a strict time limit. It was refreshing to be able to relax and celebrate my birthday with my girlfriend without any pressure.\n\nOverall, it was a wonderful experience, and I highly recommend Bamboo Walk for anyone looking for great food, a pleasant atmosphere, and excellent service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWE5DMU5WMUpUUjJReFNYTTVVWFJpTFVkMlkwRRAB",
            "text": "On 9/20/25 I celebrated my 55 birthday with friends and family we had an awesome time the food and drinks was delicious a 10 out of 10!!!!! Thank you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNVUzUlJaRE5rU0hNM2VXVm9UVGRYTkdSQkxVRRAB",
            "text": "Bamboo Walk is a gem in our community! GREAT food, SUPERB staff, AMAZING drinks and an overall beautiful ambiance"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWaFptUkRZVzFKTFhSaWVtdzJNbUl4U25CU01YYxAB",
            "text": "I went with a party of 14 and we had a designated menu. Most of us purchased an alcoholic drink, and we were each charged a 20% (insane)tip for the drink which we each paid separately. Then we received the bill for the dinner which was also very high and included a 20% tip. What truly turned me off was they served the two tables with 3 mini baskets of bread. When I asked for more bread so that each person got some the waitress looked at me with her face turned up then came back to say that will be an extra charge (FOR BREAD). I have never!!!! Mind you our bill for the table was almost $2000. They will never see me or my finances again. Honestly the food overall was 7 out of 10 and the presentation was nice. The tables regularly waitress was very pleasant and the man that helped was also wonderful. The other staff helping could have stayed in the back.  Our people need to learn customer service and their businesses may last a bit longer. Goodbye!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndnJ6aVp3EAE",
            "text": "The food was delicious, the atmosphere was great, the drinks were great as well. The food took a min but it was worth the wait plus our waitress was very friendly and helpful!!!\nIt was my first time going there and I will definitely visit again plus the DJ was playing the best music ever \"Soca\"!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNGRpMVpjRFp1WTFOWmJrOHdTRkJwWlZCcWFXYxAB",
            "text": "Selena D was amazing !!!!! My hubby and I came a little early before you guys opened . She nicely opened the door to let us know that you guys will be opening soon. We came back and she was very polite from beginning to end. She consistently checked on us. She offered a hand rag once we were done eating. It smelled so good and was so warm.she even offered to bag our food. Just overall great service ! Amazing job Selena <3"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bE0tc1V3EAE",
            "text": "This was hands down the best Caribbean restaurant I have ever been to. I went there to celebrate my graduation.\n\nWhen you first enter, you are greeted by the staff who are super welcoming and kind. They are respectful and very accommodating.\n\nThe ambiance of the place is really beautiful and the food…the food is just amazing. Everything we had tasted amazing. My mom got the escovitch fish which was humongous and tasty. My grandma and boyfriend had the oxtail which was also amazing. My younger sister had the jerk chicken with festival and she loved it. And I had the pineapple chicken which was well cooked and delicious. We all shared a mac and cheese and I must say, this is the first Jamaican Caribbean restaurant I have been to that makes mac and cheese good. The food did sell off❗️❗️\n\nOur waiters name was Jackson, we called him 6-star Jackson, that’s how amazing our experience once.\n\nLike I mentioned earlier, I was celebrating my graduation. They surprised me with a cake, free of charge, with sparks and played a celebration song for me. This was such a kind gesture."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudmJycjJBRRAB",
            "text": "Top of the line service upon entering the door. Everyone was professionally friendly, the atmosphere was really really great, and the food was amazing. This place shouts 'MUST GO'. For a first time visit, it exceeded our expectations and we'll surely be going back. Tieka was our waitress and she made the vibe a whole lot better with her excellent customer service, warm smile and good energy. Kudos to the staff working that night(10/8/2024)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ScUxXOXZjREZPV201b09FcHBhbmxHY1V0NVlYYxAB",
            "text": "Last weekend was a first for me at Bamboo Walk, and I must say it was an incredible experience. The bartender, Marvis, was professional and polite, and Ophelia was a gem. The employees were attentive, and the music was engaging. A big shoutout to my longtime friend, DJ Les! The overall atmosphere was full of positive vibrations. I'm looking forward to visiting Bamboo again on my next trip to NY in November."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aElieFZREAE",
            "text": "Visited here Saturday evening for an after-gym hang with some friends. We didn’t have any reservations but the TakeOut Manager Tammy really accommodated us and was super attentive and kind. The best part of our night was how she took care of us. Her hospitality is unmatched and she deserves every single raise!! Thank you Tammy! Food and service was great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWE5YQkRRM1pzYjNJdFREbHZkM2hUTkRsT1NIYxAB",
            "text": "Amazing Amazing Amazing!!! Love any excuse to come here! Music always on point, food always delicious and insta-worthy, and staff always takes care of us!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNUppRlZBEAE",
            "text": "Myself and 7 of my friends attended dinner to celebrate my birthday recently. We made reservations for 7:15, however we didn't arrive until about 7:35. We were notified that they only offered valet park for $10. Cool. They were able to set our table and we sat by 8:00. Upon entering, I noticed the ambiance was inviting, room was dim but light enough to create an intimate setting space, and it was packed. To be honest, for a Saturday night, I'd be concerned if it wasn't busy. We were waited on by Janelle, who was sweet and attentive. There was a DJ present playing Caribbean and modern music. He also took song requests as well. I have to say the food, drinks and patron service was top notch. I can't speak on anyone else's experience but I was very pleased that I dined here. To add an extra special touch at the conclusion of our experience, we were given hot hand towels! That was chef's kiss for me. If you're in the area and have a special occasion or choosing where to dine for a date and also want to support a black owned establishment, make your next reservation at Bamboo Walk Caribbean Restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLRFQzNzZGdTR5em53RRAB",
            "text": "My husband and I came here for our 6th year anniversary. We found out about this place on Tik tok. The staff was friendly and the ambiance was pretty. We ordered Blue Hawaiian Cocktail and Hennessy colada. The drinks were good and had a buzz to it. For appetizer, we ordered the Korean BBQ wings. It was delicious! We were served bread as well kinda like Hawaiian bread. Note if you go before 5 pm - you have no choice but to order brunch which we didn’t know in advance. We still were able to pick yummy choices which were curry goat & rice and jerk chicken and rice and peas. The food was flavorful and delicious. The portion for the curry goat could’ve been better for the price though. The bill was decent but they automatically added a 20 percent gratuity for a party of 2. Additionally, we were charged a card fee even though we paid in cash. Overall it was a good experience and we would come back. We look forward to trying their other options on the menu. Shoutout to our waitress Claudette and assisting staff - thank you so much for your good hospitality! Very friendly and professional :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQmVXaGZTM1pOT1VwMmFYZFlOSGRNVEZZMllWRRAB",
            "text": "Fayanne she was an excellent server enjoyed the food  for sure and my drinks great .Big up mtge bartender Melbourne bosss off for drinks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYd3VIbE9REAE",
            "text": "I recently had the pleasure of visiting bamboo walk for an amazing celebratory brunch. This restaurant is a beautiful, the ambiance is romantic and inviting. The customer service is top notch we had several servers that remained attentive to our large group. I really enjoyed the music selection and everything about the setting. The food and drinks were spectacular like literally mouth watering dishes everything I tasted was so good, I want more. There were a few things that I found very unique and delicious such as the shrimp, the bamboo salt fish  roll was a surprise, and the bamboo special ginger cocktail. Thank you Bamboo Walk for such a special experience from food and impeccable service, Cant wait to return!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMmVFMUthelZSVFdKclVERTVkbEkyYldkblRrRRAB",
            "text": "This is my first time coming in person and I was amazed by the ambiance. As soon as you come in the atmosphere is lively and makes you feel like you stepped out of Brooklyn. The staff’s service is A1 and made you feel welcomed. The food was amazing and I will be back. Our server Ms.Selena S. energy and service was beyond superb. If you ever want to unwind with friends/family/coworkers this is the spot. Just make sure you come with an appetite"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReXJ6V3FBRRAB",
            "text": "The waitress was great the food was great. The appetizer portions were very small which was very disappointing especially for the price point .The musical choices was a bit concerning 😟 the dj or whoever put the list together didn't take into consideration the diversity of the diners in the restaurant , when selecting songs please go for the version which excludes the expletives it's a turn off for some of us."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxaFl6aENnEAE",
            "text": "I was very impressed with this restaurant. The staff was welcoming, the venue was well decorated and lit, and the food was very delicious. I see why people have left great reviews and all good things are true. They are doing a great job with the establishment. The only downside are the prices. They charge for everything. We were charged for using our credit cards to pay. We were charged for refills. Cocktails are teenage prices. Im sure they would charge for napkins eventually. So just be aware of that. Great food, great ambience, and great staff but high prices. I would definitely recommend this place, I would also come back…. Just make sure you come with more than enough money, this spot is a splurge. I enjoyed it. We ate good."
        }
    ],
    "reviews_count": 88
}