{
    "name": "Chayse The Flavas",
    "place_id": "ChIJGapLNftdwokRjEIZQt7zTCg",
    "grid": "BK17",
    "address": "508 E 94th St, Brooklyn, NY 11212, USA",
    "rating": 4.8,
    "user_ratings_total": 49,
    "phone_number": "(347) 240-4447",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWU9HVnFaRFZHWWxWclZWZG5OR2g0VlVkR1pXYxAB",
            "text": "I came on two separate occasions the food is delicious. Juicy burgers, great flavors for the wings. Definitely recommend"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVVRqVjZTa0o2Ym5aWWVqQjBjMmxTUVZSTFRHYxAB",
            "text": "Fresh and tasty Flavors is most definitely giving 10/10 the stew chicken is the best I ever had . Chicken sandwich is aslo my favorite fresh and filling 🙌🏽"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSlRWZE5NMVJoZGs1ek4zSmlNbFp5UW1KWVExRRAB",
            "text": "Phenomenal food,Phenomenal service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdFkxSllVMjA1Y2tGSk9GWnBWWGhaWjNkbFdHYxAB",
            "text": "I came because I wanted to try something new, and they gained a returning customer. I got the Shrimp Pasta, it was made fresh and I didn't wait long. Honestly if the food is made fresh I don't mind waiting, but my food was ready in ten minutes. My food was still HOT when I got home, and the customer service was amazing. She's really sweet!\n\nThe pasta is really good! Creamy, the shrimp is flavorful and cooked perfect! They will def, see me again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWlVUWnBYelZ4VlZkTVNGOHhOM2h0WmtGWkxWRRAB",
            "text": "Food is amazing & the customer service is excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeGJ6TTRkRUZqWVdaU1kzUkZSRzFpVm1obVNtYxAB",
            "text": "Menu has a little bit of everything and for this area it’s nice to have a good option that stays open a bit later. Great food & customer service ❣️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeldsRjJhM1ZXVFdSRFpHTjFZVTFPVkc5NFNrRRAB",
            "text": "Omg!!  The food is beyond amazing!  Chayse (the owner) and Latanya are super sweet and very welcoming. The 1st time I came here I had the jerk chicken which was very good. The 2nd time I ordered on Uber Eats and picked up.  The fries are mad good and so is the chicken sandwich.  My goal is to order everything on the menu little by little because ALL the food looks good lol."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeE4zaHplRTFQZFV4Qk5rWk5MVzB3Ym1KMlYyYxAB",
            "text": "10 outta 10 must try again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbVlXUjRWV2gyWlhWMVVEUjVSakJJWjNWVVoyYxAB",
            "text": "Another reason to spend money. Curry goat melts and is absolutely tasty!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RFVFMU9kbWc1TUhKb2RtOXFhekZuTVhkV05rRRAB",
            "text": "Great food and an amazing staff that treats you with care and a smile upon entry. Food is cooked to perfection. Super highly recommend if you’re looking for amazing carribean food at a very reasonable price"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkblVYUndZelpUYUhCQlJUaGpPV3hCWjFFNGFFRRAB",
            "text": "Food is great. Staff well respected wonderful customer service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GU1UyWmtia3hLWWpob1VVaDZWMGhrVUdrNFlXYxAB",
            "text": "What initially started out as a  poor experience turned around to be one of the best customer service experiences I have ever encountered. I placed an order on uber eats for 2 turkey burgers and fries and received an order of stew chicken…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSWVVaHpOMVpaUlRORFJ6ZHpURkJRVldGQlRFRRAB",
            "text": "Good customer service and good food💯"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMFlsUnJaM0I0WVc1V04xRkdiRmxsY0hZeGJHYxAB",
            "text": "Great People & respectful love it here"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKdlJxNXZabGNhbDdRRRAB",
            "text": "cali was a good with her service and making sure my order was well done how i wanted it.they food have lots of flavor and the best thing on there menu was there jerk rasta pasta."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcUM0N2JzcnVMNHZBRRAB",
            "text": "10/10 I've tried the oxtail amd rice and peas a few times. The meat is falling off the bone, the rice can be eaten by itself. This is a must try y'all."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMTDhsWkxYNHE2UWdnRRAB",
            "text": "So first time there , Cali took care of me (yellow bone in the front, great energy ) , I ordered the shrimp pasta ,  grilled shrimp , I was expecting a bit more shrimp came with 5 , waited a while for it I won’t lie but it was good and the chef was nice too , told them to make it with love . As well as a small rice and peas with curry chicken . Taste is good not spicy .  It was getting really busy in the store while I was there . Maybe may need to get more help to keep it flowing smoothly , so they are able to pace them selves and still give great service. Over all it was good , just the wait was a bit too long for me.and that’s the only reason not and it was a bit pricey for what I ordered but still good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOV1BsYW1aaDZlZGpnRRAB",
            "text": "Amazing food !!!! They seriously know how to serve the perfect amount of food. Their portions are huge and well worth the price compared to other restaurants. Their oxtail was to die for. Fall off the bone meat along with steamed veggies that were cooked to perfection. Their Mac and cheese was great!  I am not a fan of jerk chicken but my sister ordered some and I tried a piece since they looked succulent and I was right on the ball. The chicken was so juicy and flavorful I will never have jerk chicken from anywhere else. This was my first time ordering and I can’t wait to see this place in person as my order was through uber eats but the quality was beyond my expectations. I haven’t even tried the burgers yet but they just look so good I mean come on. I’m sure they won’t disappoint. I just had to just to my phone and give the next review first. Now I shall go back to stuffing my face 😂❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKZkF5dDNleEtqc2t3RRAB",
            "text": "I ordered from Uber Eats and called to find out about my order, before I could finish asking a question, the person working there hung up the phone. Customer service is Horrible and the food is Horrible!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaVlXYllnEAE",
            "text": "Beautiful Food That’s Worth The Price It’s Sold At!!! Guarantee That You Will Be Satisfied With The Oxtail, Highly Recommended💯💯💯"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOWNqbm5RRRAB",
            "text": "My daughters loved the burgers. Highly recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc2M2d19RRRAB",
            "text": "Had got the Curry Goat w/ White Rice, definitely a 10/10. Have a different fire flavor 🔥 Staff was also very welcoming and professional, in a clean & nice environment. Will be seeing me often."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMjRHcnpnRRAB",
            "text": "I went to check them out just based on the reviews, and I have to leave one of my own. The people running the place definitely CARE! That part is important! The foooooooooooddddd thooooooooo, taste like somebody lovely grandma in that kitchen, felt like it was made with love fr oxtail falling off the bone, chicken sandwich 10/10, garlic parm wings! My new every day spot! Shout out to the staff!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMWJpT0N3EAE",
            "text": "Incredible. Best fried chicken in town. Jerk shrimp was amazing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc2V6REp3EAE",
            "text": "Sooooo that fried chicken!!!!!\nCrazy crunchy seasoned to perfection!!!!\nChicken sandwich  with cheese aioli everything on it I have not had nothing like it!!\nThis place do chicken RIGHT!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN3VyaFh3EAE",
            "text": "That Reggae Pasta w/Salmon was on the money. You could feel the love in every bite. Highly recommend…."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3b295X21BRRAB",
            "text": "Had the oxtail rice and peas, food tasted amazing and well prepared can’t wait to order again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dDdfVllREAE",
            "text": "Amazing food and customer service!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRaHBDZFBnEAE",
            "text": "This food was so good omg I had the Parmesan fries with the buffalo wings and a chicken taco absolutely amazing everything was seasoned perfectly I ordered online and it arrived fast and hot 10/10 definitely recommend"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNUxhOGdBRRAB",
            "text": "Mac and cheese and oxtail\nThe customer service A1 , i ordered on uber eats, the food was well plated for a take out. Some restaurants can be very sloppy. They even gave me some samples to try my first time, that’s why i went with the MAC! Love it here! they pay attention to details!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNUtxd1p3EAE",
            "text": "Mannnnn if I could rate this more stars I would, I’m not even a review kind of person, but. Yoo yall doing yall thing! And the little note on my bag made me feel real appreciate, I wish this business tons of success! Mac and cheese is EVERYTHINGGGGG"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNTlXMmp3RRAB",
            "text": "Food amazinggggg!!!!!! and the person behind the counter so personable! My new neighborhood gem! everybody there make you feel like family, I will definitely be back GET THE PASTA WITH SALMON OR THE CHICKEN TACOOOOOOSS , wish I can give you guys 1000 stars"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbE83cTJRRRAB",
            "text": "I stopped here on my trip to NY because my friend recommended it. The food was so delicious. I got the salmon pasta and a stew chicken meal and they were both packed with flavor. I will definitely be going back to try other dishes when i’m in town. Oh and I must say that the employees were very nice and offered great customer service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBM01hSklREAE",
            "text": "Listen when I tell you I was not disappointed at all everything was 10/10 from the food to the customer service everthing was just what I expected I will be going back and that curry was really the deal breaker for me"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBazZhUm93RRAB",
            "text": "Shout out to the chef! This spot hasn't missed yet, the curry chicken is so authentic and tasty. And the guava wings are my fave! Definitely a lovely twist on one of the best carribean flavors! The staff and owner are very nice and the vibe is def there! Def a great spot to check out for some quick eats and everything always FRESH!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMHZDbEVBEAE",
            "text": "Third time eating from this restaurant and it never fails… keeps getting better 10/10 chicken pasta 10/10 sweet chili shrimp pasta 10/10 no dry pasta at this restaurant fresh and hot 🤞🏽the workers are extremely sweet"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcC12Q2d3RRAB",
            "text": "I ordered the lemon pepper wings, oxtail taco and shrimp tacos and everything was a 10/10 and I’m very picky with food. It was delicious I will def be back during the week for my lunches."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NC1PVndBRRAB",
            "text": "Best tacos in Brooklyn hands down"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aWNlMEN3EAE",
            "text": "My kids and I went here on a rainy night. It was our first time there. We were greeted and they clearly explained different ways I can view the menu. We had the grilled chicken Rasta pasta and oxtail tacos. The food was delicious!!! The tacos can be bigger but the taste omg, flavorful. The serving amount for the pasta was moderate. Prices weren’t bad neither. I recommend trying them out!! Definitely worth it! Happy holidays"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdElYYWN3EAE",
            "text": "Flavor of the food was great, customer service was also great and the food didn't take long at all.\nPanamá!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdE5HaktBEAE",
            "text": "Food was great it had enough spice to it 10/10 full of flavor"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaGQyZ3RnRRAB",
            "text": "The food was fantastic and phenomenal, spicy just like I like and flavorful just like I like. Service with a smile and super great energy. Looking forward to another visit….thank you. I was so hungry I forgot to take a picture, well after the first bite, how could, food was too good!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaGFpNGRREAE",
            "text": "Chayse the Flava did not disappoint!\nThe pasta was amazing-rich, flavorful, and perfectly cooked. The wings were equally impressive, mouthwatering flavor. Highly recommend for anyone craving delicious food!"
        }
    ],
    "reviews_count": 43
}