{
    "name": "Sea Kings Steam and Fry Seafood Inc",
    "place_id": "ChIJUxzecINcwokR6_N7t5fEWK8",
    "grid": "BK17",
    "address": "519 Utica Ave, Brooklyn, NY 11203, USA",
    "rating": 4.4,
    "user_ratings_total": 1007,
    "phone_number": "(718) 484-4444",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbFgxTk5MVXhCZVRVMFdVZzVjSGxaZVdRMFZGRRAB",
            "text": "Place is good HOWEVER … it never opens on time … like it supposed to be open at 10 am I sent someone there at 10:30am the place was open but once again they were sent back and asked to return in a hour as they were setting up ….. unprofessional"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wekxVbzVaazE0VVdoV2N6bFFhR0UwTjFseGNIYxAB",
            "text": "Definitely am a repeat customer the flavors of the food, the freshness, and the prices are definitely unmatched! I came as they were closing and they opened for me to get a late night/last minute meal, it was truly appreciated and they will continue to get my business for as long as I’m in Brooklyn."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMlIwRnFWSFJ0UkdKRk56VmZZVWxCYzBaMFRtYxAB",
            "text": "The food here is very good and healthy, but the service is absolutely horrible. Every time I order through Uber Eats, important items are left behind at the store. At first, I had to pay again for redelivery, but even after calling the restaurant directly and asking for my order to be completed, the missing items were still not delivered.\n\nHalf the order is usually missing — especially drinks — and it’s gotten to the point where I have to question if this is being done deliberately to short customers. This has happened seven times now, which is unacceptable.\n\nThe manager, Amerie, and the workers Shelly and Bianca need to take responsibility. In 2025, no one has money to waste on paying for double deliveries or incomplete orders. Unless this restaurant starts hiring people who can carefully read and fulfill orders correctly, it will not be able to continue operating successfully.\n\nIt’s a shame, because the food is excellent, but the constant mistakes and lack of accountability in service ruin the experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NVJqUm5Rak5oVldwcWN6QmtTbkZEV2xGNFZrRRAB",
            "text": "I order online with the DoorDash app and the wait was so long 40 minute plus they have to care about online costumer"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReGRsTk5OVWs0ZEhwSFVEQlNWVEZtT0hwTGRrRRAB",
            "text": "love it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNU1rcEVSMlJwYTNnMlJXd3llVE13V21KNFQwRRAB",
            "text": "Live this place!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNGFtWlFkMEZLVkdsT1VrcHhNSFZOVGpaZlZYYxAB",
            "text": "Amazing store I was going to sea kings when they 1st open on remsen & church av & when they move to  Utica i follow and I knew one of the owners way back when he had his phone store on Ave d and Utica   Sea kings have the best steam food in bk all thanks to Jonny one of the chefs at sea kings if u ever go there. Have to go in the day time so Jonny can make ur food it’s the best you’ll ever taste. Yea Mon sea kings big wanna self"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMExUQmtkRTlEVm5JNGRVcGpVVWxzWkc4eFEyYxAB",
            "text": "Great Vybz"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOM2kyWVh5cDllOVZREAE",
            "text": "They food is always on point very fresh and very delicious it’s a must have me and family always treat ourselves. Me and my girls always go crazy for the crab and my husband love the salmon."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbjV5djI3akx5NDd3RRAB",
            "text": "Sea Kings Steam & Fry is a hidden gem! Super clean environment, excellent customer service from the lady at the register to the chefs, and the food is consistently fresh and flavorful. They cook everything to order, and you can taste the difference.\n\nThe seafood variety is amazing—tilapia, salmon, lobster, catfish, porgy, red snapper, and shrimp—all seasoned just right. They also offer a full spread of fresh vegetables, empanadas, tacos, and a wide selection of combos that let you mix it up just how you like.\n\nI love that you can see them cook your food right in front of you—it’s hot, fresh, and full of flavor. Whether you're craving fried, grilled, or something in between, Seafood Spotter delivers every time. Highly recommend for any seafood lover looking for quality and variety."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKTDd4X3VqNTY3QUdREAE",
            "text": "Larger location needed"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ2drTzNvN1plMUpREAE",
            "text": "First time here , nice food and woman has good manners ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQYVJnWmpvNi1TWHpnRRAB",
            "text": "Ordered food but my receipt said I purchased salmon when I purchased snapper. Closed Sunday"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMDVXNjFnRRAB",
            "text": "Food was great a little bit of a wait time, but staff is very nice and they are a black owned family business! My first time visiting, but I will be back! (This is the Pennsylvania Avenue location by the way)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRX0lxa3hnRRAB",
            "text": "Very bad experience and disgusting service"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX0pQd1FBEAE",
            "text": "If you are looking for fresh fish, you will probably find it."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncThQb05nEAE",
            "text": "Great food here, with great customer service 👍🏿 I will recommend to a friend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMzVtaWNREAE",
            "text": "Sea kings on Utica not only has arguably the best sea food in Brooklyn but also their customer service is top tier."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaTczSUtnEAE",
            "text": "I went there today and the black West Indian old man  there was awful. There was a very nice lady there and that was about it. I ordered a sandwich and stepped out for about 10 minutes and came back and he still didn’t make it by then. I feel bad that the Lady has to work with him. He is very rude didn’t even address me as a proper customer. He nodded me off to speak to the woman and couldn’t even give her a time estimate for the sandwich. I would not recommend going to this place."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncmRpMUh3EAE",
            "text": "Ms.Sonya sitting in her car starving food is clean n light n I got fried withing fried calamari steam yams clean not heavy soaked in oil price affordable.They even got the eskovitch seasoning prep in the jar wooooah good price !!!! I gotta get mines b4 it goes up🤣🤣🤣🤣"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnek96THF3RRAB",
            "text": "Top shelf service. Unsuspecting little spot. Food and hospitality are on point. Grab and go but worth it so I could home and dig in! Pick, cook, eat. Divine. Thank you!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcm96eXZ3RRAB",
            "text": "Easily accessible location. At times the location is super-busy. The staff is very courteous and friendly. The workers establish rapport with the customers and are a pleasure to interact with.  Shout out to Ms. Amarie, Mr. Johnny and other staff."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMGFmbHZnRRAB",
            "text": "Friendly staff. Excellent food."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeHZtUWtnRRAB",
            "text": "I’ve ordered from this restaurant at least four times each time it was a delivery the first time everything was fine,the second time I ordered crab cakes among other dishes ,and they didn’t send the crab cakes. Third time they said substituted a  dish that I didn’t ask for the fourth time I ordered lobster tails, and plantains 7 ounce lobster tail didn’t look 7 ounces although it did taste OK. However, they put the plantains in the same plastic bag with all the juices from the lobster tail so they were wet and soggy. The grilled corn was burnt, and the crabcakes were too hard to eat. It seems the more money I spent the worst the order got.I put notes in capital letters and they ignored them.  They refused to send tartar sauce  and other condiments on all occasions.Will never order from them again.and they don’t even answer the phone when you call to tell them about it."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQX1liT1RBEAE",
            "text": "I have been going to sea kings for years and never had a complaint…the owner is also welcoming and helpful 😊 as it’s the holiday season I was shopping around for some fresh seafood and didn’t realize that you had the option to purchase their fresh seafood uncooked….WELL NOW YOU KNOW….yes instead of going to the fish market, just get it from here 😝 and grab a soup while ur waiting for it to get cleaned"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdll5V2h3RRAB",
            "text": "So they just opened on Pennsylvania ave in Bk....    The food was AMAZING!!!!  I Got the fried escovich fish along with a bag of sauteed vegetables. This place is amazing. I give it a 10 out of 10. Keep up the good work and you will always have my business. And I am a chef myself 10 out of 10"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMmZmLWJBEAE",
            "text": "It'd the best tasting, very well seasoned food I've tasted in the whole of Brooklyn..My go to place everytime I visit NY, great service and friendly faces everytime..I give it 110% out of 100"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcExHUnJBRRAB",
            "text": "This place is extremely slowwww. Pleas know u going to be waiting forever. Took  20mins to get my fish clean than 50mins to steam which only took 25 to cook"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOC1qcGh3RRAB",
            "text": "Called in order upon leaving work, and order was ready shortly upon my arrival. Patron Amarie apologized for the delay. The wait was worth it, prepared just the way I wanted it. Mild spicy, tasty, portions were just right. Sorry guys upon finishing I remembered I should have uploaded the photo's.Looked and smelled so good just could not wait to jump in and devour."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaVlDTnJ3RRAB",
            "text": "This is my favorite seafood spot. I go here basically every Sunday that I can after church!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucDhYYW9BRRAB",
            "text": "Really the best steamed seafood ever in Brooklyn with a sweet Caribbean twist from salmon dinners to the condiments are paired so perfectly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueXNpQkFnEAE",
            "text": "Searching for a conch meal all over Connecticut and coming up empty handed, I decided to take the trip to the land of variety. Brooklyn NY it was. Got down to Utica ave and came across the little gem. At first, I was a little confused with the layout of fresh seafood under layers of ice to maintain freshness. “Is this a restaurant?” I asked myself. Finally I was approached by the lady behind the counter, who later introduced herself, Amarie. She handed us a bowl like basket to gather our fresh seafood. Again, confused I said, “I’m looking for cooked food, not raw seafood, conch to be exact.” She gave us this look of uncertainty until I said that this was our first time here and wasn’t sure how to go about ordering. Amazed she said ‘oh gotcha, let me show you’, and proceeded to guide us through the process. So, you’re given a bowl like basket to select all your fresh seafood from a variety of choices from conch, shrimp, different fish, lobster, crab legs, clams and more, then you select your greens (okra, onions, peppers, potato, plantains etc) to complete your meal. You then take your selections to a counter to have thoroughly cleaned and chopped, then over to another counter to be cooked right there on the spot to your liking of mild, half mild/half spicy or full spicy. You also have the option to have it prepared fried, steamed, Thai style, jerk, grilled, roasted and more. My choice for the conch, scallops, calamari, lobster tail, with a variety of greens, was to have it steamed. After a reasonable wait to be prepared by a very friendly chef, I have to say, it was heaven on a platter. Couldn’t wait, so I sat right in my vehicle before taking the long drive back to CT and completely delve into a slice of heaven. Steamed to perfection with a hint of spiciness, and topped off with a bottle of amazing soursop.\nCouldn’t have made a better decision to fulfill my sudden urge and craving for conch lol. Sea King did it for me. Head down to Sea King to see Amarie and staff for an experience like no other.\n\nSidenote; unfortunately there isn’t onsite dining, but honestly, I don’t think you’d want to wait an extended period to be seated because those revolving doors never stopped."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuc05xMFRREAE",
            "text": "This is this is the best fish spot in Brooklyn and Amarie is very pleasant and treats you like family. 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdWFfMWpRRRAB",
            "text": "Quick service .. warm greeting from Amarie , very politely and welcoming"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdDlhVmF3EAE",
            "text": "Great flavor and service also very clean oh and the fish soup is yummy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIazYyazlnRRAB",
            "text": "OMG Sea King Resturant provides the best sea food ever. On a weekly basis I have to return for the fry fish and sweet potato fries. It is finger licking good. Also, there Sea King Combo is to die for. The chef does a great job. But most of all Amarie as the cashier makes every customer feels welcome and guide them through the process. I am spoiled so I call in my order and it is ready in a timely manner. As I said before this is the best place for seafood. They are professional and the atmosphere is welcoming and the facility is clean. Everyone should visit Sea King on Utica, Brooklyn New York."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaFpTek1REAE",
            "text": "The pictures says it all💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIenREWm5BRRAB",
            "text": "Great customer service and the food is great"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0MDcyTEFnEAE",
            "text": "Amarie was so amazing (as always), and got my order placed immediately on walk in! I always know where to come for the freshest seafood and the most tasty steamed meals 😋😋😋"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXNGFmS1BnEAE",
            "text": "A seafood restaurant that I highly recommend. It consistently delivers fresh and delicious seafood dishes, ensuring a satisfying dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aHFESEdREAE",
            "text": "The layout flows poorly. Walking back and forth. The where you take the food to be cooked is an even more awkward perch where you can be easily missed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NnB6Zk5REAE",
            "text": "Very nice custom service , the store is neat and clean & the food is great !!! Amarie was very attentive & kind"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidnMyMUVnEAE",
            "text": "Customer service by Ms. Amarie was excellent, very attentive and professionalism. Was highly recommended by a friend and was not disappointed. Amarillo deserved a Raised please. ☺️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiclAzZWxBRRAB",
            "text": "The food & service at Sea Kings is exceptional!! I love coming weekly for my steam fish & okra. Ann Marie is such a sweetheart at the register. She always greets me with a warm smile & kindness."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaS1pbXJBRRAB",
            "text": "Best steam fish in Brooklyn!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNGJLU3FRRRAB",
            "text": "Very nice seafood spot seafood is fresh it’s clean and very well seasoned, pricing is moderate I travel from queens just to eat here give them a try some meals are prepackaged making it even easier to get a one meal and go give them a try everyone is polite and it takes 20 min to get your food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyd09XZ053EAE",
            "text": "I remember I used to order from this place every week. They have fell off quite a bit. Truthfully they need to fall off the edge of a cliff. My regular meal was steam fish with veggies. My most recent experience I received 2 pieces of broccoli, 2 corn, and one piece of sweet potato. I was so confused. For $30 the size of the fish was big enough to feed a toddler. Horrible!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdjVqaG1nRRAB",
            "text": "Sea Kings on Utica offers a delightful takeout experience that seafood enthusiasts won’t want to miss. Despite being a takeout-focused establishment, the atmosphere is welcoming and well-organized, ensuring a smooth and pleasant ordering process.\n\nA standout feature at Sea Kings is the ability to customize your meal with a wide selection of fresh seafood and vegetables. Each order is made to order, allowing for a personalized touch that ensures every dish meets your specific preferences.\n\nBe warned: if you sample their soup, you’ll likely end up taking a full bowl home. The soup is expertly crafted, bursting with rich flavors that are simply irresistible.\n\nIn summary, Sea Kings on Utica is a top choice for anyone looking to enjoy fresh, customized seafood dishes. The combination of high-quality ingredients and attentive preparation makes it a standout option for takeout dining."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMMzliYjhBRRAB",
            "text": "I always get cold seafood and it's always fresh and looks clean"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNTZ6VEFREAE",
            "text": "Every week I go to sea king Ms Amrie is always make sure she’s of great help. I definitely always look forward to seeing her. Thank you 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUanR5djhBRRAB",
            "text": "Hi! My name is Courtney & I have been coming to Sea Kings since they opened! It is a family business and everyone has so much respect! Chef JOHNNY IS THE BEST- My food is always WELL seasoned with love, not over cooked or under cooked and overall tasty. I love Chef Johnny! Thank you for cooking with so much love!\nPS: Get the Red snapper! Tell them Courtney sent you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwOVpIWU1nEAE",
            "text": "My first time going there with my wife and let just say the place is a vibe. Excellent customer service from Amarie. Maya had assistance us and showed us the different type of seafood and sides they have in store. First you pick your seafoond (they have everything) pay, wash and bring it to the chef to cook it to your liking. I love this place and my food. The parking lot was a vibe as well just playing music and vibing. I will most definitely be back soon. 🫶🏽🫶🏽🫶🏽"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0OUxmTk1nEAE",
            "text": "I was craving some seafood,  deciding to give them a try. I'm not disappointed at all. You can either choose combo already packed and asked them to cook it for you or good pick whatever you feel like. Each have their own price either per…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNEp2UTVnRRAB",
            "text": "They food is so good and flavorful plus the store is very clean and they have everything organized well and they packed my order in a aluminum container and I took it home to far Rockaway and it was still hot and fresh great job 💜oh the young lady was so sweet and respectful"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdDc3cVRnEAE",
            "text": "STOP going to your usual steam seafood restaurant , this is where you need to be going you won’t ever be disappointed!!! The food is amazing and flavorful down to the service and friendly staffs I love it! Never fails me come get you some ! Big to my girl  Amarie best customer service ever real B0$$ lady"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5NHFLRjRnRRAB",
            "text": "Everything was amazing except for my experience with their delivery, which according to reviews both here and on Yelp seems to be a common issue.\n\nI placed an order on Ubereats around 8pm and my food didn't arrive until 10. A driver was paired with the order around 8:30 I assume because at 8:45 he was already at the restaurant waiting to pick it up. But at 9pm the driver was unpaired from the order and Uber sent me a notification saying the order was going to be late due to a delay in finding a driver. That obviously confused me because the driver had already been there for quite some time waiting for the order so I contacted support. They told me the driver left because the line inside was incredibly long and my food had yet to be prepared. It wasn't until around 9:30 that another driver was paired and arrived at the restaurant. Another 10 minutes of him waiting went by so I decided to call the restaurant myself to see what the holdup was. Apparently my order had JUST started to be prepared, 1.5 hours after the order was confirmed. 15 minutes later the order was on the way, thank God the driver didnt leave because I probably would've been eating at midnight.\n\nBesides all that mess, the food was very, very good. Still very hot when it arrived, salmon was tender, shrimp were perfectly cooked and cleaned, potatoes and corn on point, everything wonderfully seasoned to perfection. I would've liked the broccoli to have a little more crunch but they steamed everything together so I understood. I just hope that they see what people are saying in regards to their delivery times and make a change. The man I spoke with said verbatim that they had tons of orders coming in along with walk ins which is why my order was prepared an hour and a half after it coming into their system. If y'all are slammed, stop taking orders until you're caught up. People will understand. I beg of y'all to work on that cause you're missing out on great reviews for things that have nothing to do with the amazing quality of your food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMk92cDF3RRAB",
            "text": "The food at Sea Kings is always fresh the level of professionalism is unparalleled and you can count on that amazing consistency that is associated with the sea kings name. Annmarie is amazing she always puts a smile on your face.  If you want amazing sea food with a Caribbean flare look no further."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVM0xtT1N3EAE",
            "text": "Most amazing soup and lobster tacos.  Service is incredible. The lady, Amarie,in the front was pleasant and made an excellent suggestion."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURleXIyaDhBRRAB",
            "text": "Where to begin…every worker inside the place that I encounter with the exception of the cashier was rude and had zero and I do mean ZERO customer service. I paid for about $60 worth of food to get home and see that one of my crab clusters was missing from my order and my food was literally thrown into the container. I called back to inform them of the mishap and got met with so much more rudeness that I didn’t even bother to go back! It was suggested that I come back the next day to speak to a manager at 12pm… as if they were already closed or as if my personal and work day revolve  around management smh. Additionally the food was over cooked, my nice Peice  of salmon was all flipped over and broken up, and whichever Cajun/seafood seasoning they use has a very high salt content."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMDZMckNREAE",
            "text": "Love this place and the service!\nThe cashier Amarie is always nice! And the cook seasons everything AMAZINGLY!!!\n\nOhh && They Have Parking!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLeklqOE5nEAE",
            "text": "Omg!! I really love this place, my family and I had this particular place we used to go, and on a Sunday it was closed, thanks to Google maps we found this spot and we've been there two times in less than a week, we love it. The food is sooo good!!\n\nAnd the employees are amazing, very good service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MXZYR0JREAE",
            "text": "Wouldn’t know how the food taste cause the chef slow as hell. I had to take the raw food to go cause I ordered at 12:29 and at 12:50 he still didn’t start making it smh sometimes it doesn’t make sense to support black businesses I’m going home to cook for myself never again!!! Not even the fried crab sticks was done"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaHJyV1ZREAE",
            "text": "The staff is extremely friendly and attentive you are acknowledged from the time you walk in until you leave , the food is amazing because it we’ll season and great flavored"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMnRfby1nRRAB",
            "text": "Been here a few times and always get good seafood, good service and at a good price! Shoutout to Amarie for being so pleasant at the register."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdU1HLTBRRRAB",
            "text": "Can’t wait to get another amazing meal from Seakings on Utica Ave.\nThe price is always right the food is always delicious."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtLUotNGlRRRAB",
            "text": "Hands down the best seafood spot in Brooklyn! I come here all the time and it’s still the same always how you order and expect it!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwN0w3TGR3EAE",
            "text": "Amarie and Johnny great service and the bests sea food in Brooklyn. Every day fresh and full of flavor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURObVppdzJBRRAB",
            "text": "Very friendly place, the food is great an I love the cashier Amarie … thumbs up 👍🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROeDl6T2pRRRAB",
            "text": "Amarie Very pleasant polite good customer service keep her she's a good asset to your business! I came in early and she ask if I wanted to try soup and I did. It was amazing. So I ordered some. The food is amazing and seasoned well"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0MzlyRXNBRRAB",
            "text": "My experience was the best. I always order online but i came in store tonight and I must say I’m very happy I did. Amarie is the best! Keep her ! Her customer service is A1. Also Shevaun was very helpful in helping us choose our food. You have a great team. Thank you and keep up the good work. Can’t wait to come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMS0taFBREAE",
            "text": "Customer service is A++, however the prices can be adjusted a bit more. If the shop is full, there is nowhere to wait except in the sun. The food was not flavorful. I love seafood and it is sad that I have eaten better from the Asian stores. It seems to be black-owned and I love supporting us. Please work on the flavors."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMGNDdGZREAE",
            "text": "I ordered through Uber eats and I usually have low expectations from Uber eats orders but this less spectacular! I ordered the steam basa combo with a side of creamy garlic and I was very happy with what I got. Food was hot and nice and very tasty! Will definitely give it another try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NzZLWjZ3RRAB",
            "text": "This seafood place is real good!! Everything is super tasty and well seasoned! Amarie is the best! Always offering the best service, fast and efficient!! Props to the chef Johnny! Food always delicious!\nThey know their stuff! A Must try!! We'll keep you coming every week!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bE15b0VnEAE",
            "text": "I really loved it here, they're amazing and all so sweet I even met the owner she's so inspiring. This was my first time trying Jamaican food and they didn't disappoint😍🤍😄we love Amarie"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MV9iaDBBRRAB",
            "text": "I've been coming to this establishment from since the first day they opened.  One of my #1 seafood places in Brooklyn hands down. The staff there are very pleasant an friendly .  The seasonings is always on point  food is always well cooked…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0MUkzRy1BRRAB",
            "text": "Amazing seafood spot. It’s  my weekly go to place.  The food is Tasty, well seasoned and fresh. Chef Johnny,  is a force to be reckoned with. Amarie and the whole entire staff are amazing, friendly and welcoming. Good Food, Good Service and Good people, a combination no one can beat."
        }
    ],
    "reviews_count": 76
}