{
    "name": "Kaizen_Omakase & Hand Roll Sushi Restaurant",
    "place_id": "ChIJW2b2LhlhwokRfix8u5jWof8",
    "grid": "QN7",
    "address": "33-70 Farrington St, Queens, NY 11354, USA",
    "rating": 4.6,
    "user_ratings_total": 724,
    "phone_number": "(718) 971-2413",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwM1kzSm1WWEJVTjB0UVZqVTBlazlTWmxoV1ZuYxAB",
            "text": "A great spot for a business lunch if you happen to be in Flushing.  They have some traditional sashimi as well as various options for hand rolls."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNk5rRkZVMVl3WmpCMVNXZEVibkppYzNwNFFrRRAB",
            "text": "Awful!!\nI knew I was in trouble when the Sushi \" Chef \" tried to convince me the Soft shell crab was fresh , in November!!!\nHaha 🤣\n\"I get it right across the street- they keep it at 40*\" he said.\nJust awful. Enough said."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWlpEaHlUak01UjBwU05sb3pXRWx6ZGtaWmIzYxAB",
            "text": "Dear Kaizen,\n\nMy wife and I chose Kaizen for our wedding anniversary this year due to our shared love of Omakase, and living together in Flushing for fifteen years. We'd been before, sitting at the bar, and had an incredible time. The chef's attention to detail along with the fun atmosphere and kind staff were all we needed to convince us to bring our parents here for our shared big day.\n\nWhile as a couple our experience was lovely, bringing our parents there proved to be a mistake. We sat at a booth due to my mother-in-laws mobility issues due to her Parkinson's,  and the five of us (my wife, myself, my sister-in-law, father-in-law, & mother-in-law) ordered the 6 course Omakase with each of us getting one or two add ones. The first course was served delicately, and we all sipped our little soups with joy. My parents had never experienced Omakase, and it was important for me to have them savior each dish distinctly for its own special flavors.\n\nAfter our first dish we were informed that our sake pairing would be sped up & my wife and I agreed. Next, instead of the next plated dish, we were served all five courses on a single dish without any of the accompaniments. I was embarrassed on behalf of my family, as one is easy to recognize when a restaurant wants people to leave as fast as possible. This was meant to be a paced, slow, family dinner where we talked about our accomplishments and celebrated each other. Instead, we were rushed when the place was not busy. I appreciated the manager coming to us at the end and asking if everything was ok, but being polite I just thanked him.\n\nIn the future, if you provide Omakase at booths, provide the experience, or don't offer it."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRmNHOXhORFV0T1dWd1R6VlJVMU5QWlVSWWVWRRAB",
            "text": "came with my girls and had a great time, amazing food and customer service 🤍🤍🤍"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UmNVTlBOWGxqUW1oUFZVRk5ZeTFYUTBoc1UzYxAB",
            "text": "Terry our server was awesome! Great food and service. The experience was great! Must try for sushi!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5eFIyMXBSbU0wY2pGV2IzRkhUVkF5WTIweWRtYxAB",
            "text": "Had an amazing experience at Kaizen! Our server Terry was absolutely incredible super attentive, friendly and made the night so much better. His recommendations were top notch and everything he suggested hit the spot. Definitely coming back soon and asking for Terry."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xV2N6VnVWbWxTU1V3dGNUTkVNVGRYUkdsblVXYxAB",
            "text": "Yudda was amazing! Great food and customer service, thank you for a wonderful night!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWVJYRmxiRFF4ZERaamVGTklaV1F0YUU5RldtYxAB",
            "text": "The food is excellent. Monday through Thursday Happy Specials are an amazing deal. Select hand rolls for $5? Heck yes. I think I had 5 and between that and an app, I was full. Great value. And the atmosphere is delightful, too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdk1scG1WMlJwZUhVelZsWTVWbU50VG1Oc1FVRRAB",
            "text": "I like to go to omakase for special occasions so I've been to a lot. This place is in my top favorites. The chef creates unique flavors that will surprise and delight your taste buds.  If you're tired of omakase that always tastes the same, try going here for a nice change."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V1N6azNjSEZQZWpGQ1F6WndaM1pETVROalExRRAB",
            "text": "Sunny and Serena are great. The food was awesome and the service was even better."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nM1dpMXhlRzV6VW1Sbk5UWjJTSGsyZG05WWVXYxAB",
            "text": "I have never been a hand roll sushi person. Until today. It was a delightful treat to try sushi a new way. I had one classic and two signature options. I really liked them all. Service was fantastic and the atmosphere was calming with a modern but beautiful aesthetic."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WR1N6ZHphbkphWVhCZlVVSmZOR1JqVWtweFdYYxAB",
            "text": "We have been going to Kaizen twice a year as we travel through NYC for several years and regret that our most recent experience may be our last. This restaurant was even one of the main reasons we would stay in the adjoining hotel. The food is exceptional, and we always treat ourselves to top tier items, but our server this time was the most pretentious and rude waitress we have ever experienced. She was condescending on every level, didn't listen, and made mistakes on orders, and even then was unapologetic and almost making fun of us. Capping things off was that after spending ~$600 for two people as we walked out she turned her back and made a pretty obvious effort not to wave goodbye and say thank you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210d1VUWllkR3RVTTJkRGJVWkhRVEowYW5kRlMxRRAB",
            "text": "Chinese own omakase. Nori wasn't even crispy.  Skippppp"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbVRubDRVR2RXUkRabGQxUmtSbEJyYWpSb04wRRAB",
            "text": "I was in town for the Ryder Cup and a friend recommended this spot. Everything was fresh and delicious, but the highlight was the service. Terry was incredible and just a great guy to talk to. I’m not usually a big tipper, but he absolutely deserved it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U0xXUmFSVFJSU2s4eU5rOVlMVXh6UVZFM1RXYxAB",
            "text": "First time ever trying omakase and wow, it did not disappoint. The food was super fresh and each bite felt special. Shoutout to my waiter Terry — he was really informative, explained everything in a way that made it even more fun, and honestly made the whole experience way better. I’d definitely recommend asking for him if you go, 10/10!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odFNGVlJiMVZMVmxCR1NrazFkVXgxU1RkSlFuYxAB",
            "text": "I came to Kaizen Omakase last night while in town for the Ryder Cup, since I’m staying at the hotel right next door. I’m so glad I decided to stop in—it was an incredible experience from start to finish.\nThe ambience is stunning, especially the giant Sakura tree at the sushi bar, which really sets the tone for a special evening. It was very busy when we arrived, but our server, Terry, was extremely professional, attentive, and apologetic about the wait. His service made us feel well taken care of, and we didn’t mind waiting thanks to the lively atmosphere and great cocktails. The Kaizen Lycheetini, in particular, was refreshing and delicious.\nThe omakase itself was fantastic—every course was thoughtfully prepared, beautifully presented, and absolutely delicious. Overall, Kaizen delivered an outstanding dining experience that I’d recommend to anyone in the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kYVQyNTNhazQ1VVhaMGVsSnpWblozTjBscWRIYxAB",
            "text": "Came here with some friends and we all had an amazing experience, the staff was very friendly and communicative. The drinks during happy hour are exceptional and would highly recommend. Great ambiance for any kind of event."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTWEwTjNielZQTVVZd1RFaGtibDgzVURNeU5sRRAB",
            "text": "Bestie treated me to this special omakase for my birthday. The food was amazing and chef was very knowledgeable about the ingredients and makes great combinations with his food. For the price and quality this place is unbeatable! Definitely coming back soon and recommend to everyone <3"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcWVqSnRNR1ZvUlU5dFpsTTBjV3hKVUZFeVVFRRAB",
            "text": "I was pretty excited to see a restaurant offering omakase in Flushing getting such glowing reviews, but unfortunately I should have tempered my expectations. The food isn't bad per se but it's definitely not something I'd give high praise for either. For the amount you're paying, after tax and tip you're looking at $250-$260 for two people.\n\nMy friend didn't like the amount of soy sauce they put on everything, but I didn't like the amount of caviar they put on the sushi. It's extremely overpowering, and they put it on more than one sushi. Maybe some people enjoy that, and taste is subjective, but I wasn't a fan. Clams had large chunks of sand in them.\n\nThe vibe screamed \"hotel\" restaurant, which isn't exactly a bad thing, but it felt like it was aimed at tourists more than anything. Music wasn't too loud which is a plus.\n\nService was attentive, quick, and professional. No complaints about service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STmFqRnphRE5wZGxKbFNYRktVMjFOWjNVeVptYxAB",
            "text": "I NEVER leave food reviews but this place has earned it!!!!! 10/10 the experience the food the everything!!! All the handrolls are 10/10 the staff is super nice the happy hour menu is amazing I wish I lived local I would come here  on a weekly Mei has been incredible!!! Will be making a point to come back here ASAP"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWS1JFOTNhWGRaVVhkbE1YUkZSWHBETm1OSlRWRRAB",
            "text": "octopus ceviche was chefs kiss"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNE1tTnpRa2QyYWtvdFJWaDRNR00xTmpsV2VsRRAB",
            "text": "After watching the US Opens, I was starving and my friend was craving for sushi. Came across this on Google and decided to give it a try. And wow, this place is so cute! Love the decor and the cute swings. The omakase is a steal for the price! It’s so cheap but SO FRESH! Love how they have a live singer on Wednesdays. It’s definitely something different and enjoyable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKS1ZGRnJOamxhWkdGUGEyWjFMVmxyUkVkV1RFRRAB",
            "text": "If I could give more than 5 stars, I would. Kaizen has officially become our go-to spot for omakase, and that is entirely because of Chef Lok and his incrwdibel hospitality & sushi expertise. We cannotttt wait to come back for his own curated menu.\n\nFrom the moment you sit down, you feel Chef Lok’s love, care, and hospitality. He’s warm, he’s engaging, he’s fun, he’s respectful, he’s kind.. we had one of our kids with us and he wa so fun with him too! He doesn’t just prepare sushi here, he creates an experience. Every piece is a perfect balance of flavor, texture, and presentation, but what makes it extraordinary is the fun and warmth he brought to our counter. His passion is infectious too (24 years!!) and you can taste it in the food and feel it in the atmosphere\n\nThe quality of the ingredients is second to none: the freshest uni (literally the best I’ve ever had and I’ve been to Michelin omakase), buttery toro, fresh ikura, perfectly marinated fish, and PERFECTLY seared scallops. Each piece was put together like art and served with the intent to clearly blow our minds lol\n\nSome standouts were the uni-topped toro and the hand roll they was bursting with flavor, and the oysters with ikura that felt like a piece of heaven in my mouth. Every bite was unforgettable, not just the odd one amazing piece.\n\nChef Lok goes above and beyond in making the omakase personal. He takes time to engage, explain, and laugh with you, which transforms the dinner from just dining into something memorable… none of us would forget that experience lol. He is soo passionate and his pieces are so different than a typical omakase. Fish is also soo fresh.\n\nThe balance of high level skill with genuine hospitality is so rare, especially in such a comfortable setting and it’s exactly why Kaizen felt so soecial.\n\nThis is not just sushi… it’s delicious artistry, and fun in each bite. We left not only full but sooo happy knowing we had found a place we’ll be returning to again and again.\n\nThank you Chef Lok for making Kaizen feel like home for us omakase lovers!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRdFltcENMVFpEYVhvMVQyVnlObkIwTVZKYWEwRRAB",
            "text": "The food was fine, good, but I’ve had just as good to much better sushi at many other places for half the price. Way too expensive for very small portions of pretty normal sushi. If we had know how small the portions were, we would have chosen another place. The “hand rolls” are essentially the size of one piece of “sushi” at other places. They are not at all equivalent to the size of a “sushi roll”. Also, the GF options are not great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTmIyZFVRbmh1VG1sMWNGSk5ablp0YVdKTGEwRRAB",
            "text": "BEST OMAKASE everrrr! Sam did an excellent job curating the sushi and Sunny gave us the best drinks from his own creation. 10/10 recommend and will definitely be coming back :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMmRTMTROWEZUU210c1MyeHVlVlJ5ZWtsalNYYxAB",
            "text": "Excellent omakase! The food was delicious and the service was amazing! Sam and Sunny introduced really fresh nigiris, hand roll, and shots that made the night unforgettable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMFlYUjRNVWRCY2tKMlF6TXRPVGxUTmpSTlUxRRAB",
            "text": "new chef still great service and atmosphere. terry and felicia and sunny and rob are the best ! loved the pacing of the courses and conversation i had with other guests at the sushi bar. always a great time"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaE9DMU9kMkUzWDFCS2NIbHpVRUpQU0RkemIwRRAB",
            "text": "The atmosphere is very nice and they did accommodate us without a reservation.  The place isn’t that big, but server was not consistent on checking on us.  Food was good, but way overpriced!  $20 for some tempura-fried chicken and a bunch of rice?  Total bill for two people with one glass of wine was $100.  Even if you’re a millionaire, spend your money elsewhere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkd1gxOWhhVVpRVjFCTFpFUnJlbTEyWjBWMlUwRRAB",
            "text": "Great omakase for lunch and dinner. Reasonably priced wines and sale to go along with your meal, just go for the large omakase, don't go cheap."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeE0yTlVUM2xDWVY5WGRFRkVWVGx5Ymkxd1lWRRAB",
            "text": "very nice💗"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FME5Hd3diMnR5TTNnMk5sbFphVEozTVd0WllsRRAB",
            "text": "Food was amazing and super fresh ! Dishes came out really fast ，and the service was excellent — super friendly and attentive🥰. Definitely one of the best sushi spots in Queens!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCclMwTTVTVkZmWDNOc1QwUTRTRnBKWmtsVFVVRRAB",
            "text": "Kaizen is a gem in Queens! 🍣The omakase was super fresh and every bite was on point. Loved the crispy rock shrimp tempura 🍤 and the soft shell crab 🦀 — so good! The cocktails here are gorgeous too 🍸(tasted as good as they look).\n\nChill vibes, friendly staff, and amazing quality — def my go-to sushi spot now 💗💗"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SYVMxQkpNVzA0YzNsVFNsOTNWSEpDTFhSalZtYxAB",
            "text": "So fantastic food and service, I feel wonderful experience 🫶🏻🫶🏻🫶🏻come here many times ~~"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbU9WQnZVV3RoWmtWb2IycEVlVlJKZW1aWVEyYxAB",
            "text": "Poor service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eFUybHZkMnhXWnpSb01tbFJVMTlzU1hKWVRrRRAB",
            "text": "Food was decent, service was not. We had a party of four and despite ordering all at the same time, two of our entree came out first followed by the other two 45 minutes later. The first two were done by the time the other two came out. In…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTU9FSndYMmRTZW1samJrZDJhRVYyVUhCb1VGRRAB",
            "text": "Got the $100 omakase here. Pacing was very odd. Maybe that was because we were sitting at a table instead of the sushi counter, but it caused us to wait a very long time between pieces. Due to waiting and the chef creating us plates with multiple pieces instead of one by one, the sweet shrimp and the squid sushi was very slimy and sticky. It put us off all the other pieces of sushi. They also seemed a bit understaffed for a decently busy night. Again, probably contributing to us having to wait and the general sushi coming out lackluster.\n\nIn summary, the experience fell short despite them trying to be vigilant and accommodating. Based on my previous experiences, you'll have much better consistent success grabbing omakase on the Manhattan side for both a better price, fresher sushi, and a more intimate setting."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSeFYwVlRha0pmUkdsT1pISTJkRGxJVkVGQ2NrRRAB",
            "text": "I went to Kaizen Omakase yesterday and had an amazing experience. Even though it was busy, the service was excellent—our server Terry was super friendly and attentive. We got the omakase, which was the perfect amount of food, and every piece was fresh, beautifully presented, and delicious. The pacing was great, and the atmosphere felt upscale but comfortable. Definitely a spot I’ll be coming back to!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RVkxZFZOMjFaUTBGMk5GRXpPR055Ukc5VExVRRAB",
            "text": "Came for the NYC Restaurant Week Omakase set! Came with a decent amount of sushi which was all really good quality. I also really enjoyed the mushrooms in the miso soup. Overall was a good experience. The decor of the restaurant was quite nice, however as we arrived close to opening it was a bit quiet for the large space."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NM01HaDJOelkzTVRSSFZWUlpOVlJCY2tOMFgxRRAB",
            "text": "This place is just magical! Imagine enjoying omakase under beautiful cherry blossom trees — such an unforgettable experience. The staff are super friendly and welcoming ❤️. Everything was so fresh, and the chef’s special dessert was the perfect sweet ending. You can really feel the love and attention in every detail here. Definitely a must-try!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWlVYZHJkR3MzZEVZemFHeHBNWEZwYVhsWGQzYxAB",
            "text": "Went to kaizen today for some food and drinks. Mei my server was very professional and helped me understand the menu. She recommending I get the kaizen set with and appetizer. I chose to do the miso black cod, it was super buttery. And the freshness of the kaizen set was as on point.\n10/10 would come again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwYWQzWlVPVmRuY25oT2FXZFdMVTVvZFdKcU1FRRAB",
            "text": "Was there at 5pm on a Thursday for their $100 Omakase meal.  The restaurant has a nice decor. We sat at the sushi bar and was able to watch the sushi chef prepare the courses. Fresh pickled ginger cubes were provided to clear the palate. He also gave us additional information on some of the dishes. The food was very good, fresh seafood, and good service. My husband also had the $45 saki flight which he enjoyed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVd1VrMWZabTVpTWs0NFFsbHRhbUZ1UW1wSVJXYxAB",
            "text": "This was an amazing experience with even better company. I came here with my friends and the fish was so fresh. Everyone was so kind to us and introduced every hand role. I’ve had sushi many places and I must say, this was amazing!!\n\nThe owner was so kind and knowledgeable!\nI definitely want to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WU04xUXlRbkZpYVd4YVlqWnpkR296VlVsSVVYYxAB",
            "text": "Celebrated my bday here & the night was amazing.  Starting w/5 star hospitality by our loving host Sunny who was such an amazing mixologist & comedic delight.  Accompanied by Jay & Ben behind the sushi bar slicing & dicing up our omakase bites of joy.  Night was hilarious & a bday to remember consistent fresh house wasabi vodka shots & giggles & cackles throughout….thank you Kaizen & company!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM0lhMVpREAE",
            "text": "Amazing! My boyfriend and I went for Valentine’s Day. From the second we walked in, Mariam offered us a coat check. We were then seated at the sushi bar for a one of a kind 15 course meal. The chef was incredible to say the least. Another employee, Sunny,  offered us drinks and taught us a lot about each course served. Not only was the food delicious, but the owner Bobby was so kind and came to chat with us for a bit. Will rate 11/10 and will be back."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKM0k0OFc5X2NMaXRnRRAB",
            "text": "We had the Omakase. Fish is very high quality, check out the pics. Anthony is our server. He is great. Manager spent time to chat w us, and introduce us to the chef."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdnFIc1BREAE",
            "text": "Kaizen Omakase is such a beautiful place—intimate, elegant, and perfect for a special night. My husband and I really enjoyed the whole experience. We did their 15-course omakase for $100, and every single piece was so fresh and beautifully prepared. The appetizers like the rock shrimp tempura, tuna tartare, and honey-glazed ribs were full of flavor, and we loved the hand rolls too. We also tried the spicy matcha margarita and mango cocktail—both were so good! Sunny took such great care of us—he was warm, welcoming, and explained each course with so much passion. We can’t wait to go back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMDQzQW53RRAB",
            "text": "I had an amazing dining experience at kaizen The sushi was fresh, beautifully presented, and packed with flavor. The ambiance was warm and inviting, making it a perfect spot for a relaxing meal or a party.\nThe staffs were attentive and friendly, ensuring a great experience from start to finish. If you’re looking for high-quality sushi with authentic flavors, I’ll be coming back for sure!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMHVYbDNBRRAB",
            "text": "Take the time to make it here, the food, the atmosphere and more importantly the staff will awaken your senses!  For a wonderful evening you cannot make a better choice.  Sunny the manager will be sure to feel welcomed and it’s a place where your patronage is always welcomed!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bk5XWnFkRFpGTXpOSk1XRnlha1JwYTI1VFEyYxAB",
            "text": "I went to Kaizen Omakase craving sushi, and it ended up being one of the best dining experiences I’ve had in a long time. The omakase was outstanding — every piece of fish was incredibly fresh, perfectly cut, and paired with the right balance of seasoning and garnishes. You could tell the chefs truly care about both the quality and presentation.\nOur server, Terry, was exceptional. He was attentive without being overbearing, very personable, and knowledgeable about the menu. He recommended the Dassai 39 sake to pair with our meal, and it completely blew me away — smooth, aromatic, and easily the best sake I’ve ever tasted. It elevated the entire dining experience to another level.\nThe ambiance was equally impressive. The decor blends modern elegance with a warm, inviting atmosphere. The lighting, seating, and overall vibe make it perfect for a special night out, but it still feels comfortable and welcoming.\nIf you’re a sushi lover, Kaizen Omakase is a must-visit. Fresh fish, impeccable service, amazing sake, and an atmosphere that makes you want to linger — truly a 10/10 experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdnBDNGZnEAE",
            "text": "TLDR: i’d prefer to drop 400+$ in a very nice omakase in Manhattan with way better service, food quality and ambiance.\n\nFood is just ok for a tab of 400$+ for 2 people.\n3 drinks, 2 omakase and 3 extra rolls at the end.\nThe omakase courses, they made a miso soup one course?? It was super diluted.\nThe service was not bad because there was no service to speak of. The waiters were just dropping food, but never attentive or checking in.\nThe only one who cared at all was the sushi chef, and it was hard to hear his presentation of the dish over the loud music. Had to repeat it several for most dishes.\n\nThe atmosphere is ok, but reminded me more of a club, and was not nice to be able to see the kitchen bright light from my seat at the omakase bar. You can also see the waiters throwing out the food from the plates leftovers and throwing them in buckets to be later taken to be cleaned inside the dining room.\n\nThe food experience itself was odd as it started pretty mid, and the latter half had enjoyable rolls/onigiri. But all throughout, the rice was more al dente (slightly hard, weird) and they would put SO LITTLE rice on some of the nigiri sushi courses. In the pics, the rice is hard to see.\n\nAlso, we mentioned it was our aniversary in the reservation, and we had to remind them when they had brought us our tab. Dissapointing."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMmREd2p3RRAB",
            "text": "My husband and I reserved a 2-person omakase tasting with the sake pairing. When we entered, we were not seen for a minute (not a problem) as it seemed busy but the restaurant was not full and we were 15 minutes early. Finally one of the servers told us we could wait at the bar while our bar seats for the tasting were prepared. I asked if we were able to hang our coats on the rack. Once we placed our own coats on the rack, we sat at the bar and were ignored until our seats were ready. So, we had no chance to order a drink before the start of the meal. Not a huge problem since we were doing the sake pairing.\n\nWe sat for the tasting and another server \"took our order\" and we acknowledged we were in fact ordering the tasting. The first appetizer came and we were unprepared because it was not presented to us as the start of the tasting and we assumed the first sake pairing would also be poured along WITH any dish.\n\nWhen the server was back near us, I inquired about the state of the sake pairing and then 3 servers came to our side. The older man with glasses chastised us for not telling the server we were doing the sake pairing (didn't know we were on the clock for training staff), but not knowing how their reservation system operates we assumed you'd prepare what we reserved.\n\nThe food was fine, but the purpose of the pairing was to have the dishes and drinks flow together \"like a symphony\" (as the nicer server told us). Unfortunately, this birthday dinner symphony was out of tune and discordant. The sake descriptions were also not...accurate. It made for a strange experience because most of the sakes were delicious!\n\nThe assistant chef was great, but they were also having to act as a serving counter for the servers. It was quite chaotic. Also, you should have paper towels in the bathrooms. Especially considering there's a lot of hand usage in this type of cuisine.\n\nMaybe it was understaffing because near the end of our dinner, the previous bartender was pushed out on the floor as a sever and someone else was behind the bar.\n\nThe seafood tasted fresh, so that's nice. But when we spend nearly $400 on a birthday dinner, we expect the entire experience to match."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOTh2bHhBRRAB",
            "text": "What a great experience! Came here with my family & from the minute we walked in we were welcomed with great energy. The drinks & food were amazing, the service was great. Andrea served us & she was super attentive & informative. Serena made amazing drinks & was super knowledgeable. The owner Peter stopped by our table to make sure we were having a great time & he was the cherry on top of our night. Amazing amazing amazing. Truly a great experience & would definitely recommend. A must visit!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzc183Vzh3RRAB",
            "text": "It was exceptional! The food and I mean EVERY DISH I wish I could've had 2 or 3 servings of while doing the 17 course Omakase with my wife. We got seated a little late, but the boss comped our drinks at the bar in which he didn't need to do. The atmosphere was on point and plenty good scenery to take photos. I highly recommend and will be back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNUt2QTBRRRAB",
            "text": "A great experience from start to end. The staff was friendly and very accommodating. The chef who prepared our sushi took his time to explain what each piece was as we made them to perfection. The food was delicious and worth it. Highly recommend you visit."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbEtqSi1RRRAB",
            "text": "Had a wonderful experience at Kaizen. Once you step in the doors, the staff greeted us and seated us immediately. We had the Winter Omakase Experience paired with the Dassai Blue Sake flight. We also ordered some extra handrolls on the side. Great food and great atmosphere for a date night."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneXVicWJBEAE",
            "text": "We came here for our anniversary. The food (15 course omakase) was excellent, and the service even better. Sonny, the manager, made a big deal out of our special occasion and it made it even more of a memorable celebration. Looking forward to dining here again!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcExhNHhnRRAB",
            "text": "The Omakase experience was awesome.\nWe sat at the bar and the chef paced us with each course. He explained what Each course was and everything was so delicious and fresh! That Fatty tuna with truffle on top was amazing!\nWould definitely come back to try out their seasonal menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMX3k2dERDbWNpUVdBEAE",
            "text": "TDLR: It definitely passes the vibe check especially with the great service!\nI came all the way here from Long Island for an evening with coworkers. We were impressed with the quality of the food, which I felt was on par with the seafood in Japan! We ordered the ribs, rock shrimp tempura, kunamoto oysters with uni, tuna tartare, two kaizen sets, two chutoro handrolls & one A5 wagyu miyazaki handroll, a pork katsudon, and the delicious ube & pink lily drinks. It came out to be about $100 per head including tax & tip. It was truly worth the experience, and I would definitely come back again with more people to try the 15 piece omakase set!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMb2VfQTlRRRAB",
            "text": "The food was so good! We got the hand roll set with some extra hand rolls. I love the cocktails here too, they were amazing! Serena and Nick were the best, amazing server and bartender. Loved the customer service, would definitely come back again!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MjdXRTBBRRAB",
            "text": "Kaizen Omakase - A Truly Exceptional Dining Experience\n\nI recently had the pleasure of dining at Kaizen, a hidden gem in Flushing offering an unforgettable omakase experience. From the moment I stepped in, I was impressed by the intimate, yet inviting atmosphere. The staff was attentive and friendly, making me feel right at home.\n\nThe omakase menu was nothing short of extraordinary. Each course was carefully crafted with the freshest ingredients, and the sushi was expertly prepared right in front of me. The flavors were delicate and well-balanced, with each dish offering a unique experience. I especially enjoyed the variety of seasonal fish and the chef's personalized touch with every bite.\n\nThe highlight of the evening was the chef’s presentation of each dish, explaining the origins and nuances behind every piece of sushi. It was evident that a lot of thought and passion went into each selection.\n\nOverall, Kaizen offers a premium omakase experience that truly stands out. Whether you're a sushi enthusiast or new to Japanese cuisine, this place is a must-visit for anyone looking for an exceptional culinary adventure in Flushing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWllrRTVZWGR3WjFjMVFuTk5kMDVxZW5KaE9YYxAB",
            "text": "A qualified omakase spot. ✅ The service was pretty good, with thorough explanations of everything in the Kaizen set. There weren't many people when I visited 🫙"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNXJ2X2VREAE",
            "text": "Had the 17 course omakase ($100) and the sake pairing (five 2 oz pours for $45). Food was excellent, great variety. Sake pairing were tasty as well. They had a guy here who was the sake supplier and could tell you whatever you wanted to know about the sake"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiamFLa1FBEAE",
            "text": "A meal to never forget. I have never been here before and  I am so thankful for Rob Dorsky and his incredible sushi at Kaizen. Kaizen meaning continuous evolution-they truly are.\n\nLocated on flushing,  off the beaten path, lies this incredible Omakase based restaurant. Kaizen's food is sophisticated, clever, and creative. The food is flavor focused and perfectly balanced.  Each bite is curated with an elevated flavor profile to tantalize any tastebuds. I started my meal out with a spicy matcha jalapeño Margherita. Yes!yes!yes! This drink was everything i was looking for from flavor to spice. And you need to be able to handle the spice for this drink.\n\nThe $100 omakase is cheap in comparison to the quality and quantities of food you get for the value. I keep trying to figure out what was my favorite dish, and I'm torn between the a5 wagyu topped with foie gras, or the seared o-toro topped with caviar.... but then again the kampachi topped with black truffle was also amazing. Also in a sucker for sweet shrimp and their ama-ebi sushi topped with yellow caviar was spectacular. Don't forget to ask for the shrimp head to be fried. It's a delicacy and my favorite when a chef offers it up to their guests.\n\nDish after dish, it doesn't matter if it came from the kitchen or the sushi bar, because their ribs need to be a star all on its own. I'm not kidding. I could have eaten 10 more, and not been disappointed or stuffed. Their Japanese honey glazed ribs should be illegal for how good they were. I honestly am so glad I added that to my omakase, because I would go back just for an entrée portion of them. The entire group I was with were even fighting over the salad with the ribs dressing on it. IT WAS THAT GOOD!\n\nEven their desert, which was simplistic in its choices were fantastic. The yuzu custard to finish off the omakase tasting was super delectable and left me wanting more.\n\nI absolutely loved this place, the experience, and the food  top 5 places I have been in 2024.\n\nLet me know your experience and what you think..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMHYtZU1REAE",
            "text": "A very decent restaurant offers good price on omakase and great services!\nInside this high ceiling joint is nice and clean with very chill and comfortable vibe. I personally love the Cherry Blossom Tree decor behind the counter.\nWe had a very pleasant Omakase experience! A group of 5 of us sat at the sushi counter last Monday night for 17 piece omakase. A shout out to Ben the sushi chef! He was very informative, friendly and easy to talk with. We enjoyed our dinner very much and had a fantastic time.\nFor sure I will be back again and this joint has just become one of my go to when in mood for omakase!\nAnother shout out to Bob the fun boss, thank you so much for the warm hospitality."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaHRxN0dREAE",
            "text": "The service was impeccable and the restaurant was beautiful. Our server and staff were extremely attentive and polite. I would say it was five-star service. We went on a Thursday because I wanted to try the premium Kaizen set which is only available on Thursdays. I was disappointed since the lobster roll sounded the best but turned out to be the worst. Don't get me wrong, the worst being the worst of the set but by no means wasn't good. The botan Ebi was definitely the best tasting in texture and flavor. We also got the complementary rolls with check in. Everything was fresh and well made.  I was slightly disappointed that they were out of quail egg for the tuna tartare. It was still delicious but that creamy quail egg would've put it over the top and enhanced the caviar. Without the egg, the caviar wasn't necessary. The wasabi seaweed chips were a great accompaniment for the tartare.  The Kumamoto oysters with uni did not disappoint. Though not the most creative dish, but definitely one of my all time favorite combinations.  We also happen to be there at happy hour so we took advantage of the happy hour specials. The ribs were pretty good but nothing to write home about. The lycheetini was beautiful to look at but unbelievably sweet, I couldn't even drink it. Good thing it was only $10.  I wanted to order the yuzu cheesecake but they were sold out and that was disappointing. Our server was so polite in apologizing and offering alternatives but I'm not a huge dessert person so I turned them down. Our server brought me a mochi brownie dessert on the house anyway since it was my birthday and explained that she knew that I would prefer cheesecake but she believes the mochi brownie is the next best dessert behind the Yuzu cheesecake so she opted for that instead of bringing me a different flavored cheesecake. That was really sweet of her. I didn't really enjoy the texture of the brownie, but the ice cream, caramel, and puffed rice, or delicious. Overall, a really great meal. Why not five stars? I thought the rolls lacked seasoning and could've used a little more texture and creativity."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cmN1N3JBRRAB",
            "text": "I have to give all the props for our meal tonight to chef ben, he was so welcoming, sweet and friendly, especially to my husband and i during our time there. the food is beyond delicious, he went above and beyond for our dinner experience! everything from presentation to taste was amazing 🤩🤩🤩we will be back chef ben!!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncXZQNC13RRAB",
            "text": "I recently visited Kaizen in Flushing and had a delightful dining experience. The restaurant offered a sleek, modern atmosphere that felt upscale and private, making it ideal for both personal and business occasions.\n\nThe highlight was their omakase and hand rolls carefully crafted by a highly skilled chef. Each piece of sushi was fresh and full of flavor. The hand rolls were perfectly crisp and filled with premium fish.\n\nI was drawn to the restaurant by their Happy Hour (Monday to Thursday, 5-7 PM). I enjoyed bottomless cocktails and a selection of small bites, all priced between $6 and $10—a fantastic deal for high-quality Japanese cuisine.\n\nKaizen offered everything from exquisite omakase to affordable drinks in a stylish, laid-back setting. If you’re searching for a top-rated omakase restaurant in Flushing with fantastic happy hour specials, this is the spot.\n\nI highly recommend this place for omakase, hand rolls, and happy hour deals in Flushing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdnJLTmhRRRAB",
            "text": "I like this place for special occasions. Atmosphere is nice. I like their sake pairing, introduced us to new sake. food tasted pretty good overall. but for 15 course omakase of $100 per person, things came out very fast. No one was done with first five pieces of sushi that came out and they gave us another four set of sushi. I barely could hear/understand the lady explaining what they were. And no one told us that we were done after last handroll before dessert. and portions of each piece was pretty small that we end up ordering extra handrolls."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNHBXUVFnEAE",
            "text": "I have been coming here multiple times and we enjoyed it a lot! My husband had the 16 course omakase while I had the 13 course and I have to say they are both great! The quality and freshness is worth the price. Also the cocktails are beautiful and taste amazing!! This is our new go to spot in Flushing now!!"
        }
    ],
    "reviews_count": 69
}
