{
    "name": "ECB",
    "place_id": "ChIJvaTde5hewokRVhPqu4hXcFg",
    "grid": "QN5",
    "address": "53-21 Metropolitan Ave, Ridgewood, NY 11385, USA",
    "rating": 4.5,
    "user_ratings_total": 581,
    "phone_number": "(718) 451-8020",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSmIwVjBMVzlaVVZWbFRXaEphelpwY0c1aGQwRRAB",
            "text": "Pizza and mojito were great. Chef did the pizza in front of us in a few minutes. Employees are kind. Great place to be here if you wanna eat pizza and watch nba."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4c05DMVJaRjlwZVVkcGJUQk5OMDFwT0VvMVJsRRAB",
            "text": "Party of 2, sat and waited 20 mins for the server to bring menus & waters. First water came out but not the second for another 5 mins.  Food came out fast - ordered potato skins which were bland, and a pepperoni pizza that was greasy and floppy with barely melted cheese. Had to ask for plates, utensils & napkins and that took another 5 mins to be given to us.  Waitstaff didn’t seem to want to be bothered."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNVZtTkRVSEpuWTBnMFJrMDRlR3REWjFnd1dsRRAB",
            "text": "Had the margherita pizza and it was outstanding."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWFpGaExkWFF0V0haaVowUnNiM3BSVjNrd2RVRRAB",
            "text": "Great wings, friendly service, relaxing vibes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZM2NEUTVSV3hLT0hNMlJGZERRelowTVdONWFrRRAB",
            "text": "Went here for food and drinks before a concert, best place ever!!! Food is so good, drinks were so well priced, and Carlos was the BEST SERVER EVER!!!! So nice!!! WILL be coming back!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaGVXcG9VM0ZOWWprNE1VZEJhbVZYVkdsYVdsRRAB",
            "text": "LOVED CARLOS !!!!!!! BEST SERVER IVE EVER HAD"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRFZXNUtjRTVwWjBJMk16WkpaMjFEZDB4dmFtYxAB",
            "text": "I haven’t been in person yet but love almost everything I’ve ordered for delivery. I am heartbroken though because they used to make my favorite ribs which are no longer on the menu 😢💔…"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZOVp5MXF3RRAB",
            "text": "Love the food is mmm 😋 delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYndpcDItd28tazVBRRAB",
            "text": "Brick oven pizza was banging! I have to say, the bartender Carlos makes the best espresso martini in Queens."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKVEp4ZUNndGRuVl93RRAB",
            "text": "Okay let’s start, so my soda came watery and the girl Sophia said she would change it for me, by mistake she brought me another Long Island ice t instead of the coke and realized it and still charged me, then her friend came or a coworker who is off today came in being really loud for maybe 20 minutes super obnoxious. Definitely wouldn’t come back here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJV0Jqb3pab0pUbGxnRRAB",
            "text": "10/10 would recommend!! This place had the best BBQ RIBS ; tender , fall off the bone bbq ribs!! Upsetting to hear they discontinued them :( hopefully they make a comeback !! 🙏 would definitely recommend checking this place out!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJelAtb2xRRRAB",
            "text": "Amazing food and good vibe\nMost try the chicken Piccata,  the Scarpiello Wings and new to the menu the Risotto w/shrimp"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaGZMQTR3RRAB",
            "text": "GREAT BURGERS !!!!!!!"
        },
        {
            "date": "8달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbkxIM2V3EAE",
            "text": "Очень все вкусно. Цены хорошие . Приятный персонал, радушный хозяин"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbHZ1MGV3EAE",
            "text": "Travelled in from Toronto and decided to pop in to ECB to meet up with some friends for drinks. The atmosphere was warm and friendly, the service great, I opted for the seafood linguine topped with a large serving of lobster, had to admit I was really impressed and would highly recommend it 😋"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQZ2JqVmhRRRAB",
            "text": "This food was mediocre at best. I got a regular cheeseburger with an Oreo Milkshake, and my boyfriend got the ECB Burger with a Whiskey Sour. The burger meat didn’t taste fresh, The bacon didn’t even taste like bacon, It tasted like ham… and lastly the milkshake tasted off, As if they used expired milk or for whatever reason put mint in it. I’ve never been to a place where they can make a milkshake bad, So this place was a first. $47 is crazy for food that is extremely underqualified and hardly edible. The only saving grace was the Whiskey Sour and maybe the side of fries."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzN1kzcHFnRRAB",
            "text": "Great vibes, good drinks, mocktails and AMAZING FOOD! Celebrated my sisters graduation here and love dining in. Wings are impeccable, pasta is good desserts are delicious. However my favorite are the Brussels sprouts, broccoli, MASHED POTATOES & AVOCADO SALAD ARE A MUSTTT!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzX3BLaHVnRRAB",
            "text": "I've only had delivery after seeing their advertising. It is so amazing!! Every single item I've ordered is uniquely appetizing and consistent. I hope this place stays hidden selfishly because it it that good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeDZQN1ZnEAE",
            "text": "Great space for music with a lot of very cool hang out spots."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIZzlYZG5nRRAB",
            "text": "Randomly picked this place as a before and after for the Knockdown Center, and it was so good!! Great food (amazing smash burger, special wings, mac and cheese), and great daily happy hour deals! Not a huge foot traffic area, so not too busy. Definitely a must if you're nearby."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bDktdVhnEAE",
            "text": "Delicious food. The burgers were delicious best burger i’ve had in a long time. The drinks are really good. Very good service good vibes. Would definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdl9yQVB3EAE",
            "text": "Lil place, big kitchen, incredible WANGS,\nlean staff, most delicious drinks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MHBIUDJRRRAB",
            "text": "First time here. Food and atmosphere are great. Would definitely come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqN3ZucUZBEAE",
            "text": "I've been going here for 3 years, awesome food when they do NOT MESS UP your order which is maybe 25%. Literally can't understand the simplest of oder. The same meal for years smh, how can you not get a cheeseburger with lettuce and tomatoes correct?  Almost  EVERY darn time smh.  Make you want to order a hamburger just so they won't mess up the order"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURELTlyNnNRRRAB",
            "text": "Great spot — caught UFC 300 here. Food and drinks were on point and staff really nice as well"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMkxDZGx3RRAB",
            "text": "Ordered the ECB burger and fries for delivery. Excellent, excellent burger. So satisfying and well seasoned. The fries were addictive. 9 out of 10. Would order again when I'm in the area. It's midnight and I just ate the burger and I wish I had another one and more fries because it's that good."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoLWYtWlZ3EAE",
            "text": "The food is very good the atmosphere was all right I don't think people should bring dogs to restaurants to sit at the table. Also when you're done having dinner or whatever make sure you check your bill to see if it's yours or not. Also make sure everything on the bill is what you got had a bad experience. Also it was a lot of fun when John and Jay were there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkb3ZQVm13RRAB",
            "text": "The drinks are good, the food is good, and the owners and servers were friendly and attentive. A cool place for groups or solo dining. Highly recommend the pasta, the pizza, the garlic bread and the broccoli (simple, but well seasoned). BUT my absolute favorite thing I’ve eaten so far is surprisingly the chicken cutlet. I add it to every dish now and it never misses."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcWRPTGhBRRAB",
            "text": "This place is a little hidden gem. Great vibes especially on Friday with a DJ and karaoke. Food is great but a bit pricey for the portion size. I don't mind spending money on good food but I can't still be hungry after I finish my meal. Luckily my wife had the penne ala vodka. That portion unfortunately was a child size bowl. For $20 it could be a bit bigger. Also when serving pasta, some sort of bread should be included. Overall it's a nice place and good food. My 2 cents is either give a bit more food or lower the price just a bit to match the portion size. I will return again as I enjoyed my experience here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaTd1TURBEAE",
            "text": "Best spot to grab food and drinks in this area. Love the staff very up beat know their menu. The owners are there which is great. Love the atmosphere!! Definitely recommend this area to everyone 😍😍😍😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaTVQZ2V3EAE",
            "text": "Great atmosphere delicious food awesome staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeE4yaWV3EAE",
            "text": "I felt right at home when I first stepped into this pizza/burger joint. Great service and drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWbjRUODlnRRAB",
            "text": "Amazing place ! Food beyond words ! Service to the perfection! Bar no words just more than perfect ! I took away a star for the owner for not having enugh stuff one girl to serve full restaurant and one barman! You have amazing restaurant please get more people. I felt so bad for your employees they worked so hard they doing amazing work despite they work for three people at once ! But still my favorite place will always come back and thank you   John and Brianna ! You made our girl night out supreme !!!!!❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMW9lT2lBRRAB",
            "text": "Awesome Restaurant ♥️ food is delicious and friendly atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaHNUREVBEAE",
            "text": "Had a lovely dinner! We will be going back for a third time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdXFQWVVREAE",
            "text": "Excellent wings"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGdzhfMm1BRRAB",
            "text": "We went to celebrate my husband's 70 birthday the server Ken was polite and very attentive. The food was delicious,the atmosphere was calm we all enjoyed our food and the company"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGc3RYLXZnRRAB",
            "text": "Good food and service.  Ordered take out and there’ was mistake on my order. Chris the manager was quickly to adjust it. Cheers!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NnZ5bFpBEAE",
            "text": "I had the best pizza ever! And I don’t even like pizza."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1dk8tVkVREAE",
            "text": "We ordered take out from ECB. The food was decent and fresh. Not too sure whether we will order from this place again, but at least we tried it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadUtic2pnRRAB",
            "text": "The hospitality was great and the food was delicious. Plus the kitchen is open late and they have karaoke!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabDVlNm9BRRAB",
            "text": "AWESOME\nTHIS IS THE PLACE TO BE"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNac095T0x3EAE",
            "text": "We live in the area and wanted to try a new place. We have driven by here a lot of times and it always looked intriguing. We ordered the Excalibur burger and the NY strip steak. Both were very good. Even the sides. The fries tasted like it had parmesan cheese and garlic on top, delicious! The broccoli and mashed were a great combo as well! And I don't even like broccoli. Vibes were fun, there was karaoke going on inside but the doors were open so the people sitting outside could enjoy what was going on inside. We sat outside with our pup. They brought out a bowl of water for him, so pet friendly! Which is always a plus. Looked to be understaffed but the two guys we saw waiting on everyone were on their A game. John and Danny kudos for the great service you guys were providing."
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwd3JfcGlBRRAB",
            "text": "Buoni gli 🍔,  bella la location"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNTZYWlFnEAE",
            "text": "Great food and service. Friendly staff and owners were great. Wings were really good, same goes for the pizza and many other items. Definitely worth stopping in."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwek12MkNnEAE",
            "text": "Better than expected food. Sneaky good steak, shows alot of the UFC fights.."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLXBtM2d3RRAB",
            "text": "Good food and good service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaE5IcXl3RRAB",
            "text": "ECB is an excellent restaurant! The atmosphere is very cool. Staff is extremely friendly and upbeat they really know how to keep it moving.  They know their menu, and making the customers happy is their main priority.  Drinks are excellent.  Frozen drinks are in point.  We frequent this restaurant often and have never been disappointed.  Owners are in the restaurant often which is very important as they get to know their customers.  Sunday Brunch is now offered with many amazing options."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdGNYclFBEAE",
            "text": "I love coming here, The guys(Junior and John) here treat me & my family like Im one of their own. I came by today and i was slightly disappointed to find out my favorite appetizer was pulled off the menu. Please bring back the chicken bites….The  Food, drinks and atmosphere is always a pleasurable experience. Thanks guys!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOXF5M2ZREAE",
            "text": "everything was perfect! the owners are amazing and so was the service! cant wait to come back again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScGZlZUxBEAE",
            "text": "We went on a Saturday afternoon and there was only one person working, he was very nice and energetic but they definitely need more staff. Asked for a burger cooked medium and it was a little overcooked. The truffle fries have a very strong truffle/garlic flavor. The food wasn't amazing, but it wasn't bad, just average and exactly what you would expect it to be. I recommend the mac and cheese."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MDRQVEVBEAE",
            "text": "Best spot to grab food and drinks in this part of the neighborhood. Really tasty Neapolitan style pizza and burgers but you can find much more here, anything from wings and mozzarella sticks to steak and pasta.\nNice decor inside and covered outdoor seating.\nThis place is definitely worth a visit."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaGFXUHpRRRAB",
            "text": "We were fortunate enough to find this place on a slow night.  The food is excellent, the bar is full , the waitresses are friendly and attentive and you will not leave hungry , YOU MUST try the Excalibur burger equipped with Angus and short ribs meat mix along with truffle fries,  the BBQ ribs should be illegal,  tender and succulent beyond all telling and for dessert you must have the Nutella pizza (with strawberries and brown sugar on top). I can't say anything else at this moment,  if you are in Queens please give this spot a look,  you will not be disappointed,  food is fresh, drinks are cold, dessert will make you feel guilty but it's all worth it ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCOU5uTlFBEAE",
            "text": "Finally came to this place, I went with my wife and we tried the NY strip and the linguine pasta with chicken. The food was very good and fresh, the broccoli was extremely good, one of the best I’ve tried. The pasta was well cooked and the chicken was tender and juicy. The Ecbreeze is a house cocktail with orange and gin that is worth buying. I just have two issues with the food, first, that the steak was supposed to be with baked potato and it came with mashed potatoes; second, I asked for medium in my NY strip and it was almost well done. But, the food was so good that I cannot leave a bad review. Also because the staff was helpful and gave us good suggestions about the drinks and the food. We’ll be back for sure."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdU42b2F3EAE",
            "text": "Didn’t hate it. Chicken sandwich was a little stringy and could have used more buffalo sauce. the falafel burger was good but wouldn’t order again or recommend. We loved the hand cut fries!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxNm9uNGR3EAE",
            "text": "A+++ on the burgers, grilled chicken sandwiches and fries!! Their chicken bites are bomb as well! Service is always great over the phone and in person. Also don’t forget to ask for ECB sauce just incase! If you decide to dine in you might even get offered samples of their frozen drinks which are pretty tasty!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5ai1xSkhnEAE",
            "text": "East Coast Burger\n\nGreat food, great service = a good time!  I almost don't want to post the review E.C.B. deserves so it doesn't get too crowded!\n\nFirst, a correction to the website: yes, you can dine inside now that dining restrictions have been relaxed a little for NYC & the 5 boroughs. The tables are separated with partitions and customers are spaced far enough apart to feel comfortable in the time of Covid.  There's an outside dining option, too.\n\nAfter a year of restaurant deprivation, I was craving a really good burger. Although there are a lot of other choices on the menu, I was going to have a burger, no matter what. OK, I'll make it a cheeseburger.\n\nThen I saw the table card that showed a picture of the \"Excalibur Burger''.  You have to have one of these! House ground Angus beef & short rib blend patty, cheddar cheese, thick avocado slices, lettuce, tomato, onion, served on a toasted brioche bun with garlic aioli and truffle fries. We also had an excellent East Coast Burger with blue cheese. We were going to place another order of fries, but Junior (one of the best waiters you could hope to have) said that there were enough fries to share. He was right!  Both burgers were prepared exactly how we asked them to be!!  The beef was so incredibly tasty: it totally satisfied my burger craving.\n\nIt's a good thing we held off on the fries so we could have dessert.  John (another stellar member of the staff) said the cheesecake was the best he'd ever had.  We had the cheesecake and the chocolate torte.  Both were spectacular!\n\nThis is the kind of place that I want to come back and eat my way through the entire menu!!!  John & Junior really made us feel welcome and had that perfect sense of timing to stop by when you wanted them, but didn't hover over your table constantly.  It's always good to find a place that has great food and a great staff!\n\nThere is only one thing I have as a fault.  The menu is printed very small - two pages on one side of paper.  I hope they change that to split the menu & use the front and back of the page.  Otherwise, use your phone to zoom in or bring a magnifying glass."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbXVEZHlRRRAB",
            "text": "Tonight my fiancé and I went to ECB for dinner and were BLOWN AWAY. The wings and pizza were some of the best I have ever had. We tried the  blood orange frozen margaritas and I was hooked. I have been actively searching for a good, juicy…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLOWQzZUdnEAE",
            "text": "The food is just incredibly good. The waiter was by himself and still satisfied in customer service. He even changed the music because the playlist got a bit sad for a moment. The drink was phenomenal and definitely had me feeling nice. The…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdkt5UGNREAE",
            "text": "The calamari was fresh and delicious, some of the best I've had.  The chicken francese, the best I've had in a long time.  Can't wait to try their other menu items."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDZ2ZQN2xnRRAB",
            "text": "Hands down best brick oven pizza, so many options and all are amazing, still have the best burgers in town. I must say my 2 yr old loves the chicken fingers. After all the delicious food I needed drinks to wash it down and they were spot on"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dll5WWh3RRAB",
            "text": "Really enjoy our dinner here! We went early so it wasn't very busy, but the bartender/server was very welcoming and attentive! I had the burrata pizza which was scrumptious! My guest had the sausage and peppers -he also enjoyed his meal. Definitely a cute spot to unwind-and does lots of take out business! Would return if ever in the neighborhood again 😊"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMi11NFhnEAE",
            "text": "We had been at the cemetery wishing mom a happy birthday (her first in heaven since her passing) and instead of going home we decided to have lunch and drinks nearby. We found this place on Google and it was the best decision ...the food was good and drinks were flowing. I even got a tattoo from the shop across the street."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaTlYR3VRRRAB",
            "text": "I don’t normally write reviews but I had too for this one cuz it’s so good\nA+ on everything starting from the service to the food and drinks this place never let me down\n\nThe stuff really friendly and caring. The food is always fresh and tasty and drinks are amazing\n\nBest food and drinks in the area\n\nPs. If you come one day not sure what do drink let the staff choose a drink for you they will hook you up!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxd1liS3BRRRAB",
            "text": "The renovation is wonderful and the food and drinks are still amazing. Staff is friendly and attentive. Amazing neighborhood restaurant."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndl8yYUF3EAE",
            "text": "New and terrible.\n\nThe east coast burger is not only very slow with the food (when there's nobody around), but they also over-charge you on the menu prices. According to the menu, adding hamburger to a salad = +$3, we were charged $3.50.\n\nOverall, expect to wait around 15+ minutes for food, pay Manhattan prices, and have to pay a lot of attention to the price you're charged.\n\nEdit: Went there again 3/25/19. They've improved, but still very very slow to get food (in the middle of the day, called ahead, barely anybody at ECB). Also, now they have raised all burger prices, even though the PDF menu on their website still lists the old prices. The burgers are decent, but all the other hassle really kills any interest in me going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtaWNpTzh3RRAB",
            "text": "Really loved my dinner at ECB today. The atmosphere and everything is just great there and for New York it’s not too expensive either! Probably will go back another time on my visit here to New York."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSd08zOFR3EAE",
            "text": "Ordered food to eat in the outdoor area with my dog, server came out with the food and my dog barked, she immediately gave mad attitude telling us we wouldn't be allowed to eat there with our dog. Honestly wouldn't have been bothered about it if she wasn't obscenely rude about it"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cmRISWtBRRAB",
            "text": "The food was delicious! The burgers are big and juicy. A bit pricey if your getting a burger fries and drink but totally worth it"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZbWNMeXNBRRAB",
            "text": "The food and the service was great, I will return here."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbGRxaTZRRRAB",
            "text": "Went here last week for burgers which were unbelievably delicious. We came back to try out their rustic Italian food and it was outstanding. Everything we ordered was mouthwatering. Easily the best baked clams I have had in the 5 boroughs. The Chicken Ala Roma was so light and flavorful. The food is so fresh and cooked perfectly.\n\nThe Italian cheesecake with the marble crust was worth a trip itself. I have never had a cheesecake that good!\n\nThe staff and owner created such a pleasurable experience.\n\nIt is easily one of Queens best hidden gems you have to check it out !"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzNXJ1N19RRRAB",
            "text": "Had dinner this evening with family members.  I had the Cali burger which was very tasty and an enjoyment to eat.  The seasoned fries were great and would do both again and again.  Nice atmosphere.  The owner, the cook and our waiter (John)…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxa09TNHV3RRAB",
            "text": "Delicious food and drinks. Service is good on the most part. The gentlemen was nice and super attentive. The young lady needs a lil tune up with her attitude. They give samples of the frozen drinks which is awesome. We been here a few times and I've tried different foods from pizza to seafood and so far enjoyed them all. Plan to keep trying the rest of the menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldTRQaXB3RRAB",
            "text": "Amazing all around. The service, the food, the waiter, all amazing! Our waiter Junior was extremely polite, quick, and attentive. He impressed my 6 year old so much that she wants to go back tomorrow lol, we met the owner as well. He was extremely sweet and welcoming. We will def be going back again! Definitely recommend this place."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDMjdhemhRRRAB",
            "text": "Been coming here for almost  3 years. The staff is really friendly and polite.  They do a great job keeping things clean.  The burgers are amazing, the drinks are mixed very well. I came in today and they started selling Neopolitan Pizza! I got the Margherita pie and it was amazing.\nYou get High Quality food  at very fair pricing.\nI would highly recommend coming here, try the burgers, try the pizza.Oh and before I forget SPICED CRANBERRY MOJITO.  5STARS. 10_10"
        }
    ],
    "reviews_count": 75
}