{
    "name": "Ltauha",
    "place_id": "ChIJnbOuLipcwokRqsAX-__4u2U",
    "grid": "QN5",
    "address": "55-50 Myrtle Ave, Ridgewood, NY 11385, USA",
    "rating": 4.6,
    "user_ratings_total": 683,
    "phone_number": "(347) 689-3462",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kd2VEaHdVVTFzWm1oTmVYcFpPR3hQTkhZNU4zYxAB",
            "text": "Great food and service!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acFdUUXljemRhV0dwRU4wMVhRbFZZUWpOa2VYYxAB",
            "text": "Nice neighborhood Ridgewood restaurant location at Myrtle Ave.   All entree very well season and presented.  Great Brunch menu.   Take your time and enjoy.  If you are in a rush this might not your place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSc2NVSm5WekpUWkdVM2RuZDBkemxwVkRaNWFsRRAB",
            "text": "Great brunch. Food was awesome service was great and great atmosphere. I definitely will be going back. Thank you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VlJsWlhNa2xSVmxkTVoyMVBSWFU0U1RWWWFIYxAB",
            "text": "Love this spot! Their options are great and the service is amazing. They’re always so attentive even when it gets busy. Thanks for always making our hangouts great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkM1NqZEdlRGx2YjJoME9HZDVNWGg2TWxwQlUzYxAB",
            "text": "Thank you very much. Nice place. We came at 9.30. The restaurant is open until 10pm. Since there was 30 minutes left before closing, we asked what we could order. They said - any dish from the menu. The kitchen is open.  We ordered a salad and several hot dishes. Everything was very tasty. They didn't show us by any look or gesture that it was closing time. We had dinner with a huge appetite and pleasure. We were very pleased. We regretted that we had little time and came so late. THANK YOU VERY MUCH. WE WILL DEFINITELY COME AGAIN."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdVVscHBhbFJoTTJod1VVSjROM001YWkxR1JIYxAB",
            "text": "My wife and I arrived half an hour before the official closing time, but before sitting down at the table, we checked whether we would be served. We were told that yes, we could sit down, and what's more, all the dishes on the menu were available, without restrictions. We ordered pork steak, shrimp, avocado salad and several cocktails. Everything was delicious! The waiter Davi (I hope I spelled his name correctly) was polite and courteous. Unobtrusively asked if we wanted anything else and refilled our water. Inside, it is clean and cozy, pleasant soft music is playing. We are absolutely delighted, we will definitely come back again! Thank you very much for a pleasant evening!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQV250X2FkMW9MSnpBRRAB",
            "text": "I come here all the time. This is a great spot to take families visiting from out of town and dates. Brunch, lunch, dinner are all excellent. The cocktails are great. Great portions, great service and affordable prices."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLR2R5dG5LaGI3RE53EAE",
            "text": "Amazing Staff! Great vibe as soon as you walk in. Prestine Bathroom. Excellent service. When I ordered the steak and eggs she came back and swapped out my butter knife for a steak knife; impressive. Water refills without asking, very attentive. Food was fantastic! Brunch was serving until I believe 4, but there were great selections across the board. California omelet, chicken Sandwich, roasted Potatoes were all excellent. Garlic fries were Bomb! Arnold Palmers came with a lemon and a lime! Lol. 20% gratuity was including for our group of 4. They had no problem splitting the check for us either. The ratings and reviews looked great, hence our selection to go there. Beyond impressed and pleased with our experience!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VPV2RfX3FFenRJNxAB",
            "text": "I had the special, lobster eggs Benedict.  It was served with a green salad and diced home fries.  It had the usual English muffin, poached eggs, hollandaise sauce with a hint of chipotle, and spinach sautéed in butter.  And, of course, the half lobster tail which was enough to give the dish a wonderfully robust flavor.  I savored every bite enjoying the combination of intermingled flavors.  My companions ordered the chicken fingers with fries and pancakes with a side order of bacon.  They were both very happy with their orders, but not in heaven like I was.\n\nThe service was great, too - very attentive but not hovering — and the place, though pretty busy, was quiet enough to carry on serious conversation.  I just love this wonderful neighborhood restaurant!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOU2ZzZlRyMXVXdzlRRRAB",
            "text": "The food is really great here. I often for breakfast like shrimp and grits or salmon eggs benedict and i have never been disappointed.  And the drinks are inventive and delicious.  I often go alone and the service is lovely."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJYW1oLWFCOGZ6UExnEAE",
            "text": "Feels like a bar that happens to serve decent food. Maybe the entrees are better. Onion rings were solid"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLX0xfOFNpZy1yWWVREAE",
            "text": "Ltauha is the best. We come here with our toddler all the time. They have high chairs and do a great job serving families with kids and are just consistently great."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJanFpNmdRRRAB",
            "text": "Is a must! One of the best places in the area, I love the friendliness of the staff. On point recommendations, and if you want to change something in the dish they ok with it. Highly recommend. The desserts omg! Are soooo delicious what I like about them is they are not overpowering sweet, and the drinks oh boy! Passion fruit Margarita de best"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRENsYVRmM2IydXlnRRAB",
            "text": "Good food, good service … go here if you’re catching an event at TV Eye"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbzZxLVZREAE",
            "text": "The food and service were perfection. The automatic adding of a 20% tip for a party of 5 was unexpected. Enjoy your $82 tip. We won’t be back."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMnFuTVBnEAE",
            "text": "La atención es muy buena, la comida tenía una presentación innovadora, la hamburguesa estaba deliciosa!! No tuvimos que esperar mucho por la comida ni por la bebida, un lugar recomendado para ir en familia, en pareja o solo 😊"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbUxLeUFREAE",
            "text": "Good quality food. Amazing service.  Decent prices!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NnVpSU5BEAE",
            "text": "Food is always great as well as the drinks! Services is great and fast. Always love coming here!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NU1PZzBBRRAB",
            "text": "Love how quiet the place is no matter how busy it got. Service was great & fast! Food was very good too. Lemonade and burger mediumd well cooked, was yum."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5c2JUaFlREAE",
            "text": "Service is great. Foood is great! Especially brunch. One of the best food options in Queens."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNW9QOUZBEAE",
            "text": "Ltauha is truly a hidden gem! From the moment we walked in, the friendly staff made us feel welcome and ensured our coffee and water were always topped up. We ordered the Eggs Benedict and the Chilaquiles with steak, and both dishes were absolutely delicious—every bite was packed with flavor. The orange juice tasted incredibly fresh. Everything about the experience was top-notch, and we’ll definitely be coming back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfalBiU2NnEAE",
            "text": "✨✨✨✨✨✨"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeE5HSDJ3RRAB",
            "text": "Beautiful staff, ambience, and food. Very friendly server she went above and beyond. The food was great, had a great time here. Will go again and possible again"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcGFMVWhRRRAB",
            "text": "I just recently discovered this place one morning when my partner mentioned wanting egg's benedict. Not only is their food amazing, literally everything on the menu, but the staff is warm and inviting."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NFpEVTFBRRAB",
            "text": "Always a solid place to come to in Ridgewood. Quick, friendly service and reasonable prices for how good the food is. Great place to go if you just want a relaxing place to eat."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdjRxZWZBEAE",
            "text": "Favorite place! Food is amazing and my favorite drink is the frozen mango margarita"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbk9xUExnEAE",
            "text": "Food and service were amazing. Cute place right on Myrtle ave ! Went here with my daughter and had brunch. The shrimp and grits were my fa late by far!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcE9HSnl3RRAB",
            "text": "Rarely do I come across a place that is serving excellent dishes.. everything I tried was was delicious and accompanied by attentive and friendly service… would definitely recommend to anyone looking to dine in Ridgewood Queens.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcExETVJREAE",
            "text": "Great food :) excellent service .."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURramJPZ1ZnEAE",
            "text": "If you tired of burgers this cozy restaurant will be a much better option for healthy food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNTlUcFZnEAE",
            "text": "Food was good. The atmosphere was nice. Only thing was chips were stale. Not a big deal but wouldn't take it off the bill."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuLWRLSHN3RRAB",
            "text": "We've been a few times now and it hasn't disappointed. The food is of high quality and cooked to perfection. Even the kid's chicken fingers were hand battered and juicy. I can't recommend this place enough."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuME1EUEdBEAE",
            "text": "Always order the dinner specials when I come here they blow me away each time. The staff is so friendly and it’s the best brunch on the neighborhood… ahh almost forget best drinks!! very highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURILWNlRTN3RRAB",
            "text": "My favorite burger in the city and the service is always fantastic. I've been going since they opened, they're great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIaUxxdmRBEAE",
            "text": "This is Ridgewood's most underrated restaurant! It's so much tastier than the trendy/hyped ones in the area. For dinner, I've had the duck and lamb, both just cooked to perfection. Also just had the fried artichoke salad, and it was delicious!! The decor/atmosphere is just a little old school, but who cares! And service is always wonderful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMDdfYWpRRRAB",
            "text": "Good food, good service, always."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dE56SE9REAE",
            "text": "Great lunch spot. Friendly service and decent portions for what your pay (19 dollars for a sandwich)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNid296SWlBRRAB",
            "text": "Never had a bad meal here and the service is top notch! Very kind folks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydjVXbU13EAE",
            "text": "Tasty and flavorful dishes.  Came for brunch where they offered happy hour drink specials and delicious cocktails!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyb1BxWnN3RRAB",
            "text": "Awesome place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycHJ6UDdRRRAB",
            "text": "Great local spot in the area. Have gone a few times. The drinks are solid, prices are reasonable and the brunch is great. The huevos rancheros is probably one of my favorite things on the menu. Fried chicken sandwich is great as well. Burger can be overcooked so go one level lighter than you usually go but still flavorful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbDRXR213RRAB",
            "text": "We ordered steak and eggs. The steak tasted like reheated/old, with a grey looking appearance, in my opinion it was not even “regular” it was bad"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OWVYUGpnRRAB",
            "text": "I came in for brunch and ordered huevos rancheros. I definitely recommend, 100/10. Service is excellent, always attentive and food/drinks is always amazing. It’s family friendly and also nice for a girls date."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dEwzVDh3RRAB",
            "text": "This restaurant is amazing. The food is amazing along with the service and atmosphere. Date nights have been at this restaurant these days, we just can’t get enough! My favorite is their flat iron steak and their pan seared salmon- delicious!!!! best steak I’ve ever had and the taste of the food is consistent every time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6b2RqUUR3EAE",
            "text": "Everything we ordered was beautiful and delicious.  The fried artichoke appetizer was crisp and delicious.  My Veggie Burger had great taste and texture, house made onion rings were crispy and light.  Others at our table enjoyed Salmon and Asparagus, Steak and Spinach and Shrimp and Pasta.  They also loved the deserts; Coffee Panna Cotta and a cake with ice cream and berries on top.  The cocktail with gin, cucumber juice and basil was a refreshing complement to the meal.\n\nFriendly servers.\n\nAtmosphere was comfortable.  Toilets were down a flight a stairs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cE9iYkxnEAE",
            "text": "food, drinks, and service are always reliably excellent. their dinner menu is so comforting, they have one of the best burgers in nyc (in my opinion), and i’d highly recommend the red sangria (or watermelon margs if they’re in season)! everyone who works there is kind and welcoming. ltauha is a hidden gem and definitely one of the best restaurants in the neighborhood. go try it 😇"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeXYtaXJRRRAB",
            "text": "great food, amazing service. My go to"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcE5iT013EAE",
            "text": "Consistently Great! I have never made a bad choice since they opened probably 10yrs already. That's so rare. I started going here when they waited for their liquor license.  Just never disappointed.  I had the habanero mango wings last week and I've thought of them ever since!!! OMG  the half chicken  the burger. Brussel sprouts  Duck Ragu . Just go!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqeXNTSFBnEAE",
            "text": "The food is great and the staff are friendly, easy going, and provide good service. They serve good drinks. The music isn’t the best, it is usually old music that ranges from rhythm and blues, rock, and similar. Some of it is even from the 50s, 60s era like Elvis. Despite the needs for more modern music, I come back because it is local and I can count on a nice, relaxing environment. I’ve posted pictures because they don’t have an updated menu anywhere and it changes."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaDQ3Q2JBEAE",
            "text": "Brunch was delicious no complaints here. Our server Marvin was very polite. The service over all was excellent. Food was so good. The steak to perfection and mimosas were thirst quenching. Waited 15 minutes to be seated."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1Z2NqclhREAE",
            "text": "The food was so good! The mashed potatoes were tender and delightful. The oysters were super fresh. The passion fruit margarita was flavorful and strong. I was lit. The playlist was a great blend of old and new school, worldly vibes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCM05UNHVBRRAB",
            "text": "Brunch was good and service was nice and adequate. I asked for a medium rare steak and it turned out to be more of a medium-well, so I think they can improve on how they cook their steak since I also read on a previous review about this. The cocktail was pretty good. I had the Cranberry Mojito and I did like it a lot. Overall not bad."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdDZiTTdRRRAB",
            "text": "We went for dinner and the food was really good. The branzino was crispy, the risotto super creamy and the steak was juicy and cooked perfectly. We also had mussels to start not pictured which had an interesting spice and tomato, corn, cilantro in the broth.     Apple crumble was delicious warm with ice cream"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1akpuTnRnRRAB",
            "text": "I was searching for a really awesome pre-dinner Happy Hour cocktail and oysters and landed at Ltauha. Upon entering the dimly-lit establishment, I was warmly greeted by the bartender. The ambiance is quite romantic. This place is perfect for date night.\nMy server was kind and efficient.\nI prefer my oysters to be grilled, so I opted for the Brussel Sprouts instead and the Spicy Pineapple Margherita. Both were absolutely delicious. The brussel sprouts were roasted to perfection, the bacon added a wonderful smokiness, and the parmesan added a creaminess that was unexpected but welcomed. My cocktail was absolutely dynamite; well-balanced with the right amount of spice.\nAlthough my time was short, L'tauha fantastically executed the two items that I ordered."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdFBYbE9REAE",
            "text": "This place is the definition of a hidden gem! You walk in and would never think the food is as good as it is. Every dish was cooked to perfection. I personally got the steak with Brussel sprouts and potatoes and wow so good! Best brussel sprouts I’ve had! The steak was cooked perfectly and juicy. I tried my friends dishes too and each was sooo good as well. Definitely coming back here. I recommend 100%"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpaElhc0lnEAE",
            "text": "We’ve been here a couple times and each time is better than the last. The pictures don’t do their presentation justice as we dug right in before I could remember to take photos. We got the mussels, a scallop and brussel sprout special, and…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dE9uZlBnEAE",
            "text": "went there twice and love their brunch menu, definitely coming back to try everything on the menu ! the shrimp with sunny side fried eggs is my favourtie so far"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad19qTHJBRRAB",
            "text": "I went here because we had a school event and they donated breakfast to us and the pancakes were soo good that I decided to try and actually go to the restaurant.  I must say the food was sooo sooo good I loved it and the drinks were also good. My server was Gabriela and she was very attentive and very nice and friendly, will definitely return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdzdEN1VBEAE",
            "text": "Fantastic! I haven't been here in a while due to pandemic. They never disappoint.  Every meal I have had,I have loved. I went for brunch yesterday,  I had the chicken and waffles eggs Benedict w chipotle hollandaise sauce. SLAMMMMMMIN! Thanks guys! Be back soon!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJeDhudm5RRRAB",
            "text": "I'm sorry to report a less than stellar visit to this highly rated spot.  Upon arriving with my 13 year old for lunch, we were given the brunch menu, which was extremely limited for a gluten free patron (not the reason for the poor review). The fact is that if you don't want to eat breakfast (eggs) then there were no gluten free options.  The manager was brought to my table and I asked if there was anything they could do beyond the eggs on the menu.  The answer was no. Having been in the restaurant business since 2005, I was upset by this answer.  The fact is, that any restaurant can do something to fix a situation like this. It simply requires a little bit of extra effort. It wasn't busy, they simply didn't want to help.  Ok! I'll deal with it and eat eggs.  Our food arrived and this was really the sad part, portion sizes left me hungry at the end of my meal and seasoning was seriously lacking--verging on bland.  In their defense, my 13 year old loved her Mac and Cheese.  Unfortunately, I left unsatisfied.  In the end, everyone has a bad day, but their unwillingness to throw a piece of meat on the grill and plate it over some veggies, or anything really, was upsetting."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycjRxOVlREAE",
            "text": "Clean, friendly and customer service was excellent. It was my first time having poached egg and I was not disappointed. Only concern was my skirt steak, I asked for medium well and got a medium rare steak , not how I usually eat my 🥩 but overall had a good brunch with Great music!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOFludWlRRRAB",
            "text": "Once you enter the door at this establishment you have the feeling that you will be getting good service and that so was the case. The food was made the way it was asked and the waiter was amazing at explaining the history of the establishment and recommendations 😀. I encourage you all to check out Ltauha whenever you can."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNkx1bC13RRAB",
            "text": "Yummy, great food! I had the chicken sandwich and it was pretty darn good. The staff are attentive and the place has a lot of brunch like options. In terms of what’s in the area, this is probably one of the best brunch places I’ve been to thus far so I’d recommend eating here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodWR6eW5nRRAB",
            "text": "Really enjoyed my food.\nDrink - Hibiscus Margarita\nFood - Chilaquiles with chicken and sunny side up eggs\n\nFamily friendly, clean bathroom, and nice staff. Food came fast and was amazing."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNbUxpcXZRRRAB",
            "text": "A little pricey but so good! I think this is the eggs benedict florentine???? It comes with spinach? My favorite part was the pat of butter between the English muffin and the spinach 🤤 I normally don't eat the little mixed greens that come with, but this one was good! I had the margarita with, which was *chef's kiss* Great service!…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMGV1dFdBEAE",
            "text": "My son got married 3 years ago in June.. Food was delicious, specially the salmon. Great place to do small gatherings.. It has two floors ."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNNTRtYklBEAE",
            "text": "Solid brunch experience. Get the chilaquiles, I've had trouble finding a decent execution of this and they have a nice, crunchy, saucy, and tasty."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2b2FXQ1RnEAE",
            "text": "We had a great time at brunch. If you are in the area, it is a must visit. Service was great. We sat outside, cannot comment about inside eating. Check out the pictures."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOTg3V21nRRAB",
            "text": "Such a lowkey spot service was amazing, food was delicious and drinks were strong and delicious they have happy hour and have a great selection of drinks."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDM0xPc0tBEAE",
            "text": "On the search for a nice little brunch spot in the area we found Ltauha Restaurant in Ridgewood NY.\nDue the NY law it is not allowed to eat inside a restaurant in nyc at the moment. But they had a nice little boardwalk and street eat set up.\n\nTables placed apart, staff wears mask at all the time. Laminated menu are offered.\n\nThe Food was fantastic we had pancakes, grits and schrimp and ravaneros ... fresh pressed orange juice, coffee and lemonade ...\n\nWaiters are nice too.\n\nI would recommend the place to everyone and would come back for sure."
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnd3B6VFV3EAE",
            "text": "So upset $14 down the drain the burger was okay the fries were horrible and they were saggy seemed like old fries to me. Seemed REFRIED!First and last time smh! Had heard so many great things but i guess when its delivering they fall off hard. Got home with horrible stomach ache!!😔…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBanVuOGlBRRAB",
            "text": "Best $10 breakfast ever! Super good food for a good price, appropriate portion size and nice ambience. I had a lovely time with my friends."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDanQzV0lnEAE",
            "text": "A friend recommended to try this place Hesitate for months but with pandemic going on I decided to give it a chance... and wowww I should’ve done before burger absolutely delicious and in right temperature just how I ordered, by the way I used DoorDash one of my favorite apps"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cnVxTVdBEAE",
            "text": "Everything we have had here is superb; we especially love the Rib-Eye Steak.\nTheir Onion Rings, on a scale of 1-10 rate an 11.\nIf you can't believe it, then try and comment.\nThe people there are the Best, they always go above and beyond.\nWe go there as a couple, while double-dating, and for big events, like my 64th birthday with almost 20 people from around the country.\nI was just treated to an amazing Fathers' Day Dinner. We had Pork Shank with Orzo with Molé Sauce, Wild Scottish Salmon, Braised Chard, Rainbow Beets in Lemon Butter Sauce, and their superb Onion Rings."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcDRUdUF3EAE",
            "text": "Understated spot, really well done brunch options with a twist. Loved it! We each got a dish and then split the French toast. So good"
        }
    ],
    "reviews_count": 75
}