{
    "name": "La Lanterna Cafe & Grill",
    "place_id": "ChIJm46NP6jkwokRNBfVei3bb3c",
    "grid": "QN5",
    "address": "29 W Ridgewood Ave, Ridgewood, NJ 07450, USA",
    "rating": 4.7,
    "user_ratings_total": 289,
    "phone_number": "(201) 444-5520",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tveVRWUTJZbXREYzBSMVZXb3hTWFptVkVGekxWRRAB",
            "text": "We are new to the area and decided to try La Lanterna today. We were running around with our kids and dog, we called to see if they had outdoor seating, they don't but they have like a covered front porch area. We spoke with Joanne who right away was so warm and accomodating, this was before we even got there. Once we arrived our table was ready and they had water for our dog ready. I have a sore throat so I cannot eat anything acidic, they made me a DELICIOUS Alfredo sauce. Our kids loved the bolognese and their magical chocolate milk and my husband absorbed his chicken parm. Everything was excellent, the service was excellent and Joanne is excellent! We will be loyal customers from now on. Thank you for making us feel right at home just from the phone call all the way until the end of service. La Lanterna is a jewel of the town."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWc1gycG5aMVE1TlhwbE4yeFZUbFUxT0VFNWNFRRAB",
            "text": "Always a fantastic experience!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1c2VIVkZObGxUUmxCMlVXUlVkMkZHWjE5d1NuYxAB",
            "text": "The best Italian restaurant in Ridgewood Nj"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORE5FbFBSRlJWVDFBMGJWUTNibVo1V1hGSFkxRRAB",
            "text": "WOW what a fantastic restaurant. Owner chef and hostess husband and wife make the evening just a fantastic night out. Unique spins on some favorites that turn up the flavor to an amazing new level. Fabulous service great atmosphere. Highly recommend."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdjg1ckxMNS1UcGpBRRAB",
            "text": "Thank you for a wonderful date night. Truly enjoyed the grilled octopus. And so nice to meet with Joanne who I truly admire from all the reviews here. Happy birthday to your granddaughter! They are so lovely!\n\nJoanne is amazing! She’s the one when you have a bad day, you feel like to come to eat to get the comfort from home… food is amazing… service is attentive… but she’s the key to make the difference!  Salute to Joanne!! Have a great Sunday and please take care of yourself as you take care of all of us\n\nUpdated : thinking about Joanne always put a smile on my face even I’m far away in key west or Michigan … and as google rated me as top 10 % reviewers on Italian restaurants I will repeat myself again above and make up a review on the Italian restaurant in Venice Italy by the river near the bridge … too bad my purse got robbed and I lost the business card… the manger and handsome manager back to Italy from short hill nj just reminded me of Joanne … more to write but I’m traveling and lost whatsup number of Joanne … welcome back and I hope you had an amazing vacation in your hubby’s home town … beautiful Greece brings good vibes…\n\nUpdated with new dish I tried today ! Love it! And Joanne brought me my most favorite salad first. She is amazing and everyone eat here and work here just looks so happy.\n\nAnother reason I think this is the best restaurant in town is that the girl would be truly inspired by Joanne to be a better wife. And the man would be inspired to be a better husband as this is a great husband and wife and family ran business… love Christopher who’s a school teacher helping their parents and my most favorite little girl in town also named Sophie… to eat here is a true inspiration and family is the most important thing in life …"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aExYWmpZMFJxZFRkTVRXNUNVVlYzVjA5c2FWRRAB",
            "text": "Good food & great atmosphere with such sweet staff!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WYU5FZEtVR3RCYWxwSk1XdE1PRTh0VkU1M1QyYxAB",
            "text": "Great food.  Enjoyed burata salad and seafood salads.  Salmon entree was moist,  tasty and large."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sc2MxVlNVa1p1ZFU0ME1FRldaMGRIY21oME5IYxAB",
            "text": "This place was awesome! We went for my girlfriend’s birthday, and it was amazing. The owner (did not get her name) made us feel at home! She shared all of the specials with us (we got the burrata and the guacamole), and ordered the shrimp and the eggplant parm for dinner: 10/10. The service was amazing, the ambiance was amazing, and the prices were fair! I would recommend anyone going. I am all for the experience and this was a 10/10 thank you for making her birthday special!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRFJURktaVVZvWlhjeE5YazFWVVZoTjNGVE5YYxAB",
            "text": "Excellent service, great food and very nice ambiance. Definitely recommend it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMWRVeFpjV040YlZSS00wdERhMjVFWVU1WFdsRRAB",
            "text": "My husband I went last night for the first time.  The food was superb as well as the service.  The specials were explained explicitly and the mussels appetizer was out of this world.  The sauce was excellent.  We will definitely be back!  ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNVRHNUhNMlJZVUVwek0xbDNkMUJPTkhobE1rRRAB",
            "text": "Great food, wonderful people. Would definitely return!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pad2FFOXhVRlU1VjJOU1QyeEZSMWxJVm10MllsRRAB",
            "text": "The food was fantastic, the place very cozy and lovely, and the service was absolutely perfect. New favorite place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOX2kzdXllME1lUnJRRRAB",
            "text": "I can not say enough about this place. I needed a place where 11 people from different areas of three different states could meet for a bachelorette lunch. I pulled up a map, pinned everyone's location, knew we wanted to be near the GSP and put my finger on Ridgewood.  We were looking for and Italian BYOB and after reading many Google reviews chose La Lanterna. The owner was just a doll, the servers were great, and the food was amazing.  You would think for a smaller place the menu would be limited but the regular menu has a lot to choose from and they offered a crazy number of specials.  It was truly like we were in a family dinning room for Sunday dinner. Definitely, our meeting place go-to from now on!  Bravo!!! Oh, and to the people of Ridgewood, what an adorable town.  I had never been, it's like a fairytale in the middle of NJ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKajE5NzJ4eXVIbVBREAE",
            "text": "Everything here felt made with love. Staff was so warm and welcoming."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMMmMtWWJobWY3UV9RRRAB",
            "text": "Delicious food, perfect service, splendid night out!  Craving our next DateNight!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJeXMxNV9SaThxNG5RRRAB",
            "text": "Had a spectacular meal at La Lanterna, the atmosphere and the food were top notch. But the service took the cake. The owner, Joanne, and her family took great care of us."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbjV4NVRLeXBMc2h3RRAB",
            "text": "Had a wonderful experience at La Lanterna. Our host Jo Anne couldn't haven't been more accommodating upon arrival and started our experience off very well. The food and ambience were fantastic and to close, their dessert selection had so many options it was incredibly hard to choose. The service was excellent as well. Will definitely be back !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVDJrdXJyM05ETEZ3EAE",
            "text": "I just hosted a bridal luncheon at this lovely restaurant and I couldn't have been more pleased. The warmth and personal  attention to detail , ,the delicious food and the professional and friendly service received rave reviews from everyone,including, 18 month old Aurora..Thank you for making this special occasion  a memory to treasure.  Sincerely, Dorothy Fletcher"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQejd3NnZDeVpyMnRBRRAB",
            "text": "This is a privately owned restaurant. BYOB, Semi casual dress the Husband is the chef. His wife is the hostess and not only seats you. She returns to check if you need anything several times during your stay. It's a homey place, family photos are scattered around, they have furniture in the dining rooms, and it reminds you of Grammas house. The food is freshly made, chef shops at the fish market,  but also the Farmers market for the vegetables.  This restaurant is pricey,  definitely a place for an occasion /celebration."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcDdUb05REAE",
            "text": "Wow....Perfection!!!! Again and Again!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OU52S2xBRRAB",
            "text": "Owner warmly greeted our party of nine and gave a comprehensive rundown on the specials"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN0syWnhRRRAB",
            "text": "Always a good meal. Definitely make a reservation! BYOB...."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndE4zUzhBRRAB",
            "text": "La Lanterna in delivers an amazing dining experience. The food is absolutely outstanding—every dish burst with flavor and expertly prepared. The presentation of the extensive daily specials was one of the most impressive I’ve ever encountered, making it nearly impossible to choose just one. The ambiance is warm and inviting, reminiscent of dining in an elegant private estate. From start to finish, an unforgettable meal. Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdl9UUGF3EAE",
            "text": "Joanne and her staff took such good care of our party. You must go here with your loved ones and experience an amazing atmosphere."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBenViSFBBEAE",
            "text": "Great Italian food with friendly service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfamVfSUJREAE",
            "text": "My girlfriend and I were being spontaneous in Ridgewood trying to find places to eat for date night. She was in the mood for some Italian food and the first place we went to had rejected us because we didn’t have a reservation. So we googled other restaurants nearby and ended up walking over to La Lanterna. I did not realize they also required a reservation but understandably, it was a busy Friday night. So as we got ready to walk away from our second restaurant of the night, the owner (I think) Ms. Joanne (I hope I spelled your name correctly) said, “Actually, we can seat you guys at one of the reserved tables but you just need to be done by 7-7:15 before the reserved party comes.” That gave us almost 2 hours to sit and eat so I took her up on her offer because I did not want to walk back outside in the cold again.\nThe vibe of the restaurant threw me off because I didn’t realize it was a “fancy” restaurant. However, she and her crew really gave us great service and made us feel cozy. I got the linguini which was super creamy and delicious. My girlfriend got the salmon. Both meals were spectacular. We made sure to be out by 6:30 so they could prepare our table for the reserved party coming in.\nOn my way out I made sure to thank the hostess/owner Joanne who was super kind to us for letting us sit and eat when she could have easily turned us down like the previous restaurant. The food, the workers, and the ambiance were fantastic. I also noticed how Ms. Joanne knew all the customers names who came in and greeted them so nicely like they were real life friends who were regulars at her restaurant. I shared a short conversation with her at the end before leaving and she gave off mother/grandma vibes, she is an awesome lady and I will be back at this excellent restaurant. Thank you for the night!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdy1HYzhBRRAB",
            "text": "Well what a nice surprise! On New Year's top notch food, service and a great ambiance. The shrimps (size 15) were perfect, scallops were perfect, Tagliatelle perfect, swordfish delicious, hot appetizers perfect, I guess just a nice surprise... The wife and husband team even sent everyone away with a personal pantone. Highly, highly recommend, oh and the desserts... What a selection and yummy."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeGIteFlBEAE",
            "text": "Superb food and service as always! Joanne, the owner, is always professional, warm, and makes you feel like family. My husband and I love coming back here, and we can't recommend this place enough to our friends and family!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNEpQdDZnRRAB",
            "text": "While the atmosphere is good and the service is better than good the food while very plentiful is lacking and expensive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYLXI3aE1BEAE",
            "text": "Amazing dining experience. Must go! Felt like family and the food reminded me of what Grandma from Italy cooked. Loved the food, service, and ambiance xo Colette"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeXVLeWZBEAE",
            "text": "First time with a friend that knew everyone. Atmosphere is wonderful. Staff all very attentive.  5 of us all ordered specials and no one was disappointed.  Owner was gracious and attentive even when it got crowded. This is a must go location in Ridgewood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MnVDT1dnEAE",
            "text": "The owner came to our table to explain all the specials and later on to make sure our meals were satisfactory. Very nice atmosphere and all of meals (6 of us) were very good. I had linguine and clam sauce, it was perfect. Thank you"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bXBHdXJ3RRAB",
            "text": "Our group of six were sat inside the main room. The decor is beautifully decorated with a welcoming atmosphere. We had a mix of specials and menu items. The appetizers and dinners were delicious full servings.  The dessert plate offered a mouth watering selection. The friendly owner came to the table twice to explain the specials, and to make sure that everything was good with our meals. Our table was well attended to by servers, and the byob service allows for a great meal at a very reasonable price. I look forward to returning to try the outdoor seating when the weather is cooler. This is by far one of the best restaurants in Ridgewood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNmNUSUtnEAE",
            "text": "Great food and great service. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURia00tVVh3EAE",
            "text": "Went to La Lanterna Cafe in Ridgewood for dinner and absolutely enjoyed my experience.  The food was amazing and the staff was friendly and professional.   We were greeted by the owners wife who was such a lovely women and one of reasons I am writing this review, the other is for the food and atmosphere.  Compliments to the chef for having such a wide range of food choices, it was hard to decide. I will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbFB2SEJnEAE",
            "text": "The food was delicious.  I had the steak- grilled.  The restaurant owner was so friendly and knew exactly the specials.  Great crew, great ambiance, and delicious food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bl82WUJREAE",
            "text": "Had an excellent time here. Food was solid and the customer service was out of This world. Joanne is so thoughtful and kind. You can tell that she wants to be there and her husband Paul cooks amazing. A nice infusion of options for Greek and Italian. Would definitely come back here again. Pound for pound one of the best BYOBs around and restaurants in general."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqLXY3TUNnEAE",
            "text": "La laterna is our new absolute favorite, we are so glad we could find OUR spot, anything you eat there is amazing. The owners are so lovely and welcoming, every time me and my daughter go we feel so homely . Joanne is wonderful!! Highly highly recommended if looking for authentic Italian food!!!! Our server Katrina is always a pleasure. Overall I would give 100 stars if I could!! ♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN2J1dTV3RRAB",
            "text": "Celiac Annie and I arrived on a recent Saturday evening for dinner.  There was a very slight pause before being seated as the hostess (owner?) was reading off the specials in detail.  It was packed and I'd highly recommend reservations (limited hours) for the weekends.  We had the burrata special for appetizer followed by the white clam sauce with gluten free linguini and shrimp scampi with linguini.  We've been to most of the surrounding restaurants and we seriously blown away by the quality and taste of the food.  Our waiter was highly attentive and the fact that is was BYOB was a huge plus.  We both cannot wait to return.  Most restaurants with gluten free options usually offer only gluten free rigatoni.  We loved that they had gluten free pasta to match the original dish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNk9LSEpnEAE",
            "text": "Wonderful hospitality. !!\nAmazing pork chop dish. Love the lemon cello"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeC1EOXdRRRAB",
            "text": "So welcoming and great to see family owned restaurants thriving.  Specials start with \"my husband has prepared for tonight\" and then follow thru with lovely presentation.   Though paper menu offers many options, highly  recommend ordering everything off the specials.   Also, I like how the location is away from the main RW area, makes parking easier.   Wine seller a block away for BYO pickup.  Will have to come back when temp is better for outside dining"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMEtXNjRnRRAB",
            "text": "Excellent food, very warm friendly service and a great atmosphere."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLMG8tYWR3EAE",
            "text": "Lovely family run restaurant. Joann is delightful. Hard working family.  Good food Good Value."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMjhEZDNRRRAB",
            "text": "We had our baby shower at La Lanterna in October 2023. Joanne, the owner, was more than helpful with all of the preparations from beginning to end. We felt like one of her family. The food, the atmosphere, the service, and the attention to detail made our day a memory to be cherished always.❤️❤️❤️❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkeGUtUmRREAE",
            "text": "Excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcDh5aU1nEAE",
            "text": "Feels like home.!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkc2Y3eXl3RRAB",
            "text": "My family and I have been going here for years. YEARS lol\nFood is always so good, fresh, and delicious.\nService is decent, friendly, and attentive.\nThe owners are super kind and always remember us! They even offer to take group photos for special occasions and have that personable touch.\nDesserts are devine. 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbHFQNDZ3RRAB",
            "text": "Might be my new favorite local restaurant. I have no idea how I haven’t been going here my whole life. Amazing family run business. Dad is the Chef, Mom manages the front of house and son is part of the wait staff. Family is SUPER hospitable and makes you feel right at home. Hard to not support a great family run business that takes great pride in their food and dining experience. We’ll be loyal customers going forward."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0OTRYbWJnEAE",
            "text": "We were a table of 5 this evening and sat in the “Brick Room”. From the first moment we walked in, we experienced superb client service, warmly greeted and seated promptly. The Specials were shared with us and sounded terrific   We shared 3 appetizers, including Burrata, Stuffed Eggplant and Mussels—absolutely delicious.\nOur entrees were chosen from the Specials:  scallops with mushrooms and risotto (2), Homemade Rigatoni with lobster tail & clams, (1), fish with baby clams(2).\nEverything was delicious, wine refills were poured properly, and staff was very attentive.\nIt was an absolute joy to dine in La Lanterna this evening as we celebrated a birthday!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0eUwzTHJRRRAB",
            "text": "There is so much to say about this little gem off the main strip of Ridgewood.  The staff could not possibly be more friendly and welcoming.  The zucchini starter was to die for.  The entrees so many to choose from. I had a bite of everyone's at my table each one more delicious than the next! The dessert options are also plentiful.  We tried 4 and we each had a clear favorite.  10/10 recommend!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVcDktR1B3EAE",
            "text": "Very pretty restaurant located in beautiful Ridgewood New Jersey. Family-owned and food is delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcHJ2S3RBRRAB",
            "text": "Wonderful place to have a nice Italian meal. The husband and wife (chef and maitre'd, respectively) run the restaurant very well and their employees are quite attentive. We went on a busy, cold day and she went out of her way to find us a spot to wait for a table that was comfortable and warm and brought us out a free appetizer. We were very happy with the service and the meals (a pesto dish, a bronzino and a seafood linguine in tomato broth) were beautifully presented and perfectly prepared. Well worth the trip if you live in northern NJ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROdF9pUkRnEAE",
            "text": "My new favorite restaurant!  Very, very good, Authentic italian food.\nGreat atmosphere, great wine!  Family owned and run...which I love. They care about the details and really love sharing the details of the flavors going into the dishes"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdzd5Q3NRRRAB",
            "text": "Went for my birthday dinner- The food was amazing. The restaurant is very cozy and has a really nice ambience. Big portions and the service was phenomenal. The owner is there and takes a special interest in making sure your night is perfect. Thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbHNxT0xREAE",
            "text": "Enjoyed a wonderful date night here on Saturday. They were busy and kind enough to call us back to squeeze us in and find a table last minute. The food was delicious and great portion size! I had the shrimp scampi which was absolutely favorful! We are already looking forward to coming back very soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWXzVLaFd3EAE",
            "text": "My friends and I enjoyed a delicious dinner! Joanne was so friendly and accommodating for our party of 10 and was even able to provide us with a round table! We are all looking forward to coming back again for the amazing food and service! Thank you Joanne!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMC1uS2xRRRAB",
            "text": "Very good local, family owned Italian restaurant. Appropriate, initmate atmosphere; attentive, nice staff, and very good, yet not very adventurous, menu and evening specials. If a very good, intimate romantic dinner is what you want, then make a reservation, grab a bottle of red wine and enjoy the evening. You won't be disappointed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPcmItMVp3EAE",
            "text": "I just attended a 15 person family dinner at La Lanterna.\nThe room was perfect size.\nThe Service was excellent.\nThe Food was delicious and they offered us multiple entree options with a fixed price that was reasonable.\nThe owner paid attention to detail and made sure everyone was enjoying the restaurant and food.\nI highly recommend the restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNkw2TUVREAE",
            "text": "I recently dined at La Lanterna and it left me with mixed feelings. The service was nothing short of excellent; the staff was attentive, friendly, and accommodating, making us feel like a truly valued customer. However, I must admit that the food fell short of my expectations. The pasta dishes were unfortunately overcooked, chicken was not tender, and the zuccini flowers were just mashed up and not actually stuffed.\nAdditionally, I found the dishes lacking in flavor and more on the ordinary side and a bit pricy for the quality, leaving me longing for more vibrant tastes to complement the otherwise pleasant atmosphere. While the outstanding service made for a memorable evening, I hope the kitchen can elevate their culinary offerings to match the level of service provided."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdFBlbWNnEAE",
            "text": "Delicious meals prepared fresh in a comfortable atmosphere. The service was great. I had the mahi mahi with a side of polenta which was outstanding. Looking forward to coming back again soon!\nThe ambiance reminded me of some of the small wineries in Tuscany."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMlp6bnB3RRAB",
            "text": "My girlfriend wanted to take my parents out for some Italian food. She found this place on Google and got some recommendations from friends and colleagues. Sure enough, everything lived up to our expectations. Food was great, the waitress we had was funny, interactive, and most importantly made us felt welcomed.\n\nOverall, we had such a great experience and we will definitely be back soon!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXb3J5NTFnRRAB",
            "text": "Great! What a difference the new chef has made. Every dish my wife and I ordered was excellent.. Each dish was impeccably prepared. This is certainly some of the finest Italian food we've ever had. We will certainly be coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaTZDdXVBRRAB",
            "text": "A search for a restaurant while in Ridgewood for the street fair helped us find this gem. Excellent menu, many specials & the service was top notch. Family operated & though it was our first time made us feel like we were regulars. Food was fantastic! I highly recommend this restaurant. You won't be disappointed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNkotNVp3EAE",
            "text": "Fantastic! Didn’t realize the restaurant was recently sold and has a new owner who we met and is very nice. Food is even better than before if that’s possible! Scallops with risotto was perfect. Mussels were delicious. Always loved the atmosphere. Perfect spot for a low key dinner !"
        }
    ],
    "reviews_count": 64
}