{
    "name": "Fonda La Consentida NY",
    "place_id": "ChIJZ5F02UVfwokR8xvuBiQAdpI",
    "grid": "QN5",
    "address": "59-60 55th Rd, Maspeth, NY 11378, USA",
    "rating": 4.4,
    "user_ratings_total": 698,
    "phone_number": "(929) 525-7077",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwR1ZVNWxlR0pyUkVnMFFtVTBObmd5VjJnNFIyYxAB",
            "text": "Great drinks, food, and services."
        },
        {
            "date": "1일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aVkyWkZlV1pTV1ZONUxXYzJibWxvV2pOaldXYxAB",
            "text": "Vallan pidan ese sancocho, que delicia ave María!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwa1FrVktia000VG1VelFYUlZNRkJEZUhNMFVYYxAB",
            "text": "Great restaurant food was good !! presentation I really liked\nAnd service was  excellent we were service by Natalia   .\nSincerely recommended 10/10"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVWNHRkxibFEyVlZwNFZEUnpkekpxTkRnek5VRRAB",
            "text": "El ambiente es de otro nivel vale la pena asistir\nVolveré pronto muy buenos eventos en vivo"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkZk5HNUVNV1oxUjB0dFgzazFVMGxNWlU4NUxWRRAB",
            "text": "I wanted to give a good review but sorry this place is overpriced for  food thats not so flavored. Meat wasn't tasty at all, could not even eat it. Drinks were expensive. Waste of $400. We came to celebrate my birthday in June, with my kids. I dont recommend bringing young children, due to the waitresses dress code. The only nice things were the Mexican decorations."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNFlVOU1XV1pZZW14aFNtOVBkekl5YWxWVVVVRRAB",
            "text": "Me encantó el ambiente súper bueno el lugar muy bueno todo, quedé muy feliz y encantado con el servicio quedé muy feliz y satisfecho la mesera el ambiente full son los mejores amo visitar la consentida la mesera fue tan amable la amé súper buena quedé muy muy feliz volvería siempre a este lugar hacen un excelente trabajo"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkQlNYZEdjbkpzYUZkcU0wUjFRMkowWmxkbVkyYxAB",
            "text": "Todo muy rico el ambiente muy lindo"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscU9UbERNbmhRVjJKWlR6RkxMVTVoVlRaVlRWRRAB",
            "text": "La atención en este bar es simplemente excelente. Desde que llegamos nos recibieron con una sonrisa y siempre estuvieron pendientes de lo que necesitábamos. El personal es muy amable, rápido y atento a cada detalle, lo que hace que la experiencia sea mucho más agradable. Además, el ambiente es acogedor y se nota que realmente se preocupan por dar un buen servicio. ¡Sin duda volveré y lo recomiendo al 100%!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toS1pHWllORUpVTTNRNU9GaENaM1JoYVVVdGVrRRAB",
            "text": "Very good music, very nice staff, and the healthy and friendly atmosphere, I loved it, I would go back, I only ordered an appetizer called (picada ) and I really didn't like it that much, I think they should put more meat, and the large one is super big and can eat about 8 people."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNE1YbDNOVUZTV1VoeFNsWnJNblZxVEY5d05tYxAB",
            "text": "This place is absolutely ridiculous. They wanted to charge $50 entrance fee supposedly cause they had an event. Arrived at 9 to have dinner and the bouncer wanted me to pay $50 cause there was an event (live music) at 9:30. Place was empty. I’ve recommended this place to a few friends but after this I’ll go some place else. Plenty to go to in NY.\nJust wanted to have dinner at the bar, latest I would have been out by 1030. And you wanna make me pay $50 for an hour of live music? Besides, I arrived at 9, not 9:30.  Hell $50 is ridiculous regardless even if staying."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNM1VWQkRVR3RMZW5aRGFUQkhSRU40VVhaRVRIYxAB",
            "text": "Me encanto, el servicio increíble, buena música."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMk5IUjVTbkJQU1hwdlNUazJZVlpMTmtJeGIzYxAB",
            "text": "Their food is amazing and their drinks are the best!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWVdEWnFjV3hsVFcxWVRXVTBOa0V4WWpJM2JGRRAB",
            "text": "Comida muy rica atención excelente"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oYVMzVmZOa2hWZUZkSFJ6WTVRMHBEWjA5WFIwRRAB",
            "text": "Espectacular el ambiente"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNVYzQlVXblYzY1V0WloyWlNTbUkxUzNoYWRsRRAB",
            "text": "The best bar/restaurant in NYC! I love the atmosphere, service and the food! I highly recommend it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVVMxQnJaMmxIU2xwbmNHOVpkR0p4V0hKRGJsRRAB",
            "text": "I really tried to give this place a chance, but everything about it was a disappointment. The food was way too overpriced for how mid it tasted. No flavor, no effort just presentation with no real quality behind it. I’ve had better meals at spots that cost half the price.\n\nThe cocktails were $20+ for weak, watered-down drinks that didn’t even taste good. I could’ve made a better one at home for $5. And they had the nerve to charge $5 for what was basically a sip of soda……not even a full can.\n\nI don’t have a problem spending money at expensive places when the food, drinks, and service are actually amazing. But this place? A complete joke. It’s literally tucked behind a McDonald’s in a smelly area with mad bugs. Like… be serious.\n\nService was just as bad. Staff seemed more focused on setting up little flags than taking care of actual customers. Then came the cherry on top\nthey automatically added a 20% tip with no heads-up. For what service exactly??\n\nI left annoyed, unsatisfied, and honestly wondering how this place is still open.\n\nSafe to say—never again."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONFgySjRTVWxpZUhaaUxUSkNMVFF0VURJM00wRRAB",
            "text": "La comida no es tan buena pero definitivamente no es mala, los precios no son ni altos ni bajos diría que están OK, la atención y el ambiente no pudo ser mejor fue excelente! (miércoles)"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RFRXaFFZV1p3ZDFkQ09XaDZVMVZZVEdoa1UyYxAB",
            "text": "Tuve una experiencia increíble en el restaurante Manifestar. Desde que llegué, el ambiente fue cálido, acogedor y con una vibra muy especial que hizo que mi visita fuera aún más agradable. La decoración, la música y el trato del personal crean un espacio perfecto para disfrutar de una buena comida.\n\nQuiero agradecer especialmente a mi mesera Maryi y a santi quien fue atentos, amables y siempre estuvieron pendientes de que todo estuviera perfecto. Su excelente servicio hizo que mi visita fuera aún más memorable. ¡Gracias, Maryi y santi , por tu amabilidad y tu bien servicio !\n\nDefinitivamente volveré. ¡Muy recomendado!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xYWNEWXhkamxYVmkxc1lrZHJYM2xPT0VoME9IYxAB",
            "text": "It was my birthday and wanted to spend it somewhere different. I came across this restaurant on social media, it looked great but looks can be deceiving sometimes. I went ahead and reserved a time anyway. I brought my family and some friends. I'm so glad I did, it was such a good time, good music, good drinks and good vibes all through out the night. Service was great too. I went on a Saturday evening so if you are looking for a good spot don't hesitate. I would recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVlNqWjBRek4yWkRnemRFcDJTbUpHYXpsb1NXYxAB",
            "text": "It was an amazing experience for me. They had karaoke that night when I went."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeGNXNUlXbGRSVWpVdGJYTmpUa2RRWmpoTFJGRRAB",
            "text": "Me reuní con mis amigas en este establecimiento y la comida fue deliciosa, la atención fue excelente, me encantó el ambiente y volvería una y mil veces más, P.D: En especial le agradecemos a santi por su excelente atención 🫶🏻"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VlV6bHhXWFp2V1VwZk15MWFlalpYYlhKWGExRRAB",
            "text": "Muy buen servicio, buena musica, totalmente recomendado"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSVRtRkRkWGxJVjNkQmJrVkZja1JYTWtwSWJXYxAB",
            "text": "Para recordar Colombia la mejor fonda… Me encanta este lugar."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNFJETXdjRmhuTlhJdFRUTnFZM1JqV25SaFYxRRAB",
            "text": "Excelente, el ambiente espectacular, el personal 10/10 una experiencia única !!🫶🏻"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNS0J3TzJ1aDdtOU1nEAE",
            "text": "Estuve con mi mejor amiga y debo decir que me encantó la comida, todo estuvo delicioso y muy bien presentado. El servicio fue excelente, y en especial quiero destacar la atención de  mi mesero Santi, quien hizo que la experiencia fuera aún mejor con su amabilidad y profesionalismo. Sin duda, el ambiente del lugar y el trato del personal marcan la diferencia. ¡Volveré pronto para disfrutar nuevamente de las fajitas de carne, que estaban espectaculares!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLalBfdEtxbHM2VXpnRRAB",
            "text": "Bonito lugar pero.. los precios muy elevados y  Google dicen que sierran a las dos y ya a las  doce nos digeron que iban casi a cerrar"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUE9WZzNhVk4yVjBVMk9VYzJXbEpZZFdkYWEyYxAB",
            "text": "I'm still thinking about the chicken quesadilla. The place is clean, service is quick and food options are great. The trick is finding it. Act like your going to McDonald's and you're there!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQX1B3XzdkLXRfQlRREAE",
            "text": "Fuimos a celebrar un cumpleaños y éramos una mesa de 6. La última vez que vinimos todo estaba rico pero esta vez que vinimos, primero las fotos de la comida son completamente engañosas aparecen ser porciones grandes cuando no llegan a ser ni la mitad de lo que prometen en las fotos, el fried calamari tampoco sale como lo muestran. Además el mesero no estuvo pendiente no se si porque al principio nos demoramos en ordenar, pero después de que salió la comida no se volvió a acercar a la mesa por estar hablando con otra mesa que asumo eran sus amistades, también cuando intentamos llamar a la barra nos vio y decidió ignorarnos y ni siquiera comentarle al mesero que lo necesitábamos, NUNCA pido que no incluyan la propina porque se el trabajo que implica una mesa de 6 pero el servicio que recibimos definitivamente no valió 70 dólares además que a la hora del pago no dejaron poner la opción de no dejar más propina y toco dejar 10 dólares extra. Prácticamente le dimos 80 dólares por pasarnos los platos y ya. Además la hooka que pedimos venía con la manguera dañada que nos dimos cuenta nosotros y su solución fue darnos otra después de que ya llevábamos con ella como 30 minutos en la mesa y ya habíamos pagado y empezar a recoger los platos (que llevaban en la mesa ya casi 1 hora) como para que nos fuéramos. Realmente la peor experiencia que he tenido, jamás le recomendaría este lugar a nadie."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZWZoS1N3d2VtRVhREAE",
            "text": "Super recomendado, todo 10 de 10"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJS1FuNW5yaGJUZkFnEAE",
            "text": "Un lugar lindo con música en vivo y con su personal muy amable"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNUGF6NFNtcGNYQVdBEAE",
            "text": "I came here with my family to celebrate my mom and grandma on Mother’s Day and the experience was horrible! Half of the items on the menu were sold out which okay was annoying but we kinda get it, we ordered appetizers and it took over an hour just to bring them. When the main plates came, it was already around one hour and thirty minutes after we arrived and just then the waitress told my mom what she ordered was also sold out. Why would they wait this long to say this? My food never came and when I asked, the lady said I did not ordered anything! She gave me the option of getting it in “less time” but after waiting for more than hour just for appetizer I did not believe it. Tbh at this point we were also very frustrated and decided not to order anymore. So from 6 people only 4 had their food lol. Without counting that they charge us for a beer that we clearly said we were not ordering anymore since we decided to go for a 5 beer bucket. There were no napkins at the table, no water was offered at any time and the bathrooms were absolutely disgusting. Overall communication with the waitress was very hard and maybe that played a big role on her mistakes but I feel like anyone would expect an apology from the manager or try to give us more options that suit us better, since waiting other hour for two plates did not make any sense. Honestly it is very sad to write this since I’ve been here about a year ago and I had a wonderful time with my family, I hope they are able to fix their issues and go back to the amazing place they used to be! (The only star I’m giving is because we got to see a live Mariachi that was very nice to my grandma so point for that!)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOGRlZ25BRRAB",
            "text": "Love the atmosphere, the services, food , drink. Always a great vibe."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNnFQNDZRRRAB",
            "text": "Great place ! Food is good and drinks ! Definitely recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJblBqbVpBEAE",
            "text": "$$$\nFood, drinks, and live entertainment are great"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLUxIeWJnEAE",
            "text": "I'm going to put this at the beginning for people who don't want to read all of the following. Please spend your money elsewhere, maybe even at the McDonald's in front of the restaurant. The food was okay. I've had better for much cheaper. The prices are astounding for what you get. You definitely get canned beans; they are flavorless, and the rice seems microwaved and was still crunchy. The steak fajita wasn't bad, but that's about it. They add an automatic gratuity even for two people and still had the nerve to ask for a tip. They gave us small, 6-ounce cups for water and never refilled them. They definitely push the purchase of drinks from the bar, which are expensive. I understand a restaurant needing to make a profit, but when you get maybe $20 worth of food and they charge almost $100, it gets ridiculous. Also, the staff never checked on us. They took our order, brought our food, and gave us the check. That's all we saw of them."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdTUyLUpnEAE",
            "text": "Wonderful service by Angie! Food was delicious!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdS0zczdBRRAB",
            "text": "Angie is the best!! 🥳🥳"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdTlXVjF3RRAB",
            "text": "Angie was super nice and very attentive. The food was really good and we had such a a good time. The ambiance was so relaxed and fun. This was our second time here and we loved it. Even got out pictures taken!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOWYyWVhREAE",
            "text": "DO NOT COME HERE. We didn’t even get anything because of how disgusting everything was we left before we were served because there was stuff floating in my water and food on my fork and when we asked for a replacement they were still dirty it’s like they didn’t even try and just gave me the same thing. They said they use a power washer that’s the problem that won’t take of all the dirt. If you don’t like left over food on your fork and floating dirt on your water DO NOT COME HERE."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dWRQSTRRRRAB",
            "text": "Excelente restaurant ( bebidas, comida, música y ambiente)\nGracias Paola por tu excelente atención. Volveremos pronto y esperamos que seas tú quien nos consientas con tu maravillosa atención! Gracias!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3a3NIeDlRRRAB",
            "text": "We actually came for a monday night dinner. Although the place was as empty as expected, the server and bartender were top notch. Food was really good. I got the chicharrones appetizer and the birria tacos. The food was fantastic. And even for a slow monday night, it was pretty chill and fun vibes. Will definitely be back to experience the late night weekend vibes."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bjhmeURREAE",
            "text": "La pasamos súper bien con la pedida de matrimonio de mi amigo Angie fue nuestra mesera nos atendió muy bien gracias de verdad por excelente servicio🙏🏽"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3Ny15QTNBRRAB",
            "text": "La atención es muy buena las meseras muy atentas al servicio 20/10"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cjVXZXBRRRAB",
            "text": "Angie was the best waitress. She was caring and attentive. Great vibes and food."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ajRlM2lBRRAB",
            "text": "La comida no es muy buena, el lugar si es bonito pero considero que esta sobrevalorado."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dzRXSFpREAE",
            "text": "Ahhh first time here and the food was PHENOMENAL! Had a great time also had hookah available right at the table side! Will definitely be back to try more of their dishes. CALAMARI WAS AMAZING! And everything was VERY WELL SEASONED #chefskiss"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNGFuSld3EAE",
            "text": "The bartender is the best. All people was great !!!!"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRb1lXMUJBEAE",
            "text": "Me encantó el lugar muy buena comida 100% recomendable 🤩"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRb1lYZXN3RRAB",
            "text": "Muy delicioso todos y el personal muy amable 100% recomendable 😁"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMXZDd1pBEAE",
            "text": "Came for my birthday dinner! Diana was super sweet and helpful! The food was amazing and so good!! Will def be back again!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaXY3cVVnEAE",
            "text": "Party of 16 on a Friday night, we enjoyed  our drinks, our meals the service and the DJ, who\nentertained us til 2am!\nEnjoyed sparklers and a flight deck of shots as we celebrated birthdays in our group!\nWe dined on Mango Ceviché, calamari, & both pollo y carne Nachos.... Our drinks were fantastic, made & presented great,\nI would definitely visit again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNmFtSFR3EAE",
            "text": "Stopped here one night for drinks since it was a few mins walk from our hotel, vibe was great, drinks were good. There seemed to be a birthday party taking place in the restaurant so it was really crowded but they did have a live band which we enjoyed!!"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOGU3MkVnEAE",
            "text": "Bueno. 1 reseña mas.  Muy buen servicio y muy buena atencion   la comida no esta tan mal pero pedi una salsa para mi fajitas y me dieron valentina  soo me imagino que no tiene salsas.  Bueno gracias por los shots  Stefania.       Mi opinion. No mas."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdXE2eGxnRRAB",
            "text": "Nice place, I like the music, the food was delicious and so were the drinks. Except for the beers they served which were not cold.  They do need to up their game with the service....it took them so long to come and get our order, and they never bothered to come back and see if we wanted anything else.  The wait time to get our bill was also so long...so that's why the 3 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsM3V2R1dREAE",
            "text": "This’s a fantastic Mexican Restaurant, drinks are amazing, food is good & service the best, music on point, my first time here &  I really recommend it to anyone who like to enjoy good food & drinks, & if you want to have fun here is the place 🤝😎."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdkpYN3JBRRAB",
            "text": "Diana nos atendió muy amable muy buen servicio la comida deliciosa buena música recomendado 100%"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc0pMTG5RRRAB",
            "text": "Nice atmosphere, did not eat instead had Drinks ( guaro) and enjoyed  time with family and friends. Enjoyed music and entertainment 👌 wished I had stayed longer."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNzdLQzZ3RRAB",
            "text": "This is a great place to go with friends and if you want to hand out on the bar as well the Chico at the bar Jeff is very welcoming he has a great service skills and he makes amazing drinks overall the vides is nice good music."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbHZ2NW1BRRAB",
            "text": "Excelente servicio !!! Siempre vengo acá y la comida es deliciosa ! Los tragos y lo mejor es la sonrisa con la que mi mesera me atendió ! La bartender tiene amplio conocimiento en tragos ! Este es el lugar !"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMDVUejN3RRAB",
            "text": "La compra da y el lugar expectacular y estas chicas una maravilla en realida en este mundo necesitamos  mas personas como estas chicas al llegar nos atendió con una descripción expectacualar y mencionó los platos más reconocidos cosa que no había experimentado antes en otro lugar las órdenes y los tragos llegaron súper rápido me pareció,la comida con muy buen sabor igual los tragos solo que el valiente debería ser más picante en mi opinión pero estaba rico la música igual muy variada me pareció excelente fui con mis hijas y unos amigo y también quedaron encantados yo lo recomiendo para ir en familia o solo con amigo excelente nos encanto muchísimo y volveremos otra vez"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbHJ6bHJBRRAB",
            "text": "Bueno la verdad la música y la decoración muy bonito pero el personal muy grosero con el cliente pregunte al bartenders por el menú de comida y me  mandó a buscar una mesera entre el público. Pero eso no es todo los precios exajerarados  mini empanadas de tres 18 dolares y un mini trago 18 dolares terrible un abuso"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aEw2amdRRRAB",
            "text": "Great vibe! Really cute deco. Food was really good and favorable. Bartender Camila was very attentive and makes delicious drinks!! Worth the trip!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUQ3dU9veRAB",
            "text": "I recently visited La Consentida for the second time, and I have to say, it exceeded my expectations once again. Normally, I don’t consider myself much of a night person, but something about this place makes me forget all that. From the moment I walked in, I was captivated by the lively atmosphere and the energy of the crowd. The staff is absolutely amazing—friendly, attentive, and always ready to make sure you have a great experience.\n\nThe food is fantastic, with a perfect balance of flavors that leave you wanting more. The music, all Latin, sets the tone for the night, creating the ideal vibe to enjoy every moment. Whether you're there for dinner or just a drink, La Consentida has a way of making time fly by. I found myself dancing, laughing, and enjoying every minute. It’s definitely become one of my favorite spots, and I can’t wait to go back"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdHFlRTF3RRAB",
            "text": "Hoy 26 de octubre de 2024 fuimos con mi esposo porque encontramos este lugar en TikTok y la verdad fue INCREÍBLE , la música es fenomenal de todo tipo de música, pedimos tacos y estaban ricos y una porción de chicharrón que estaba crocante y deliciosa, los cocteles con el licor adecuado (que sientes el sabor del licor y no es agua) muy ricos, y mi esposo pidió quesadillas vegetarianas que llegaron con carne pero la mesera siempre fue muy muy amable y sonriente, se disculpó y cambió el plato. La verdad 10 estrellas para este lugar . A las 12 hubo música en vivo que me pareció fenomenal ! Me sentí en Latinoamérica con un excelente servicio."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaXBIZ1JBEAE",
            "text": "Food is really good.I had that chicken taco omg delicious."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBemZ1Qy1nRRAB",
            "text": "Hey Nicole, thanks for the awesome service!  I've been here a few times now, and you're always fantastic. My birthday dinner was perfect with you taking care of us. And how can I forget about you, Alfredo, thank you for taking care of us, you provide the best security service 😉\nThe food was great, the service and atmosphere were amazing as always, I couldn't have asked for a better place to celebrate my birthday 😊 🥳😘"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdTZEc3dBRRAB",
            "text": "The food was good and our server, Diana made our experience even better. Definitely recommend this place!!! Had such a good time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYX3JqaThnRRAB",
            "text": "If you are looking to have the time of your life, this is the place. I have been here for birthdays, girls night out, just casual outings and the place never disappoints. This time it was for my birthday and I knew I couldn’t have had picked a better place to celebrate. The food was amazing, the service as always was incredible, this time it was Nicole in charge of the table and she was always on top , drinks, food, anything we need she was available within a short time. She was great and made my night so much enjoyable since I didn’t have to chase anyone for anything.\nOverall the experience was outstanding as always."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzN2RPSEJREAE",
            "text": "Amazinggg place , great drinks customer service bartenders , host waiter bus boys 10/10 , food and drinks are amazing ! Do not hesitate to come here !!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnLTktMjdBRRAB",
            "text": "This place is lovely, the music, atmosphere and the entertainment transports you to a mini Coco Bongo club! Is fun and is loud very Loud. Why I’m giving them 4 ✨ well the Smoke, is too much smoke from the smoke machines ( really unnecessary) and the smoke from the birthday torches, the bottle service! Is too much, the last two times I was there, left with a sore throat due to the amount of smoke. More ppl in my group complained about the same issue.\nPlace is fun hopefully they can correct this issue. I will go back."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcE4zSG5RRRAB",
            "text": "La pasamos genial! La comida, el ambiente, y el servicio excelente.\nMuchas gracias por todo Laura, la pasamos increíble."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcDlfU2lBRRAB",
            "text": "Everything was super delicious and Angie's service was super great. I loved the place."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeE9ya3dRRRAB",
            "text": "Estuve hoy con mis amigos, primera vez y el ambiente no decepciona, súper genial el ambiente, nuestra mesera se llamaba Stephanie, fue una chica súper atenta y nos animó a pedir botella y a probar una súper picada, Volveré con mis amigos, quizás para una reservación o fiesta privada, súper recomendado todo.Gracias por esta increíble experiencia!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5akx1dWF3EAE",
            "text": "Amazing service! Our waitress Monica was amazing, gave the best experience ever. My friends birthday party was a blast and food was delicious!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOHF2dDJ3RRAB",
            "text": "Went for Valentine Day and had a horrible experience. It was a prefix menu with half of the items sold out. When we ask for regular water our waitress informed us that it wasn’t working so we had to get bottle water that cost $9. Took almost an hour to get our appetizer and that was after asking the waitress twice on how much longer. After eating our appetizer, our waitress went MIA for 30 minutes so we had to track down another waitress to place our entree order. We waited about an hour and half for our entrees before deciding to just take it to go as we had already been there for almost two hours. We informed our waitress that we will like to take the food to go instead, in which she reply oh you have to leave ? Even after telling our waitress that we wanted to take our food to go as we been waiting for a while, it had been 30 minutes from that time and still no food. It was then where we decided that we didn’t want the entrees and just was going to pay for the drink and appetizer we had gotten. When we told our waitress that we didn’t want the entrees as it had been 2 hours and still haven’t received it she brought us her manager who said we had to paid for it still because it was already order. After going back and fourth with the manager he was only agreeing to take one of the items off the check even though we did not receive the food nor eat it. All in all he eventually didn’t charge us for the two entrees but was very unhappy and kept making excuses. Will never go back to eat at this place. We weren’t the only couple that had left that night without eating or being attended to. Very unprofessional."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dGQyQkJnEAE",
            "text": "Nos encantó mucho el lugar era nuestra primera ves, la música muy buena excelente, eramos un grupo de 9 personas y todos salimos muy contentos sin duda volveremos muchas gracias a nicoll por su excelente atención siempre estuvo muy al pendiente de nuestra mesa  gracias la pasamos genial"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGOHZTTU1nEAE",
            "text": "Fonda la consentida, me encantó . Tanto la comida como el ambiente..  la atención de Leidy  un 💯 siempre pendiente y buenas recomendaciones tanto en la comida , como en los tragos.. realmente un lugar para recomendar a amigos y volver.."
        }
    ],
    "reviews_count": 77
}