{
    "name": "O'Neill's Maspeth",
    "place_id": "ChIJ6zin_fFewokR294f89OYH_U",
    "grid": "QN5",
    "address": "64-21 53rd Dr, Maspeth, NY 11378, USA",
    "rating": 4.4,
    "user_ratings_total": 1420,
    "phone_number": "(718) 672-9696",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCelVHbEdRbU5yVkRoaU1XcDBNM1IyUjI4dE1XYxAB",
            "text": "We celebrated my daughter's birthday there, we had an amazing time."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNU9UaHliVU40YUZCamJGOWllVjlGTm1KdFFVRRAB",
            "text": "I had a baby shower for my daughter here. I was totally impressed. The staff was friendly and accommodating. The room was set-up elegantly with white tablecloths and cloth napkins. The food was delicious. And the cost was very reasonable. I highly recommend O'Neill's Maspeth for your next party."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMkt5eDJ3RRAB",
            "text": "Had the ribeye steak with mash and vegs. Everything was prefect and delicious."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obGMzZFhWVVYzTFdReU1ubDJWVm8xVUY5VmMzYxAB",
            "text": "Exquisite"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WeE1VTTViMFJDYUVSd1V6aG9RbTV3TFZWTGMzYxAB",
            "text": "Do not eat here , Had a party recently here about 30 people, was a disaster from start to finish . Our whole party had two waiters one handing food at the buffet and one person doing drinks . Out of the 4 hours we were there they only came by for drinks twice , we had “unlimited drinks” but only got two drinks . Service was horrible . For the buffet the lady serving the food was pouring spoons full of liquid from the beef and pork on to the plate with our salads , flooding the plates with liquid ruining everyone’s salads . This place also charges a 3% credit card fee like it’s the year 1999 , no real restaurant has a credit card\nFee in the year 2025"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMFNtOVBOV2RSYVU1eVRHTjJObGxvUnpKU2JuYxAB",
            "text": "Looking forward to having some food and watching TNF"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnOHVQN1JnEAE",
            "text": "Go there regularly"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5T1dtbDJieTAzTm5SV1JVSnBRbUpHYjIxcUxWRRAB",
            "text": "A quiet UFC evening with beer and food at the bar... only when we paying, a waitress named Tif... cheated us out of 2 times tip……"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSc2EyWTBhV1pNU2kxTmJHSnJlVTV5TjJoNmJFRRAB",
            "text": "It's not the O'Reilly of 10 years ago"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdFJFRlBjRGxsTUdKR0xYcFFVVTVaU0VWclIzYxAB",
            "text": "Good selection of draft beers. Delicious wings and excellent service 😀"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNVpYZDZOWFZhTTFwdGFtUTBSRFZIZFdGVWVWRRAB",
            "text": "Recently had my mother's 80th celebration in one of O'Neills' party room. From the time of booking... to the end, I had a great experience. Ximena was patient, knowledgeable, and made excellent recommendations for menu options. Staff made last minute changes to the serving schedule to accommodate late comers, they quickly prepared another appetizer to accommodate a lactose intolerant guest...overall they were patient and gracious. The venue was clean, the food was delicious and even took care of the parking...valet service was great! Thank you!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0S1ZGcERiRGh6WjB0M1pFSmtPVEZKVW10bmVsRRAB",
            "text": "Stopped in here for a pint and was amazed by the history of this place. The bartenders were very friendly and generous enough to show me the 911 picture album which in fact made me tear up a little bit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwb2VVMXdVbVZUV25kU09XOW5RM1ZZWjFwbGNGRRAB",
            "text": "Me and my wife went last night I ordered chicken fingers I got them I couldn't even bite through them they were so tough. Every time I wanted a beer the server was texting terrible service it used to be great"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbWNGZE5WWFpMT1RRNFFsbFJNemRvVkdaRGVrRRAB",
            "text": "Planning celebrating a family event there not our first you will definitely be pleased"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVFdHTnBOa2xWYm5kRVJsUlNhakpZYTBSRlVHYxAB",
            "text": "Dive bar seems popular for the neighborhood. Food was not great for me. Service was fine. Overall its really rundown inside"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOS2FUSXhWVlJqTlcxRFJXbEdRMHBHWW10S2RFRRAB",
            "text": "The food is excellent and the wait staff is friendly.  The place is very clean.  I've been going for years.  Definitely recommend it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOblJGRllRMmRSYUZKNWIzaENka1pXTVcxMmNIYxAB",
            "text": "We went for a Buffett brunch after a Memorial Mass for a Dear friends Father nearby. The buffet was excellent with plenty of choices and served up fresh and delicious. Drink service was friendly and adequate too. I would definitely come back to explore their dinner menu with my wife when in the neighborhood."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wU05XeGZaQzFqVW1ONVNIaEJURXA0WnpOaUxWRRAB",
            "text": "Excelente servicio el sitio espectacular  la chica que nos atendió muy amable y nos fue de mucha ayuda"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyM2JXTHBRRRAB",
            "text": "Great waitress COLD Beer tasty food fair prices"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUloyRlNPRVZNU1VsS2N5MUlkakUxZVhRMFVuYxAB",
            "text": "Great food & service"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwc1otZ0Z3EAE",
            "text": "Very good food and prices are also decent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeWIyMHlWR3BPV1VaWlNFdDRXVEJTUlZOd04zYxAB",
            "text": "Attentive staff. I had a really awesome young lady who waited on us. She checked on us and even answered my daughters questions on a specific drink.  We had a wonderful time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaFJXNHpYMll4WTFKTVNrWTRTazFoTW5WWGMxRRAB",
            "text": "O’Neill’s is a very good restaurant but sometimes the service is not very good.  Both food and drinks are very good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRVRFaG1ZemR1T1hoMk5qZHJhMnR6VFhkQ1lVRRAB",
            "text": "Had a business lunch here. Everything we ordered was tasty. Also good drinks. Tons of TV's to watch any game you like. The place was buzzing, even midweek at 3:00 PM. Reservations are recommended."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNemk4SXVJME9hS2VnEAE",
            "text": "I’m in my 60’s, born and raised in NYC. I love food. If you love food, you will love O’Neills. I have been to O’Neills many times. I always start with the raw clams and oysters. They are consistently fresh, briny and delicious. The shrimp quesadilla and meatball sliders on garlic knots are always great. I have had their steaks, and they are very good. One reviewer gave the steak a terrible review and stated the steak was far less superior to Kean’s and The Old Homestead. Do I need to explain why that’s a ridiculous comparison? I can honestly tell you I have never been disappointed with a meal here. Flounder Francaise was the best I ever had. Burgers are great Pizza is great. Staff is great. Do not hesitate to give O’Neills a go."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VORHkxOXktdVBhTkVnEAE",
            "text": "Great atmosphere and very good food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWU1ETlhNbFp6VFdkUWRVcEVWa1ZRZEdWNVJHYxAB",
            "text": "This place goes on and on forever..party room after party room. The food was...not good....sad because the menu is appetizing. Service was a horde of youthful confusion, the seemed new and untrained. There were parties in every room so maybe that explains the inexperienced servers. Pretty establishment... maybe better for happy hour."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOeXo5Sk90aEtPOHdRRRAB",
            "text": "Well, my friend wanted to celebrate her birthday and she decided to go to O’Neal’s friend. I wanted to go to the new steakhouse called Vida  and I wish I did. They order the porterhouse for two they asked for medium rare. They got it well done I ordered the New York age strip something. It was so under cooked and cold. What the hell? No, I really don’t mind steak, medium rare but this was like out of the refrigerator. It didn’t look fresh. I’ve been here before many years ago and I was also disappointed and this is my third time coming back and disappointed again. I will never go back to that place for steaks. EVER. I think the best place to go eat a really good steak. Good quality is the old homestead  in the Chelsea area. Or keen Shop on 36th St. And of course, we can’t forget Morton steakhouse. And there’s an amazing steakhouse Cuzins In Marlborough New Jersey and trust me when you see the cuts of meat in that place you’re gonna know you’re in a really good steakhouse. O’Neills will never do it for me again I end up paying $60 for French onion soup baked clams. The French onion soup was good and also the clamssteak never ever ever again disgusting."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJUzEzSjdoOXR2UHB3RRAB",
            "text": "Hosted an event in their big room with catering. Was expecting ok/good food for a group of 80, but got great food instead. Staff were friendly and helpful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQR1N4T2VoOHZLdkpnEAE",
            "text": "Busy, livery lots of sport on screens, great food, good wait staff. No blaring music. 2 separated rooms for meeting or party."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNMjhnTjZ3aWFyNDZnRRAB",
            "text": "It was my first time , my granddaughter comunión, such delicious food and the service marvelous."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPU0l5c18yemZmS01REAE",
            "text": "Great people quick service. 👍👍👍👍"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMMll6OHIxcU5QOFJBEAE",
            "text": "Great Blackened Prime Rib!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc2EzRk93EAE",
            "text": "The best"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2FyeGtnRRAB",
            "text": "Love this place. Come here everytime I'm in the city. Nice people, good service."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNGJDTTNRRRAB",
            "text": "The restaurant has a bar and family setting. I went there for wing night. The promotion is 10 wings for a dollar a piece. They have different flavors. I did pineapple bbq and i thought it was pretty good. The wings came out fast. They were lukewarm but that's my fault as the next time I order, I'll ask for well done. Ordered French fries with cheese. That fries order can feed two hungry grown men or at least 3 or 4."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNzRyNTFBRRAB",
            "text": "Had such a nice Easter dinner today with my family at o’neill’s . The staff was friendly and very on top of we needed anything or to clean a dish that was done . The porterhouse for 2 was to die for i split that with my two little daughters they loved it . My parents got their favorite fish and chips . Great experience made my Easter such a nice day ."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc2U2OGxRRRAB",
            "text": "Es una excelente comida"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOWNDQ213RRAB",
            "text": "Great place. Good beer."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLUtqY2FREAE",
            "text": "nice old school style pub and restaurant in maspeth. with a big bar in the center. definitely for sports fans. if you want to eat something, have a beer and watch a game this is the perfect place! the staff is nice and helpful, the food is good. if you order a steak be sure to ask for their own sauce - it's great! i recommend the swordfish and the steak! the desserts are also delicious. i recommend and enjoy your meal"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbDR1T1ZREAE",
            "text": "Honestly, the food is average quality, especially for their prices. If you want the food to taste better, definitely head to the bar and order some drinks (also not worth it, just get a beer) 😆. I'm simply not a fan of the restaurant. If you don't care for prices, expect average if you go here."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneXNYWnFRRRAB",
            "text": "Nice little local bar with lots of history.  Good food and drinks.  The staff is very friendly and accommodating."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMC1TamtnRRAB",
            "text": "Always an amazing place to go to for many years. Some of the best wings in Queens."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd2FqcWFBEAE",
            "text": "Went to have holiday dinner with my team from work. Great service, food, atmosphere.  Considering going back with family."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaXJMTG1BRRAB",
            "text": "Had a couple of pints,\nWent home"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMjV5a3FBRRAB",
            "text": "Stay away!! I never write these things but I had to after this experience. 1st my mother found a piece of rubber in her lobster bisque that she found after it was in her mouth (disgusting) then my sister found the same rubber piece in hers the waitress took the bowls away and was apologetic, then she came back and confirmed that they strained the pot of lobster bisque and they found more rubber in side... the waitress was great for the main fact she was honest, then I ordered a medium rare burger which came well well done. She then said she's trying to get in contact with her manager who was on vacation because this was unacceptable and we shouldn't have to pay for anything due to all these issues and she was right but then she told us my manager is on vacation and she not fully understanding the situation and she's sorry and she will take off the super well done burger and the lobster bisque.. the bench my mother and sister were sitting on was broken and kept rocking back and forth... their employee confirming that the lobster bisque was cooked with all that rubber in the pot is a health hazard at minimum you do not charge that table and pray the customer doesn't take further actions... any manager knows this. The worst was the bill wasn't even expensive it was 50$. The owner should really consider who he has in trusted to manage their business...."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbTVfZnVnRRAB",
            "text": "Terrible experience. There was a piece of rubber in my mom’s soup, 5 minutes later I found the same piece of rubber in my soup. Thankfully the waitress checked and found more rubber pieces in the soup and discarded it so it doesn’t happen to any one else. My brothers burger came out well done after he asked for medium rare. Our waitress was very nice and very sweet but the manager was on vacation and they didn’t have a replacement, therefore they made us pay for the rest of the food meanwhile we had the worst experience. The waitress was texting back and forth with her manager and her manager did not do much for us. Very disappointed considering I use to go here. Very terrible management and very terrible kitchen. Do better. Get a better manager."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MVBfQ2x3RRAB",
            "text": "Good food,friendly service,good prices and Guinness on tap! What more do ya need!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ek9lWHRnRRAB",
            "text": "I came here for the first time recently because of an event that I attended. This place is truly exceptional with its hospitality and service as the staff was fantastic.\n\nThis restaurant is a well-known institution in Queens and has been in business since 1933, and I could see why they have been around for so long.\n\nI really didn't get a chance to try anything from their food menu, but the drinks I ordered were really good, and the bartenders are super nice. This place has a great sportsbar vibe, and it is a great place for hosting events since this restaurant is quite large.\n\nI noticed other reviewers complaining about the parking situation in this area, but since I came quite early, I didn't have any issues finding street parking near the restaurant.\n\nBased on my first impression of this place, I will definitely stop by again in the near future to grab a bite and a few drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydXJEejlBRRAB",
            "text": "I ordered the French dip panini and my husband had a burger which is said was good.\n\nThe steak in my sandwich was tender and had a good meat, cheese, onion bread ratio. Au jus was very tasty but I would have preferred it a little thicker.\n\nI love that the steak fries were served in a cute little fry basket.\n\nOur waitress was very sweet, we felt very welcomed, atmosphere was a good vibe to just have a dinner and drinks with my husband. Can't wait to go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuek9UY3d3RRAB",
            "text": "Good neighbor spot. I am not a huge fan of sports but I definitely recommend if you love sports, bar type of spot!\n\nThe food was average to be honest especially for the price. There are better places around... BUT! Customer service was excellent! They didn't smile at all 😆 but they were very diligent on checking in if everything was OK periodically and make sure we could enjoy the food.\n\nFirst time here so can't say about all the nemu. I ordered shrimp scampi without reading the whole description.... don't know why but I automatically expected pasta but it came out with yellow rice. Without any trouble, they provided pasta seperately which was AMAZING! Definitely GREAT customer service. I woukd give thousand star just for that!\n\nBurger was a bit under-whelmed but it was well seasoned!\n\nOverall, considering price- It's not the best\nbutI do recommend if you need a place to eat out in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaE9PQ3BBRRAB",
            "text": "Buffalo chicken pizza was great. Regular cheese pie was alright. The highlight was the BBQ and Buffalo chicken wings. Massive and absolutely tasty wings."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaczRHanRBRRAB",
            "text": "Awesome Porterhouse Steak with decent price. The staff are very friendly. It is a bar restaurant but dinning area is fairly quiet. I enjoy & will return."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOElYRThBRRAB",
            "text": "I had an incredible experience at this restaurant! The ambiance is fantastic with its captivating decor and lively music. The variety of TVs airing various sports events added to the energetic atmosphere. The service was top-notch, as was the waitress (Table 12 @9pm) was attentive and courteous throughout our visit. Our appetizers, including oysters, little necks, and the signature wings, were all delightful and set the tone for a great meal.\n\nThe attention to detail extended to the drinks menu as well. Our waiter was a true professional, skillfully suggesting cocktail options that perfectly matched our preferences for liquor and mixers. When our main entrees arrived, we were thoroughly impressed. The pork chops and shepherd's pie were outstanding, boasting both flavor and generous portions.\n\nOverall, I wholeheartedly recommend this establishment to anyone seeking a combination of delectable food, refreshing drinks, live sports, and enjoyable music. It's an ideal spot for both family gatherings and outings with friends."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNneTRPUkx3EAE",
            "text": "The family has been coming here for years. Our Wednesday night visit we had the lobster dinner, a burger, the Chicken special, and chicken quesadilla for the youngster. All were excellent. The portions were good many took pieces home. Good…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1a2VMeFNREAE",
            "text": "Such a cute pub in the borough. We were seated in a room that was less loud than the bar area. (Sunday night football) it got super cold then the temp became normal. Then there was a birthday party of five seated next to us where the guy (old enough say 50’s) yelling and cursing so loud he may as well have been in the main bar area yelling at the tv. He was drunk and otherwise put a eye-roll on our evening visiting with family we haven’t seen in over 10 years. I don’t envy the headache he no doubt earned himself. Otherwise the restaurant was a fun little spot to visit. Easy to get to via public transport."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCc1BiTFdnEAE",
            "text": "Authenthic Irish Pub that really brings it with its hospitality and food options.\n\nLong gone are the days when you could spend an afternoon with your boys having lunch, drinks and placing bets on the ponies in the OTB booth...\n\nBut this place is still worth a visit if your lookin for Irish Fare"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyLXBIbUV3EAE",
            "text": "Old and new! The crowd was mixed.  Music was pumping. People were dancing, hanging around eating and enjoying great company.  Despite the tipsy girl twerking on my knee I had a good time."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnN282bmVnEAE",
            "text": "Love love love O'Neill's!!! Our favorite place to take family and friends for lunch or dinner, or to watch a game. Great appetizers, seafood and specials - the menu has something for everyone. Staff is very friendly and service is great. Fun bar area for drinks too!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2NEwtci1nRRAB",
            "text": "Run of the mill pub grub with grossly overpriced drinks. The linguini was a sloppy mess and totally doused in sauce and the service just wasn't there. I guess that's because they already add in a 20% gratuity and there's no incentive to come around. Expensive for what it is."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcXEzRFBBEAE",
            "text": "für den tollen Abend und die Gastfreundschaft! Das Essen im O'Neill's Maspeth war einfach köstlich. Die Auswahl an Speisen war vielfältig und es gab für jeden Geschmack etwas. Die Portionen waren großzügig und das Essen wurde frisch zubereitet. Besonders beeindruckt hat mich die Qualität der Zutaten. Alles schmeckte frisch und lecker. Auch die Getränkeauswahl ließ keine Wünsche offen. Die Bedienung war äußerst aufmerksam und freundlich. Trotz meiner mangelnden Englischkenntnisse hat das Personal alles getan, um mir den Aufenthalt so angenehm wie möglich zu machen. Ich fühlte mich sehr willkommen und gut betreut. Die Stimmung im Restaurant war gemütlich und entspannt. Alles in allem war der Besuch im O'Neill's Maspeth ein absoluter Höhepunkt meines New York-Aufenthalts. Ich kann es kaum erwarten, bei meinem nächsten Besuch wieder dort einzukehren. Vielen Dank für die tollen Erinnerungen!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbllIdXF3RRAB",
            "text": "This place was wonderful. I was greeted by Pat and she was so friendly. Staff was kind and they know how to pour a Guinness beer. Hot wings were great. They also have weekly specials. Check them out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWc3FiM3pnRRAB",
            "text": "Great atmosphere love Sam the bartender she rocks please go after 7 😂 food was great wins on point and the drinks was on point great spot in maspeth Ny .."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2NGJ2WjdRRRAB",
            "text": "Been coming here since the 70s. Always great food and even better people. Maspeth Woodside old school. Thank you O'Neills for keepin it dynamite. I just took the pix this time. Just the delicious lunch. And Lenny too"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcXU3ZVJBEAE",
            "text": "Excelente atención, la comida ni hablar muy buena hasta el postre, limpio y con excelente música. Fui con mi esposo y mi bebe de 2 años y la pasamos genial"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNDlhWnd3RRAB",
            "text": "The chicken tenders were big and super filling, nice rolls for the table, good beer selection, good wait staff, the Sheppard's Pie was hit or miss for the party some it was good others the vegetables were undercooked. The burgers were…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNGN2YVpBEAE",
            "text": "Everything in here was so good! Excellent service and good portions."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyLWVlZUVnEAE",
            "text": "OMG - incredible, slow roasted prime rib!\n\nGreat place; quaint corner location, and cool vibe during Rangers playoff game.\n\nGet the steak!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdDR5QmlnRRAB",
            "text": "Delivery and packaging of the food was excellent! I had the burger and waffle fries and it was amazing. I definitely will be ordering from this place again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURad2FIbGZnEAE",
            "text": "My first time at this place, very good service, very friendly waitress, delicious food, reasonable price and an excellent atmosphere!                       I recommend this place!👍👍👍"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHZzhxMnFBRRAB",
            "text": "Service is always good and I enjoy their wings on Wing Night (Mondays)\nTheir burgers and waffle fries are pretty good too!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyd2NMdnBnRRAB",
            "text": "O'Neills is the best.  It's a sports bar. It's a restraunt. They cater\nThey have small and large event halls. My union has large meetings there. The food is fantastic and they treat you like gold. Valet parking available."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNm9EWjRRRRAB",
            "text": "I recently dined at O’Neill’s in Maspeth, NY, and had an absolutely wonderful experience. The food was fantastic, but what truly made the evening special was our waitress, Fiona. Her service was impeccable from start to finish. Fiona was attentive, friendly, and made excellent recommendations. She anticipated our needs before we even had to ask and made sure we felt well taken care of throughout our meal. Her warm and professional demeanor added a personal touch that elevated our dining experience. I highly recommend O’Neill’s and will definitely be returning, thanks in large part to the exceptional service provided by Fiona."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdTUyZTJRRRAB",
            "text": "Food was okay a little bland drinks were incredibly small on shot glasses. Ridiculous half ice, 1/3 the size. The thing to come here for is the pizza."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURld0pLVk5BEAE",
            "text": "Nice friendly, everybody’s nice food is good. The drinks are great and the people very friendly. We had like five parties there. We enjoyed everyone now we’re gonna have another one."
        }
    ],
    "reviews_count": 75
}