{
    "name": "While in Kathmandu",
    "place_id": "ChIJeSf6KiFcwokRh2AC4D8qBts",
    "grid": "QN5",
    "address": "7-58 Seneca Ave, Ridgewood, NY 11385, USA",
    "rating": 4.7,
    "user_ratings_total": 831,
    "phone_number": "(718) 386-3416",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aFpsYzJUVTAzZGtKbVYwRktWM0J5Y0V4dmIyYxAB",
            "text": "Food was good specially the Jhol Momo.\nSadeko Alu was tasty but very spicy\nGoat sekuwa- its was good but expected to be more softer and juicy."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQ2NDMXFNREIxV1hWUWMxSmZkWE5vZDJsS1RYYxAB",
            "text": "They were not kidding about how spicy the food was when they warned me."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMGRtWnRhRTAxY1VGcE16VnVWMWxsUzIxeU5IYxAB",
            "text": "I think this is one of the gems of a neighborhood slowly filling with them. Been coming here for near a decade and can’t get enough of it"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dVN5MUtibEIwZFZsc1ZUbExTVEZ0YzNoclJVRRAB",
            "text": "The food was so delicious! I’m so glad I finally tried this cute spot with amazing food and super lovely service. The staff guided me through ordering and they were so kind and thoughtful. Amazed there wasn’t a line out the door for how good the food was and the value for what you pay. The momos were authentic and the portion was large. I’m so glad I don’t have to trek all the way to Jackson heights for legit and fantastic Nepalese food. Definitely a Ridgewood favorite!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVE9YaEpORVJxVTA0eFpFSm9kemhvY0RoalQyYxAB",
            "text": "Just had a absolutely lovely dinner date here! We ordered a few small plates to share including the cheesey naan, 3 spice chicken wings, Kathmandu poppers and, of course, the MOMOS. we recommend the water buffalo Momo!\nIf you're going to order spicy food you also better get a mango lassi or some Nepali beers to drink with it."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OZlIzSmhjalkwWjI4ME5IUmhZMjB5Y1U1QlgxRRAB",
            "text": "Authentic and delicious. Go for the water buffalo momos!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGd0xXeHllRmhFVmw5MGQxa3pXRFZoTldVek1GRRAB",
            "text": "Nepali Food Always"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WlVYUnhSMDVuVUU5SVRuQnJWVGN0VDFScU5WRRAB",
            "text": "We celebrated my mom’s birthday here and it was such a wonderful experience! The staff were very friendly and welcoming, and the food was beyond our expectations—absolutely delicious! Everything we ordered was amazing. We’ll definitely be coming back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaWFDMU5OMEZoYWpWTU9HOUNVa2RKVTFOb2NHYxAB",
            "text": "Good service and good food. Kyle the waiter recommend us the water buffalo momo and Nepali beer . Be careful the spicy sauce that comes with the momo is spicy :)"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNlJsaFJZbTVhV0dvdE9IRmhkbDlCWVhnelZXYxAB",
            "text": "Amazing spot in Ridgewood! Kyle my waiter was such a friend, he heard me blowing my nose and brought me lemon honey tea in the house! The food was amazing, best garlic naan I’ve ever had!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBellWOW1SVWx6TUhoT1pERlpkMGRTTVVObVJuYxAB",
            "text": "You won’t be disappointed to dine in here; Young energetic Chef Bikash Kharel; through his deep knowledge to his food roots; has applied his skills to create a American-Nepalese fusion cuisine; a traditional Nepali flats bread roti filled with Kathmandu’s Newar clan’s beloved Chyola; and topped with American loved mayonnaise; you will find yourself in heaven; you will have all in one authentic Nepali cuisine topped with beloved American flavors. Their fish and fries sounds like British staple but when you test it your head will say owes. Momo the Nepal’s signature dish it’s so authentic; the tangy sauce served with it gives you your tongue something fresh taste combined of tomato cilantro Sichuan pepper. It’s taking you to Kathmandu vibs."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MGVWOUpVbFJhWW5keGIyNXdZWEYwZUU1d2RYYxAB",
            "text": "Probably the best restaurant in Ridgewood. I have never had Nepalese like this. The flavors and dishes are so unique and well done, I can’t even describe them to do them justice. Definitely check it out for yourself. Try the chicken khaja platter, salmon sizzler, and the plantain momos."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNGVVRlZRMVkwYkVocFZ6bFBaa3hLV0ZCc1ZGRRAB",
            "text": "I had a big day ahead with an important public presentation/performance, so I was a bit nervy. But I really wanted some Momos. It was the perfect place to soothe my nerves, in the back garden where I found myself among the birdsong, but otherwise, completely alone.\n\nThe waiter was a lovely man and he recommended the water buffalo momos. Although I was initially reticent to try a new meat right before said performance, I’m so glad I did. It was delicious and slightly unplaceable meat-wise. The sauce was cold, the meat was hot, it was the perfect contrast. That said, I walked back out into the city armed for the day, having already dared to try something new, I knew I could confront something even bigger. Thank you to the waiter who encouraged me to try their new momos!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc1FVRlROblYyTkMxNmRrdE1hakZrZW1KQmQwRRAB",
            "text": "Great food, unique tastes and seemingly very authentic options! Loved the food and the service was great"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2NDR6N1ZREAE",
            "text": "Had the off menu buffalo jhol momos and chitwan ko tass. highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeVNtVTFaakkyTW5SR2MzRnViRUpuZFV0R2RuYxAB",
            "text": "So good. Not sure if it’s genuine Nepal cuisine but it IS really good food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSVVVcG9XRkUwWlhaelUwcEllWFpSVjJ0NWNYYxAB",
            "text": "Kinda mid tbh. All love tho"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOS1NHZEdjSEpMTFVoMlEzQjRWbmRLUkdGUFJVRRAB",
            "text": "Food was amazing !! Chicken was cooked perfectly. Hummus amazing as well. Will come back for sure. Cute spot for a date. Thank you Kyle for the great service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cFVGZGhkRlZ0WkZBNU4yMXZPSGMyUkc1elUzYxAB",
            "text": "Amazing food, loved our server Kyle. Recommend for real authentic Nepali food and incredible momos"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWblRrNTNVRXAxVGpCcFIzZGhhRzloYmxGTE9IYxAB",
            "text": "We love While in Kathmandu! We got the lunch plate and it was delicious and they gave us a complimentary drink. I hear they are going to start having live music in the backyard soon too. Neighborhood gem!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214alZ6a3RNbFYzZDJsd1QyaDRWRzFqTmpVM1NXYxAB",
            "text": "Had the most lovely lunch here. The staff were incredibly friendly and gave great recommendations — don't skip the momo, especially if they have the water buffalo special; and the millet roti with the lunch plate was exceptionally unique. I can't wait to come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJd2RuRlJiVXBTTjA5bGJVVmFWSGRYVnpsRE1GRRAB",
            "text": "Haven't had the chance to visit Nepal but dining here made me feel like I got to try authentic Nepalese food. All the staff were very hospitable and the owner explained clearly the ingredients used. The plantain momo was delicious and so different from other momos I've had. The main courses had really unique side dishes and the puff rice was cool. The staff also shared their knowledge of Nepalese culture with us. Only downside was it was cash only."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NVgxaEhVVTlvT1VaaFQwdFdRVWR3VWxBdGNuYxAB",
            "text": "Such a cute spot and the momos were truly amazing! Unique beers and cocktails on the menus and live music some nights too"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MldVZFZVVWM1T1dWeFVVOVZiMEpvYmsxTFIxRRAB",
            "text": "This is some of the best food in the neighborhood! My only regret is not coming here sooner. Every dish was excellent - the goat skewers, the buffalo momo, even the lunch plate. Incredible and great service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVU4zQnFiVk4wY0dKeU9VTlNVREo0VEcxTGVuYxAB",
            "text": "Hands down, best restaurant in Ridgewood!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TVQzWkVWbFpQWkhsaFZESTJObWQwT0VKaVNFRRAB",
            "text": "Staff is so nice, food is amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSldVb3pNMkZuUlRaM1YyZzFXVFp4Wm1STFVWRRAB",
            "text": "The company was incredible. Laughter, joy, sorrow, and excitement. All of the previous emotions on that list I just made were in the air while in Kathmandu. One day, I would like to climb the Himalayas. Think of the fresh breeze one may experience while approaching one of its summits. Incredible.\n\nThe food was good too, get the fish starter."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQlRIUTJNRkpZYzFoSU5XcHFXRTlsUVUxdWQxRRAB",
            "text": "Good spot for weekend fun."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MWRqSkxTR1J2VlhCa1pFTnpOa0oxUm1WaldYYxAB",
            "text": "Food is very authentic chicken momo is superb service is great only they accept cash"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQlJqaG9aamhMY1dreVRtaGFWa0ZpVTFCMFJrRRAB",
            "text": "Hidden gem 💎 amazing restaurant! Food was truly delicious and great service. Our new favorite restaurant. 🫶🏻 We will come back again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWblMwZ3dhVk5JWkhOdlZtZzRTemx3T0ZOYVRuYxAB",
            "text": "Delicious food and friendly staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQlpXa3habWgzYUZsdGQzUkpZM0JvUkhKclUyYxAB",
            "text": "This place is an absolute treasure – the food is incredible and the staff are kind, attentive, and very accommodating. I would return in a heartbeat. Don't miss out!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oc2FUWXlUM2hCY1djeGVtZElhak0wU3pZMVpuYxAB",
            "text": "The staff is super friendly, the food was great, cleanliness good. It’s cash only tho so bring cash or use they atm they have at the back of the restaurant.\n\nGot the Water Buffalo Momo and Chicken Khaja platter.\n\nMomo is a must try:  Ginger, coriander, spicy, pleasantly sour. Hot sauce on the side gives more flavor and spices. Dumpling is hot and sauce is cold. Nice balance so you can eat the Momo right away.\n\nI was the only customer atm, and it took a little while (20min) for it to come so it shows they make the sauce or the dumpling or both on the spot.\n\nAlready half full at this point. The platter started good with very crispy juicy chicken and fried shallot crispy rice thing. Beans are also crispy, so is the pork thing . Vegetables are coated with kind of like egg salad thing. Great. So when I’m half way into the plate things started be very chewy and they become cold really quick. I suppose cold dish is a characteristic of Tibetan/Nepali cuisine.\n\nI spent $50 alone but I’m so full I can’t walk. so I think $30 would be sufficient to have a good meal here. Don’t be fooled by the size. The crispy rice takes up your stomach real fast."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJdFYyczJjMDVsTkZZeFJWUjZaVUphZERocVVXYxAB",
            "text": "Spacious restaurant with outdoor and indoor seating. Super friendly service. The server explained the dishes and made recommendations. I ordered the masala chicken wings, a chicken platter, and pork jhol momos. The pork momos were the best! They were the perfect size and texture and seasoned to perfection. The herbs in the filling weren't overpowering. Everything was perfectly balanced and delicious! It was paired with a flavorful and addictive sauce. The hot sauce offered with it really gave the flavors a nice spicy kick. The chicken platter was interesting to try. But, I wouldn't get it again because it had too many different textures. The fried soybeans and dry rice were odd to pair with chicken. I would definitely come back for the pork momos and great service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CZlRtOU1NRXgzUTBaM1NETXlWVjl3YWpoNU5WRRAB",
            "text": "I love it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcGJURjBSME54TWtObmFFOXllV1ZhVG1oTlRuYxAB",
            "text": "If I could, I would have rated zero. Everything was just below my expectations especially MOMO. Even their packaging was horrible. Paying 16$ for MOMO wasn’t worthy. Though staff were good but I really hope you guys would work on that."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210c2FrNXRXVVJKT0VseVEzQmFORGs0TVdGVVpIYxAB",
            "text": "Would have been a better experience if the AC wasn’t so cold 😅.\n\nThe food and service were great and the Masala fries were our favorite! I really loved their menu as it was unique and different compared to your typical Jackson Heights restaurant.\n\nNot a Taco truly stood out to us, so much so that we even placed a to-go order later. 🌮"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRGRVRk9VRFpQVG1wVFMyWlpNbVZPUjI5NlJrRRAB",
            "text": "It’s a buffet restaurant and it’s very nice… the food is delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWVEzRlRaV1EyVFZoRmFWUkljMlJLYkRGWFdsRRAB",
            "text": "They are selling pizza bread, in the name of paratha. If you don’t know how to make a paratha, then don’t add that in menu, also don’t charge 25 dollars for the food that you don’t know how to prepare. Worst experience ever."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tac2FHVjRkM3BoU1RsVlpXVTNjbUZMV0c1TlJVRRAB",
            "text": "The food was amazing, prepared with love. And the service was really nice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weVVqbFRaRzl6UVZSTUxVWnRkVEpRTWpRd1JVRRAB",
            "text": "Delicious food & the nicest people!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUFFVRjRlR1F5UzB4VmVtNWxjR3hEWlVwSloyYxAB",
            "text": "Great restaurant, authentic food, unique flavors."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnM2JYZERhVmxMV1dkQ1pqWjJiVWxDVUV4Q1VtYxAB",
            "text": "10/10! no notes. the momos are amazing, the cheese naan is perfect, the skewers are so juicy! and the mango lassi complements everything perfectly"
        },
        {
            "date": "4달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNWNVaFlaR2h5YlY5MFZWaDZjSGh2TXpOVmVHYxAB",
            "text": "202506\n店員非常親切 我一個人來吃他們很熱心又友善！我點了網友推的炸魚和雞肉餃子和喜馬拉雅奶茶  炸魚調味很好但是有一點硬 餃子超大顆一份八顆我吃一半就飽了 jhol醬很好吃！喜馬拉雅奶茶本身無糖 是熱的 很濃但是香料味不會過重\n裝潢很可愛 還有後院座位區 店裡收訊不是很好不過他們有WiFi 只收現金！"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUlptZGhaRWxKZVdReVRIbFBaMDlVUW5KalpuYxAB",
            "text": "Great place, dumplings really tasty"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNMmI0TUN1cV9YVnVBRRAB",
            "text": "must visit for the khatmandu food taste this is best"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saVQyWlZUVWhGU1hobWNtSkhUa0V0V1RZNE4xRRAB",
            "text": "First time I tried Nepalese food and it was delicious! Staff was very welcoming and happy to share their culture with you. Items are reasonably priced too, so you can't go wrong trying it! Just be aware that they only take cash."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNaTZvZmFEdWZDS2xBRRAB",
            "text": "Just left and it was an amazing experience. We ordered the chicken choika and the chow mein, and nearly licked our plates clean. Great flavors and great people! We will definitely be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYlVuZGlWdUszWHpBRRAB",
            "text": "Dined in at glen cove location with my husband and children. Wanted to order everything off the menu! Momos, not tacos, pepper with cheese, masala fries, chow mein, kebabs, lamb chops, chili sauce were all delicious! Hospitality, service, food, staff suggestions and bellies were all delightful. Food was tasty with authentic ethnic flavors. We will return to try the rest of the menu!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbUg5LVNCX2N2dnB3RRAB",
            "text": "The staff is very friendly and respectful and the food is very delicious and heathy they make me feel like I’m family"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNElyTVdnEAE",
            "text": "맛있어요"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReUlTa1NnEAE",
            "text": "Sure! Here’s a more detailed and engaging review:\n\n⸻\n\nI recently dined at While in Kathmandu and overall had a pretty solid experience. I’d give it 4 out of 5 stars. The pricing is very reasonable, and the portions are generous, which is always a plus. It’s nice to find a spot that doesn’t skimp on serving sizes, especially in NYC.\n\nThe highlight of the meal was definitely the chicken momos—perfectly seasoned, juicy, and packed with flavor. You can tell they take their time to make them right. However, the goat skewers were a huge letdown. The meat was way too chewy, almost rubber-like, making it hard to enjoy. If they could improve the texture—either by using a better cut of meat or adjusting the cooking method—it would make a big difference.\n\nAnother downside is that this place is cash only. I get that some small restaurants prefer cash transactions, but it’s 2025, and most people don’t carry cash anymore. They do have an ATM in the back that only charges a $1 fee, which is better than most places, but that only helps if you happen to have your debit card on you. Accepting cards would make things so much more convenient for customers.\n\nThat said, the service here is excellent. The staff is incredibly friendly, and our server was very knowledgeable about the menu, offering great recommendations. It’s clear they take pride in making guests feel welcome, which really adds to the experience.\n\nOverall, I’d definitely come back, but I’d avoid the goat skewers unless they revamp them. The food, for the most part, is great, and the atmosphere is warm and inviting. If they could tweak a few things—like the goat dish and the payment options—this place could easily be a 5-star spot."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cW96SWJ3EAE",
            "text": "Incredible experience. Generous portions. Beautifully spiced. Fair prices. Great service. Lovely atmosphere. I had the sizzling clay-fired salmon (amazing!) and the garlic naan with hummus. Everything was fresh and came out in good time. They also have really nice beer options though I didn’t drink :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdktvYkhycE5fMlJBEAE",
            "text": "I love coming here! I had never tried Nepalese food before trying While in Kathmandu, but everything I’ve had on the menu is delicious. My favorites are the cheese naan, pork momo, chicken khaja platter, and aaloo gobi paratha. The staff is very friendly, attentive, and welcoming. Be sure to bring cash as they do not accept cards, but they do have an ATM. One of my favorite places to eat in the neighborhood!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbF9HeEZnEAE",
            "text": "Absolutely delicious and great service.\nNever would have thought I’d ever order a fettuccine Alfredo in public but that was amazing. And the cheese nan is probably the best I’ve ever had. Tons of vegetarian options too if you’re into that sort of thing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOF9yX3N3RRAB",
            "text": "Amazingly flavorful food! Cute outdoor seating in the back. Very quiet, perfect late lunch. Service was great, food came out quick. Had the saucy wings, garlic naan, poppers, not a taco, and pork momos. Incredible food! So delish."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURROVpyQ193RRAB",
            "text": "Here is my experience.. we pulled up and the exterior made me want to rethink my choice to eat there… but I went in anyway. Inside very welcoming and lovely bar seats. Owner was so nice. We ordered a bunch of different items. Each had wonderfully different taste profiles. I am so glad I decided to venture inside. Saucy wings were delicious, pepper poppers melt in your mouth taste, chicken chow main was  our favorite. The tea is soothing after a filling meal."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOE1PRUNREAE",
            "text": "Most authentic and delicious Nepalese food I’ve ever had! So spicy and delicious. Also have American fusion items like wings for the less adventurous. The staff is so kind and helpful navigating the menu. Momo not pictured because we ate them so fast haha. Can’t wait to return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycHI2aW9BRRAB",
            "text": "We came here with hope to try few dishes but found that they only offer brunch. The brunch wasn’t that great and most of it is not even traditional Nepali food.\n\nThe service was good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOWJteEJREAE",
            "text": "I really loved the fried meet and the garnishes! All of them were excellent. Not a huge fan of the rice but I know it is just because that was my first time and I was trying something new out. The service was great and I appreciated being exposed to a different culture’s kind of cuisine. Will highly recommend. Great food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcXRld3RBRRAB",
            "text": "Soooooo good, highly recommend! The service was great, everyone was kind and the food came out quick. All the dishes had really nice flavor and we were completely stuffed by the end. I recommend sharing a bunch of stuff. Very affordable, just be mindful it’s cash only"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNC15c2lnRRAB",
            "text": "I was skeptical coming to this place, but I was  pleasantly surprised right away. The place looks very clean and service was attentive. I loved chicken momo was so so good, other dishes were also great. The place deserves a trip from Manhattan. I highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbDZLT1VREAE",
            "text": "For Nepalese food in Ridgewood, this is the spot. Reasonably priced with friendly staff and the vibes. This is a perfect spot for date night.\n\nThe Momos was definitely the star of the show in a chilled tomato based sauce but the other dishes did not disappoint. The fish dish was very lemony with a masala type sauce which was full of flavor. The chicken platter was also delicious, with the pickled veggies and puffed rice added so much diversity in textures that each bite was very exciting. The spiced potatoes was also delicious, a bit spicy with Indian and Chinese type spices but not actually that spicy. Must try the Not a taco, full of flavor wrapped in a naan bread looks like a taco but is not was full of depth.\n\nAnything from the grill comes out smoking which was a nice theatrical touch.\n\nFYI - for dine in cash only"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdmZIb0pREAE",
            "text": "Highly recommend this delicious restaurant! We’d been wanting to try this for quite a while and finally did—we had high expectations based on other reviews and they far surpassed what we hoped for. The staff were welcoming, kind and knowledgeable, very happy to share recommendations and checking-in to see if we needed anything. All of the food was really superb with a lot flavor! Since it was our first time I’m glad we tried the chicken khaja platter (the chicken was so tender and full of flavor!) but we’d probably stick to the smaller dishes next time as they’re perfect for sharing and you can have more variety. The masala fries had the right amount of spice and crispness, the cheese naan is a so unlike any naan we’ve ever had, the not a taco is a must (!!), the chicken momos were the most flavorful chicken dumplings we’ve ever had, my husband loved the goat Sekuwa (I’m not a huge goat fan but tried a bite and it was perfectly charred and the sauce it came with paired perfectly!). We can’t wait to go back and would love to try their outdoor back garden area on a slightly warmer day."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQellIN0p3EAE",
            "text": "Fabulous food, service and atmosphere! We had the Aloo Gobi Paratha and the Whole Grill Macha (trout). Absolutely delicious. And more than enough food for two. Recommend getting their spicy sauce on the side. Definitely going back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeFlIdjJRRRAB",
            "text": "I’m surprised it doesn’t have a Michelin Star yet. Absolutely authentic as it gets. It’s not indian food it’s Nepali and damn is it good. If you like traditional food from around the world this is the place to go."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadmZLZlBnEAE",
            "text": "Like everyone mentioned, truly a hidden gem! We travelled an hour and half to visit this and it was totally worth it. Food, Staff, Ambiance - Everything is good at this place :) And authentic Nepali cuisine. We loved the sautéed chicken wings, best so far we ever had!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbU1hQVRBEAE",
            "text": "While in Kathmandu in Ridgewood is a hidden gem! A good place to show off to your friends. The authentic flavors of Nepalese cuisine and warm ambiance make it a must-visit. The service is good, and the menu offers a wide variety of options.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNWFhNG9nRRAB",
            "text": "My three companions and I dined at a restaurant with a pleasant atmosphere and top-notch customer service. The food was absolutely amazing, and we highly recommend the must-try masala fries and flavorful goat sekuwa. Although the dry chicken wings were just okay, the maleku ko maxa was particularly noteworthy. Unfortunately, the masala tea was not hot enough and failed to impress. On the other hand, we were blown away by the chicken and pork momos, and the Chitwan ko taas and duck choila were also delightful. All of this cost us $142, and we consider this restaurant as hidden gem in NYC."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNld1pidFBnEAE",
            "text": "Being hangry has nothing to do with how the food tasted. Taco was succulent, juicy and light. But the chicken MOMO is something else. Filling was generous, superbly seasoned and the curry broth is slurp-worthy I can drink it from a jar #wish. Bring cash with you, though it’s worth it. Do trust. The place is cozy, music soothing, host terribly nice and friendly. A must everytime I’m back in the neighborhood."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneXRtbjJ3RRAB",
            "text": "Fairly priced and good portion sizes. The green Chile pepper and veg jhol momo were great. Cheese Naan was amazing Spicy sauce was amazing even if I regretted it after.\n\nCash only"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NC1qOWRBEAE",
            "text": "A hidden gem!!! It is criminal that this place isn’t more popular. Everything was exceptional, from the succulent vegetable momos with a creamy tomato-based sauce to the cheese naans oozing with cheesy goodness to the firm, yet juicy grilled lamb.\n\nThe service was also great. The waiters took the time to explain each dish and even asked for feedback to improve, which I’ve never been asked before. I’ve also never had Nepalese food before this, but I will definitely be coming back for more!\n\nYou should know this place is CASH ONLY so make sure to bring enough if you’re going. There is an ATM though with a reasonable $1 fee."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbll2QmdBRRAB",
            "text": "Nice friendly staff. Was craving momos and the pork ones were really good. Chicken too. The masala fries were shockingly flavorful in a good way"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPLWRUYklnEAE",
            "text": "Asked the server not to make the chat pat spicy, but still got it as spicy as possible my stomach hurt, and she didn’t care to change it or anything, she said “yeah normally he makes more spicy but for you he made less spicy” I don't even…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURld0tDYlBBEAE",
            "text": "One of the best if not the best in town. Foods were delicious and served on authentic Nepali utensils. Prices are not too high either.\nCustomer service was at its best.\nThe only downside I found was they don’t accept credit/debit cards. Be prepared with cash if you wanna save time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOMzhfWlRqdWMyVHFnRRAB",
            "text": "This is my favorite restraunt. I dream about the flavors and I always can't wait to go back. I've never had a bad item on the menu and I find myself staring at every dish that leaves their kitchen. I would recommend this place to anyone looking for deep flavors and perfect consistency. 5 stars all the way. I'll always be back."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNS1Iay1RRRAB",
            "text": "Excellent restaurant, I’m new to Nepalese food but this place puts it high on the list.\n\nWe had the Momo, delicious. We got the vegetarian one to share for the table. The entrees were a ton of food and would be a good split option in the future. I ordered the goat entree and absolutely loved it. Most things are a little on the spicier side if you’re sensitive but by no means overwhelming if you have tolerance. Wow. A true 5 star. I will be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbU9hdWpBRRAB",
            "text": "Tremendous place, unique food and very reasonably priced. Would definitely come again."
        }
    ],
    "reviews_count": 78
}