{
    "name": "Varenyk House",
    "place_id": "ChIJuVtLO6JfwokR7PsurFf4-UA",
    "grid": "QN5",
    "address": "67-14 Fresh Pond Rd, Ridgewood, NY 11385, USA",
    "rating": 4.9,
    "user_ratings_total": 249,
    "phone_number": "(917) 909-0257",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQ01XWkxRVEEzUW5SNGNFOVpOblZ5VDNGc2FGRRAB",
            "text": "Their food has become a necessary part of my regular routine. The spot works for laid-back dinners or solo meals. The chef creates wonderful dishes served by kind staff. Plenty of employees maintain operations here with friendly dispositions. This place should be experienced."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRGEyNDBTM2d6T0hwV1FXMVpWVzlWVTJkYU9VRRAB",
            "text": "Varenyk House broke through the ceiling of my expectations. Undiscovered spot serving only the best. Their meals showcase freshness with artistic plating. Their service standard is the restaurant's main feature. The style here is refreshing."
        },
        {
            "date": "3주 전",
            "language": "uk",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdGRUWldlVTl6TURkNlRrMTFXRmgxVWt4VVIyYxAB",
            "text": "Олівʼє ідеальний. Вареники ідеальні(великі та з ідеальною пропорцією тіста до начинки! Рекомендую."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVE5EUlRXbVk0TlRSb1QyOXZUR1kxTjBsU09WRRAB",
            "text": "I want to recommend this business to everyone from the bottom of my heart. I’m incredibly grateful to Varenyk House for making our Engagement Party so special and unforgettable!! The food was incredibly tasty and made with so much love. It felt like my grandmother’s cooking. The entire experience of working with Varenyk house was magical. The level of professionalism truly amazed me. We communicated our budget, the dishes we wanted our guests to taste and the amount of people attending. Stepan(God bless this man) personally advised us on best selection and amount of food to make the experience unforgettable. He gave us so much care and attention to detail. We felt fully taken care of in the food aspect. The delivery was exactly on time which made our organization so much easier.\nWe were truly amazed when the food arrived, everything( Varenyky with potatoes and mushrooms, Varenyky with Lamb, Chicken Kyiv, Syrnyky-sweet cheese pancakes with chocolate and more) looked and tasted amazing. Also, they gave us a full tray of complimentary dish (deruny-potato pancakes) which was an incredible treat. The guests couldn’t get enough of the food and kept asking who made this magic.\nWe will definitely choose Varenyk House for every future event. 🤗❤️🥟🥞🍄‍🟫🍗✨"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SaE16RmlXbXBNY0dGTFQwc3lWV3RCVUZCcGMzYxAB",
            "text": "I’m so glad I discovered Varenyk House! They offer a fantastic variety of authentic frozen Ukrainian foods that taste just like homemade. The varenykis are perfectly made — tender dough and flavorful fillings — and it’s such a treat to have traditional comfort food ready in minutes.\n\nOn top of the great food, the service is excellent. Stephan, the cashier was incredibly friendly and helpful. He took the time to explain the different options, gave me great recommendations, and made the whole experience welcoming. It’s clear he really cares about customers enjoying the food.\n\nIf you’re looking for high-quality Ukrainian specialties and warm, genuine service, Varenyk House is the place to go. Highly recommend — I’ll definitely be coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsd01HTlhSa1psWTJSWWFtdExaRUl5Y25CdU5tYxAB",
            "text": "Ok"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NGFWWlZkbTFxWkdkR05GWTNaM2t4YUdsTVdYYxAB",
            "text": "Homemade Ukrainian food was delicious, 10/10. A bit pricey but costs every dollar."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWlRqUnZjVzFMT1hWU1duWmlUV1pLTTNBdGJsRRAB",
            "text": "Amazing pierogis and friendly service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGV05Wa3dSRGt3VlZJMFN6UlljVEJyWTNOWFVXYxAB",
            "text": "I was very excited to try this Ukrainian place and went the other day for their borscht. The staff was very friendly. Unfortunately, I found the borscht bland and very different from what my mother and grandmother used to cook back in Ukraine. The vegetables were so overcooked and mashed that I couldn’t tell the potato from the beet, and it was missing the signature beet acidity that good borscht usually has. Overall, it felt like poor-quality borscht. I haven’t tried the other dishes so I’d give this place another chance, but I won’t be ordering the borscht again.\n\nPicture attached (I added some sour cream)."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneWNWTnNaV3RuV0VsMGFXd3lWamt0VFdaQlpGRRAB",
            "text": "Authentic Soviet-era canteen vibe. The herring under a fur coat salad is perfectly balanced. Owner plays nostalgic Russian pop that regulars hum along to."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUVRYcHlOMDAyWVRGamJHSmpjelJtT0ZOcldWRRAB",
            "text": "A neighborhood staple, delicious food every time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQmJuZEVTVUZqYzJJd2QwMWxjVVZKY0hkMVFtYxAB",
            "text": "I have been eating at Varenyk House for years. From when they did hot food take-out to fully handmade and frozen to make at home goods.\n\nThe pierogies are pillowy with delicious fillings. I have made mine with different toppings, such as sauted onions, bacon, sour cream and sourkraut. Anyway you make them never disappoints.\n\nI purchased a large bag and made them for our Church Potluck and the rest I enjoyed at home. They were a hit. My friends went to Varenyk House for this pillowy goodness.\n\nVarenky House has lots to offer. It's also cool seeing them prepare all this deliciousness"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRM05UTkhZbWt4U2tSaU5XaHhTVFpqU0hoSExVRRAB",
            "text": "I’ve been coming to this place for as long as I can remember and I’m always greeted by the same face.\nIt feels like coming home after a long day of work and being greeted by fresh homemade and authentic Ukrainian cuisine.\nIf you come here, you will come back, just ask for Steven and he will set you up for life."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMGJFMTVhbGQ1TjFwTVZXdEJia3gyVlRZd1duYxAB",
            "text": "The restaurant's layout makes every seat feel like a good one. The employees delivered prompt and cordial service. The little restaurant offers quality dining. Their dishes impressed me more than I anticipated. Every detail here shows quality."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRM1RHdE1iR2x6ZVd0eVFWOXJUR3RIWVhrNVdtYxAB",
            "text": "The best evaaaaaa! Taste of heaven! GOATed dumplings and I say this as a Chinese person!!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNlptbHNTRXBUTFdOcWJXb3hRbTR6Y204d1lXYxAB",
            "text": "If you are a pierogi lover you have to visit this place! Huge variety of flavors from savory, vegetarian and meat to sweet.  The price is very reasonable, for a big bag of pierogi you pay between $20-$25. They also offer soups and other Ukrainian specialty. Please check them out if you are in the area. You won't be disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NWMzazNja2haVGkxcWQyZHNSM0JrTlV4cGRrRRAB",
            "text": "This is my favorite shop in the neighborhood. I always stop in to stock up on pierogis. The amount per bag for the price is a great value! I highly recommend this spot to anyone looking for high quality food made on sight."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KM1IzWXlkMkpEUmkwM1pVZDRUVGMyYm1Nd1ZHYxAB",
            "text": "A few days ago, while strolling down Fresh Pond Road, I stumbled upon the most charming little Ukrainian gem—a cozy, family-owned store specializing in handmade dumplings and pierogis. The storefront had a welcoming vibe that instantly drew me in, and I’m so glad it did.\n\nInside, the aroma of freshly made dough and savory fillings was irresistible. They offered a beautiful variety of flavors, from comforting classics like potato and cheese, chicken, and steak veal to indulgent dessert options such as sour cherry and blueberry. Everything is made fresh with care, and you can buy the dumplings by weight, which is such a thoughtful touch for customers wanting to try a bit of everything.\n\nA kind gentleman behind the counter guided me through the selections with genuine warmth and knowledge. I went with the steak dumplings and sour cherry pierogis—and wow, what a treat! The steak filling was flavorful and tender, perfectly seasoned and tucked into pillowy dough. And the sour cherry pierogis were pure joy—slightly tart, slightly sweet, wrapped in delicate pastry that tasted homemade in every bite.\n\nI can’t wait to go back on my next paycheck and sample more of their offerings. This place is a little treasure, and if you’re ever in the neighborhood, it’s well worth a visit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GelpubDZTRmM0UXpoa09GZHVTMnB3ZFZnM1pGRRAB",
            "text": "Amazing place. They have different varieties of vareneky ( pierogi, dumplings),and pelmeni which I eat with  chicken or beef stock. My favorite are lamb pelmeni, absolutely delicious. Store staff are very helpful."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rM1lVaGxjVmQxYTNwV05GWmpUMngxV2tKWFdGRRAB",
            "text": "I’m a creature of habit and have only ever gotten the potato & cheese, but that’s also because they’re unbelievably good and it’s hard to turn away from perfection. Everyone who works here is also super kind and friendly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMlowMVRVelZ5Tmtab2RVczNkbkJyTVdwdldtYxAB",
            "text": "Helpful staff and a wide variety of absolutely delicious homemade products!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STWFGY3hZWEJpUzJObFVFZG5OR0kwUTJSWlZGRRAB",
            "text": "Amazing home made products. Staff is friendly and answered any questions we had."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVmJVeFZkMmh2VjNKTGQwbHVOazFpUVZGeVRtYxAB",
            "text": "amazing dumplings, short rib ones are my favorite.  also had their bigos which was reallly good as well.  the dough on the dumplings have a really nice bite and the short filling is so good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONlJHbHZjMUZrVGtwS2JHVjNSM2MzV1VFNFduYxAB",
            "text": "I love this place! I’ll often stop by to pick up some Ukrainian borscht which is a great work lunch (or good when you’re feeling a lil under the weather), but my favorite thing to get there is their bags of frozen varenyky! (Varenyky are like the Ukrainian version of pierogis.) I love the beef shortrib, sweet potato, and more traditional fillings like potato & mushroom or farmers cheese. Great thing to have in the freezer when you need to whip up a quick meal. Check it out and support a local small business :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQ1kwOURSMHhFUTJsVFpIRkJia2g1ZUd4VWJrRRAB",
            "text": "Everything I’ve gotten here fresh and frozen has been phenomenal. Neighborhood gem."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNdFZIWjNUR2gwT1RCelRTMVphMTh4T0dwRFowRRAB",
            "text": "The best place in the neighborhood to stock up on frozen meals. Incredible sour cream when fresh too"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abGVVMXhhSHBZYkhveWNuVm9hMFpyTUZNNFRtYxAB",
            "text": "i basically live off the food here. homemade incredible stuff that feels like a european deli it’s really so perfect and stepan is an angel ❤️❤️ but your weekly dinners here you’re set"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeldUWTVVbWw2ZVVGT1RsODJhM1ZYV1UxNmNXYxAB",
            "text": "Best Varenyky in new york, tastes like home!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaGNuQmxXWE14VlMxQlMySmtNamxZWlRKUGRVRRAB",
            "text": "Easy to make delicious frozen authentic ethnic Ukrainian flavor meals,that fit my busy schedule , blast frozen and really high quality\nDefinitely recommend and will be back shorty. Adopted"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MW9qU0NREAE",
            "text": "At the risk of giving away Ridgewood’s best kept secret!!! I’ve been happily traveling across town for the AMAZING food from this Ukrainian deli. I’ve only tried the hot buffet and the food was so delicious, just like someone’s mom would make. The store also has a large selection of varenyky, fresh meat, Eastern European snacks and desserts. Everyone works there was super friendly every time I went. If you are looking to support a local Ukrainian business, this is the place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZkhrTy1kdS02d0l3EAE",
            "text": "The best varenyki in NYC.\nHighly recommended!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcmdnNHVMa3NPS193RRAB",
            "text": "A LOVELY establishment with very very helpful staff. My Russian friend is pregnant, thanks be to God, and she craved borscht .\n\nthey did very kindly speak to her over the phone about their many options. I tasted things I'd never had and they were DELECTABLE\n\nif any Ukrainians/Russians/Polish in the area I recommend them obviously to everyone else but especially if you crave something Specific to that region  and hit up my friend ig @artbyilato for BEAUTIFUL RUSSIAN art murals 🇺🇦🇲🇽🍋"
        },
        {
            "date": "6달 전",
            "language": "uk",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGY3d25nRRAB",
            "text": "Часто заходжу у цей заклад і залишаюсь в захваті! На вході мене зустріла приємна українська музика, що створює затишну атмосферу.\nДуже приємний власник, бажаю йому успіху!…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbjVhenpnRRAB",
            "text": "Amazing small business!!! Just bought two pounds of the best sour cherry vareniki, was a highlight of my day! Thank you❤️🫶🏻 Слава Україні!!…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd3B1TGVnEAE",
            "text": "Definitely pick up some stuff from here.  The dumplings they sell are exactly like Polish pierogi, plus a ton of other delicious food.  Always see a bunch of grandmas in the back making them by hand."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dXNQZU13EAE",
            "text": "The borsch with sour cream is so good!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOHF6VjlBRRAB",
            "text": "The best Ukrainian cuisine in New York"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeVpqbUhREAE",
            "text": "Great food,always fresh and delicious!! The best place to buy meat in Queens.Highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMHNIUmtRRRAB",
            "text": "Amazing place for authentic Ukrainian food. Their homemade pirogies and vareneky are the best! They have different varieties. I always get the frozen potato onion one, and potato and cheese ones and boil them at home, topped w sour cream and sautéed onions..so good.\n\nThey’re sold by the pound and are extremely fairly priced at around $8-10/lb depending on the filling or course. A full bag is about 2.5 lbs and you will get quite a lot of portions from it!\n\nThey also have some hot foods, as well as desserts like honey cake and sour cherry varenyky.\n\nService is very nice and the store is extremely clean and modern.\n\nPlease support this small business 🇺🇦"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucDhLRWlRRRAB",
            "text": "Not sure about the recent commenters complaints about the pierogies and stuffed cabbage. Had both very recently, multiple times. all the food here is incredible. I love the pierogies AND the stuffed cabbage the most. Grateful for this neighborhood spot 💫"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURud2JiejZnRRAB",
            "text": "I like it. You can try !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaFl1MkxnEAE",
            "text": "The best Ukrainian food and service, thank you💗💗💗"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucXBtaW1nRRAB",
            "text": "I'm sad to say this, but the quality of food at this place has drastically gone down. I stopped by recently since I was passing by, got a small borscht, stuffed cabbage and a portion of mushroom pierogi. Borscht was delicious. The stuffed cabbage was nasty! The actual meat and rice stuffing inside of the leaves was just terrible. It was extremely bland, there was a total lack of seasoning. I'm not sure how you can ruin pierogi, but the ones that I got were not up to par. The mushrooms were unseasoned, and the pierogi itself were extremely mushy. Food here was great at one point, it's very disappointing how bad the quality of the food is there now. The counter person was lovely and extremely nice, at least the staff is polite and courteous, so that's a plus."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3a3V6bUxBEAE",
            "text": "amazing food and kind staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycUtPSGdRRRAB",
            "text": "This is a store not a restaurant. Despite pictures you cannot order any food to eat on site nor there is no place to sit down. Guy behind the counter is rather fit for working at the DMV instead retail."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyamNqMlZBEAE",
            "text": "great imported products!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMN2R1UVZBEAE",
            "text": "Very delicious real Ukrainian food. My favorite Ukrainian restaurant in town!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURULTZYS0VREAE",
            "text": "The place stopped serving food and now only makes cold small dishes like borscht  and soup that you can purchase and take home. Along with frozen handmade pierogi and other Ukrainian dishes and sausages. I have a bone to pick with places like this. They sell things by the pound and though I am not against that I am against deceptive pricing. Though it is stated in their menus how much everything is per pound, the packages of pierogi and other goods are not labeled when you pick them up, there’s zero information of how many pounds it has and the price. All packages are weighted and priced when you’re ready to pay. You never know how many pounds a packet is before you intend to buy it and by that time you feel some indirect pressure to buy them since you’re at the counter ready to pay. It’d be so much better and more transparent to put the prices and their respective pounds in the packet itself and not when you are about to pay in the counter. The quality is great, but the pricing is a bit much for it to not be a seat down restaurant or any type of restaurant whatsoever. The person that attended me was also nice and explained how to prepare the stuff that I bought which was helpful. Besides the deceptive pricing the food was good but I’d never go back here.\n\nEdit: I have reconsidered my star level after the professional respond and decided to be more lenient. If they start labeling the products itself I’m sure their success will be even higher. I am aware the goods are hand made and again, I am not against their business. I appreciate the business’ response and hope the best for them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUelA3Rk9nEAE",
            "text": "This place is a secret food goldmine.  Best perogies and blintzes and schnitzel I’ve had in years.   The gentleman who runs the counter is super inviting and courteous and has given me quite a few things to take home and try.   The selection of everything is amazing.  There truly is something for everyone there and i will frequent this place for the rest of my days in ridgewood.  You’d be silly not go there, or you just don’t like good stuff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcjlmYkZnEAE",
            "text": "Varenyk-House is a true gem in the world of Ukrainian cuisine! They skillfully blend traditional recipes with a modern approach, and their varenyky with sauerkraut are a taste that transports you straight to Ukrainian lands. It's an exquisite balance of flavors that impresses and enchants, making it the perfect choice for those looking to experience authentic Ukrainian culture and taste through their dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadlppYVlBEAE",
            "text": "I ordered the short rib and potato with bacon varenyky. They were both so delicious! The borsht and olivye salad was exactly how my grandma used to make it. I will be coming back here to try the rest of the menu. They also have a store inside where they sell a lot of the tradional ukranian foods and I got really good pickles. Service was extremely nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXamNHV3pnRRAB",
            "text": "This spot is amazing. I have never had Ukrainian food so this was my first time having it. And wow was it great. My wife and I had the chicken and it tasted amazing. I am so glad this place is in the neighborhood.  I would definitely recommend this spot :)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlN3VmbktREAE",
            "text": "Delicious food and nice people. I love the Varenyks, you get all the yummy accoutrements. Plus they have an amazing selection of Ukrainian specialty groceries, ice cream/candy & drinks. We love to support our local businesses & Ukraine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCOWU2a1p3EAE",
            "text": "The best Ukrainian store deli in Queens!Very clean premises,big variety of fresh homemade food,friendly and helpful staff!👌\nСлава Україні!…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5alBDdEpnEAE",
            "text": "This Ukrainian store is a wonderful addition to the neighborhood!\nThe store is very clean, and the staff is welcoming.\nGreat selection of cheeses, meats and most importantly they have amazing hot food as well as selection of frozen handmade varenyki (Ukrainian pierogies)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NjZ5VXJRRRAB",
            "text": "Varenyk House is a jewel in the heart of Ridgewood! They have awesome Ukrainian fare from blintzes to varenyky, including all the fixings! They also sell their varenyky frozen so you can prepare them at home. I stop by at least once a month."
        },
        {
            "date": "수정일: 3년 전",
            "language": "uk",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyN05Ibzl3RRAB",
            "text": "Я замовив плов по-українськи, наче готувала моя бабуся.\nЯк доповнення до плову є ще два салати: буряковий і з квашеної капусти, який готують в закладі.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNGZxSmVBEAE",
            "text": "Varenyk House has been a go-to lunch spot for me since they opened. The prepared food is delicious and they also have a small butcher counter for chicken, pork, sausage and fish. The service is super friendly and happy to explain anything I'm not familiar with and even give samples. The lunch special is a very generous serving, I can usually make two meals from it. All of the namesake Varenyk dumplings are delicious, you can't go wrong, but the short-rib is a stand out. All the soups are great and they make my favorite borscht in the neighborhood! They also have dessert! They do it all, I love Varenyk House."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOekt1U3lnRRAB",
            "text": "I’ve been ordering from here for about 2 years — the food & service have been excellent every time.  Varenyk House is definitely the place to go for high quality homemade Ukrainian food.  Borscht & short rib varenyky are best I ever had. But having tried most of the menu, I can honestly say it’s all delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaa2F5ZHZ3RRAB",
            "text": "Varenyk House is a great place to get Ukrainian food. I recently ordered  dumplings and blintzes for a celebratory gathering, and was very impressed with the food and service. They were very helpful in advising me on how much food to order for the number of guests I had, and everything was ready on time and piping hot. The varenyky and blintzes were all delicious, with a variety of fillings to choose from.\nI would definitely recommend Varenyk House to anyone looking for a delicious and authentic Ukrainian meal. I'll be back for more soon!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeE9UQlh3EAE",
            "text": "We were visiting NYC in early June and staying with friends close by. Went to check this place out due to all the five star reviews and we were not disappointed. The short rib varenyky are simply amazing. I couldn't stop eating them. We also got some fresh breakfast sausage, chicken salad, Olivier salad and the owner insisted we try some uzvar. It was all delicious and it hurts my heart to know this store is 3000 miles away. The chicken salad was perfection. The consistency was more like a pate and seasoning was just right. Exactly how I like it. I can't wait for my next visit to Queens.\n\nEdit: I had my next visit to Queens last week and Varenyk House was one of my first stops. I seriously cannot get enough of the breakfast sausage. I brought some frozen back to Oregon and we are eating it this morning while watching the snow fall. If they shipped their products, I would be ordering regularly. So good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dlBTVG13RRAB",
            "text": "I visited this place with two of my friends today and it was absolutely amazing.  The guy behind the counter was happy to offer advice and even taught me how to properly pronounce Varenyk.  I was especially taken away by how great their sausage and Beef Short Rib Varenyk was.  Once we ate everything, we had to go back for desserts!\n\nThank you so much for the wonderful food, service, and teaching us so much about your culture."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dDVxUDZ3RRAB",
            "text": "This place has the best soul warming borscht! You know, like when you didn’t check the weather and got drenched in the rain and you’re walking around like a wet cat and need soup, and then you find that delicious soup and it was an amazing day all along!? Yes that kind of good! Great place for specialty groceries too, it’s where I get my linden tea. Highly recommend if you’re in the area"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxM3FPTHlRRRAB",
            "text": "We read about the place and went to check it out from NJ. It proved to be better than was advertised!\nThe place of Ukrainian food (mostly, there are some other pleasant surprises too). For take outs - fresh or frozen. The produce is hand made and of superb quality, also of genuine Ukrainian recipes and taste. Amazing variety. Also sells some super popular food brands from Ukraine. They also give an easy chance to contribute to support Ukraine in its fight against russian aggression.\nWe got the stock of varenyky (frozen) for months ahead plus other products by Roshen and Bepec (Ukrainian brands we miss so much). Was great to chat with the owner, who also runs the operations himself and passionately talks about every product they sell. Will definitely come back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaa2RPSVNREAE",
            "text": "Excellent food & service!! We were on the look out for some fresh Ukrainian varenyky and this place did not disappoint. We got hot vareniki with sauerkraut & mushroom as well as vareniki with sour cherry and they were both absolutely delicious. Also purchased some Ukrainian bread and carrot salad which turned out to be an amazing tasty combo.\n\nCurrently driving home with some refrigerated ready made cheese & potato varenyky that we plan to reheat at home as we were told they can keep in the fridge for up to 5 days. This is apparently one of their popular varenyk flavors and I’m sure they will be delicious too.\n\nThey have so many more items to try and I love that there are so many vegetarian options too. Great job guys and keep up the amazing work!!\nI am from out of state but might have to come back to NY for this place!"
        }
    ],
    "reviews_count": 65
}