{
    "name": "The Seneca",
    "place_id": "ChIJESqltthdwokRpRsWDfkJMGU",
    "grid": "QN5",
    "address": "5-82 Seneca Ave, Ridgewood, NY 11385, USA",
    "rating": 4.6,
    "user_ratings_total": 376,
    "phone_number": "(347) 599-0010",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdVduaEhNR0pxVFRWb1YwZENUbkpTZEZFMldIYxAB",
            "text": "Fun times"
        },
        {
            "date": "수정일: 4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cmRyU2N3EAE",
            "text": "Rude, condescending service. Terrible experience. The attitude of the staff was so bad that we left without eating or drinking anything."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZeVdVRmZUVXRNWW5WQ2VsaDFVekJuVFROUVdrRRAB",
            "text": "Food is good, but the music is in need of improvement-hot topic myspace screamo at full blast is not what we want to listen to while eating."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RE9WUlZZVVpqUWt0c2RVUmFVWFU1ZFZob1UxRRAB",
            "text": "Solid burger."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeGNEaENUbEprY0ZaQk5saFBhSFozYlZWQlFuYxAB",
            "text": "Totally serviceable bar with a pool table."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wYVdYSlFjRTFWWkZneVJGQlpMV0Z2TUY4dFdWRRAB",
            "text": "Burger is great, but the chicken salad Cesar wrap (no croutons) is in a league of its own."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWk1ESnhTVVJOTkdKVWNrUlFXVEl5YjFCMk9GRRAB",
            "text": "Great pool table. Drinks are strong, vibe is chill. Kinda dead for a a Friday but that’s great when you are just catching up with friends."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkQlpUVkVUMmsxU2tKTFltRm5hME5rUjBaT1JWRRAB",
            "text": "Large bar with good bites, a backyard, and a pool table."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Vd1ZraHFjbGd0V2w5UE1VVk9kbDlLY2taRGNrRRAB",
            "text": "Attended a private event and was pleasantly surprised! The food was excellent, staff was friendly and accommodating, and the venue was spacious. Would highly recommend for special events"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VFZTMHlPRGN6ZEV4NlVXMXRURlJ2ZGsxRldHYxAB",
            "text": "Amazing food and drink, also have DJs who rock it <333 Jacob and José are sweet and attentive servers. Thanks guys! Couldn’t recommend this neighborhood pub enough <3\n\nMust try: the peanut cucumbers 🥒"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RlMwNWlTVkJyTTJKMmJFRldNM3BrTTBWc2VFRRAB",
            "text": "Great hamburger (could be a bit bigger though)\nPerfect french fries\nLovely atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSldqZHJXVlZxTm1aVGRUaHNRbGxIT0hGV05YYxAB",
            "text": "Loved the vibe, the food was great, and the service was attentive and helpful. We had drinks and dinner at the bar. We loooved the signature cocktail, strawberry green-tea-ni! It was refreshing and delicious. We will be back!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WGVFVTVXamRxT1RSR1J6Vk5iRU4yYlVOaFFWRRAB",
            "text": "Bueno"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21od1QwVmpkeTFQY1Y5SFNXVnNVRE53Y2poRU5tYxAB",
            "text": "There burgers slap. For real. Monday night is the deal, burger + a free drink."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMmFtWkJjMGRQZEd0SkxYVmFZbE5tT1dJNU9HYxAB",
            "text": "The food at this restaurant is good. However, the service is disgusting! Waiters and waitresses completely ignore you and won’t even give you a menu. Once I asked for a menu, they said “go get it yourself”. We sat and waited for 45 minutes for someone to take our order and not one server came and took our order. Mind you there were two empty tables, they weren’t even that busy. Never coming back… servers look at you like you have 4 eyes and are so rude….."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preFZqTTRTVFJvWmpsUFVWbDVObXhFZUhwVkxVRRAB",
            "text": "A lot like a city dive bar.  They had games available to play (darts / pool / board games).  Nice place list of alternative rock music.  Food was good, service was Ok.  Nice local spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONGRtNHRUa2t5Ykc1dFJFNTZOMk4yWkUweVZtYxAB",
            "text": "Miranda is goated🥲"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLVDF2cnl6bzkzLW1nRRAB",
            "text": "Seneca Burger and Fries with that truffle! 🔥😩\nHave mercy"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMUy12X1hkd2RPcy1BRRAB",
            "text": "Great customer service. The wings are awesome."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJb2FQY29RRRAB",
            "text": "So we came on trivia night (wasn’t aware) I believe a Wednesday or Thursday and it was kind of cramped and parking was so hard. The burger and fries are actually solid but service was painfully slow despite the decent going on. Most of the trivia players were already served so I’m not sure why it was so slow. Would likely get takeout but only if I’m in the area. Not worth the trek"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3c1AtN3VnRRAB",
            "text": "The \"side salad\" they offer for $5 was shredded iceberg with no dressing and the bartender ignored me so many times I couldn't ask for dressing. Giving 3 stars for the atmosphere and drinks"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnXzVMVnZBRRAB",
            "text": "Great with kids and without 💗"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOTgtNnJ3RRAB",
            "text": "Randomly went in for a burger and was EPICALLY BLOWN AWAY but the double smash burger,it was heavenly, delightful and dare I even say, orgasmic?! For some reason I had never had a \"smash\" burger before, but now I know, I am initiated, I am one. Side note, the 'shoestring' style French fries were a little weak, it just feels like I'm eating chips. I want my fries to be thick and weighty, but I can suffer the mediocre fries for that burger 🔥"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNmJqcjVBRRAB",
            "text": "Chill place with good vibes . Absolutely go there for their amazing burger"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc095UXVBRRAB",
            "text": "Great neighborhood bar"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdDZuWnZnRRAB",
            "text": "Great spot for burger, chicken wings and incredible fries! Our fave local spot"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaXJqVnNnRRAB",
            "text": "It's one of our favorite local spots. Competes with some of the best burgers in the whole city. It's a bit pricy but definitely quality."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNW9UQ2tBRRAB",
            "text": "Burgers good, super cold in the back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMnJLQzBBRRAB",
            "text": "The mimosa party that makes you laugh and smile..... also the fries are extremely kiki (YES!!!!!!!!!!!!!) where most other fries lean bouba. As a kiki fry enjoyer i really appreciate this"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNFl1c253RRAB",
            "text": "Good vibes, better burger. Solid draft selection, staff is cool and friendly. A neighborhood watering hole."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2X3ZPcy1BRRAB",
            "text": "I love this place and come here all the time! It’s such a nice big space and super welcoming and chill environment. It’s my fave spot in the neighborhood because their house-made veggie burger was the best but they recently changed cooks and the new veggie burger isn’t as good :( pls bring back the old veggie burger!!! It’s perfect otherwise and the food is amazing overall"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbnRlTTVRRRAB",
            "text": "Hands down one of the best smash burgers in NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeTR6TXpBRRAB",
            "text": "this burger was insane!!! it's a must try. my partner had their octoberfest bratwurst special which was also super tasty. also perfect fries - thin, crispy, and seasoned to perfection. all this with cider on tap made for a perfect fall stop in"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubXFfRXhnRRAB",
            "text": "This was a random find but I was in the mood for some wings and this place delivered! Slapped. Smokey, crispy, but still wet. Great spicy marg. Great smashburger too. Service is tricky. You almost have to run down a bartender to get help. But honestly they are super nice just a lot going on. Will def be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueV9URkNnEAE",
            "text": "One of the best burgers in queens"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucGVqZWNnEAE",
            "text": "Nice little dive. Good for a quick pop in drink and small bite. Limited food menu. Food is decent. Pool tables, booths, bar. Decent drafts. Good local spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaFlMRnJRRRAB",
            "text": "This is great place to just have a drink and have some good food.they also have a great staff I highly recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib3NpZFZ3EAE",
            "text": "Came here to pick up a takeout order. Their grub hub was down, it was not busy. I sat at the counter and no one came over to see what I needed. I let someone know I was waiting for a takeout order and they didn’t ask how it had been placed (being that their online orders were down). Sat for 20 minutes asked again about my order and someone finally thought to ask how it had been placed, and let me know that the system was down. They did offer to put the order in and admittedly I said no as I just wanted to go home at that point. The employees here don’t see to mind the customers very much and it’s not the first time I’ve had this kind of experience here. Will not be coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNid3NpSDJnRRAB",
            "text": "Tried & true.. I come here at least once a week. Food is really great, killer happy hour, super nice bar staff. All you could want in a neighborhood bar!! Special shoutout to martini night & the burgers 😍😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMl9YN0RREAE",
            "text": "Average bar, with over priced drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaWUtZl9nRRAB",
            "text": "I want this place to be successful, but I also want to keep it as a local gem"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydk4yQzN3RRAB",
            "text": "Food was decent. Wasn't crazy about the dog policy. Place didn't feel clean. Not sure if I would go back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMODh1bGVBEAE",
            "text": "If you love to have bartenders and the owner, just stare at you while you wait at a table waiting for someone to take your order....this is the place to come to. I used to come here religiously when the staff used to give a damn and now I remember why I stopped coming. The food is good. But is it worth waiting for 30 minutes to get acknowledged....not really."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMy1Tc1FBEAE",
            "text": "I ordered two drinks and was given only one. Then the bartender left for 30 minutes ignoring me. Finally I sat down at a booth and then he remembered the second drink. I was planning to stay all night but decided to close due to the terrible service. After another 20 minutes I had to remind the bartender that I gave him my card. Either end booth service or hire a 3rd staff member to just wait tables. Also why is your waiter not completing orders at once and eating a mouthful of food during his shift. Such a weird experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNGZtWmR3EAE",
            "text": "Great food spot kitchen is open late night till 11pm which is great. Got the burger and spicy chicken sandwich. Was surprised on how delicious both sandwiches were. Spice on the chicken sandwich was very spicy with lots of sauce, which is great since I love Saucy burgers.\n\nAlso dog friendly, has outdoor seating and nice staff. Good decor and good vibes. Definitely recommend for a late bite or just a nice chill time with friends if you’re in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROa011aUhREAE",
            "text": "The smash burger was delicious! The fries where awesome, love me some skinny fries. We sat at the bar service was great. Highly recommend this joint."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZMnUzWVhnEAE",
            "text": "The place is beautiful and huge. Would be amazing for parties and friends from out of town but sadly the prices and food just don’t make it inviting. The beer selection is vast but the prices are outrageous. The mixed drinks are worse for the price but could be so so good if just more $5-8 drinks. Limit the selection, curate the food a bit more (is it all american? Is it southern? Is it vegetarian friendly? Is it a coffee bar?) and get that website updated with a google calendar to list all the events!  I see on your chalkboard outside things advertised but when i want to be reminded of what happens on what day I cannot find the information!  This has great potential and is very cozy but just needs to have a price point to match the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNGN5TU5REAE",
            "text": "The Seneca just joined the brunch game and it's already a must-go.  The space has a lovely skylit classic old tavern feel, but the menu is fresh and modern.  From the bright, punchy breakfast tacos to the perfectly charred smash burger to the share-size pancakes (HALLELUJAH why are these so rare!), this spot is officially in the rotation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NkliRzRRRRAB",
            "text": "Celebrated my wife's 45 bday there. Wwe theme night. Food and staff were awesome..shout out to the manager Michael for making her day extra special."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJc2M2cEZBEAE",
            "text": "This relatively new spot is a really nice place to meet a friend or just sit and hang out. It's a good mix of locals and neighborhood newbies, with interesting bartenders and a nice atmosphere.\n\nGREAT food menu that is thoughtful and not too expensive."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzaWNDQmRREAE",
            "text": "This has been a neighborhood favorite for me, since it opened. I would host mommy time meetups, I love everyone who works (& worked) here. I have brought so many people to this spot, they fall in love too. We have celebrated my birthday…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaHVIT0V3EAE",
            "text": "Love this place. Have been coming for a few years and it’s always a great experience. Bartender/server Jack is always attentive, even when the place is crowded, and makes a mean iced Irish coffee! The food is amazing (try the burger and GET EXTRA PICKLES!!!) Def a number one spot to hit up in Ridgewood for brunch or their sweet burger deal on Mondays!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaDVLYjN3RRAB",
            "text": "i love this place! i live around the corner and often pop in for a quick drink or for food. the food is delicious (hello fries??) and the staff is friendly, they handle the double duty of bartending and serving attentively and kindly. can get busy on the weekends but always great vibes.  great local spot!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6Z0ozdkRnEAE",
            "text": "Love love love. The bartenders are so friendly and make great cocktails. They he burger is amazing. There’s always great music and my friends and I love to spend a night playing pool in the back. Oh! AND there’s a back yard."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eHB5ZkxnEAE",
            "text": "Phenomenonal fries (get a tray!). Seriously some of the best fries I've ever had.\nThe burgers are borderline perfect. Great atmosphere for a night out with with your partner, friends, or even the family. The restaurant has warm vibes and comfy chairs. I keep going back again and again. Plus the happy hour is nice"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwd0pIa1NREAE",
            "text": "The food here is really good. I’ve been twice and ordered the chicken sandwich and a salad. The salad portion was surprisingly large. The burger was a little on the smaller side but the flavor is really good. Their shoe string fries are also very tasty. Their service is very good too. I’m currently pregnant and never feel pressured to order more than water which I also appreciate since they do have n/a drinks on the menu. I’m limiting my sugary drinks intake due to dietary restrictions associated with my pregnancy. All in all, a cute neighborhood spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMmI3ME1BEAE",
            "text": "I never really write reviews and I wanted to write one because I feel like this place is an underrated hidden burger spot. I've been to so many burger joints in New York and although there are other great spots, the burger here is the perfect size and the ratio to all the ingredients and is really good. Maybe I prefer a smash burger but I've been to Gotham Burger, 7th Street Burger, and Mighties.. but both are not nearly as good as this spot. The lemon pepper wings were also good with smokiness - I think they smoke them in house? The interior feels cozy like a bar I'd find upstate somewhere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREck1paU5nEAE",
            "text": "Great service and warm sports bar atmosphere. Menu selection is limited to hamburgers and fried wings. Not much healthy selection.  Would like to see expanded selection, maybe some exotic flair. Even Applebee’s is has Korean bbq flavor chicken and Indian curry flavors. Not a place to try something new and exciting. Come for the beer and sports show and skip the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsb0tPem5RRRAB",
            "text": "Great casual pub with nice and fast service. The smash burger and fries were delicious! On Mondays you get a free drink with the burger which is an awesome deal. Good place for a few drinks and some quick and tasty bites with friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROOS1DaHZnRRAB",
            "text": "Mediocre at best\nWe had a round of pickle shots (my first time, my friends who had experience were not impressed but I thought it was good) and then fries.\nThe food and drinks were fine. But nothing so fantastic that I'd be eager to come again...but if I'm in the neighborhood I don't mind stopping by you know?\nWe took over a booth as someone left. The server saw us and brought menus and cleared the glasses but did not wipe the table even though it was noticeably dirty...then she told us that it's just straight bar service (meaning we order from the bar) so nothing too impressive about the service.\nThe vibe was nice otherwise."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdzZyMmdnRRAB",
            "text": "Great location for hanging with friends and fam,esp when fights are being played on the big screen. Went here with some friends 2wks ago and had a swell time with them, and the bartenders were patient and helpful with my order of drinks (heehee). Nonetheless, I recommend this place. Plus, I never got to try their food. However, a local resident in the area expressed the greatness of their burgers, which looked appetizing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMG9pZ053EAE",
            "text": "I’ve been to the Seneca over 10+ times and love all their food. The atmosphere is great vibes however ever since Feb the service has declined dramatically. The wait staff the last 3 times I have been have ALL been extremely rude to not just me but to other customers. They take forever to acknowledge you and take your order. No one checks in on you which takes forever to either order another beverage or get your check. They always seem like they are bothered by you wanting to order something and it’s very uncomfortable talking with them because they are just in a bad mood and rude. Management should really reconsider hiring new staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCODQ3dDVRRRAB",
            "text": "Delicious food & drinks!\nThe best French fries everr!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMZzVqQzZRRRAB",
            "text": "So I waited 5 minutes and no one acknowledged me, cool w/e it’s also a bar. I ask if they’re still serving food they say I have five minutes to order.  Brings my food never asks me anything or brings water. To top it off a big party of ppl come in and I see the employees look at each other in discomfort, like you have another hot off work why not make more money?"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdDRDN3lnRRAB",
            "text": "They have the best smash burger! It's the only burger I ever crave. It would be my go-to spot if I lived in Ridgewood. Great place for small or large group of friends if you're looking for a casual spot with really good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqck03aWZ3EAE",
            "text": "This is my absolute favorite spot!!! The bartenders are so attentive and accommodating. I always feel welcomed, whether I'm alone or with friends. Food and drinks always come out quickly.  Nothing beats The Seneca!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURObllqOVZnEAE",
            "text": "Generally order delivery from The Seneca. One of the best smash burgers in the Ridgewood/Bushwick area. Great fries as well. If you visit, the service is super laid back and attentive. Definitely one of the best spots around for a quick meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNFpIbVdREAE",
            "text": "really good food and friendly staff .. the portions are smaller than most places which isn’t a bad thing .. would definitely recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dUtIb3JBRRAB",
            "text": "Excellent Happy hour specials here. Great place for a pregame or if you want to spend all night! The mezcal martini is particularly delicious with oysters"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ09pczBRRRAB",
            "text": "The Seneca is an awesome place to grab a drink, some good food, and play a little pool! Friendly staff and they even throw in Rangers games every now and then!!\n\nMy only complaint is how they don’t serve Blue Cheese with their buffalo wings….you’re in NYC!!"
        }
    ],
    "reviews_count": 70
}