{
    "name": "Affy's Grill",
    "place_id": "ChIJ0xshHIxfwokRh6uQgQpjhf4",
    "grid": "QN5",
    "address": "69-67 Grand Ave, Maspeth, NY 11378, USA",
    "rating": 4.3,
    "user_ratings_total": 656,
    "phone_number": "(718) 685-2900",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbFZqUmhORXhFYkZWbGNFNXJlalI0U1VSQmNGRRAB",
            "text": "The food was amazing! Giomayra was very attentive and very kind :) I recommend the Hawaiian style ribs as well as the Ribeye steak."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNVpWRTVORzQyTWpOeE0zUjVlVzVTY0haRE4yYxAB",
            "text": "I have been customer of affy’s premium a long time both Brooklyn and Maspeth…so this review is for Maspeth specific…the couple of times I have been to this place at least twice if we order well done steak, they brought medium rare! even though it was specified at the time of order…the restroom is almost always in bad condition with empty soap bottle, no tissue…In comparison Brooklyn Affy’s is better. I really advice the Management, owner to take notice this sort of service will definitley negatively effect the business overall, the owner/management should take notice! and what is very weird most restaurants usually charge gratuity for a party of 4 or more but Affy’s Premium all branches charges even with two people, I dont’t know if they do it for even one person as well! terrible"
        },
        {
            "date": "수정일: 6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSVJsUTFVR2N6YlRKM2ExcGpUMTlIZWtObGNFRRAB",
            "text": "Great food great staff. 😋"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrd1JVSllZUzF0UjBGa1ltUmZlV2RqZG5jeVVFRRAB",
            "text": "Food taste has changed a lot from the last time I tried their foods. Steak was blend and creamy soup was average. Last time it was better. Overall average taste."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UGFWSnNTVVl5WlZoNlVXTnNjVjlqT0VoMlptYxAB",
            "text": "I attended a birthday party here yesterday, and our group was the only table with Black guests. When the cake came out, the restaurant played “In Da Club” instead of singing Happy Birthday. For the other six birthday parties that night, the staff brought out cakes and sang Happy Birthday without any music.\n\nI’m not sure if the song choice was intentional, but it definitely stood out and felt uncomfortable. It would be nice if the restaurant handled all birthday celebrations consistently."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaU1gyTXdjbmRSUW5sVWVrODVjek5WTjFGWmEyYxAB",
            "text": "I went to Affy’s for my birthday with a party of twelve and awhile they were accommodating with the reservation time adjustment, other areas of the service lacked, and I was a victim of discrimination and prejudice. The food was good, and drinks were great however both took abnormally long to come out so much so we had to remind 1 of the two waitresses for our table. The food took a long time to come out and upon bringing out my birthday cake they randomly played a 50 cent song, yet no one in my party nor me requested it. As a black male, with black friends and family, someone racially profiled us and assumed we’d want to listen to a 50 cent song about popping bottles in the club when it’s a halal establishment and I’m Muslim myself. There were several other birthdays at other tables that same night, all of which staff sang them happy birthday, and a random rap song was not chosen and played for them. What I originally thought was a kind gesture of a friend or family quickly became a prejudice act on my birthday, of all days, this truly left a poor taste in my mouth."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdlJHWTVaVVpzV1haSFZuZG9hVVJQUzJsSVVGRRAB",
            "text": "Its okay. Food portions were good. We were the first customers of the day, my lamb was nit cooked the way I asked. It was on the salty side. But overall OK."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBNU9VMWZOVEl3VVhoRGMwOVNkMDl3YkVsTE0wRRAB",
            "text": "Very good food, amazing atmosphere.  Some of the best halal steaks in NYC.  Service was a little slow but very friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JdExYSlFlVU5XYlZFMGVYbFljMjVHVVRVemEyYxAB",
            "text": "Affy’s Grill is an absolute gem in Queens! From the moment we sat down, we were greeted with complimentary chips and salsa along with a jug of water — a small touch that makes a big difference. The prices are very reasonable for the quality and quantity you get, and the portions are generous.\n\nWe ordered two ribeye steaks, each served with two sides, plus an appetizer of fried stuffed jalapeños with cheese. Everything came out hot, flavorful, and perfectly cooked. For dessert, we had the brownie with ice cream and whipped cream — rich, indulgent, and the perfect way to end the meal. Drinks were also on point; the piña colada and mojito were refreshing and well-balanced.\n\nThe staff was friendly, attentive, and made the whole experience enjoyable. The restaurant is halal-friendly, which is a big plus. Parking is metered, so it’s best to arrive a little early to find a spot.\n\nAll of this for just $132 felt like a great value. Highly recommend for anyone looking for a hearty, delicious, and welcoming dining experience in Queens."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRemFqSXhUelJWY0dnM2MyMWxaa3M0TVRKa0xYYxAB",
            "text": "The service is friendly and fast  for a steakhouse, the steak cuts are great. Everything is halal and the price is relatively cheaper compared to other similar Halal places. My personal favorite is a ribeye with the peppercorn sauce, great presentation on the sizzling skillet with onions and mushrooms."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbVIzVTRkbFpCZGtOTVMxVjRWVFZGY1RCbGVGRRAB",
            "text": "There was no wait time for a table, the overall atmosphere is really good and the food is actually amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZlVWcERRV2h6ZEV4eFdWRkNjRmR6TURKNmFrRRAB",
            "text": "Food was amazing, pricing is very reasonable especially for the amazing quality you get."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNFRXeEpjRUpLYTNSdFltdEhPVkJsV2s0eWIyYxAB",
            "text": "The food and the services are both outstanding. The brownie is to kill for sooooo good it just melts must try"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZdFJUSjJXSGRWZWpWT1R6SktWVFZNWlhseFNrRRAB",
            "text": "Good food 😋😋😋😋😋😋😋😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205QlRXeERZbXhuTm01cFdEZEpUVFZSTUZOU2VsRRAB",
            "text": "This is my go-to spot! Their burgers are fantastic, and the steak is amazing — I highly recommend getting it with their peppercorn sauce. The Cajun stuffed chicken is also a winner!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNWVFcDBiM2hsUjFKWVZGWndWRmhmY0dGWGQzYxAB",
            "text": "The food was okay, didn’t seem like instructions were followed as the steak was hard and chewy and the pasta was more tomatoey and cheesy than listed on their menu. I got a drink other diners also got yet my glass was super small compared to others. Our server giomayra came over to our table 3 times in our entire time at the restaurant and while we were waiting for the bill, she never gave it to us. I went up to the front to pay and this other waitress looked miserable and said she can’t take my payment only giomayra. Where is giomayra with our check when we were waiting and wondering where it was? and adding a tip on the bill already seems weird enough when service is not up to par."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdWFsWnlWRVp0WWw5Zk1XMXBNazlHWDNOTlpGRRAB",
            "text": "I celebrated a birthday dinner today with my family, the food was delicious and the service even better, our waitress Giomayra gave a nice service. I recommend this restaurant and for sure I will come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrd01VRm9hMW94T0RjMFMydFJXbkZGUVdNelVWRRAB",
            "text": "The food was amazing. It was a such a hit among us. Will definitely come back💙"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCek0yeE1aME5tT0hKaE5VRnpYemxyTVVNeGNFRRAB",
            "text": "The food was 10/10, everything was perfect to the T. We got the steak, lemon chicken, fajitas. Everybody loved it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oaWNsazJaemhsUVhSMlNFeFpUbmhVVEVkSmQwRRAB",
            "text": "If you're in New York and thinking about trying Affy's Grill—don't. Save yourself the time, money, and a potential stomachache that feels like a personal vendetta from the chef.\n\nWe ordered the dusted chicken wings, which tasted less like food and more like a relic from a long-forgotten freezer. The meat was dry, suspiciously chewy, and carried the distinct flavor of chicken that's overstayed its welcome. Calling it \"dusted\" might refer to the actual dust it seemed to have collected.\n\nThe grilled chicken sizzle? Passable. That’s the nicest thing I can say. It arrived with the fanfare of something decent, but the taste was so unremarkable, I’ve already forgotten it. If mediocrity were an art form, this dish would be its masterpiece.\n\nAnd then came the true horror: the buffalo-style fried chicken sandwich. A crime against poultry. The breading was soggy, the flavor confused, and the chicken itself—rubbery and off-putting. About halfway through, I started feeling queasy. By the end, I was quivering in pain. It wasn’t just bad food—it was a physiological assault.\n\nAnd as if the food wasn’t bad enough, the bathrooms reeked like something had died in the pipes weeks ago. The smell alone could knock out a grown adult, and it made the already disappointing experience even worse.\n\nI wouldn’t return to Affy's if someone paid me. Actually, you'd have to pay my hospital bill first. This place isn’t a restaurant. It’s a warning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sS1psZHNUME5HVW5GNU1FSkdWMmxVTW01bGJIYxAB",
            "text": "Food was very good and staff were nice"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWVozWlNXR3Q0VGxaelRVUndVRmRpTUUxVFoxRRAB",
            "text": "I had a great experience at this steak restaurant. The steak was cooked perfectly and was tender, flavorful, and seasoned just right. The customer service was also excellent; the staff was attentive, friendly, and made sure everything went smoothly. Overall, it was a very enjoyable meal, and I would definitely come back again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcVkwVTRNR3B2VkVVeVEwWmtTV1UyWkZWa2VGRRAB",
            "text": "Big Foodie over here and can honestly say the experience here at Affys was amazing. From the outstanding flavors of the food to the ambiance, everything exceeded expectations. Service was great and quick and the workers are not just kind but efficient."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NdGNtMWliV2RXTmkxb1ZGWmhjMGxzVW0xSFJIYxAB",
            "text": "Excellent 5 star experience. No complaints!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTFYwazRZVUZxUWtzMWJERkpkWEZIVG5ScVdGRRAB",
            "text": "Went for early dinner on Friday. Was practically empty. The stakes were v well made so were the drinks, the baked potatoes and mashed potatoes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWGRqSklNVEYzVWtaM2VVcHFSeTFHVTI4NFVFRRAB",
            "text": "Dessert smacks"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMWNFOHhORE4zUTNWRmFqTlNhR2Q2T0ZSR1oyYxAB",
            "text": "Food was amazing and service was great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTk5UaEpNVU51Y201MGRXMWpkUzB4ZG1Sc2EzYxAB",
            "text": "This was the worst experience in my whole life ,nothing was good\nEven they r not able to take the order\nSo I waited  for than 1 hours for my food even my kids were crying for food\nSo I don’t really recommend this restaurant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkek9FSndNMk5LTVRkalVqWmpNV0l4YjFOSU4wRRAB",
            "text": "A top contender in halal American restaurants serving up classic fares such as burgers, steaks, pastas, and fajitas. Our first experience was marked by amazing food, great service, and a personal atmosphere. Perfect for date night and saw many families there too.\n\nWe ordered a strip steak which was cooked perfectly. Pasta was super flavorful. The sizzler was fresh and had quality ingredients. The burger had a distinct charred flavor. Everything from the service to the flavors means we will be coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWFltb3hOR3RNZDNGaVJVRTNPVXRETXpKYVoyYxAB",
            "text": "This place is phenomenal.Service is excellent the food and the ambience is amazing. Everytime we come here we always get outstanding service from everyone who works here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGalpDMU5WemxUU1hWWU9WVnVWR2xCY0V0clIxRRAB",
            "text": "I enjoyed the lemon chicken"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VU1rdGxWa3RIVTBFd2FXZzJUVEp4VnpOUmNGRRAB",
            "text": "I had an amazing experience, their willingness to accommodate to our big group was great. The food was tasty too and came relatively quick!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbVNEQjBlbWRHVmtWTVozRTVPQzB5WkdWTVgzYxAB",
            "text": "It's a very good and delicious food 100% halal also good service and the stuff are very nice and helpful  👌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWkxWOWZZVXR2ZEhSbGFFbzVWRmM1TlRWeWJIYxAB",
            "text": "Food was really good, the meals came out all at once, and catered to when my party had more guests arrive later on in the night! Our server Allison was very kind and continued to help us throughout our dinner!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxV1NrVklRekV3WkVneVdrMUhhMFI2UlVsa1MxRRAB",
            "text": "The service was very good especially the waitress Allison who was very patient and gave good recommendations. The food was very good especially for being halal american cuisine! Will come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rM1VYQjFOR3hDZVZrdE1sbE9ZVU13V0dRMlRFRRAB",
            "text": "Very good place and the stuff very helpful delicious food 🍲"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUU5uTXpWM0YwT1ZOWVVuVlNTMjlUZVhwSk1GRRAB",
            "text": "The food was fantastic and the presentation of the meals were great. The vibe was excellent with lively upbeat music and was an overall great experience. Will definitely be coming back, too try out the rest of the menu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRFNqSjJXbUpmVXkxSlVYUnZhbkoyTTBoclQzYxAB",
            "text": "Food was great and the service was amazing. Our server, Tatiana, was incredible. Definitely enjoyed lunch & dinner here, I’ll be coming back very soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQ2RGUlNaMFV5UlVWS09GRk5ZV0pvUW13d2RXYxAB",
            "text": "Had an amazing dining experience. I will rate the drinks 10 on 10. The perfectly cooked steak really made my meal satisfying; again a 10.on 10. Highly recommended."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNGF6RlliMFUxYWpGMlJVSmxjVUpuVmpobGVuYxAB",
            "text": "The food was amazing. I love the service."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twemQzRktRVVZ1VEVOQldEWXdlRU5VTjBOVVpHYxAB",
            "text": "Decent food, service is terrible. Everytime I’ve came here the servers act like they’re being forced to work their jobs. But I guess that’s how they can act if there’s an automatic 15% gratuity added to your bill so they don’t have to put any effort in."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqaWNuUU53EAE",
            "text": "This restraunt  is mazing.The food is sooooo good . We ordered steak"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNGFEWklXRmMyTFZGRVRuQkRTMlZvWlhCbWVFRRAB",
            "text": "Amazing service, had a great time as always."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaNlZIRjJURkp2VWpKRmRFMWxkRUp1UkRGUWMxRRAB",
            "text": "Food was great and the vibes too 😍"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNU1sSk9USFJFTFhNM0xVOVdSbE5hUjNsVVJtYxAB",
            "text": "To start, the food was amazing. I ordered the biggest steak there is and it was cooked to perfection. Also, the fries were crisp, the calamari was seasoned well, the vanilla milkshake was a good blend of vanilla and caramel, and the service was phenomenal. Giomayra was the best waitress I ever met at a restaurant. She provided phenomenal service and made my graduation dinner feel good. I love this restaurant but her service made me feel even better. Thanks Affys! I will be sure to come again! 👍👍 :) Oh, and one more thing: the manager, Omar, is super kind and gave me an amazing lava cake with ice cream on the house. 10/10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTlVURTJVbkZFTkRreGFFTkhlVVpmZG5OUlptYxAB",
            "text": "Surprise up and coming best keep secret try this place tell them Dave sent you and when your done eating post your opinion enjoy yourself"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psalN6bElVRlJ3ZFhjM09VZFVXWHBzVm1rdFJrRRAB",
            "text": "Great experience, staff was great and food was delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKV1pIZzRlbk5FWTJsemFFazFXRkprUVRJemJWRRAB",
            "text": "Steak was okay, nothing special. Their mashed potatoes and gravy was some of the best I've ever had. Overall decent experience but I probably wouldn't go back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaVkybENTVEp3YkZNeWFqSnVOMDlpY1MxWFpYYxAB",
            "text": "Great place! Food was well prepared, service was good. Will be returning."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKQ1RvTXVJLV8tOHJ3RRAB",
            "text": "The appetizers and drinks were horrible. I'm still amazed at how they were able to make stuffed jalapeños taste like nothing. The drinks were bland and full of ice. The only saving grace (kinda) were the entrèe. The music was way too loud edm music. The lighting were legit something like you might find in a club."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNX1hpT2pwbXE2RmhRRRAB",
            "text": "Went to this Affy’s location for the first time and had an amazing experience. The restaurant ambience was beautiful, Tatiana was our server, she was so friendly and actually paid attention as to how we wanted our food to be done.\nWe ordered three drinks and three entree’s, the nachos and brownies were complimentary. But every single item was just delicious. The steak was so juicy and soft. Lamb chop was cook to perfection. And the pasta was one of the best pasta I have ever had in my life.\nOverall, I think is a really good halal restaurant to visit with your family. I highly recommend this place!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOXzk1ZkdWbHEzVGpBRRAB",
            "text": "I had an amazing dinner at Affy’s Grill recently, and everything—from the food to the service—was top-notch. The steak was cooked to perfection, tender and flavorful, and the sides were just as impressive. But what really made the night stand out was our server, Tatiana. She was incredibly kind, attentive without being overbearing, and genuinely made us feel welcome. It’s rare to find someone so personable and professional!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJLWl0UFNWMmR2WWJBEAE",
            "text": "I came in with a family of 6 for some steak dinner. I ordered a medium rare steak with mushrooms and pepper corn sauce and sautéed vegetables. I think the chef heard “salt with a side of steak and veggies” because that’s literally what I got served. The amount of salt was so high that after I drank water to get the taste out of my mouth, I was left with a bitter aftertaste. It wasn’t just me though, it was my families order as well. My siblings and parents ordered a mix of steak and stuffed chicken. Every single piece of food no matter how big or small was full of salt. I had specifically asked the waitress to make sure the stuffed chicken would not be salty because that order was for my mom, who has high blood pressure. Her consuming foods with a high salt content can be near deadly. It sucks that my small request was so happily ignored and at the end of the night, as customers, we get charged gratuity and are expected to tip a portion of the bill. I told the manager about the situation and he took the steaks back and made the chefs prepare the food how it should’ve came out to begin with. After waiting an additional 20 mins we finally got our food. The food was fair, can’t say it was a let down but it also wasn’t a game changer either. It was just enough to not be hungry anymore. I’ll give my respect to the manager for making things right but this place is loosing its touch, wouldn’t be back anytime soon. “Sizzling mushrooms” is what the pic shows. You can literally see salt flakes on the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIME1YajBBRRAB",
            "text": "Went to check this spot out as my friends only eat Halal Meat ! This is a halal steak house , serving up a bit of everything. From wings , burgers , pasta to steak. There aren’t many halal steakhouses in NY , especially not in Queens. We walked in , we were greeted and seated right away. Our host/waitress was very nice. For once I was actually excited to eat , ambiance was beautiful and very modern.\n\nNow on to the food , we ordered 2 ordered of Buffalo wings and they were delicious as appetizers. Friends ordered burgers , some chicken dish and I ordered NY strip 7oz Steak (medium). Oh boy  my steak came out Well Done!! Loved the peppercorn sauce on it !! But I have always encountered this problem at Halal Steakhouse that they never get the temperature correct. Wasn’t too mad as it was only $26. Great presentation!\n\nService - 10/10\nFood - 6/10\nParking - Street\nGood for Large Groups"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOaVgySS14dUxiWW5nRRAB",
            "text": "We drove an hr and an half to come here. Our reservation was for 6:15pm. We didn’t get seated until 7. Our food didn’t arrive until 8:10pm. We didn’t order appetizers because we saw how slow everything was going and even then we had to wait this long for our food. Our food came in broken plates as well (see pictures). Our steak was cold and our kids food (chicken tenders) arrived 15mins after our steaks. No one came by to ask if we need anything else. We had to go to the counter to ask for our check and to pay over there to avoid any further delays to our plans."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcktQSDBnRRAB",
            "text": "I book table for two and arrive on time. This place not required have reservations but still I did so I don’t have to wait. We arrive early and seated right away. Menu was server right away and brought some cracker in few minutes. The crackers always good for while waiting for food to be served. I always have steak 🥩 with mushrooms and fries. This is my third time went this place. I wanted to try something new that day. I love some item form menu such as calamari, friend wing, Ribeye, steak, fries and some other item. I have tried burger but it was ok. I would recommend this item to anyone. Last night I tried Stuffed Cajuns Chicken which I didn’t enjoy at all. It was very bitter. I managed to finish 3 quarter, couldn’t finish. I ask for mix vegetables same it was so bitter I didn’t like at all. I love vegetables but this time couldn’t eat. Not sure what they pure lots off vinegar to it or what was otherwise. This place is suitable for family gatherings, friends or colleagues or couples. When I visited I might stick with my regular food item and enjoy probably. Or I would ask suggestions next time so I don’t wand up not enjoying the food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dEptaEl3EAE",
            "text": "I recently dined at Affy's Premium Grill and was thoroughly impressed with my experience. The fish fingers were crispy and flavorful, perfectly cooked. The shrimp pasta was creamy and delicious!\n\nTo top it all off, the strawberry daiquiri was spot on—refreshing and perfectly balanced, not too sweet or watery, making it an ideal complement to the meal.\n\nAffy's is a fantastic local halal restaurant that truly delivers on taste and quality. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiXzVpTWd3RRAB",
            "text": "My family and I recently dined at Affy's, and we had such a wonderful experience. They are known for their delicious halal foods and mocktail drinks.\nThe atmosphere was cozy and inviting, although a bit loud for me. Our server was very attentive and provided excellent recommendations. There wasn't a long wait time for our food even though the restaurant was packed. Our foods and drinks (non-alcoholic only) were outstanding and well presented, and we all agreed that they were delivered and flavorful. Everything was all worth the price!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXJHbUZBEAE",
            "text": "The food there was decent overall. I have to admit they had the best and the most juiciest steak ! loved every bit of it especially the peppercorn gravy. Would not recommend going there on Valentine’s Day lol the line was insanely long with walk ins and overbooked reservations."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMajVlV21RRRAB",
            "text": "Affy's has a very casual ambiance best known for serving various types of steaks and ribs. The food served today was cooked to perfection. The steak was done medium and was tender throughout. Definitely a must try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsbnIyaXZRRRAB",
            "text": "Stopped by tonight for dinner for a date night & we were over the moon impressed! The restaurant’s atmosphere is so chill, and the staff was excellent and friendly. Food was awesome, the fried calamari was 10/10 and the steak and sides were really good also! The drinks & dessert were also super tasty. The price point was really good for the amount of food we got also. I would definitely recommend this place to anyone who asks!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbDliR05REAE",
            "text": "Amazing food, good Ambience, good Location, great customer service we tried combo sizzler, rib-eye steak, chicken strips, mashed potato, brownies with ice cream, strawberry dessert, mojito & strawberry drinks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeUwtSnVnRRAB",
            "text": "I had a great experience at Affy's Grill. The service was prompt, and the waitress was very professional. The food portions were generous, and the steak was cooked to perfection – exactly how I like it! While we went during a busy time, the noise level was quite high, making it challenging to have a quiet, intimate dinner conversation without raising our voices over other groups. Additionally, parking was a bit of a hassle, which added to the challenges. Overall, though, the quality of the food and excellent service made it worth the visit. I’d recommend it, especially for those looking for a lively atmosphere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqa2E2UU5REAE",
            "text": "The food was delicious but a little bit too salty for me. The calamari was delicious. The pasta a little bit soft but tasty. The Steak was good. For Margarita if rim with salt its will make drinks tastier. Our server “Victoria” she’s really nice."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dWVQZ3B3RRAB",
            "text": "Good food try to avoid the gravy on the steak it’ll ruin it. Staff is friendly but the table service needs some work. Ambiance is really nice too and the wait isn’t too bad to get your food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYN0ktaHBRRRAB",
            "text": "I would definitely recommend!!\nWe came here and got the garlic bread and the calamari as appetizers and they were 10/10\nWe also got the rib eye and the BQQ ribs I would definitely recommend to come here and try these dishes.\nThere was amazing service our server Giomayra was very attentive and over all provided good service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3XzRxTEF3EAE",
            "text": "I loved the food and experience I had at Affy’s Grill. The food and the vibes at Affys are divine and the service is good. I recommend the steak with side of mashed potatoes or butter potato and the half rack of ribs are delicious. The chicken and the combination sizzler are amazing. The Pina Colada is spectacular the perfect Pina Colada I had and the presentation is amazing. I will definitely back at Affy’s Grill for the delicious steak and ribs with the sides."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5N0lYQUh3EAE",
            "text": "Nice place, nice atmosphere, went there around 9. Ordered onion cheeseburger, 7 oz ribeye steak, bbq ribs, shrimp pasta and calamari. The burger and pasta were okay, rest was mediocre at best. We had to send the steak back because it was well done where we ordered a medium rare. Calamari was too salted. I’d come back for the burger but rest I feel like is a hit or miss."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MmNLYXlRRRAB",
            "text": "Dinner on Sat night 7ish. Thankful to have a halal stake option in NYC! Parking wasn't too bad. Had to drive around a few blocks. Tell them to bring you the salad sides first before the main meal and have the burger first or after stake. If you don't mention anything about the sequence, they will bring everything together. Burger was good. Cake was night and light and not too sweet. Baked potatoes with sour cream was OK.  Filet mignon was OK. Ribeye steak was overdosed with the sauce. They should chill with that. Other than that prices are not bad. With some improvements the experience can be much better."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNWV6QUdREAE",
            "text": "Excellent food. Excellent service. My family loved the experience. Umer the manager was so sweet and gave us recommendations based on our taste and preferences! Their strawberry daiquiri is a must try!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObk5nWkMtMWYtRUZREAE",
            "text": "I had dinner here tonight with my mom, and it was truly a wonderful experience. From the moment we walked in, the atmosphere was welcoming and cozy. The food was absolutely excellent — every dish we tried was full of flavor, perfectly cooked, and beautifully presented. The staff were kind and attentive, and they made sure we felt taken care of throughout the evening. It was a special night made even better by such a great meal. We’ll definitely be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcDlLVHpBRRAB",
            "text": "Place was too dark, and loud.\nSteak ribeye was not tender, it was chewy and peppercorn spicy sauce was tasteless. 4/10. Paid $42\nStuffed Cajun chicken was 7/10 chicken grilled with rice kids portion was 8/10.\nSides 10/10.\nQuantity : Good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMjlPSjR3RRAB",
            "text": "Hands down worst dining experience I’ve ever had. Me and my party entered at 8:45pm. We were told 20-40 minutes would be our wait time yet we were seated at 10pm which was around the time another group was also sat despite them arriving 30 minutes after us. We were also sat in a dim corner with an employee entrance that smelled so bad we asked to move to the table next to us to avoid the odor. We ordered our appetizers and entrees together in order to save some time. We got our appetizers with no napkins and no water. The wings also seemed a little raw. We asked for water and received a dirty glass bottle with water that clearly had been sitting for a while, with no glasses to drink from. Furthermore, we got our table at 10 and did not receive our entrees till 11:15pm. The food itself was bland. The only highlights were the drinks and the fries. The servers themselves were also very kind and welcoming. However this does not change the 2 hours of shoddy dining experience from start to finish. I was quite disappointed as I have had great experiences at the Brooklyn location where the ambiance, the food, the service is leaps and bounds superior."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaWZpYjFRRRAB",
            "text": "From the atmosphere to the sizzling chicken in my fajita, Everything was amazing. Our waitress was attentive, efficient and wonderfully delightful. The mocktails were my favorite , I especially enjoyed the peach Bellini and the Lime Mojito. We ended the evening celebrating our cousins Birthday with their strawberry cheesecake,which was also delicious. The food, workers and atmosphere was top notch. Will definitely be going there again. Thank you for a wonderful night Affys."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aWN2M29nRRAB",
            "text": "The place inside looks nice, But the food really sucks :(\n\nWe were seated once entered with complimentary chips and salsa which were stale but edible along with dates….Those dates were amazing\n\nWe ordered the jalapeño poppers and fried calamari for our appetizers. The poppers didn’t have any seasoning to it and the calamari was fried in old oil… wasn’t too bad but definitely was not enjoyable…\n\nmy “steak sizzle” was overflowed with basmati rice with just a couple pieces of steak…It also seemed as if someone took a bag of frozen vegetables, boiled or steamed it and somehow threw it on the steak and called it a day. Our group didn’t finish our meal whereas we had to go someplace else afterwards to fill up our appetite.\n\n:("
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsc0pmc1lREAE",
            "text": "Very pleasant experience! I am a huge fan of the Affys Brooklyn location so I was concerned if the quality and experience would be the same. This new location is built beautifully on the inside, yet the food prices are the same. The quality of the food was the same great taste as well. I went for my go-tos with the steak quesadilla, garlic cheesy bread, steak, ribs, etc. One of our steaks came out cooked to a different temperature and preference than requested, and owner, Omar, apologized immediately for the error (he mentioned the new staff is still being trained so some minor issues are being worked out) and offered to replace the steak.  He was very kind, understanding, and caring and the staff was very kind and responsive. Great service, food, and ambiance. I highly encourage anyone who is on the fence to give Affys a try!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmam9LQzF3RRAB",
            "text": "The food was great! We ordered the ribeye with mash potatoes and Cesar salad. Everything came out exactly as requested. We would definitely recommend others trying since this won’t be the last time we are here.  Sofia was an excellent server and very polite!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdDl6d1NBEAE",
            "text": "I usually don’t write reviews, but the food was absolutely fantastic, and we had such a blast! The meats are so so fresh and we enjoyed so much! Especially the Lamb chops, they were so nice and crispy and well cooked! The service was also 10/10! I recommend coming here if you want to be satisfied with your food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMVphNHBRRRAB",
            "text": "Came here with the family to celebrate my nieces's graduation. We were able to make reservations and get seated right away. The food was great. The Hawaiian short ribs were tender and delicious. The moctails were yummy. Our server Tatiana was very attentive. Will definitely be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNObUlfZ25BRRAB",
            "text": "We had a pleasant experience last night at this new location of Affy's grill in Queens. It's awesome to have another quality halal steak house in the area. Amazing food with aesthetic interior. They have 2 sections for seating, hence plenty of seating. Parking was easy to find. Staff was friendly.\n\nWe ordered:\n\n1. BBQ half rib rack (our favorite from Brooklyn location) comes with sides\n2. Ribeye steak comes with sides\n3. Combo fajita (chicken and shrimps)\n4. Affy's class burger\n6. Pina colada\n7. Peach Bellini\n8. S T\n\nRib rack was flavorful and juicy. Baked potato was okay (came as side order). I needed a little more time I oven, though.\n\nRibeye steak was okay, juicy, flavorful, but still could be better.\nCombo Fajita was our favorite. It was really delicious. It comes with salad, tacos,  salsa, and sour cream.\n\nAffy's classic burger was a good pick, too. Decent sized patty, juicy, and flavorful.\n\nMocktails were fine.  Pinacolada was more on creamy side. Ice cream portion was a bit higher as compared to the pineapple and coconut portion. It was good but bit off to be a pinacolada. Peach bellini was good and had a distinct taste of Peach.  Didn't like the third drink we ordered (the last one on the menu forgot the exact name, something with S and T )much as it tasted diluted vimto. I would like to suggest the management work a bit more on mocktails to make the dining experience outstanding."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMZzVxRUhnEAE",
            "text": "We reserved for a group of 6 to celebrate a birthday dinner. Upon arrival, the ambiance is modern and lights are dim. We were seated right away and the Spanish waitress was excellent!!\n\nWe ordered multiple appetizers such as crispy calamari, fish and chips, wings, and nachos. Everything was perfect (my favorite was the wings). They also give sauces on the side. The nachos should have had the cheese melted on top and been presented better, as it did not look appetizing.\n\nEntrees we got were a variety and we also got different types of drinks from the menu. The steak was good, combination fajita (I got steak and chicken) with rice was a hit and everything on the menu had excellent flavor. I believe the chef is very skilled!\n\n2 issues we had was one of the steak orders had 90% fat, so we were given the option for a refund or a new steak. Another issue we had was one of the chicken + shrimp dishes; chicken was hard like deep fried and was not edible. The server quickly swapped the chicken for a new one and we were happy.\n\nDrinks: the pina colada was sweet and excellent! If you like more of savory drink, go for the lime or mango mocktails. If you like a strawberry drink, take the 1 strawberry drink they have - taste like jolly rancher.\n\nWe also had a surprise for the birthday girl and got chocolate lava, which was big and delicious!\n\nI would definitely come back to this establishment as they know how to serve their customers and their food items have huge portions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyazhHdmt3RRAB",
            "text": "Asalamualaykum, I have been a few times and I enjoyed having dinner here every time. I recommend this beautiful restaurant. Food, drinks, and services are great. Prices are very good as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxNVp6cDdBRRAB",
            "text": "We ordered creamy mushroom soup, loaded beef burger, and lemon herb chicken. All these dishes were delicious! Atmosphere and service were also excellent!\n\nGreat addition to Queens. Highly recommend this restaurant!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNV185LXJIeFpEOS13RRAB",
            "text": "Had an amazing experience at Affy’s Steakhouse in Maspeth, NY. From the moment I walked in, the service was top-notch. The food was absolutely delicious, perfectly cooked steaks, great sides, and everything came out fresh and flavorful.\n\nBut what really stood out was the hospitality. The manager, Omer, went above and beyond to provide excellent customer service. He was professional, kind, and truly cared about making sure everything was handled the right way. It’s rare to see that level of attentiveness and integrity these days.\n\nAffy’s isn’t just a great spot for a meal, it’s a place you can trust. Highly recommend and will definitely be back next time I’m in town."
        }
    ],
    "reviews_count": 84
}