{
    "name": "La Cocina De Mama",
    "place_id": "ChIJy53xIJpewokRWOgqyNNmHTc",
    "grid": "QN5",
    "address": "56-13 Metropolitan Ave, Ridgewood, NY 11385, USA",
    "rating": 4,
    "user_ratings_total": 233,
    "phone_number": "(718) 417-4000",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5V1QweFVlRk5yWm5sSldIQnBUVlF6YUROT1JrRRAB",
            "text": "Got catered food for my birthday and it was AMAZING. Everyone loved it ! The Pernil was sooooooo good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aVdHcGxSMEpwUWtRd1MzVjVZMVkzV0VkSVdsRRAB",
            "text": "The service and the food here were very good. They were able to accommodate me & my family as walk ins. We've mentioned it a few times since are visit and look forward to coming back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVVJEVjZVemREVkZkamNuSlpSMUZVWTA0NFFsRRAB",
            "text": "This was my first time trying La Cocina De Mama and let me say I will definitely be returning . They were quick , they had amazing customer service and the food was absolutely delicious. I had the stew beef and rice with gravy 😘🤏🏾 it was chef kiss 💋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xZlRrWk1TbkJoVDFwQ05VcGhVRVpFYTA1RlgyYxAB",
            "text": "Dominican"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcmJYZEhlbEIxWTNOeFduWnBMVEZ1YUdOaVQwRRAB",
            "text": "I grew up blowing my allowance here. Best food in the country, I've since moved to Louisiana and I brag about this place to everybody who will listen. I come here everytime im visiting family."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRFdUSlpRbmhaV0cwMVZFTnBiamREYUhSRGVVRRAB",
            "text": "El mejor de los restaurantes excelente servicio la amabilidad de la gente de aquí no tiene precio sus precios aun mejor lo recomiendo al 100"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wc05FaGxWRTlVU0Zock5ERlpialp5YWxjdFJsRRAB",
            "text": "Hangs down. This is one of the best Spanish food restaurants in the neighborhood. The place looks like a hole in the wall, but don't sleep on the rotisserie chicken with the tostones with the garlic source. It will have u thinking next time I'll get the whole chicken. The rice and beans complimented. Let's get back to the hole-in-the-wall part, this place has been here for more than twenty years. Don't let that fool you or stop you. Four places have popped up around this place. And they all suck. Sorry. Great atmosphere, but shitty food. This place fire."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNVHktLXVZckxyaW5BRRAB",
            "text": "The shrimp mofongo with salsa roja was sooooooo delicious. Perfectly salty and rich and warm and savory. Need. More. Asap."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHRTajlBRRAB",
            "text": "February 2025. Small place, spanish food, not a friendly staff, very expensive.  A small side of beans $7.00 I refused to pay for it and left. Please use caution."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQS0VfcDdkamVtalhnEAE",
            "text": "Best Dominican restaurant in Queens. Excellent service! Wonderful place to take large family groups! Super clean!!!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMTzE3OVhZNThYbkJnEAE",
            "text": "Pollo a la brasa so good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMN19ySUtEZzdid2tnRRAB",
            "text": "Not very nice people working here. I felt totally and utterly disrespected here. To think, that I could enjoy a nice dinner here and enjoy my meal. Never again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NzllNXN3RRAB",
            "text": "A Neighborhood staple! Love their food, they be down it down. Pastelitos are yummy! The mangu is soo good!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NzRmSjV3RRAB",
            "text": "The food is amazing here. Especially the breakfast specials. Staff is kind and friendly."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OTczU0Z3EAE",
            "text": "Good food!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmXzdEc01BEAE",
            "text": "Food very flavorful. friendly staff. Good customer service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaW9UZERREAE",
            "text": "I wish I would have read these reviews before ordering on uber eats. I ordered a soup “sopa de pollo” and all I received was soup with chicken on the bone that was more bone than chicken. ZERO vegetables. I know what’s supposed to be in a soup like this and this was more like “asopao”. The soup tasted like pure chicken fat. I am so upset at the audacity that they have to even send this. SMH"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYZ091bE9BEAE",
            "text": "Usually I just get the food from this place to take back home. Flavors are really nice in my opinion for the few things I've had from here. My only gripe is the prices are really high but its a nice treat every once in a while."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNE1ia25RRRAB",
            "text": "Ladies here are so sweet & kind. Big portions they serve 2 could definitely share. Delicious arroz morro & pernil"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3djlTVEpBEAE",
            "text": "Excellent Dominican Food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNXNmNkhnEAE",
            "text": "Excellent Dominican food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbDhxaHZBRRAB",
            "text": "Decent spot w good food, this over Chinese 💯 percent…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6c3UzRFlnEAE",
            "text": "Do not listen to any negative reviews. This place is an absolute gem. The food, the hospitality, the vibe everything is top notch. I will continue to support this business until I die or move out of NY. Must try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMklPWDVnRRAB",
            "text": "I stopped in here with my service dog and it was mid day and empty. I got rice and beans and pork and it was freaking delicious! I definitely wanna come back here with family and friends and eat some amazing food with no long wait times."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MnZQYUJ3EAE",
            "text": "This place went downhill, as did the quality and convenience. At least 90 min wait time and food is either cold or very greasy or missing something. REALLY used to love this place and it was my go to for 10 years but it’s not worth the inconsistency or the price - I asked for an avocado once to have with my meal, the lady told me $10 astonished at this price I ask, “why so expensive?” Which she replied “ I have to make money” they’re 4 for $5 at Price Choice/C-Town . SUPER POLLO on Woodward is the way to go if you’re looking for some very good Hispanic food at a great price in Ridgewood, never disappoints."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0cjZfTE93EAE",
            "text": "Ambiente swncillo buena atencion y riquisima la.comida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROcXRpQWVBEAE",
            "text": "Food delicious pernil omg really good, also chicharrón de pollo are really good the rice, beans and plantains are delicious as well definitely recommend it"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrdWVqX213RRAB",
            "text": "Great place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWNTRpUl9BRRAB",
            "text": "Delicious! Catered an event for me and it was as good 👌🏽"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1cXEzU1NBEAE",
            "text": "Ordené pernil, arroz y habichuela\nY masticando la comida me lleve la gran sorpresa"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURab0tfejN3RRAB",
            "text": "Muy deliciosa la comida y muy amable la señora q nos atendio"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMl9PaktnEAE",
            "text": "I order a sancocho. Meaning dominican soup. This people lied about it. It’s not dominican soup it’s just chicken soup. This is the worst place I’ve ever order. Plus it looks disgusting"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaalpfNEtnEAE",
            "text": "We usually order food from here. We usually love the seasoning especially their specialty  rice but we ordered from here on Monday and the rice was terrible. It was brown (the wrong color) and it was so salty. In eatible. The pernil was also waaayyy too salty. Terrible experience. My husband wanted to make sure we werent going to have to leave this place and find a new place so he ordered their rice again and it was back to the correct specialty rice. REMAIN CONSISTANT! No one wants to eat somewhere where your chef for the day doesnt taste their food and changes the taste of your core items on menu! What a waste of money."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMVlMMjFRRRAB",
            "text": "Went the with over 30 family members"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaOG92SDlBRRAB",
            "text": "Wish I can give the service 0 stars. The food is over priced and the servers lie. I asked for a steak with extra onions. The lady said they have onions up front and will add. When the food came out the lady then said I have to pay $3 for onions. Never again. Would not recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaeU9UV25RRRAB",
            "text": "We were a party of about 40 people after my dad's funeral and they were very pleasant with us all! Muchisimas gracias!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNnB6RmZ3EAE",
            "text": "Been buying here for the past 12 years. Prices have gotten higher but food is still delicious. The ladies behind the counters greet everyone with a smile"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKN3FfelZBEAE",
            "text": "Great people. Amazing food. Pricey..but u get what u pay for...rotisserie chicken - amazing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NzUyRHV3RRAB",
            "text": "Overall, it is very food spanish food. It's just very expensive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OWRINjJRRRAB",
            "text": "Rude!  Bad manners, you couldn't ask questions about the food or prices because they would answer back rude and with an attitude. The meat was dry and filled it up with a bunch of rice and only 4 pieces of meat. Didn't feel welcomed or any kind of love in the food ... hope you guys change and remember hospitality is very important in the busniess your in ...."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURob3FIN3hBRRAB",
            "text": "Good food every time ⏲️ and a very friendly place to dine in  🍽"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocF9Pc1NREAE",
            "text": "The food is greasy. It has a bunch of garlic and green peppers  which is all you can taste. Not a good place to buy food from"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxNW83MHRnRRAB",
            "text": "My go to lunch spot when I'm craving bomb Spanish food when I'm at work\n\nUpdate: still my favorite spot lol"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNUtmVGlRRRAB",
            "text": "I hardly ever complain about food.  But for some reason I tried this for the 2nd time and I'm completely dissatisfied. The staff is very rude. The prices fluctuate And the food was not at all enjoyable"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNzRubS13RRAB",
            "text": "Great place great food and fantastic staff"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlemF5Nk9REAE",
            "text": "I love this place. I have never had a bad meal here. The staff is always very friendly and they really have a great selection of dishes to choose from."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOGVxMHZnRRAB",
            "text": "Chicharron de pollo with the bone is SO GOOD. Well cooked and juicy. Beans are well seasoned and delicious. Love the rice. It reminds me of my abuela’s cooking. I usually don’t love Dominican take out (it’s usually not like the real thing…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldUp2RUVREAE",
            "text": "Beware! This place is a rip off! Came in for an early dinner with my family of 4.  We ordered 2 chicken fingers with rice and black beans. 1 order of fried fish with a side salad, and 1 steak (thin piece of meat) with onions and rice and beans on the side.  3 lemonades and 1 bottle of water and the bill came out to $91.00. The prices on the menu didn’t even come close to the total they charged me. I never got a hand written or itemized bill (shame on me)! When I questioned the owner, she proceded to tell me that the prices were changed! I was never told and there weren’t  any signs anywhere in site!  I paid the bill and walked out. Once I got to the car my son looked at their prices online and it was the same prices as in the restaurant menu that was given to us! I went back in and was told they charge more to eat in the restaurant!!!! This place was less than average no air conditioning and sticky tables! Not to mention the food was less than average. They just lost my business!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1bS1uZmVBEAE",
            "text": "Excellent and delicious food love this place"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1ejdUMWd3RRAB",
            "text": "Food is delicious, nice environment, good music and very clean!\nAll the food is fresh and excellent service!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyXzZ1cmVnEAE",
            "text": "The food was too expensive, it wasn’t good and the attention was rude. They wanted to charge me 8 dollars more in a small plate for a extra piece of meat. Even tough the attention was rude and I had some issues with the price the gave me…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVMUwySHJ3RRAB",
            "text": "Decor was nothing special.  I wished they would clean their tables a bit better, they felt sticky. The food, I felt was not good. The Monfongo was seasoned with too much garlic. The steak and chicken were passable. I do not understand how…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndS1mSk9BEAE",
            "text": "Authentic Dominican (Republic) cuisine. Everything is ready cooked. So you can see what you will eat and order, accordingly.\nThe ladies who run the restaurant are quite helpful if you are not sure about…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhM29lYVNnEAE",
            "text": "I REGRET ORDERING FROM THIS RESTAURANT! EXPERIENCE WAS AWFUL!!!\nI order two chicken mofongo and taste was not good. One of them had a taste of been over cooked. The second one, it had lots of pepper. I wouldn’t recommended, I had to throw out that food to the garbage. this restaurant instead of giving me a resolution, started making it seem like it was my fault. I would never, order from here. Overpriced food too. Plus phone service and staff are rude"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwaHFycldnEAE",
            "text": "The food was average. Their specialty drinks were nice and fresh. One thing I didn't like was that on their menu (online & in restaurant) they had prices that were different from when the bill came. Your price can vary substantially. Also it's  very hot in the resturant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNteGRMUFV3EAE",
            "text": "Basically cafeteria food with a spoonful of guacamole. It was so underwhelming and tasteless I needed to double check that my taco wasn’t in fact a used napkin. I’m extremely disappointed. The avocado fries tasted like baby food, mushy and…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvZ3FtMGtnRRAB",
            "text": "I am a local advocate... We live in a community that includes low income people.\nThis place has all the elements of a potential great place. My gripe is that they are expensive (very expensive). They charge for each bean or rice they serve, literally. Came here with my wife for dinner and got charged nearly 70 dollars. She ordered rice and stewed beef with apple drink and I ordered rice and fried chicken with a Pepsi... Trying to debate the price after indicating it from the menu did not work. They will point to other listed price. Itemize for them. Go eat and you be the judge."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvX29TR1d3EAE",
            "text": "They’re food is good but they hired this new receptionist that makes you feel funny about ordering it. she has a nasty attitude raising her voice &forcing me to order from grub hub. Because she doesn’t understand how to work the Debit/Credit Card machine she tells people they don’t except card. NEVER ordering from here again."
        },
        {
            "date": "수정일: 9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMmJEV1NBEAE",
            "text": "Great service and amazing food for a place where most people order out. The food was just amazing and very well presented. All I can say is Ya can't judge this book by its cover! Went for mothers day and the shrimp Mofongo did not disappoint in the slightest. The shrimp were fresh and the Mofongo itself just delicious."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnak4zWFp3EAE",
            "text": "Those’s  are my ladies when my wife not cooking that day. They are the best and the food is always delicious and fresh every time. They  are. good seasoned pork and perfectly done. Best in the neighborhood YEAH!!!! All love from the Lopez family"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3Mks3dURBEAE",
            "text": "I usually don't like to write reviews but every time I come here it's always another problem. They charged me $10 for oxtail, rice & beans when it's supposed to be $9, the rice was hard and the meat portions are lacking. The food isn't bad…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbWNTekRREAE",
            "text": "My order was to arrive at 5:25-5:35pm. Then i get an email stating it will now arrive 5:30-5:40pm. More than patient enough being hangry. At 5:53pm I called the restaurant. A lady tells me they’re waiting for the delivery guy. It’s 6:12pm…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnalktc1BREAE",
            "text": "Very warm, friendly staff, pick up menu to view options if you don't know what you're looking at in the buffet line-type array of prepared food when you walk in. Food made-to-order also available. Everything is delicious, flavorful, authentic Latin food, and you can't get better than that!!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVNlktd3VBRRAB",
            "text": "Monfongo had too much garlic and the worst I have ever eaten. Not very friendly staff. The menu listed $8 and up. I don't know why I was charged $10, maybe because it was a Thursday evening. I wasn't given a reason just had it pointed out on menu. I will never eat there again!"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcXAtYmp3RRAB",
            "text": "I was having a party on Saturday. At the last minute someone that offer to help cook canceled. I said I know it's last minute but let me give La Cocina De Mama a call. This was the 1st time I called the restaurant.  Lucy answered the phone. She asked how may I help you.  I place an order of 5 Rotisserie Chicken n a small tray of Potato salad. Lucy asked me for when I need the order I said for today. She said no problem by what time do you need it. I said by 3:00 p.m. Mind you I placed the order at 1:30 p.m. Lucy called me back at 2:40 p.m. to let me know the order was done. The food was awesome.  I Thank Lucy n the Chefs for making my day easier. Keep up the great work......☆☆☆☆☆"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwajhDRXJ3RRAB",
            "text": "So I have ordered many many times from this place and the food is pretty good. I have placed over a dozen orders via grubhub and in person. I placed a order at 9pm yesterday and I ordered my regular. Price is always the same but this night the lady quoted me an additional 10 bucks to which I was surprised but I figured she made a mistake once I pick up the food things would get fixed ( price ) she was hesitant on the phone when I ask her the prices. Like I talk to her all the time why today your being hesitant, do you want to pocket more money or was it a long day and you made a honest mistake. I didnt take it to offensive since she might of made a mistake and we all make mistakes.\n\nOnce I got there I asked what was the price, she then quoted me a different price from when we spoke on the phone....I was shocked. I then showed her my receipt from my previous online orders \"orders\". She then told me that's grubhub, is priced differently. I told her yes there prices are much higher due to the fact you pay for delivery etc. I also told her I ordered this same order the other day actually about 3 times that week due to the fact I worked too late and didn't have the time or energy to cook. She said the prices have always been the same. I felt robbed, how could you be so dishonest to a regular customer who has always tips well. Just for 10 bucks you lost a good customer and you earned the dishonesty award from me. 10 bucks isnt the problem is how dishonest you were and basically lied to my face a regular customer. So here is my tip. Look at the prices online and ask before you order because she will rob you and make her own prices on the spot. Who knows she probably put the extra cash in her pocket. ALSO SHE DIDNT GIVE ME A RECEIPT THIS TIME HMMMM🤔🤔"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dVlxU1VnEAE",
            "text": "First off, when calling for delivery the women on the phone are extremely rude. I have called twice on two different days, to see when the food would arrive. Both times it took over and hour and 15 min. I was spoken in a rude manor. The food also get here cold. Honestly how could someone be proud of a staff like this?"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnOHQzRFpnEAE",
            "text": "This place is an amazing gem of homemade flavors. The portions are incredible for the price and the flavors are hearty and have that homemade flavor. One of the best restaurants in Ridgewood.\n\nThe lunch special are always my go to. Pernil and rice are the best combo. Comes with an empanada. Add the tres leches and it's meal for a king! The ox tail stew are always tender and the ladies really pack them in! Mondogo (tripe stew) is another favorite! Tender, meaty, and hearty.\n\nThe best portions, the best flavor, and the prices are hard to beat! Don't miss this place!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBeDlfbjhRRRAB",
            "text": "I go frequently. The food is great wholesome Latin American homemade style food. The atmosphere is relaxed and friendly. Did I mention the food is delicious and will complete your day. Go and take a bite of the pernil, have some chicharrón, and eat some maduros and morro. Your stomach will thank you even if your waistline doesn't."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVc0lpeVF3EAE",
            "text": "As a person that tries to support local businesses, this is a restaurant that does not reciprocate that feeling. They charge you for absolutely everything and give you an extremely rude attitude. I try to be understanding for people that…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBa29QOFdnEAE",
            "text": "This place has some of the best roast chicken I have ever had.  They also have great  pork chops, roast pork, oxtail, arroz, mofongo etc.  I have been coming here for a while and it never disappoints. Great value, great food, great people."
        }
    ],
    "reviews_count": 71
}