{
    "name": "Hi-node",
    "place_id": "ChIJ67RBP6NdwokRwvAkVsAFfag",
    "grid": "QN5",
    "address": "68-38 Forest Ave, Ridgewood, NY 11385, USA",
    "rating": 5,
    "user_ratings_total": 33,
    "phone_number": "(929) 488-3538",
    "reviews": [
        {
            "date": "3시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214c1JFdDNZa1o2VVhoVllWQXRSV00wVmpGb01FRRAB",
            "text": "Super delicious and fresh Sushi bowls. I also had the Miso soup and can say it’s possibly one of the best I’ve had in my life! They do everything really amazing here and the service is so nice too!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGS1FsUmxkWHAyYkdzNFJsQnpMVWR1YTNWSk5tYxAB",
            "text": "They have the best or 2nd best pork katsu and chicken kara-age that I’ve ever tried. All the food including the fish have been fresh. Love the onigiri. The rice is cooked perfectly with a pristine balance in flavor and stickiness. Just wish they were as large as the onigiri I had from 7/11 in Asia."
        },
        {
            "date": "2주 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTVZIRjVXa1JMZG1RMFFUQmpSRUZtZVVWc1FrRRAB",
            "text": "202508\n很可愛好吃的小店！"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oc2QybEhlSEpNYW5oQlVYa3lWVWxzYjJVd1MzYxAB",
            "text": "Really excellent food, love the minimalist aesthetic, and the people who own the place are extremely sweet. Dined in and got some miso soup and the tuna salmon jr bowl, each dish had little unique flares that I really appreciated, the flavors were perfect and the fish was super fresh"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4a2RHNXJSSFZ5VlU5SFRFSTRUelprUlMxTmFVRRAB",
            "text": "I had the beef rice ball sandwich it was so good. Welcome to the neighborhood and good luck"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNFZuTkJaRWxEZFZZNFNqZFJibFZpZUdKM1IwRRAB",
            "text": "Bowl was fresh and delicious and the shop itself is very cute"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSGJsZzVWRUpxZVRCV1psZ3hTWGxmY1ZsS1lYYxAB",
            "text": "Really tasty, high quality food. We had the pork katsu and the grilled unagi bowl and both were delicious. Space is small but cozy and service was great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTWJ6RjJUelEzZFdzNFJqTkVNbFptVjFwU1UwRRAB",
            "text": "This place feels like a manifestation of what was needed in the neighborhood. Delicious fast Japanese food at a reasonable price. Thank you food gods!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRE1sQkxPRWxGZFZBd05qY3hhRE5wWVhwSVdsRRAB",
            "text": "This place is perfect. What was I even doing before Hi-node? Impossibly fresh food, friendly staff, good prices, reliably incredible. I want this every day."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxek5WTkdVa05QUmtoTlJFUlhlV3BYTVZvdFdrRRAB",
            "text": "Lovely welcoming friendly staff, mentaiko onigiri 🍙 is amazing, everything tastes fantastic, made with love & care 💗 highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWlpHSXdPVkZzV2xwVWFIaE5PVWcyZVZKUGJVRRAB",
            "text": "The perfect addition to the neighborhood!! We have really been missing a good Japanese spot with fresh fish near here. Good portions, quality, flavor, and pricing! And the chef and person taking orders were both lovely. Definitely will be a new weekly lunch spot (:\n\nWe came by end of day and got the salmon/tuna mini bowl, pork katsu sandwich, and karage to go - and it did not disappoint!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMldWOVFiVVZUYjJsNUxVRllOV1p1ZEU5S2MzYxAB",
            "text": "Cute new restaurant in Ridgewood selling variety of onigiri, hand rolls, and bowls. The karaage was my favorite. The katsu sandwich and the mini bowl were also a good size. A few tables inside and you'll get your food quick."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMFFUZHlYeTFIYVhBMFNtVmlWV0paYVRnNFVsRRAB",
            "text": "The bowls were fresh and delicious. The onigiri were excellent and not dry. We really needed a good Asian place in the neighborhood"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNWNsUk9hRmhHTUV4RFNVMXpUa3QyTm1rNFoyYxAB",
            "text": "Walked in during their soft open week. The woman behind the counter walked us through the menu and gave us matcha ice cream to try. SO GOOD! We got onigiri to try and iced tea. Very friendly, helpful and knowledgeable. Glad to have in the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNWMzTTBlSEZNVjJkbVNFRkZaelZXV1VabGVGRRAB",
            "text": "The Kara-age and Onigiri were so good! I look forward to trying the rest of their menu!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGM1dGRXlRbmxCT0VwbmJYRmxURlpPVkhaYWNsRRAB",
            "text": "Loved the chicken karaage! Super juicy and flavorful. Been wanting a Japanese place in the neighborhood and really excited about Hi-node."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Jd1VEWjNOVEZ5VlRnM2RtMDBiRWhQUVRsSFpGRRAB",
            "text": "Very excited to have a spot like this in Ridgewood. Fresh & delicious Japanese food served by kind people."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ad1FsQjZUV0U0VTJkaFpUZHlhbTlYUmsxd1JYYxAB",
            "text": "The Katsu Sando, Kare Age, Salmon Onigiri and Matcha Latte was to die for. I’ve lived in Japan for four years and I have to say this is the first Japanese place that brings the true flavors of Japan out. So so good. The staff was great and the chef has plans to bring more real Japanese food to the menu. So very excited!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVWNGcFRXV2htWkd4d1VURkVSM0JMY0c1b2VIYxAB",
            "text": "This is a true hidden gem in the Brooklyn/queens area. Some of the best soy sauce I’ve tasted outside of omakase joints that import straight from Japan. Not sure if they make it themselves or not, but the taste is shockingly authentic. The quality of the fish here is an incredible deal, and the ikura is perfectly prepared. Super friendly staff, and a simple shop that seems to be bringing an authentic experience from Japan to Ridgewood. An absolute must for the neighborhood."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cGFsVjRla1JYVUVRdFNtOW9NR3hmYW5CTFVHYxAB",
            "text": "Delicious! Very happy this is in ridgewood!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201ak9XcHVNaTFDTUhsM1VHTktTSEpmZFRGaVNXYxAB",
            "text": "Delicious!!!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMGJEa3pkVmhXV21WQ2EzVjRkVTR6VjB3NFlXYxAB",
            "text": "Very pleasant owners and staff, very delicious food - just what we needed in Ridgewood!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWWVVSm9RV2xyUzJsTVEyRTVTVjlUT0Y5dVYxRRAB",
            "text": "Exactly what Ridgewood needed! Super fresh onigiri and bowls, perfect flavors, and nice people working there. Will def come back❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxa1dtOXBkbUpXZVhOU2NrNUpVVk5mTm5Obk1XYxAB",
            "text": "Delicious food that’s convenient to take on the go and fantastic customer service. An absolute must-try in the neighborhood."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ST1pGQjFSR0V6UzNsYVVYSlBlakZmZGxWeGFWRRAB",
            "text": "Absolutely slammin' stuff!! Brings a long-missing element to the neighborhood... thoughtful preparation, carefully selected ingredients, beyond friendly vibes, and superb value for something that will make your face super psyched — get it!!! Shout out Chef Jiro and Atsuko!!!"
        }
    ],
    "reviews_count": 25
}