{
    "name": "Gottscheer Hall",
    "place_id": "ChIJQbogzJ1ewokRUJAowaUOLnM",
    "grid": "QN5",
    "address": "6-57 Fairview Ave, Ridgewood, NY 11385, USA",
    "rating": 4.6,
    "user_ratings_total": 360,
    "phone_number": "(718) 366-3030",
    "reviews": [
        {
            "date": "수정일: 21시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxak5sUkNhR1pQWlhSVGFGUkRhR05vWDBOYVZFRRAB",
            "text": "I voted here. One of the poll workers had 4 Halloween “I voted” stickers but I forgive her. It’s a cute place 🙂"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMWFFeE5Sa0ZvU0hsWVVHWjRWWGhaVGpaVE1GRRAB",
            "text": "Great atmosphere and food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSlRscHFOWFJyZEVGRVNsVkdWak5uU0MxbGQzYxAB",
            "text": "Old school beer hall with a back party room and nostalgic feeling. Very welcoming staff, a neighborhood institution."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MlNXWnFRME56YUZGMWRrNHhlVXhPVEVwRFJrRRAB",
            "text": "Fries done right and jumbo pretzel the size of your head"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSE1VbE9TemxpVGpOTVNsOTFjbkJuZEhveU5FRRAB",
            "text": "A cool little German beer hall serving authentic German beers and German food. Everything looked good, the beers were great (and reasonably priced). I’ll be back for Oktoberfest for sure!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOcUtrS2FNeWI3REF3EAE",
            "text": "A really fun time!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NGFlWnNnRRAB",
            "text": "Wurst Plate was good. Little old lady (I'm assuming she's the cook) brings it out on her cart. Beer is cold. It a good place to meet friends and bs for a couple of hours. Set your expectations low and you will be surprised. Wouldn't bring your gf or wife to impress her unless she just wants to just chill."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWb0k2NW9BRRAB",
            "text": "A really great local place for grabbing a drink with friends. Good pricing, good food, and a lot of evening events going on."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneXJYRkhBEAE",
            "text": "best vibes"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc09lbHdnRRAB",
            "text": "such a fun time and chill atmosphere!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmME9pVVpnEAE",
            "text": "Perfect spot for a relaxed night catching up with friends. Amazing pretzels, reasonable prices, and a great vibe!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdzZQSkRBEAE",
            "text": "This is not the best german food I've ever had..... And it doesn't need to be.  This is the food grandma makes, if grandma was a little old german lady.  Pretty sure that was grandma who brought out the food :) .  It was the most personable german food I've ever had, made with love and care.  Delicious in it's own right.  Nice german beers as well, which always helps."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueGZDakh3EAE",
            "text": "Love the food and the bartenders. Great spot to catch a Met game"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbFBPdXlBRRAB",
            "text": "Cozy place with friendly people"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3anRPdnh3RRAB",
            "text": ".Great Beer's good food good drink good times and good friends...Good to be BACK!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyZ2QzQ3FnRRAB",
            "text": "One of the nicest places you will find in the neighborhood. It's always a very relaxed atmosphere where you can sit down peacefully and enjoy some good old traditional German food and variety of great beers. One of my favorite places!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbDY2OVhnEAE",
            "text": "absolutely delicious bratwurst. friendly staff and cool history."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUMF9lb3BRRRAB",
            "text": "I attended a Birthday party there.\nFood was very good!!!\nit's old and used, *((if the walls could speak of the good times)).\nUnpretentious, down to earth, planning my own party there.\n\nLove the place!!!!???\nThe only draw back NO PARKING."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaTRiOHpRRRAB",
            "text": "An absolute gem of the neighborhood with eclectic ambience, delightful people, and great beers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5c2FlYjlRRRAB",
            "text": "Love this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NV9iWjlBRRAB",
            "text": "Casual, fun, and one of a kind spot to go with friends. Got beer but they have food as well, which looked great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNHRUa1ZREAE",
            "text": "Went here for the first time was greeted by Tony at the bar very friendly and professional.  Very comfy inside. The food is amazing from pretzel to burger to Goulash and spaetzle and apple strudle.  Must try you don't be disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOM09leXFRRRAB",
            "text": "Love this place especially the honky tonk! Food is awesome and the vibe is great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaTZtTjBnRRAB",
            "text": "Gottscheer Hall is a fixture of Ridgewood and has been for decades. It does an excellent job at bridging the gap between the old neighborhood and the infusion of the new crowd in a way in which everyone feels welcome. The food is excellent and reasonably priced and their selection of German beer pretty much guarantees something for everyone. The bartenders are also the best in the area, friendly, personable and great to chat with while sipping on a cold one. I've made many memories and friends in that place from all walks of life. I recommend it to everyone. Easy 5 stars. Check it out!"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdm9pX0xnEAE",
            "text": "Crème della crème."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbXF1SHRBRRAB",
            "text": "Great people great beer awesome bartenders.... Please don't get a damn burger there I ordered medium with Swiss and got Charcoal on a bun. Its not the first time. Is that how you treat people???"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsd0phTjZBRRAB",
            "text": "Ordered two beers and two pretzels. My party was splitting the tab with cash and card. Handed a $20 and my card to the bartender on a $28 dollar bill who motioned back to me and in returned I motioned him to put the whole $20 on the card. Got my credit card receipt back. Price was still the same. Asked him what happened. He tells me he thought I said the $20 was a tip. What? First of all, who tips before they have paid? Second, who leaves an 80% tip on a bill? Instead of apologizing for the misunderstanding, he blamed it on me, walked back to the tip jar and threw the $20 down in front me. Yup. Shady. Check your bills! Won't be returning. Also, the place smells like urine, and nothing inside looks or feels like a beer hall."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGcjhIYmNREAE",
            "text": "Like stepping back in time to an old VFW or working men's club. Quiet and mellow with a local blue collar crowd. A time capsule in the best of ways."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbDZMd3NnRRAB",
            "text": "Had a hamburger, seemed standard food. Nothing exceptional. Had 2 beers. No coffee available"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNFBQaThBRRAB",
            "text": "The music background in the bar was pleasant and not loud, which allowed us to chat quietly without any problems. In addition, evening entertainment such as live music or karaoke added variety to the atmosphere of the bar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwLVBha3BRRRAB",
            "text": "Good atmosphere good people"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbGNHb1pnEAE",
            "text": "Good and cheap German bar food, all of it tasty.  We've been coming here for around a decade, and that's only a small fraction of the time it's been open.  Old fashioned, relaxed sort of place, my family really loves it.  (And so does everyone we bring.). It's the sort of old school NYC place that's hard to find nowadays and is totally awesome."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbmVyTU5nEAE",
            "text": "Pretty sure Agent Cooper comes here for his coffee and a slice of pie!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdWJmWWVBEAE",
            "text": "Was here for a handmade market. Old school vibes, this place looks like and feels as if it was around since pre-hipster/gentrification era... because it was here back in the day. Very unique atmosphere, people who work here are really nice…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1N0tLWmxBRRAB",
            "text": "Reminds me of home. Loved our visit. Great beer, good food, and excellent service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1X3RpRlpREAE",
            "text": "Very cool collection of artifacts about this heritage of people\nFriendly bar staff and patrons"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbzd2a253RRAB",
            "text": "Lovely local place! My wife and I love coming in and enjoying a beer with some tasty bar food. The crowd is welcoming and you can tell this place has many regulars on most nights. The staff is incredibly friendly and food is great, big fan of the potato salad here!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBazQ3dXF3RRAB",
            "text": "Worth it for the jumbo pretzel alone. Very nice selection of german beers on tap, available in ponies, pints and pitchers. Reasonably priced. Super casual and relaxed atmosphere ideal for catching up with friends. The other bar food is pretty tasty,  too."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZOU5iOXN3RRAB",
            "text": "Great atmosphere! Marcel great bartender with amazing personality and knows how to take care of his customers. Old school type of bar with great people, make good friends and hear interesting stories. Also there food is on point."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXLTZxV0hnEAE",
            "text": "Historic Ridgewood facility serving Gottscheer/ German & American fare, beer & wine. Event space in an elegant large room w Chandeliers. My classic 70s rock band also plays there occasionally. Great neighborhood hangout too w cool jukebox!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURneFB1RFlREAE",
            "text": "Good solid German food. Bratwurst, krainerwurst, spaetzle, and potato salad. The crowning glory of this place is their amazing sauerkraut. They also serve a nice selection of beer and even a couple of ciders. Some weekends they have a local market of arts and crafts in the back venue/space. They also offer that space for rent for events."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBd3JUSUJnEAE",
            "text": "Came here for a sweet 16 at their hall. We frequented the bar throughout the evening. Bartender was horrible. Ignored our group trying to buy drinks and gave so much attitude to us when we yelled over to us. Even left the bar abruptly and had another worker take our order. Welp there went her tip."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXa2FqVTJBRRAB",
            "text": "Found this place on Google Maps for lunch after checking out some shops in the area. What a find! Great german bar. If you're looking for the Hofbrauhaus experience, go to Radegast and fight the crowds. If you want a small town german pub,…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRLV9lTDVnRRAB",
            "text": "This place is a jewel. If you want true German/Czech food and culture this is the place to go. This is a Mom and Pop type place so if you are looking for something fancy you should go back to Manhattan. Places like this are disappearing by…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMUttZkFREAE",
            "text": "LOVE this place. it was our first time here and we felt like family. everything we ate was delicious and the service - even when they had to move us - was warm and inviting"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCMTczMjN3RRAB",
            "text": "I had a very unpleasant experience at this establishment due to the rude behavior of the waiters. Instead of saying \"excuse me,\" they actually physically moved me out of my chair in an aggressive manner. This happened a while ago, but the…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZZ2YtTF9nRRAB",
            "text": "a ridgewood staple and my fave neighborhood bar-staurant. always at least a few friendly faces in here.\ngreat bratwurst, decent selection of on-top german beers; prime homemade german…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHaXU2U2ZREAE",
            "text": "This is one of my favorite spots in Queens. I love the food and everything about it. Great prices and I love the neighborhood feel to it. The perfect place to catch the Sunday football games!!!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3eFBYQ3Z3RRAB",
            "text": "OMG Go for the food. Ambiance is like the dining hall of a community center but the food is as though you are at your German friends house and his mom asks you to stay for dinner. Prices are awesome."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMU1UbVl3EAE",
            "text": "What kind of waiters they had man? They were asking all the people I invited for an ID in order to drink.? They didn't gave out the cake!! &' there was alot of left overs!! 😤😤😤. Also a lady that was getting rude. Security guy wasn't letting people go in after 11 & wasnt asking for invitations &' just letting people go in.…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHcDZXOHRBRRAB",
            "text": "As a nostalgic lower east sider, I love how Gottscheer Hall mixes up the old ethnic with the new neighborhood like the old Ukrainian National Home did on 2nd Ave, artists and poets and homeboys and the remnants of old locals all mixing it…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvNnJTbHBRRRAB",
            "text": "Love the food, beers, juke box, and the atmosphere for the price I pay, how can I go wrong. The people that show up at Gottscheer Hall are so down to earth. Not like in Manhattan. The people actually have conversations with you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbmJTeU9BEAE",
            "text": "Such good food and such friendly atmosphere, make sure you get served by Daniel! Such a cultural institution and I had such a blast. Can’t say enough about how friendly the staff is!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NThlRGhRRRAB",
            "text": "Awesome beautiful German Bar and Restaurant with 500 Customer Dance room. The food is so delicious and\nPlentiful German made authentic price\nSo reasonable."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJdlBxR3ZRRRAB",
            "text": "Came here with my darling for some afterwork beer and pretzels. I could tell from the moment we walked in that this would become a favorite spot. They have an excellent selection of German beers plus all the German culinary classics. Framed…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCd1k2d29nRRAB",
            "text": "A great place for a good time. Amazing bartenders and atmosphere. Would definitely get drunk there again."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aXBpTEl3EAE",
            "text": "Awesome place great food and awesome German beers. I go there all the time for the people and all the bartenders. I recommend this place to anyone"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJeWRfTXF3RRAB",
            "text": "Have not had the opportunity to taste any of the food there yet. Have been there about 3 times already and we were too early for dinner or the did not have what we wanted. Extremely loud there so loud u could not here yourself think let alone talk. So we have walked in but walked back out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbzZ2cXNBRRAB",
            "text": "Great food! The pierogies, saurkraut and 3 cheese spatzel were incredible.  I will definitely try the rest of the menu soon."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndXZxUjdnRRAB",
            "text": "I went to Gottscheer Hall for the first time last Saturday night.  It was a really great time!  It has the feel of a German VFW Hall.  They've got a couple beers on tap, we had the only German sounding one on tap (can't remember the name) it was $5 for a large mug.  Good deal.  They also had some hot toddies (It's crazy cold in NY right now) and something called Gluh-wein for $3 a glass.  Gluh-wein ended up being this delicious spiked hot apple cider, awesome. My group ordered food, chicken strips, potato pancakes with applesauce, bratwurst with sauerkraut, all delicious.  Around 10 pm, a woman came around with this bucket of tiny pieces of papers rolled up (think diplomas for mice).  You could purchase 5 for $1, and if you unrolled them and found a number, you won a prize!  I won a bottle of champagne!\n\nIt was unexpectedly a great night at a low-key German bar in Queens."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvX3ByLUN3EAE",
            "text": "Great place to have a venue. It has a good size stage and a lot of floor space. Also it has a separate bar for those wanting a drink and food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNDVlcnNnRRAB",
            "text": "Stopped here randomly with my dad the other day. Absolutely was awesome. From bartenders to drinks to atmosphere, we were overly satisfied. Went back the next day. Lol"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNWFqWERnEAE",
            "text": "Reserve una fecha aquí no me dieron la información correcta y me querían cobrar $8 por persona por las bebidas y en ningún momento me dijeron eso y no me quisieron devolver el depósito  la señora me grito y fue muy poco amable… no les recomiendo este lugar muy mal servicio"
        }
    ],
    "reviews_count": 63
}