{
    "name": "Casa Melania",
    "place_id": "ChIJd9UfUoBfwokRHtoYww0yIx8",
    "grid": "QN5",
    "address": "55-61 58th St, Maspeth, NY 11378, USA",
    "rating": 4.9,
    "user_ratings_total": 48,
    "phone_number": "(347) 738-4237",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSamRFSk9VbEJhV2t4Vk1uTk9kMWxLTlRkb1YyYxAB",
            "text": "Drinks and food are amazing! Fresh and well served!\n\nCholulo! Try it you will not regret it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWlZVSlpjMGxpTVZjeVIyNVVkMFZRYTJGamJXYxAB",
            "text": "Clean and spacious. Great lighting. Great decor. I had seco de gallina. Delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcGJYZFZXRWRFTlRORFdtRlVMVE5JT1RCSFZsRRAB",
            "text": "I googled this place and the pictures and prices is what brought me in. It's literally a hole in the wall. The service and food is why I give them 5 stars. He accommodated me on goat stew and a shrimp ceviche with yellow rice and a avocados. We had mojito and parchaa juice for our drinks and cafe flan for dessert. 😍 it was the right amount of sweet and flavor. 🤌🏻 I do recommend this place. And wish them an abundance of blessings and success."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbVptODBaV0pHUjB0WFFXczNiV1JVTkVOTVJGRRAB",
            "text": "This place is a little bit out of the way and depending when you go parking might be a problem.But the food is wonderfully prepared.And presented and tastes just like mom made or grandma made back home in ecuador I would recommend it highly"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWc1duVlRNV1F6U0VsMk1tNVhPVlJJYkV0d1RuYxAB",
            "text": "Comida riquísima y una excelente atención 👌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdGMyaEpVMkY0VTBoTlNXczNSQzB0YzBOclRHYxAB",
            "text": "This place is awesome, Ecuadorian and Hispanic food, good prices, good customer service, Néstor Is polite and professional, I strongly recommend this place, you won’t regret"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTmVsQmljbXByTUd4R2F6RjBUWFY0V0hWZlpGRRAB",
            "text": "The food was delicious!!! My boyfriend is Ecuadorian and he said the food tasted like his mother cooked it. I had a delicious fillet of fish. I wasn’t even hungry and I inhaled the whole thing. Everything was delicious we can’t wait to go back."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMmVUTXhTbGxhV1ZwbVMwOTNNa2RIT0hCT2RsRRAB",
            "text": "La mejor comida ecuadoriana en maspeth"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLVEZzS2JRamZQRldREAE",
            "text": "Amazing food I will be back..."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOejlwNWpqbVA2d1BBEAE",
            "text": "We went there for Mother’s Day, we got there a little earlier and was seated quickly. Service was a little slow but it was Mother’s Day after all. We ordered a pitcher of Sangria for the table great deal. We shared the Salchipapas for the table. For entrees I ordered the shrimp ceviche and my husband ordered the fried fish with yucca, my husband is a Chef worked at Michelin restaurants in nyc  and raved how fresh the fish was, he approved. Ceviche was delicious. We finished our meals with the dessert special and higos de Figos. If you’re looking for a great Ecuadorian restaurant this is the hidden gem you didn’t know you needed. Thank you for making our experience amazing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdlp5ZWVREAE",
            "text": "Casa Melania is located in an industrial area of Maspeth, Queens. It really is a hole in the wall, a hidden gem of Ecuadorian Cuisine. Although I did not hear any Ecuadorian music playing, the food that was served to our party of 2 adults, 2 teenagers, one child and one toddler needing a high chair, was surprisingly and exceedingly delicious. I had been to the Ecuadorian staple of El Tropical before, but this was a different experience. The food was fresh and the seasoning was just right. The server brought the food out in about 10-15 minutes. It was a Sunday afternoon that was not very busy. I was able to find street parking easily. The decor had some images of Ecuador and some memorabilia as well posted on walls. The food was very presentable. My only drawback was the 20% extra charge for the large party. I would definitely recommend and return to this location."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvb2F6M2V3EAE",
            "text": "I truly found an Ecuadorian restaurant that serves authentic Ecuadorian cuisine\nThe customer service was amazing\nAnd the sangria was delicious\nI shall return soon!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcTUtbG9nRRAB",
            "text": "Awesome Food and service and the Sangria was 😋"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOU1MVV93RRAB",
            "text": "Excelente lugar de comida ecuatoriana. Fui con mi esposo y desde que llegamos la atención muy buena, pedimos para empezar corviche y un bolon mixto. De plato fuerte fritada y ceviche de camarón, las porciones, la frescura y el buen sabor me dejaron con mucha alegría porque en mi opinión me ha costado encontrar un lugar de comida ecuatoriana con ese sabor de casa, el ceviche sabía igual que en Ecuador, definitivamente volveré. El servicio tambien muy gentil."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNEtEVUV3EAE",
            "text": "HIDDEN GEM MASPETH QUEENS\nAs an avid Ecuadorian food enthusiast who's sampled many restaurants, I can confidently say this one stands out as among the best. We celebrated my father's birthday on a Friday, and while I expected a bustling atmosphere, it was surprisingly relaxed. My brother-in-law made a reservation for nine, and we were welcomed with warm attentiveness.\n\nThe interior decor is stunning, featuring magnificent artwork and a full bar, perfect for post-work drinks. The exterior, however, is a bit misleading; it's difficult to tell if the restaurant is open or closed from the street. We've driven past it numerous times on our way to my parents' house from New Jersey and were initially hesitant to try it. Thankfully, my sister's research into the reviews proved insightful, and we were truly impressed.\n\nThe food was absolutely delicious, and the portions were incredibly generous. The Llapingachos (small potato patties with cheese) were an instant hit – so flavorful! The Encebollado (fish soup) was exquisite, and I even took half home to enjoy later. My husband's steak was juicy and full of flavor, and all the other dishes were equally spectacular. I highly recommend this restaurant and can't wait to return and try the traditional Ecuadorian hot drink,  Canelazo again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3X1BIbW1BRRAB",
            "text": "This is def a fav ! Their bolon mixto is 🤌🏼🤌🏼🤌🏼 along side their ceviche, seco de chivo is def a vibe."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NEp2SnVBRRAB",
            "text": "The food was very tasty and authentic to Ecuadorian food. The restaurant is spacious and the waiters were friendly and attentive.I really enjoyed their bolon. The rice and beans and steak were good as well. I liked their sanchipapas as well. I would definitely  go back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNFBXY1d3EAE",
            "text": "amazing food! my favorite is the lentil soup that is sometimes the soup of the day with the lunch special its such a great value! amazing service as well! the staff is very attentive and so friendly."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbk1mWElREAE",
            "text": "Delicious authentic Ecuadorian food, amazing service, great portions, welcoming and clean atmosphere!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReEppemdRRRAB",
            "text": "Great food!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXJTVDN3RRAB",
            "text": "Delicious food, cozy vibe, great cocktails and service was friendly. Recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMy1TMldREAE",
            "text": "Good service"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBejhHc2pBRRAB",
            "text": "Very good food"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbWViUXdBRRAB",
            "text": "If you’re looking for a cozy spot with delicious Ecuadorian food, this place is a gem. They’re attentive and happy to answer any questions about the menu. Each plate is truly packed with bold, authentic flavors. A must try!\nOne of the many plates I’ve had."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOXEyQmh3RRAB",
            "text": "This place has the best Ecuadorian food in the area. I first tried its sister restaurant in Sunnyside and have been happy this opened near me in the last year. I have dined here multiple times and am always impressed with the service, ambience, and quality of food. The food is authentic (my Ecuadorian suegra and my two year old agree) and is a must visit for a night out and special occasions. My go-tos are the guatita, fritada con mote, cazuela de mariscos, and sango de camarones. Sorry for not including photos, I always just dig in when the food arrives!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NU9LS3Z3RRAB",
            "text": "Muy Rica comida y muy buena atencion"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaGRlOW5RRRAB",
            "text": "Great food. Awesome menu. Loved the Salmon I got."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIb1o3RFJREAE",
            "text": "As a non Ecuadorian dating an Ecuadorian woman, I can admit that this place is one of the best to go for Ecuadorian food. The food is amazing, the service has always been good to us every single time we’ve gone, and I personally love that I usually don’t have problem getting parking nearby.\nThey are very attentive and ask if there’s anything you need as well as asking you how’s the food, but they’re not hovering over you making you feel awkward. I’ll continue to keep going back and try some of the new menu items, very excited to see this family grow their business to more locations!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3aUoyR1V3EAE",
            "text": "Best Ecuadorian food in the area, seco de chivo? Flawless.\nOne of my favorite places for food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicDh5NG9BRRAB",
            "text": "Been here around 5 times in the past few months - the servers are always attentive and the food is always good! Just like their Sunnyside sister restaurant. Recommend the Bandeja Melania.\n\nIt’s located in an otherwise industrial area, but this is the best classic Hispanic cuisine for miles IMO."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeEtMS1FREAE",
            "text": "Amazing food!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNWIzSF9BRRAB",
            "text": "They took very long with my order almost comming up to about 3 hours and i ask them for something they say they will bring it to you but you have to wait like 30 minutes or probably they forgot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOHRXc2pRRRAB",
            "text": "OMG this ecuadorian food is amazing🤤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbllfQkhREAE",
            "text": "The food delicious. The lady serving was very nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUczRUNFhnEAE",
            "text": "this newly opened Ecuadorian restaurant is amazing. as an Ecuadorian, the food tastes exactly like as if you’re in Ecuador. food is served freshly made. service here is so polite and nice. decor definitely gives Cuenca vibes (an area in Ecuador) and the restaurant space is very big. has a bar as well. also, there is loud latino music here which awakens everyones mood! overall, everything about this Ecuadorian restaurant is amazing and i hope they keep going with their business 🇪🇨🇪🇨❤️"
        }
    ],
    "reviews_count": 35
}