{
    "name": "Hellbender",
    "place_id": "ChIJG4RMPa1dwokRBET-URZXZJU",
    "grid": "QN5",
    "address": "68-22 Forest Ave, Queens, NY 11385, USA",
    "rating": 4.3,
    "user_ratings_total": 354,
    "phone_number": null,
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUlZXZ3dkM2RMTFVSelZsSlRabnBCZW5WUlFtYxAB",
            "text": "I had a great time! Lots of creative dishes and good, punchy flavors.\n\nWishing the best to the team."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWVlqTnRhR1J1U0dKUldUWlNiWFl0Um1FMGMxRRAB",
            "text": "We sat by the bar, where our bartender recommended an amazing seafood appetizer special for the night; it blew our minds. We also ate the broccolini and steak and were amazed at the flavors of the dishes. The drinks and dessert, also recommended by our bartender, topped off the night. Treat yourself to an amazing meal with friends or family where you’ll be in for a memorable experience."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JNFdXcDZhemhoZUVkV2R6SmlSalJxVVZCNlNXYxAB",
            "text": "Outstanding service and amazing food.\n\nWe ordered the cheese, pancakes, chilaquiles and steak. Everything was prepared well and seasoned nicely. Though our pancakes did take a bit longer than expected.\n\nWould visit again just for the pancakes alone!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNWJVOTFTRTlEY1doeGJ5MTFaVkZSU2tNemIzYxAB",
            "text": "Bad food, bad service. Hostess looked me and my partner up and down the moment we walked in, and behaved coldly. Maybe we didn't match the usual clientele.\n\nWe ordered drinks which took so long to come out our food arrived first, despite being cans instead of cocktails.\n\nFood came out fast, but it was not worth the price. The chilaquiles had no flavor whatsoever and the tortilla chips were stale. Spice with no taste. My partner's tostada was also stale.\n\nNever coming back here again unless they seriously reconsider how they prepare their dishes."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSk1EVlhTVVo2TW10UlYzcEROMHhNZFU5d2MwRRAB",
            "text": "Fantastic food in a lively environment!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeGFGWnpRV1JsZEhwTVpVNUNTa3hCUlVWSVgwRRAB",
            "text": "To start off I wanted to love this place. My wife and I love trying Mexican restaurants. Very friendly staff and service was great. Now for the food thats another story. We ordered the fried oaxacan cheese and it was a little greasy but good. We also ordered the pork tacos I have to say the pork itself was bland but what they top the tacos with was delicious. For mains I ordered the chilaquiles which was not good. It was cold and had no flavor like it needed salt or something. My wife ordered the enfrijoladas and again was just bland missing those wonderful Mexican flavors. Overall it was a big disappointment food wise. Something me and my wife were excited about."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcGJqQkNWRmxpYkhGRlpXbDBTMDV4VWxrMFgxRRAB",
            "text": "I came in to town to visit my daughter and she took me here for Happy Hour and let me tell you…Hellbender did not disappoint!\n\nThe atmosphere was warm, staff was friendly (especially our waitress Julia), great music, but even better food and drinks! We had the fried shrimp tacos, the mushroom tacos, and pineapple margaritas.\n\nMy palate was pleasantly pleased! If you’re in the area, stop by…you won’t regret it! I’ll be sure to visit the next time I’m in town."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVFNUUkhWVzE1YmpSeVlWVmxWVzA0Y3pFNFMwRRAB",
            "text": "Came here for brunch on a Sunday, had a reservation. Sat at the bar for a drink before we went to our table. Drinks were really good we had a few each, service was great. We ordered a few different things, the bloody Maria mignonette with the oysters was tasty and a little spicy. The pork tacos were incredible and of course we got the masa pancakes which were delicious but so filling. The jello of the day was a Concord grape jello with peanut butter drizzle and a homemade whipped cream which was really really good. Would love to come back here. And the bathrooms are huge!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeVdVNTVjVlJsTVY4eWFuUlNPUzFPTm1OcWNYYxAB",
            "text": "great time, great food, great service. recommend the cakes and the tostada!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocWRHdEpiRWxMWDJ0SWMxcDJWekJ2U2kxamRFRRAB",
            "text": "Didn't really care about most of the dishes, but the pancake alone is worth a visit."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSlExTmhha3R0VW5NNGNuVTVXSFV4UjNkd1owRRAB",
            "text": "Amazing food and even better drinks! The staff made us feel so welcome , thank you for the great service and atmosphere"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UWIwWjJWSGRHZFVWeVVHWjRNamx4VkZadVRIYxAB",
            "text": "Having been a long-time patron of Rolos I was excited to try Hellbender. Friends had also spoken highly of it. The food was satisfactory but I was surprised by how poor the service was. We were seated and waited nearly ten minutes with nobody checking in on us (not even water on the table) - we resorted to flagging someone down to express that we had been sitting there for quite some time with no service. This was 8pm on a Saturday as well. When we finally were acknowledged there was no apology for the delay or warmth from the server. I expected this establishment to have a standard of hospitality. The vibe and energy of the staff felt super off putting and impacted our feelings towards the experience. I’ll give them the benefit of the doubt that perhaps they were short staffed or having management issues however I will not be returning."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aclNFUm1hRlZ6VWpkSWFtUnBPVmszUWxkbE0xRRAB",
            "text": "Easily five stars, maybe even six 👀🤌 seriously delicious food. Like seriously, this is game changing.\n\nMy friend and I started with Chamoy Pear dish, which was absolutely mouth-watering and zesty. Then we got the Baby Gem salad, which was an interesting New Age twist on a Caesar. THEN, omg, we got the lamb shoulder with some tortillas on the side. DAMN! That went crazy…. And the sauce… omfg.  Soo fricking good. No notes, just so delicious.\n\nService was excellent & we sat outside. Would have loved to have gone inside or tried dessert. There were so many other dishes on the menu that seemed really interesting as well, and unique flavor combos. Apparently there’s a real stuffed cheetah in there (allegedly). Can’t wait to go again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NFVIcHNSRWxUWTFweFpXVjFZMlIzTkVWUVlsRRAB",
            "text": "Went for brunch and got the masa pancakes. Do wish the pancakes themselves had some more flavor. Pancakes needed the syrup for sure. Might go back for regular dinner menu to try something different"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SVVsWnpWWE5XT1c5bU1IaE5kbXRmYW5OSVVHYxAB",
            "text": "Very good quality food and the staff very polite and nice."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUlVEWnlZVFIwZURaak5qWTVUblYwVkRSc1ZVRRAB",
            "text": "This place closes at 3, we got here at 2:30 and they closed the kitchen at 3 which is fine and we understood.  They allowed us to order more drinks and a pitcher around 345 out on the patio, and then around 4 acted like it was an emergency that we leave despite refusing to remove any of the food plates from our table?  We all had less than a few sips of our drink left and we asked if we could just finish what we had left, and she gave us a literal 5 minute timer to finish at 4:10. It made no sense and was super weird, especially given that she wouldn’t clear empty food plates and the staff is now eating family dinner and smoking 2 tables away, so I can’t imagine why us staying for 10 minutes to finish our drink was such a big deal.  Why wouldn’t she clear the first round of plates if this was such an emergency? Whatever waitress took over at the end was extremely rude and we definitely won’t be coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNWVGcFNZVFJITW5CeFIwbEtkakJyU2tGclYxRRAB",
            "text": "Yes it's expensive.\n\nIs it worth it? That's up to you. Portions are indeed small. But boy are they executed well and full of flavor! So as an occasional treat to one self, it's fine. Get the steak, fried cheese and churros, they absolutely slap.\n\nWish they'd do a burger like their sister restaurant Rolo's."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMWNsUlZOMk5tVWxWWlRXTm1aREE1VFhKRFpYYxAB",
            "text": "Oh my God, what can I say about this place??? too many things.. from the Agua Chile to the tacos to the lamb shank to the mole I am speechless. ALSO THOSE DAMN PANCAKES ::: JEEEEEEEEZ. Food heaven! This place has an epic menu with epic flavors. It’s a great space. I love it for our neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUmJGTm1XRlIzYUhkUExWWk1NbUZVWHpsQllXYxAB",
            "text": "It's very very high quality food. The oaxacan cheese and the churros are ridiculously good, as well as the cocktails / mocktails. Unfortunately its expensive. But even more unfortunately still worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdmJXOWZSRGd3ZGpWWGVrcExOR0Z4YjI5MWJGRRAB",
            "text": "First off, the churros are INCREDIBLE and I can’t say this enough. The whipped cream is salted a tad, which perfectly balances out the peach compote and sweetness of the churros. I love a salted whipped cream and have never found a restaurant to do it. 10/10. we got a seafood platter special app which was truly fantastic. The steak was also great especially with the charred peppers, we got tortillas on the side which was perfect. Mushroom tacos are a must and so is the fried Oaxaca cheese !!!! Really great experience and super friendly staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSGJIQlJhVkk1YXpGbU1FdEJOWE5CTkdGMFEyYxAB",
            "text": "same owners as radio bakery. went for brunch and got the egg tostada. i would love to go back and try the pancake. the egg tostada was good but needed a bit more flavor/salt - a bit oily. it was good but not incredible. the grapefruit juice was incredible if you’re into that. cute decor inside too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SFpHdExMVlEzUm1KeGJWUkxTazlOVlVGS1dHYxAB",
            "text": "The food has no flavor. Worst Mexican food I ever had."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRGRtVjVOMWt0TW5NNWF6aFdlbEI0ZGxkQk1VRRAB",
            "text": "Fantastic food from start to finish!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNFdUWm9kRlJRUjNwMVpraHVTV1p3V1c0MFozYxAB",
            "text": "Food was good. A bit pricey. Excellent wait-staff. Acoustics was very bad, no muffling, on the walls, for sound - every conversation was loud and overwhelming to the ears."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM2RHOUpNM1V6UVZscGVXaDZVRWxVYUVSU1YyYxAB",
            "text": "Every dish was a true delight. I had the smashed cucumber salad (a true flavor delight) the fried oaxaca cheese (the tomatillo salsa was amazing but I feel there are things I would have are things I would have reserved stomach space for), the heirloom tomato tostada was surprisingly delightful! I also ordered the shrimp tacos that had the exact perfect amount of fry on the shrimp. The corn sauce on the black bass was a piece of heaven on earth but much smaller of a portion than expected. We ended the meal with the arroz con leche a perfect ending if you ask me!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RM2JIb3lUMlpMYkhjMFMyOUpWelpDUlVjNFVXYxAB",
            "text": "Everyone, Hellbender is the place to be and it's a whole vibe. My bestie and I decided to make reservations for brunch on a beautiful Sunday and we were not disappointed at all. Upon entering we were greated by Maddie the hostess she is adorable and very welcoming I felt right at home honestly. We started with the fried Oaxacan cheese followed by the soft scrambled egg Tostada,  I don't even like eggs but this was so delicious with the black beans. We both ordered the heirloom masa pancakes these were to die for and I think we both did..we will definitely be back for dinner Raphael and Lilly were the best waitstaff ever."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMVIydDZlWGhGUVZSTFpFcHhlVk42YkZOeFFYYxAB",
            "text": "Very small portions.  Everything was tasty but quite overpriced"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WVlrVkVaMGd3YUhKVU9EWjBiV2d6VjJ0VU0zYxAB",
            "text": "The best brunch ever! Food was amazing. Order a lot of different dishes, favorites were egg tostada and cucumber salad, def the pancakes, and don’t skip the cake."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTloyOVZPVTFJUld0clVXMHdWMFYwU21keU5VRRAB",
            "text": "Wowow. First of all, the pancake absolutely lives up to the hype! So crispy and fluffy. Have been for both dinner and brunch, you really can’t go wrong. The space is lovely in the daytime and sexy cool at night. Absolutely love the scrambled egg tostada, all taco options (but especially the carnitas), and whatever the seasonal salad is at the time. Excelllent food and vibe! Will be back many more times. Oh yea and the fried  Oaxacan cheese is everything."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbFpqTlhiVFZhVWxKTVZGZHplRlpIWjFwWE1tYxAB",
            "text": "Incredible, inventive, seasonal flavors and great service. My Mexican husband is very choosy about Mexican cuisine in nyc and he loves it here as much as I do. I can never decide what to order because everything on the menu sounds so good but fortunately the small plate format makes it so you can share a bunch of different dishes with friends. My only suggestion is to add the churros to the brunch menu, they are too good to miss!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWeGFuZGZNMmxOUlRaNWNtSnFPRGt5VlRrd2FIYxAB",
            "text": "If you’re coming here for the food, prepare to be blown away, if you can survive the service long enough. I would chalk it up to our bartender, but I overheard additional things from the staff throughout the night which leads me to believe there is a real air of toxicity at this establishment.\n\nThe dishes are fantastic: vibrant flavors (from the pork tacos to the spicy shishito peppers - and I love spice!) to cocktails mixed by someone who cares more about the quality of her drinks than her approach to service.\n\nAs someone who is a local resident, NYC native and who has worked in the service industry for 10+ years, I would never aggressively say to a customer (even when I preferred to take away plates in a certain way) “yeah, don’t do that, I don’t stack the dishes that way.”\n\nAt the beginning of the meal (when she was dismissive and passive aggressive), I shrugged it off as it must be a tough night. I won’t even bother revisiting her other service failures here, as the plates at the end of the night were simply the cherry on top.\n\nI regret giving Hellbender another try: this restaurant had the potential that could draw loyal and local regulars, but the service and vibes were so negative it made me question ever returning. Amazing food can’t mask being treated like an inconvenience for attempting to be courteous. I go out of my way to be kind and give great tips, even if someone is having an off day. But if you blatantly disrespect that, be prepared to be read head to toe.\n\nIf you’re willing to trade respect and basic hospitality for a good meal, check out Hellbender. Otherwise, find somewhere that values both. There are many, many other restaurants very close by that cover both!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRE9YUnVUa0pOTW1SaGFXRXljVVE1TlRFdFQwRRAB",
            "text": "tacos were extremely salty and everything super overpriced. not worth it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMU5uUkhXRXhNUmtwcVlVWjZhR0ZCYlhacmNXYxAB",
            "text": "Our bill felt twice the amount it should have been given the tastiness of the food and quality of service.\n\nWe came in to dine several months ago and we had left satisfied. However, every single time we've returned (tried again 3 times now), the quality has been worse and worse. This time, the food was haphazardly made with no concern with how it was spiced. Our tacos were so absurdly salty, I could not tell you what kind of meat it was - INEDIBLE, painful. The apps were mid and service (she was clearly exhausted and grumpy) could have been more attentive for the price point of the restaurant. Shameful :(\n\nDo not waste your time and money here! I'd advise you to take your hard earned dollars to an establishment that wants you there and would better honor Mexican cuisine."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTFpWUlJjMmxMVjFBMlEwbzBTSHBoTmxGak1rRRAB",
            "text": "we got summer melon aguachile, guac and chips, fried shrimps tacos, steak, green rice, and their special dessert of the day tres leches. the tres leches and aguachile were fireeeeee. everything else… they would be hard to mess up because they’re common foods you see in mexican restaurants. atmosphere was great feels like an elevated restaurant vibe. songs were fireeee."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTFJHOU5VV0pGWVU1QllYRnpWbGt6YkZOWGRYYxAB",
            "text": "I've been to hellbender probably 3-5 times over the past 6 months by myself or with one other person.\n\nI've slowly realized that the restaurant is overpriced and underwhelming, and I don't imagine myself returning. Despite how I feel about the restaurant, it remains quite busy and hard to get into (probably due to good publicity from their sibling restaurant also in Ridgewood)\n\nTo my understanding, they've actually lowered the prices sometime between opening and today, but in my opinion prices are still 25% too high for the neighborhood considering the quality of the food and general positioning of the restaurant.\n\nThe food is good, but not amazing. Guacamole was good but not $14 good. The shrimp cocktail (pictured) was actually pretty good. Tacos are good but very expensive and literally tiny. I got the steak once and it was gristly and covered in burnt grease. $6 beans and $4 tortillas are nearly insulting.\n\nI remember the cocktails being good but nothing memorable.\n\nThere was at one point a good deal for taco + drink happy hour, but I'm not seeing it anymore."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVM05YQnhabkp5YzI5Q09GWXhOMGxFY0dGeGNtYxAB",
            "text": "Amazing!! Go there!!\n\nThe service was sooo good. The hostess was so nice and friendly. Staff kept checking on us all night and giving us etas on the food which was appreciated but unnecessary because everything came out faster than expected. Waitress was very helpful and gave great feedback on choices.\n\nFood was out of this world. We order so much so we could share and there was not a single thing that missed. My friend had to covertly unbutton her pants lol. Everything was soooo flavorful and well balanced and thoughtful. Im not a huge fan of tacos but I ate these right up. Comes with 2 which are about 2 bites each. You really have to finish them there because they didnt look like they would hold up well going home.\n\nSteak basically melted in my mouth. Ive never had such a well made steak. The waitress suggested medium rare but I asked for medium and it was perfect. I struggled to finish it but again new that it wouldnt reheat well at home. My friend got the lamb shoulder and that was also delicious , has a nice kick and that was even better the next day reheated.\n\nThe watermelon....I could eat 100 pieces of it. I had to tell myself not to lick the plate.\n\nThe churros with blueberry compote.... oh man! I had no idea that blueberries had so much game. Absolutely delicious, not overly sweet, paired so well with the churros and the cream. I was so sad when I reached the bottom of the bowl....churros, I miss you everyday.\n\nOnly complaint is had out of the whole experience was that it was a bit noisy...it got better as people left for the night. This is also a me thing so I won't judge the restaurant for this lol but I hate bathrooms with black toilets.\n\nAnd just an FYI for anyone with a shellfish allergy, they informed me that they use the same fryer for everything so the lamb shoulder is a caution since it uses the same fryer as the shrimp."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WR2FEQnJSWE5oVXpjMmExSnljVFUyVUU1c1IyYxAB",
            "text": "Probably one of the worst dining experiences I’ve had in a while. First the a/c doesn’t work and it’s about 95 degrees in the place. All the servers are drenched in sweat, very unfortunate that they have to work like that. The food was all under seasoned. No actual flavor. The pancakes were overcooked on the outside and raw on the inside. Our drinks took about 30 mins and the place was nearly empty on a Sunday afternoon. We ordered the steak mid rare and it was more well done than the pancakes. There were people working there but done bother to ask if everything is ok. They just drop things on the table and disappear. The table next to us got their drinks only after they were nearly done with their meal. Overall, skip this place. So many better options in the neighborhood."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVFNWTm9NRFpRVjNSUU9ESTNPVXAzUW5FdGJuYxAB",
            "text": "Easily one of the best brunch spot and dinner is simple but yet so punchy. And the furnitures. Are cute"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWlVXOWtSWGhUUlVKalZqUjFNM3BLUzJReGFsRRAB",
            "text": "Got in for brunch today, was not disappointed. Top notch service all around and delicious food. Shared three plates:\n\nA cold peach/tomato salad, favorite dish. Perfect dressing.\n\nChilaquiles were not traditional but delicious in their own way. Right amount of spice too.\n\nPancakes as good as advertised (did not need the slab of butter IMO). I see why everyone orders them.\n\nThree minor points: super loud, pretty warm inside and not cheap lol."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVlFtMXpRWEpxYTE4Mk55MUxUMmN4VEZSdVlrRRAB",
            "text": "Came here a few times already. It's pretty much a gourmet style Mexican restaurant and a youthful trendy one at that. But don't let that put you off since the food and service here is top notch.\n\nThe menu might feel somewhat limited but everything on it is freshly made and excellently prepared. Also their alcoholic mixed drinks are very good and tasty as well.\n\nIf you are just looking for drinks I suggest trying to get in close to opening as their happy hour is good for margaritas of a few different varieties (original, pineapple, and even watermelon).\n\nNote that this restaurant owned by the same people who own Rolo's (another excellent restaurant) which is a few blocks away. I tend to come you're more and enjoy it a bit more overall than Rolo's too, since it's less crowded and the food is just as good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3ek9VUTJYMmxPVnpSak5taE1NbEphVlVkeVYyYxAB",
            "text": "Good experience. Another very solid add to Ridgewood. Get the lamb. Incredible."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMmFqTlhTVEl0VEhkT2ExSk9SVGx5VVRGc2JsRRAB",
            "text": "Hellbender just served me the best pancakes I’ve had in NYC—hands down. The heirloom masa pancakes here aren’t just good, they’re game-changers: perfect texture, flavors that complement each other beautifully, and nothing overpowering. Every bite felt balanced and memorable, to the point where Clinton St. is officially dethroned as my previous pancake champion. I’m already counting the days until we come back.\n\nWe also shared the skirt steak and the coffee tres leches cake—both phenomenal. The steak was cooked perfectly, paired with flavorful potatoes and a rich butter topping, and the tres leches was indulgent without being too sweet. Between the three dishes, my wife and I left full and completely satisfied.\n\nThe staff here deserves a special mention. They were knowledgeable, professional, and had excellent communication with the kitchen, even advising on what to avoid for dietary restrictions. That level of attentiveness made the experience even better.\n\nHellbender delivers on flavor, balance, and hospitality—absolutely worth a spot at the top of your NYC dining list."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFM1l6TXlURXRRVWw4dFdrTTRTMHRxTVY5NmRtYxAB",
            "text": "brunch is insane"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMWRHTXpjbFYyYjBKNk5HcDJWbmgwTjJOdFlYYxAB",
            "text": "For such a hyped up NYC restaurant, I left feeling genuinely disappointed.\n\nStarting with the positive: the pancake was fantastic. Honestly even better than Golden Diner’s. Unfortunately, that’s where the praise ends. As a group of six we ordered quite a bit but everything else we tried fell flat.\n\nThe biggest letdown was the service. Our waitress seemed annoyed from the moment we sat down as if every request was an inconvenience. We were told the pancakes would take a while (which was fine) and asked whether we should order individually or share family style. She suggested ordering individually, so we put all our food and drinks in at the same time. Oddly, our appetizers and the pancake came out first, along with only one of the three identical taco orders. Drinks took about 30 minutes to arrive well after entrees had started hitting the table in an erratic, scattered cadence.\n\nThe worst moment came when one person’s steak arrived 25 minutes after everyone else had been served, without any prior warning that it would take longer. I’ve eaten at plenty of restaurants, and I can’t understand how the kitchen doesn’t have a system to pace dishes so the whole table can enjoy their meal together.\n\nAside from the pancake nothing justifies the hype around this place. I won’t be recommending it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVM2NXUnVkVFpsYTI5T05EazRSbHB4TjJsamJtYxAB",
            "text": "One of my favorite restaurants. Not a vegan in any kind of way, but I cannot have enough of the mushroom tacos. Soooo delicious. The churros are good too"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNFlqTndWbTh3YVhJNWVIWXpRV05IVUU4elNWRRAB",
            "text": "Incredible mixture of dished with amazing ingredients & the dessert especially those churros were phenomenal! This is a hyped gentrified spot I highly recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCb04wVlZibXRST0VocWJUTXRkbEZWZVVWdWNFRRAB",
            "text": "Some restaurants leave a lasting impression with their food and service. Hellbender is definitely one for me. Fried oaxacan cheese and crushed cucumbers set the bar high and the dishes that followed got better and even better. Pork carnitas tacos, chilaquiles very satisfying but the highlight of this brunch was soft scrambled egg tostada and heirloom masa pancake.\nThe tostadas with the chilli oil and sesame had a Chinese dish vibe, so flavourful!\nThe pancakes with a generous slice of butter…something very special, unique taste for a pancake. First bite tasted almost like gulab jamun, an Indian dessert.\nService was excellent! Hope to visit soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eFYwY3pWRFZYTTNWUVYyUnRSeTFrYjJ4WVJrRRAB",
            "text": "Every bite was full of flavor and freshness."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjNE5VTkNUREJaVVRJd1R5MDRjVU5GTFdKSk5HYxAB",
            "text": "Mid"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ZmNVbEhSazkzVDNVMmFFeFhiMjgxTW1GdVNtYxAB",
            "text": "I’m a big fan of Rollo’s so it’s no surprise that Hellbender is just as impressive. I would return to enjoy all of the dishes I had and there were several we didn’t get to try. The smashed cucumbers, fish tacos and crispy lamb were outstanding. I look forward to retuning and trying the rest of the menu!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKRzN0WTNFMTdtR2VREAE",
            "text": "Really enjoyed our dinner at Hellbender, every dish and cocktail was fantastic!\n\nWe started with the Fried Oaxaca Cheese - the texture of the coating was delicious as was the green tomatillo dipping sauces\nThen got the spicy shrimp tacos for an app - very flavorful but not too spicy - the fried shrimp was also amazing with the tarter sauce\nFor mains, we got the spicy pork ribs and the skirt steak with a side of rice and beans\nThe pork ribs here are quite spicy but very tender but the steak was a standout\nWe opted for the Jello for dessert - I loved the texture and the fruit was very fresh, don’t pass this up\n\nAnd for the drinks - the margaritas are perfect. The classic and don’t pass on the Rhubarb\n\nThe draw back was there waiting time between the apps and the mains - we maybe waited 20 / 30 mins"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMU1XTmFkekJYVlZKNWRqUndhVE42TFVORFYyYxAB",
            "text": "Hellbender is a standout spot with fantastic food and a great vibe. We tried the fried cheese, aguachile, mushroom tacos, and pork ribs al pastor—every dish was memorable, and I only wish we had room to explore more of the menu. As someone who loves meat and takes tacos seriously, I was especially blown away by the mushroom tacos—absolutely a must-try. Can’t wait to come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkblR6TlVjV05HWTBZMWRWbE1SRzVNUWs1S2JIYxAB",
            "text": "Came for brunch, and it was fantastic! We had the fried Oaxacan cheese and masa pancakes for the table (we should normalize pancakes for the table) and both were great. The green sauce for the cheese was something we could have had by the bowlful.\n\nThe tapas sized plates we ordered were also strong - the shrimp tacos (with some of that green sauce) may have been one of the best bites I've had this year. My friends raved about the tostada and the thick cut bacon as well.  The coconut shakerato was delicious, but way more ice than drink so know this in advance, but I would still order it again.\n\nFor the most part, service was casual and friendly. Our server was fine - not overly warm, but the rest of the staff were really lovely."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYkpxYW5iM052ZDVnRRAB",
            "text": "A little on the pricy side but wow, the food was phenomenal. I’d say this is a more small plates, family style experience. Ambience was great, really like the sage green walls and the decor in the place. I was also surprised at how peaceful / serene this part of Ridgewood was.\n\nThe oaxaca sticks, oh my goodness, were oof , really freaking savory. Mozzarella sticks but with oaxaca cheese The lamb tacos were okay, thought they were overpriced for what you get ($16 for two). Loved the pork ribs: very tender and the spicy pineapple medley was mhm.\n\nThe highlight of the meal were the matcha churros. Straight up, Dessert. Of. The. Year. The amount of times I said “woah this is really quite scrumptious wumptious” as I was eating it were too many to count. It was the perfect consistency, crispy on the outside, moderately soft on the inside, and the slightly sweet and sour cream pairing elevated it from a 10 to an 11."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLeVVuYm01aU9HRW5RRRAB",
            "text": "Don’t listen to the bad reviews! The service was great, the vibe is awesome, and the food is really good. It’s not “authentic” Mexican because they’re doing a creative take on Mexican food and it’s delicious. Our faves were the Oaxacan cheese, Mushroom tacos, and the skirt steak!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbmJ5TFh3EAE",
            "text": "Quick (not rushed) service, delicious food, chill atmosphere!\nThe fried Oaxaca cheese was scrumptious, the lamb taco was so good (didn’t even realize I was eating lamb- nice and crispy, and not gamey at all), scrambled egg tostada delish-  seemed like Chinese dish inspired due to the chili-oil, and the masa pancakes 😋 - top notch. The pancakes were super moist, hot, with a good amount of butter and maple syrup, just the perfect dish to end our brunch!\nThe portions are on the smaller side.\nBut super happy with our first-time experience. Will definitely come back ;)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sd01XdFNZalJTU2pCUFRGVjZjazU2ZFhwSFNYYxAB",
            "text": "Delicious meal, great service, cool ambiance; perfect for a date night or group of friends since plates are shareable.  The summer melon aguachile was so refreshing, the baby gem with caesar with nicely dressed, loved the roasted mushroom tacos (the flavors came together so nicely), and the al pastor ribs were fall off the bone tender with some heat."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eVIzUndjRXBxVVhCUWFuWjBRVGhSUlVSdFFVRRAB",
            "text": "From start to finish my friend and I had an amazing experience. The cocktails were perfect. Food was fresh, consistent, and delicious. We had the cheese sticks, oysters, cucumber salad, chilaquiles, egg tostada, and the corn masa pancakes of course."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQ1EzcFNRbmxuYUdZdFkzRkNOWHBHVm5NMFJsRRAB",
            "text": "I’m a pancake lover so wherever I see a special pancake I have to go try it. Guys!!! This pancake was delicious and different had a nice corn taste YUM! The steak with onions and potatoes DELICIOUS! I had the guava Bellini which was amazing and I forgot to take a pic 😅 the place is pretty pack all day so it is important to reserve a table. My friend ordered the coffee tres leche and OMG! That was the highlight of everything!!! must try!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvazVEYnV3RRAB",
            "text": "We recently visited Hellbender in Ridgewood on a Wednesday afternoon for a special fundraising event in collaboration with Oido, a nonprofit from Yucatán.\n\nThe atmosphere was warm and inviting, with a laid-back, wood-heavy interior featuring blush-colored booths, globe lighting, and a mix of high tops and dining tables. A notable feature is the taxidermied jaguar displayed inside a glass case near the back of the room, adding a unique touch to the decor.\n\nWe started with cocktails and beers; the drinks were solid, though our server could have been more audible, as it was sometimes hard to hear her.\n\nThe food was a highlight. The aguachile was refreshing, and the Oaxacan fried cheese was deliciously stringy, perfectly complemented by a tangy salsa verde. The charred asparagus stood out with its smoky flavor, and the tostada, topped with a cheese-stuffed pepper, offered a delightful contrast of textures and flavors.\n\nWe also enjoyed the shrimp tacos, which were flavorful, though slightly salty for our taste. The Arctic char was a standout dish—cooked to perfection and enhanced by citrus slices, served alongside refried beans and rice. The grilled pork chops were tender and well-seasoned, presented atop refried beans and garnished with microgreens and a sprinkle of Maldon sea salt.\n\nFor dessert, the matcha churros were a favorite, beautifully presented with a dusting of green matcha sugar and accompanied by whipped cream. The strawberry jello was good but not our favorite dish of the night.\n\nOverall, we spent about $65 per person before tip, which we found EXTREMELY reasonable given the quality of the food and the experience.\n\nWhile some reviews have compared the restaurant’s prices to those of a food truck or other restaurants, it’s important to consider the sourcing of ingredients, labor, and other operational costs. We think Hellbender is AMAZING!\n\nIn summary, our dining experience was great!  Cozy ambiance, attentive service, and flavorful dishes.\n\nWe would rate it 4.7 out of 5 and look forward to returning.\n\nPS . The music selection for the night was incredible!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNU2R6UExRaE1DOFlREAE",
            "text": "Had the rhubarb margarita (super fresh tasting), the aguachile with radish and orange the oaxacan cheese and pork ribs. Everything was really good and the service was quick. We sat outside but inside was really fun, they played great music. Server was really nice and attentive. Had a great dinner, would go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOc2RTMUtUak5zTjBGUVFqUm1iWGQ1T1RKcmVXYxAB",
            "text": "Hip spot in Ridgewood with reggaeton classics bumping at the right volume. Black Seabass was cooked perfectly and the mole was a dream. Shrimp & mushroom taco’s were good. The aguachile was refreshing yet fish portion a little small & you have to try the fired cheese. Service was exceptional though and made our visit special! big thanks to Alexis & our other sever. Will be back for more great margaritas and bites. Dinning room was warm (I sweat easily)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQSEVoUFRVOWZfOVh3EAE",
            "text": "Really friendly host, easy wait time, only about 15 minutes on a busy Sunday. The food was incredible, really stunning presentation, vivid colors, fresh flavorful ingredients and the flavors were multidimensional. Everything sat somewhere between coveted comfort food flavors and fine dining! I’ll be back, I’m still thinking about the soft scrambled egg tostada with the smoky salsa macha and the pancakes. I’m a fan!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cHVqa2NREAE",
            "text": "What an awesome find! The food was incredible, creative and fresh, and the vibe was comfy and cozy and the perfect place for a family-style meal to catch up with friends. The cocktails were unique and very drinkable, and the staff was happy to accommodate any questions requests we had. Portion sizes were amazing, perfect for sharing and everyone left the table full and happy. Can't wait to go back and see what the menu has, lots of seasonal changes and creative dishes to try."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdXY5OGVlMnF5Y1NBEAE",
            "text": "Pro tip: We showed up around 5p for dinner and had no problem getting a seat even though Resy said otherwise.\n\nThe food was great! The standout snacks for me were the house made chips and guac, the lamb tacos, and the pitcher of margaritas. It was also my birthday and they gave us a little surprise margarita sipper for the table. Great staff and friendly waiter. I’d be curious to come back for the hyped up brunch here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJaU04ZmFhN3ZyM2dnRRAB",
            "text": "Very surprised by the rating and some of the reviews - this place is fantastic. We went for brunch. Recs - fried Oaxaca cheese, little gem salad, soft scrambled egg tostada, and of course, the masa pancake. Pineapple marg was good for drinks."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcTQ2NURnEAE",
            "text": "I love this place in the neighborhood. Sister restaurant to Rolo’s.  Although the portions don’t look huge, they are very filling. It is on the pricier side, so not so much of an every day spot, but great for a date or celebration."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkR2NrNTBVVWRaVGtzNFNWTm9ORk5UTjBSc1RFRRAB",
            "text": "11/10 spot! The summer aquachile and little gem Ceasar salad are a must try. No matter how full, will always get the churros, such beautiful presentation. Thank you Maddy for an amazing welcome, only been here twice before but she remembered me and made me felt so special!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdGJQZk5BEAE",
            "text": "Truly one of the best restaurants I ever been to. Everything was so good and our server was the most ethereal woman ever lol\n\nI went for brunch and it was great. Def going to go one night for drinks and to see how the vibe differs from the day time"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKUDA5TFd5b2FfZmlnRRAB",
            "text": "Great drinks,  great food,  and attentive service in a fun atmosphere. I would highly recommend the fried shrimp tacos, baby gem lettuce and the churros."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfa3JDSllBEAE",
            "text": "Hellbender is a rising star in the Mexican food scene and blew me away with every dish they had. For starters, the fried cheese has an amazing crispy outer layer, the chips were perfectly baked and seasoned alongside a fresh quality guac, and the kampachi aguachile is unlike anything I’ve ever had before and pairs very well. Following with the tacos, the lamb was some of the best I’ve ever had; crispy seasoned outer layer with a good portion made this my favorite dish of the night. The fried shrimp taco was also very good and like everything else I mention here I would highly recommend.\nNow the mains, the al pastor ribs were my first and they were incredible! Nice chunks of meat and so much flavor made this so memorable. The NY Strip steak was simply a great dish and preparation.\nLastly, the Churros were also some of the best I've ever had, this dish is prepared perfectly and I would get it every time."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN18zbThBRRAB",
            "text": "Come for the pitcher of margaritas not the food. I had visited a year ago before they switched management and revamped the restaurant and now the food isn’t worth the hype. You might have seen it on Instagram, but stick with drinks only. We got 2 orders of chilaquiles and it was sitting in an inch of watery liquid and not good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQZ2V5ZmR3EAE",
            "text": "Decided to treat myself to dinner and went to check out this place. Came in during a dinner rush and was seated right away. A nice dark atmosphere. I ordered the NY strip steak and I gotta say it was amazing. Cooked to perfection, melted in my mouth. Cooked like a real steak a perfect medium rare. So good on its own and didn't any sauce but it came with a delicious arbol chilli salsa. Great service with friendly staff. I can't wait to come back and try the lamb tacos amongst other things. I highly recommend a lovely dinner here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMX1lzdGJIcFBqcmJBEAE",
            "text": "I had a really fun time coming here with friends. We had a long wait but we didn’t mind because it was worth it in the end. Our server Sarah was amazing despite it being insanely loud in there (some sounds dampening efforts would be greatly appreciated, I’m sure, by all patrons and staff especially older people, those who are hard of hearing and those with noise sensitivities. I loved the stuff we ordered. We got the watermelon and Oaxacan cheese for starters and then skirt steak and an empanada for our mains. The skirt steak was very tender and soft, not what expect from skirt steak, it was fantastic and seasoned very well. I also got a spicy margarita that was delish. We finished with an order of churros! So good! Thanks Sarah you made our night so fun and memorable ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnA3eDBRRRAB",
            "text": "Great vibes and food. Highly recommend the shared dishes and apps. We got the chamoy mango and asparagus and dare say liked them better than the entrees."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbzZuTU9REAE",
            "text": "Had a nice meal at Hellbender last weekend & here are the details. The margaritas are PROPER margaritas from a professional bartender and are worthy of an order. Chips and guac were above average but the very salad was totally delicious. Completely unique with some spice, I couldn’t recommend this enough. The lamb tacos were extremely tasty & the shrimp had a great crunch and were well seasoned as well. They are tiny, so if you’re splitting them as an app it’s fine, but as a main, order 3 and a side diff. Ribs al pastor were very tender and flavorful. Churros were excellent as well and an order is more than enough for 2 people. The staff is very friendly (Sara was very knowledgeable & hospitable) and had a welcoming, relaxed atmosphere, especially on a chilly Friday night. Hellbender is a great neighborhood restaurant that features nonbasic Mexican cuisine, so stop by if you get a chance!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaWZidnRBRRAB",
            "text": "Hellbender's flavor execution across the board is excellent. I recommend trying it as the food is very good.\n\nBut portion sizes to price leaves much to be desired. If food items was $3 less, I (and I imagine many others) would be here all the time.  But tacos half the size and double the price of those found in the neighborhood rich with tacos is hard to validate.\n\nThe lamb chorizo is delicious. The crispy texture with bursts of fat inside were wanting of a second order as soon as we bit into them.\n\nThe mushroom birria was a delightful take on a classic. The soup sauce for it was rich and added a nice depth to the mushroom base.\n\nThe churro is tasty, I'm a gluten for fried bread, and this scratched that itch. Airy, chewy, and the right amount of crunch! The salted cream with this edition of the churro (which rotates flavors) was superb.\n\nThe ambiance is nice and the cocktails were enjoyable and standard pricing for being a cocktail bar.\n\nI would not recommend this place for a full meal, but if tapa vibes and catching up over a cocktail is on the docket, Hellbenders is the perfect spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMT3RqdHU4LXFteGxRRRAB",
            "text": "I really enjoyed this place! It’s definitely a “scene”, but for good reason. The music is great, the aesthetic is simple yet warm and inviting, and the food is delicious. Absolutely worth the trek, even though it’s tucked away in what feels like the middle of nowhere.\n\nThe host, Ben, was incredibly hospitable and gracious, setting the tone for a delightful brunch experience. We didn’t have a reservation but still managed to get a table during peak brunch hours (around 1:00–1:30 PM). The wait wasn’t long, about 30 minutes, but again, totally worth it.\n\nHighly recommend for the bright, upbeat vibe, the warm hospitality, and drinks that are just as great as the food. The only reason I’m giving 4 stars instead of 5 is due to a timing issue with our food; my friend’s meal arrived well before mine, and my eggs were served significantly ahead of the steak and potatoes, leaving them cold by the time everything arrived.\n\nStill, I would highly recommend, just a few tweaks away from perfection!"
        }
    ],
    "reviews_count": 78
}