{
    "name": "Good Eats",
    "place_id": "ChIJoXzucvRewokRENxqa_oVt3A",
    "grid": "QN5",
    "address": "69-32 Grand Ave, Maspeth, NY 11378, USA",
    "rating": 4.4,
    "user_ratings_total": 1594,
    "phone_number": "(718) 478-2420",
    "reviews": [
        {
            "date": "4시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKU1gyTnhOWE54V2paNU1VZG9iMmhGVjFCZlFtYxAB",
            "text": "Do you want more 5-star Google reviews? Best of all, they’re free! We can provide as many as you need to help your business reach the top of Google Maps. Contact us on Telegram: @gthisjpeg"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRd2RYZzNaakZuYUdkZlpsVnZZMGhPYW1KQ2RFRRAB",
            "text": "Good food - plenty variety"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOb1VHeFNUbVZWY2toT2RUTktVamhQYUdwNlJtYxAB",
            "text": "Just had a grilled cheese w/bacon and some matzoh ball soup both were delicious."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSWR6VjZYMWREWW1GRWFYWnJRa2RNTlhCTE4xRRAB",
            "text": "Order was fast and exactly what I ordered . Great place . Fast delivery"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwd1FtaG1TVEZ4VDFOU1h6SkNNREZ2VldZNFNrRRAB",
            "text": "Ordered Salad delivery from them. There was a MUD between lettuce leaves.  THEY DO NOT WASH THEIR SALADS. Refused to acknowledge it when I went back and showed them and when I asked for a refund, the nasty answer was if we are loosing you as a customer we won't worry about refunding you. After a long argument, $5 was offered of a 21$ order. I refused it and planning to report them."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweFRqWm9aa0V0VHpkZmFHNVdRMUEyV25KWWVGRRAB",
            "text": "👍👍"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pab1psOHhPSEZ6ZFROMFpXWmhRbXA1WDFoeVZsRRAB",
            "text": "Excelente fresh toast 😋 👌 😍…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OYVJXWk1Wa0ZmTjBjeGNERXhRMVF0YmxaQ1JWRRAB",
            "text": "Good Eats has the best food in town as well as the portions are huge … when you want good food in Middle Village ghis is the spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sZlUyMXZPRlIzVmt0TWIzVjFjakF0WTFsamFXYxAB",
            "text": "Great food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wd1oxcExURXhQUTFWZlpIcDRUbkpGWldjdGQxRRAB",
            "text": "Food is always good. They serve large portions."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xc1RGQm5WMU4xTmw5SVVIWmhkbVZ4VG14ckxWRRAB",
            "text": "i love this place. the food is always so delicious with generous portions, the waiters are always so very friendly and just never any complaints"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JdGVERnlUR3R1TUU4MlJWQmZhM2Q2Y0djelNIYxAB",
            "text": "This place definitely has a best food in Maspeth. And portions are huge. Definitely recommend this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WVpHcFdOM2xLTkVwb1NrRTFWazlGVXkxdFZVRRAB",
            "text": "Good eats, the only place where I can eat good and not eat the whole thing. The fact this place warms their syrup always puts them as one of the best “bring your dates and your side pieces” places to ever come. Bring ya chick for breakfast; and your mistress for lunch; then that ole lady boss of yours for dinner. I promise you won’t regret the good food here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRGIxcG1iVU5hZFd4RFVIUjZRWHBTUXpOVVYxRRAB",
            "text": "It's basically a diner, BUT - the food is excellent and the portions are huge. The value is outstanding. I have eaten there and had their food delivered. Very consistent in both cases. Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSVN5MUxhVFUxYkRkdlluQXlSSFpYWDJob1NHYxAB",
            "text": "Decent burger, nice atmosphere, great shakes, good people."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbmMyZFFiVmh3VjE5S2NqSTBUR3RCTFdOWFlWRRAB",
            "text": "Huge brunch meals for less than 20bucks. First time tried their homemade hot choco and it was perfect even though its kinda sweet. Service was spot on."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTFpXbG1Ra1pTVUY5UmRGazRhek5STVcxeFJYYxAB",
            "text": "Great food with good sized portions, will definitely be back!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHZ0xUSmxBRRAB",
            "text": "Always love good eats...a bit pricey but you do get a ton of food..."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNFkxaHFVbkZWV0drMk1XTnFkakpqVlZoWmMwRRAB",
            "text": "Excelente servicio y la comida super"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVlozQkxaVGxsV1RKcE4xSTFORUpuV0V0SFFuYxAB",
            "text": "My delivery experience with Instacart was great"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbFoybG9RVmhmV1ZGc01FNWZRVTQzUW1sc1ZuYxAB",
            "text": "The only complaint about this place is it isn't bigger inside to have all it's guests wanting to come for such great food. The portions are beyond good, leaving leftovers for the biggest of eaters, yet still packing such good flavor. From breakfast, lunch, dinner, or dessert the food is fantastic. And the waiters are all kind and immediately attentive, even when packed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RWJtMXBTa0pGWWtoNmJYSmFURmxMWkdaR1VVRRAB",
            "text": "Not sure what people are complaining about in terms of the food, the food is great and big portions.\n\nIt’s just always crowded, which, I can’t blame the staff for but sometimes I notice that you have two people sitting at a 4 person table instead of a vacant two seater.\n\nOverall I enjoy going here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRFoyVkhVblprUTFWTlQwUmxaRGxEVm5OSGJVRRAB",
            "text": "Good Eats Diner truly lives up to its name. I had the fried chicken entrée with mashed potatoes and sautéed spinach on the side, plus a starter of chicken orzo soup. Everything hit the mark.\n\nThe fried chicken was perfectly done with a light, crispy batter that wasn't too thick (a personal pet peeve of mine). The mashed potatoes were creamy and smooth, and the spinach was sautéed just right with olive oil and garlic. Simple, flavorful, and delicious; just the way I love my food. The chicken orzo soup was a comforting and tasty way to start the meal.\n\nMy lunch companion had the lemonade, which came in a classic malt cup and it looked freshly squeezed. It was a refreshing touch, because it is rare to see an establishment serve freshly squeezed lemonade.\n\nThe ambiance is casual, and the service was attentive without being overbearing. A great spot for classic comfort food done right."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJejVfZS1RRRAB",
            "text": "The food is excellent, portions are enormous,,, I can’t believe anyone would ever complain,,, the best waiter is Michael, extremely polite,and makes you feel like your his only customer,, that is why we always look for him , the other waiters are very good, as well as the only waitress Mary,, the food dims always fresh, and if there is a wait it’s worth the wait ,,, owners are usually on site ,,, John, wife Maria, sons George, Andreas, I forget the other son Sorry,,, ,, the biggest shout out to cook,, Daniel,, and best counter men,, Louis,Peter, & Felipe,,"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rdFNWOUJSMUZtYlRkRlozUkdORmhzY0Rac2IzYxAB",
            "text": "Was looking for a breakfast place in the area and stumbled upon this gem. Portions huge food incredible servers very attentive. Homemade maple syrup delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQNlJuNTJtNzRMU3RBRRAB",
            "text": "Awesome people really good portion of the food really should recommend this place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLTHVxdi0weGF2ZWVREAE",
            "text": "Classic diner experience"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQSG5pT0xCcmJPVFR3EAE",
            "text": "We eat here everytime we visit and it never disappoints. Michael seems to wait on us each time, also, and we wouldn't have it any other way.  Dishes are always delicious and always give the opportunity to bring leftovers home because of portions."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sweVJucHhhbEJwWHpsRVRqQnlibEkzV2poU1EyYxAB",
            "text": "I ordered California omelette and seasonal berry waffles over the phone for delivery. I repeated the order twice for seasonal berry waffles to the person who answered my call and he seemed very rushed throughout the entire call, therefore messing up my order. The delivery I received was a California omelette with burnt toast and berries with no waffles at all. I called again to make them aware that the order was wrong and to advise the diners employees to be kinder and more attentive when taking orders over the phone. This time the person who answered was ruder and responded with “I wasn’t the one taking your order” and hung up right away on me. I was going to try and request to speak to a manager and he did not give me the chance to since he so rudely hung up."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLYnEtUGVGXy1uWVlnEAE",
            "text": "Really good food but terrible attitudes !! The waitress was disgusting and miserable and the to go order guy was snappy. The manager was cool,"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYjlqOTdJM3FfSml3RRAB",
            "text": "I have known this place for many years and the quality of food has NEVER changed ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKMlV4TWU5MDk2ZnNRRRAB",
            "text": "They give big portions. Your buck goes a long way here. Nothing too crazy in terms of flavor. Just a regular diner spot with madddddddd food items on their menu. I like it, so I’ll give them a good review."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLMjlnX3JPbnFPUTFBRRAB",
            "text": "Good portion of food size, 2 people can share if one is not hungry.\nGood service and great Good, visit it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLRy0xb3JtNXNTSzlRRRAB",
            "text": "Got delivery lots of food but not cooked well cheese omelet with bacon was dry and bacon burnt. For overpriced food you think it would be better so first and probably last time I order from them"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJTEJuOHJxNV9QREt3EAE",
            "text": "Food is always great 👍…"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJX29pWXlxN09lNVVBEAE",
            "text": "Muy buena y suficiente comida y buena atención"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPX0NvUFN3amRYaHRnRRAB",
            "text": "The food is good with big portions and being very filling. All in all good place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNHNmVlJBEAE",
            "text": "Full Irish breakfast is enormous, totally authentic, and as good as anything you'd get in the auld sod (or better!). Good value, clean, friendly staff."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvX0plT25RRRAB",
            "text": "How Diners used to be in NY. We use to have the best diners in the Tri-state. Good Eats gets it. Hats off!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcVBtWGtRRRAB",
            "text": "Im gonna keep it real, i dont really want to elaborate for selfish reasons lol but this place IS THAT GOOD. Western Omelets is my go to, however, I have jumped all over that menu. When I have visitors, I TAKE THEM STRAIGHT TO GOOD EATS or order for delivery lol. Had a western omelet at a diner in the city recently and usually DINERS dont miss, and that other spot was a great spot, but it wasnt hitting and yet, GOOD EATS worse days is still better than most best.  Also, staff is cool! like the whole spot! delivery drivers, kitchen, everyone!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3N2V6U1J3EAE",
            "text": "Probably the best dinner in queens that I been to."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eVlLYWp3RRAB",
            "text": "Excelente comida"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bXZlcnhRRRAB",
            "text": "Great local diner! I haven't had a bad meal here yet. The OMG sandwich was delicious, messy, but delicious. We, also got an omelette with spinach, jalapenos, mushrooms and cheese."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaWI3VWF3EAE",
            "text": "Super nice, hidden spot. Clean."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtckpTQmV3EAE",
            "text": "The best diner I've ever been to. The staff is friendly and the food portions are excellent."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaGVMX1BREAE",
            "text": "My favorite diner in the neighborhood!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSXzU2VFZREAE",
            "text": "The environment is relatively small. Seating options include booths and chairs, although most of the available seats are best suited for smaller groups of 2-4 individuals. Coffee is served once, and the cup size may be smaller than anticipated. The sandwich is a reasonable size, and the portions are worth the price paid.\n\nDuring busy periods, customers may need to request a coffee refill, but refill service is offered after the restaurant has quiet down. Overall, the quality of service is average, with no exceptional aspects. It's possible that staff may have been unavailable at times due to how busy it can get.\n\nI ordered the chicken Salad sandwich and felt like it was a bit bland I felt like it needed something more. However, I did enjoy how the bread was toasted and would like to try different types of sandwiches. My sandwich cost about $10.\n\nIf you order something with fries it usually costs like an extra $7"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeE5feGx3RRAB",
            "text": "I’ve come here about once a month and I love it every time! The food is so good and priced well too for the huge portions! I recommend going with friends but good to go alone too if you want to have left overs for the next day. The staff is friendly and attentive and did I mention how much I love the food? The stuffed French toast is always my go to."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCakxUejV3RRAB",
            "text": "This place was fantastic. They were able to accommodate my family and I after my mother passed away and we went out for brunch. There was about 13 of us and they made it work. The food was delicious, service was good, street parking was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdnZULTRRRRAB",
            "text": "I’ve been here a couple of times and each time it has been amazing. Great sandwiches. I love the stuffed grilled cheeses. They are loaded. The waffle fries and onion rings are my favorite sides there but everything is excellent"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLOU1LX1h3EAE",
            "text": "Great place with great food. The place can get very busy in the afternoon around 1:00-3:00. The prices are reasonable for the amount of food they give you so if you’re like me expect to take home your left overs. The best part about here is the amount of options they have on the menu. Personally, I’m a picky eater so I usually have to order the same thing a lot but here I was very pleased to see that I had options to choose from. I would highly recommend anyone going here, you’ll definitely want to go back more than once"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhd2QtZElnEAE",
            "text": "Absolutely worth going. Went in for brunch with my run siblings after a long run. Super hungry & the amount that brunch came was super big. Some of my teammates had to pack the rest for home. Every penny worth & food was delish. The server was very friendly & nice. It has outdoor seating as well as indoor. I would definitely go again."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobzZ5NXNRRRAB",
            "text": "After a second visit I must change my first 5 stars review. A good place should have consistent service and food. It is not possible how bad my second visit went, the food wasn’t good and the service was terrible. I’ll keep three stars just because my first visit was good. Maybe I’ll be back in the future…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cWVuOXpBRRAB",
            "text": "Great Place, Came on Father's Day and was surprised that it had a long wait, so I got it to go. Due to circumstances, the food was warmed up twice before I got to sit and eat it.. I must say, it tasted so good, I told her I was going back to get this fresh. So today I went and celebrated a special morning breakfast with someone amazing and I must say, it was not disappointing. The Waffle was amazing. It has flavor and crispy with a soft center. The menu has a lot of different choices and I will definitely be back to try them all. Wonder how to get my own both...."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyek5xWV93RRAB",
            "text": "Went one morning alone, definitely had a good time. Service was a tad slow but that’s bc they were busy so I don’t blame em! Food was delicious and very friendly environment! The way some of the tables were made were gorgeous, will definitely come back. Thanks fr"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZcU43bnVBRRAB",
            "text": "If you are looking for a nice city neighborhood that is way off the beaten path this is a good option. The service was quick and polite. The atmosphere very much matched the working class neighborhood. But once they brought the food out we…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpME1EQ0RnEAE",
            "text": "I am so happy to have found this spot! I’m a very picky eater, and it’s hard to please me in all aspect. But this diner really blew me away. From the ambience and decor, to the service and most importantly to the food. Everything was on point. My waitress was super nice. I ordered the chicken soup, chicken and waffles and a latte. I was a little skeptical of the fried chicken but man, I’ve had chicken and waffles from the Waffle House in Atlanta, North Carolina, and even in Texas. This blew me away. The chicken was crispy, not too greasy, and amazingly juicy. The waffle was fresh, and made to perfection. Crisp, not too hard/crunchy, and the honey drizzled on it was just the perfect amount. The latte was delicious as well. You can tell they used good quality coffee beans, no burnt taste, and they topped it off with a little bit of cinnamon powder on top it seemed. The chicken soup had an abundant amount of chicken and rice, very brothy and delicious as well. Seriously, everything was amazing I was very impressed. I can’t wait to come back here again. Haven’t had such a good meal in a while."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlME1TSE93EAE",
            "text": "Stopped in here for lunch and was happy with my visit. My friend recommended I try their burgers, and that is what I did. I got the Bacon cheeseburger deluxe and was very pleased. The burger was huge and they have a good side portion of fries as well. Also had their chocolate milkshake and it was delicious. Well worth the price for the portion sizes. Staff was friendly and the food was cooked fairly quick for how busy the restaurant was"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5ajZpUkhREAE",
            "text": "Love this spot. Service is always on point & the food is always scrumptious & fresh! Parking can be an issue, but the food here, is worth the trouble. I usually have breakfast here but this visit was for lunch; & it didn't dissappoint. I had the stuffed avocado with chicken salad (SOOO GOOD!) & Mom had a delicious chicken, mushrooms & spinach wrap with a side of sweet potato fries. We both walked out of there happy & with leftovers to enjoy, later in the day. I will also say the portion sizes are hefty & worth the money. Honestly, I think Mom & I could've chosen one dish & walked out satisfied, tummies full. Gets busy during the early hours & during the weekend. Family friendly, clean, & the staff are very efficient. I always have a wonderful dining experience when I visit. Definitely gjve this spot a chance to impress you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCXzhfZkl3EAE",
            "text": "Sooo good!! I had the house lemonade and it was delicious.  Burger sliders were good, the bacon burger was delicious,  the chicken cesar salad was fresh and the chicken was perfectly grilled. My favorite was the chicken, apple, bacon panini. Must try"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcDdQUi1BRRAB",
            "text": "It's harder and harder to find a decent diner, Let alone a good one. However, we finally found it. We came with our Good friends who said this place is awesome and it is. From service to quality of food and to quantity (OMG)....you better…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpbkpxSzZRRRAB",
            "text": "My pancakes were amazing and I couldn’t even get Past the half mark. The huevos rancheros were delicious as well but a little too overpriced for just 2 eggs and a bunch of nachos around to fill up the emptiness. The hot chocolate was my favorite ! Overall, my experience was a good one."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQa29qZjd3RRAB",
            "text": "I eat here often and they have not missed once. My new favorite is the ricotta toast which has fig jam and eggs on ricotta toast with Chilli flakes and a bakes sweet potato on the side. This place makes me happy dance while I eat. The pb&j french toast is also crazy good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdW9HLUJnEAE",
            "text": "Clean restaurant with a decent amount of seating. The portions were huge, definitely worth. Their menu is pretty big too."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3eXBYbHlnRRAB",
            "text": "Not a lot of diners do so many dishes well. The portion sizes are great and you wont regret what you purchase. Very family friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaLVpfaTRRRRAB",
            "text": "The food was good and were huge portions. I was surprised the chocolate chip pancakes were smaller sized than usual (perfect size for my son)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURaMzVnNxAB",
            "text": "I would like to thank Good Eats for showing me how it is possible to make breakfast food bland. Topped with probably the worst service in Queens, I will never be going back here even if hell bends over."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2N08zZGpRRRAB",
            "text": "The food was amazing . I was greeted when I walked in but the waiter that spoke to me didn’t ask what I was there for or if I wanted to be seated. It took another waiter to come up to me to ask if I needed anything. Then the man at the pick up order station had a horrible attitude. I told him my real name for my order (that I usually do not go by) and he said he didn’t have my order.  He then asked for a code and I explained to him I don’t have a code - I didn’t receive a text or anything to verify because I ordered on google and I also use google maps to get there so the confirmation was lost once I put my gps on. He proceeded to tell me that I did not have an order but I know I did. I then gave him my nickname (Ana) and he gave me my order. I also included my last name on the order so if there was any confusion he could have asked for my last name , my phone number was also on the order. His attitude was horrendous I didn’t even want to speak to a manager about it because I just wanted to get my food and go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cGMtSGZBEAE",
            "text": "Great food. For the price the portion was filling. I got the chicken Mac sandwich and it was delicious. Fries were also nice and crispy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoeXBMdjVBRRAB",
            "text": "This is the best diner in Maspeth my boyfriend and I go here as tradition every so often because the food is amazing and for the price you get a huge portion that it’s like having two meals for the price of one! Amazing! The customer…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXenVTRGdnRRAB",
            "text": "We ordered the Cajun Eggs Benedict, Apple Pie Milkshake, & the Buffalo Chicken Tater Tot Bowl. Oh my goodness, was that bowl huge! Everything was absolutely delicious, we got there right before the rush, so our food got finished quick! Everyone was super nice there, the place was clean, cute, had this mix of new and old feelz. I'd recommend this place. Sorry for the single picture, forgot to take pictures until we were already almost done!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhejZhSVV3EAE",
            "text": "I went here 2 times and holy both these times were insane, so the first time I went was to get breakfast, I decided to get a penny sandwich and it was DELICIOUS, I’ve never had a avocado on a sandwich, GENIUS IDEA. The 2nd time was for dinner, I got fettuccine Alfredo with chicken, and omg how delicious it was, it was so good, it’s probably even better than Olive gardens, and Olive gardens are really good, overall I will definitely recommend this place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbVAzZl9BRRAB",
            "text": "Amazing! As soon as you walk in... the smell is so good. Dinner style with a large variety of fun dishes. Everytime you see food come out the back it all looks good and consistently large portions. Worth every penny. Friendly people and great price point. I Love this place."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5a29tSTBBRRAB",
            "text": "Good Eats is one of my go to delivery spots. I have yet to have anything on the (very long) menu that is bad. The staff are incredibly friendly and go the extra mile for you. Don’t be scared off by the prices, the portions are HUGE. Most of their meals could easily feed 2-3 people.\n\nEdit: The burritos are not good… but also huge. Still 5 stars for everything else!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhODRxT3ZRRRAB",
            "text": "Food was deliciously fresh. The guacamole and chips were great. The cappuccino was a bit watery tho.. the female waiter was a bit too serious and not happy for some reason. But the food was really tasty and fresh."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBem9ENFFREAE",
            "text": "I’d advise coming here during their less busy days/hours. We came Sunday afternoon and had to wait about 30 mins to be seated and about 30 mins for our food, but the host and server were very friendly and very attentive despite it being…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMzZ5N0p3EAE",
            "text": "The bacon was salty, fries were greasy n the bread was stale n hard.     I won’t go here again.    This restaurant needs additional staff.   Service .. waited for napkins n our bill way too long."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3aUptN2R3EAE",
            "text": "Great spot for breakfast, decent portions, good service, we've never been disappointed, other than parking."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXXzhpQXJBRRAB",
            "text": "I had the avocado toast and when I say it was great I wish there was a better word to describe how good it was.  The poached eggs where made to perfection.  It wasn't too runny and the balsamic vinaigrette was so sweet it added such a nice…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdXE3T3N3RRAB",
            "text": "Large portion, Food is good but no surprise. But the juice size is tiny."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dm83bExnEAE",
            "text": "This place saved my life. I hadn't eaten the whole day and I was in a terrible mood... 50 minute commute home and I was dying, got off the highway, can't believe I just so happened to stumble upon this gem. The staff is so friendly and the food was DELICIOUS, their cheese fries are 🤌 impeccable. The portions are enormous and I had a ton of leftovers, for the amount that arrived and the quality it's incredibly reasonably priced."
        }
    ],
    "reviews_count": 81
}