{
    "name": "Mediterranean Restaurant & Bar - Relax Lounge",
    "place_id": "ChIJT-rGNTFdwokRCo3dSLTy3wM",
    "grid": "QN5",
    "address": "68-17 Forest Ave, Queens, NY 11385, USA",
    "rating": 4.5,
    "user_ratings_total": 72,
    "phone_number": "(347) 720-8826",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVmFtdzFiRlo1VW5wdmRGSXdaekYwYUZOaU1IYxAB",
            "text": "Relax Lounge is my favorite restaurant in the area, the atmosphere is very inviting. The owners are very nice and they make you feel like family. Delicious food and drinks 🍹 We order Bolognese pasta, it was al dente just as i wanted, fresh and it tasted really good 😊  Definitely will come back !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkelgwdDRWbXBJY2pWaFlrUlFSbVpCVHpneVVrRRAB",
            "text": "Carbonara is too salty. Food took 30 minutes for overcooked pasta"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLU0l2X1d2LWEtZWdRRRAB",
            "text": "Came here today for the first time, the chicken Caesar salad was delicious as was the white wine. The ambiance is lovely as is the staff"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeHU3Y25nRRAB",
            "text": "Mediocre. No diaper changer with a lot of families there. Weird vibe when I walked in. Was asked what I wanted with no menu."
        },
        {
            "date": "11달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNTdDMDFBRRAB",
            "text": "Bardzo miła obsługa i świetne ,, europejskie,, espresso w filiżance..."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzd19ISml3RRAB",
            "text": "GREAT FOOD!, unfortunately we had to just take our food out due to the smoke inside of the business, i do not recommend this place for families who wants to have a nice dinner, the door is always open and leaves all the smoke of the people smoking outside get in, they have a really nice bar, and an outside seating space which seem really nice as long as you want to smoke and drink, not coming back for food even thought it was amazing food, if you make a restaurant make sure your guest don’t have smoke all over their faces it was really unsanitary and unprofessional."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNXZUQ2pBRRAB",
            "text": "My fiance always comes here. I went to use the bathroom and couldn’t find the guy that worked there to ask. I was going to grab a cappucino. Mid washing my hands I get an aggressive knock on the door. I go outside to look for my partner to go buy a coffee and the guy follows me outside and reprimands me saying it’s weird to just go use the bathroom. Not only did he go out of his way to harass me while using the bathroom but to reprimand me and follow me outside. My partner is a regular and now we are never going back. He’s the guy who works on Saturday afternoons. First time ever writing a review because I’ve never had a guy go out of his way to give me a hard time for using the bathroom. Meanwhile all men hanging and made it really uncomfortable and made me feel really uncomfortable and attacked and turned me off from buying based on his assumption. Terrible service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMkxfT2VBEAE",
            "text": "they got rats and the food is trashhh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubVByV0d3EAE",
            "text": "Loud and ugly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieHFHa3ZnRRAB",
            "text": "3 of my coworkers and I visited Relax bar on friday 8/2/24. We were all AMAZED AT The great service. Given the establishment was empty because it was 2:45pm on a friday. We had the restaurant to ourselves it was great. Its a small cozy place both indoor and outdoor dining. What we loved was the attention our server gave us. She served our drinks and made them nicely. We ordered a bunch of appetizers and shared them. They were all so delicious. I dont think I can say I had a favorite because they were all SO DELICIOUS… The chef definitely Outdid himself. The Food was HOT AND FRESH.  The dessert was also amazing. Thanks for the great visit. We will definitely be back.\n\nIf you drive:\nThe Ridgewood area is congested. Always busy.\nNo parking only street parking if your lucky."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMM29MRDh3RRAB",
            "text": "We ordered Two margaritas they were awful she used the concentrated lime juice that you find in the supermarket to make it. No margaritas mix no nothing and definitely no sugar and whatever tequila she used it tasted like gasoline. Maybe that’s why everyone was having beers when I walked in"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeW9YR093EAE",
            "text": "Not a big place, not a lot of seatings\nBut not lacking on drinks and food\nService was good. We ordered the mix grill plate, meat and cheese board, calamari, and seafood pasta"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6c1p5NzVBRRAB",
            "text": "Amazing place 😋…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUODZ6VC1nRRAB",
            "text": "We had the amazing lamb chops today.  The staff is very friendly and sweet.  The drinks are fabulous.  My Mother had the Negroni and I had Tequila.  The pistachio dessert was fabulous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdzdDcC13RRAB",
            "text": "I just love this spot. A peace of home or European vibe that we miss so much in Ridgewood ( unlike Astoria). Food improved greatly ( they had some failures in the past). All in all great spot to relax a bit in rush day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeHB6YnhRRRAB",
            "text": "Amazing!!! Xhelsi gave us so the most amazing service — will definitely come here again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREc0pMaGFBEAE",
            "text": "great service great food cozy place and clean  good atmosphere staff friendly\ni highly recommend do not hesitate to be there"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NDRXaUF3EAE",
            "text": "Best coffee in  Queens. If you genuinely like coffee, you should come here. And the food is great too 👌 I guess you could call me e regular now 😅"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZ012enpnRRAB",
            "text": "Not serving breakfast. Just ordered coffee."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdjZQM2t3RRAB",
            "text": "Can’t recommend this place enough. The service is the best you can ever get in NYC, food is so fresh and delicious and the vibe is amazing. Everytime i come here feels like I’m going home ❤️."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodTVqSjF3RRAB",
            "text": "Great place! The bruschetta was out of this world, the calamari crispy and tasty, and they actually have good espresso -- which, weirdly enough, is hard to find. 10/10!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoazRLUFFBEAE",
            "text": "Don't order take out from this place. I was informed BY THE DELIVERY DRIVER, not the restaurant, that when he went to retrieve the food, my order had been canceled. He said they told him the computers were not working. So why list your place on a delivery app? How was the driver notified to come get a delivery? Im so confused. Then when I tried to contact the place, it suddenly was listed as “closed”. This is beyond unprofessional. I had to contact the app customer service for a refund. I was never contacted by the business itself nor could I contact them. Do better…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobjZUNERREAE",
            "text": "I visited this place looking for a new favorite low key  place being famous its difficult to find a quiet place. I tell you the advertisement is more inviting then the lady that had working in there when I walked in she looked at me like…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcTRUUWFBEAE",
            "text": "The best place  the best coffee, the best food everything excellent"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcjllX19BRRAB",
            "text": "People friendly. Tasty food. Great prices. And very relaxed atmosphere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNGJTUTZBRRAB",
            "text": "Amazing service , food is top notch especially the prosciutto platter with olives and mozzarella balls. Served on a beautiful wooden tree trunk platter. Music, and great atmosphere. Its definitely a regular spot for me. Love this place. Gorgeous inside and out!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1NGF1UmNnEAE",
            "text": "Very nice place, delicious food and good cocktails . The service was 10/10 and the decorations and environment were typical European which we all loved cause you can’t find that easily in NYC. Definitely going back there to enjoy other dishes."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbmMtaU1nEAE",
            "text": "Una comida de Dioses!!! un sabor Mediterraneo inconfudible, la atencion muy buena, un lugar agradable que marca la diferencia.\nHoz recomiendo"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbllQSnhnRRAB",
            "text": "La comida es deliciosa fresca, la mejor atención el mejor de los servicios una decoración estupenda me encanto..... Volveré sin dudarlo.."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPal9IT2xRRRAB",
            "text": "Perfect bruschetta"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbzZXZXhnRRAB",
            "text": "For be a new place, it's pretty comfortable. I'll come back soon!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPcGJEUGp3RRAB",
            "text": "This new place is beautiful inside and out! The food was fantastic (big portions), and the passion of the very sweet owners was outstanding. They gave us a nice tour of the place, which has a large back room and outdoor seating!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcGJETENREAE",
            "text": "This place is amazing! Went here on a Tuesday night and the owner was so gracious and showed us the restaurant. This place is truly a gem within Ridgewood that everyone must experience. I will definitively be coming here again. The food is amazing and fresh, the service was fantastic and the overall atmosphere was relaxing!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPM28zXy1BRRAB",
            "text": "Very nice, relaxing cousy place with delicious food and inviting staff 👌👍❣️…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbEx6OG53RRAB",
            "text": "It was an incredible experience, friendly service, cozy atmosphere and delicious dishes, well served and reasonably priced. They serve Mediterranean food with excellent options on the menu. I missed a wine menu. It's on my list of the best restaurants in New York and close to home."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNks3UXdnRRAB",
            "text": "Very nice place to be in, it’s brand new the place, the ambiance it’s excellent, the service it’s great,and the food was fresh and properly cooked,I have a nice branzino my husband and his friend had steak and our friend has…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaUlUR3NBRRAB",
            "text": "Nice place! I sat here a few hours with my laptop getting work done. The coffee was great. The lunch was great. The staff was very friendly and helpful. Will definitely be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydDZXSkF3EAE",
            "text": "Delicious food. Meat balls are amazing!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycmYyUU53EAE",
            "text": "This is a gem in the neighborhood, something we hadn’t had before. It is in the main street, decor is excellent. The food is the best I have ever had, I highly  recommend. Deserts are heaven..…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyamY2ZVl3EAE",
            "text": "Beautiful spot, “relaxing lounge” is definitely accurate. They’ve just opened, family owned, lovely kid greeted us, peaceful vibes. We popped in for a quick breakfast bite; ginger tea, iced coffee, Nutella croissant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaVo2NC1nRRAB",
            "text": "The most delicious steak I ever had , amazing food !! Beautiful decor, excellent service !!We went for restaurant week and had a wonderful bday party ! Highly recommended!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNFpLMlJ3EAE",
            "text": "Super cute place, our waitress was so sweet!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyb2U3Ml9nRRAB",
            "text": "Best place to eat in Ridgewood. The food and service are perfect ❤️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycktQY1VBEAE",
            "text": "Amazing place! Excellent service..\nI will definitely recommend it to friends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydFAtekx3EAE",
            "text": "Nice lounge to be at"
        },
        {
            "date": "3년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyeE12RndnRRAB",
            "text": "Si mangia da dio .buon servizio.buon cibo un buon ambiente molto relax🎊🎊🎊🎉🎉🎉…"
        }
    ],
    "reviews_count": 46
}