{
    "name": "El Alto",
    "place_id": "ChIJTYHJP5pewokR_DIHnFvmEs4",
    "grid": "QN5",
    "address": "60-01 Metropolitan Ave, Ridgewood, NY 11385, USA",
    "rating": 4.6,
    "user_ratings_total": 158,
    "phone_number": "(718) 456-1044",
    "reviews": [
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlck5TOUpnEAE",
            "text": "Mex"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWExUbHRhek50VWs5amFGUkJXRUZOTFVNM1ZHYxAB",
            "text": "Love the quesadilla"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJLWYzNzh3RRAB",
            "text": "La comida es muy buena"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNW9Tb0dREAE",
            "text": "Exelente comida y buen trato probe los tacos y estaban buenisimos"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcy0zUTh3RRAB",
            "text": "I absolutely love the authentic flavor of this Mexican Restaurant. Think the opposite of Chipotle. 5 stars!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaUx2aGt3RRAB",
            "text": "Good authentic food. It is a simple place with good Mexican food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidExtOXF3RRAB",
            "text": "i've been ordering take out for yrs from these guys until recently when i ordered a chicken torta and the chicken tasted spoiled! i didnt call to complain at the time but i waited to tell them about it the next time i ordered a chicken torta....i told the guy to just make sure the chicken is fresh and to my surprise i get push back!! Instead of an apologizing  i get all these lame excuses that i kept calling to see when my food would arrive--this was 1 month later, how can he remember it was me!? And if they tell me its going to take 30 mins and its now 45 mins then you'd better believe im going to call to find out where's my food!! And then this guy asked me if i wanted my CHICKEN med-well??!!! SERIOUSLY DUDE??!! They all speak spanish and I do too so I know he understood me!! BAD FOOD and WORSE CUSTOMER SERVICE!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMFpqUzdBRRAB",
            "text": "I stopped by to pickup lunch. Ordered the shrimp quesadilla, rice & salad. I was the only customer in there. The service was good. I got back to work and started eating. It was very soggy. The cheese tasted processed, like the kind used in deli sandwiches. I was not impressed. I would hesitate to give it another try. On to the next..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6c2JHVWRBEAE",
            "text": "Love the burritos! Excellent service !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6X00zLVhREAE",
            "text": "Simple delicious homemade food, and really kind people. Love the guacamole (chips are always fresh), tortas cemitas and burritos. So glad to have them in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMDdiMVZREAE",
            "text": "Great fresh food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MU1tRGxnRRAB",
            "text": "Since I moved around here. Is one of my best places for Mexican food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWMjd1UG1nRRAB",
            "text": "Great  taste . Agua de Jamaica ( hibiscus water )is fresh and staff is friendly . They added some chips and salsa with no extra cost. 10 out of 10 I hundred percent recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGMDl6ckxnEAE",
            "text": "The very best! A gem in the heart of Queens, NY. So glad I stopped at a red light and loked over to the left. There was a parking spot to the right of me, giving me the opportunity to execute a decent parallel on the second try lol.\n\nDelicious juice and excellent customer service! Please give them all the flowers. Really good and kind hearted people. I promise to visit whenever I can!\n\nBlessings."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaWNhUlZ3EAE",
            "text": "Best ever tacos ever. Guacamole arrived so fresh and green. Burrito great size fully stuffed with meats. Ingredients and the sauce you can tell is homemade so delicious. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaXFlQ2pBRRAB",
            "text": "At first, I was hesitant to try this food cause I didn't see a nice decor, but then my husband told me that their food was amazing. I was skeptical and then fell in love. Food was really delicious. We tried different types of tacos and nachos .. amazing. Juices were also nice. Service was very nice and made us feel very welcome and at home"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwM09qdURREAE",
            "text": "Food is decent, good for a quick bite to eat. But be prepared to have your order made wrong. Every. Time. Check the bags before you leave."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbkllYjhnRRAB",
            "text": "🐐🐐"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdHNya0JREAE",
            "text": "fresh ingredients well put together a little expensive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoeGNXYmpRRRAB",
            "text": "EXCELLENTE!!! AUTHENTIC, DELICOUS AND FLAVORFUL"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbGVleUNREAE",
            "text": "Hola increíble  buen lugar la comida muy buena\nLas salsas verde y roja  huy buenísimas otro sabor a las clásicas salsas\nlas porciones abundantes  es difícil encontrar esto en los restaurantes Mexicanos\nLugar limpio\nLugar comfortable excepto por el aire acondicionado que es muy importante  en estos lugares más en el verano\nBaño limpio\nExcelente vista con 360% de visión 👌\nEl caunter limpio y se ve que todas las verduras frescas\nEl servidor bien\nLos precios desfasados  por una  Cemita 2 aguas simples y una coca cola de vidrio fueron algo más de 17 dólares pero en cada lugar que vallas esos son los precios estándar.\nRecomiendo este lugar ?\nSeguro 100 % 👍  saludos ✌"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1azVud0RREAE",
            "text": "Sadly didn't like the chicken tacos the chicken was not grilled it was more like boild or soup chicken. For good tacos go to Mi Casita."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyck8yRUxnEAE",
            "text": "Best Mexican food around"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtOHVHZ2p3RRAB",
            "text": "Very good food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHaklLTmhBRRAB",
            "text": "Chicken Burrito, chips and salsa verde for $10. Awesome little spot."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHOFlHWGNBEAE",
            "text": "OMG!!! Best Authentic Mexican Food... Their Grilled Steak, Grilled Chicken, and Milanesa Tortas are the best Ever!!!....Great Portions😝 All selections are Delicious and made to order with Fresh Ingredients... The guys there are so nice and friendly... and will take special requests on orders without hesitation... Really Love their Mexican Food!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhalBTQzhRRRAB",
            "text": "Delicious Mexican food cooked to perfection! It's a must go if you're in the neighborhood. Even if you're not a fan of Mexican cuisine, El Alto will change your mind in split of a second. I highly recommend this restaurant!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxczVxb2NBEAE",
            "text": "My Spanish is bad but I tried these guys are extremely friendly and you can go here to buy my jalapenos 😜. They help me with my orders. When I need delivery they're right here and they're friendly I recommend this place and the salsa verda. Very good.…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxM3ZuS2dBRRAB",
            "text": "Exelente"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLaklucWp3RRAB",
            "text": "Clean restaurant. Food is always delicious. Service with a smile."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLdmR2WEpBEAE",
            "text": "GREAT GREAT FOOD the food is always fresh. also get a large amount.."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLMk5xZUp3EAE",
            "text": "100 % comida deliciosa excelente atención"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5aWRLTTZRRRAB",
            "text": "This place by far is the closest place to getting authentic Mexican food  , anything more better this ,  you  would have to go to mexico to experience the taste."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5aXJ1d0pBEAE",
            "text": "Horrible el trato al cliente, precios altos y las cemitas las dan sin papalo, no recomiendo para nada este lugar, antes era bueno pero ahora es todo lo contrario."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTc1pLaFlREAE",
            "text": "Great local place."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpb3AtWFdREAE",
            "text": "Hands down one of the best chicken quesadillas in all Queens! Also, the guac and chips are godly!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpa2EtUUVREAE",
            "text": "This place is good. It dont look like much, but the food is delicious. Only time I eat pork outside the house. Very fresh, and make the guacamole on spot."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpbmFhRUpBEAE",
            "text": "Food is great but they need to fix up inside  the place a little"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpOHRyRXdRRRAB",
            "text": "Great Food and Staff !!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDajhfLVdnEAE",
            "text": "Probably the best mexican I have ever had..."
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDcTVhVUlBEAE",
            "text": "Muy recomendable, muy sabrosa comida recomiendo todo lo que venden tacos, tortas todo esta muy delicioso..  bien servido, y barato."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4eHJINnp3RRAB",
            "text": "The food is delicious"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzbUtlVE9nEAE",
            "text": "Carefully crafted fresh and flavorful Mexican food! The veggie quesadilla is perfect and full of fresh veggies. The green sauce is really tasty with a perfect hint of spice. The portions are generous and the service is great. The old Subway restaurant setting adds charm."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvZ0w2OXVnRRAB",
            "text": "This is a little corner bodega with food with big taste. Simple, clean place, great food (which you see them make) and good prices, what more can you ask for?"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNNHNtWTF3RRAB",
            "text": "Comida muy rica\n\nEn cuanto a su sostenibilidad, usan platos hondos y platos de vidrio 👍 pero cubiertos desechables 😪…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNFejhINGV3EAE",
            "text": "Place is a little bit of a hole in the wall because it's around a gas station, strip club, walgreens, fire station and a busy street where there's never any parking. If you're not a resident in the are you'd probably miss it and confuse it for a deli. Their burritos are really tasty and best part of it is that they wrap/stuff it very neatly. You have all your ingredients available at every bite; not the meat on one said and a bite full of flour and rice on the other.  The burrito is also very neat to where I am able to put it down, politely ask for more sauce and come back to all my toppings still in the tortilla without a mess. There's no bathroom but they allowed me use of their employee bathroom to wash my hands before eating (don't expect this all the time though). The staff is very friendly and helpful ready to answer all your questions. It's about 12.50 for the burrito with a drink. It comes with a small portion of chips & salsa. It is worthy of the price for it's quality. I eat a lot and I'm stuffed so I can imagine others that don't eat so much can share one and be fine."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZN052M293RRAB",
            "text": "Close to the best mexican food I've found in NYC, and I've looked. Made by friendly, caring staff who can always recommend something new try. And they will make you anything, tacos, tortas, fajitas, platters, an eggs omelet w home fries, salads, fresh juices, and that's just what I've tried. I love this place"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNdWVpTE5REAE",
            "text": "Great place for Mexican food. The service is great and they aren't afraid to give good portions as well. Th subways vibe is still there cause it used to be a subways, but overall, it's the food that matters!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVeE5MVHF3RRAB",
            "text": "So glad that this place is near my apartment because I have to say I loved it here. The set up is kinda like subway when adding toppings to your tacos but everything is fresh and tastes delicious."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVNzVQdDhnRRAB",
            "text": "This is a hidden gem! Incredibly welcoming environment by the staff and high quality authentic Mexican food. They make every plate with quality and taste in mind. Highly recommend giving this hidden gem a try!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3N0o2bjNnRRAB",
            "text": "Best Mexican restaurant around, delicious food and gentle service..."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNcXFEMkR3EAE",
            "text": "Amazing Mexican food... I get huevos rancheros regularly, it’s a filling, tasty and inexpensive breakfast. Also the tacos are great. Nice employees. Highly recommend."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcF9XRjB3RRAB",
            "text": "Mexican food with a no. Frills environment. I enjoyed the chicken and steak tacos although the meat was a bit dry. Could also use more sauce.\nOverall though pretty good food."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNM2FqQVlnEAE",
            "text": "First time visiting here was a good experience, nice staff and great food. Try the chicken and cheese quesadilla with some nachos great in my opinion."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNd3NMUTd3RRAB",
            "text": "It was good to find this place open that late @ night  and to take a chance to try their food, I order 3 sets of tacos supposedly  at $8.95 for 3 tacos but I end up paying $3.50separately for each taco it was good food, but to pricy their natural fresh squeeze juice is amazing."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0dE9YYldnEAE",
            "text": "Nothing special, it's another Mexican restaurant.  Spicy pork is probably the best tasting.  Beef and steak is too tough."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcWVDdHlnRRAB",
            "text": "You got to love this place... BEST MEXICAN FOOD AROUND, super clean and excellent costumer service .. I want to give them 6 stars ✨"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3Z3J5WE53EAE",
            "text": "Exelent food, fresh, clean, unique flavor,\nVery good mexican food, cook by exelent mexican cheef , very good tacos, and i know he has moch more to offer. Come and try this delicious food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvZ0lIQjlBRRAB",
            "text": "Great food with good portions, have never been dissapointed here."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRN2NLSUpnEAE",
            "text": "Good service, and the food is fresh pretty much all the time."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3cUwtSkF3EAE",
            "text": "Tortas de rez are the best here. Chicken is dry but everything else is great."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJaGE2bTFBRRAB",
            "text": "My favorite local Mexican spot, plenty of fixins, everything fresh, super friendly."
        }
    ],
    "reviews_count": 62
}