{
    "name": "Ocean Prime, Bar and Restaurant",
    "place_id": "ChIJ43VTtJdfwokRPOElamTIwro",
    "grid": "QN5",
    "address": "64-14 Flushing Ave, Maspeth, NY 11378, USA",
    "rating": 4.4,
    "user_ratings_total": 74,
    "phone_number": "(718) 326-3707",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdmVHSkJaVkJNYTNsZmRqZExaRWxWTUVOWWMxRRAB",
            "text": "First time for a fundraiser. The food was excellence The staff was friendly and\naccommodating."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wYU9WZDJVM0Y2Y1U1eFlVOXNjSFJrY1RGQlNVRRAB",
            "text": "Starting off the calamari was good. The rest of the food I got which was the salmon, mac n cheese with grilled chicken, tacos, and mozzarella sticks all tasted frozen/premade. It felt like I was eating out of a diner. It was disappointing to taste and know everything wasn’t cooked to order."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kd2EydE1VbEZpYUdKYWNsUlBWVEZoTUdKUFZrRRAB",
            "text": "The experience was a amazing our waiter was so nice to us the food was amazing high recommend the service was amazing and they have a lot of foods options and I will be coming back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOalJtaGtPR3A2ZGxVNVVXNUNRWHB3VldWTWEwRRAB",
            "text": "Good neighborhood bar for drinks"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUlVIRjRiVjk2ZVZOV1ZYVkpVbU5vVmtWRFJGRRAB",
            "text": "Eva (Ewa) was the best!!! The people were friendly. The food was good. ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214U1YwZHBkV3BNVkZwbGR6STNVMEYyV2xGYVdWRRAB",
            "text": "Love this place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVC1xX2VHbFlpXzVBRRAB",
            "text": "The food is amazing the service is amazing one of the best places to go"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMM2pvNEhmamRhYkVBEAE",
            "text": "Choose to eat here for mothers day and was very surprised on how good the food was service was excellent and very clean so we decided on returning for father's day and we had another excellent meal from the filet of sole to the steak and pork chops  appetizers and side dishes were a+ highly recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPN011ZWk5ellheFhnEAE",
            "text": "Great food, better service. Karaoke nights on Friday are fun. DJs on Saturday. Always a good time"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMX2Zfak53EAE",
            "text": "Good food.  A nice evening hangout."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdUlpOG5BRRAB",
            "text": "The service was very nice . But the wings were not flavorful. Only the garlic and Parmesan flavoring on the wings made them better . The garlic bread was not fully covered in butter or garlic sauce. The chicken frances was good and flavorful. The salmon was also prepared well . The sides were good. I had the sauteed mixed vegetables.  The baked potato was a little under cooked."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMEsyZGV3EAE",
            "text": "If you’re looking for a burger or steak, chicken or salmon they have it all and more! Brunch on Saturday & Sunday is delightfully delicious!😋 Our server was attentive and pleasant and the owner is nice too!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRb2FmYnNRRRAB",
            "text": "great"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwM2QzQXRnRRAB",
            "text": "I wouldn't eat here personally but it's fine for a pint in the neighborhood."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMnY3WnVRRRAB",
            "text": "Didn't eat just a few drinks.  Fun atmosphere fantastic staff.  Very attentive and friendly."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcEl2bWhnRRAB",
            "text": "I was there for Christmas Day and they had a fixed menu and the food was awesome. Our bartender EVA was one of the best! She is attentive, kind and engaging to all her customers. She is 5 star. Thank you for having such a good bartender."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2N1k3OHR3RRAB",
            "text": "Wings are super meaty. Very friendly staff. First time there and they made me feel like a regular."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OWVQcHhRRRAB",
            "text": "The food was great very flavorful!! Waitress was very nice!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2N05DTGVnEAE",
            "text": "Local pub,  with local pub feel. Had our holiday party here. Food was ok,  bar service was attentive and fast. Prices for drinks seem high for Queens but for a once in a while place it wasn't so bad."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeDlpdHlnRRAB",
            "text": "Arrived from Florida and my family took me to New York.This place was excellent had a great time."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQc1pEaFVREAE",
            "text": "Ever was the best!!!!!!!!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaDdMZXlBRRAB",
            "text": "We just celebrated my cousin’s 50th birthday this weekend at Ocean Prime bar and restaurant. The owner was super nice and the waitresses and bartenders were also great. The food was great. The atmosphere was great. I would definitely recommend this place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOGRLMTNRRRAB",
            "text": "Great neighborhood place. Left my house and just ran into this place. Best mistake ever.  Cool people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbzdUNlNBEAE",
            "text": "We just had a baby shower and the food and staff were fantastic! We highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueGN2S3BRRRAB",
            "text": "Mel was awesome last night! Love her"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIanYyYXRRRRAB",
            "text": "We experienced an amazing friendly service. The food is really generous and is more than enough. Definitely worth a visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dDQ2TFlBEAE",
            "text": "2 for 1 dinner special on Tuesday is excellent. Jose the manager is great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOGNtWkVnEAE",
            "text": "I ordered from Ocean Prime in Maspeth for the first time today; I ordered the lamb shank and wow, it was so delicious!  Everything was perfect including the sides.  I will definitely be ordering again.  Thanks to the chef!  Linda"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiazVEOTB3RRAB",
            "text": "Célebre los 15 de mi niña en una atmósfera muy agradable, buena atención, que incluía bebidas y buena comida, siempre estaban pendiente de que a los invitados no les falten nada, los precios son muy razonables.las bebidas y alcohol son ilimitados por 4 horas.\nEl señor Jose fue muy amable y siempre colaboró en todo. Muchas gracias por todo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOXZMMHh3RRAB",
            "text": "Great Sunday brunch. 💜…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeExIMjdBRRAB",
            "text": "You have to try their pasta. Amazing! really good drinks also! And good service. Our favorite bar at the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybktIZE53EAE",
            "text": "Food was ok."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaDlhcnR3RRAB",
            "text": "Muy agradable lugar, y una mención especial a la camarera EVA, super atenta y agradable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMbElDN1BREAE",
            "text": "This is a great spot either for a drink/beer or a good meal, I come here with the boys often to hang and chill here. Very friendly and laid back atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6djhDWDNRRRAB",
            "text": "Used to be my go.to.local.spot but something changed in last few months . Went on a Tuesday night and the bartender was rude to me after I paid check and seemed dissatisfied with tip I left but I base my gratuity on service and service was bad. Aside from undercooked wings the bartender was drunk and sloppy and complained that I should tip more for the buyback she gave me but failed to mention her bad attitude and lacking service . I remember when this was a fun place when Pat used to work here and the tall guy whos name I forgot but now it seems to be going in another direction,as will I when I wanna have a fun time !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMXIyaXVnRRAB",
            "text": "I’m dying to go back. Hopefully it’s as good as Peggy Dempseys demonstrated. The pics look great and family friends keep telling me it’s tons of fun. I miss it (trivia Wednesday?) (:"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbklPZEpREAE",
            "text": "The owners/staff were very nice and personable.  Would definitely go here again if in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsOEtLSjFnRRAB",
            "text": "EXCELLENT CURRY CHICKEN & CURRY GOAT\n\nEXCELLENT CARROT PUNCH & PEANUT PUNCH"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacmJhVXdRRRAB",
            "text": "Place looks nice from the outside but inside very old and outdated. The bar area is very loud and small. The outside is  old and creepy looking. Food and service was good but because it is not a pleasant place to sit in and enjoy hour meal and drink I wouldn't recommend ro go there. I been once and more than likely I will not be returning."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdnRMRllREAE",
            "text": "Excelente lugar con un ambiente agradable ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdmRpMUFnEAE",
            "text": "used to be called Peggy Dempsey from what I noticed they just changed the name, because food was still good,same menu I've been coming here for 10 years now never had a complaints"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcGQtY2R3EAE",
            "text": "Good spot to enjoy a Beer and some quick food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKamQtVjlnRRAB",
            "text": "Pasquale was the best waiter!! Wonderful experience. Drinks are amazing and vibes were immaculate!! Definitely will come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbmNxWnNnRRAB",
            "text": "Great place for parties, very nice and cooperative manager, helps you to organize everything, tasty food and  drinks, good prices"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSLTRuUWlBRRAB",
            "text": "Great Bar tender\nGreat atmosphere\nGreat Food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMThyR2pnRRAB",
            "text": "This place is in the come up since it's new owner took over.\nI was there last Thursday and to my surprised, the now have after work Thursdays!!  Which included amazing happy hour drink specials, discounted drink and food for city workers and ladies are welcomed with a free apple martini and a rose!!. The best part was the free entertainment! Live DJ and there was a Prince impersonator! The drinks were great and best and freshest home made guacamole and chips I ever had! My burger was done the way I asked!\nI defenitly recommend giving this place a shot. Check them out Thursdays !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobHB6S2NnEAE",
            "text": "Don't waste your time"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobG9uWUdnEAE",
            "text": "Service wasn't that great. Worst calamari I've ever tasted ..wings were hard 😪…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNoeG9KcRAB",
            "text": "I’ve been here years ago, nothing special, good solid pub food. I went last night for first time in years since they  updated place “ Ocean prime”  I enjoy multi courses, and I like them to come as expected, when I’m FINISHED with a course, the next one comes ( I have no problem waiting). Onion Soup, 6Pc wings, Lamb Shank.  When I placed my order I SPECIFICALLY stated twice, “ PLEASE make sure not to bring more than one course at a time. I don’t like cold food, and I don’t want to rush so it’s hot”. He acknowledged my request, said he unoand agreed, and would make sure it wouldn’t happen.  I waited 25 Min for the most watery flavored Onion Soup I’ve ever had. Then shortly after I was finished came the lamb shank AND the cold wings. The shank was wonderful, very small by restaurant standards. I told the waiter I didn’t want all to come at same time . He said “ that’s how the chef does it “  there  was one other table of 2  dining whose order was messed up as the waiter was explaining to other customer.\nA Friday night at 8pm this is how the kitchen. Runs ?? Was he in a hurry to go home . They were also out of the S’mores desert I requested. For a new place to be so laxidazy, is dangerous at best.  Employees should realize, they’re lack of desire to do they’re best, chases customers away, this cancer also gets people laid off, and eventually, this could result in it going back to a pub menu. Disappointed and a waste of $60 w tip. Don’t punish your waiter in such circumstances, they have no control over temperament or laziness of the kitchen"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCb29meWhBRRAB",
            "text": "I had my first Ocean experience yesterday. It will not be my last! Nicely appointed dining room, cozy bar, great food and excellent service. Shout out to Jose and John!"
        }
    ],
    "reviews_count": 50
}