{
    "name": "Joe's Pizza Ridgewood",
    "place_id": "ChIJ7XYBGZ1ewokRHK2Xx3XD44A",
    "grid": "QN5",
    "address": "66-53 Forest Ave, Ridgewood, NY 11385, USA",
    "rating": 4.7,
    "user_ratings_total": 43,
    "phone_number": "(347) 457-5335",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNFZXRnBTVVJzYjJzd2ExZEdjWEJpY1hwbk5sRRAB",
            "text": "The Sicilian pie was awesome. My friends loved it. Everything I get here tastes amazing. Good service."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMmZmZEp3EAE",
            "text": "Joe’s has the most bomb Margherita slice. It’s a must-try. I was lucky to get one fresh out of the oven last week and it was a divine revelation. But even the reheated slices are crazy delicious. Always friendly and kind service too. Love Joe’s!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MGREZ3dkVmRyWnpkV05GSmhOWGR2TWtOQmMwRRAB",
            "text": "The food here is consistent and tastes like it’s made with care, even if it’s not the most extraordinary thing you’ll ever try. The atmosphere feels casual and could use a little more warmth, but it works fine whether you’re alone, with friends, or in a larger group. Service isn’t perfect, yet it gets the job done. Overall, it’s the kind of spot you can count on when you just want a satisfying meal without overthinking it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVFFUQTNlRlZZZUhsUGNEZzJTMUF4ZERsS2FrRRAB",
            "text": "The perfect local pizza spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTGFFOTNUWEJ1V25aMGFuQTBjVWxaTTE5WU9YYxAB",
            "text": "Great pizza as well as the customer service. Highly recommend 🙌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweExUUlJSMUU0YkZrd2IwNVBNVTFLYTBSUmRXYxAB",
            "text": "Good pizza"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMlVVdDJiR1JPUzFoSmJXaFpXSGhwTFRCM1psRRAB",
            "text": "Amazing pizza."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWlZsSjJiMlJaVGxnd2RETTJhbWg1VFZWNU0zYxAB",
            "text": "Lovely classic NY pizzeria. I take my to boys to eat there often. I want them to feel what a real pizzeria looked and felt like.  With a taste of Goodfellas. Thanks Joe!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnM1JGZzVjWHAyYVZkclZtcHNkell4ZDFvNU9YYxAB",
            "text": "Solid slice"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUGVVRmFla1JDVlRkSmIwRnZNazUwT1dGRmVrRRAB",
            "text": "I popped in for a slice and overheard the owner talking to a customer. He mentioned he makes everything from scratch and the time he puts into everything and I got excited. I took my first bite and it did that thing where it seemingly evaporated in my mouth, next thing I knew the slice was gone! It was so good I figured I'd roll the dice on a sausage and peppers, this man is doing sausage and peppers on garlic bread! He needs to be stopped, but not until I go back for another slice and a meatball hero! Bless this place!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOeTVnLV9CeDQ3cEhBEAE",
            "text": "Count your change and check your order before leaving"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeDhhLWNnEAE",
            "text": "Burrata grandma slices and garlic knots are exceptional. Fantastic slice stop."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ai0tUnpnRRAB",
            "text": "Great guys and even better pizza! So happy to have this place open around the corner. Ordered four large pies for a party and got service with a smile. Everyone complimented the food! 10/10"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3Mk51MExREAE",
            "text": "Look, I love all kinds of pizza…even the questionable, regret-it-later kind. It’s all about the mood. But this? This tastes like someone found an old can of oil in their grandma’s basement and said, ‘Yeah, let’s use this!’\nThe dough? Let’s just say I’ve had dollar slices that put this to shame. And for the price? The cheezy decor and overall vibe just make the whole experience even more confusing. It’s like they’re trying really hard to be cool like jersey shore cool (NOT), but the pizza just isn’t in on the plan\nI highly recommend the diet coke its very cold and crispy!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRb2FTc25nRRAB",
            "text": "A cozy family friendly pizzeria with amazing pizza choices and excellent friendly service.\n\nMust try!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN01pbjZRRRAB",
            "text": "Excellent pizza\nBest in neighborhood 😁"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbWNQYURREAE",
            "text": "The grandma vodka was crazy good!!! And the staff is the best!!\nFrom now on, this is the only place I'll get my pizza!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBaV9LOXdRRRAB",
            "text": "It’s good to have this back in the neighborhood. Some of the better pizza in the area"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOXBUaURREAE",
            "text": "I got a prosciutto sandwich, it was hella delicious. I could easily eat 2, hahahah. My palate says, \"Thank you!\""
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaG9DUlZ3EAE",
            "text": "Great classic and square slices!! Nice owners"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOTV5LUlREAE",
            "text": "Forest now has two solid pizza spots.  Joe’s has unique slices like thick sliced with actual pieces of burrata or the “MVP” (marinara, vodka and pesto and an eggplant parm slice that was dope.  Definitely stop by, good prices and nice space with some interesting ambiance like the old school Pizza Hut light fixture."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmLS1EOS13RRAB",
            "text": "Walked in on a blustery day and the eggplant slice—which at $5.50 came fully loaded with eggplant, cheese, and crushed tomato—warmed my soul. I had to add some chili flakes, of course. Very friendly staff. I'll definitely be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmci1Ec093EAE",
            "text": "Really delicious pizza and reasonably priced. I love Joe's Restaurant so much, so I  had been looking forward to this location reopening. It's as good as I'd been hoping for, and I'm looking forward to this becoming my new local slice shop. Really friendly service, too, which I always appreciate. Can't wait to see what's in store."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aWVPR1d3EAE",
            "text": "The pizza is amazing! It was crispy and had amazing flavors . They don’t do delivery’s yet however I would completely recommend to go eat here. They’re very nice and overall a great place to eat :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQb2VtZHNnRRAB",
            "text": "Amazing pizza place!! I love their buffalo chicken pizza 9/10. The music made the restaurant 10/10"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQN1lXbzRBRRAB",
            "text": "Honestly I just stopped in for a quick slice and the service was so friendly and the grandmas slice was delicious! I’ll be back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcmRMNm53RRAB",
            "text": "Everything you want in a pie. They may have just opened, but they’ve certainly been making pies for a while."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQZ1lPeWlBRRAB",
            "text": "Delicious and very friendly! I’ve been so excited for a new pizza spot in the neighborhood, and these thick delicious grandma slices are a great addition to Forest Ave."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQX3VTaXdnRRAB",
            "text": "No better or worse than any other pizzeria in Queens."
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBeXBtbEJBEAE",
            "text": "Just great"
        }
    ],
    "reviews_count": 30
}