{
    "name": "Velma",
    "place_id": "ChIJl-QwDnxdwokRUoS7oTlwK0Q",
    "grid": "QN5",
    "address": "5-84 Seneca Ave, Queens, NY 11385, USA",
    "rating": 4.5,
    "user_ratings_total": 143,
    "phone_number": "(347) 798-4303",
    "reviews": [
        {
            "date": "수정일: 2일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMVVFRkRja0ZoWjBGdWQwbHlSemxDUldGeVRsRRAB",
            "text": "Excelente  restaurante  y buen servicio"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bmJ5MUdWMkkyTUc0Mk1HMXNMV1JPTlZZMmRGRRAB",
            "text": "Very sad to say that this place has seen better days. I will never be ordering from here again the food was not only lackluster in flavor but quality as well. I’ve eaten from here before, twice and both takeout, I don’t know what happened but the spicy vodka pasta which has been delicious in the past was hard and inconsistent in texture while lacking flavor it also tasted old. The mussels, which I was most excited about, were so spicy that I could not even bare to take more than three bites. I am no stranger to spice I love it on and in everything but this felt like the kind of spice you spill everywhere to compensate for an overall bad sauce. I actually had to try and add tomato purée to quell the spice so that I could taste the sauce even for a second but that did absolutely nothing. The pasta for this dish was 4 dollars extra and I even asked twice if they had it down but they still gave me the wrong pasta which was annoying but fine until I tasted the dish and realized it was inedible and also had a weird aftertaste once the spice subsided. The calamari was fine but rubbery and didn’t really carry much to it, I would buy this from a more modest place for half the price and would probably be more satisfied to be completely honest. When I called back to let them know that at the very least they got my order wrong the phone would not pick up and the voicemail was full. It felt like an utter scam tbh and for 60 dollars this was not worth my money and really was disappointing."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaclpHMWtTRGgxWjJsRGJtRXdiek5RU0ZoRVNHYxAB",
            "text": "El personal muy amable y la comida  y bebidas muy buenas, regresaré definitivamente."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twM1VIUXhTVU5XVTNadVJHUjJkVEpuU2tsQ1JtYxAB",
            "text": "5star food and service. Amy, our server was amazing! We will be coming back! Great spot in Ridgewood!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabVpqaHNha1JhZEc1T1RUVjRUV1ZyTW0wNGFtYxAB",
            "text": "Velma is one of my favorite places in the city. Sit at the bar for happy hour and you won’t regret it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJdm80OVBPaHRqbm9BRRAB",
            "text": "Great service, nice space. Food was not good though. Doesn’t justify the higher prices. Plenty of other great Italian joints around."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbTc4Sm5rOEktU0hnEAE",
            "text": "Great neighborhood joint with awesome food and good vibes"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOZmN1NWExa0ozTWxBRRAB",
            "text": "Listen babe just do yourself a favor and bring yourself and whoever is special to you to this restaurant! From the vibe to the food to the staff - all is a 10/10! Thank me later 😘"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaWRHdEV3EAE",
            "text": "Chicken was super dry. Like paper. I had to spit it out."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NDlYTWZnEAE",
            "text": "I love Velma, the food is delicious and the atmosphere is always welcoming.  The service is great and it always feels like home.  This is what a neighborhood spot should be like.  It's hard to find a restaurant that serves pizza by the slice these days and their grandma is my go to!  Thanks Velma!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ajZpa0tREAE",
            "text": "VELMA’S IS GRRREAT. Pasta is perfectly Al dente and the Velma salad is PERFECTION. I’m a sucker for a good vinaigrette and the lemon vinaigrette here is so refreshing and has this super lemony goodness. Love love love it here. Will be back, highly recommend!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbTd6ZWRBEAE",
            "text": "UPDATE- I gave this place five stars last year. It was so good but I don’t know what happened. The chicken parm isn’t the same, the pasta is flavorless, even the specials are just not good. They said they didn’t change chef’s but then they must gave changed recipes or are doing cost cutting because it is not the same and the food has gone downhill big time. Such a shame and bummer. Went from awesome neighborhood gem to basic pizzeria takeout food.\n\nOriginal review- now the chicken parm stinks.\n\nA nice neighborhood gem. Friendly staff, good food. I really enjoyed their chicken parm special with hot cherry peppers. Low key, tasty, welcoming. I will go back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOW9qQmR3EAE",
            "text": "Love this place! Everything from the ambiance, drinks, food, and service is amazing here. Our bartender, Joe, was so nice and attentive. Definitely a new favorite, and will be coming back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NmFtQ0F3EAE",
            "text": "Great atmosphere, great food. Friendly staff. Visiting from out of town,  we'll be back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNlpxUWpRRRAB",
            "text": "Pork chops with mushrooms ⭐️⭐️⭐️⭐️⭐️ insanely delicious. Nice vibes, great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbk9Dd2FBEAE",
            "text": "Dined here with a friend and my toddler son.  The food was delicious, flavors were great. The service was equally great. I would definitely go back to eat there again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbk16OUVREAE",
            "text": "Pasta is cooked perfectly. Not sure what happened to the portions? I think this was 16 before tip."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuZ09fUkJnEAE",
            "text": "Walked in with a friend on Friday night for dinner. It was busy but they were able to seat us quickly.\n\nBeautiful space. A lot of thought and intentionality was put into the flow of the space, with different types of seating and an “m” shaped bar which is a welcome alternative that allows the flow of people to be uninterrupted when people gather, and gives good visual space markers between the bar area and table area. Decor is cute, and with old italian style red checkered table clothes with paper on tol, lots of deep greens and great use of texture in the space. Behind the bar is reminiscent of scorpion records but organized, with old license plates, trucker hats and electicisms.\n\nGood wine list, and drinks are appropriately priced for the neighborhood.\n\nMy friend and I ordered meatballs, the velma salad, and the vodka lumache. Meatballs were excellent, exactly what we were looking for- great texture, excellent slightly spicy and appropriately salted meat, and classic red sauce that makes you want to lick the dish. Bread with meatballs was perfect for the dish. The velma salad was ok- it could have been either better dressed or just salted before tossing for better flavor. The spicy vodka lumache was good- but not a pasta I would order again. It wasn’t particularly spicy nor did it have the creamy classic vodka sauce taste. Still, the flavor was good, just not what we expected. Pasta was cooked perfectly al-dente. I would definitely order the meatballs again.\n\nOverall, great atmosphere and good experience. Will be back to try their other offerings"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIb3BHYXFnRRAB",
            "text": "Everything about this place is great, highly recommended!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIM0tXS3ZBRRAB",
            "text": "Space nice. Staff friendly and helpful. Service quick. Drinks yum. Food mid.\n\nGood portions for the price, but I honestly could've made a better bolognese from a jar. Severely underseasoned. Also tried my friend's parm, which was slightly better, but not $30 good (not that I'm complaining about the prices, cause you do get a decent amount of food).\n\nAlso a little heavy handed with the parmesan. I tasted nothing but that across the 3 dishes I tried. Should be optional.\n\nI really really wanted to love Velma. It's conveniently located, and I do like everything else about it, but I don't think I would return for the food. There are better options.\n\n3-star, but +1 for the good service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdGVuZHVBRRAB",
            "text": "Hands down one of the best places in the neighborhood! From the pasta, drinks and services, everything is Sooo Good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieXRTa3pnRRAB",
            "text": "Solid! Cute ambiance"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiM09IS0ZBEAE",
            "text": "It’s a really cute restaurant with really good food! The martini was great and it was a cool presentation- just wish it was colder overall. Regardless it was still one of the best martinis I’ve had aside fro Cozy royals and the food was delicious. Glad we came, definitely  coming back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeXIzNHZ3RRAB",
            "text": "My partner and I went for dinner date night at Velma on a Monday night and we were pleasantly surprised at how busy the restaurant was. From the start the hostess was super friendly and welcoming. She told us about the specials for the evening and was also very attentive and helped us decide on so many delicious options. We decided on Mandoline Salad 😋👌, pear and Prosciutto appatizer, meatballs ✨️🤯, pork chops and the Square Vodka Pie (bring friends for the pizza pie it's huge!). Portions for the main dishes are definitely for two. I can't wait to go back for their other mains and specials. Their Happy Hour is great too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMazhlWTR3RRAB",
            "text": "Such a good time. Best martini I’ve had in forever. Chicken nuggets as a bar snack is genius!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcFpqbmFBEAE",
            "text": "I don't know what happened, but our food tasted really bad. The Vodka sauce was oily and tasted like it wasn't seasoned, and the chicken parm was so garlicky. There were big pieces of garlic just thrown in and there was 7 of them. Also the chicken tasted like it was reheated."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6OC1xV3hBRRAB",
            "text": "The food was decent. I was a bit disappointed in the bar since I ordered a Moscow Mule (a basic for bars) and they couldn't accommodate me. Also, the booths are super uncomfortable and higher than the chairs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeDdYMTJ3RRAB",
            "text": "We are new to Ridgewood and this has already become one of our favorite spots. The food, atmosphere and service is exactly what you want.\nWe have never had a bad dish or a bad experience.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN0l1V0VREAE",
            "text": "Over cooked burgers and staff that seemed like they wanted us to leave immediately."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUOUlla1V3EAE",
            "text": "Nice place, good italian / american food. Wine is nice too :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd09mNVVREAE",
            "text": "The burger is one the best I’ve had in the city. We are new to the neighborhood so we decided to give this place a try. Not disappointed in any way. Everything was fantastic, will be back very soon. Just wish they were open later!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqamFfWWZnEAE",
            "text": "Great vibe, fresh food, good times"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqM0lXWnp3RRAB",
            "text": "Overpriced and out of touch with the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENXJ2VHJ3RRAB",
            "text": "YUM! Great vibe, solid food. Must get the tiramisu!! The fried calamari was also a fave!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMnQtalpnEAE",
            "text": "The only thing I liked was the Mcdonalds Chicken nuggets. Its got a nice ambiance. The pizza was whatever and the pasta was mehh. Spent over $150 for 2 people. Its a shame because I love Gordos cantino, there Mexican food is a 5/5."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNka3Y2OFlREAE",
            "text": "Love this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0b1pHZFhnEAE",
            "text": "The staff was wonderful! The food was just ok. The pasta we had : 1 had a spicy sauce which was unexpected and the other was under cooked. Pizza was just ok.\nThe bathroom decor was naked lady posters on the wall. So just FYI before you go there if that bothers you or if you have kids."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOMnNYNFdnEAE",
            "text": "The bartender is knowledgeable and very friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNON05tWlBREAE",
            "text": "Been here twice now. Both times I thought the food was almost disgusting. Caesar salad with fried, oily, dark meat chicken. And the pizza is so doughy and cheesy and thick. Not your typical NY style. But most outrageous are the prices. Two of us- we shared one pizza, one appetizer, and each got one drink. $85. So many better pizza and Italian places in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxM3NDZVhBEAE",
            "text": "Really great place with excellent food, very good and fresh casual Italian in an unpretentious spot.  Service also super good and friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNWZLbm1RRRAB",
            "text": "Grandma pie is super tasty 🤤 - very cozy spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcGNuV1B3EAE",
            "text": "I love everyone here. They always strive to make it a fun time. Fresh menu items regularly and a very comfortable hang out spot."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwa2R6aEhnEAE",
            "text": "Super nice location. The staff is very welcoming, the food is excellent. Especially on Sundays the Sunday sauce is highly recommended! There is also a pool table. Prices are quite moderate. Has the vibe of a very nice local bar!\nWe also had the deep fried calamari which are a great shared appetizer. The salads are a joy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGX3JuV0hBEAE",
            "text": "Had an early dinner with my wife and baby and got their special 32oz NY strip. It was legitimately one of the best steaks I had ever had in my life. Perfectly cooked, beautifully seasoned, incredible crust, and 1/2 the price you would pay at a steakhouse. The Velma salad was also super tasty and had a generous amount of pistachios.\n\nThe music and ambiance were great and the service was super friendly which I really appreciate."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1cHJiSmVnEAE",
            "text": "Greatest pizza and all kind of food, the environment is super cool, and amazing service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1MHFPX3VRRRAB",
            "text": "A warm family spot with spectacular homemade dishes, apps, salads and pies . Pizza pies!!! Farm to table food. The drinks are great! Staff even better, and the atmosphere is always welcoming. Great for date night too! Love this spot very much. #aroundridgewood #jnyc"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1X0lEUHVBRRAB",
            "text": "Dank music and pasta"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaalpqNkNnEAE",
            "text": "A great time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaEs3amhRRRAB",
            "text": "Get the pizza - don’t waste your time on anything else"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cE0zTFh3EAE",
            "text": "Nothing special. Average food. Average drinks. Nothing to rave about . Completely over priced. Decor is nice. Staff is cool.\n….\nSuper mediocre. Many more spots locally that you can go, spend the same amount and have a better meal / experience.\nGlad I was able to check them out, but wouldn’t recommend it to anyone.\nFor the price you’re paying you’re expecting something above average, guess my expectations weren’t met."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4N3Nxb1RBEAE",
            "text": "Velma was named as one of the best bars & restaurants in NYC this year. We visited last weekend since we heard about their Sunday Special and we love limited offers.\n\nWe are not fans of alcohol but Velma is signature as a bar so we gave it a try. Tom Collins used Gin as base & Mai Tai used Rum and both cocktails were refreshing and tasty.\n\nWe got their Shrimp Oreganata, Spicy Vodka Lumache, Velma’s Juicy Chicken and Sunday Sauce. Sunday Sauce was their Sunday Special Menu and it was extremely satisfying with its portion. However our favorite was the Lumache since the sauce was appetizing and flavorful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4X3JTTlB3EAE",
            "text": "It's definitely the place with its unique vibe and atmosphere that entices you to be back again, and I will, as the food is delicious, comes in nice portions and is fairly priced. The service is fast, and there's no point in being disappointed with this place! Tried so far 3 of their pizzas 🍕- all were yummy 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aGRXTlNREAE",
            "text": "Solid Italian-American fare. Great pizza, especially the Vodkaroni, a square vodka sauce pepperoni pizza. Cocktails are simple and well executed. Have been here several times and will continue to patronize it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMmZHSGFREAE",
            "text": "Fantastic food, service and atmosphere. Great place for a date night or out with the kids. We ordered the Vodkaroni Sicilian pizza (square) and it was huge. 8 standard size square slices. I'm eating leftovers as I type this. The baked clams were small but so delicious. Cocktails were also done right. 5 stars! Loved it and will definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaHN5UmJREAE",
            "text": "Was in the neighborhood and decided to stop in for lunch. Loved it 😍 from the caprice stack to the funghi. Excellent!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobjlMOVJBEAE",
            "text": "We managed to grab two seats at the bar during a busy Friday evening and had a blast. Grandma pizza is HUGE (we should’ve just ordered slices) but not complaining because it was delicious—super garlicky and I even ate the crust (I usually hate crust). Friendly service and best of all GLASS BOTTLE COKES!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKb2ZfNXRRRRAB",
            "text": "I don't write reviews, I'll usually just recommend places I like via word of mouth but I had to write this. I dropped in here on a whim to grab a drink and maybe a slice. After checking out the menu and being told about a meatball special I ordered that and a side of broccoli rabe and fingerling potatoes. This was on of the best meals, I have had in a long, long time. The meatballs and marinara were perfect, the broccoli rabe had the perfect flavor and texture, (not overcooked) as did the potatoes. Everything complimented each other in the best possible way. It was simple perfection. I can't wait to try their other offerings when I return."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSek8tMjJ3RRAB",
            "text": "Pretty classic Italian with a flair of artsy hipster.\n\nThe back room is very cozy and the front bar feels like a nice blend of casual and classy.\n\nThe bar itself has several really cool bump outs so if you get the right spot you can actually hang out at the bar with more than just the people next to you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobWVicnpnRRAB",
            "text": "My boyfriend and I shared the spicy rigatoni and chicken parm. Great food and service!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodnUyeDVRRRAB",
            "text": "The amount of times I’ve come here with my husband and friends it’s wildly insane, since this place opened, you guys it never fails! I adore the lemon pasta! It’s so creamy and delicious, the grandpa pizza it’s outstanding and the white wine from Baja California perfect with it!\n\nIt’s such a cool addition to the neighborhood. Thank you!!! For this♥️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMXNhOGN3EAE",
            "text": "Cool place, but not real Italian food at all. Just regular pizza how us Napolitans do. The ingredients nothing special forgetitboutit. For their prices they don't have any good products they use.  From what it looks like place was opened up by midwesterns or some weird people like that that just came in the neighborhood yesterday. You know those pronouns people."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoLS1iczR3RRAB",
            "text": "Giving two stars, never like giving a bad review but feel really disheartened. Walked by this place a number of times and decided to do takeout before going in for dinner. Don’t think I’ll be doing that now. Shrimp oregenatta was overpriced and chewy. Rigatoni was another carbone knock off. Small portions and food came cold."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCODZ1Y3B3RRAB",
            "text": "Great new spot, excellent service even on opening weekend. Classic decor, and there's a full bar and pool table. Sandwiches are huge (loved the Pauleen) and they have combo food/drink deals on slices or nuggets"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMjg2dG9RRRAB",
            "text": "The food is great, and the drinks are strong! Amazing service, and great staff! Perfect date spot, I’ve scored with 100% of the tinder dates I’ve brought here! And the prices are budget friendly. Love this place, it’s my new spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M191czNRRRAB",
            "text": "Ordered a $17 antipasta salad. When it came out, the greens were soggy and it had about two salami slices in it, shredded up. A paltry amount for the price. Google antipasta salad. Everything on the menu is a rip off. People go here because the vibe is cool and retro with nice lighting and I get it. But please see when you are being scammed. There are better places with better food around."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcTZDX0lREAE",
            "text": "Opened by the chef behind Twice Michelin guide listed Gordo’s. This time it’s an old school Italian masterpiece. Very homey feeling with delicious Italian food. Check out all the decor!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeWFIVlpnEAE",
            "text": "The food is incredible!  Old school Italian American vibes. Can’t go wrong with anything on the menu. Also great place for a group. Coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMmJuNVhnEAE",
            "text": "The spicy vodka lumache was very good with just the right amount of spicy. The staff were helpful and prompt. I wish portion size was larger."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdlAzRlBnEAE",
            "text": "Great food. Solid service. They have some great pizza, wings on Wednesday’s, and drinks to go with it all. Definitely one of the best spots in Ridgewood."
        }
    ],
    "reviews_count": 69
}