{
    "name": "Taqueria Kermes",
    "place_id": "ChIJd67JeYNewokRpDXPXwnV5uU",
    "grid": "QN5",
    "address": "66-36 Fresh Pond Rd, Ridgewood, NY 11385, USA",
    "rating": 4.4,
    "user_ratings_total": 539,
    "phone_number": "(347) 463-9263",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQ1RFY3haMVJrUVZSMFQwUnJhRGxQVEZsQ2VVRRAB",
            "text": "I love this place!!. Local gem. The food is great. The lady who I believe is the owner is always very sweet, she makes the best drinks too. Love thier micheladas."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SWFtUkNjMTlXU0hZNE9EQTJObFpoVTFwaVozYxAB",
            "text": "Finally I have a favorite place for tacos in Ridgewood! I have been meaning to come here for a while and after a doctors appointment I decided to pick up tacos for lunch. I got carne asada and carnitas tacos and they were sooooo delicious. I loved the tortillas. I got my food super fast and the people were really friendly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scWJUVktkSGhEZWxCTlJWVnBRaTB5VkZaME4wRRAB",
            "text": "Honestly the chicken pastor burrito is one of the best burritos I’ve ever eaten in my whole dang life. The joint is super cute and the staff is really sweet. 12/10 would stuff my gullet again."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYb08yWFZ3EAE",
            "text": "Great place delicious food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todFJWSXpaVFZrZGtoelZ6UndkV0ZaTUZOSlJtYxAB",
            "text": "We love this Mexican restaurant went for the first time and oh god the guacamole is made just in front of our table fresh and delicious, I ask for a fish burrito that it wasn’t on the menu and they made it! The hot sauce green and reed was tasty, we had beef quesadillas and plain quesadillas way good, also tried the mojitos great not to heavy on alcohol and refreshing! Definitely coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQmFrUXlRMHBsVlVKQ04yMDVVVVJUVFVwbldYYxAB",
            "text": "Steak burrito and steak tacos are amazing and cute backyard"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMFRUQmpjVlZ3UW1WaWVWTndjbFp3Vlhrd1lVRRAB",
            "text": "This place accepts orders from Door Dash when they're not open, and then they blame Door Dash for having the wrong hours (as if there's no way for a business to fix that). No apologies over the phone either, as it was all my fault for trying to place a $70 pickup order."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVU1tWm1ibGxsWVU1V1FVTktkelV0Ynpsb2JrRRAB",
            "text": "We came as a group, but they were very nice and seated all of us. Great food and good vibes after church! Make sure you have a chance to read everything before you order! They got a lot of good options."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcWJrdHZWMEo2TWxWRFJXcGFRMmQyUzA0eGFYYxAB",
            "text": "Okay I’m not gonna lie this place has good food and drinks. The issue is the high price. $24 dollars for a grilled chicken ceaser salad and $11 bucks for an agua Fresca where if you go all down Freshpound the other Mexican restaurants which are authentic and good as well sell the agua Fresca for $6 or so. It is outrageous considering that it caters to the ridgewood queens area. Their turning this into a white washed Mexican restaurant because they want the white people paying more."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPN3d3TW5laDVUbk5nEAE",
            "text": "Beautiful outdoor patio. Excellent cucumber margarita and fresh-made guacamole. Kind, welcoming, family-owned neighborhood spot. Always a treat to visit!!! 🌟"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJalFzTi1ac3EySWZnEAE",
            "text": "What a lovely little spot- so warm and welcoming and the food was absolutely fresh, delicious and generous in portions. The guacamole was outstanding served with warm (!!) lightly salted homemade chips. The service was delightful and we are so grateful for this establishment. Thank you!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMTFJ4dXU4ekxLSmxBRRAB",
            "text": "Food is average, could use better presentation and flavoring. Burrito was too mushy. When paying they add a processing fee and when I questioned I was told with an attitude that that is if I pay with credit card but that's not what the receipt says. While I was there other customers were returning food also, I couldn't finish my."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLTEo0OEhSZ3ZxYjBBRRAB",
            "text": "I've only ordered takeout from this longtime neighborhood favorite, but it never disappoints. I usually go for the tacos--they're a bit pricier now, but worth it. I was never a big fan of fish tacos until I tried their \"Baja\" fish taco; the crispy fried fish is so delicious! The crispy shrimp taco is also great, and the grilled steak taco is another solid choice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJUGhwYm00MHRXWTF3RRAB",
            "text": "The service here is fantastic food is great i recommend this place 100 percent for Mexican food absolutely love it"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKN3loZHVjNHRPRmdRRRAB",
            "text": "I’ve been coming here for years and it’s truly a hidden gem. One of the BEST taquerias in Queens. The food is always fresh, the staff is so kind helpful and overall the food just never disappoints. I’m so sad I moved out of Ridgewood, where I grew up and can no longer enjoy this food anytime I want. I still try to visit when I can, but I have a Taqueria Kermes sized hole in my heart 😫"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcVBpcXh3RRAB",
            "text": "They really need to fire her 2 teenagers in order to survive. They don't want to work, you have to walk over to the bar in order to get anyone's attention. You wait 15 min to get water even though there's only 2 other tables with people. Don't understand why keep them as servers when they obviously don't want to be there."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcTdTaEFREAE",
            "text": "My husband and I  have loved kermes since its very opening, a mainstay for every celebration or night where we just needed a good meal after a long day. We watched their family grow up in their restaurant,  the back yard expansion which is stunning and always enjoyed every single second of feeling like home the second we walked in. We have moved to a different state and this is our biggest miss. If you're not going here at all times you're missing out. The surf and turf tacos are the best tacos I have ever had in my life. And the churros.. we can not forget the churros!!!. We miss you Kermes!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbGRuazlnRRAB",
            "text": "Buen servicio, buenos tragos, buena comida,  pasé un rato muy agradable. La limpieza del lugar es impecable."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbGYzU0Z3EAE",
            "text": "This place has the best guac and chips. I’ve lost count of how many times I’ve eaten here and recommended it to friends & family. The birria tacos and drinks are great. Worth the price."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJd0xMR1JBEAE",
            "text": "Lousy atmosphere, crowded, items everywhere.  Staff never smiles.  So disappointed to see no skirt steak.  Ribeyes in a Mexican restaurant - not for me.  They don't know what hospitality means.  And no chips n salsa."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeDZhVGFnEAE",
            "text": "One of my regular spots for burritos as they are so good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaDhpZ2t3RRAB",
            "text": "Hole in a wall family taco spot\nDelicious carne asada & chicken al pastor tostadas"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNROElxNTBBRRAB",
            "text": "I don’t usually leave reviews, but this place was unbelievable"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBLU5ycUFnEAE",
            "text": "Been coming here for years and have never left disappointed. The food is phenomenal and leaves you satisfied every time. The family that owns this restaurant is a wonderful group of people and it’s amazing to see the entire family be part of running the operation. Highly recommend this spot for anyone in the area."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc0pHOXB3RRAB",
            "text": "Man I love the food here but they are trynna be a restaurant for real for real, and because of that they have a pricey menu. The tacos are great and I remember having the Camerones a la Diabla or something like that, also amazing. But over…"
        },
        {
            "date": "수정일: 10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJcnRtdmlBRRAB",
            "text": "Excellent tostada's and quesadillas"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M05XSUdBEAE",
            "text": "Genuinely think these are the best birria tacos in the city"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcHVmdVJBEAE",
            "text": "I get take out here often, and it's *always* been great. Staff is nice, service is quick, and food is the bomb.\n\nAlso one of the best burgers in Ridgewood, I swear!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYOGItOUVBEAE",
            "text": "Excellent frozen margarita 🤝…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNjRxblJnEAE",
            "text": "Great atmosphere, and the fresh guacamole was amazing!  It was made fresh at the table and our picky-eater could not get enough."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudi1xSjl3RRAB",
            "text": "Had a wonderful lunch here! Loved the fish tacos and queso fundido and had one of the best frozen margaritas I’ve had in awhile. Just excellent food and service ☺️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMzRQVm5nRRAB",
            "text": "Amazing Mexican restaurant. I’ve come here many times over the years and they consistently make delicious food at a fair price. Their filled Churros are the best I’ve ever had. Make sure to try those too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuckwta29RRRAB",
            "text": "We've been here sooooo many times at the recommendation of a coworker. Genuinely the food is amazing, the workers are so kind, and the atmosphere is great. I love the decorations they have inside. It's so cute. Personally, I get the crispy fish tacos and my boyfriend gets the birria (hands down the best birria) with the guacamole (which they make table side in the cutest little molcajete). Definite go to if we want Mexican food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aGVtZUV3EAE",
            "text": "Very friendly staff, the food is so tasty it never disappoints. The guac is prepared right in front of you so it doesn't get any fresher than that, the flavor is so well balanced you just want to keep eating..\n\nThe Best Mexican restaurant in the area!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNmQ2ZUhnEAE",
            "text": "Es espectacular la comida y todo las margaritas son las mejores. Lo super recomiendo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycHUyYUxnEAE",
            "text": "The owner and the cook are nice people, but it doesn’t matter when a rude girl serves the food.\nThe young girl attitude is terrible. We spent here so much money every time, but that was as too much when the server said “you’re welcome “ after we paid, instead of thank you! That is nonsense and more than rude.\nWe will never go back this place because of this girl."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlM3R6SUhnEAE",
            "text": "The food is great, the drinks are great, service impeccable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMaV9QZ0FREAE",
            "text": "terrible experience , young girl with glasses not welcoming at all had attitude the whole time i was there. Didnt serve water we had to ask about 10 minutes after being there and even then she gave an attitude about getting our waters . Even after the fact she still went to take other orders and ignore our request our water was served 5 minutes later  moral of the story do better taqueria kerme and get better caring employees"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaTlQUHJBRRAB",
            "text": "Service was horrible walked out before even getting served. Young girl with glasses unwelcoming , took our order without even asking what we wanted to drink after almost 10 minutes I called another server over to ask for water and she had an attitude!!! Yeah no I’m all about customer service and I experienced an F+. Side note after reading another review someone mentioned the same thing about place being unwelcoming….."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dnBlWXhBRRAB",
            "text": "Taqueria Kermes has always been my favorite Mom and Pop shop for a long time. I don’t live around the area but I am always craving their delicious food. Unfortunately, my recent experience wasn’t the best and I was very disappointed with the service. Our server, a Mexican woman with glasses, was not welcoming at all. She didn't smile and had a very bad attitude throughout our meal. This made the dining experience quite unpleasant. Let’s not to mention, she only brought out one meal for my boyfriend and I when we ordered two, as well as not cleaning up the table and picking up the empty glasses and plates when we were done with appetizers. I hope the management addresses this issue to ensure a better experience for future customers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OXBXYTZRRRAB",
            "text": "Overpriced. Small portions. Food tastes fine. Ordered nachos, very small, with barely any nachos. Asked for some extra chips since they were cheap on it giving 10 chips. They charged an extra 5$ for chips that should of came with the skimpy nachos. Take two, to-go trays, very tiny trays, had the nerve to charge .50 cents for each one."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NnZ1Z0FnEAE",
            "text": "Good food however the service is really bad. The young waitress always show attitude  no a pleasant place to eat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqajRDTXpBRRAB",
            "text": "Every bone in my body wants to gatekeep this place; but when I’m eating in this incredible restaurant it feels illegal that this place isn’t packed. The service is warm and friendly, you feel like family in a sense. The decorations are bright and in each detail a different region and expression of Mexico is ever present. They have a sunny backyard and sunlit seating room. The entry door/ store front ( which is brown  and a bit drab) is deceiving in the freshness of the food and atmosphere,  as once inside drinks such as the frozen cucumber margarita and literally EVERY TACO makes you want to jump up and confess your love for all things Mexico. Family owned, ran and loved … one of my favorite hidden gems on fresh pond."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdmE2Y3lRRRAB",
            "text": "This place is really the best because they've got the freshest protein, killer fries and guacamole that's seriously addictive. Don't get me started on the side sauces. I dont remember the name but there is an orange tint creamy one that I love. Mind-blowing. If you are in the Ridgewood Queens area be sure to stop by. You will not be disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqc05TeDVnRRAB",
            "text": "They made my tacos in a unique way by adding a pineapple 🍍 which suited the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMXB5eFpnEAE",
            "text": "Best taco in queens"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEM01EZ2ZREAE",
            "text": "Hice un pedido el viernes guau lo peor que hubiese pedido no tienen servicio al cliente eso es una basura de comida no recomiendo a nadie comprar de aquí"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEOExES0hREAE",
            "text": "The food is SO good and they have a lovely backyard. Service is always 100%! So nice to see such a sweet family run spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5ckpUQ2hnRRAB",
            "text": "Super good Mole"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0dU1pWmhBRRAB",
            "text": "The Taqueria is our go-to restaurant and we have the pleasure of dining here at least once or twice a week. The food is always fresh and prepared with love. Some of our favorites on the menu are: the guacamole with chips, made to order at the table, the shrimp Vera Cruz, any of the Burritos, any of the steak dishes. We are also always happy with the specials. Also, everyone loves the Rodeo Burger. And…if you are the mood for a cocktail, you will not be disappointed. Try the Aqua Frescas for non-alcoholic beverages.  This is a family-owned restaurant and they are the nicest people you’ll meet.\nWe had my big 80’s Birthday Fiesta at the Taqueria on March 2nd.  It was the perfect spot for 28 guests. The food was, as always, amazing. They went all-out with the decorations and treated everyone like family.\nEverything is done with passion and love."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxaXZ5bHZ3RRAB",
            "text": "My absolute go-to Mexican restaurant near my house. Have been eating here for over 5 years. Most of the time it's delivery, but I've sat and eaten here alot too. The tacos are just so good everytime. Great, fresh tasting ingredients and lovely service everytime I go. Don't have any complaints."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzeE9MRmhRRRAB",
            "text": "Fresh, incredibly savory and pretty food! The presentation of the food is beautiful. The chips were thin and flavorful, yet stand up to the guacamole. The Rojas sauce is rich and spicy. The tacos are all thoughtfully crafted and delicious. The service was friendly and attentive too!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyeHFid1h3EAE",
            "text": "I had not been here for a long time but remembered the food was good and since I was in the neighborhood.\n\nI had a burger and my boyfriend had the tacos. I wish I could rate higher but when my food came out I grabbed a handful of cold stale fries just after the plate was placed on the table. Which then just leads me to imagine how long cold greasy fries just sat there and they topped with a few hot ones and served it this way.\n\nThe burger was decent but over priced and the tacos were good. Not too excited to return here. The space is cute and opens in the back with more tables. However, they did still have Christmas decorations in April."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpd3NPUnFnRRAB",
            "text": "Authentic Mexican food with Amazing outstanding service and family feeling. My photos are not able to capture the flavor and love that went into these meals. You have to call or stop by as soon as possible. They are also adhering to all rules to keep you and your family safe. Stop by today!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVLUwzcjR3RRAB",
            "text": "The food here is so good! I recommend the corn, steak tacos, and the tamarind margarita. The flavors are on point with the perfect amount of spice. Only thing I’d say is eat in if you can. We’ve ordered takeout from here a few times and it’s pricier and doesn’t taste as good."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4bWFxRmV3EAE",
            "text": "This is my new favorite Mexican place in the neighborhood, I am so happy we discovered this restaurant. Adriana was a pleasure, she had everything packed and ready to go so quickly even though it was dinner time. We ordered to go however they have a patio now open in the back so next time we may stay. The food was delicious I got the chicken flautas which was so good especially with the green side sauce and sour cream they included. My husband got the chipotle chicken burrito which was even more delicious. The portion was very generous and we both had food left over."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZd2JLaHhBRRAB",
            "text": "For the love of Mexican Food. Not too small, not too big resturant. Seems family owned and lovely. Pictures of food surround the restaurant, helps those who need to look before eating to decide. The food was a bite oily but satisfied every hungry bone in my stomach. Lol"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwZ1A2VmZ3EAE",
            "text": "Taqueria Kermes served, designed and executed a fantastic Mexican menu for our Quinceañera's celebration. Included were the best margaritas in town and definitely the best margaritas we've had all around. Our gathering of 30 family members was perfection. We highly recommend this family owned and operated gem on fresh pond road. Indoors or outdoors in their beautiful garden area will be a great time for all !❤️🇲🇽"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPek1fYmZ3EAE",
            "text": "Great little spot with great food. Family owned and run they are so welcoming. Coconut shrimp very good with the piña colada dipping sauce. Burrito was very good also. Guacamole was fantastic!!!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJZ2ZlTl9nRRAB",
            "text": "Everything about this meal was exceptional! The vibe, the service, the cocktails and wine - and the all-so-important food was the most exceptional element! They have a sign behind the counter that indicted where the CPR machine is kept and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOUx1Wi1nRRAB",
            "text": "I ordered takeout, & the tacos came with a really spicey sauce on them. They did not advise us it was going to be this spicey, and tacos usually don’t come spicy sauce inside, the sauce is on the SIDE. They even put red onions on the tacos, who puts red onions? When I called back, the manager Sandra was so rude on the phone, and it’s a quite a shame you treat your customers this way. DO NOT ORDER FROM HERE.  POOR CUSTOMER SERVICE."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeVlqWS1nRRAB",
            "text": "Well i dont really write reviews just a bit lazy🤣, but i really go on checking reviews when im looking for new places to go eat😱. Ok so my first time here, the staff attention super great, good vibe in the place, very chill relax and the…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4czZ1SjRRRRAB",
            "text": "Ok, I’ve left a good review of Taqueria Kermes before and I’m leaving one again.\nIn normal times, the food is excellent and so is the service. Everyone is always so helpful and friendly. And now during COVID19, Taqueria Kermes continues to be excellent, safe and clean.  Every employee is wearing a mask. The restaurant is spotlessly clean. The food is as good as ever and it’s so clear that the employees really care about safety.\nThe back porch is lovely. The tables out front are lovely. The food is amazing. Take out is super easy and fast.\nIt’s hard to own a business, especially a restaurant, during these crazy times. If you have money to spend on take out, this is the best place on fresh pond road to spend it.\n\nDefinitely recommend the Hawaiian Quesadilla and the tostadas. Nice mezcal selection too!"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRLVAyVHVRRRAB",
            "text": "Nice and comfortable establishment. Very clean, nice employees. Great food, not the cheapest place to eat but well worth it. Definitely would go again."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLelo3a3FRRRAB",
            "text": "Cute little cantina styled Mexican restaurant, with small outdoor seating/dining area. Food was good, nothing to really brag about and the Blanka sangria was refreshingly light and crisp. Food didn't take long at all to come out."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvenIzQW9RRRAB",
            "text": "Best place ever for any occasion! I love the food in here . I been coming here for 3 years... it is perfect and delicious 👍🏼👍🏼👍🏼…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMGZ6amJnEAE",
            "text": "Excelente servicio, la comida es súper deliciosa y fresca. La mejor comida mexicana que he tratado 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MExEcmFBEAE",
            "text": "Amazing food and warm. I love the vibes."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhN2JfOEx3EAE",
            "text": "AMAZING TACOS. They make the guacamole for your chips in front of you which was really cool. Possibly the best guacamole I've ever had"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMGVLZndnRRAB",
            "text": "I've been going here for 10 years. The food IS really good. It used to be one of my favorite spots in NY. Sadly it's gotten kinda too expensive for what you get. A single taco is $6. It also used to be super nice homey vibes inside but they painted it a nasty hospital blue color and switched to crazy bright lights. I'm sad to say you might be disappointed with this spot..."
        }
    ],
    "reviews_count": 70
}