{
    "name": "Mr Sushi Japanese restaurant (Ridgewood)",
    "place_id": "ChIJSYd7ox5dwokRobpdRawOUPc",
    "grid": "QN5",
    "address": "58-12 Myrtle Ave, Flushing, NY 11385, USA",
    "rating": 4.6,
    "user_ratings_total": 263,
    "phone_number": "(929) 295-0286",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeGNGTmtUSGxHYWpSQ1YyMUdkSGh4TlRKTE9HYxAB",
            "text": "Amazing and fresh food"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkU1RsZHZWMHQ2Um5oU2MyUndjalpMTTBGa1pGRRAB",
            "text": "Great atmosphere and exceptional service!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tST1MwTnVTVmRDYjAxdmVIcFJWM1IzY0RZNGRHYxAB",
            "text": "Food and service here is always consistent: fish is always fresh, rice cooked perfectly and the middle-aged lady is soo sweet and nice. Her attitude is the best."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5S1ZsOHlkVkZOWlVOVlV6TlZiM1ZhWVVkWlNGRRAB",
            "text": "Great experience and great sush! The staff were so kind and welcoming, which made the experience even better. The sushi was fresh, flavorful, and very beautifully prepared. Excited to come back soon."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aYVIwMWhWMVowY2xseE1uUjFVSFZrUm5odGNuYxAB",
            "text": "such fresh and delicious sushi in a good quantity for a great price. i love to get the 40 piece tray- 5 rolls and 10 pieces of sushi for $50?? literally cannot beat it and best sushi in the neighborhood- definitely worth dining in but i recommend take out!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kc1pFMW1TVXAxVWpkblZWTklVR2haYWt4blQzYxAB",
            "text": "Amazing place ! Sushi is very fresh and beautifully presented. Staff is so welcoming, servers made me feel at home and the sushi chefs were very skilled and generous. This is my 4th time here and I will keep coming back !"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCU2FtOVlOMjFuYzJKbWFrbHVRa05RWmt0Q05XYxAB",
            "text": "The food is soo good, the delux chicken combo box is so underrated"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eGRUaFZTa3BxU1ZwemJYZFdURTh3TjBsclRtYxAB",
            "text": "Love this place for take out. I was genuinely impressed!!! The presentation was beautiful, and the quality of each slice of fish was outstanding. I was pleasantly surprised to find some unique varieties I hadn’t tried before. I would highly recommend them to anyone who appreciates authentic Japanese cuisine. You will not be disappointed."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210S1VUVmpVMGRSTmtsck9IQmpNMFZhVGtaT1dsRRAB",
            "text": "Absolutely Delicious. I had the pleasure of enjoying the shrimp tempura (incredibly fresh and Fantastic) and Steak Teriyaki Combo Box. A Complete Delight. Everything was so fresh!! They Will see me again. Thank You."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeVJWOTViRFI2WlVSeU0xVklibXBOVHpCWVdFRRAB",
            "text": "Great place for sushi and Take Out. People work there are very welcome and nice. Fresh fish and great price. Soo delicious...Highly recommened^^"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNWRtZHVXRkZoZVRsdU1GZHZTalo2WjJVelVVRRAB",
            "text": "Food is very fresh and great. Love:) Great sevice and nice People."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWmRWSkdabGx6T1UxaE5qbEZiV05OZDNWWVpYYxAB",
            "text": "I was given a bag with sushi with missing parts ( the spicy salmon) and missing the beef item. the only other thing in the bag was a miso soup.I tried to inform the restaurant of the mistake so it could be fixed but I was told it could only be addressed when the order was marked as ‘complete’ on their end.I waited and it wasn’t completed for an hour, and by that time i had to leave my house.This will be the third time i have tried to resolve this. It’s so frustrating"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaGV5NDhRRRAB",
            "text": "Great food. Sushi is very good and fresh. Customer service is very good here. The prices are fair. Lunch special is a good deal. Mr sushi Japanese restaurant is a place I would highly recommend. Good place to sit down. Restaurant looks beautiful. This place just opened up and everything looks brand new. Owners are nice and welcoming. Staff is very friendly and professional. If you pay cash for takeout they will give a discount of 5 percent upon request. I love the spicy salmon roll it's delicious. The presentation is beautiful the sushi looks very yummy. After a few times I realized this place is awesome and it's my favorite sushi place. When you sit down to eat you are greeted and treated very nicely. The lady's that serve are very nice and attentive. The tables are nice and neat. They offer hand sanitizer at every table. The restroom is very clean and tidy. I love how clean it is. I noticed when you eat in the restaurant as a gesture of appreciation for your business they provide a delicious complimentary appetizer. I received the fish tempura and it was delicious. Service is great and food is great.\n\nUpdate 9/2025. Still good here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNUxVUTRaVFpZTFVoc05qQjRRbFV3YkRremVVRRAB",
            "text": "lacks flavor"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwdFZEaFlTRlJaTkVkcFFqZHdjelpmU0RFeGVuYxAB",
            "text": "When dining in presentation is always on point. They pay attention to their customers.\nThey give you white fish on the house\nThey are just very, very amazing and the quality of their sushi is very good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obGFtdFplbTlDVDJJME1EWjBUV3h1WTBrM1VtYxAB",
            "text": "I’ve started ordering from here whenever I want sushi because they have the best shrimp tempura and most reasonable prices in the area. on my 2nd or 3rd time, the woman remembered my order and greeted me with a smile when I arrived to pick it up. good food and good people ☺️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNVVrMWFabWRaZEhCa1pUZElTRzh6VTBsVlRtYxAB",
            "text": "I love this place 💝💝🥰"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dGQwZHZhVTVLYnpSVUxXSldUWHBXU201dVZuYxAB",
            "text": "This restaurant was super welcoming and the service was fantastic. My particular waitress was really sweet and took the time to explain the menu and offered my family samples on the house. The portions were great and the food was really flavorful too."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaM1VVbDBiMU5NTTJZMkxWaE1RbGhIWkZWNE9YYxAB",
            "text": "It’s the best sushi place in ridgewood without a doubt by every metric imaginable. But please I’m begging for the love of nori, please stop blasting country music at all hours of every day. I want so badly to sit and enjoy my food but this music is making my spicy crab taste like baked beans and confederacy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MWVHMHlaRFJ2VnpaNGVrUkdiSFZLVlMxemJtYxAB",
            "text": "At first we were excited and then we weren't. The food had no taste! The calamari was overcooked. The sauce was great. They still serve imitation crab no thank you. The chicken terakyi was a little hard and unchewable. Then when I paid my bill they charge me the wrong amount I'm still waiting for the funds to come back into my account. I was entertaining someone from out of state to sushi for the 1st time, she didn't enjoy her food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ab1lXaHRXVGRwTnpjeWNXaHJjVVZZTUZkdlQxRRAB",
            "text": "Slow 😿…"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcVpmenRnRRAB",
            "text": "Love this sushi place🥰 Food is so so fresh and tasty. Great service recommend for everyone :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYW04ZTJIcHR5d0R3EAE",
            "text": "We had an amazing experience here on Father's Day, The staff was incredibly friendly, the food was fresh and delicious, and the drinks were excellent — we highly recommend it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMVVrMXhUMU5mYWtKNlQxTmZTV2c1WWtkbFVsRRAB",
            "text": "great customer service will be coming back again the food was amazing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJV1dqS191NXBlc3BRRRAB",
            "text": "I have been living in Ridgewood for 7 years now and I just dumped my usual sushi place for this one and have no regrets. It’s SO good. The price is better, the sushi feels so fresh and so tasty! The delivery is always quick and they have wine delivery?!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKMnVzclRnd1lyanpRRRAB",
            "text": "Really is just ok. The Christmas and Valentine’s Day decor in May is a great sign of what’s going on here. Menu says crab but it’s really just kani, which I find very misleading. Not impressed, won’t be going back or ordering delivery"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYnAyZEdSOGFMRGNREAE",
            "text": "Love this place. Sweet service and fresh sushi in the town. Recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJbU91OVN3dUl2NzVnRRAB",
            "text": "Very mid sushi, doesnt have much flavour. Wasabi is a bit off."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNFlLc3NBRRAB",
            "text": "service was so sweet and the food was perfect. great spot for a date"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbDVHOU9BEAE",
            "text": "Surprisingly good food for a chain called Mr. Sushi. Lovely presentation, clean space, prompt service. I will definitely return here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcjhTREl3EAE",
            "text": "I’d give 5 stars but I ordered beef yaki udon and the beef had a rancid taste. Besides that, the sushi was amazing!! I’d go back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OU8zZ0J3EAE",
            "text": "Guaranteed for another visit here. Everything 100 from the time you've been greeted by the hostess to leaving the place. Pays attention to every detail, knows by your moves or energy assistance is needed lol. 💯 💯💯💯My daughter enjoyed every bit of this service and menu.\nFood- 💯\nAtmosphere - 💯 (just minus the sitting stools no back rest)\nService- 💯"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ZzZ6ZjV3RRAB",
            "text": "Stopped in for lunch, usually get the rolls but today I ordered the chicken katsu. Food was good just wished the panko stuck to the chicken better."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMDY3bHJnRRAB",
            "text": "Very friendly accommodating staff"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnb1puT2FREAE",
            "text": "Loved dinner here! Food was awesome. Service was very friendly. Prices were good. So glad we found this gem of a restaurant! Will definitely be back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNfNUtZbBAB",
            "text": "This is the best sushi spot in the neighborhood! Always fresh and great service. Portions are large and completely worth the price. I will come back again and again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmazlLTVJnEAE",
            "text": "So delicious! Great attention to detail - I order takeout from here sometimes and they never forget anything.\n\nHowever, I would order way more if the uber eats menu was fixed. It has an issue where certain menu items don’t show available options. The roll combo B for example lets you pick three sushi rolls, but there’s no option to actually pick the rolls. Just to pick salad or soup. The same problem for the soft drink (mentions coke, sprite, ginger ale, but you can’t pick which one)\n\nCan this be fixed? You may be losing business because of this.\n\nCan this be fixed"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmaG9YQWtBRRAB",
            "text": "Pleaseeee try the hibachi Tokio fried rice and they sushi omg best food ever and so kind  we love this place thank you guys great job"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eG8yaWlBRRAB",
            "text": "I ordered delivery from here and it was absolutely delicious and was plated so beautifully and with such care! I also really appreciate that they use cardboard packing instead of plastic. Really went the extra step, will definitely be ordering again!"
        },
        {
            "date": "11달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQclpIaE5nEAE",
            "text": "Delicioso"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMlpucS1nRRAB",
            "text": "Food was delicious, the fried rice was done really good and not greasy. The appetizer was delicious and crispy. The sushi and sashimi was some of the best I’ve had in the area. I also liked their Sake their strawberry and pineapple was good. Will definitely come here again thank you."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQZ2RyZTZRRRAB",
            "text": "I've been coming to Mr. Sushi for sometime now and it is never a miss. Their dishes are always fresh, creative and most of all delicious! I would compare it with top tier Sushi restaurants I go to in the city. I am grateful to have them so close by but even if it weren't I would make the trek! If in Ridgewood definitely is a spot to have on your list to try!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcHZtd2VnEAE",
            "text": "Fast service, great food, would come back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcHRuRFVBEAE",
            "text": "Great service and flavorful sushi!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaHVxb2ZnEAE",
            "text": "We love Mr. Sushi so much we have made it a Saturday afternoon tradition ! My 5 year old requests it atleast 1x a week. The restaurant is a vibe with good music and good customer service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaXA2bnR3RRAB",
            "text": "We ordered the spring rolls, miso wings, pork gyoza, tatsuta Age, miso soup, seaweed salad, sushi sashimi combo, Hana roll and katsu chicken entree. Practically everything was either tasteless or tasted bad. The Hana roll and katsu chicken were ok."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzanF5OXJBRRAB",
            "text": "Don’t get the dragon roll 😭 Overpriced and it’s majority cucumber and avocado- the eel is much smaller in person and the caviar is not real sturgeon caviar. It’s regular roe. Don’t make the mistake I made- this is just a cucumber roll with avocado."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNnNXQW1RRRAB",
            "text": "😀👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdExDQVh3EAE",
            "text": "Really good food, and great service. They really care about what they’re doing here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYd0xUVVFREAE",
            "text": "The food was not fresh and the demo was terrible. More worrying than the above was that I might have seen rats running by."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUb0k3SzJBRRAB",
            "text": "we just had a second visit to the restaurant, the food is amazing, everything taste so fresh and delicious, the service was excellent, the only thing that disappointed us was the fried calamari, we were expecting a different texture (crunchy) other than chewy, but the sauce played a big role to save the dish! we definitely recommend this restaurant for those who love sushi 🍱❣️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPd2ZfNUpREAE",
            "text": "Wow, just WOW! Mr. Sushi it’s what we have been missing in Ridgewood this whole time! Food is INCREDIBLE, fresh, delicious, scrumptious ( I am looking at you Hamachi Kama and don’t even get me started about that velvety fried vanilla cheesecake…#drooling). Staff was wonderful, extremely friendly and accommodating. Decor and vibe of the place is superb. Thank you so much Mr. Sushi for tonight’s wonderful dinner, hubby and I are going to be regulars, 100%.\nI truly recommend that you give this place a try, it will have you coming back begging for more! 💕🤤"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSMUtqYnVBRRAB",
            "text": "The experience was rlly good, my favorite was the scallop sashimi, shrimp tempura(super crispy it amazing), beef fried rice, sashimi, and the tempura cheesecake. It comes down to preference but it’s the freshest sashimi I’ve had in a while…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeS1lR0JBEAE",
            "text": "Sunday evening dinner with my mom. We were seated right away. Very nice modern, clean place. Food was great, service was great. We ordered Queens Roll, Shrimp Tempura Roll, shrimp Fried Rice, and Mochi Ice Cream. The presentation was so fun…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNGZ5cmx3RRAB",
            "text": "10/10 recommend! Service was amazing and the food was delicious! I had the shrimp tempura rolls which was absolutely out of this world. Best shrimp tempura I have ever had. It was a sweet coconut taste which I loved & the fried rice was also great. The overall experience I loved! They also handed balloons for kids and roses for adults for Valentine’s Day! Super cute and made the experience that more special. Definitely coming back!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbGRYZmt3RRAB",
            "text": "Had a great experience at this newly opened restaurant (June 2022). Service was excellent and the food even better! We started with the eel sushi (nigiri) and 2 orders of sashimi - tuna and salmon, all really good but the salmon was outstanding. Then had 2 special rolls that I must recommend: Thunder roll (shrimp tempura, avocado, lobster, eel) and Ridgewood roll (fried soft shell crab, cucumber, spicy tuna, avocado). Can’t wait to be back! So we came back. This time the tuna sashimi was unreal, so tasty and fresh. As for the rolls we ordered what now became our favorites: Angel and Queens, please order those, you won’t regret."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOHVLckpBEAE",
            "text": "Wonderful place, delicious food and a great service!!. After a long day at college I visited Mr. sushi for dinner, great atmosphere and excellent food. First, they offered fried salmon on the house!! It was so tasty and yummy, afterwards I had the spicy shrimp roll and the chicken teriyaki, it was delicious!! Highly recommended!! Don’t forget to order the mochi ice cream, I have never tried something like that before it was from a another planet!! I will definitely comeback to Mr. Sushi 🍱"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0a0pxMmlBRRAB",
            "text": "Sushi chef was heavy on the fish. Staff were adorably kind. Place is small and neat. Most decent sushi place in the entire neighborhood.\n\nI got the salmon dinner and an uni sushi. It comes with a side of either miso soup or salad. I could not finish it and had a cute little to go box for my leftovers.\n\nPrice is a bit steep since I chose a moderately expensive dish plus the uni which was market price. There are more affordable options on their menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1aGVLdzZnRRAB",
            "text": "It was our first time here.\nThe food was beyond amazing and we even got some free items! Everything was tasty and  I don’t remember when I had such a fresh salmon for the last time.\nDefinitely will be back to try out other dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbnJ2LS1nRRAB",
            "text": "The price has gone up and the quality and service has gone down. Waitress gave me the wrong order and then charged me for it. The fish is not fresh. Not eating there again. The fried calamari is not properly prepared and they did not take off the elastic membranes. It felt like I was eating rubber bands."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoODhxTHJnRRAB",
            "text": "Loved this place!! Sushi is always fresh, service is amazing, place is clean and inviting. The prices were reasonable and generous portions."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeGJtRVNnEAE",
            "text": "Excellent place! Food is delicious, super affordable, but also big portions. The service is incredibly friendly and accommodating. I will definitely be coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidl9hSmJREAE",
            "text": "I ordered take out from here before, but the dine-in was on another level!\nThe food was beautifully served, they even served a complimentary amuse-geule, which is rather common in fine-dining european restaurants.\nIt was not overcrowded and the waitress was very friendly.\nI can recommend the Vegetable Sushi Combo.\nThank you for this amazing meal. 🙏🏻"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbXNyeHFBRRAB",
            "text": "Sushi and sashimi were a lot better than expected! And with a name like Mr. Sushi, I wasn’t expecting much tbh. Maybe if it was a Dr. Sushi …\n\nGot the sushi boat for 2 and one complementary dish of white fish tempura. The sashimi was fresh and the sushi rice was well seasoned. The boat was also nicely decorated. Overall, $60 for two people was good value! Would come back again.\n\nKnocked the restaurant down a star because the chairs are giant inverted muffin tins and they have no back support and are really uncomfortable. Nothing on the food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMmV6aUNnEAE",
            "text": "Mr.Sushi is my go-to sushi take out place in the neighborhood. I’ve probably ordered from them over 15 times by now and each time has been amazing. Their quality of fish is great; much better than other sushi places in the area. I also believe that they have good prices for what you get. They are never stingy with their portions. I’ve never been disappointed with Mr. Sushi."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocUxqSXZ3RRAB",
            "text": "My lunch break are always better when I go to Mr. Sushi Absolutely love  the food it is  always fresh and delightful, the staff are great everyone is very friendly. If I you every find yourself in Ridgewood do yourself a favor and come in and eat here ! Definitely recommend!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScTh5T2xnRRAB",
            "text": "Came for the rating but… worst gyudon (beef rice bowl) I’ve had in my life - mushy uncooked rice, over fried egg, thick beef slice like in Chinese take out, instead of thin slice. Shrimp tempura is extremely doughy and barely shrimp inside.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMjVHMmJ3EAE",
            "text": "We found this place on one of our walks.  They had just re-opened for dinner at 430pm, so we had the place to ourselves.  The service was great, the food was delicious and fresh and fast!  It made for a wonderful experience. As we were leaving, it was filling up a bit more, and we did see the service remain as attentive...good job!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcHFYQm5nRRAB",
            "text": "Delicious and moderately priced Japanese food. The Sushi was excellent the presentation and atmosphere was also very good the owner is very nice and attentive. Definitely the best sushi in the area 👍🏼🍣😋 update another fabulous meal yummm!!!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPM3BDS0h3EAE",
            "text": "I’ve been having my eye on this place and walked passed the construction wondering when it will open. Thankfully it did and let me tell you I will and intend on going back. First, the food tasted so good when I received my dish and along with my friends to. I didn’t expect the plate to be so big but it was so different and I loved it so much, you can just tell there holding themselves highly on meal presentation. Not to mention the quality of food tasted so fresh, when I bit into my yellowtail sushi the taste was so good. I don’t know if it was the easy going environment, enjoyable music choice or the politeness of the staff but the experience was amazing. Not to mention their dessert is to die for I had the fried ice cream (chocolate) and it was so light and fluffy with every bite. If your looking for some great food at reasonable prices for the quality and presentation, I highly recommend Mr. Sushi. Special shoutout to the girl server who helped my friend open her Japanese soda that she ordered. Thank you so much and I can’t wait to eat here again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1ODRmYzJ3RRAB",
            "text": "Delicious and fresh fish, meats and food overall! Their plating is beautiful, colorful and unique while keeping the traditional Japanese culture as well. They never disappoint!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNnZTUldnEAE",
            "text": "My partner and I come here almost every week. Great deals, huge menu, the friendliest staff. Everything is very fresh and plated so beautifully. Not to mention service is very quick! Love it here."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSalpxUmFBEAE",
            "text": "edit: I love this spot so much, such amazing local spot. they now offer a full salmon plate that tastes even great in take out 😭 please give this place your business, it is so good I got back on here to update my review. also PHENOMAL prices!!!\n\neven the to go is amazing, the staff are wonderful and it’s so nice to have great sushi for a good deal so close to me! thank you so much! Otoro + salmon so good, love sashimi, still taste so fresh in take out."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSa29xcXlRRRAB",
            "text": "This is the first time I have ordered from here and I am very disappointed. The meat was not cooked and all of the sushi was falling apart. Presentation was not pretty at all."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1NkxqWUZ3EAE",
            "text": "Amazing fresh taste! Highly recommend eating here! They also gave a appetizer for the table on the house! Kinda staff and very comfortable place!"
        }
    ],
    "reviews_count": 75
}