{
    "name": "Pizzeria Panina",
    "place_id": "ChIJB8FygL9dwokRoRyMhvfq4Ss",
    "grid": "QN5",
    "address": "68-38 Forest Ave store front A, Flushing, NY 11385, USA",
    "rating": 4.7,
    "user_ratings_total": 249,
    "phone_number": "(347) 227-7866",
    "reviews": [
        {
            "date": "2주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdmJYcFdaa0l6V2xZeVZHdHVWSGQyWmsxc2VWRRAB",
            "text": "Pizza molto buona, personale cortese e ambiente tranquillo."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWFRIZHRiSG96WWpSR1YyNWhVa3RJTkRGbldWRRAB",
            "text": "Not enough words to describe how much I love this place.\n\nIt is consistently delicious. I will always start off with a Bruschetta or Raddichio Caesar and it hits every time. The pizzas are fantastic and they always have some funky flavor pairings that are surprisingly tasty. There is hardly a wait except on super busy nights (and then barely a wait at all) and the atmosphere is vibey. I have brought many friends and the reviews are always the same: amazing.\n\nI’d recommend this as a great neighborhood spot any day."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSFVVZzBkMGgzYW1ocFRuQXlUMkZYY2xWWldsRRAB",
            "text": "Top tier all around"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214c1EydE5aMDFsUTJ0QldIVklXV1ZGZFdselRrRRAB",
            "text": "Truly delicious food. I’ve been here twice and have had great service, and really great food. Thank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMFdWcEJjVVpsVTFSeGJWQldZMGd6VVhaU1JIYxAB",
            "text": "This would have been a solid 4 star review, but my experience with Camile really ruined my experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNFdrTmZibVF5TkhCV1ZVOWpWMWcxY0V4MU4xRRAB",
            "text": "I loved my meal at pizzeria panina. The kale radicchio salad was excellent, and so was the pasta special I ordered. And the cocktail. And the bread. This is a perfect nice cute cool cozy neighborhood spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSGVXUlFMV0YzUVd0dU1HcG9OVVV3YUhGVWRGRRAB",
            "text": "Best spot in the neighborhood"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQ1pUZGxhbnBzYUVoNlZIVlVNbVJPZUU4NVlXYxAB",
            "text": "Great staff, chill vibes, delicious food. Never disappoints."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxS01rb3hUa1JRTjNGSVprOVViVUpaWVZCTmEyYxAB",
            "text": "Everything about this place was good. I had no reservations and they were still able to sit me. The Spritz were amazing. The pizza was even better. I don’t know how long it will be on the menu but that pistachio tiramisu…… amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeU5XNXJVSFJHUzBKSlVXcDZZa3RwT0dkMFVYYxAB",
            "text": "What hasn’t been said? Great food and drink. Lovely atmosphere. A sticky date cake that almost made me cry."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaVNtOXNRakJOZG1Kdk5IcHBabG80VjFWa2MyYxAB",
            "text": "Good Pizza please, nice to have a drink and pizza"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTk1XTnhRMFZSVDA1eloxWkpRVlZYY21SbFIyYxAB",
            "text": "Best neopolitan I've had (ever, i think). and ive been to some of the famous spots in ny - song e napule, joes, johns on bleeker, scarrs, ops, marta , martina,  sallys apizza, joe and johns, f and f. other places might do other types of pies really well but this for neopolitan is pretty perfect.  amazing cook, light , best sourdough dough for pizza ive tasted. the toppings really modulate the flavor here (heavy hand) so choose prudently.\n\nreally, a perfect cook! thin, slightly soupy in the middle, fresh sourdough smell, fresh ingredients.\n\nthe dessert - we got tiramisu (very good) but the other one (sticky toffee cake) was the star of the show : rich, decadent , thick, caramely, deep, served with a slightly acidic but sweet icecream  which was perfectly cold and paired really well.\n\nits actually pretty cheap compared to the area, and other restaurants of the same caliber. kind of insane tobequitehonest verymuchso"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSalIwcE5aVjl4TkcxcWNsZElOR2hyYkhka2RGRRAB",
            "text": "where else could the beautiful they them women of ridgewood go for a cube of date cake"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMlYyWklSMjlqZG1kUWRUTkZTRzlFVmtGS1dYYxAB",
            "text": "Went on a Thursday evening for bites and a drink! The bartender, Olivia, was so nice and welcome! She recommended a delicious drink called hot Italian summer that had a delicious brine in it! This has become my new favorite spot in ridge wood"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUVRuVmhOM0E0ZFUxamRUZzRSWFJpYlc5elQyYxAB",
            "text": "Always the first place we go when we visit."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCczRyN0xBEAE",
            "text": "Excellent music, always."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25acVYxSjFkVWQ1Ym5wV1ZYTXRhamR0ZEVaTWJuYxAB",
            "text": "I went on a date at 630pm on a Monday and it was fairly busy. I sat outside and we ordered a rose with the special pizza and pasta with mushrooms. We ended up getting our pasta and never getting our pizza till we brought it to the attention of our server. She brought it right away and we’re glad we reminded her. Definitely a bit pricer on the high $20-something for the specials but definitely delicious. I would recommend making a reservation if you’re coming during prime dinner time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ZlNVaEdOVmhVY0VvMWNXRmZTbmhITUZRMVFXYxAB",
            "text": "Great service, setting, and pizza. The date cake is amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OblVUZ3RUMlZ6VEVZMVZrSkRPWE10WDJoeVYyYxAB",
            "text": "The best around"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5b2VuUklUemxhZEZSNmVuaG5TbHBLZURFdE9WRRAB",
            "text": "We pulled up to Pizzeria Panina right at 7PM, and the vibe was exactly what you’d want on a laid-back summer night in Ridgewood. It was casual, cozy, and well-designed. It’s a small, intimate space, but it doesn’t feel cramped. You can tell they pay attention to the little details.\n\nI didn’t order any drinks this time, but I loved that they didn’t charge extra for sparkling water! My homies did get a few drinks.\n\nThe service was incredible. Friendly, attentive, but never overbearing. Everyone was on point from the second we walked in.\n\nThe special ravioli they had tonight was absolutely incredible. Perfectly cooked, balanced flavors. Who knew corn and ravioli would work so well together. The pizza was great too—high-quality dough and toppings—but the pies run a bit small, just something to keep in mind if you’re rolling in hungry.\n\nFor dessert, we got the sticky toffee cake with gelato! Amazing. The olive oil on the ice cream was crazy good and the sea salt flakes on the cake was AMAZING! The watermelon sorbet was also AMAZING! It was refreshing, fresh, and the perfect way to close out the meal.\n\nOverall, I’d give them a strong 4.5 out of 5. The pastas and desserts really shine. Pies are tasty, just on the smaller side. But between the service, flavor, and thoughtful touches, Panina’s 100% worth the trip."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGelZYRmtObVp2V1c1Q1gxSjRNblp5TTFKUUxWRRAB",
            "text": "Great selection of rotating specials. The rosemary focacci was amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NlFVcHpXbFZsTkhvMFYweHlXVE0yTkhkaFoyYxAB",
            "text": "Very good food, drinks and grt atmosphere 😊 Tiramisu was yummy"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OYWMxWjBiRGhFY0hsT2JEVkVZV05WTnpGbFJrRRAB",
            "text": "such a great spot!! I love the bianca pizza, fennel salad, and the caesar salad. the calabrian chili oil for the pizza is so tasty. also the drinks are really good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNU2I5Y3U0OW9tS0x3EAE",
            "text": "If you are looking for pizza in this area this is the best place to go the best taste of real pizzas\nService 10/10 quality 10/10 totally highly recommended"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbTB3TDNvdU1EX3N3RRAB",
            "text": "I live in the neighborhood, and regularly have an insatiable craving for Pizzeria Panina. The pizza is incredible, and their rotating seasonal specials are always inventive and mild blowing. Tonight I went and got the special pizza with roasted corn, spring onions, and kimchi romesco. I was reminded again of all of the reasons I LOVE this neighborhood spot!! In fact, even if I didn’t live nearby, I would travel pretty far to eat here. They also have incredible cocktails and a long list of amaro/apertifs/digestifs ❤️❤️❤️ you Pizzeria Panina. Never change!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcTFpYm1CcC1uQ3hBRRAB",
            "text": "From the moment we stepped into this place, we were impressed by the staff, the food, and the overall atmosphere. Every dish that arrived exceeded our expectations. We tried the Calabrese Pizza, the Agnolotti Pasta, and the Sticky Date Cake."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNanp3cFdvLW9LR21RRRAB",
            "text": "The food was absolutely delicious and the service staff was the icing on the cake. From the hostess at the door, to the bartender and staff that dropped off my food, everyone was so kind and welcoming. The agnolotti pasta special was a great deal for $24 and was perfectly seasoned. I got gelato for dessert that was truly heaven on earth. I adored this place and can’t wait to come back :-)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMMnpxcGp5NS1lWTJnRRAB",
            "text": "Good food, loud people around, excellent specials."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNT0g2ZHJmaXNDb1p3EAE",
            "text": "It’s like when you’re in the desert and you see a body of water and palm trees. But when you get there. It’s not actually water and palm trees. It’s pizza."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKUGc4c2pabnRhdFdREAE",
            "text": "Camille : 10/10 Friendly, inviting service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLSHAxZUtXeFBURm13RRAB",
            "text": "This is one ...... I loved the most in pizza world 🍕🍕🍕"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMTVmX293RRAB",
            "text": "Very nice place! An actual pizza restaurant with a wide variety of pizzas"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdS1EWFJnEAE",
            "text": "Definitely my favorite italian restaurant in ny, they make you feel at home, and the food is soooooo good,\nDefinitely one of the most underrated restaurant of New York"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeWFDZHpRRRAB",
            "text": "Great food, great drinks and friendly people!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJb2VUVDF3RRAB",
            "text": "What a terrific and delicious spot. The food is delicious! My namesake pizza, Pablo, is delectable and Patrick the owner operator is a gem of a host. Can’t wait to become a regular."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eUxuYnNnRRAB",
            "text": "This is my favorite restaurant in the area— vibe is impeccable & everyone who works there is so lovely ❤️❤️ tonight I had the sticky date cake aka the best dessert I’ve ever had in my life… pls never take this off the menu 🙏🙏"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbjRiNGtRRRAB",
            "text": "Had dinner here with a friend and everything about it was great. Don’t skip dessert."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRb19MN1BREAE",
            "text": "staff and owner so friendly,very attractive,low key deco-y touches,pizza just right"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncGNhSWdnRRAB",
            "text": "Best restaurant in Ridgewood! Pizza is perfect every time. Amazing selection of pasta dishes and some of the best cocktails you’ll get anywhere in NY. Ask to try the Panina Club cocktail. I’d give this place 10 stars if I could!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfLV9XNTF3RRAB",
            "text": "I wasn't a big fan of their pizza - the crust is half the pizza. The area with toppings is pretty thin, too thin for me - it's pretty flimsy and a bit soggy from the sauce. My pizza was supposed to have sausage on it but there were only 3 little slices of sausage on the whole pie, pretty insane for the price. It's pricy for what it is in this part of the city. That said the vibe is cool. I didn't like the chilled red they carry at the moment but hopefully that will change."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBaWItMVVBEAE",
            "text": "Fantastic food. Great vibe. What an awesome addition to the Ridgewood."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfd052TjJ3RRAB",
            "text": "This is by far the best pizza I’ve had in Brooklyn. The staff are warm and attentive. The vibes are immaculate. The food is beyond tasty and intentional!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmb296QlV3EAE",
            "text": "All the Pizzas were great. We shared a lot of pies and would definitely come\nhere again!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LXE3cEN3EAE",
            "text": "Classic pizza, Arugula salad and white wine had for the first time, everything super delicious and service outstanding!💕🙏🏽🎉"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNHNDQ2FBEAE",
            "text": "They served us raw undercooked pizza from their special menu and were nice about replacing it. They let us know that it was new they were trying out but perhaps make sure your food is cooked before serving?? The appetizers were also disappointing. We got a marinated eggplant that was so acidic it cut your tongue and a salad that was unmemorable. The service was nice and they were very apologetic about the raw dough but it made us not want to come back and try their restaurant again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aE9YOThnRRAB",
            "text": "My favorite restaurant! Amazing pizza and vibes. I love the music too. The date sticky toffee pudding was to die for. They have really nice outdoor seating."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQcHA2R1NREAE",
            "text": "Loved this place! 6 of us came for a family meal and it was amazing! Our server, Maxine was so accommodating, attentive and friendly!  Drinks were awesome and the pizza was light and delicious! It was crowded but fun and not too loud to talk:)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQM3Y2TWlRRRAB",
            "text": "Came to pizzeria panina for the third time. Ordered the kale radicchio caesar salad and unfortunately the kale was tough and not cared for (dry). Our server Sarah accommodated completely after we shared our concerns. She went above and beyond to make sure we were satisfied. You’ll always be treated with respect here! And the pizza is great"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzN0lTWjVRRRAB",
            "text": "Enjoying my pick up order, burned pasta for 21$"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaTk3MXhRRRAB",
            "text": "I <3 Panina. Staff are all incredibly nice and incredibly hot ;)\nA true gem of Ridgewood, you will not be disappointed if you go here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNElpV0N3EAE",
            "text": "I recently had the pleasure of dining at Panina Pizzeria, and I must say it was an absolute delight! From the moment I walked through the doors, I was greeted by a warm and inviting atmosphere. The staff was incredibly friendly and attentive throughout my entire visit, making me feel like a valued guest.\n\nNow, let's talk about the star of the show—the pizza! The pizzas at Panina Pizzeria are undoubtedly top-notch. The crust was perfectly thin and crispy, with just the right amount of chewiness.\n\nGreat location and charming restaurant a must visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6b3VTR3JBRRAB",
            "text": "This is the cutest little pizzeria spot with some of the most delicious pizza I’ve had in NYC! The service was great, and the entire staff were so friendly, kind and attentive!\nThis was my first visit and my faves were the Caesar salad and Quesos pie 🤤. The cocktail menu was on point too. I’ll definitely be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGOWVEajVnRRAB",
            "text": "The pizza is amazing. The crispy texture of the pizza and the flavors are both well done.\nI love the one with spice paste. The spice itself are the right spicy level that comes with the quality ingredients. Love it.\nThe dessert is yummy. Love it as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbU5TampBRRAB",
            "text": "Ok so where do I begin? I guess with the most amazing, delicious olives I have ever had in my entire life. They were served in an orange infused brine and tasted like Italy in a cup. The Italian rose (rosato) was absolutely marvelous and had a wonderful taste to it - in a away the equivalent of a delicious, tart juice. We ordered the regular pie as well as the pie with anchovies and were not disappointed. The dough is just so wonderful, fluffy and tasty. Plus somehow the sourdough does not give you the pizza baby-belly! And the service - absolutely phenomenal, Sierra was so friendly and attentive. To top it off- because it is our 12 year anniversary we were treated to a lemon oil cake and an Amaro 🩷 thank you for the extraordinary dining experience, we will 100% be back very soon!\n\nAnd I like to take bathroom pics so here you go! 👌🏻"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMjVhWDNRRRAB",
            "text": "everything about this place is lovely! the inside is beautifully decorated and the staff are very friendly and prompt. the marinated olives were juicy and zesty, the radicchio caesar was amazing (just wish it had been bigger), and the pizza (we got the special) was perfect. the pizza red sauce was especially flavorful and the crust was a wonderful fluffy chewy sourdough. plus the side calabrian chili oil is a huge bonus. the pricing is fair. this will definitely be a favorite moving forward"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtclltQTZ3RRAB",
            "text": "Food is delicious and comforting. The menu is not very large, but that’s when you know they really want to go above and beyond to deliver on the selections that they do offer. Everything has a unique flavor profile. Decor is simple, cozy and inviting. The seating by the window is so romantic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWcElMSWtRRRAB",
            "text": "A serendipitous local find after a friend’s  flight was canceled and our first choice to eat didn’t work out. The pizza and service were both top notch, the specials were delicious and the pizza dough perfect.  The staff was engaging and Patrick introduced himself by commenting on the joy of my sister’s Christmas sweater. We’ll be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSaU83eFV3EAE",
            "text": "Was blown away by how good the pizza was. I live really close by and just never came around. Finally glad I did. Ordered the eggplant appetizer as well, and it was good, but next time I'm just gonna leave room for the pizza. I got the spicy pie, and it was so son good. And try their chilli dipping paste/sauce. Spicy and delicious! Will definitely be coming back for pizza and beers soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5eUxMbGxBRRAB",
            "text": "What a great place. I went here spontaneously for my birthday because a friend suggested it. It was totally worth it.\nWe started with the Antipasto plate, then went to the vegan pasta bollente pizza, what I didn't realize at the time came with a pretty spice chilli, and finish with a bread pudding slice.\nWe also had a couple of cocktails, which made the bill a little pricey, but if you didn't have drinks, it would be pretty affordable.\n\nThe Antipasto plate was a great addition to the meal.\nThe meats were scrumptious and the accoutrements added exactly what you would want for a antipasto plate. $24\n\nThe Patata bellente was really good but if you don't like spicy food, steer clear of this one. I thought the potatoes would help subside the spice, but it was still very spicy. If you like spice this is the one for you. $18\n\nI can't remember what the bread pudding cost or even seeing it on the menu, but it was outstanding!!! Not to sweet, not too bready, it was just a bit of joy with every bite.\n\nId definitely come back, and not just for a special occasion."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdzYzS0NBEAE",
            "text": "A great pizza place with really cozy ambiance. The pizza was amazing and the chili oil was a really good touch for each pizza, we had Quesos, Abi, and Forest pizza I think. The drinks were all really tasty too!\n\nJust wish they had a *tiny* bit bigger menu but that’s just me :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dDZxN0dnEAE",
            "text": "This place is amazing! And I love they have vegan and vegetarian options !!! We order many different pizzas today and were very happy with the outcome ! Recommend them! 🍕 🌱"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOVlta3BBRRAB",
            "text": "Too think this was once a butcher shop I frequented as a kid back in the 60's. Wonderful transformation .Great detail for preservation.Had the pleasure of meeting owner. Thankyou.\nGood Food. Good Prices. Good People. Wonderful experience overall."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcE5YZU93EAE",
            "text": "So good I’ve eaten there twice in the past 24 hours, 3x since they opened. Beautifully restored space, super nice folks. I was surprised to see that they’re running electric ovens, as I thought pizza of this kind could only be made with wood fired stoves — but bang, consistently awesome."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwX1lXZFFBEAE",
            "text": "I love this place so much. You are really lucky if you found this place with beautiful outdoor and indoor spaces. So if you got it, enjoy! I have few my favourite items over there but always ready for trying something new. The tastiest pizza in New Your I have ever had.\nAlways come for dinner.\nThank you for your hospitality and amazing experience in your place❤️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNteTY2UFh3EAE",
            "text": "I was very excited to see this spot getting ready to open & they did not disappoint! The ambience and decor is lovely and the pizza and cocktails are delicious. The Spicy pizza was a favorite. Patrick was incredibly welcoming- Pizzeria Panina is exactly what the area needed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyb01UbHRBRRAB",
            "text": "LOVED everything that we had here! We ordered the Radicchio Salad, Classica Pizza, and Bianca Pizza and they were all delicious. The drinks were so good too — my favorite was the Aperol Spritz!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubGF5RlBBEAE",
            "text": "Really cute pizza shop on the corner. So cozy inside. Great Neapolitan pizzas that make your close your eyes and savor. I love the spicy one. Sometimes the staff seems a little cool/quiet, but the pizza makes up for it. I’ve returned at least a half dozen times."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtclpEVTJnRRAB",
            "text": "So happy to finally have Pizzeria Panina in the neighborhood! The service is great, the ambience is perfect, and the food has been exceptional both times I’ve been. Looking forward to many more meals here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINmJDRFRnEAE",
            "text": "Been here a handful of times, food is always great and the service usually good except two nights ago when we arrived for our 7:30 pm reservation and they didn’t have any available tables. Our host told us that a table is finishing up and apologized and asked us to sit at the bar and said “first round of drinks is on us”. We ordered one drink and waited for half an hour to be seated. Ordered our food and ate. After finishing our meal, our server asked us if we wanted shots of digestif on the house and we said yes. After we got our check, we saw that we were charged for the first and only round of drinks we ordered so we flagged the host and told them about this and they said they’re sorry if they made the impression that we we’d be able to order the first round of drinks of our choice for free. This experience makes me not wanna go back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXclBpMF9RRRAB",
            "text": "Came from Williamsburg, amazing place!\n\nPizza was so good! Even salads and sides were delicious!\n\nI recommend to everyone who is passionate about what they are eating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdW9QMHZBRRAB",
            "text": "Best pizza in the neighborhood for me. Great flavors and crispy crust. Not too heavy. Always friendly service. I like the overall setup and interior. I usually come for brunch but have been for dinner. Solid cocktails too. Will keep coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMnFPTG9BRRAB",
            "text": "super friendly staff and amazing pepperoni pizza! the tiramisu was fantastic too"
        }
    ],
    "reviews_count": 72
}