{
    "name": "il Gigante",
    "place_id": "ChIJtxFgYDRdwokRmR1IiWUh8j8",
    "grid": "QN5",
    "address": "8-80 Woodward Ave, Ridgewood, NY 11385, USA",
    "rating": 4.7,
    "user_ratings_total": 199,
    "phone_number": "(516) 927-0041",
    "reviews": [
        {
            "date": "6시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNGVqZ3lSMkZuUVVkb05XeHNTVlZpWWxOVU0xRRAB",
            "text": "Cute spot, feels very much like a real Italian trattoria, makes sense as the owners are from Tuscany. The Gigante platter was exceptional, wine list was good and priced for drinking. Food would be a 5 but the Cacio e Pepe was basically butter noodles. What I get for ordering Roman at a Tuscan joint. Overall I’d really recommend this spot if you’re looking for a more Italian-Italian style meal."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xalRFSm9hM2c0Y0Rob1VuVmpiazVxTWxwcFVVRRAB",
            "text": "Perfectly cozy and very delicious.  We ordered Cacio e Pepe (which is hard to find on a menu), branzino and pasta with clams.  Couldn’t decide which one was the best.  Old world setting in an OG Ridgewood building."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TVFUZEhkMUpvYWpreVVGcGtORnBXY0VKYVMxRRAB",
            "text": "We had a delicious anniversary lunch here.\nVery fun menu.\nWe had one of the salami platters, the beet salad, the lasagne, the Brussel sprouts and coffee."
        },
        {
            "date": "6일 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paM2FFTkZOVnBpTjA0dGMwMVhTRVpvYW5WSWFrRRAB",
            "text": "Soccia che buono! Great restaurant, pasta driven, pretty pretty good!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWlFVUlNjSGcxVUhwcllYVjFSelJKVDJoVVZHYxAB",
            "text": "I love this place! Pasta and vibe is so great. Extra points for the parmigiano in a mug. They get it."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTVp6TXRPREYyWkZBMFh6aENZbWRQTVRWUFpuYxAB",
            "text": "Literally the best restaurant in Ridgewood and a great Italian joint in general. I come here when people are visiting from out of town, I come here when I’m celebrating, I come here just because it’s the best"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbFZYZHVkVjg0Ulcxd01IUm1iRk5WUVhWM1JIYxAB",
            "text": "Wow, I am blown away! Firstly, when I walked in the door I loved the ambiance. Felt like a real classic NY joint (similar to Eddie’s Sweet Shop, iykyk). The service was impeccable- we had a really sweet waiter and bus staff. Each of our dishes were delicious and they have a specials menu, which I appreciate. Each dish was simple yet full of flavor. Next time I’ll have to try the drinks!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRFJFUnlObk52VkMwMVVESTNVV3BhZERCRGJIYxAB",
            "text": "“What a nice place! Great service, delicious food, and a wonderful atmosphere. You feel like you’re in Manhattan, yet it’s a local spot. The vibe is amazing — highly recommend!”"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSGFUWkpWa2xrUjFSbWNEWktkREZVWjAxWlRWRRAB",
            "text": "Great neighborhood spot with delicious menu."
        },
        {
            "date": "3주 전",
            "language": "ms",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWU1ZVUnJUazVITkdaWVEwcFVVMlJHUXpWTlduYxAB",
            "text": "Yesss!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aU9WUjBRVjlTVFZvdFVteE1NVmhFTFcxT04wRRAB",
            "text": "CINQUE STELLE. 5 stars all around. Went with my 2 Italian friends last night because they were raving about this place. So I walked 8 min from my house and had the best meal in a long time. Everything from salad, to pasta, to cutlets, to dessert was satisfying. The staff all spoke Italian and made it feel like home. A++"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRk5tTklWMjVwTUVkM1VXbG9iak5IWTFkelduYxAB",
            "text": "This place is an absolute gem!! We had the pappardelle, gramigna, lasagna and pesto -- and they were all exquisite and so rich in flavor. The service was also excellent. You can tell a lot of love has been put into this place. Definitely worth the trek from Manhattan, will visit again next time I'm in NY."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRmQzVlJkRTVPTWsweFJFRmtWblZSZFVweWEyYxAB",
            "text": "I will always have a soft spot for an establishment willing to accommodate a solo diner on a busy night. Thank you for squeezing me in. Prompt, attentive service. Selection of food and beverage was narrow, but obviously very carefully curated. Indoor ambience; must love bustle. Outdoor ambience; must love traffic. Don't let passing car exhaust distract from the exquisite plate of pasta in front of you. Definitely will return."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwemVGOUtWREZGYWpVeldFeHRiRlJLYWxKWVJYYxAB",
            "text": "My wife Yuni and I walked by Il Gigante out of curiosity, and one day finally decided to take a break from work and try it. We only had a short time to dine, but we were so glad we did. The pasta was incredible.\n\nA week later, we were craving brunch and looked at a few spots, but honestly, we just wanted to go back. That’s when I met their lasagna, and it completely won me over. We went back again the next weekend with my in-laws just so I could have it again. We all shared our plates, as you should at an Italian restaurant, and every dish was fantastic.\n\nSince then, Il Gigante has become one of our favorite places in Ridgewood. The food is amazing, but it’s the people who make it special. Everyone we’ve met has been kind, genuine, and welcoming.\n\nWhen you work long, stressful hours, meals like this remind you to slow down and enjoy life. Ridgewood’s lucky to have a place like this.\n\nPs. They’re very dog friendly!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaVpVWlZOV0p2YUZoWE1FSmxkVW81YVhKMWNtYxAB",
            "text": "l Gigante was really good. The pasta was tasty, and the pizza came out fresh and hot. The place has a nice vibe — comfortable and not too loud.\n\nService was friendly, just a bit slow when it got busy. Overall, solid spot for good Italian food. I’d definitely come back."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNFZrRjRWRGxTYURkT1EwdERSSGM1UzBKeE1tYxAB",
            "text": "Pasta was just as good as in Italy! Absolutely delicious!!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NE9HTjZUbUV0VTE5a1VXVk1SRTFSZVhOSVQzYxAB",
            "text": "Pretty please to have authentic Italian food, price was good but portions a little small!! Beautiful atmosphere!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaVFqQlVSamwxU0dWd1JUaGhRMjlEVFdSVFYzYxAB",
            "text": "Delicious lasagna and great cocktails"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdk5IaFRSM0EzVUV0UVNETnJRbXBXVmxSa1dXYxAB",
            "text": "Some of the best meatballs I ever had. And I’ve had them my whole life. Also they source the ingredients from local businesses. The service is fantastic. Thanks for making my spouse’s bday fab. He was so happy!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdWNWZ3RPRlJtV0ZWUVRFaFZjbXByYTBSVGJrRRAB",
            "text": "Great food at this local restaurant in Ridgewood, Queens.  We met the owner Lorenzo he is very friendly and asked how we liked the food. The staff were great 😃👍🪅"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMGJITTBaMmxSTFRjMGFXTTJabnB4YkhCMGIzYxAB",
            "text": "beautiful space, drinks and service are good. food leaves a LOT to be desired"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSVoyTXhTakZoVm01eWNsTmtaRUo2VFZCTlpIYxAB",
            "text": "Ever since FARO closed I have been looking for my new pasta place and hallelujah il Gigante has delivered. Authentic food made and served by Italians from Italy. Recommend anything/everything. This time we tried: Gramigna, scoglio & tortelloni.\nValpolicella. Whiskey cocktail. Amazing and warm service fron Sara et al. Gelato w/cherries was killer. Favorite was the seafood pasta. Can’t wait to go back. 6 out of 5 stars!!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NlVFWjNPSHAwYmxSMGVYaEdOMkZRU0hOWFgwRRAB",
            "text": "Great food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcE0zSjJPVGhTVFRWSE16TjRkelJFY0VaSk1WRRAB",
            "text": "I’ve always seen Il Gigante in Ridgewood busy, so I finally decided to try it out and see what the hype is about.\n\nThe wine selection was great, and the meat and cheese board was a solid start. Unfortunately, I was very disappointed with the linguine allo scoglio (seafood pasta). It lacked the depth of flavor I expected, and the mussels were definitely not fresh. They tasted like old frozen mussels that had been defrosted — the flavor was off and even a bit stinky. Having grown up eating fresh mussels every summer, this was a big letdown and very noticeable.\n\nThe cacio e pepe was fine, though nothing special, and the cotoletta alla Bolognese was not for me. I only ordered it because the server recommended it and described it as more of a small appetizer, but when it came out it turned out to be a full entrée. It was far too heavy for what I expected, and we ended up forcing ourselves to eat it.\n\nOverall, the atmosphere is nice and the menu does look authentically Italian, but I was hoping for much better execution on the pasta dishes. If I return, it would likely be just for drinks and the cheese board, but not the main food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwM1dtZzJiemR6TFdaclUySkpSR280VkdsWWIwRRAB",
            "text": "Very pretty restaurant in a great space on a cute block in a lovely area. Service is attentive, knowledgeable and welcoming. Food is refined comfort yummy (and surprisingly the best lasagna I have ever had because I've had like sooo many). Prices are not bad. You will love it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oR2VHTjVlRWRDYVRSWlUzaFpURk5WUWtKRlJuYxAB",
            "text": "Absolutely incredible!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNVQxVTBUWHA0U0dOVmNHWTJNSEJqU2tKamVtYxAB",
            "text": "⭐️⭐️⭐️\nCame in for dinner and waited about 30 minutes for a table (expected and fine). Once seated though, no one offered water or even took a drink order for quite a while. When our server finally came, we had to order everything all at once, which made the meal feel a bit rushed when I was hoping to enjoy a proper dinner with my friend.\n\nWe started with the pecorina salad and the pulpo & potato special appetizer — both were excellent! Unfortunately, the pasta was disappointing. We ordered the linguini allo scoglio and the cacio e pepe, and both dishes came out very cold, to the point where the sauces had congealed. After waiting over 20 minutes for the pasta and since the restaurant was close to closing, I didn’t bother sending them back.\n\nThe atmosphere and vibe are great, and I’ll definitely come back for drinks and appetizers at the bar — but I’ll likely skip the pasta next time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVk9FbHlkelpxYUZWb1VWcFdjVGswTW5obWMzYxAB",
            "text": "Phenomenal!! We had a wonderful night.  Thank you!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNGJHWjZaR2d6UzA0MVIyNVFhVE0yWmxkbk5XYxAB",
            "text": "Owner is so friendly, as is the rest of the staff. Such a lovely dinner! Got a bottle of the barbaresco, meatballs, lasagna, the gramigna, and the cotoletta- all of which were insanely delicious and flavorful. Can’t wait to come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNFdsRndiVnBmY1ZobWVEQkRlVzV5UnpSdVFVRRAB",
            "text": "lovely, affordable neighborhood Italian spot. The host was very friendly and accommodating! he helped my girlfriend and I find the perfect table! food and drinks are yummy, especially the lasagna. great spot for a variety of occasions!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3M2VHNUNiM0pKYVRoTWNYRkRaSEk1U1cxQ1RIYxAB",
            "text": "Finally tried this place for dinner and the food was amazing and reasonably priced. Service was excellent as well. Place was a little loud and warm inside unfortunately but I can't really complain about that."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS1IxUlNUVlpLTTBWdWVqaEdSMGhRUVdwMFEzYxAB",
            "text": "A wonderful surprise in the neighborhood, a true giant among Italian 🇮🇹 trattorias in the area, with really good offerings from their uncluttered menu, the salads and pasta dishes in particular.  Typically packed in the evenings, but still cozy and rather relaxed, and not at all loud.  Rustic interiors add a nice timeless touch.  Friendly and neighborly staff and crew, so apt for a ‘hood like Ridgewood.  Photos are from our second visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210b1NXMWtZMDlVYXkxaFUxWnBhVlExTlVaMFpFRRAB",
            "text": "we got their specials for the day. the tomato salad and burrata with prosciutto. they were delicious, perfect for appetizers. bucatini was great and we also got the pork chop, but i think it would be a bit better with pepper but that’s just my preference. interior is great! it looks lived in but feels chic and inviting at the same time. it’s not pretentious at all. drinks were good and a lot of options for dessert! also their olive oil tastes good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SelpqUmFjemh2U21GR1gzbDJOV1I2Um1KdE9YYxAB",
            "text": "A very warming and reasonably priced meal. The staff were friendly, and the corner location allows a lot of people watching and light into the place. The food hits well above it's price point, and I recommend getting a few things to share."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201ME1HUTNNakJwYVRrd2FqUXdTSEJNVG5GU1oyYxAB",
            "text": "This place is very cute, although it can get a little loud just because of the acoustics in the space. It was nice to hear the server and some clients speaking Italian while we were there, reminds me of my family and made it feel very authentic. The menu is very well priced and made for a pretty affordable good meal! The crostini are good but the artichoke one is far superior to the tomato, I was expecting a blend of the two. The pasta noodles themselves are very good, I would come back and try some additional pastas."
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UFdHZFZXbDlNWlhGRGJtaDJaVGRQU0RaQkxYYxAB",
            "text": "Fantastic. Great classic dishes at normal prices (these days is hard to find) Ottimo. Piatti classici, prezzi normali. Consiglio a tutti."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWk9EVklaVzF1TWpCSE5EZENUMmRMTUZWdE0xRRAB",
            "text": "I live in the neighborhood and love your restaurant. Each time we go it has been improving. Wine selection is fantastic and very well priced for its quality. Appetizers, salads and meat n cheese were amazing. Pasta dishes were banging. Only minor criticism was to tell the sous chefs to ease up on the salt on the chicken. It was really a great dish (very tender), but a little too much sodium. Much Love to the Il Gigante staff. Service was amazing.Thank you for a great night out!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSR2RsbzBiR0ptYUhCVVpVRlpiRzVJU0hsMU1XYxAB",
            "text": "Nice neighborhood trattoria 🔆 enjoyed a lot of things about this restaurant. The atmosphere is great, with a chic interior, great branding, and excellent music. Elevated feeling, and without breaking the bank 😅\n\nMy table split the Tagliere del Gigante and the Pecorina, as well as the tiramisu for dessert, which was amazing! I enjoyed the diversity of flavors among these starters (though the anchovy dressing was a bit too strong for me on the salad). I ordered a homemade pasta, the Pappardelle al Ragù. It was good in flavor but a very small portion and a bit of a weird texture, in my opinion. Though that was overshadowed by the starters and dessert, I am excited to go again sometime, as there are many pastas to try."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWVJUZElXR3RXVW1NM05EWmxTWE4zZVhNelpVRRAB",
            "text": "Excellent customer service, food was amazing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNU0xOWZWMlpRY1hKNk9UUXhSbWhpU1dkWFEyYxAB",
            "text": "Unfortunately had to eat outside on an especially horrible summer day because of how much it was bumping but I didn’t mind by the end of this meal.\n\nThe waitstaff were super knowledgeable on the menu (as one would hope) and extremely comfortable and friendly. I learned a lot about digestives on the back of the dessert menu and the lady serving us was kind enough to bring a little sample.\n\nI highly recommend the sausage and beans—beautifully juicy and every bite was aromatic and flavorful. Just enough beans for me to dip some bread too (which I believe they make).\n\nThey are constantly bringing out more of their focaccia and gorgeous containers of olive oil. They’re freshly baked too and just the perfect oiliness, texture, and size. I couldn’t stop dipping it in stuff.\n\nYou can’t go wrong with any of their pastas. I got the sage and ricotta one and it balanced out the meatiness and flavor punch of everything I ate before. Beautifully buttery, slightly sweet, and an absolute abomination to everything I thought I knew.\n\nOne of the best tiramisu’s I’ve ever had at a restaurant too. Dang."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5emRGb3pVbTF4Y0dsV056aE9hRnA0UVZKUWJIYxAB",
            "text": "We are so happy to finally find an authentic Italian restaurant in the area. Pastas are always fresh and cooked just as it should be,the  service was amazing and the desert which I didn’t take a picture because it was impossible to wait to eat it was out of this world ( the Pana cotta) . Definitely our new favorite Italian restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSV1VYTTFOVGQyWHpGUWJISk1WRUZPVDNaaFJYYxAB",
            "text": "Il Gigante delivered everything I could’ve hoped for and more. From the moment we walked in, the vibe of the restaurant was warm, elegant, and full of character—perfect for a special night out.\n\nOur server, Sarah, was phenomenal. She was not only attentive and kind but incredibly knowledgeable about the menu. Her cocktail and food suggestions were spot-on. Speaking of cocktails—the espresso martini was hands down one of the best I’ve had. Bold, smooth, and perfectly balanced.\n\nWe had a party of seven, and each of us ordered a different dish. Not one person was disappointed. In fact, every single dish was so good it felt like we were all eating the best item on the menu. That kind of consistency is rare. Personally, it was the best Italian food I’ve ever had. The flavors, the freshness, the portion sizes—everything hit.\n\nIl Gigante is a standout spot for Italian cuisine, and I can’t recommend it highly enough. We’ll definitely be back."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VNUDkwT1dKazU3bkp3EAE",
            "text": "Tiramisu is good, everything else we tried wasn't amazing , very salty IMO"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeFNVVjBZbTlSWDNCRVpFSkVMWEpwV1hrMWVsRRAB",
            "text": "Absolutely delicious Italian food with great service by kind humans. My favorites were lasagna, spicy rigatoni, tiramisu, and the cherries with vanilla ice cream!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcmRFSkxSamRvTUVObVMwdzFja3R1WTNrM1RWRRAB",
            "text": "Food was delicious! Service was excellent. The wine list was accessible but well curated. Our group stayed late talking and enjoying ourselves. Hope you do the same :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taS1FrdFRWbXhHUXpSRE9HUTRUWEozU2pCblptYxAB",
            "text": "Top quality and delicious nuevo spins on italian classics. The Parmigiano Reggiano sauce for the veal cutlet was truly awesome, a very difficult task that they nailed. Ambience leveraged the historical aspects of the building combined with interesting touches, like antique folding rulers, reminiscent of the many Italian carpenters/laborers who used to live in the area.\n\nOnly critique, which is one I have with many Italian restaurants in America, is they served a doppio espresso in a cappuccino cup."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WGFYQjNXVk56YUc4eFVrOUNRV3hJZVU1SE9VRRAB",
            "text": "I really love this place but....\n\nIt is the middle of Summer in NYC and in the mid-90's, trying to dine in an non airconditioned restaurant is a horrible experience. You really need to either fix your current A/C or upgrade, it's unbearable and will not be back until temps cool.\n\nThat being said, the food is phenomenal, the service is great, and the atmosphere is a delight!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSb2JDMU9lRWxKV1dkNFZVbEhSalpSZDJneFVtYxAB",
            "text": "Was excited to try this place. Ordered the branzino main and it came out skin down, fused to wax paper and sitting in foil like takeout. Did not match the ambiance at all. Kind of embarrassing to eat, actually. Served with a few halves of grape tomatoes, a lemon wedge and sprigs of herb. Not sure what they were going for but they should be more transparent about their mains not coming with sides. My date ordered the breaded pork and it came swimming in a parmesan sauce that we thought/hoped was potato puree. The service was decent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205YVFrSXRWVWRyVDNOR05WRlphVFZwZUVWNWMzYxAB",
            "text": "the real deal"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SaFRqUjZNR1ZWU0ZsQ1dXVjFTRVpKYjJORVVWRRAB",
            "text": "Best italian spot!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMDRhZk5nEAE",
            "text": "Authentic Italian that fits right in. Food came out fast yet prepared with such care. The house focaccia really set the tone with fresh Italian olive oil. Burrata salad was refreshing to start out and the meatballs were light and fluffy. Lamb ragu was perfection. Prices were fair from the food to the wine. Customer service was pleasant and felt genuine as we communicated with one of the owners trying to get a reservation. 3 months in and these guys are off to a great start, get in while you can!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTFJHVldPR3BOTlhOSVJHSllXbnAxVW5NelQzYxAB",
            "text": "Il Gigante in Ridgewood has the vibe and potential of a true neighborhood trattoria, but our experience fell short in a few places.\n\nWe went in on a Friday night around 9 PM with reservations. We were seated right away, which was great. I’d definitely recommend sitting inside—it’s cozier and better for the vibe.\n\nThe service overall was friendly, but it felt stretched. The bartender seemed like they could’ve used a barback or extra help—it slowed things down. We weren’t informed about any daily specials, and no one offered us the dessert menu at the end, which felt like a miss.\n\nWe shared:\n•\t1 appetizer (slow-cooked Italian sausage with beans—the sausage was solid, but the beans were meh)\n•\t1 salad (Barbarossa salad - Roasted beets, whipped ricotta cheese, walnuts, in a balsamic dressing - portion was tiny, especially for the price)\n•\t1 pasta (tortelloni—nicely cooked but needed salt or punchier seasoning)\n•\t1 main (branzino—presentation was underwhelming, served in parchment paper and tin foil at the table, which took away from the plating).\n\nComplimentary focaccia was cold and not super inviting. Rustic bread was okay, but nothing special.\n\nPrice-wise, it’s not unreasonable: $88 before tax/tip ($105 total) for two people with a bottle of sparkling mineral water. But given the small portions, we actually left hungry, which is saying something for Italian.\n\nAmbiance is nice, the concept is appealing, and the ingredients seem quality, but execution was uneven. I think the reviews calling it “inconsistent” are pretty accurate.\n\nBottom line: good, not great. Needs work on service consistency, staff training, and portion sizing. I’d be hesitant to come back right away, but with some fine-tuning, it could really shine as a local spot."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBN0p2WTBnRRAB",
            "text": "High quality ingredients, big portions, well-priced and simply delicious!! Love this new neighborhood gem, the owners are so friendly and have created a wonderful ambience. Can’t wait to go back and try more dishes but on first visit, LOVED the cannellini beans with sausage, the pork chop and we had three pastas all equally yum (pesto pictured, but can’t go wrong with the pappardelle!)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPMnNsYmo5dkxEM05nEAE",
            "text": "WOW incredible experience. This place is dangerously delicious. I’ve lived in Ridgewood for 4 years now and haven’t quite found my “Italian spot”. I can now rest assured because THIS IS IT🤌🏼\n\n👋🏼 Started off with a warm welcome by one of the owners, Lorenzo. We didn’t have a reservation but he found us a cozy booth in the back after a short wait time. Super accommodating!\n\n🍝 The pasta was SO fresh and very clearly handmade. This place is as authentic as it gets — I lived in Italy for 5 months, so naturally I’m a pasta snob now lol.\n\nWe ordered:\n1. Gramigna alla Salsiccia ($19)— holy Flavortown!!! This dish blew my mind. 100/10 would recommend if you like sausage\n2. Pappardelle al Ragù ($20)— brought me back to Italy. So simple yet so profound at the same time\n3. Wine — you have the option to order a glass, carafe or bottle. We got the Chianti bottle ($57) which was *chefs kiss*\n*I found all of the prices to be very reasonable for the level of quality delivered.\n\nI will 100% be back!!!! Brava!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbk4yWDFnRRAB",
            "text": "The tiramisu was actually really good despite me not being a tiramisu fan. The crostini was a good appetizer. Ragu pappardelle was solid. I ordered the pacchrri but they gave me bucatini instead. The kitchen was closing so didn’t send it back but the bucatini needed more flavor. The burrata was eh"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdmFLSjFRRRAB",
            "text": "Came here for the first time with my partner. Right at 5 they were extremely busy! Even though the first seating happened all at once, service was not sacrificed. Everything came timely and all the staff was attentive and friendly.\n\nFood was incredible. Wish the meatballs were a bit firmer, but the flavor was incomparable.\n\nA delightful, romantic neighborhood restaurant with exceptional food and staff. We will most certainly be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dlBYazJ3RRAB",
            "text": "Where to begin when describing a flawless experience?! The warm, jovial service that's become increasingly rare in this city; the A+++ candle-lit, hip, and yet completely comfortable ambiance; or the expertly curated wine list? No, we'll start with the food: From fresh focaccia to roasted beets with the freshest-tasting whipped ricotta I've ever had, to delicate pastas, a lasagne that dreams are made of, and a tuscan tomato chicken that tastes like, well, Italy, there are no wrong turns on this menu. And don't get me started on dessert—highly recommend the affogato (no notes!), the perfectly layered tiramisu, and simple gelato with a surprisingly complex cherry topping. TL;DR? Run, don't walk to il Gigante, assuming you can get a reservation—this place is hot for all the right reasons. Can't wait to come back on the regular!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQdjgxb3JpX2NuaWpRRRAB",
            "text": "Il Gigante is a fantastic new addition to the neighborhood. The owner came by to chat and was incredibly welcoming, which set the tone for a great meal. We started with a delicious sausage and a fresh, perfectly dressed salad, followed by a standout bone-in pork chop wrapped in prosciutto with a rich, cheesy cream sauce, and a phenomenal pappardelle. We’ll definitely be back—and are crossing our fingers they get their liquor license soon!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcjhxM05REAE",
            "text": "It's a lovely spot! It was opened recently so I imagine it'll get only better. The service there is very friendly and the atmosphere is very nice. Good place to have some pasta and good wine based drinks."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3Mkt5bGZREAE",
            "text": "If you want good Italian food this place was not it. The pasta was soggy and bland and just lacks taste. Rustico Taverna on Fresh Pond is way better as well as Joe’s on Forest. I was excited by the reviews to try this place out but it seems most are either paid for or made by people with no taste buds… hope they improve in the future."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneklDYlpnEAE",
            "text": "Il Gigante in Ridgewood, Queens is a hidden gem! The Italian food here is absolutely delicious—every bite was packed with authentic flavor. The service was top-notch, friendly, and attentive, making the whole experience even better. I…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRckxMWDlnRRAB",
            "text": "Eating at this new spot feels like you’re watching Hamilton off-Broadway before it was discovered. A line almost out the door on a Wednesday night — and well worth it. My mother-in-law said it was one of the best Italian meals she ever had which is all you need to know. Come for the amazing pastas, stay for the top-notch decor and service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfeEtYdDVBRRAB",
            "text": "This place rocks! Went opening night with a larger party and had an awesome time. We ordered 6 different pastas (lasagna and arrabbiata were insane but all were delicious!), pecorina salad, large tagliere (get this!), calamari, baked cauliflower and all the desserts. Food was A++, service is top tier and authentically Italian and the ambiance was super cozy. Il Gigante you have my heart! I'll be back very soon!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OFlQNmZREAE",
            "text": "I’m so lucky this place opened in my neighborhood. My girlfriend and I had a perfect birthday meal here! The food, the wine, the music, the ambiance - I wouldn’t change a thing. This is a perfect, cozy neighborhood spot with great prices, homemade pasta and carafes of wine. A new favorite for sure. Make sure to order the cotoletta, you won’t regret it. Thank you to Jacopo and our waiter for making my bday meal so special!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdVNXeDZNVWh3U25wSVVVNXpWbTFEY3psa2FuYxAB",
            "text": "Absolutely incredible. Quick and friendly service, wonderful atmosphere, and INCREDIBLE food. Will be back, will tell my friends to be back. Lots of other nice places in the area I’ve been to fall behind on at least one thing either food or service, but this place was as attentive as their food was delicious. The pasta is unmatched. The best thing to happen to my tongue since Faro in bk closed. Couldn’t have been happier."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeGFUQklNamRuU1dVNVgyZHNhMEpwVUhwTVJsRRAB",
            "text": "Similar to what others have said, this place has so much potential. I enjoyed the ambiance and found the room to be cool and cozy. Overall the food was decent, but not groundbreaking. We ordered the beans and sausage, watermelon salad, lasagna, and chicken. I found the food to be a bit salty, but not offensive. Everything was okay, not amazing. We also ordered the flourless chocolate cake and I felt cheated by how small of a portion they served us. It was barely enough for one person. The service was pretty bad. Our server never introduced herself, she kind of forgot we even sat down, and had to be reminded by the other servers that we were still waiting on the bill. I’m being specific in my comments because I think this place could really be a neighborhood gem and everything that we experienced is fixable."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNFltdmxnRRAB",
            "text": "The food here is so incredible! Went here for date night/birthday dinner; they were so sweet to us and the vibe was perfect. The wine was great, pasta was outstanding, but the cotoletta alla bolognese was an absolute experience. Highly recommend, all around!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMFgwNU5VbFJtTFhGQlJrSjJjR0ZQZUhGak0zYxAB",
            "text": "Sat at the bar for brunch, ordinarily would not bother me, but during our meal there were empty tables.   But that was quickly overlooked as the food was spectacular.  Flavorful as you would expect (no gimmicks) and overall a nice warming place to have a meal with family and close friends. Reminds me of meals in Ostuni."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVeVFXeEVaSFJCY21SblJFUk9hVkZrUlRoUloxRRAB",
            "text": "So insanely good. Tried four separate dishes and they were stellar. This will be a repeat spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOM2RIWXdWV0pyYTBGUlVtRjJNRVppYVZsWFRIYxAB",
            "text": "The food is made to order and is so incredibly fresh. My wife and mother in law came here for an early dinner, and EVERYTHING was fantastic. The sausage app and beans was so lean and flavorful. Tri color salad was so fresh.\n\nPastas were all amazing! So fresh.\n\nBest dessert I’ve had in a while, the Afagato! Gelato is amazing.\n\nService was excellent.\n\nWe will be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveGFtRUlnEAE",
            "text": "This place was absolutely amazing. I can’t wait to come back, the burrata, meatballs and lasagna was so tasty. The portions and the prices are unmatched I hope it stays that way. One of the best tirmasui I have ever eaten. Lorenzo was so hospitable and can’t wait to come back with my brother or my family. I love how this area has like 5 to 6 really solid dinner choices all within walking distance. This will definitely be in my rotation. It’s a place if you live close by you would want to come weekly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMmRUU1B3EAE",
            "text": "Il Gigante is a warm and wonderful authentic trattoria. The food is very good and the ingredients are fresh. I am Italian, and yes I can make much of this food myself but I don’t always want to take out my pasta maker. It’s great to have someone in the neighborhood who can make this for me and my wife without having to clean up the kitchen afterwards. The owner is so kind and gracious. I’m wishing Gigante Buon Fortuna."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ3EzUGxnRRAB",
            "text": "Absolutely amazing experience!\nWe went to this Italian restaurant yesterday and everything was incredible — the food was absolutely delicious and the service was outstanding. Every dish was full of flavor and made with care. The staff was friendly, attentive, and made us feel truly welcome. We can’t wait to go back!\nThank you Nicole and Niccolò"
        }
    ],
    "reviews_count": 73
}