{
    "name": "Connolly's Corner",
    "place_id": "ChIJ05LiYfZewokRIRuLbmFmXU4",
    "grid": "QN5",
    "address": "71-15 Grand Ave, Maspeth, NY 11378, USA",
    "rating": 4.5,
    "user_ratings_total": 894,
    "phone_number": "(718) 565-7383",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaFYwbHlhWGRYVUVWaGNFMUhMVVJtYVRsV2FtYxAB",
            "text": "This is a bar but has back rooms for events. We were there for an event and it was great. We had great service and the food was so good! Can't wait for the next event here. We'll be back 😊"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsd04wSjNSRmRKVDJwV01EaFNhbGh5TUZKc2FXYxAB",
            "text": "Bridget is the most rude person I have ever come across. I came to book the place looked at me up and down told me to go and sit down and never came i was waiting for 20 mins."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTGQySjVSVVpxZUUxclJWZHNTMHh4TVd0YWNrRRAB",
            "text": "What I liked most about Connollys was the COMMUNITY FEEL.  You can tell it's a local crowd there to enjoy good times and keep the positive energy flowing.  It really stands out.  Everyone was downing copious wings.  Beers were cold and…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWWNuUjJNRFZNZW05cFRUTTVNMXB0VkdwSVozYxAB",
            "text": "Monthly meeting of old bikers they take care of us"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSa1RXVTFXalJoWjI5M1NqVm5VMmRWYWtaMGJsRRAB",
            "text": "I love this place,  we've had a number of parties here and their very accommodating and the food is outstanding and the service is top notch.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMWNWaERNM2xtTTBGalVFZExha3h3V0U1TldrRRAB",
            "text": "Food was great service was nice and the atmosphere was good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObU5EZGxSekprYVd0a1MxQTVYM1kyVlRWYWExRRAB",
            "text": "Great place with good food, excellent service and a lovely outdoor space. Private rooms for parties and lots of fun music and entertainment events.\nVery reasonably priced!!!\nSpecial shout out to our recent servers Cat and Julia who work  exceptionally hard and made us fell very welcomed. The hostess/manager is also very warm and friendly.\nDefinitely recommend!"
        },
        {
            "date": "2달 전",
            "language": "pt",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weFkxUTRWRzVwTUhFd2VrWTNhazlIU2paZlJFRRAB",
            "text": "Ótima oferta de marcas de cervejas. Mas, atendimento péssimo, sem educação e paciência."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMWFtRlRPVXBTVUU1aFduWmZjR3Q2UjI1SGMwRRAB",
            "text": "Where me and the boys always meet up!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGR1Uwd3pUelEzTWpoZlRreHZXVzFYVVZsdlNtYxAB",
            "text": "Food was very good. Server was very nice"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3N3VMQzlBRRAB",
            "text": "Always excellent"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cFJFTkhPVzl6Y0dVMGNGZFVOMUJ6VTNoWFdWRRAB",
            "text": "So good and fresh ground chicken so good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paZlMySlNZek5hV201MmNtSnNSRkp5YzFWWVRWRRAB",
            "text": "awesome bar. been coming here for years. food and drinks were great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210blJtZDJZemxsWm5SeVNEVkpjalJwUnpKa1QzYxAB",
            "text": "Love Connollys place.  Food,  drinks r awesome.  Waitress is cool.  Awesome ppl.  Food delicious 😋 yummy 😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRME0xZEVNVkJvTTFWNFduaFRTWHBPT0hZMVZYYxAB",
            "text": "Wife and I arrived at 1:00pm and the place was fairly empty. Place is large with tv screens behind bar. Ordered full rack of  spare ribs which came with potatoe wedges and cole slaw. The meat was so delicious and tender and fell off the bone upon touch. Nice sized portion which I would definitely recommend. Wife ordered 6 jumbo shrimp and linguine which came in a lemon sauce. She loved it and it was so large that she brought home leftovers. Service was excellent and prices were reasonable. Will definitely be back to try out other items on menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VVNHdEJlbUUzZG5GdlFtRlFWVnBYWVVSTVRtYxAB",
            "text": "Good food, good service, friendly employees.\nNo complaints"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oR2RWbGtaMEZoWmtsV1dEUnRhbW95VmxONVozYxAB",
            "text": "Solid neighborhood spot in Queens. The atmosphere is relaxed and welcoming, making it a great place to unwind with friends or catch a game. It has that classic local bar feel that’s hard to find these days.\n\nThe staff are friendly and the service is consistent. Drinks are reasonably priced, and the food is decent nothing fancy, but it hits the spot. It’s the kind of place where you feel comfortable hanging out for a while.\n\nDefinitely worth a visit if you’re in the area and want a laid-back spot with good vibes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRldYWmtRME5mV0RCM2NXMUdhR1kwY0dnNVJHYxAB",
            "text": "Absolutely love Connolly’s Corner in Maspeth NY, from Bridgette the amazing manager  to Elle the kind sweet waitress to Julie and Dana the awesome bartender’s and to the rest of the amazing staff who make you like you part of the team\nConnolly’s is my go to place, especially when I need to relax and enjoy the delicious meal in a warm and inviting environment."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twYVdraG1TVjk2VTBKUWVDMTRVa1p6VDNOamMyYxAB",
            "text": "Great place for large and small gatherings. I have never been disappointed with the establishment."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNLS1vZURNeC1pN09BEAE",
            "text": "We rented a party room and the experience was not great. We paid for 1-5 pm and they started cleaning everything up at 4:20 when our guests were still there. They shut off our music and was lowering our music throughout the entire party. At 4:40 the manager Bridget was extremely rude and she came in and said “Can we wrap this up, I have another party starting after this” Why book another party then when we paid until 5pm. We marked every guest as they arrived and ended up with a total of 54 adults. She was very passive aggressive and condescending in her tone when she insisted that her and her entire staff counted 58 adults eating. We explained that couldn’t be possible because we only had 59 guests on our list and 4 of them didn’t show. She also said she served 3 kids plates, however we had 4 kids on our list but only 3 attended. When she agreed to charge us for the 54 adults instead of the 58, she then added a 4th kid who wasn’t there. When I tried to clarify why she added another kid she snatched a paper I was showing her out of my hand 3 times and immediately became argumentative. Then she dismissed me and walked over to my mom to begin arguing with her. The next day my sister attended a party for another event and they had a live rock band that they didn’t seem concerned with the noise level, it was much louder than our music that they kept lowering and eventually shut off, they kept the food out and allowed guest to pack home food, meanwhile ours was packed up before our guests could even grab seconds and one paid guest didn’t even get to eat because it was already gone. Same with the the cake. Very rushed for some reason. I believe she was being racist because we were all hispanic. I’m so upset with her behavior."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dWZETnRBRRAB",
            "text": "The place to be for a quick bite to eat or for a few hours watching sports at the bar"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKWG42TXZKc19yYnhBRRAB",
            "text": "The finest restaurant in Maspeth."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMzl2VVZREAE",
            "text": "Loved it. They had a special menu for Easter but still good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdUkyZWN3EAE",
            "text": "A real REAL bar  great cold bottles of beer  they have pride  delivious food clean  nice looking establishment   i really like it!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3czVDMVlREAE",
            "text": "Good food. Only complaint is that mixed drinks are weak and nowhere need 8oz and loses with ice. , skimpy for $15 bucks a pop, for a local bar, I pay less then that or same at night clubs"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3N3FUQlZBEAE",
            "text": "Most relaxing place ever"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNVBYNE9REAE",
            "text": "Best spot in Queens, loved the food, the atmosphere and the staff especially Marie. Such a sweet and lovely lady. She will take care of you I promise. Ask for Marie she’s amazing. ❤️ overall experience 10/10"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRLVlqZml3RRAB",
            "text": "Had the 1/2 burger blue cheese and mushrooms buffalo wings excellent"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcm9uLTZnRRAB",
            "text": "Staff did rite buy us  good food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnb3NUMlpBEAE",
            "text": "Went to see a friend's band play there and found the place to be very nice. Service was good and so was the food."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmamNISDZBRRAB",
            "text": "Connolly’s is our Family go to place! We’ve shared many momentous moments there especially my daughter’s  Babyshower. Ella our waitress was Spectacular. The guys were very attentive. Bridgette is a dream come true. Everyone was equally impressed. I usually get sweet  potato fries and a burger. It was great to see their party menu.They also have very decadent desserts! Yum yum"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN2ZHTTVBRRAB",
            "text": "Great servers. Looking at you Julie and Gabby. always remember their regulars and make newcomers feel welcome. I'd give the atmosphere 5 stars but during the day it's a little quiet and relaxed and i understand not everyone likes that. but great place. Great  people been going there since we worked in the neighborhood a few years back. still make the trek half a decade later for the Great experience. prices include drinks in my review and we've had lunch and dinner."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OXN5X2p3RRAB",
            "text": "I attended an Anniversary party a few weeks ago 6/2024. The staff was so professional and friendly.  The private room was very nice and the food was good.  I'll definitely recommend Connolly's Corner 👌🏾"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNk1DNUpREAE",
            "text": "Brittany was so nice and accommodating!! Food and service was great!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdnQ2Rkd3EAE",
            "text": "great night with friends , amazing atmosphere. awesome service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOXNtWUl3EAE",
            "text": "Excellent service, delicious food. Great music plays while you enjoy a very nice ambient location."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzLUxEOEZREAE",
            "text": "The atmosphere is wonderful,  the service it excellent,  the food not so great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMnJfNWlnRRAB",
            "text": "Great place, hadn't been here in a few years. Came in this past Saturday to watch a friend's band. Food and drinks were great... Service excellent. Reasonable prices, nice decor. We will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYODl1QWlRRRAB",
            "text": "the food is not bad but watch out if you going to make a party at Connolly's then ask for different server then the young girl with dark hair in low ponytail. she is rude, she makes disgusted face and serves guest with attitude like she doesn't want to serve you.\nI don't recommend this place because of her!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdDhYMFlnEAE",
            "text": "Typical noisy Sunday football, but the food is so good and the draft beer choices are excellent.  Cannot go wrong!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNkx6Nm93RRAB",
            "text": "The food is amazing I ordered the chicken marsala, which is the best chicken Marcella I’ve ever ever had in my whole life. The best all around service and food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOE9lQ3dRRRAB",
            "text": "Went to a surprise 70th birthday party which was really nice. Had a good time. The staff was always there to get whatever you needed. The food was very good. I enjoyed everything at the buffet especially the seafood with bow tie macaroni in a delicious red sauce. I even dunked my bread in my sauce (just like at home) The only problem is there is no place to park. Not living in Queens it's hard to know and to find a place to put your car. We finally did find a parking spot about 3-4 blocks away. Everything else was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudHZmbVFBEAE",
            "text": "It was a work thing. I really enjoyed the retractable roof. The fresh air. Interesting idea."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuOEtXV3hRRRAB",
            "text": "Loved everything. Will be going back. Chicken tacos, lump crab cakes were good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUczdLOFpBEAE",
            "text": "We were here for my sister's 80th surprise birthday party.\n\nThey have some nice party spaces, emphasis on spaces. They can have more than one party separated from other parties all going on at the same time.\nThe food was good but given that it was party food, I don't feel competent to give it a five-star rating. The future I'll be happy to give it a rating.\nThe drinks are good. The food was good and I really like the bar atmosphere that they have outside of the party spaces. Dark wood large roomy booths you're not crowded in here at all.\nThe service staff were very attentive. I barely ever ran out of beer, they were just great. They cleaned up everything 123 so you weren't dealing with messy tables. They were really good.\nWe will return here in the future just to go there and taste the regular menu and have a nice dinner or lunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NTVpR1V3EAE",
            "text": "We arrived and were seated immediately. The servers were professional and courteous. They answered questions and were patient while we decided. The appetizer and the food came quickly but not unreasonably so. They seemed to have the timing down. We had fish tacos which were good, but not exceptional. I had a steak which was delicious and cooked as ordered. The twice baked potato was so so. It didn't match the quality of my steak or vegetables. My wife had a simple beet salad which h she enjoyed. Bill came quickly when requested. We will return again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvNV9EUE53EAE",
            "text": "This pub is a cool spot in general. The staff is friendly and service is quick. The menu is the right size for a pub and the menu items are good. The bar itself had a mix of an Irish pub and a sports bar rolled into one with several big…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkX1lYRFV3EAE",
            "text": "Great place to sit and enjoy a meal or just have a few drinks. Also you can have an event hosted here as well. The atmosphere is hit or miss depending on what day of the week or if any sports events are on. Food is usually on point unless it's super busy. But that is with most places. I always enjoy coming here. Brunch is also really good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybHFyT3FRRRAB",
            "text": "First time here and I enjoyed it. Good customer service. I was told their chicken quesadillas were good and they were! Their spring rolls and fried calamari were great!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaktXdFdnEAE",
            "text": "I have no idea why I never stopped here before, but I’m so glad I finally did!  Absolutely hands down the most delicious meal from appetizer to dessert. Perfectly prepared, professionally served by warm waitstaff that obviously enjoyed what they do.  I had split pea soup which was of perfect thickness, color and flavor. It was delicious and the soup cup had been warmed . Then I had a Caesar Salad, served on chilled plate, salad was cold , crispy and a classic Caesar.\nThen the highlight of the night. 14oz Black Angus steak NY strip. Cooked to perfection with crispy fried onions on top, a twice baked stuffed potato, excellent Fresh crisp mixed vegetables sautéed , Soooo good . Apple pie ala Mode obviously home made, the perfect ending .  If you’ve read my other reviews you’ll know I have a pet peeve, I like courses, I don’t mind waiting for the next course . I just don’t want everything at once which always seems to happen lately. I told the waitress once, just once and it all came as I requested. YOU MUST DINE HERE. It’s a bit noisy, but nothing is perfect . Connelly’s is damn close though 🌟🌟🌟🌟🌟🌟👏👏 Excellent"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlM0liSktREAE",
            "text": "Had an amazing experience here for me and my wife's Baby shower. The staff were on point and considerate and we got lucky with live music too. It was just fantastic"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPenQ2OV9BRRAB",
            "text": "We had a delicious dinner.  I had a wonderful beet salad . It looks great and tasted scrumptious.  My dessert was excellent.  The service was exceptional.  I would recommend going there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcEx2bExBEAE",
            "text": "Such a great place for food and drink. Staffs are so friendly"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJaEltdGVREAE",
            "text": "The venue space was was enough to hold about 80 people. Bridget was very informative and communicative through the entire booking. The food was really good as well. Definitely order the pernil. It's their best entree!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcU11SzBRRRAB",
            "text": "Muy buen servicio 😃 excelente comida muy rica 😋 preparada por el Cheff Ecuatoriano y muy buenos precios un lugar acojedor y muy nice jjj like"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbk9LR2hRRRAB",
            "text": "Nice place especially for getting together with friends or a party.  They have three different areas, two can be set up for parties and a main bar/dining area ...each without interfering with the others\n\nThe food is good, nothing amazing however nice portions, tastes good and what's warm comes out warm and what's cold comes out cold.\n\nThe service is really good. And take care of you with a yes yes even when you know they're busy. That's such a great feature!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqN3Z1WVRBEAE",
            "text": "Celebrated our son’s christening here and the food and service was outstanding! Diego was the main server & took care of our entire party. He was absolutely wonderful, respectful, & incredibly attentive to all of our guests. We would most definitely host another event here. We look forward to dining here again. Hoping to have Diego again in the future."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aVAyaWlnRRAB",
            "text": "Ended up in this spot by accident, my kid needed to use the restroom after a volleyball game and the bartender was so nice to her, we were gonna get something to eat elsewhere but decided they deserved a try for their kindness. The food was so good, she loved the mini burgers and I had quesadilla. We also got some shrimp tacos to go. We even got a nice goodnight, and thank you from a lady seated on one of the tables. Guess she's the owner. But all in all a very nice place. Highly recommended."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNemRqaUhnEAE",
            "text": "Very nice atmosphere and great drinks! Try the holiday Mule..has a little kick to it!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnbE1lMGlnRRAB",
            "text": "They have a B right now. The food is alright"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcUw3STdBRRAB",
            "text": "Great place to get together for a party. Good sized food portions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREanE3SGpBRRAB",
            "text": "Great neighborhood pub! First time there and I enjoyed the food! Our waitress was friendly and attentive. Recommend the warm portabella salad with steak, it was delicious and filling. Definitely will go back in the future"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MkpUTEl3EAE",
            "text": "I had a funeral luncheon for the death of my cousin. Not only was the food incredible. The service was amazing the waiter and waitresses were kind and so thoughtful and made a sad day brighter for going above and beyond in everything they did thank you 🙏"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDN0szSm5RRRAB",
            "text": "Just celebrated my sons 23rd birthday. The service was excellent. We sat in backyard garden. The food was incredibly delicious. Will definitely go again. Love supporting the local businesses. Thank you for an enjoyable evening. I highly recommend."
        }
    ],
    "reviews_count": 64
}