{
    "name": "Rustico Taverna",
    "place_id": "ChIJqRapAiVfwokRxeEtL4jvBCI",
    "grid": "QN5",
    "address": "65-17 Fresh Pond Rd, Ridgewood, NY 11385, USA",
    "rating": 4.6,
    "user_ratings_total": 235,
    "phone_number": "(347) 799-2880",
    "reviews": [
        {
            "date": "수정일: 1주 전",
            "language": "it",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlai1pOFZREAE",
            "text": "Il capo ha iniziato a parlare proprio mentre stavo parlando io. Il cibo è ottimo, ma la prossima volta non verrò qui a ritirare il cibo nei fine settimana. Lo stavo salutando in italiano, ma lui ha semplicemente iniziato a parlare prima che finissi di salutarlo. Mi ero dimenticato che mi era già successo quasi sei mesi fa.\nThe boss just purposely start speaking while I am talking. The food is great but next time I am not going to come here pick up on weekend and holiday nights. I was greeting him in Italian but he simply start talking while I did not finish greeting him hello and good bye. I forgot that this happened to me before which is nearly half a year ago."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNFlrWklRbDlRWWtaRVl6aEhORXM1VlZCR2IyYxAB",
            "text": "Amazing staff and food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSWQyc3dWR3N3U1V0SVNrOWpNVE5LZG5sMFpIYxAB",
            "text": "Love this joint!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaWEzRnpSbnBvVDFKa2FUaFZPVkJvU21aYWFGRRAB",
            "text": "Absolutely amazing service. The manager is hilarious and makes you feel very welcome. And the chef even prepared a special dish for us! The rest of the food was okay but the panna Cotta was very tasty."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQ2FYQldSVmRMVW5aT2RUVm1OVUZ1UWpGeE4yYxAB",
            "text": "This might be the best Italian food I’ve had in NYC. I know, that’s a bold statement! But the food just melts in your mouth. The owner and the staff are very warm and welcoming. For me, personally, it brings back memories of an old school Italian restaurant I grew up going to with my parents in Jersey. I highly recommend the burrata & prosciutto insalata. I’ve had the chicken cutlet with the creamy Gorgonzola sauce with prosciutto over the roasted potatoes. Wow wow wow! This is honestly one of the best meals I’ve ever had. I’ve ordered it twice in the past two weeks. 😬 topped off with an aperol spritz! 😍 bravo! I’m sure we will be back here very soon. I can’t wait to try one of the pasta dishes. Thank you for having us! 🩷"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNE5EbEJUMEkwYUdacFUwbGtjWFJ1ZGxCSmFrRRAB",
            "text": "Man I’ve Lived here for 4 years and I think this is the best Italian in nyc 🤯 I got take out and it was incredible. The owner was very nice and knows his stuff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTFNYcG9aa3RKTVU1YWFrdDFWV05WT0hGVFdWRRAB",
            "text": "Nice place for dinner authentic and delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsc1RtZFpla3B0Y1ZSSUxYcFdSekI1WDJJeWQxRRAB",
            "text": "Food was delicious and very authentic. Sandro was a great host very personable and funny. We will try brick oven pizza next visit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aVNHMXZWRXhFZWpGWVJXSlFUVWRmTlVOdVExRRAB",
            "text": "Had dinner here with my mom and a friend. Everyone enjoyed their main dish and the appetizers. We ordered burrata which came with prosciutto, avocado salad, fettuccine Alfredo with shrimp and truffle, salmon with potatoes and brocolini (the sauce was great), and seafood pasta. We had a delicious sauvignon blanc..it was a little sweet though. Would definitely come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TWJETnJNbEowWmxrdGVIRTBiRFV0WDNadGRYYxAB",
            "text": "Amazing pizza !!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TFdqUjBUMEZRVDBVNVkzaEhhMGxLVDAweWIxRRAB",
            "text": "I have lived in NYC for 35 years and traveled to Italy for 30 of those years. This place has fantastic Italian food. I just had pasta with mushrooms and the waiter shaved a giant black truffle over my pasta just like in Italy in the summer. It was just perfectly delicious and just like being in Italy. The beer is also amazing. They have Dolomoti beer. I can't recommend this place enough."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeVVUTnRaVzUxYVRSU1ZuaGxSemREUmpSNk1IYxAB",
            "text": "Sandro I love you! You are the reason why I eat Italian food. Rustico is the best! I recommend everything! My personal favorite is seafood linguine. Not on the menu, but if you ask for it, they will bring you the most delicious seafood linguine in the world. Geovani and the team in the kitchen are the greatest… Enjoy my friends.\nSincerely Jason and Liza"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSFkwMDVWMDFGVW1SNU4zcFBaRWxWWjJOVmJHYxAB",
            "text": "The owner is alot of fun"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYWszTEROcjl1cUp3EAE",
            "text": "Excellent - authentic - better than any hype spot on anyone’s list !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLUx5YUw1OExXMnlBRRAB",
            "text": "I absolutely love this local Italian gem! The wine selection is impressive, and the owner adds a warm, welcoming touch to the experience. We ordered the Tartufata pizza, which was a perfect blend of mozzarella, mushrooms, and a generous topping of Parmesan cheese and truffle oil--simply delicious. We also tried the linguine with clams, and the sauce was incredibly rich and flavorful, with a perfect balance of sweetness. Highly recommend this place for a delightful and authentic Italian dining experience!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VNNmQtc0h0X3ZDV2F3EAE",
            "text": "Our table was reserved for a Mother's day dinner, we were seated and we did not recieve our menus until I asked for them about an hour and a half later. It seemed as if the staff forgot about us as they took their time to take our orders, and it was noticed that people who arrived after us had their orders taken and food served before us."
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYkVsdTZuam9EbjJRRRAB",
            "text": "Accueil parfait, table à l’ombre sur la terrasse  à l étage avec vue sur la mer.  Moussaka, un vrai délice ! Rapport qualité/prix 👍🏻. Je recommande."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcEtfelJ3EAE",
            "text": "The food was delicious, well seasoned and flavorful. The staff was friendly, attentive, prompt and inviting. Very clean and smells wonderful. I will be back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbDk3Nm5RRRAB",
            "text": "This is a diamond in the rough.   Food amazing.  The service feels like home.  Not a bad wine selection.  And a very affordable price point"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaXBXOGZBEAE",
            "text": "Always delicious 😋 always fresh , very friendly atmosphere.…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3d283ZmdBRRAB",
            "text": "The food was excellent, the owner very funny and also knowledgeable about almost everything related to Italian cooking, we had a great time. The price was ok as well"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNmVud3V3RRAB",
            "text": "Birthday delivery good pizza & pasta & wine too felt like home cooked very tasty"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRZ2NxNFhnEAE",
            "text": "Small restaurant offering excellent Italian dishes."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaGNIQnVnRRAB",
            "text": "Rustico Taverna in Ridgewood, Queens, offers an authentic Italian dining experience that captures the essence of Italy. The menu features irresistible traditional dishes, complemented by a friendly atmosphere and a curated selection of good wines. Patrons have praised the warm and welcoming service, noting the homey ambiance that makes each visit special. The owner adds a personal touch, ensuring guests feel like part of the family. Whether you're a local or visiting, Rustico Taverna is a must-visit destination for those seeking genuine Italian cuisine in a cozy setting."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnLWFxRzl3RRAB",
            "text": "The staff is kind, the food is delicious, the owner is hilarious, I love it here! Highly recommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOW9Da29nRRAB",
            "text": "Absolutely amazing food and service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdHBmLWhnRRAB",
            "text": "Great people above 5 star food"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOTc3M2R3EAE",
            "text": "I used to love rustico taverna but they recently changed their cheese and it’s become much worse. Hoping they change it back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmaU5iM29RRRAB",
            "text": "Food was amazing. The service was top notch. The owner made you feel like family."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmOXVYa1lnEAE",
            "text": "Such a beautiful decor and warm atmosphere. The staff is so polite and sweet. Great service. The Octopus dish is the best you can ever taste, so delicious  . Juicy and tender. The Garbanzo beans pure provides a great touch of taste. If you’re in queens, you must come here n see for yourself."
        },
        {
            "date": "11달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzc2FiNXFRRRAB",
            "text": "Pyszne jedzonko i profesjonalny serwis, polecam serdecznie."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOUs2eXB3RRAB",
            "text": "Rustico serves delicious food, especially the numerous varieties of pizza. I went there several times a week when they first opened and have been a regular up until moving out of the city. I recently visited Rustico and the place is consistent; I’m always warmly greeted by Sandro (the owner). He makes you feel at home. My default are the pizza margherita, tartufatta, and fried calamari. Every dish here is solid, including the dessert ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYM3B1RGhRRRAB",
            "text": "Absolutely the best Italian restaurant! The food was amazing, especially the pizza with high-quality ingredients. The shrimp bisque soup was very flavorful, and the homemade tiramisu was the best I’ve ever had. Highly recommend this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNE9mUTRBRRAB",
            "text": "Worst steak I’ve ever had. Fatty & grisly. Quite pricey too.  Took it home & threw it out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuczhiLVlBEAE",
            "text": "As Italian I can definitely say this place has real high quality Italian recipes and wines."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIOS1UZWx3RRAB",
            "text": "Food w as s good ,apple salad and Rustico Burger !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeDVPUVBnEAE",
            "text": "Hi I need to write a bad review because is not fare what the owner did , I was eating with a friends yesterday 09/08/24 , and was a lot people and I took a chair from other table, and the owner I think , told me in bad actitud and very very RUDE , he NEED THE 🪑 CHAIR, and he said I need to stand up ,because others CUSTOMERS NEED MY CHAIR ,  , I was there as a customer and my friend and I , we was eating ( and the account the bill was Hight by the way ) , and he was VERY RUDE IN FRONT TO EVERYONE THERE, and the FOOD WAS NOT FRESH, and POOR QUALITY FOOD and and SO SMALL PORTIONS OF FOOD , and THE PRICE VERY EXPENSIVE, honestly I DO NOT RECOMMENDS THIS PLACE , you don’t feel RESPECTED HERE AND THEY DONT CARE ABOUT “YOU” as a CUSTOMER, and in the end he DID NOT APOLOGIZE IT!. Sorry but I need to tell the true about the place !. Thanks. ⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIc2Nub0lBEAE",
            "text": "Visited this place for the first time. It’s a hidden gem. Food is excellent!!! I don’t usually write reviews for restaurant but this time it’s an exception, food was 10/10 , my entire family enjoyed their meal a lot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINGRUOS1nRRAB",
            "text": "Best Italian restaurant in ridgewood, excellent service, delicious food and great Italian people <3"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NC1DWXhnRRAB",
            "text": "Best place ever im CRYING, the food!!!! The vibe! Yes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidjhyVkFnEAE",
            "text": "The food was incredible, the people were very kind and the restaurant had a great atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyazZQdmFnEAE",
            "text": "Authentic Italian food.  Great service.   Beautiful decor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMXAzcXh3RRAB",
            "text": "Nice friendly staff.& good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcjZtWW1nRRAB",
            "text": "Again...almost a 5-star review on all accounts. There were, I believe, 12 of us after my Mothers funeral service. And some of us were not in the greatest mood. The owner of this establishment and his server (probably his son) put lots of smiles on lots of faces. They were the most personable and welcoming strangers I have ever had the pleasure to deal with. The food was incredible. They were awesome people and the service was impeccable! I had such a great experience here that I suggested to my siblings we return here every year on the anniversary of our Mom's passing. This establishment is a 'must' when coming back to Queens."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdWVycUdBEAE",
            "text": "this place is hidden away, really delicious, and thoughtful menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUclk2Zm1RRRAB",
            "text": "Rustico is a perfect neighborhood Italian spot perfect for date night, friends, or the family. Intimate but fun atmosphere opens to the street, and the inside proves that dining rooms can feel both communal and private at the same time.\n\nThe owner Sandro personally attends to his visitors, so that you want to come back just for how welcome you feel.\n\nThe food is top-tier, each dish overseen with quality and care. It's not your big Italian dining hall, and that's its biggest strength, because love and care runs through the food and atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeW82ZGh3RRAB",
            "text": "Really good food and really good pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOVo2MURBEAE",
            "text": "I just stopped here for the first time.\n...\nThis is now my favorite pizza ...\nAmazing!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeXQzQU9REAE",
            "text": "Good  and tasty pizza!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcV9MX1R3EAE",
            "text": "The chefs understand the assignment."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCZzRhWEdBEAE",
            "text": "Food is phenomenal! Waiters are attentive and this place doesn't disappoint! Food came out quick and was a lot. I think the sauce could have been a little tastier, however I would recommend this spot to anyone. Parking like anywhere here is difficult. Recommend walking everywhere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeHJueW93RRAB",
            "text": "Enjoyed the vibe here. Feels like a real local spot, even though it's only about a year old. Food was really good, portions were generous, and the staff was great. The owner was there and he was very friendly, shook my hand, asked me questions, and made sure we had a great dining experience. I could see he was very chatty with alot of the customers and it felt very welcoming. Would recommend this spot for a nice dinner if you're in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdjVfSmh3RRAB",
            "text": "Wonderful! Food was fantastic! The pasta is homemade. We got the buccatini with seafood, so good we ate down to the last drop of sauce! And the white pear pizza was awesome, usually don't like it but they did it well here! The service is old-school - owner shook my hand on the way in and was walking around cheersing with everyone. He made us a very strong martini :). And the dessert was sooo good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobzhhNTh3RRAB",
            "text": "If you're looking for authentic Italian cuisine in the heart of New York, then look no further than this gem of a restaurant. Tucked away on a quiet street, this mom and pop establishment offers some of the best pizza and eggplant pasta with fresh mozzarella you'll ever taste outside of Italy.\n\nThe pizza is simply sublime, with a crisp thin crust and a perfect blend of sauce and toppings. The flavors are bold and complex, with just the right amount of cheese, herbs, and spices to create a truly memorable experience.\n\nBut the real standout dish here is the eggplant pasta with fresh mozzarella. The pasta is cooked to perfection, with just the right amount of bite, and the eggplant is tender and bursting with flavor. The fresh mozzarella is the perfect finishing touch, adding a creamy, tangy flavor that complements the dish perfectly.\n\nWhat sets this restaurant apart from the rest is the attention to detail and the use of only the freshest, highest quality ingredients. You can taste the love and care that goes into every dish, and it's clear that the owners are passionate about providing their customers with an authentic Italian dining experience.\n\nThe atmosphere is cozy and inviting, with warm lighting and rustic decor that transports you straight to Italy. The owners are friendly and knowledgeable, always happy to recommend dishes and answer any questions you may have.\n\nOverall, if you're looking for a delicious, authentic Italian meal in New York, then this restaurant is a must-visit. The pizza and eggplant pasta with fresh mozzarella are simply out of this world, and the experience is as close to dining in Italy as you can get. Don't miss out on this hidden gem - your taste buds will thank you!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOU82bGp3RRAB",
            "text": "The owner was very nice the food was terrific. The olives that were brought were delicious. Would go back and try the pizza looked delicious"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHanJHNDdnRRAB",
            "text": "I Never knew this restaurant existed, and I went here for a Wednesday dinner. What great food from start to finish . Food was quick and delicious. Also, Great service and ambiance . If you have great company, good food , and great service  the experience is  so much better.👍🏻👍🏻…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHZ0l5cElBEAE",
            "text": "I've been to Rustico twice now and both times the food was out of this world. Everyone is amazing and super friendly. This is how you run a business people! Legit will be ordering take out today."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxZ3ZmOW5RRRAB",
            "text": "Sono andato a mangiare qui e ho trovato il cibo eccellente.\nLa qualità della carne è superlativa, ottima scelta dei vini e il caffè è veramente quello italiano .\nIl proprietario ti sa accogliere e ti fa sentire a casa. Consigliatissimo."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bGR5bzNBRRAB",
            "text": "The food was absolutely amazing. Some of the best Italian food I have ever eaten. The staff was wonderful. I can’t wait to go back and try some other dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NHF6VjFBRRAB",
            "text": "Great restaurant,  food is delicious, stuff is very nice. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eGViZTd3RRAB",
            "text": "This place is so good and these people are so nice! The prices aren’t crazy, portions are a plenty, and it is a nice place to go for a slightly upscale, but still relaxed meal. The menu is very creative to other options around Ridgewood.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNS11dzB3RRAB",
            "text": "I ordered takeout and it was actually very good!!!\nThe owner even called to let me know the order was ready which I thought was very thoughtful. I also love the fact that the meal comes with bread!\n\nI was starving and this left me satisfied;)! Will definitely come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcU5LVFhREAE",
            "text": "We live in the neighbourhood and have come here probably 10 times. Never been disappointed. We have had such wonderful pizzas, salads and pastas (actually, some pastas have been so outstanding that we just ate and enjoyed in silence) here. Prices are totally fair. But the best part is the atmosphere and service. The owner is usually there, and is so warm and genuine. He treats every person who comes in kind of like an old friend, and it is so nice to feel so welcome and at home. Just love this resto."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NE0tc25BRRAB",
            "text": "Pizza was good, spaghetti was horrible, very mushy and tasteless,  pasta and sausage dish as well, no taste. Disappointed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPLUpPSGJREAE",
            "text": "Food here is delicious and stuff is super frendly. The owner of the place always greets you by the door when you come in. I been here few times already and I’m definitely coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtaFlpVTJ3RRAB",
            "text": "Ordered at 9pm . Got the Risotto and Penne Alla Vodka , recieved a good risotto . But the penne alla vodka was old and tasted spoiled. I couldn’t even eat it , even my shrimp was a bit overcooked. Overall I’m just disappointed I was left…"
        },
        {
            "date": "2년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCcFpESVlnEAE",
            "text": "Pyszne jedzenie. Niestety nie zdążyłem zrobić zdjęć bo wcześniej wszystko zjedliśmy. Tak samo było z deserem.\n\nPolecam!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MWFMVVV3EAE",
            "text": "This is the best place for a comfortable quaint neighborhood dining experience  away from home at home."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdkxuR0ZBEAE",
            "text": "Calm simple restaurant with a kind and friendly owner. Sweet staff and great service 👍…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbWNla1FREAE",
            "text": "My first time at Rustico Restaurant, favorable atmosphere, very good service and good food .. (excellent grilled octopus) I definitely recommend this place!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdGZlT3N3RRAB",
            "text": "Amazing, loved the food as always and the service beyond perfect. Will def keep coming back. 3 times and counting :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwZ2NDRGFnEAE",
            "text": "I’ve only ever ordered from here on Uber eats but this has to be the best quality pasta for overall value.  I am obsessed with their vodka pasta, grandmas meatballs, and their chicken fingers. Really delicious and they even give you a little cookie for take away. Highly recommended and can’t wait to go in person."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSLUlyT3ZBRRAB",
            "text": "This place is awesome! Ordered from there 3 times this month and it was great every time. Very good delivery time, awesome pizza, eggplant parmigiana and gnocchi. Plus lovely cocktails and wine. My husband and I really enjoyed everything. ❤️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NjhUTllnEAE",
            "text": "I had an amazing dinner here! The waiter and waitress were very attentive.. The food was delicious!! It was my birthday and everyone made me feel so special! My mom is always complaining about someone food anytime we would go out with family and this is the first restaurant ever in life! she had no complaint about anything. It was a great experience I will never forget... thank you!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWNy1td19nRRAB",
            "text": "Please stay away from this place the experience was awful. I ordered a delivery through the slice app. I never received a phone call nobody rang the bell to tell me the pizzas were delivered. I go out to take the trash and I see one box lying on the floor cold and hard as a rock. I check my camera the delivery guy took the other box and ate it and left. I called the pizzeria told them what happened zero cares given and an attitude he just wanted to hang up on me. Slice was called and they said all they can do is give me 25% off for two pizzas I didn’t eat. If he did that with one who knows what he did with the other one."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhNDZyYmVREAE",
            "text": "My first time at this place food was delicious definitely I coming again to this place owner was so nice and polite is good for the business"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURONV9qVDJnRRAB",
            "text": "I ordered lasagna and there was a long strand of hair in it. They apologized and offered to make a new one but the portion they gave was half of my first order even if I didn’t eat any portion of  the lasagna with the hair in it. It’s a frustrating experience because I’m a regular customer and I’ve always loved coming to this restaurant."
        }
    ],
    "reviews_count": 77
}