{
    "name": "MuuMoo Foods",
    "place_id": "ChIJayMpU_lfwokRk0vNSM_6FMA",
    "grid": "QN5",
    "address": "60-54 Fresh Pond Rd, Maspeth, NY 11378, USA",
    "rating": 4.5,
    "user_ratings_total": 83,
    "phone_number": "(929) 666-5898",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SM1VUTnFlR1IyYVZSNkxXVm9RMDQ1WVVOdk5XYxAB",
            "text": "I came here with my wife a few days ago. I got the tavern sandwich, which was very good: it was freshly made and generously packed with meat and cheese. The pickles are also a  very nice touch. My wife got the zapiekanka, which was also fresh, flavorful, and filled with several ingredients. The owner (I believe he's the owner) is super nice and friendly, he chatted with us for several minutes. The only small minus is that there's no public restroom - the owner explained to us that he wanted to get one set up but a DOB issue came up. Nevertheless, I will definitely be returning here to try other items on the menu."
        },
        {
            "date": "4주 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbkxVbHlWRFJXWVZCb1ExVTRXR3c1YzJ4MVZsRRAB",
            "text": "Bardzo dobre obiady mają w dobrej cenie"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0a04wRXRjMDVuYlc5WldGWllibU0wVTJKWloxRRAB",
            "text": "Good homemade polish food\nNice coffee, espesially cappucino"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NFpVaE5ibnBqYTE5UWNuQkVVV3RyWlZkTGRYYxAB",
            "text": "Really great prices but also very amazing food. I highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KblkxSnNlR3hzYjJrMlNtUlhObU5pTjNSUVIwRRAB",
            "text": "It's a market with polish products and also food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPS3JocHlsa2JtX3pnRRAB",
            "text": "Ordered the Maspeth Zapiekanka. It was delicious and will def return. Loved the atmosphere it reminded me of the gas stations in Poland especially when I saw the hot dogs inside the bread like in Orlen, but even better cause they had cold cuts and home made prepared salads and foods like in a regular Polski sklep. As a Polish American it had a feel of the diaspora and homeland inside bundled in one."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKSFgxSkdpcVBMNm9RRRAB",
            "text": "I am sad to write this review as I very much enjoy their food.\nThe food over all is great and always tasty. Never had an issue when going in person.\nHowever, when I ordered twice through seamless, the first time they omitted one item from my order.\nToday, I ordered through seamless again, the driver who picked up my food delivered it to the incorrect address. When I reached out to seamless they provided me a credit and when I reordered the food because I genuinely wanted the food the restaurant decided not to fulfill the order despite the driver who picked up did something wrong. They should have done a better job investigating the actual issue."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaV9LSlZnEAE",
            "text": "The food could've been better. Sad to say I feel guilty writing this. The service was great! The customer service was there. They were sweet and kind. But food has potential.... the shop seemed clean and tidy. The establishment seemed polish although I could be wrong. I'd come back if food improves."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMk1MS0NnEAE",
            "text": "Great prices"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdnVqcGVBEAE",
            "text": "Great local place in Queens to get all of your Polish food. They have winter tea and Polish street food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnc2MtRWxRRRAB",
            "text": "The baked goods that they have are amazing and the staff is very sweet but I do not recommend the matcha if you are a matcha lover. I really would love them to improve this because there are no cafes in Maspeth that have matcha. The last…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMVBlSFBnEAE",
            "text": "Best zapiekna in town! Great selection of hot foods and cold cuts. Definitely worth stopping by"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfazZDNWZREAE",
            "text": "Super"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdUl2V1dREAE",
            "text": "I absolutely love this place. I visit frequently to purchase soups and dinners and cold cuts. For Christmas, we ordered catering for traditional style Polish Christmas Eve dinner and it was so delicious! As a Polish American it’s nice to…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeS1Tc3N3RRAB",
            "text": "Hi everyone! I absolutely recommend this place! Together with my friend, often we go there to grab lunch/dinner to go. Food is always delicious and fresh, the price is good too. We always feel welcomed there.\nI was checking the negative comments people posted out of curiosity. It seams to me like some angry people, unhappy with their everyday life's are just trying to make someone as miserable as they are.\nGo and try it for yourself before you believe in any of the negatives!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcXRDdXFnRRAB",
            "text": "Consistently fresh and delicious food. Large portions and reasonable prices. Authentic Polish dishes. Staff is super sweet too. Hight recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucjdXTnd3RRAB",
            "text": "Very nice, clean modern looking store. The girls working there are always super nice. Lunch platters are great! As well as sandwiches. Great spot to have in Maspeth !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdkoyMElnEAE",
            "text": "ALL CATERING WAS PROFFESIONAL,FOOD DELICIOUS,VERY NICE OWNERS. WE RECCOMEND SUCH COOPERATION WITH THEM TO EVERYONE. EVERYTHING WAS IN ACCORDANCE WITH THE ORDER!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3aGRubjB3RRAB",
            "text": "Very affordable, fresh delicious Polish food. Found that place by chance and just kept going.…"
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3d3JTVk1REAE",
            "text": "Polecam MuuMoo🤗🍀\nKilka razy już miałam okazję rozkoszować się smakiem tych przepysznych dań 🤗Każdy kto raz spróbował to napewno tutaj wtoci🤗🍀👍…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NzVxTlZnEAE",
            "text": "Food was phenomenal. Muumoo burger highly recommended. Green Paradise shake was refreshing and smooth. Raf is a good man!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cDV2Tk13EAE",
            "text": "Delicious! The MuuMoo Burger was really tasty, I enjoyed it thoroughly. I would recommend coming here ASAP!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeS1tNUhREAE",
            "text": "The food was delicious and the service was great!"
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeXJpVURnEAE",
            "text": "Jedzenie bez smaku\nPrzykład pyzy po 5$ sztuka musiłem wyrzucić do śmieci bo nie przyprawione\nDorsz po hiszpańsku myślałem że dostanę rybę a się okazało że to krążki ziemniaczane\nKilka dni wcześniej żeberka z tego sklepu też wylądowały w koszu na śmieci\nNie polecam tego sklepu szkoda kasy !!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMc3ZHZi1nRRAB",
            "text": "The MuuMoo Burger is top notch! Super quality food that I was not expecting. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUanRLZlV3EAE",
            "text": "I got the Maspeth Zapkieka, polish street food for the first time. Overall a great experience: nice staff, clean area, the chef lady was super experienced so it was so tasty and filling.. definitely going there more often!"
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MU9uWlhBEAE",
            "text": "Pyszne jedzonko - zapiekanki takie jak w Polsce 🫶"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkazVIeEF3EAE",
            "text": "This place has better burgers than any place in queens ... the woodcutter specifically is to die for.. ELITE level food in general i highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeGVxdHBnRRAB",
            "text": "Well, they deserve five stars. The place is very clean and the staff are nice, but they are a bit slow."
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOM3Z5anVBRRAB",
            "text": "Zamawiałem przez ubereats ale jedzenie PRZEPYSZNE Polecam !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxb08tbW1RRRAB",
            "text": "Went here with some of my friends, great service and great food! Dominyk/the team did a great job making the burgers!\n\n-Mikołaj W"
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsa2NmVUlnEAE",
            "text": "Mega polecam to miejsce! Robią super zapiekanki. Nigdzie w okolicy nie można znaleźć tak dobrego street foodu, a zwłaszcza wcześniej wspomnianych zapiekanek. Plusem jest to, ze teraz obsługa podaje jedzenie na zastawie jak się je na miejscu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNVluNzRRRRAB",
            "text": "Delicious, affordable food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGaHRHcGR3EAE",
            "text": "Best food and Coffee around."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNnEybkt3EAE",
            "text": "delicious food 🤤🤤🤤 I’m so happy that you are close to me"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNnNySVFBEAE",
            "text": "The best place to grab a lunch/dinner\nSuper friendly staff!! Will be back for sure!\nThanks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNnNLT1B3EAE",
            "text": "Everything was great! I love Muumoo’s Chicken broths and Zapiekanki! When  i’m eating yours food,  feeling at my Grandma home!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGamNMQWl3RRAB",
            "text": "The food was okay but 25 dollars for one scoop of mash potatoes and one spoon of meat ? Not worth the price . Place looks nice but the coffee was also given cold to my husband"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaei1PWmdnRRAB",
            "text": "I do not recommend it, the food is very poor and not adequate to the price.  Uncultured boss.  Not much space inside.  The only thing that was good was the french fries, but that's hard to mess up."
        },
        {
            "date": "2년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdTZ1M3VBRRAB",
            "text": "Delicious zapiekanki!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M0xLMXNBRRAB",
            "text": "worst coffee ever"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bXJ5aVB3EAE",
            "text": "Delicious lunches and friendly staff - a delightful experience all around! Worth visiting ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NHBtakR3EAE",
            "text": "All coffee-lovers, put a pin on Google Maps for MuuMoo's coffeebar and check out that new place whenever you are all in the mood for a real taste revolution. You can find Peet's Coffee here in different flavours, so buy yourself a moment of delight. There is nothing better than starting a day this way! Wake up and drink up! ☕💜"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4b29XZWtnRRAB",
            "text": "Very fresh food made and you can tell that it has quality ingredients. We come by very often."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Z29IaEl3EAE",
            "text": "Grabbed lunch here recently and it was so tasty! Service was great, was unsure which flat bread melt to order and the employee by the name of Sandra gave me a recommendation(an amazing one). Lunch came with a free bottle of water or can of soda which was a great addition. Will be visiting soon! Keep up the great work"
        },
        {
            "date": "2년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dk5LbEl3EAE",
            "text": "Wracam do tego lokalu codziennie z uśmiechem. Jedzenie pyszne, obsługa przemiła. Polecam z całego serducha,jedzonko na każdą kieszeń! :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dlByNUVBEAE",
            "text": "The best food I’ve ever eaten in US 🤤"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ek5xMVh3EAE",
            "text": "Very clean place with friendly and helpful workers. Good selection to choose from and there's options for everybody. Perfect to grab a lunch for the family or yourself.\nI recommend this place to everybody. Good place to add to the Maspeth neighborhood. It's a new take at a clean and healthy fast food place. They are doing an amazing job."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ek5ER093EAE",
            "text": "Love this place! Food is great and overall has a nice atmosphere. Came to grab lunch while I was in the neighborhood and this is definitely my new go to spot. Must try!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ek9EcU5BEAE",
            "text": "good food and really nice atmosphere. got lunch here and it was the highlight of my day."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdE51SHh3RRAB",
            "text": "I went here while I was on my lunch break, I ordered a burger muumoo and fries, I made sure to tell them NO PICKLED CUCUMBERS. Pickles and cucumbers Make me physically ill... And really it doesn't matter why I don't want them... If I don't want them... I DON'T WANT THEM. The burger and fries took about 22 minutes which was my whole lunch (I get 30 minutes for lunch). They brought the food out, I grabbed it and hopped in my work vehicle and drove away, hoping to eat it when I got a few moments since my break was already done.  When i opened the box, and what do I find? PICKLED CUCUMBERS! (it's notated in the receipt \"no pickled cucumbers\")  now it's about 5-10 minutes after I left muumoo, I give them a call to let them know about the issue. I let them know that I can not eat the burger OR fries because of the pickled cucumbers. They ask me to come back to the store and they will make another. A great gesture, but I already wasted my entire lunch break getting this now inedible meal, why would I go back? AND by this time, I'm so far away that I would waste another 30 minutes driving there, getting the replacement and driving back. I was offered a refund for the fries, I let them know that the burger was sitting in the pickled cucumber's juices and I could not eat that either. After a ton of back and forth... He( the receipt says Michal z so I believe it was him) only wanted to give a refund for the fries.  By this time I was completely over this while ordeal. I told him yes give me a refund for the fries, he verified my order and card...and said he would Give the refund for the fries(even though I couldn't eat any of it).\nTHIS WAS 4 WEEKS AGO, I'M STILL WAITING FOR THAT REFUND.\n\nI can't speak to how the food taste, but the customer service was TRASH\n\n--- UPDATE---\n\nI posted this review around 3/25. A few days after making this post, I was issues a refund."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSel92NFZ3EAE",
            "text": "Great food.\nFresh and crispy fries.\nNice people at the register.\n\nIn all honesty..\nIf you're craving fast food, turn your eyes away from Wendy's or McDonald's... 15$ will get you a Burger deluxe made with Care, That doesn't taste like  microwaved Bs that those big boys serve us.\n\nPolecam!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNod3Ntem9BRRAB",
            "text": "The food and service are excellent for a new grand opening. With their Polish cuisine I can enjoy going again for different items in their menu. Plus their different selections of meats and perogies are awesome."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSclBpV2R3EAE",
            "text": "EXTREMELY overpriced polish store. $14.14 for a \"hot dog\" which wasn't a hot dog at all. It was some sort of sausage, ok fine whatever but I went in there to buy something to eat for my kid and they had a sign outside advertising hotdogs, so naturally my kid wanted one. Would've been nice to have some clarification on the menu screen or have been told its not actually a hot dog before paying.  I told them it was for my kid, hence the reason I asked them to hold all the toppings that they list come with the \"hot dog\" because my child does not eat jalapenos and all that jazz. The kitchen must've realized what a total rip off $14.14 would be for a skinny sausage on a bun with nothing on it because they poked their head out and asked if I would like some fries too. I wanted to eat in but they only have 3 stools along their ample counter seating space (which were all taken) so we had to stand outside the joint and eat out on the street.  Let the rich keep this place in business because those of us who eat actual hot dogs cannot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURob05XSzJnRRAB",
            "text": "The staff was super friendly and the place was really clean and pleasant. Even though some of them were new, they still gave A+ service. It's great to have a place like this in Maspeth!\n\nBtw amazing ice coffee :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOU1yRjRnRRAB",
            "text": "As soon as I walked into the place a very kind gentleman approached me and asked how he could help me. Not knowing what to order. I told him I've never had a pierogi before and he let me try the sweet cheese. It was delicious.  The food I ordered was beef goulash and mashed potatoes to go. I got home and devoured it. Then I went right back and bought 4 sweet cheese pierogi. The gentleman who approached me when I walked in was the owner whose name is Rafael . That was lastnight.  This afternoon I went back and got the Hunters Stew.\nDelicious. I will be going back in the future."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNm9PdDhRRRAB",
            "text": "Nice and clean market with great staff!  Coffee was excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeTZEcElREAE",
            "text": "The best burger I’ve had, delcious meat and homemade sauce inside it. Overall clean and well stocked store with friendly staff"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodklhLUZnEAE",
            "text": "I visited today and was highly disappointed. Unwelcoming environment, food is terrible( I tasted the rice and chicken) and the iced coffee is bitter.  I also received the wrong coffee . How do you get coffee orders wrong ? I still don’t understand how a new store can be so unfriendly as well. Won’t be coming back."
        },
        {
            "date": "2년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodTcySHNnRRAB",
            "text": "Delicious Zapiekanki, true taste of Poland!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeWQyRzFBRRAB",
            "text": "Good food = Good mood\nThank you for delicious polish Pierogi, and Zapiekanki. Every time I want eat everything."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNob3VuSnpBRRAB",
            "text": "Best place to eat something fresh and good! I like atmosphere there. Def 5 stars."
        }
    ],
    "reviews_count": 62
}