{
    "name": "Patrizia's",
    "place_id": "ChIJJ9B9DvRewokRtQELxkQn6xk",
    "grid": "QN5",
    "address": "69-35 Grand Ave, Maspeth, NY 11378, USA",
    "rating": 4.4,
    "user_ratings_total": 1132,
    "phone_number": "(718) 779-2083",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SS1FuVlJYMjlQUVZJelIxcFNNSEpKUXpSWlUwRRAB",
            "text": "Family oriented"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RlIxRTFkVVZhUW1WT04yUmFkMlo2Y2tkT2QwRRAB",
            "text": "Excellent service, really good food and the staff was really good with the kids. I was ama es for the great service! Love it! We ll be back for sure 🫶🫶"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cVR6azRiVzgwT1U5TmFHNU1jRGhsWDBWRVEyYxAB",
            "text": "We hosted a 15 person luncheon yesterday after my grandmother's funeral and we could not have had a better experience at Patrizia's. Everything was perfect & delicious. Francesco was so accommodating and helpful. The food was fresh and the portions were huge. I loved how easy he made it for us to plan. We were all upstairs in a private room and had the space to ourselves. Thank you thank you thank you!"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRmVsZENUV3RMVldWV1luaGlRek15WW1KNmIwRRAB",
            "text": "Me encantó la ensalada de regula y stake me pareció el precio razonable y el servicio fue maravilloso"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocE9WQm5Well5VUdWS1gyWXpOMU0yTUVkZk1VRRAB",
            "text": "Food porches have gotten very much smaller, but the price is the same.A little more or less simple, the food now"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SWNrMTFYMWxuU0ZKa2RsWlFSQzFMYUV4dFNtYxAB",
            "text": "Great home made pasta, an abundance of food and flavors, excellent service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdlJWVjFNak56UjFGUlRuRmlPVGQwZVhOd01YYxAB",
            "text": "Disrespect The deliveries people’s don’t have humanity"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNFduZEJlRkpOTUZCUWIzQmlNbTVLVlhWTWFWRRAB",
            "text": "Staff members who don’t treat customers well and look down on them are completely useless. A shop that doesn’t value customers is like a place without a soul."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReGQxSnJjSEYwT1ROSGRVZEZiMlJoYzJsV1RuYxAB",
            "text": "I ordered food to go, but was able to see the atmosphere.  Everyone was very friendly and engaging and the food was delicious.  I will be returning!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gb1luZDBOVWhWWjBaUlVFbFVialpKTVRSdmVtYxAB",
            "text": "I went on a Thursday afternoon and had a grilled chicken panini sandwich with arugula and honey mustard & comes with house salad. The food was really good!\nI gave 4 stars bc I felt the service could’ve been better. Other than that I would come back."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNVpWQnZTRk5JUzFvelZFd3hjalI0VjJGNVlVRRAB",
            "text": "Excelente servicio. Deliciosa comida"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMFlqVXRZMEV5V21Ka2NXeEhXamsyUkhObGVVRRAB",
            "text": "I’ve been craving for Pasta and decided to order Fettuccine Alfredo with grilled chicken online. I almost throw up because  It was very SALTY!!!!!!!!! I tried to add some water on it but still, taste like SALT! I was so DISAPPOINTED!!!!!!!  I paid $37.47 for this junk! I called them and spoke to David and he just say sorry! I will never order in Patrizia’s again. Waste of time and money!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210c1QxSlpUMlJxUVVaVFFWWkJSM2hIYUdWSVpXYxAB",
            "text": "The best Italian Food and service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdVlVWllWblJMUzIxRVlqbHVUSEY1UjNsNFVFRRAB",
            "text": "Food is always amazing 😊😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSGRUbHFkRk41U0U4MlluTXhjVzVMYjJsd1RGRRAB",
            "text": "Great place for a large group"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kcmJqSXpNMU5FWW5aRGNWWnhiRjh4VDB4ZlMxRRAB",
            "text": "Excelente comida y servicio"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSFdua3RSVUZhYkhOTU9VVnVOVEJ0YVRoRE9FRRAB",
            "text": "Nice place"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseVVscFBaME5RVHpoNVJXa3lYMGhJWmpoc1ZIYxAB",
            "text": "Excelente servicio"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKS1lqQjZjVWt4Y25reFEyTnVjR3RNWldkRWIzYxAB",
            "text": "The Turkish Lady (Michelle) was great. She was very nice and helpful. I will come back again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdllXeHlkV0l6U0hCMlJXeFdSRlZtTTBaNlQzYxAB",
            "text": "Complete renovation really good experience"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaR1VFa3RWRXcwYWpobGFrWjRkbWd6VWxkV0xWRRAB",
            "text": "Came on a rainy monday night so expected way more than received in terms of flavor.\nReceived the baked clams first so that was the only photo sadly. They were salty.\nOrdered linguine vingole and the sauce was watery and bland, the garlic pieces were its saving grace.\nCalamari has no seasoning, just breading and some salt.\nBest thing we had was the caesar salad with grilled salmon and the bread they give as you wait. Disappointed because craving clams and didn’t get the flavor expected (personal preference, maybe others will think otherwise)\n\nService was excellent! Very cute place and ambiance. Food needs TLC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdFFrMDNORnBHV2pkNFNtOXlNVlpCV0VsSExXYxAB",
            "text": "Food was delicious! Portions were more than enough. Glass of wine was also a very decent pour. Kids meal was also of a good portion. Staff was kind enough to split one kids spaghetti and meatballs for our two kids, as both are still very young. All staff were very kind and friendly. We can’t wait to eat there again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeGFuSjFNSGt0U0VoalFsbFRhbGRqTnpoelQxRRAB",
            "text": "First time here and I must say the food was delish. I had the penne vodka with shrimp and it came with a side salad. The sauce was creamy which I loved. It came in large portions so that was a plus. The atmosphere was nice and the waiter was friendly. Would be back. And the tiramisu is a must try"
        },
        {
            "date": "수정일: 3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxc1UyWlNaWFUzU1VsTU1XcFNaMjlCUnpkTk5XYxAB",
            "text": "Fui con unos amigos casi a la hora del cierre del local, nos dejaron pasar y fueron muy amables, buen servicio y buena comida"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLbnNuazZ3RRAB",
            "text": "Great food. Good service.\nA bit noisy but everyone is celebrating. Great place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONU0yWXhTMVI2ZDBKeGEyNDRUa1F5U1ZadU1HYxAB",
            "text": "A great place for a party.  We had twenty people, we had a pre-fix family style—the food was flowing.  The ingredients are fresh and the tomato sauce has no sugar in it (which is typical of low end Italian restaurants).\n\nBe warned-this is a party warehouse environment…the Lee are rows of tables with large groups.  This means very loud and we must have celebrated 20 happy birthday songs during our 4 hours there.\n\nNot for a quiet and intimate meal."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWlVWTlFhMFoxYnkxblgzSmpVekpITVUxS1dYYxAB",
            "text": "Delicious food and serving are nice enough to bring some more.. Very happy with the hospitality. Servers need to keep watch on the water and drinks. Don’t need to wait and for them to be called. It would be nice if they approach with enthusiasm so this way they can get sell .. Anyways the owner makes it up for sure. He got\nMy fiancée awesome shot drinks and very welcoming. Definitely coming back.☺️"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Q1YxUm1UbnBhTFdJME9EZGFZMnBPUzFwallXYxAB",
            "text": "Me encantó la atención y la comida .. fuimos un grupo grande y tenían un paquete muy favorable con mucha comida"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dE9GbEVVWGt0TW5sbFNuVnZXakJLUVRFNWJFRRAB",
            "text": "Definitely not the Patrizias we know. Skimpy portions other than the salad, shrimp, and eggplant, which they only give you one bite of. Everything else is basically inedible. The meat taste rotten and overcooked. We barely touched any of the food. We did not get coffee. Got conned into buying a prom style photo that no one asked for. Very disappointing experience for a restaurant that I am very familiar with and have been to hundreds of timesnot doing the name any justice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKN0c3WWFnbnRyazR3RRAB",
            "text": "I placed a pre-order on seamless for a Father’s Day dinner. I was advised it would be delayed beforehand. Initially I was very upset, as we had people waiting to dine at a specific time, so I called the restaurant to speak with the manager and was handed over to Felipo.\n\nFelipo was so helpful and assured us that he would get our order over on time. Indeed he did!\n\nThe food was great and it came right on time. Thank you for your professionalism. It was truly appreciated, and we had a lovely night thanks to Patricia’s."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPamg3WkRYOHJtaVpBEAE",
            "text": "Delicious dishes. The pasta was cooked exactly as asked by the waitress."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeVkwSnhkR2hET1ZKTVkydzJTbkl4ZFhGS0xXYxAB",
            "text": "Patrizia’s Maspeth is a true neighborhood gem. The food is consistently delicious, the service is warm and attentive, and the whole experience feels effortless and joyful. Whether it’s your first visit or your fifth, it always delivers. A must-visit if you’re in Queens!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWemEySldNbEYwWkdwSlozTk9kemxXVkZFM2VsRRAB",
            "text": "We had a great time celebrating my niece's graduation. The service was wonderful, and the food was delicious. It just kept coming!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMNmc4cGlKeXVUNXp3RRAB",
            "text": "I love it. ❤️🇮🇹"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdWdrWUxfOTlTalJREAE",
            "text": "A very friendly family atmosphere. The food is awesome! We had the Margherita Pizza the cold antipasto plate and the calamari!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLcmtnOTZIemZyUTVnRRAB",
            "text": "Always the best of seevice and the food is amazing and always a generous portion"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbWl0NWpmdGZUZURnEAE",
            "text": "One of the best restaurants we have ever eaten in. Food, fantastic. Service ,exemplary ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNUGlvOS1pbGZXOFNREAE",
            "text": "they have fresh ingredients their pastas tastes amazing , except for the meat sauce in their Pappardelle it was not to my personal liking. But i love their pizza, calzone and seafood also. cute date night place also to celebrate birthdays, parties etc. they do awesome take out include spicy olive oil with pieces of bread to soak up the delicious sauces"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKTHcxYXl0ay12Z3FRRRAB",
            "text": "I recommended site unseen Patrizia's to my long time High School friends and it was extraordinary.  The manager Philippe and Francesco were awesome.  So nice and always checking up if we were ok.  We did the Family Style menu and it was super.  Will be back with my family and more friends.  Kudos to a great restaurant and excellent service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb2NlTXhRRRAB",
            "text": "Great food and service.."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvemRTOS1RRRAB",
            "text": "Lo máximo en todo"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcHE3R3dBRRAB",
            "text": "Place was great im just a real foodie so the food was good 7.5 out of ten for an italian place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNk5UcEdBEAE",
            "text": "Ordered for pickup through their site. Portion sizes were really small for the price. Much smaller when compared to when we sit down in the restaurant. Expected comparable amount of food as if we were to sit in. We often go there, but decided to order to go and it was disappointing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dDZmeS13RRAB",
            "text": "Patrizia’s is a warm, popular, friendly Italian restaurant with amazingly good food and great service. The arancini were delightful and the linguine vongole had more than 50 baby clams. I was delighted! There were several delivery bike people who came and picked up food for delivery elsewhere (parking is limited). I would come here again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dF9xTUlnEAE",
            "text": "Fabulous food and service was exceptional! Loved everything about this restaurant. The only negative which is not something that the restaurant has control over, is parking is terrible. Only street parking in a very crowded area of Maspeth."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRa1ppMEFREAE",
            "text": "This place has roaches we went for my friends birthday dinner we were a party of 12 and they sat us upstairs. At some point before the food started coming out an actual full grown cockroach fell from the ceiling onto the birthday boys arm and bounced onto the  thankfully empty plate Infront of him. The uninvited guest then scurried down the table cloth and disappeared into the floor boards. When we alerted the manager his resolution was to offer us free shots. We took the shots because this is after all NYC and you can’t always avoid all the critters. However the food was not great. The calamari was overcooked they felt like a chew toy. The baked clams were actually undercooked and reminded me of the time I almost drowned in Coney Island. The steak was bland and cold. Will NOT be returning to this location again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndHZUOW5RRRAB",
            "text": "Family style is the way to go. 10⭐️ on everything."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcXV5aktBEAE",
            "text": "great costumer service, great take out food. Excellent taste. great service overall. Definitely coming back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc0pMb3V3RRAB",
            "text": "Just a good reminder to myself to never ever go back to this Patrizia's of Maspeth Queens. We placed an order for 3 people for pick up, which consisted of Chicken cutlet parmigiana, with penne; chicken cutlet parmigiana with angel hair pasta and baked ravioli parmigiana. We got there and it wasn’t ready yet. When we got home literally 2 minutes away, it was cold like it had been sitting out uncovered for some time. The cheese was floating on the chicken with a ton of sauce and not even warm. Penne and angel hair pasta, nothing good for me to say about that, totally tasteless in these tiny itty bitty aluminum containers. My ravioli, what ravioli they totally messed up and they sent me chicken parmigiana instead with a tiny salad. Did I mention that everything was cold and tasteless floating in marinara sauce. We also ordered 3 Nutella pastries. What we received was 3 flat uncooked, sorry looking pieces of garbage to throw away. We threw all the food away, but here are pictures of what the Nutella pastries should have looked like and of what we got. We have visited many Patrizia’s from Brooklyn, Staten Island, New Jersey, Massapequa, Hicksville, Hauppage, Florida and Aruba with no issues, ever. We have never been so  disappointed by their lack of customer service. When we called to let them know all they said was we’ll give you a discount the next time. There will never be a next time. Don’t want your discount, don’t ever want to order or visit this Maspeth location again. Negative Zero Stars here. 🥵😤🤬🥵"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzeExtbW5RRRAB",
            "text": "Always a great time."
        },
        {
            "date": "4년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLdmVlZmJBEAE",
            "text": "친절해요"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N09UNElnEAE",
            "text": "My first time at this location.   While the food was good, we were so rushed.  We did the pre-fix family style option and they brought all food out at the same time and then were clearing our plates when we were not done eating and when they took the food, asked if we were finished but they took our plates already so even if we wanted to eat more, we couldn't. When we asked for them to slow down, they said they couldn't.   So I didn't enjoy any of my food because it was so rushed and didn't have time to savor and appreciate it.  Seemed they may have over booked and needed to turn over the tables quickly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6cDdXWV9nRRAB",
            "text": "Celebrated birthday with close friends 🎉🥳.  The staff are very kind, professional and so attentive.   Food is excellent!  Very birthday friendly and would like to come back here for more!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOOHV6Y093EAE",
            "text": "We have been to Patriza's in Williamsburg for family events and it's a wonderful experience, but we always did the family style prix fix. Which is a great value, but there were always items on the menu we wanted to try and couldn't. So finally scheduled a visit to the Maspeth location. Layout of the restaurant is a little weird but amiable, they make it work. The staff is super friendly and accommodating. It's an experience coming here, especially if it's someone's birthday. I recommend this place as a go-to for wonderful Italian food served family style. The prices are reasonable and if you make a good impression, you might get a shot of limoncello.\nMake sure to check out the photos... Standouts were the meatballs (magical they are), calamari, and the carbonara pasta, but like I said it's all good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicWFyRmZBEAE",
            "text": "This place is amazing, found it by accident, and it’s been the best find…\n\nI would highly recommend the fioretti alla boscaiola and Insalata di mela… Also, I’ve ordered delivery a bunch of times and that has given me a chance of trying different paninis and they are all very delicious… today lazy Sunday I’m ordering a Philly cheesesteak panini and can’t wait for it to be here… highly recommended.\n\nService was nice too!!!\n\nCan’t wait to go back, meanwhile, I’ll keep being lazy and ordering for delivery on Lazy Sundays ! 😋😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5akxtaGlRRRAB",
            "text": "I went to Patrizia's for the first time tonight.  Staff and service was by far the best I've had in a long time anywhere.  Owner came out to say hello to tables which I thought was amazing as he made small talk with me at my table.\nI'm in town for a couple months for work and I WILL be going back for dinner.  If you have never been,  then do yourself the favor.  If you've already been then we both know why we keep coming back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NXFQVVFREAE",
            "text": "If you are looking to get an authentic Italian food experience, I will suggest this restaurant.\n\nTheir food is amazing and the staffs are super welcoming and friendly. Also, you will love the vibe here. Most of the people gather here to enjoy time with family and some good music alongside the great food.\n\nIf you have Birthday then let the staff know they will bring a cake and create a different vibe for you to celebrate."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNFlTbk9BEAE",
            "text": "We ordered family style, EVERYTHING was delicious. It's soo much food so be prepared to take to go boxes. The service was above and beyond, we were served by Juan and Paul.  The ambience is AMAZING, great music and rounds of tasty shots are given out. Can't wait to go back and definitely telling all my friends/family about it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqOHN1bXlBRRAB",
            "text": "This place was so good! My daughter is super picky but Italian food is her favorite. Lasagna specifically and even though we didn’t see it on menu they had it and made it. Mom had ribeye with roasted potatoes which was the best steak we’ve had outside of TX. Dad had carbonara and he finished it, it was so good! Our daughter is coming here for school and has now marked it as her go to for lasagna. Everything from the atmosphere to the staff to bread w/oil, mixed greens salad YUM! To the food to the dessert which we ordered 1 of each of 4 things and it was just all so good. I don’t normally rave on places but this place I did! So good and will definitely be a go to for when we come to visit her."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNcGF2c1d3EAE",
            "text": "When me and my friends came here it was packed! There was a wedding celebration, people's birthdays, the whole shabang. Super lively environment! Food was delicious, I love how much seafood I got for just $19! Was surprised that it was red…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Z1o2RDR3RRAB",
            "text": "It’s been a tradition with some of my closest friends to come here for Friendsgiving to enjoy a family style dinner experience. Everything is under 70 dollars per person, you get to enjoy different courses of meals, all very delicious & fresh. Wine & the sangria are delicious and included. Other drinks too which you can ask for. You can host all types of events, for birthdays they shut the lights off which at first will catch you off guard but it’s only just for them to start singing the songs and stuff like that. Overall will most likely be coming back for years to come"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cXBmeFRnEAE",
            "text": "Patrizia’s has a beautiful and welcoming space in Maspeth. I’ve been here several times. All the food has been great. The last time I came I had a lovely watermelon salad and pizza with burrata, basil and tomatoes. At first I thought the pizza might be boring, but it was fresh and delicious. It’s a great vegetarian option! I also had an Aperol Spritz, which is the drink of Italian summer. Salute!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobGNEUnlnRRAB",
            "text": "Celebrated my birthday here with some family and we had a great time. Service was excellent and the food was good. I really enjoyed the pasta dishes and the almond cake for dessert."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNcU82cTRnRRAB",
            "text": "first time here with a party of 7 and I was so happy how fast we were seated. it is cramped (we were seated downstairs) but it didn't bother us. The music is great but can be loud at times.  Now for the food, it was amazing ! large portions…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcl95TUJBEAE",
            "text": "This was my first time at Patrizia’s. The food was amazing and so was the staff. Our server Mariana made sure that we were enjoying our food and went out of her way to make sure my drink was perfect! I had an amazing experience overall. We didn’t feel rushed at all and were well taken care of! Thank you MARIANA❤️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ajVuSHdRRRAB",
            "text": "Local Italian fare, homemade pastas with an uncomplicated simple menu. Love that! They have multiple U.S. locations. The owners make sure that they have a true Italians on staff. My cute Italian waiter actually lives in Aruba, works at that location and travels to Elmhurst Queens during shoulder seasons. I guess true Italian's are hard to come by. So far, my only complaint is that the meatballs are a little boring. My recipe is amazing. Yes, I'm judgy. Can't wait to go to the Aruba location in May and and see my cute Italian waiter again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5N1BuUmRREAE",
            "text": "Solid Italian food. Fresh pizza. Service could be hit or miss depending on how many big groups there are. This restaurant on the weekend is near impossible to get a table, even with a a reservation because there are so many LARGE parties that come here. Usually very loud."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5b3N2dGpnRRAB",
            "text": "I ordered a lunch special today (penne alla vodka and side salad). As a pharmacy tech ready to have her 30 minute lunch break, I was EXTREMELY disappointment with the delivery and food. One, the delivery guy had spilled the italian dressing in the bag and I received my food covered in oil. Two, the penne alla vodka was flavorless and I had asked for grilled chicken in addition and received at most 10 cut-up pieces. Three, for a lunch special, I have never paid more than $15 at any restaurant. It is ridiculous that I paid $23 for this. I didn't even have the appetite to finish it, such a waste of food. I will not be ordering again and I am very disappointed with the service and food."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNOGNMZGdBRRAB",
            "text": "I could tell you Patricias of Maspeth  really gave me a wow experience with the service that they gave. They really went well above and gave you a home warming experience with their service. Their food is very good I promise you you will…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMHA2OVBBEAE",
            "text": "Came here for Mother's Day and they treated us so well The food the drinks the staff it was awesome can't say anything else but you must come here because the place is awesome"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhNHRpbDBnRRAB",
            "text": "Patricia’s in Maspeth Queens located at 69-35 Grand Avenue is by far one of the best Authentic Italian Restaurant around. We had the 60.00 per person family style  dinner and every dish that came out was simply delicious. They even made a couple of substitution to fit my twin daughters taste buds, which I taught was special and simply outstanding. The service was spectacular, a home feel, and Mr. Dennis and Fedra went above and beyond to make sure we were always satisfied and well attended. I wasn’t able to take pictures of my dishes because my phone died and Dennis noticed and offered a charger to address my issue. Overall without any doubt a solid 5 ⭐️s all the way. Buon Appetito!!!! My family will be back. SALUD!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNElPSllnEAE",
            "text": "I was very disappointed in this Patrizias and will not go back.  The food wasn't as hot as other locations. We got the family style for both of us because we were really hungry and figured we could take the leftovers home.\n\nSangria was watered down tasted like juice.  The famous purse pasta was dry and the peas were hard. Fried calamari was hard,  overcooked, chewy and cold.  Pizza was just ehh and so was the rest of the food. The best bite was the shrimp and you only get one each.  All the food was lukewarm as best.\n\nThe service wasn't great,  music was way too loud. I left there with a stomach ache and when I got home I vomited.\n\nI've gone to the Patrizia's in Massapequa and also in Kipps Bay and both were much better. Especially the one in Massapequa"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyd3J1MEpBEAE",
            "text": "This restaurant is great for large parties & celebrations. The staff are friendly and efficient. They give birthday/anniversary shoutouts with participation from the entire  restaurant.\n\nThe food is delicious and consistent! I've visited twice in one week. The first visit with a group of 5 and later with a group of 9! The restaurant offers a family style deal that is affordable but instead we ordered up to about 12 entrees and ate it all family style.\n\nWe ordered the Salmon, Lamb chops, Eggplant Parm, Chicken Parm, Veal Marsala, Rigatoni, Penne A La Vodka and Pizza Margherita. The table favorites were the Salmon, cooked well but very moist with sautéed garlic spinach, the Chicken Parm & the lamb chops! The favorite side pastas were the garlic & oil & fettuccine Alfredo. The least favorite dish was the veal Marsala.\n\nFor dessert we had the sampler that included the almond cake, Nutella Patrizia, tiramisu and cannoli! The cannolis are so fresh and the almond cake perfect!\n\nOverall, a good stuffed time! This place is now a family favorite."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDaFlUNVVREAE",
            "text": "The outdoor space is lovely and the service was excellent. We ordered a small margarita pie that is fine for 2 people as it's cut into 6 small sizes, as well as a pitcher of sangria. Unfortunately, the three stars are due, as you can see,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4alBfdFB3EAE",
            "text": "My wife and I visited New York for the first time ever. Easily the best place we ate there. I don't know what they do with their chicken Alfredo that other places don't but it was freaking amazing. Service was great. Atmosphere and bday celebrations were great. We loved it. Highly recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLMW9yNHZnRRAB",
            "text": "What a awesome place to celebrate Mother's Day with the Family while enjoying great Family style Italian dishes! The atmosphere is nice, it kind of felt like I was in Little Italy 🇮🇹  and the Staff made it so much fun.   Give them a try!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNU5IVVhnEAE",
            "text": "Absolutely love Patrizias. The help is incredible , the food is incredible. Great for birthdays or celebrations (you’re in for a surprise!!!!) , yum. Highly recommend the almond cake for desert."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVN3BpVk5nEAE",
            "text": "Not up to the standards of the Williamsburg Patrizia's...several of the multi course family style courses came out tepid and not hot enough.  Both meats were overcooked and tough.   The pasta was not as good but some things were up to par.…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxaDR5c1VREAE",
            "text": "The service was top notch! Came back to celebrate my autistic sons 21 birthday !!! Food was amazing and we love this place!!! Been driving far to come here even though we have plenty places closer"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdjZDVUNREAE",
            "text": "So much food. Price is right. The people were so nice and attentive.  Great atmosphere! We had Bake Ziti / Penne a la Vodka / Steak with mash potatoes, And lots of food to take home. I reccomend this place."
        }
    ],
    "reviews_count": 80
}