{
    "name": "Mano's Pizzeria",
    "place_id": "ChIJnQvh4xZfwokRtIhuUuw0Pt4",
    "grid": "QN5",
    "address": "62-98 Forest Ave, Ridgewood, NY 11385, USA",
    "rating": 4.8,
    "user_ratings_total": 736,
    "phone_number": "(718) 418-1112",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbFdHZFliR2xSUVZsZmEzWnBSelJVTlZrMU1WRRAB",
            "text": "Perfection !!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toS2NTMXllaTE2Tm1OS04yeDBVbTFtTTA4MWRYYxAB",
            "text": "Manos is the BEST pizza in the area! Creative and tasty pies. Awesome owner & service. This is the type of pizza that you’re gonna wanna eat the crust!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRldsRmZZV0owZUVRNUxUTk5OamsxYTBWaU5HYxAB",
            "text": "Bad service"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWmNqSlpkMDVKUWtOTVlXMUNjMmRaTm5oRGNXYxAB",
            "text": "The owner it’s bad and talk bad to the people that goes to this place"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkb05HTjNaRXhHWW1KV01EUnpRMnRDYzBsRlgzYxAB",
            "text": "The pizza Lives up to its 5 star reputation"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGaVNtZDFOelF5VHpOdVJUWlVNVUpQWTFKa1ZWRRAB",
            "text": "The crust was perfectly crunchy and airy, and the sauce was full of flavor."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toT2QzRkJNRFI1VVVSWFdIa3RZWGRIT1dGbVZXYxAB",
            "text": "Best pizza ever. Plain slice is delicious and airy each bite tastes impossibly light and crispy. Honestly, my favorite pizza spot. PS sorry the pictures weren’t better. I couldn’t help myself."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0S2VuUkJWR3h0VkhSTVN6TldUek4zTm05dlVsRRAB",
            "text": "The variety of pizzas is impressive, portions are generous, and every bite tastes fresh and flavorful. You get excellent value for money, and it’s a solid spot whether you’re grabbing a quick slice or a full meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVE5GRkRNRlk1YWkxelJYZ3RYMnQ0VEROVldYYxAB",
            "text": "As a native New Yorker that has eaten at\nmany Pizzarias over my years. The pizza didn't live up to the hype‼️\n\nI was let down.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReE1ISkZjRjlzTnpSYVZWZG5ORkpuZUVJeGFtYxAB",
            "text": "One of the best slices of pizza I've ever had"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0c1YzUTRVWEZ4WWxsSVUwRkZlV04yZHkwNWRYYxAB",
            "text": "Last week, I stopped by Mano’s Pizzeria in Ridgewood, Queens, and I can’t stop thinking about it ever since. The pizza was incredible — crisp yet airy crust, fresh mozzarella that melted perfectly, rich tomato sauce, and basil so fragrant it felt like it was just picked.\n\nTaking that first bite was like meeting a beautiful girl for the very first time — exciting, unforgettable, and instantly leaving you wanting more. The balance of flavors was so perfect, it wasn’t just pizza… it was an experience.\n\nThe place itself has that classic neighborhood pizzeria feel, warm and inviting, with the kind of charm that makes you want to linger a little longer. And the staff? Friendly, genuine, and clearly proud of what they serve.\n\nIf you’re anywhere near Ridgewood, treat yourself to Mano’s. Trust me — once you try it, it’ll be all you can think about too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMFZsTnlPRFJMYWpaQlVWbDFlREF5VW5kV1NVRRAB",
            "text": "The best Pizza in NYC hands down, You. Yes you must go Now and try their grandma and forest ave slices!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Q05FVkxlRUptZVMxV1FteG9jRzFFY3pab1RrRRAB",
            "text": "Spicy Pepperoni Vodka Pizza was amazing and made it to our stoop within 10min of coming out the oven! (Finish time was written on the box.) All pies are 18” which is 8 slices. Enough for two - three adults."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wa05FOU1aelJPWTNrdGJub3hiMlJvUWtSTmNFRRAB",
            "text": "The crispiest and freshest pizza I have had honestly. It was so good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Vd1UxcHJWR1prT0VkclNXTnJOUzEwZUVWaVpuYxAB",
            "text": "This is my new favorite pizza place in the entire city. Inventive slices, delicious crust and an extremely nice staff. If I could give them 10 stars I would. Elite level pizza. If they were located in Manhattan or Williamsburg the buzz would be through the roof."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WGVVMDBURzE0Y0VweVUwOVRSR2haUVhaNU5sRRAB",
            "text": "Amazing pizza!! Love the sauce. Recommend trying multiple slices. Yum!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTlJrUlZjbEJJT0dwdE9YVnRRVlZ6TVUxbGFuYxAB",
            "text": "Some of the best pizza in NYC hands down. Insane crust!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kemIwRjZXbTV3ZGxGdVlteEtPVzVMVEhGRFdVRRAB",
            "text": "this is my first google review ever, ive come all the way from london, england. this was the first pizza i tried, never been to america, let alone new york. i get to my sublet, i walk down the road and i finally try this, i couldnt believe what i tasted for the first time, ive been back multiple times, every single time i try this i discover something brand new! the owners, workers are amazing ppl, i couldnt recommend this enough!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSGJYQjFaaTFmZWtaVVFqQkdUSEJpZFZKTVpuYxAB",
            "text": "This is what a pizzeria should be. I am born and raised in NYC and as soon as I walked in, I knew I was in the right place. It took me back to my childhood. The pizza was some of the best I ever had. Loved it! Will definitely be back for more!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVE0wMVVWelp5WWxOYVJuWjBWR3RXVEhkNFMxRRAB",
            "text": "Always like their fresh pizza"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcmFDMVZSVXB4VlZaT2NESkxPSGwyUVdsMkxVRRAB",
            "text": "Perhaps the best slice of pizza I've ever had in Queens,And I don't say that lightly(spicy vodka pepperoni slice) I will definitely be returning to try out other slices. Sorry no photo my slices were in my belly long before I thought to do a review."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeldWZ3RhRXA2UldSdlVWVk5kRnBZYVhKVlJVRRAB",
            "text": "As always ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MmJubEtWSHBaTlZCSmJsTnFWR3RGVkROMVRrRRAB",
            "text": "Delicious Pizza."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNFN6UnZjRzlKZUZCUlJrUjBWamhDY2w5WFoxRRAB",
            "text": "All I can say is WOW. Mano's Pizza is by far the best slice I've had in NYC (and to be completely honestly, in the world).\n\nNick is an absolute artist when it comes to pizza, and has been perfecting his craft for years. Every small detail from the dough fermentation process, to the outstanding ingredients is carefully thought out - and makes for an exceptional pie every single time. Cannot recommend Mano's enough. Get this man a Michelin star ASAP!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WV1gxWkhSV1UzYm05ZlgyaHRaMWw0ZURkd1RtYxAB",
            "text": "Other than New Park, this is also very good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMllWRnRPRkkzZUhkRVNWWk5RazVmUVVsVGJHYxAB",
            "text": "Best pizza in general,super cool owner very passionate about what he loves and the staff is amazing.honestly ppl just love to hate,it’s not my fault you don’t appreciate high quality pizza, some ppl here just want to hate and be on the bandwagon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5QlNXMTFRM0F5VEhGQ1RXeGplSE00VTFnelIyYxAB",
            "text": "The pizza here is amazing!! I can never finish a slice whenever I get pizza due to the heaviness of all the pizzas I have tried. Mano’s pizza is so light with the perfect balance of sauce and cheese. I had their cheese pizza as a base and it was so good! The flavors are perfect. I had their white slice a couple days ago, omg! So flavorful, the garlic the cheese omg! The technique they make their pizza finally made me be able to enjoy pizza again without the constant nausea or pain due to my gluten intolerance and the heaviness of pizzas in general. I feel good after eating their pizza which is something I have been missing for years. Thank you for opening a spot that everyone can enjoy! 10/10. Will order that white slice a million times again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRU1VZElhWFYzYzNjNFNrUnNlakpzYmxSeWJFRRAB",
            "text": "Legit slice. Great slightly sour flavor in the crust. Perfect crunch with a bit of chew."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TGFVZFVUMWxUVjFrMFJtbHJWbE5DVVhVNE9WRRAB",
            "text": "Best pizza of my life."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSVJIRnhVVmxtYUVWbWNVNDJjMmhpTjNGc2VGRRAB",
            "text": "Takeout/delivery was fast and easy. The food traveled well.  Good solid NY slice, probably excellent when eaten in person. Which I will make a point of doing. Also yummy ravioli with vodka and the bbq chicken pizza was very good. Side of chicken was 2 large tenders, well seasoned and cooked perfectly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMk1tZG9RV1YwWld0YVptVTBjekZ6WDNWalFWRRAB",
            "text": "I think the plain pizza at Mano's is probably the best slice of pizza I've ever had. It's crispy, the crust is great, the sauce is great, the cheese is excellent quality. It's perfect. We go every week to get slices.\n\nThe two times we ordered a whole pie for the two us, I ate half a pizza in one sitting because it just is too good. My body is not prepped to deal with that kind of volume so now we take preventative measures and just get slices.\n\nYeah, you should probably get there early, or just go for a walk if you need to wait for slices. Sometimes they run out of dough and have to close early, but you can't get mad at someone for their food being too good! If you're coming from outside of the neighborhood, just call ahead and order a whole pie.\n\nStaff is lovely as well. I don't know the name of the woman who usually works the register but she is so friendly and calm even when the place is super busy.\n\nI don't usually write online reviews, honestly, but i finally came here to review Mano's because they are just that good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvdFpVOTNUVEJIVEc5dE5qSlZVRUV4UVUxc2FrRRAB",
            "text": "Some of the best pizza I've had in NYC.  They do great normal slices, and their specialty slices are amazing too.  Seems like they use high quality ingredients"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SVVFODRRM1Y1YmtkbWRYbHlSMVJ6UkZOUVZrRRAB",
            "text": "Pionner visionary slice. There's absolutely nothing in Manhattan that compares to this."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poV1ZIVXRabTVmU0ZWM2IyNDFabVJKTTA1b2FXYxAB",
            "text": "Great pizza, excellent crust"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdk0zVk1XSGhzYjNjelJXcFJXRlUyZG5CQlgwRRAB",
            "text": "Everyone raves about this place but they have terrible hours.  Closed two days a week.…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZME9YQjZWbDlWTlMxeVJtbFJVM2hOVmxsM1gyYxAB",
            "text": "Pretty good food, good prices"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSlJHWTBWR2R6T1VaT1dUbFVWR1p0V1c5RWQwRRAB",
            "text": "I knew I was gonna get smack ya lips and suck your fingertips pizza when I saw boss man tossing that dough in the air like he got some debt to pay off. This place was recommended to me by that Beli eats transplant and I think out of all the contributions his insta did for me, Manos had to be one of the best pizzas i ever smacked on.\n\n10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0QlIyTXpiV040VW05cU1IVlBPRXB6ZFVWVGRrRRAB",
            "text": "Pizza was just okay. Definitely not worth the hype. The dough was very good but I didn't like the sauce. Also price wise there are better places for less money. I would give it another try if it weren't for the terrible customer service.  They were not busy when I went so there was no need for the dismissive attitude from the cashier."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cmMwNXRka3hxY0VOMGQzaE9TVVZtVldaUVdsRRAB",
            "text": "I was disappointed,I expected a decent slice after all the hype,burnt crust,cheap on the pepperronies, and the all around  taste of the pizza was just regular,as for the customer service \"they don't have any\" the locale had a cool old school vibe,that's the only positive..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMFduUlhORVZJWWkxSU5HcGxTRkJ3UTIxWmQwRRAB",
            "text": "Yesterday I had to drive from Baltimore to Queens, Ny. So there was no way I was going to take a trip to NY without grabbing a few slices of NY pizza. After looking up numerous places, I decided Mano's Pizzeria was going to be the one I tried. Boy, did I pick the right spot. I ordered 4 slices of pepperoni, 1 margherita and 1 cheese...My mind was blown. Sauce to me makes the pizza and Mano's sauce was perfect! Not too sweet, not too acidic. Just how I like it, A++. The cheese was just as mind blowing as the sauce. Then came the crunch. WoW! The quintessential crunch of a perfectly cooked pizza pie. My hat goes off to Mano and the staff. I thank you very much for all around 10 star experience. I highly recommend. I will be back on my next trip, again and again and again! ♥️ 🍕 🍕 🍕 🍕 🍕"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORk5GbGFaV3R1YjJaRFNuY3hhMDk0V1RCVmFsRRAB",
            "text": "Before I even say anything I just wanna start off by saying the pizza at Mano’s is amazing. Really good quality stuff… five stars is for the quality of the pizza but the 1 star goes for the type of service you guys provide. I stopped into Manos Pizza yesterday at 5 PM — not busy, ovens clearly not backed up — and there was no counter display at all. 3/4 slices tops….I asked for a regular pie and was told it would be 25 minutes. As someone who makes pizza every day and works in this business, I know there’s no reason a standard pie should take that long under those conditions. The pizza itself is very good, but the “take what we have or leave it” approach takes away from the experience. Great product deserves service to match. This ain’t a real authentic New York spot, this is for the gentrified hipsters who have not one clue about how pizza works."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205ZmJ6VTNYemMwVFVoRlpGODFjMUZ1YkRZdGFIYxAB",
            "text": "Loved everything about this pizza !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMkxYZDZNR3RNWkRac1IycG1iREZTWld0Mk1IYxAB",
            "text": "All i'll say its so good it should be criminal. Its ruined regular pizza for me with this place being a block away from me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTWMyaEhXSEJ4V1UxRmEzazNObU5RV1Zobk1YYxAB",
            "text": "Best pizza in Queens and one of the best in NYC. One of my favorite cheese slices. They fermeuntate the dough for 5 days, makes the bread so good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOYVFsWXdUVEpxYm1KVWFrVkhhakEzY210TlVsRRAB",
            "text": "This place never misses."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nM1dYQkNXRUpFTVhaNGNFTmlWSHBPY1dodVJsRRAB",
            "text": "Very bad case of food poisoning. I was really trying hard not to blame the pizza because  its the only thing my family ate. I thought i was just sick and everyone was else was fine but nope my kids started vomiting that night.\nI'm aware gloves are not used when making pizza but i would hope nobody is handling money and then working on pizza.\nI understand it gets busy but food gets contaminated very very easy.\nThe pizza was good but now that i got sick from it i dont think i can ever come back here again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORlNWQnFNeTAwUlVoNGMwUmhNWE51Y2tsbU5rRRAB",
            "text": "Like Tina Turner would say “ you’re simply the best”"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUFFVeDBhVWRGUVVnMlUwcEpiRzlQWlU1TFNIYxAB",
            "text": "I've been here several times. The pizza here is a better than average alternative and the place may warrant an additional star, if my favorites were not always running out. The minucci, vodka, white cheese, plain and manopellas are all worth trying. Closing at 8 explains why the pizza runs out and I suspect the owner wants to have a life and keep things fresh unlike the guys at Rosa's which have 8 types of slices until they close. But this is NY Mr. Owner, we still eat after 8, or after midnight sometimes. Reconsider the business plan for 2026 and add smiles to it, it goes along way to retaining foodie customers. Close early in the winter when we don't have summer cravings after 8."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeVYyTTNiRFY1WmpWbVRtWmZUVUZOY0VGU1MxRRAB",
            "text": "Love the pizza always fresh"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaVNWOUpUVjlMYUZWSE1FTmxRUzB0TTFsR1QyYxAB",
            "text": "Oddly enough liked it much better as a cold slice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTWFreE9UVkF4VmtoQmJVRmllVFZFWlhKeE9XYxAB",
            "text": "EXCELLENT excellent pizza. A neighborhood hidden gem in Ridgewood serving top notch New York style pizza, you can absolutely taste the quality in every bite. Despite little fame and exposure online compared to other popular pizzerias in the city, I dare to say this place could be the top 5 best pizza spot in NYC. I traveled from Brooklyn to try it and I will gladly do so again and again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVWFGVTBUbXMzZURrNWRsYzVORGhUUzNGMVRrRRAB",
            "text": "Nick is an incredible pizza maker.\nI visited 28 pizza places in 9 days across New York, Philly and New Haven.\nThis one was the best.\nThe Sicilian slice is perfection.\nArrive right before it opens and you’ll have a full slice counter with little to no wait.\nDon’t be like the idiot who gave it a 1 star because ‘it wasn’t open on Tuesdays’.\nI’ve told everyone to go here who asked about my trip and I really hope they do.\nCan’t wait to come back. Cheers."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNFJHbzRiR1J6VGkwNFZsQnBPVzFyTUVKd0xVRRAB",
            "text": "If you’re looking for the best pizzeria in Queens, look no further than Manos. After trying almost every slice on their menu, I can confidently say not a single one has missed. Every pie is consistently delicious, perfectly cooked, and always packed with flavor. I make it a point to come here once a week for lunch—it's become a regular ritual that never disappoints. Whether you’re a fan of classic cheese or love something with a bit more flair, Manos has you covered. Hands down, one of the best pizzerias in the area!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbmZ5ZVZnEAE",
            "text": "This was my second time there, both times did not disappoint. First time, one of each, regular slice-on point, thin and crispy and great flavor. Upside down Sicilian, thick but light and airy and delicious. Pepperoni slice, took it home,  same as the regular with the added taste of pepperoni 😎. All great. Second time, regular slice, just as good as the first time. And a grandma style buffalo slice. The best and most authentic, to me, style slice of buffalo I have had anywhere. Mano’s does not disappoint. Get there early to get a seat. Thank you for keeping it simple and the dedication to your dough process."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCT2IxQlJjVXgwU2pGeWFHWnZVSE54V2tKWFJXYxAB",
            "text": "The dough was really tasty, but overall the flavor was a bit too salty, which made it hard to fully enjoy the cheese. This was my second visit, and I had the same impression the first time as well. I think the experience would be even better if the saltiness was slightly reduced."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYZ0tHOUxBEAE",
            "text": "I have been wanting to travel to queens to try the Famous Mano's Pizzeria. I hopped on my Harley and drove an hour for this pizza. When i tell you this ride was worth every minute & that the pizza was incredible i truly mean it. The lightness, the crisp, and the hand crafted flavors of the sauces blew my mind. The owner nick is so dedicated in creating greatness in each single slice. Highly recommend the Margarita and The Spicy Vodka (Such a unique vodka sauce)🔥"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcHVhaWxRRRAB",
            "text": "Mano’s was crowned top 4 slice in the US for a reason. My favorite is the Manopella slice but everything from their white pies to the upside downs and every the plain cheese slice are top. Sometimes on the weekends they sellout, but that’s what happens when your stuff is that good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaExQNGh3RRAB",
            "text": "Mano's Pizzeria in Ridgewood is hands down one of the best pizzerias in NYC. I got a plain cheese slice and an upside-down Sicilian, and both were outstanding. The cheese slice had the perfect balance of crispy and airy with just the right amount of sauce and cheese. The upside-down Sicilian was a game-changer with its crunchy bottom, fluffy interior, and rich tomato sauce on top. Every bite was full of flavor.\n\nThe staff is super friendly including the owner who's very gracious and humble.If you're serious about pizza, this spot needs to be on your list."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvanQza2t3RRAB",
            "text": "First time here and it didn't disappoint. Small tight space with 2.5 tables. More of a pick up and go place. Had 3 different variations of vodka pizza and my favorite is the Sicilian vodka grandma. Will definitely eat from here again but will probably order ahead of time to take home."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLU9iX1ZREAE",
            "text": "45 minute drive to get here from North Shore of Long Island, but worth the trip. Third time here just to make sure the first 2 times weren't just flukes. We've only ever ordered two 2 plain pies each time here because they represent the pure essence of New York. Bad pizza can he hidden under tons of toppings.\nBorn and raised on Mulberry St in Little Italy, we have some insight regarding the NY slice.\nKate always takes care of us, just order ahead as the secret's out about this pizzeria and it was packed out the door when we came for our pickup.\n\nPizza 100%\nService 100%\nRidgewood/Maspeth, 🤔🧐= mars (?), just sayin'"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRZ2RIYVB3EAE",
            "text": "My homies name is Mano, and he told me we had to hit Mano’s Pizzeria in Queens. I really had no background on this, and sort of thought he just wanted to come here because he shares a name with it.\n\nI had NO idea this was ranked the #4 Pizza shop in the US, and #2 in NY. But I know now. It’s an unassuming pizza shop that is maybe 400 square feet. No frills. Not one single frill in here. They are just focused on making elite pizza.\n\nThis pizza was INSANE. The bottom of the slice is perfectly crispy and has real hangtime. I don’t even know how they do this.\n\nI got a slice of cheese ($3.55), a slice of pep ($4.25), an upside down pep sicilian ($4.75), and a slice of fried chicken with pesto ($4.75). The fried chicken was a miss, but that’s more due to the fact that fried chicken doesn’t belong anywhere near a pizza. Idk why I ordered that, that’s on me.\n\nOn every bite of the other 3 slices, I’m just like “Damn. I don’t want this to end.” It was one of those kinds of meals. Just had me sitting there appreciating life, being grateful that human beings have the capability to make this quality of food.\n\nIt’s wild how there are truly levels to this pizza game, but there really are. It’s like in high school when you think you are good at basketball, then you play against a 5 star recruit and you’re like “oh wow I’m actually definitely going to have to work a 9-5.”\n\nMano’s Pizzeria honestly might beat out L’Industrie for me. It’s so close.\n\nTHANK YOU MANO’S! SHOUT OUT TO MANO!\n\nIG @jnov_\nTiktok @jnov__"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMUx1WnZ3RRAB",
            "text": "I just found one of my new favorite NY pizzerias. The Fulgieri is my new favorite slice of pizza. All 3 slices I had here were fantastic. Crust is light and crunchy on the round and light and airy on the square. The grandma style is perfectly thin and crispy with the perfect cheese melt.Dough is on point. Small shop only a few tables. Go here you won't be disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCa1otZUlnEAE",
            "text": "Pizza at Mano’s is always a good idea!🌟\n\nThis low-key pizza shop is 100% worth the visit if you’re in the neighborhood and if you’re not in the neighborhood, make the trip. I promise you will not regret it.\n\nI stopped in today for lunch and I was blown away by the quality of this pizza. The ingredients are all top notch, with the sauce being the standout star ingredient for me. It is more on the tangy side than sweet, which I prefer and love. I could eat their sauce by the spoonful, it was that good. The crust has the perfect snap to it in every bite. I read that the dough is fermented for five days, which explains the greatness behind it. Every slice was super flavorful and cooked to perfection in an old school vintage pizza oven. The pepperoni slice was my favorite, but I also really enjoyed the upside down Sicilian, caramelized onion and provolone slice, and plain slice. The crust on the Sicilian is golden and crunchy while the dough is light and airy. The garlic knots might be the best garlic knots I’ve ever had. Like pillows of warm, garlicky heaven. Absolute 10/10.👌🏻\n\nThe people that own and run this place are super nice and have done a really great job making the inside feel welcoming. The place is lined with old school black and white family photos and the decor pays homage to the Italian culture. I feel like this is the kind of pizza place that is going to blow up in time as more people learn about it, and that recognition would be well deserved. It is truly the best pizza I’ve had in Queens!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwN0lPcW9nRRAB",
            "text": "Great slice shop but they also make full pies. The upside down grandma is delicious and the bread is very airy and crispy. Reminds of a well done sourdough. The slices are also fantastic - the bottom crust is crispy and strong like a NY slice should be. The vodka slice was very tasty and the pesto was a perfect accent of strong garlic flavor. The end crust of the slices is very interesting and feels more like artisanal bread - big and puffy and a satisfying chew"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuM1AyVklREAE",
            "text": "Been here a few times now for slices: plain, fulgieri(caramelized onions and provolone), and upside down.  All amazing, and the crust is airy unlike most other pizza joints.\n\nThe long fermentation, quality ingredients, and consistent cooking method make this place a standout in a city with a lot of good pizza."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQ1JuSnpDejdxMHNBRRAB",
            "text": "The pizza was pretty good — fresh and tasty. The workers were very nice and friendly, which made the experience better. Overall, a solid place for a casual bite."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLWGZfZFhCcy1fWkl3EAE",
            "text": "Reminds me of those old school pizza places from the 80's. The pizza had an airy crispy crust, great tasting sauce and a perfect amount of cheese. The vegan pie tasted great also"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcjZTaGJnEAE",
            "text": "This place is nowhere near where I live yet I would go back 1000%. The crust was EXCELLENT, and sauce to cheese ratio was too. I want to go back to try upside down Sicilian which they ran out of when I got there. Only one guy holding down the pizza making on a Friday night was pretty wild to me. I wish they had more seating but when my group of six snagged a table, we stayed for an hour and a half and no one got mad at us (not encouraging this behavior btw!!! just saying) will definitely be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlXzYyVjl3RRAB",
            "text": "Excellent pizza - small newish pizza joint open in 2021. I’ve been wanting to come for a while, but it’s a bit of a trek to Ridgewood for me.\n\nThe pizza is worth the trip. It’s definitely in the upper echelon of NYC pizza. The square slice had great flavor. I particularly liked the marinara square, the sauce is different than the round. The round pie is a classic NYC style. Great crunch and excellent bake.\n\nI will definitely return and will try a fresh baked full square pie."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMzdDLWZBEAE",
            "text": "Traveled all the way from Nassau county (work out there) before going home to try this place. I felt that Dave Portnoy lowballed this place due to being in a rush.\n\nThe slices were incredible. Both had a nice char on the bottom and had a nice crunch when eating. The regular was very delicious and very easy on the stomach due to the fermentation of the dough.\n\nThe star of the duo was the Upside Down Sicilian which was my favorite. The sauce was incredible and the crust was nice and airy with all the nooks and crannies you want in a good slice. I dare say it is done even better than L&B (my opinion ).\n\nNick was very welcoming, and was passionate about what he does. The service was great and done in a reasonable time despite only being him and Desiree.\n\nThe place was small, but it had a nice character and good ambiance to it.\n\nI strongly recommend this place for pizza fans and casual eaters. Ciao!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MmVHa19nRRAB",
            "text": "We’ve been wanting to make the drive to Manos from suffolk county for a while now. Today we finally were able to stop by and we were definitely NOT disappointed. By far one of the best slices we have ever had.  The pizza was very flavorful, not filled with tons of oil, and the choices were very unique. The staff was very kind and nonstop working their butts off making fresh pies constantly. I highly recommend!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLVlISlFBEAE",
            "text": "Amazing pizza. The dough / crust is a cheat code, you could put anything on it and it'll be delicious. Crispy and chewy at the same time, the upsidedown sicilian is crunchy and extrmemly airy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3djRxaVRBEAE",
            "text": "Every slice and pie at manos is as close to perfect pizza as I could ask for. It’s light and airy, but crispy and incredibly flavorful - dough, sauce and everything else. Just the exact balance you want out of a NY slice. I’ve been going in since they opened up a block from my place a while ago, and each time I leave thinking how incredibly lucky I am to have them so close by. Thanks y’all!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOHI2Mk5REAE",
            "text": "Easily the best pizza in Ridgewood and strong competitor for best slice in NYC. Really quality and made with love. You can tell everything is done with the utmost care and attention to detail and quality of ingredients"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMDdEZjZBRRAB",
            "text": "I have been going to Mano’s Pizzeria since they opened around the end of last year. It is without a doubt the best pizza I have had in that time. The crust is fantastic, and matched in quality only by the ingredients on top. The Minucci is my go too, with a great balance between salty cured pork and hot honey. The Fulgeri is another slice worth mentioning, interesting and inventive, the onions make a fantastic addition to the classic white. The upside-down Sicilian is great even if you aren’t usually a fan of the square slice, thanks to the painstakingly made base.  And if all this wasn’t enough, they have the best garlic knots I have ever had! Truly thrilled that they opened up so close to my home, and hope them them only success."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOeUh5cUtFekl5VVJREAE",
            "text": "Tried the Pepperoni pie.\n\nLoved the fermented dough, which added a unique and pleasant flavor I couldn't quite pinpoint. The sauce reminded me of some of my favorite pizzerias from my childhood, bringing a nice sense of nostalgia.\n\nOverall, a great experience. I'll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxM01TV1hnEAE",
            "text": "Went in on a Saturday before Christmas Eve around 6 PM and they were slammed. The lady at the counter was very nice and apologized for my wait. I put in my order for a grandma slice, vodka slice and four garlic knots with marinara. Everything was delicious, it was cold by the time I got home so I ate one slice semi cold, reheated another and reheated the knots. The knots were super garlicky which I love and I also got a Coke because you can’t have pizza without Coke. The space is well decorated however, it is small, and having it be winter, it can get a little cold. Definitely like them better than Rosa’s on Fresh Pond."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMlRubDFRelV3YUdsek9FTkpRbWR4WkZwbmVWRRAB",
            "text": "No joke some of the best pizza I’ve ever had. Even just the plain slice was out of this world, but the Manopella slice is an absolute MUST! The dough is so light I’ve never felt so good after eating multiple slices of pizza, it doesn’t weigh you down at all. We drove out 45 minutes out of the way to go here and would do it again every time, it’s worth it. Will be telling everyone to go here!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoX2MzN2J3EAE",
            "text": "This is the BEST pizza I have eaten in ages! I have learned to settle for \"fine\" pizza over the years, because great pizza is not easy to find. Mano's has changed my mind, I no longer want other pizza...I don't want \"fine\". I want pizza to feel like an amazing and special occasion, the way Mano's pizza felt tonight (a random Wednesday.)\nThe crust is thin, but it's still chewy and bouncy in all the right ways. The cheese on the Fulgieri was...unmatched. The caramelized onions were delicious pops of sweetness throuhout the pie. We added sausage to half, and we added chicken cutlet to the other half, just to test things out since this was our first time. Neither disappointed. Every ingredient is high-quality and the preparation left nothing more to be desired. A complete masterpiece!\nUPDATE: We couldn't resist and had to order from Mano's again tonight. This time the Upside Down Sicilian favorite pizza! I will dream about this pillowy, crisp, slightly tangy crust. A new precedent for crust has been set--you've raised the bar!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlb3NEdG5BRRAB",
            "text": "Drove to this pizzeria from Eastern Long Island because I heard it was top tier. One of the best pizzeria's I have ever eaten at, if not the best. Dough is fermented 3 times longer than most pizza places and the flavor shows. This is pure, perfect, delicious pizza. Worth every second of the trip to queens."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cEoyOExBEAE",
            "text": "I can draw a metaphysical line in my life as to the moment before I entered Mano's Pizzeria, and the time since eating Mano's Pizzeria's pizza slices. It divides time into a new reality in which I now know the location of a pizza which is transcendental. And if you are reading this then congratulations...you also now know. Do not hesitate to go. I would try to get Mano's Pizzeria to cater my wedding, if I ever were to get married. Because what better way to treat all of my friends and family than to introduce them to a pizza with such a dimension of perfection. Such fresh ingredients, such a studied recipe (perfected over many years) and such kind and warm service. Again reader I urge you, go forth and sample this utterly significant development in pizza history."
        }
    ],
    "reviews_count": 81
}