{
    "name": "Mon Cheri bar restaurant pizzeria",
    "place_id": "ChIJD9YnwIRewokRm_3s94ZirWQ",
    "grid": "QN5",
    "address": "Mon Cheri, 64-14 Fresh Pond Rd, Ridgewood, NY 11385, USA",
    "rating": 4.9,
    "user_ratings_total": 138,
    "phone_number": "(929) 583-8100",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwS1EyOTBWSEJUVTJsZlVWcERla3gwVGxVMGRIYxAB",
            "text": "This is the best place ever! The owners Pablo and Valeria make you feel like home, like they know you for ever, they are the best.\n\nPizza is so ridiculously FRESH and delicious, you NEED to try it. Everything in the menu is fresh and delicious!!! If you wanna try some real pasta try it here.. they make their own pasta!!\n\nThe have a gorgeous patio on the back with a huge tv. Bathroom is ALWAYS so clean and smelling wonderful.\n\nThe atmosphere at the bar is so friendly, everyone is local and amazing people to be around."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aYU1FWnRUalJ5U0doQ2JVNUxNelpaV1dwdlNWRRAB",
            "text": "One of my favorite spots in all of New York :)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KblZVdEJhVlExY0daTlEybHplRlJ6V1dwUmFsRRAB",
            "text": "Overall an amazing place. I come here with friends or by myself. I’ve lived in Ridgewood for 30 years and this place is the best thing to happen to this neighborhood"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oU2JXODRaMDVTV2kwMGVrRXpMVGxMTmpaS1dWRRAB",
            "text": "Amazing experience all around 10 stars. Best spot in ridgewood by far for food, drinks and vibes! Best service as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwM1kwTnlZV3BGWkhCck1VTlVNakZ3VnpoNmJsRRAB",
            "text": "Amazing!!! Fresh, homemade, great vibe, atmosphere and staff. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeVJIZE5Vemd3U2xkTGEweE9lVjlDT0VaMVYzYxAB",
            "text": "Das beste essen ist im Mon cheri. ich lieben diesen ort."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWFFVbGhSVkF3TFRkbVJFUlpSWFJvUkdSa1RsRRAB",
            "text": "Went in on a Monday Afternoon, we got Ribs and grilled chicken on the specials today. And out free drinks since it’s Monday. Low. The food it was so good and soft and well cooked. We even got free shots 🤭"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4emNXMDNZWGxoVVdsRFlXNUNXVzEzZG1KdFluYxAB",
            "text": "One of the most pleasant and hospitable restaurants in the area! Paulo and Valeria were super amazing!! Pasta dishes were great portion and flavor-full! The Aperol spritz we had was so refreshing on a hot day! Barbecue Mondays with Larry making really great meats on the grill! We will definitely be returning back :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNFFrYzFWekJwTXpWM1dXZEViVWhvYVVKaFZWRRAB",
            "text": "Had the *BEST* time here for a friend’s birthday and comedy show! The service was wonderful—Thank you Valeria and Paolo! The food was delicious (I loved the calamari, tagliata steak, and the lychee martinis were divine and not too sweet!🤤)!!! The comedians were hilarious and almost literally had me on the floor laughing! Amazing for groups, but I think it would also be a super cute spot for a date night, too!! ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5YWJIWmlZMXB3TW1wUk5sUkVZM1ZMZFd0eU4xRRAB",
            "text": "The food is excellent. The staff is so nice and attentive. I think this is one of the best places in queens!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VE1VSjBjbWxEV2s4dGIwd3pWVlZMVlRsTVdHYxAB",
            "text": "I came to the area for a celebration, and the original restuarant I chose to bring everyone to was closed today, no announcement! People were traveling from far, so I needed to find a great place in the area, and fast. I'm so happy I found this gem of a restuarant. It's no ordinary pizzeria. The owners love each other and the public, and it shows. Paolo is kind and knowledgeable. Valeria is a fantastic chef, and so accommodating to my party.  Richard, the regular, is a terrific asset to the ambiance. The food is authentic, the melt-in-your-mouth lasagna is cooked completely from scratch, and the mussels *muah* delicious. They even have a beautiful outdoor patio. If you're in the area, check this place out! You'll love it, 100%!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQk5HczVibTgyTVZkeVNGazJVRzFhU25kUFZFRRAB",
            "text": "Very delicious, fresh and homemade pasta! Super friendly staff and food that hits the soul. I’d come back every week if I could!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZVE4Slg2Njg3UC13RRAB",
            "text": "They made us a custom pizza with no cheese and it was fresh, light, crispy and crunchy. The patio is really nice for enjoying a beer"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLTdxcG5Yd3V2VXBRRRAB",
            "text": "The food is really good, we already enjoy the dinner."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNYkgySjNRaWNXRnRRRRAB",
            "text": "Love Love Love!\nMon Cheri is truly a hidden gem. Valeria and Paolo do an amazing job. They bring a very European feel to their restaurant. The food, music and vibe take you to another place. My favorite dish is the Truffle Ravioli with sauce sourced from \"friends from Italy\". Paolo has excellent bartender skills as well! Try the Negroni. I am proud to say I am a local!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSFJfS0hvX3QyN0VnEAE",
            "text": "I had the most amazing meal today at this charming restaurant . I ordered the tagliatelle, and it was absolutely delicious—perfectly cooked fresh pasta with a rich, authentic sauce that instantly transported me to Italy. You can truly taste the love and tradition in every bite.\n\nThe owners are incredibly friendly and welcoming. I had a lovely conversation with them, and it’s clear they pour their hearts into everything they do—It’s rare to find such genuine hospitality these days.\n\nEven the little touches stand out: they serve beer in chilled glasses, which is so hard to find anymore but makes all the difference. I can’t wait to go back and try their tiramisu next time!\n\nHighly recommend this gem—not just for the food, but for the heart behind it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcnRuVVZnEAE",
            "text": "I love this place. The staff is frienfly, the food is great, the draft beers are fresh and cold which i love, the music is good and always different and a great selection. I love that they have the bar almost outdoors and two tables outdoors, I got lucky the last two times to enjoy the spring weather with my friends."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaGF2QkxBEAE",
            "text": "I have not yet eaten here, but I am caught in a personal crisis because your food is Italian, your staff is welcoming, your atmosphere is beautiful — and your name is French.\nI am giving you 5 stars for the food and 1 existential meltdown for the branding. Viva l’Italia."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbm9qUmNnEAE",
            "text": "They make u feel at home very peaceful and great environment"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOHZDNW9BRRAB",
            "text": "Mon Cheri is by far my favorite restaurant of all times.   The food is extraordinary.   The pizza crust is home made and the pizza is the best I have ever had.  The pasta, lasagna, ravioli are extraordinary.   Home made!!  Sauces are homemade and delicious!!  The salads are fresh and beautifully dressed.  Fish and meats are prepared to perfection.  All in all,  the food is fantastic.\nThe bar is well stocked.  The wine list is enticing.\nThere is outside seating if you wish.   With heaters for the cold weather.\n\nThen,  on top of all this,  the owners are not only gastronomical geniuses, they are friendly and willing to serve what you'd like, how you'd like it.\nDo yourself a favor and try Mon Cheri Freshpond Rd Ridgewood Queens. You will thank me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbzRfQWVnEAE",
            "text": "I am not the type of person to ever write a review (good or bad), but the service here was so incredible, I would be remiss in not making the effort.\n\nFirst of all, the food was excellent. We had the pizza. It had perfectly crispy crust, and delicious high quality cheese. We also had the calamari, tender, tasty, and fried perfectly. I had the homemade pasta bolognese, and it was also made from quality ingredients and cooked to perfection.\n\nAside from the excellent food, the service was out of this world. Our waitress, Valeria, was attentive and friendly. Even my 6 year old said, “Wow, Mommy, she’s so nice.”\n\nOn our way out, we were given a complimentary shot of delicious limoncello and dessert.\n\nSeriously… out of this world. I 100% recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MTU3eEVREAE",
            "text": "great food! Great desserts! Would whole-heartedly recommend this place!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aHEydEhBEAE",
            "text": "This place serves a great atmosphere and food. Their Pasta Vongole was amazing as they served a generous portion of mussels and shrimps. Valeria always makes our visit worthwhile as well as she constantly checks up on us asking if we need anything else. Thank you!!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NlB6cXdBRRAB",
            "text": "This was the second time I went to this restaurant for a karaoke night. The first time I came was when I celebrated my birthday. But this second time was a complete change. The owners completely ignored me while tending to the two tables. I was about to leave the restaurant when one of the owners finally acknowledged me. The male owner was walking past me a couple times and didn’t ask me if I needed service. Since their English is very limited, my words were completely twisted and misconstrued. The female owner also gaslit me and made it seem like I had no reason to feel the way I felt. I also wasted the first hour there because my friend who hosts karaoke night could’ve took me with him. I will never ever step foot in Mon Cheri ever again. Even if they improve their services. I also heard that I was referred to as \"the black girl\"."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndnFQVmVBEAE",
            "text": "The staff were warm, welcoming & friendly. They made you feel like you were a friend. They have a special $10 pasta lunch & it was delicious! I was seated at their patio which was heated & it was cute! I pass by this restaurant all the time & I never knew about their cute patio. Definitely would go back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBOFpDQ3dBRRAB",
            "text": "Delightful and friendly restaurant serving homemade Italian food- delicious Roma style pinsa and homemade pastas. Service is personalized and wonderful. Full bar with drink specials. Bright and sunny enclosed garden in back. Great for families and groups! Glad we gave this understated looking spot a chance- we will be back!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmd2J5MV93RRAB",
            "text": "This feels like an Italian version of Cheers! Super friendly owners providing warm conversations and delicious food. Patrons engage with each other at the bar in a most friendly manner. The pizza is outstanding and I look forward to returning for things like homemade meatballs and what I assume will be wonderful pastas. We had such a good time last night!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdm9tRU9REAE",
            "text": "Mon Cherie is truly a gem in this Queens neighborhood! We arrived in NY late last night and were delighted to find Valeria and her husband serving a full menu of authentic Italian food with a choice of great wine or cocktails, well after the traditional dinner hour. Not only was the pizza and wine superb but we were charmed by Valeria’s welcoming personality. Within minutes, she made us feel like we were regulars. If we lived in this neighborhood, we know we would be! Think of this as the Cheers Bar, Italian style, where everyone knows your name and each others’ even if you’ve just arrived in town."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeXNEVEJBEAE",
            "text": "Good vibes and friendly service,  Negroni was tasty and made with Hendricks. And the Ravioli with truffle sauce was excellent."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEOU1TeUtBEAE",
            "text": "Great Place,Very friendly staff ,delicious Food 😍Love it\nComing back always!"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzc1lEQktBEAE",
            "text": "Comida muy rica, el postre de tiramisú estaba delicioso\nLa atención también 10/10\nMucha gracias"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYal9fR3FnRRAB",
            "text": "I have eaten at this restaurant quite a few times.  The food here is fresh and delicious.  This restaurant is worth going to a hundred times over.  Aside from delicious food the atmosphere here is great.  When you are here you feel at home no better feeling can you get from that.\nThis is the place to go to in Ridgewood and leave happy and deliciously content.\nI have lived in this neighborhood for many years and proud to call this restaurant a true jewel in Ridgewood.\nPlease don't miss the opportunity to experience true joy in a restaurant.\nThanks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYN29qbEVREAE",
            "text": "Great food for a great price. $5 for coffee and a sandwich! Very friendly staff\nCoffee was excellent!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNzlUbklnEAE",
            "text": "So good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucy1mZUtnEAE",
            "text": "Great service and tasty food 🤩…"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudzR5bU1BEAE",
            "text": "Perfetto"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuZ0lqOHFRRRAB",
            "text": "Outstanding! My wife and I tried it for the first time last night. I pass it on my way home on the bus. We loved everything about it. The service and food were AMAZING. It will most definitely be our regular spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINkllM2xBRRAB",
            "text": "I decided to go to this restaurant because of all the great reviews, however I really didn’t enjoy the food. It wasn’t bad, but it wasn’t delicious. Just ok ..\nThe service was good and our waitress was very nice!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cmRHb1JnEAE",
            "text": "Family owned bar, Family owned Restaurant. The attention/ detail that the owner provides is unmatched. Great spot for drinks, food and hospitality. Tip your bartender!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidnRXR0FnEAE",
            "text": "We stop by for some snacks but oh boy this is one of the best spots in town I'm from Rhode Island and was visiting my sister\nThe pizzas and the pastas hoke made are to die for, the Desserts home made by the owner Valeria, she's is the sweetest person i have meet, her charisma, service, are top. Really good wine selection and creat cocktails."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidnFYZlN3EAE",
            "text": "Mon Cheri is without a doubt one of my new favorite places to eat when I come into Queens from Rhode Island. The food, the drinks, the service are all top tier. Valeria is warm and welcoming and takes good care of you! We had the Marg, cheese, pepperoni, and four seasons pizza, and the lasagna. Every dish was made to perfection; very authentic flavors and fresh ingredients. I was blown away by the desserts as well. Homemade, fresh, and absolutely delicious. We devoured every plate up. I love it here!! Can’t wait to come again. Thank you Mon Cheri!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNXJTRHBBRRAB",
            "text": "Great place , Cozy ambient and beautiful people ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidHNhZEF3EAE",
            "text": "Perfect!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMDlPcVp3EAE",
            "text": "Went in for dessert, not knowing what to get. Friendly and helpful staff recommended a delicious slice of pistachio cake with a cup of iced latte. I would definitely go back and order the same again!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacHJhUGhnRRAB",
            "text": "\"Wow, what a hidden gem! Mon Cheri Bar Restaurant Pizzeria exceeded my expectations in every way. The atmosphere was cozy and intimate, with a warm and inviting decor. The service was top-notch, with friendly and attentive staff who made us feel like family.\n\nBut the real star of the show was the food - oh, the food! We ordered the Margherita pizza and it was cooked to perfection, with a crispy crust and flavorful sauce. The pasta dishes were also delicious, with generous portions and rich, savory sauces.\n\nAnd let's not forget the drinks! The cocktails were expertly crafted and the wine list was impressive. We ended the night with a decadent tiramisu that was simply divine.\n\nOverall, Mon Cheri is a must-visit for anyone looking for a authentic Italian dining experience. We can't wait to come back and try more of their delicious offerings!”"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaF95WXVnRRAB",
            "text": "This place has a really really good frozen pistachio cake thing. It’s so good. You gotta ask your server. Also the staff is very sweet and friendly. A relaxed family owned place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyaXEtMEp3EAE",
            "text": "Amazing atmosphere and friendly servants"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMMDhtd21nRRAB",
            "text": "Great food and service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUMDU2S21nRRAB",
            "text": "Very nice intimate family run space. The owner and the staff are all super friendly and the food is amazing. It’s our go to spot for Italian food. They are Also extremely accommodating, of allergies. my partner is allergic to wheat some berries and has a lactose intolerance, the owner was more than happy to accommodate her allergy. She spoke with my partner to find and basically custom make a dish that was both amazing and accommodated her allergies. Likewise the drinks were fantastic and made exactly to our taste. 10/10 great restaurant you MUST GET THE RAVIOLI"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUN2YtVml3RRAB",
            "text": "The owners are super sweet and welcoming. The food is great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aWRIX1dnEAE",
            "text": "Upon arrival to the restaurant you can immediately feel the family vibe. The staff are extremely friendly and personable, which is missing from most restaurants these days. The amazing backyard oasis is surprisingly quiet compared to the…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcWMza2xnRRAB",
            "text": "Family owned and runned by an amazing couple. Family, Couples group of friends going out you name it, they will make you feel home and respect your wishes on food or music, not to mention the desserts all home\nmade fresh ❤️❤️, Amazing Albanian/Italian attitudes from owners  , if you know you know ;),  Lovely Authentic Italian food all made from scretch. Its my go  to place these last months  and cuddent be happier."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGbWZDdnRBRRAB",
            "text": "The vibe is excellent the service is like your sister is serving you a home cooked meal. The drinks are awesome !!! Try the burger and tiramisu!!! Love this food !!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaElPd1F3EAE",
            "text": "I went for a brunch on Father’s Day with my daughter Phia. She 2 years…her mother was working on Sunday.  We had a Father’s Day special!  The service was excellent and I love environment.  A great place to relaxed and spend time with your family! ✅✅✅"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGczZQdzF3RRAB",
            "text": "I have been at this place few times to try something different every time from food to the drinks and is always great. I’m glad to have a nice place closed by me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaGU2dGVREAE",
            "text": "The steak was delicious. I recommend. The italian kitchen is authentic lime I tried in Italy.the beer is super fresh"
        },
        {
            "date": "2년 전",
            "language": "sq",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMUxxYm1BRRAB",
            "text": "Isha para nje jave dhe Meriton 5 yjet në te gjitha drejtimet, sherbimi , birrat akull, ushqimi perfekt, edukate mireseardhja nga kamarjeret mrekulli, cdo gje impresionuese pervec nje dickaje…..…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbV9ULWNREAE",
            "text": "Recently we stopped by, killing time before the turkey feast, and ordered a pepperoni pizza. Hands down the BEST PIZZA I've had in a long time! Rosa's up the street got nothing on their pizza--thin, crispy, bubbly crust, just the right amount of sauce and cheese ratio and the pepperoni was savory and not too salty as the other competitors.  My husband rarely eats the crust BUT this time he did! We will definitely come back and try other dishes, but for now the humble pizza is my favorite dish. When I'm craving a pizza I'm coming here. At $17 for a 12\" it's priced just right--for the quality and taste. And Valeria, one of the co-owners, is genuinely warm and kind. We enjoyed talking to her and she shared her signature lemon drop shot with us. Also, very good! Stop by soon and enjoy this little neighborhood gem!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbVpuV1RBEAE",
            "text": "So happy to have Mon Cheri here in Ridgewood. This has become my wife and I favorite new place. The food is made with love and it shows. Cold beers, wine and cocktails all reasonably priced. The family / staff will make you feel welcome and take care of you like one of their own. Excellent coffees and homemade deserts to die for. Don't pass this special gem by."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaeF9IdXRBRRAB",
            "text": "It took me awhile to stop by but so glad I took the chance on a random morning that I missed my bus to work. THE best espresso in the neighborhood. Valeria is so inviting and her family is sweet. I’m a hard anti fan of tiramisu but when I tried theirs, I quickly had to grab a slice. Not too sweet and it’s the perfect texture.\n\nI can’t wait to go back to try more things. Support more small businesses on this street 🩵"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aEtHemJnEAE",
            "text": "Valeria y su esposo son las mejores personas que he conocido en un bar. Gracias por hacerme sentir familia. ❤️ Las cervezas artesanales, la pizza, los postres y todo lo que venden es demasiado rico. Recomiendo conocer este lugar y probar sus delicias. ❤️❤️❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOXU3SWpnRRAB",
            "text": "An authentic feel from caring and attentive staff. Quality fresh food with a true family feel. A great addition to the area for sure. The freshly baked Focaccia was amazing"
        }
    ],
    "reviews_count": 62
}