{
    "name": "La Bella Mariella",
    "place_id": "ChIJ506iJpBewokRowmDMZlSgH4",
    "grid": "QN5",
    "address": "60-61 Fresh Pond Rd, Maspeth, NY 11378, USA",
    "rating": 4.3,
    "user_ratings_total": 286,
    "phone_number": "(718) 366-6170",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRVNFMVlPRUZwTmpoMWJsUnJjVGxKVFhoellXYxAB",
            "text": "Would not buy food ever again here over prices . Cheap quality and everything from yesterday is refrigerated and just warmed up the next day .i rather spend money at Rosa pizza on fresh pond . La Bella is not how it used to be and want to charge extra for small things . Might as well take my paycheck. This place is highway robbery and the calamari is frozen and so chew u Need to eat one piece with two people"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTll6aFFlalV4ZEdWSldHcHlUa1pwTVZscVYxRRAB",
            "text": "Rude as hell - don’t bother  even to call\nShould run the business if not wiling to talk to customer - not nice"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Fd1FVMDVRbEZQT1VOWVVUSXpRa0pNUlhWMVJVRRAB",
            "text": "Best pizza in the neighborhood. A lot of these pizza places use sweet tomato sauce and I’m honestly not a fan. But La Bella Mariellas sauce is just right. The pizza dough is crispy and not too thick. I love it ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWWVWRk9TbEEzTXpnM1pFaGZkemsxWkVWVFZsRRAB",
            "text": "10:50pm and they say they closed for delivery and for pickup ,when it clearly says they close at 12am on a Saturday . As the years go by this pizza shop just gets worse day by day  especially the rude man who answers the phone . So don’t even waste your time like I did one last time !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMbUo5YzJtOFptbnhRRRAB",
            "text": "Okay the delivery guys they have are the best. The people they have answer the phone not so good. Can't understand them. Now I put and order in from what inthough was a recent menu. I sit there and calculate my order before ordering.  I get everything but the tax. So I was told my order was going to be one thing which I agreed with. But when the delivery guy came the bill was $10 more. Now.mind you everything we order we ask for and undated menu. So now because of this I am done with this place. Only because this isn't the first issue. They sometime forget to send stuff. Or they send the wrong thing. That has happened like 4 times and owners say we will make it up to you. He did once. What happened to the other 4x's. And it is ashamed because my family and I both like this place"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMHJHaDhRRRAB",
            "text": "Best pizzaria in Maspeth. Food is always fresh, service is good & pricing is good. Stop by and just try a slice and you will see what I mean."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aDhiVXZRRRAB",
            "text": "Hot, fresh and delicious is the best way to describe a meal at La Bella Mariella. Everyone should try it at least twice and tell your friends about it too."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dXAtaENREAE",
            "text": "Buffalo roll was amazing"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmLXV5T1NnEAE",
            "text": "Would not suggest this disgusting place\nThe food seems to be there for veru long time plus if you like people that cry for tip literally.. the employees are very rude and the owner should take a look how they treats clients. For the owner of this place i would suggest that you would take a look how your employee do their job and how they talk to the clients especially the manager they are very careless about anything. Disappointed and not going to recommend even a soda from this awful place…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNma1o3ZDlnRRAB",
            "text": "Food is not good. Dried meat, meatballs have no seasonings and are dry, pasta is barely ok. To quote my child \"Are these meatballs fake?!\"."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNma2ZiNVdBEAE",
            "text": "Food not well season. No sauce to the pasta which stated it came with sauce. The delivery came late. Plate so bland. Uwful and the meatball sandwich just outrageous. Meatball not seasoned no cheese in the sandwich and to make it all worst the sauce was just bland no season on it. The whole experience awful."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQM3RTNlJ3EAE",
            "text": "Guy who picks up the phone is rude, and always seems to in a big rush, and has the attitude like why you calling for a delivery when I'm so busy.\nPizza is very average.\nBake entrees are always under cooked."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbEp6ZkhREAE",
            "text": "Our go-to neighborhood pizza place. They make excellent Italian specialities other than pizza as well. They also serve gluten free pizza options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINTR1QnFRRRAB",
            "text": "Outstanding slice! Worth the trip"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbE8ybzd3RRAB",
            "text": "Best grandma pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidjZEejRnRRAB",
            "text": "Food is great but the person in the counter is the rudest in all of Ridgewood. I love going here for food but sometimes I don’t just because it’s such a hassle dealing with him."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOTg2V0N3EAE",
            "text": "I went yesterday with my son because he loves the pasta 🍝 from this place. They treated us very friendly. ....great service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicElLSEtBEAE",
            "text": "Great local place and I appreciate them not price gouging or overcharging for everything even though we're suffering through Biden inflation"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNmU2UENnEAE",
            "text": "Penne Vodka with fried chicken is my favorite dish. Their slices & specialty rolls are great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyeXFucE13EAE",
            "text": "I have ordered 1000 times from this restaurant.   I ALWAYS gave a tip, even if sometimes the delivery guy was a jerk.   I didn't tip today because of my fault.   After the delivery guy left, they called me from the restaurant and asked why I didn't tip.   they charge $7 extra fees after my order.   This is ridiculous.   This is the way to lose a regular customer.   Bravo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NGZ5dWN3EAE",
            "text": "Excellent slice of cheese pizza. Crust was perfectly crisp and flavor was great. Nice surprise for a quick slice!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaGJILXd3RRAB",
            "text": "Doesn't give ice for sodas!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUZ291WkNBEAE",
            "text": "AWESOME PLACE 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeU5XdkxnEAE",
            "text": "Best pizzeria in town!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMGM3aUNBEAE",
            "text": "This place is one of the best pizzerias\nIn New York! “Yes” I said one of best!\nThe grandma special is out of this world.!\nThese guys are not playing games."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0ejRfNjJ3RRAB",
            "text": "Plenty of pizzerias around.. this is one the best .. very tasty"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMGRUV0dBEAE",
            "text": "Love them their chicken cesar is the best! And their ricotta puffs"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGb2RxQXZRRRAB",
            "text": "Small family spot to eat in ... good pizza in Maspeth"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1OTh1OFNREAE",
            "text": "Super pricey for pizza place  and quality of good just ok.\nI think I can get much more the for $8 then slice with extra cheese and mushrooms"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MTl5Wm1nRRAB",
            "text": "The best pizza in Queens. Very nice service. Thanks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMkk2WUtnEAE",
            "text": "They are getting worse on communication. I think they are made enough klient and money.\nTime to be “I don’t care”"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaeDhTbGxnRRAB",
            "text": "Good food, good service and food always tastes fresh. If your in the neighborhood, definitely pass by."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdzZxMTJnRRAB",
            "text": "Honestly the worst food I’ve ever had shrimp and oreganato was drowned in oregano with soggy plain breadcrumbs, no flavor whatsoever,"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwd1BQVmxRRRAB",
            "text": "I love their eggplant rolls & Grandma slices. The food is very good!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNy12Sk93EAE",
            "text": "Super friendly staff and simply delicious food!! Their vodka sauce recipe is out of this world! And their pepperoni pizza is like no other!!\n\n100% Recommended!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaHEyM1BBEAE",
            "text": "It’s a bit overpriced for what you get. I got a plain burger no fried no Cheese no extras and paid $11 like since when is it that expensive?"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcXBURGh3RRAB",
            "text": "I did a square slice of the pepperoni cup pizza and a side of the broccoli raab, both excellent! I took home a hero, veal and mushroom and did a eggplant roll and a sausage and pepper roll. This place is superb really. Definitely recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Xzh6NVBBEAE",
            "text": "Nice staff, tasty slices, clean place. Great for a quick bite."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdFBXWkFREAE",
            "text": "Chicken ceaser salad 🍕 is the best around. Nice selection of 🍕. Clean, friendly and great service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeWYyWjF3RRAB",
            "text": "This is the neighborhood pizzeria. Have ordered multiple times never have an issue with the food."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtNTVXX2l3RRAB",
            "text": "Clean Pizza Parlor. I dont eat regular slices. Dey Have a Variety of Specialty Slice Pizza. But Need More Choices"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPNk9HcmJREAE",
            "text": "The best Italian food around at very reasonable prices.  The owner has a fleet of delivery guys and people working behind the counter.  I’ve eaten in and had delivery.  Not one complaint.  From pizza to tender veal the food Is fresh and made to order. Parking can be found easily."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeGZya1dBEAE",
            "text": "Penna a la vodka is delicious! So much flavor. Garlic bread and other pasta dishes we’ve tried in the past are very good as well. WAY better pasta than Patrizia's on Grand Ave. The delivery guy was also very polite. Thank you La Bella Mariella for good food and good service!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoanVuc1RBEAE",
            "text": "Time is 7:15 pm. I just walked out this pizzeria. Worst experience ever. I would give it no stars if possible. @THEBOSS, check yours guys, very disrespectful, ESPECIALLY the guy who puts the pizza into the boxes. There should be no reason…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5ejdUT2NREAE",
            "text": "I am a regular ordering here, whether it's the family's weekly pizza (both regular and Sicilian - terrific) or the occasional calamari and side of french fries (both absolutely outstanding - no idea how they do it!), it's very, very good food! And super friendly staff. 10/10 recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5M3ZlbnpnRRAB",
            "text": "Ordered a array of dishes, first the baked clams are delicious, the fried calamari is excellent. The baby lamp 🪔 chops were cooked perfectly, the linguine with clams in white sauce is yummy! The penne vodka with chicken is quite delicious. The service is super and the food is is quite outstanding! Nice work!…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbzUtckN3EAE",
            "text": "I like it, the place is clean, owner is friendly, and the service was fast. They serve a decent NY pie, but nothing special. All in all there are plenty better joints within 10 miles radius but they are still a great neighborhood pizzeria."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVb2JMa1JREAE",
            "text": "Not going here anymore!  I was never really impressed with their food; sauce Six.  I just bought a chicken roll & took it home to eat. But was hard as a rock, probably was old & should have been thrown out instead of sold.  I recommend Rosa’s up the street, much better!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOTRiSl9nRRAB",
            "text": "So yesterday my fiancé and I ordered a pizza pie from this place and let us tell you this place is the best place we ever ordered from.\nWe will definitely be enjoying the menu because this is very great pizza, attention to detail. we will also be referring you. Thank you AGAIN FOR THE BEST PIZZA EVER ☺"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcVB5dXdRRRAB",
            "text": "To be honest there pizza isn’t the best it’s definitely good though, But there Italian food and pastas are amazing. Ordered directly from there website, food was delicious and very hot and even stayed warm for couple hours to eat it again bc I couldn’t finish all the food I order on arrival."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpN2NQOVhnEAE",
            "text": "Best grandma pizza I've ever had. One of the several things I miss since moving upstate. And, yes, we all know you have online ordering. Enough with that cut/paste response."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBanZ6VV9RRRAB",
            "text": "They have a great selection of pizza, calzones, and more. My wife has an eggplant slice, my son had cheese slice, and I had a chicken and broccoli slice. We were all very happy because the food was great. Lastly, the staff was very friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaHVmem5RRRAB",
            "text": "This place never disappoints.\nI’m working in area and order lunch time to time through out the years .\nPlus we order catering for in office celebrations or Holidays such as Thanks Giving , 4th of July , Christmas and they always did a great job through out the years .\nFriendly stuff , quick delivery, food is good and they always listen and deliver exactly as per your instructions .\nNot a fancy place just simply good food ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxanRqMkRnEAE",
            "text": "Great local pizza joint. Their sicilian and buffalo chicken slices are always an option. Along with pizza, they serve many other options (rolls, sandwiches, etc.) which you cannot go wrong with."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjZ3ZYZUFREAE",
            "text": "Had the stuffed shells...loved the fluffy ricotta and savory tomato sauce...I'm not a surgery sauce girl...this was perfect. Next on my list is broccoli rabe sauteed with garlic...yum!!! The pizza is great p.s....service is sweet!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5LU83QWR3EAE",
            "text": "Oh boy...I'm a huge rice ball fan and I have to admit, they sell one of the best rice balls I've ever had. Pizza is delicious as well. The staff is super friendly."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdFlxRmZnEAE",
            "text": "Me sorprendió que nadie usa guantes para manipular los alimentos eso es antihigienico ya que cojen dinero y tarjetas para cobrar, me parece desatinado que empleados de este sitio morboseen o acosen con miradas como si quisieran arrancarles la ropa a las chicas que entran al lugar. Yo no regreso a ese lugar, la pizza ademas no es fresca, si no que la recalientan en el momento malo malo\n\nI was surprised that no one uses gloves to handle food that is unhygienic since they take money and cards to collect, it seems unwise for employees of this site to morbid or harass with looks as if they wanted to tear the clothes of the girls who enter the place.\nIt is no good, I do not return to that place, the pizza is also not fresh, if not they reheat it at the bad bad moment"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNnJPcnd3RRAB",
            "text": "Great pizza . Always satisfied with anything I get from pizza to dinners. Love the fact that they have Mike's hot honey available. Great job guys , I'll always be a regular."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocGFHQ25nRRAB",
            "text": "We got 4 different slices of pizza. Not much flavor. Crust was completely tasteless.  We would never go again."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZc3EybG13RRAB",
            "text": "The best pizza ever. I always go back to them . Always fresh , great taste . The fried calamari are just amazing. And the shrimps omg . The only pizzeria I order from ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2NE4zV01BEAE",
            "text": "My 90 year old Sicilian father won’t order pizza from anyone else. They love the Grandma pizza. Service is great too! Si mangia bene 🇮🇹…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcXFfNnBRRRAB",
            "text": "The guys are very pleasant over the phone. Every dish I have ordered has been great.  Thank you guys keep up the good work."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCemVUSHFRRRAB",
            "text": "I just have to say one thing , they are the best , with delivery's orders i been ordering from there a lot of time and always i get what i want ,love everything from them , they take care of the food too, really love this place thanks so much keep it like this ❤️❤️"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhbnVDU3NBRRAB",
            "text": "Stopped to get my family slices. Happy i did! The pizza was delicious and the staff were so nice! Mmmm authentic NY pizza."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbXBEZmxRRRAB",
            "text": "Excellent food and prices!  Victor & Frank great guys!  Excellent service!  All staff great!  Great sense of humor;  we are treated very very well!  Best Pizza in Queens! Bob & Rodney"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdzRPYkt3EAE",
            "text": "I don't like pizza personally.\nHowever everytime I pass by I get pizza for whole family. Everyone loves it. I guess best slice in NYC"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycl9qaWJBEAE",
            "text": "Best pizzeria around have been going there for 20 plus years with no complaints. Food is always great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMlBic0ZREAE",
            "text": "Excellent, a neighborhood staple. Amazing baked clams, veal or chix parm. Fettuccine Alfredo . Ricotta puffs all excellent. Never was dissatisfied EVER"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlajZHSTJRRRAB",
            "text": "The best pizza in the area!! From quality to service, I’m never left disappointed! I love their penne allá vodka! Thank you guys"
        }
    ],
    "reviews_count": 69
}