{
    "name": "Ridgewood Taco Factory",
    "place_id": "ChIJ0Qk3L6lfwokRCCa21K0u5p0",
    "grid": "QN5",
    "address": "66-89 Forest Ave, Ridgewood, NY 11385, USA",
    "rating": 4.3,
    "user_ratings_total": 164,
    "phone_number": "(718) 456-8226",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMlRqSlBMVzB5YUVWYWJVbFhXUzFmT0VRdFEzYxAB",
            "text": "I absolutely love the ground beef crispy taco. The quesadilla with the onions and peppers never misses either."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWc1YxWTFSbWRCYldOU1pHbHhiVmREVWpoaFNrRRAB",
            "text": "I order here all of the time. Today I ordered via Ubereats, and I dont know if they use bay leaves to season their ground beef for the piccadillo tacos, but whatever leaf they use to season they don't remove it. I bit into a freaking stem in two different tacos! Please teach your people that bay leaves are not supposed to be eaten, it's only supposed to be for seasoning!! I'll have to stop ordering here as more and more often I cannot trust the food that comes from here. The stem you see in this photo was literally buried in one my beef tacos... the first stem I let it slide and just threw it away, but after biting into YET ANOTHER TACO and the stem is twice as long as the first just made the situation unacceptable. You may have lost a loyal customer for good, because what kind of cook would send this out???"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxalZHVlVSamd5UlVwRVRFaHhVbXBLWm1GNVEzYxAB",
            "text": "Fresh, delicious & authentic. Lots of options, including seafood!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORU9FZExkRmhmVEhWNVZYQjBaVXc0YXpSS2QxRRAB",
            "text": "Avoid this place. The cooks here should really taste their own food and realize how bad it is. We live in the area and decided to give it a try out of curiosity, and honestly, it might be the worst Mexican restaurant in Ridgewood. The space looks nice, and our waitress was very kind, but the flavors are just terrible. They seriously need to work on delivering something of real quality. This isn’t authentic Mexican food. There are so many excellent Mexican spots in Ridgewood for the same price: this one feels like a joke. I’m sorry if this sounds harsh, but they should really respect Mexican culture."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TlJGZFJjbFZET0VOelZYcFFiSFJFZWxKdVdVRRAB",
            "text": "I placed order through seamless. The items arrived messy. The tings torts was upside down. The smell of chicken was not good. I was disappointed. 😔"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWmRtNDFXVUpwU0hwVmRIRkRSRTVhTVVkNFRtYxAB",
            "text": "Unless you're eating in the restaurant, don't waste your time. Youd be better off MAKING THE TORTILLAS FROM SCRATCH and eating that before your order ever arrives. Unless, you enjoy cold, soggy food. 👎🏼👎🏼👎🏼"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeWJFWlJPRTVQWmtwRVNtNXNVVFpDU2pCbGFtYxAB",
            "text": "Ridgewood Taco Factory churns out the best ‘bang-for-the-buck’ and tastiest tacos, enchiladas, and burrito bowls in Ridgewood’s corner of Queens!  Highly recommended items are the vegan chorizo enchilada with verde sauce, elote, croquetas de plantano, al pastor and fish burrito bowls, and among their tacos: pollo asado, chorizo, al pastor, picadillo, fried fish, grilled salmon, barbacoa, and vegan ‘chicken’ mole! Their crispy tacos (brisket) are really good too. The store has a cozy yet very festive and friendly atmosphere that set them apart as a really good extra-special neighborhood taqueria. 👍🏽👍🏽"
        },
        {
            "date": "1달 전",
            "language": "sv",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVFJHdHhhVFpIVWpabFlUQk5XbmMzTXpSdVMyYxAB",
            "text": "Chef’s kiss 10/10 😙🤌🏼"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMFJsQmllbHBsWWw5S1NtazJhV2N6TmtsaE5FRRAB",
            "text": "The food was delicious and delivered pretty quick I will be ordering from them again 😄"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTFh6SkJka2MwVVZsTVNYaGpibGN5VVVGVmVuYxAB",
            "text": "I’m not even kidding"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTU1ERk1lRlptYldWaWJrUjVZbkJwWmtWa05YYxAB",
            "text": "Muy rico los platos…a mi hijo le encanta.."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cGFtNTNaSEpoZVV3eFRtNW1WVXBwY0hkWFZsRRAB",
            "text": "I ordered delivery from here thru GrubHub, and everything was downright disgusting. I tried to rate the restaurant as trash in the GrubHub app, but there were simply no options, even from the help option. I didn't even ask for a refund, just a warning so no one else would ever bother. GrubHub was no help. So my only option is to warm people here that the food here is inedible. Literally go anywhere else."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLM0J0TG0yMEtXYU93EAE",
            "text": "Went here to celebrate Taco Tuesday with my handsome boyfriend. Not only are the tacos fantastic (particularly the Al pastor ❤️) but the service if u sit in is exceptional. No one was eating in everyone just getting to go I think people should really get out the house they will treat you great here"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbXBpX29RRRAB",
            "text": "I love the grilled tofu! Great vegan options. Highly recommend the vegan chipotle mayo, really made for an excellent burrito. The guacamole and chips are delicious too!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLVEo1SmZqX0lyRzlnRRAB",
            "text": "A good spot for a quick bite or takeout. Food was pretty good and youre able to grab an alcoholic drink too. Seating was limited but it wasnt crowded on a Friday night."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKbWw5TXlwX3JiTk9REAE",
            "text": "Best margaritas and burritos in the hood hands down!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJejZYdHFnRRAB",
            "text": "Always delicious and the staff is very kind. Great option for dining in or taking out. Also great lunch specials."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOHJlSjB3RRAB",
            "text": "Got this in my fish taco today from my uber eats order"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdUpqa3FRRRAB",
            "text": "I wish I could give this place a zero-star rating. I ate here recently and ended up with the worst case of food poisoning I’ve had in years. Within hours of dining, I was severely ill, and it completely ruined my next day"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aGZmZEhREAE",
            "text": "Very good food and customer service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MkxuS2dBRRAB",
            "text": "My guilty pleasure place when i occasionally get the freaky craving of eating a crunchy taco lol… it really scratches an itch this place happy its around the corner from my place!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncVpuU2RREAE",
            "text": "There was a point where I would go to this place 5 times a week when I discovered it and it’s only gotten better since. Carne asada tacos and burritos here are amazing. Burritos are made with a panini pressed outside unlike the soggy ones you get from chipotle. Open late till 11 and when I have a slight hunger but can’t finish an entire meal, I get one or two tacos and they hit the spot jammed with steak. Right off the forest ave M train makes it a great spot to grab food before I go home but sometimes I eat it there just because I can’t wait to dig in. Definitely worth a try if you’re in the neighborhood looking for a quick bite"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneWJQUnpBRRAB",
            "text": "Really solid food and friendly staff."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBa3V6b2pnRRAB",
            "text": "So glad to randomly stop in for lunch. Excellent breakfast quesadilla and very excellent staff!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmc2JULUJREAE",
            "text": "I drive 20 minutes for these tacos across Queens to get them."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbmQyemh3RRAB",
            "text": "Flawless burrito"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcHNyYUFREAE",
            "text": "Very delicious food. Much better than I expected."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueTRHdVVnEAE",
            "text": "I had a disappointing experience with my DoorDash order. The portions were very small, especially for the brisket and Chips & Guacamole, which cost nearly $11 for a tiny container where you would put sauce or a small coleslaw side. They didn't add guacamole sauce to all the tacos or offer it on the side, only providing hot sauces. The Carnitas Taco lacked flavor and was a letdown. While the Fried Fish Taco had good flavor, it was too soft and lacked crunch. The Carne Asada Taco was also flavorless and tasted like barbacoa. Overall, the meal left a lot to be desired. Tacos were gross and soggy. L.W.’s review is very accurate. Very blah!\n\nI also think some of the reviews on here may be created by owners friends and family. There is no way this is a 4 star restaurant, there are no Mexican flavors in this bland food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNGRITlZ3EAE",
            "text": "Great place, may it stay in business for a long time! They never miss and always have great food with great ingredients too! Love eating there and taking it to go! Yum!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudklpOENBEAE",
            "text": "Delicious and normally very fresh.\nVery good spot for tacos or a good torta!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINzZHNnRBRRAB",
            "text": "Great food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdXRXUENREAE",
            "text": "Very good food for reasonable price. Portions are huge. Carne asada quesadilla was delicious!(we added sour cream and guacamole)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbXBTZzFBRRAB",
            "text": "I moved from Los Angeles, so I'm skeptical about some of the Mexican food in NY. I was pleasantly surprised with Ridgewood Taco Factory! The lunch specials are affordable, I got the Torta and my girl got the Enchilada with green sauce. My Torta was huge, fresh and delicious. It was easy to eat and didn't make a mess either, very well crafted! My girlfriend loved the Enchilada as well. Thank you Ridgewood Taco Factory!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dF9TVG5nRRAB",
            "text": "They don’t have change for a $20 order"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3allfRnl3RRAB",
            "text": "Ordered a couple of chicken bowls & salad bowl. Food was fresh, filling, good balance of ingredients/flavors. Ordered thru Uber Eats & it came as fast as it gets."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNib2FKSRAB",
            "text": "This is My first time ordering from this place and im happy to say i finally found a good mexican burrito and taco restaurant\nAfter  ordering from at least 20 plus different restaurants and food trucks in the ridgewood/bushwick area. My food was fresh and hot upon arrival, delivery only took 25 min from the initial 30 minutes it was supposed to take and last but not least they gave me extra red and green sauce for my order when i asked for it, which is unheard of at any Mexican restaurant you order from. Im officially going to be a regular at taco factory!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbW9tV3hnRRAB",
            "text": "I consistently come back to this place despite all the others I’ve been too. They added some new items like that I definitely had to try and of course I loved them! They always give generous amounts of meat and their guac is still top notch !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibEtQTzZnRRAB",
            "text": "I come in to get lunch about once a week and the food is always great.\nUnfortunately, today I desperately needed a bathroom and asked them if I could use it, they said no, it's only for clients. Thought that was rude since I've been a regular for a while now 🙃"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibE4zWXlRRRAB",
            "text": "Me and my friend we came to eat tacos, from the time we ordered lady says 5 minutes, and it pass about 45mins still we didn’t get our food, so disgusted with the place. Lady who works there was so rude and insisted to pay upfront so we can’t leave if something happened.I would never go here again. Don’t recommend to anyone"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycU5IQ2tBRRAB",
            "text": "I am sitting at the restaurant as I write this review. The food was so absolutely amazing that I couldn’t leave without writing this first. My wife got the taco lunch special, I got the quesadilla lunch special, and we shared an elote. When I tell you this food was so packed with flavor and they were not cheap with the portions at all. If I could give them 10/5 stars I would. The price for what we got was just as amazing. I HIGHLY RECOMMEND TO ALL. 10/10!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycWRlaHlBRRAB",
            "text": "Nice tacos"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyb2ZUOHlnRRAB",
            "text": "Food is consistently delicious! Highly recommend the Quesadilla de le Calle!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6NTVYS2xBRRAB",
            "text": "*Bad customer service, over-priced/gentrified chain restaurant, and only surviving because we don't have an authentic Mexican restaurant closer on Forrest Avenue (Yet). Please check out Fresh Pond Mexican restaurants for quality, fresh ingredients, local, and authentic.\n\n*Here's why you should order elsewhere*:\n-If you're using a debit card, apple pay, or TAP for take-out, please check the price because they'll sometimes add a 20% tip if you don't choose \"no tip\" or change the amount you want to give them. 20% for take-out? Yea, that's a NYC hustle.\n\n-Asking or getting salsa or a little extra salsa is always a chore. A clear sign of a restaurant that serves people who don't know about salsas mexicanas or the culture. Even if you buy multiple items, they'll give you just two salsas.  You have to beg for more like it's a crime to want some seasoning to the bland food you'll be getting.\n\n-I asked for 2 salsa roja and 2 salsa verde and the front desk woman said they were all out of verde. She didn't even attempt to go to the kitchen and put some in a small container. That would have been too much for her to do. How can you have a Mexican restaurant and run out of salsa verde? I'll tell you how. If you're a gentrified restaurant were people don't know their salsas, don't ask, and accept bland food. And when someone who knows salsas of Mexico, you get rude and give a blowed-out response because your overpriced food isn't going to hustle people who know. Again, please check out the authentic Mexican places on Fresh Pond and support our neighborhood con comida hecha de mano con carino.\n\n-Want to pay around $25-$30 bucks for a small meal with about as much seasoning as Wisconsin coleslaw? Please get your overpriced, gentrified food here. I'm waiting for them to serve $15 avocado toast in the morning. I know it's coming.\n\nAgain, Fresh Pond, Myrtle Avenue; see the difference in quality, quantity, and a happy \"hello\" or \"buenos dias\" when you arrive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MmIyNmVnEAE",
            "text": "Ridgewood Taco Factory has good food and good decor. I like the Teal and Purple look. I would definitely recommend this restaurant. If you are looking for Mexican cuisine at a reasonable price you now found it at Ridgewood Taco 🌮 factory located at the corner of Forest avenue and Putnam avenue so stop on by for lunch or dinner if you are looking for Mexican cuisine Ridgewood Taco 🌮 factory has an extensive menu otherwise place an order for delivery through Uber Eats."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdVBmWnR3RRAB",
            "text": "The food tastes so good and is always fresh, my only issue is my order has been messed up a few times now. I get my usual burrito order and I add guacamole and I come home and start eating and there is no guacamole to be found. I pay the extra $2 and don’t receive guacamole— it frustrates me. I always have to make sure I repeat myself to let them know I wanted guacamole.  Other than that the taste is great and the workers are kind."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMXBPOWxRRRAB",
            "text": "Love this place! Quick delivery & great vegan options and the tacos are BIG!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcDQyb2tBRRAB",
            "text": "Not bad Mexican food although consistently mediocre. I had a bad experience with delivery once where the food was spilled out into the bag, cold and there was a hair in my nachos. Even still, I decided to give them another shot but that was another big disappointment.\nThey use to be better but have steadily gone downhill. Not doing this mistake again. Byeeeee."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaXVpMDBnRRAB",
            "text": "The guac and chips were delicious, as well as the mushroom taco, 5/5 for both. The papas y rajas tacos needed seasoning/flavor. Adding the mushroom taco to my rotation of what I get from them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdXJydzhRRRAB",
            "text": "Nice little place right off the forest Ave train station. Great food , nice staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5N2JTRUdnEAE",
            "text": "Nice people great tacos"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyeFlxTExBEAE",
            "text": "Actually this place was great. Food was delicious the aguas frescas were amazing but no service. This is a take out spot and you should have this in mind. The burrito bowl was great and the carnitas were fresh. The salsa roja is the spicy one!! Delicious some of it splashed inside my eye lol I guess people complain about their prices because everything is charged separately guacamole, cheese, sour cream but I think that’s ok."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNC1XUGxBRRAB",
            "text": "Ordered pickup from this place through UberEats, it was done earlier which made me very happy, didn’t have to wait much. Got the Carnitas Burrito. Went home and gave this bad boy a big bite and wow it was good! Great balance of ingredients and flavor, it was like a perfect bite. Unlike other burritos that normally have too much rice or beans or too dry, this was the total opposite, perfect amount of rice, juicy, I don’t know how else to describe it aside from really good! Definitely coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkM3RPUU5nEAE",
            "text": "Orders via Uber eats.\nI ordered the vegan burrito. It was dry and did not have black beans as stated in the description   It could definitely benefit from avocado or a vegan cream. They included a green sauce but the amount was so small, it only covered 1/4 of the burrito. The oyster mushroom taco was very herby to the point the corn didn't even taste sweet. It was okay. I ended up making some black beans for my burrito which defeated the purpose of ordering delivery. If I was going to cook, I could have saved my money.  I doubt I will place a future order."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXLW9HRmp3RRAB",
            "text": "My order got messed up but they were more than accommodating and fixed it. The staff is really nice. Highly recommend the tortas 🤤 The food tasted GREAT! the vibes inside are cute too.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSazZLVVZnEAE",
            "text": "First time coming here ,and it did not disappoint. The food, the atmosphere was good . The hostess/server mya was great and helpful. 10/10 will recommend. I will be comin back here thank you ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMHRHUm5BRRAB",
            "text": "Great lunch special. Tacos are two for $10, including a soft drink. Can’t beat the proximity to the library, either. Would definitely come again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSa3R1WTJBRRAB",
            "text": "What they get right they get really right and that’s the tacos. I’ve had the carne asada, papas y rajas, Mexican brisket, salmon and mahi mahi. All have been great but their speciality seems to be meats. Love the carne asada but especially the brisket. 10/10 love it"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2OE1XM01REAE",
            "text": "Wowowoow!!! Didnt expect the tacos to be this good. I got the oyster mushroom, fried fish, and carnitas. Fried fish was the best fried fish taco i have ever had (been on the hunt for a while now). Vibes are great inside! So happy they finally opened"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aUx6V2F3EAE",
            "text": "Great authentic Mexican food with a very friendly staff. Have been here 3 times already as I live nearby, and it's been great everytime."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlZ0tqVjlBRRAB",
            "text": "Came for lunch, great special! Quesadillas, burritos, enchiladas all available starting from $12 (with a soda/water included). Would definitely come back - had the brisket burrito and it was really good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXaXAtTDZ3RRAB",
            "text": "The food was so good and well-presented. I ordered a vegan chorizo taco, which was super tasty. It was also a nice-sized portion, worth the price. Very satisfied, will definitely order again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHblBDdXJnRRAB",
            "text": "Why only 2 stars? I ordered burrito and French fries. Burrito was for 5 stars. Was super tasty. I asked about French fries. It's home made? She said yes. No frozen. It tasted horrible. It was frozen. Made home but in some country in Asia i think"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHaDRYWFdBEAE",
            "text": "Massive burritos that are super filling for the price. Probably could be two meals. The carnitas is good and generous. Nice service inside as well. You can pay extra for sour cream, onions and peppers, etc."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dElDZktBEAE",
            "text": "Very good tacos i enjoyed the papas And rajas very good quesadillias fresh and well presented"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MUwyV3VRRRAB",
            "text": "Ordered delivery and it was 2 hours late. Then it was left in the hallway of my boyfriends building — no call, no doorbell rang, nothing. The burritos were flavorless and the tortilla was stale/smelled like armpits. It's disappointing because we had eaten here a few months ago and the tacos were great but I guess the quality has gone down since then."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMDZ5QTBnRRAB",
            "text": "This place has the most delicious tacos in the Ridgewood area. They have a great lunch special. I love going there and picking up lunch for myself and for my kids. It is a simple place with nice tables and chairs. No fancy stuff but definitely worth it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNONU9iTThBRRAB",
            "text": "We order from here pretty regularly. My veg GF daughter has enjoyed several options but my main reason for this review is the pozole rojo! People say chicken soup is good for the soul but their pozole rojo takes it to a whole other level. It is flavor magic!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aE9yeVBnEAE",
            "text": "This place has the best Mexican food I've had in NYC.   I'm from LA and this might be the only place I've eaten that could make it in LA....and that's saying a lot.  Had the chicken enchiladas with green sauce.  They don't call it Enchiladas Suizas, but that's what it is.  Great black beans and very good rice.  $14 and you can byob."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1aHAyb1NBEAE",
            "text": "Highly recommend, I was trying to figure out dinner for myself and another person always a little weary on a trying a new.\nEnd up ordering Pollo Asado Torta,Picadillo Burrito and Elote.\nEverything was really flavorful and totally worth the price. Most definitely ordering from them again and trying other food item!!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbmZ5SHJBRRAB",
            "text": "This place is great! I'm totally in love with their Mexican brisket burrito! I have ordered food from there many times and so far I have yet to be disappointed in anything. It's nice to also eat there and enjoy a nice Mexican coca cola or a Jarrito with your meal as well. Nice friendly staff and a nice variety in the menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MGM3WWxRRRAB",
            "text": "Very few Mexican places have vegan options on their menu, so I certainly appreciate being able to eat my fave comfort food right in my neighborhood. The staff is nothing but nice and helpful and the place is never packed. I really like RTF."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cWZ6QUN3EAE",
            "text": "I have taco factory at least twice a week and they are the best tasting tacos and portions you can get! Burritos and enchiladas are also great. Love the grilled fish and carne asada. Prices are great."
        }
    ],
    "reviews_count": 72
}