{
    "name": "Salty Lunch Lady's Little Luncheonette",
    "place_id": "ChIJd1wnL-dfwokRlYBRhDQwS80",
    "grid": "QN5",
    "address": "5-65 Woodward Ave, Queens, NY 11385, USA",
    "rating": 4.6,
    "user_ratings_total": 207,
    "phone_number": "(929) 337-7629",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Q2NrY3pZMFZDWWxsc2F6bGlSSGRSU2s5Q1FYYxAB",
            "text": "The perfect little spot in the neighborhood for a breakfast 😁 sandwich was near perfect 👌🏼"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSVEzRmZkMEo2VEVocVpIVjJZazV5YzNKaVMzYxAB",
            "text": "We waited in line and ordered two sandwiches to go at 130pm. The young lady told us it'll take 30 min to make so we asked if we can leave and come back. She said yes and that our sandwiches will probably be up front so we can just ask for them. We come back at 210pm and asked about our sandwiches. A guy went to the back to check. While he was back there, the young lady came back to the register and we asked her if she put our name on our previous order. She said yes and also went back to check. She came back and didn't say anything to us so we assumed they just put it in at that time. No one said anything to us or apologized. It's now an hour later and still no food. The guy approached us and said our order is almost ready. We sat down next to someone who also waited an hour and complained about the service. The guy offered us a free cookie for the wait. We finally got our order and ate them at home. They were okay, definitely not worth the 1+ hour wait. We also got a slice of the PB&J cake. That was pretty delicious. One star for that.\n\nOverall, the young lady's vibe at the counter we didn't care for. She didn't care that our food wasn't made nor did she tell us anything about it. The guy was nicer and more empathetic."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OR1VFeFBkRVZZWVZnMVYzZFdSME56YmtKeVpHYxAB",
            "text": "Expensive, 30 minute wait for a sandwich, half the menu was unavailable, staff acted irritated at questions asked. Don't need more $20 sandwiches in this neighborhood"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdWQwNUJNbmw0ZFZCNWVtOXRhRVpYVkRCUldFRRAB",
            "text": "20 bucks for a pretty small sandwich I could have made myself and drink . Was nothing special . Nice atmosphere . I guess you pay for a dollar a minute for them to make the thing too. 20 minutes ( at least) to put a sandwich together is crazy. Especially when there’s only like 6 sandwiches to choose from lol ."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eWJITmlTMlI0WTJSSVEzVnZSVmxVWVhoU2RVRRAB",
            "text": "I love this place\n\nGoing here makes me feel like a real person interacting with a community and not just meaninglessly consuming food. There's so much care and human touch to all of it, I recommend this place to all my friends ❤️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sd05tcEJTR05sUVVSdmNua3hjVlJRWVRNMVRFRRAB",
            "text": "Horrible service.\nI was literally the second person in there, ordered a sandwich, spritz and slice of cake. Asked for the sandwich to go and the cake and drink for there. They said the cake would be cut soon and I would get my drink in a minute. First off, they forgot my drink so I had to go back up, at this point it had been 15 minutes since I ordered. I asked about the cake and she goes “you need to pay for a slice and it will be cut soon” I had already paid and asked about the cake to them at the front. 10 minutes pass and I see the woman come out to cut the cake, I go stand by the counter… the girl starts passing slices around to everyone but me, she even starts boxing them up and is just avoiding eye contact. Finally I get her attention… after a couple minutes and I ask if I can have my slice, she pushes a box to me and says, it’s in a box (ordered it for there and she had given out a ton of other slices on plates already) and gives me a dirty look like I had just interrupted some great conversation she was having. Insane especially since I was literally the second person though the door after opening.\n\nThe sandwich and cake were just ok, absolutely not worth commuting an hour and paying 44 bucks for (including 20% tip). Definitely won’t be coming back."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNGR6QkxabUZLYW10WWRtVmtVbTVFTjB4ZlQzYxAB",
            "text": "Dill party was delicious."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcnR6eWVnEAE",
            "text": "I'm only sorry that I haven't gotten here sooner.\nThis is one of those places that's a real\nFeel Good Spot.\nEverything here makes you feel warm and comfortable.  Simply put together to make you feel welcome . The food here  is over the top Delicious.\nEvery Bite.  if it's sweet or savory, you're in for a real treat .\nAbsolutely the Very Best Chocolate Pudding Pie I've ever had.\nDreamy and delicious.\nThe tuna melt was nothing like I've had before . Light, tasty,flavourful, great bread,incredible cheese, and just\nSo well put together.\nI really wish Chef and her team a great Big thanks for making it a great experience.\nIf you haven't stopped in, treat yourself to a great  lunch .\nDon't wait as long as I did ....."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKZllrNWxabHB4VEUxRlZFczFOa3RrTVZCS1psRRAB",
            "text": "Love the colors, the food, the relaxed atmosphere.. can’t wait to come back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vdFlXOHlPVEkzVW1sSFdYWkZjREpqWTFaZmVuYxAB",
            "text": "The Food: I ordered the Chicky, if you like a small salty messy sandwich that takes 30-40 minutes to prepare for $20 then this is the place for you. They do use quality ingredients but you could probably get a more satisfying sandwich by supporting one of your local bodegas in a fraction of the time/price.\n\nThe Service: I was told it would take 20 minutes which is fine. I just waited outside and enjoyed the breezy afternoon. But it was actually closer to 35-40 minutes. Had they set the expectation straight I would have just gone on a walk and came back later\n\nThe Atmosphere: If you're waiting for an order it's a little awkward figuring out where to live for the next 40 minutes. It gets a little loud inside, but the outside area is really nice - has good tree coverage. As a fellow gentrifier I can safely say It definitely gives gentrification with the prices and the clientele but love supporting local <3\n\nFinal Thoughts: If you have a long tea spilling session and need a place to go I think this is your spot, just order some snacks from your local bodega ahead of time. But if you're hungry and want a satisfying sandwich I would recommend going to your local bodega or to any Mexican Restaurant and ordering a \"Torta\" - if you haven't had one yet you can thank me later :). But Overall I think a good addition to the neighborhood\n\nP.S: I unfortunately didn't get to try the desserts though I hear they are really good! Excited to try them in the future and might update my review on a second visit :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeFRXeDNiRVpvWkhWbFIyRkRabEpDUVZGSmMwRRAB",
            "text": "The dill party didn't completely live up to the hype, but was still a good sandwich! Prices are certainly steep for what you get, but that's par for the course in the city.\n\nStill recommend folks try this place out! Great atmosphere and friendly faces, and the desserts are hard to resist"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMVRFVjFhRVZ4WTNOb2MzZ3daRzlmWnpaaFMxRRAB",
            "text": "it’s one thing to look someone in the eyes and tell them it will take 25-30 minutes to make a cold ham and cheese sandwich. it’s another for it take an hour. it was literally just a ham and cheese. there was nothing special about. ham and cheese. could have made it at home. being here felt like a social experiment. final boss of gentrification."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWldrcHJTR2RpUVZScGIzbEZWMlJOY1ZCV1VuYxAB",
            "text": "The most elevated and delicious a sandwich can be! Loved it! Please sell tshirts so I can get the word out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaFpqSlFVRVI2YkdwSkxYZDBSRnBEYmw5NlgzYxAB",
            "text": "The sandwiches were fresh and good (especially the bread) if lacking seasoning a little! We unfortunately didn’t get to try any sweets as they were out, so I’d recommend coming early. Service was stingy and not the warmest."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVelRGaG9NbGc1WXpkSlV6UjRWbUZZUW5CUU1uYxAB",
            "text": "Was looking forward to trying Salty Lunch Lady after all of the great reviews. Unfortunately, didn’t know she was closed from 8/18 - 8/28. Nothing was posted on the website and my husband only found out from her social media, IG. The website only indicates that they’re closed on Tuesday and Wednesday. I wasn’t the only one who didn’t realize it was closed because about two other ppl showed up and were just as surprised. A sign on the front of the store or better announcement on the website would have been helpful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NFJtUnJWV2wwYVdKUlJsbE5OMFJwUTI0eWMwRRAB",
            "text": "A bit hot for August, AC could use improvement, otherwise great place! Sandwiches are delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabWNEVTJXRGRSVTI0d2N6aExTSFJ5U1dVMVIyYxAB",
            "text": "Got the ham and cheese. Very yummy, good bread, dijonnaise, decent amount of meat. cute little shop with specialty goods and beverages (cantaloupe purée with club soda very good), plenty of seating + outdoor corner patio with trees. unfortunately the price just doesn’t make sense for such a small sandwich - typical NYC gentrification spot. obviously more value at the deli bodegas in the area, but those aren’t as instagrammable i guess."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcGQzTkljVFp0YW5NdGJFbFFjMkZNZGxCVFVYYxAB",
            "text": "Cute place. Food is incredibly yummy. Love the concept. Love places like this where you know the people back there are cooking with soul. Sweet or savory , just get it. Turkey dill party sandwich is my jam."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVFYxQlBSV2RpZDFWTWFGQkNhMjVmTUhSeVJWRRAB",
            "text": "Love the tuna crunch sandwich"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMlNWbzNOVU56VUhoR1QyeGpWbEY2V1hsb1ZIYxAB",
            "text": "The atmosphere was fantastic, and the food was great, but unfortunately, the service didn't quite match up. While the woman with blonde hair was polite at the counter, she seemed a bit dismissive when delivering our food to the table. My friend offered to help with the plates, but she declined with a simple \"no\" and walked away without a word. I know it may seem nitpicky, but a simple \"enjoy your meal\" or checking in to see if we needed anything else really goes a long way in terms of customer service. Overall, it’s still a nice spot with great food, but the service could definitely use a bit of improvement. 😊"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUk1YWkRYMFJpVkV0R2VURk5hMUk1TUZjdE5WRRAB",
            "text": "Run don’t walk to get the tomato sandwich while it’s in season. I like to add their house brined and roasted turkey. Out of tomato season the tuna crunch hits every time. Every sandwich crafted with care. Love me some Salty’s"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ME4zUjFaVEp6V2xWalZXbHFhM2x1VmxrM01tYxAB",
            "text": "Refreshing and dill-icious sandwich, and amazing passionfruit cake. Only downside was a wait of ~30 min after ordering for a walk-in order of one cake from the display and one sandwich. Maybe prioritize walk-ins over the tons of online orders?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWVYyUTBlR3MzYldVM1RGQm5aVGRRY1hKbGNIYxAB",
            "text": "Average experience. The staff tried their best but there were too many issues to fully enjoy it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dVkxUmFNek5yVW5GUlRUQlFWVUpKZHpORWJtYxAB",
            "text": "The best sandwiches I have ever had. My favorite of all time is the Baby Broc.\n\nI bring everyone I can to bask in the lunch lady’s delights. Completely worth the 30 minute wait."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeFIwRjFSRkpQWVhwRmRsaFhURzlJZEZVellXYxAB",
            "text": "I don't understand what is the buzz for this over rated, place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWFRqaG9UbDlNUkdWUE5URnNSSEJ0YVd0SlQyYxAB",
            "text": "Really good sandwiches. Wow."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200emNIbElVbmxVWDFFdFFuUldWM1JEYUdGbGNuYxAB",
            "text": "The turkey dill sandwich is so good! I don’t even like pickles and I devoured the sandwich. Sandwiches take about 20 minutes to come out… was worth the wait!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veFFqUmxUa3h5VERCNk5sSXphRUpaVkZkM05rRRAB",
            "text": "Always fantastic."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oa1RuSTRlVUZFTUZKNWIwTk5SbnAxWTFOYWQyYxAB",
            "text": "The chicken sandwich was pretty good, and the tuna crunch was alright. The sandwiches were good overall, but expensive considering for their size. The atmosphere was nice, though."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeVYzVTVaVGxGTkZGUU5qZDJRM0JUU2xBMmFVRRAB",
            "text": "Delicious sandwiches, titillating desserts are a bit pricey..., sitting outside is best as acoustics inside are not so pleasant when it is a full house."
        },
        {
            "date": "3달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSR1NGaFRiRUpaY1haVVFUbHNiSEF3VVcxSFMxRRAB",
            "text": "202507\n第一次來的時候點了一個三文治和一個餅乾 三文治等超級久 大約二十分鐘 而且那天只是平日下午 不過很厚料很多 餅乾非常好吃 裝潢很可愛\n第二次來外帶了巧克力酸櫻桃蛋糕 蛋糕本身不甜配酸櫻桃醬很搭 cream cheese frosting蠻甜"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNUxWSlFlazlFVmxKMVoxWnpkRmhJVVhCdldWRRAB",
            "text": "Really delicious desserts and ham sandwich. Line can be long and the wait for your sandwich can take a while so be prepared for that. Loved the plum icebox cake. The AC is struggling in there but luckily it wasn’t too bad. Would def go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQlIxSnBObXd3VEVoeVRqUjNkbFJsVUROWE5IYxAB",
            "text": "Cute place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cVprNTRlR3B2VlhaZmJFOWhkRGRoY21ablVrRRAB",
            "text": "Dill party was so delicious! The brown butter almond toffee cookie of the day was maybe one of the best cookies I’ve had. There was a bit of a wait so be prepared for 15ish mins"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUWEzUlJaakp0Vmw5R2RteFBkVkk1YjBaM2JuYxAB",
            "text": "Come early because a line forms when it opens and it never stops!\n\nSandwiches are pricey but the quality and taste are worth it! We got the famous dill party and the chicky. There is a little market section where they sell what I think are the same ingredients they use on their sandwiches.\n\nThere are also desserts! We got the strawberry malted milkshake cake and it was heavenly.\n\nSeating is plentiful and There are spots to eat outside too.\n\nLastly, the hot water from the bathroom sink gets HOT! It's the left sink knob. I burned my pinky finger washing my hands! Could management add a sign?"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaWI3ZXJ3RRAB",
            "text": "Update: Had such a heartwarming delivery experience today. I ordered sandwiches and cakes for delivery and the order arrived without the cakes. Dria called me a couple times and was very apologetic and while I was fine with just a refund, they said they were still holding the cakes for me if I could just place another delivery order for them. The cakes were delivered, satisfied my craving, and I was fully comped for the mistake. I’ve never had a business go so above and beyond for a delivery order. Thanks so much!\n\n—\nSuch a cute space, friendly service, and the cherry pistachio layer cake was insane. Dill Party was also yummy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FeVNGQTRYMHcyY1dac2NtcFNOREJmU2pabk4wRRAB",
            "text": "This is a nice little deli with very good sandwiches. The prices are steep, but the sandwiches are excellent and very clearly in demand. It’s on the NY Times’ top 100 list, and at least one of the sandwiches, the dill party, I rated very highly. I don’t quite think this cracks the top sandwiches for me but I’d happily come back - the sandwiches are relatively small, no sides, but very tasty. We arrived at open, and admitted the kitchen was swamped. It took over 30 minutes just to get a slice of cake, and 20 minutes+ for sandwiches. That said, I’m sure there are less busy times of the day and if you manage to get in when there isn’t a rush, the food is really excellent - particularly the desserts!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWGQwTmpka1ppWVVaaFpHaHRhbmhHUVMxZk9YYxAB",
            "text": "I’d say quality for the price is low. Nothing revolutionary and I usually don’t care about service but it took 30+ min to make essentially a bodega turkey sandwich which was advertised piled high. Kind of stingy wouldn’t go back, good luck to ya’ll"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSExYTm1OM2RNTkRGbVpuVlBUVEpKYjI5YVYwRRAB",
            "text": "Love the dill sandwich"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMFlqSllPR1poUWtSbk9IRXdlVzVUWTBwaloyYxAB",
            "text": "Probably the best sandwich shop I’ve ever been to"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNN2dpWkN5eDV1Rlp3EAE",
            "text": "If coming on the weekend be prepared for a WAIT. However, the sandwiches are worth it.\n\nCame on Sunday afternoon at 12:30p and it was packed. Like a line out the door kind of packed. But it moves relatively quickly. However, after we got through the line it did take 45 min for us to get our two sandwiches.\n\nThe sandwiches were delicious though. We got the dill party and the chicky, both were delicious. I personally liked the dill party a bit better as it was heavy on the dill (mayo, pickles, + dill havarti) with fresh turkey (they brine and roast in-house) - a delicious combo.\n\nThe chicky was good, I just found it a bit hard to eat with the harder seeded bun and slippery so the insides would just fall out unfortunately. Also the sandwich itself was a tad too salty (and I eat a lot of salt) - but that was probably due to the feta\n\nOverall, a great sandwich spot that's a must try if in the area!\n\nALSO DESSERTS! Which sell out super quick so get whatever they have!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMSzI3TFNvNk12S1pREAE",
            "text": "ok to visit and be here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZmR2YnVjNzdDcS1RRRAB",
            "text": "Unreal breakfast sandwich, maybe the best I’ve ever had and the tuna is amazing too. Just wish you didn’t have to wait 45 minutes for the food after waiting on a 25 minute line to put your order in. Seriously amazing food. The dill sandwich was legit too, but it was the third best for me. Worth dealing with the schlep, just wish the process was faster"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SM1RYcE9PRjl5T0Y4NFZXOXdNV2w2TkZaS2JWRRAB",
            "text": "Just. Amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKbkVnX2lmbUxyMF9nRRAB",
            "text": "My friend saw this spot on social media and wanted to try it, so we both headed out here to check out this luncheonette for lunch! The interior of the restaurant is cute and quaint and there are small tables for you to enjoy your sandwiches at. Service was good and took about 20-30 minutes for our sandwiches to be made.\n\nThey only have a couple items on their menu and unfortunately the one that my friends wanted (the dill) was already sold out. However, we did get a couple others: the brocollini, tuna, ham & cheese, and their chicky. Everything was great and the portions were huge. Cute spot, but (imo) nothing crazy. I would only come back if I was in the area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQcW9wT0xuc3ZheEtnEAE",
            "text": "The cake, cookies, and pie are to die for. The sandwiches are bomb too."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPQ2FxcFBpcWUtUzRnRRAB",
            "text": "Never set foot in the place, but the sandwiches stand up to delivery well. The only downside is the desserts probably turn over too quickly to be included in the delivery menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todFpWSk5SVE5sVEhkcWEwTTVVa1JLWmpsa1RGRRAB",
            "text": "Food Is good but workers behind the counter make it feel like I'm an inconvenience to them."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMVEdzZXpBLVpIMktBEAE",
            "text": "Came here for lunch with my wife and we we're blown away by how good these sandwiches are. If you're ever in the neighborhood and am looking for a quick no frills lunch spot with excellent sandwiches then this place has you covered."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQUGIzTTdGdmRDWDVRRRAB",
            "text": "I was having a bit of a rough day yesterday when I stopped in for breakfast. Might’ve even been a little cranky. That’s on me. But man, the Spin Dip was so good it completely changed my mood. Do yourself a favor and check out this spot for truly delectable sandwiches. You may have to wait a little while but it is absolutely worth it, all good things take time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNVBUTzJ3RRAB",
            "text": "Simple things done exceptionally well. Finally made the trek for an Easter slice of coconut cake (threw in a pie last minute. It just looked so good, and when I figured I could either have it or not have it the decision sort of made itself). Hour on the subway was well worth it. The neighborhood was really nice, lotta charm, good people, and the trend continued- inside the luncheonette was BEAUTIFUL. They've done a great job with the space, the teal paint, tile, flowers on the hanging lights, you can tell it was all done with a lot of thought and a lot of love including of course! The food. I could see their sandwiches getting made through the SANDWICH WINDOW and they looked incredible. I will be storming back for some tuna.\n\nThe desserts were fantastic. The cake was fluffy, buttery buttercream, and not too sweet! Would not have minded more coconut flavor in the cake itself, you can just never have enough. The lemon curd in the middle was perfect. Actually it went very well with the orange curd pie which was my favorite of the two, the orange filling was so bright and sharp and the cookie crust had this great salt to it, fresh zest on top, it all just tasted GOOD, like they use quality ingredients. Just overall good vibes. My order was ready early, the person behind the counter was delightful. Great food, happy people. What else is there?"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaXBxbzJ3RRAB",
            "text": "Salty Lunch Lady’s sandwiches were truly delectable. I have the tuna melt simply delicious. Bread nicely toasted cheese melted just write and the correct amount of tuna made the sandwich perfect for my tasting. The gooey gratin simply out of this world!! The fresh squeezed lemon added a touch that simply married all the flavors together. (Psss you might want another!! lol) The spicy culi was a nicely “Italined” the meats alongside the provolone and chili mayo was again perfectly married. Thank you for the delicious experience. ( The plating made me feel like mom just served my meal with LOVE!!)\n\nWell Done! #SALTYNESS@itsfinest!!!\nSolid 5⭐️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvb1pxbmRBEAE",
            "text": "holy hell this spot is amazing. be prepared to wait a bit since sandwiches are made to order (with great love and care). good seating available, both inside and outside, and the vibes are so cute. if you want your day made, get the chicky sandwich, you will not regret it"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdzQzTzBnRRAB",
            "text": "How good could a corner sandwich shop be? Extremely good.\n\nPossibly my #1 Tuna Melt by far. The tuna is generously mixed with pickles and mayo, along with the gooey cheese makes every bite a true delight. Sourdough bread was super light, toasted to perfection, crunchy and airy. Just wonderful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJalBMVHlBRRAB",
            "text": "Yum, everything was delicious. Self-service.\nI think the restaurant layout can be a little more efficient, people seemed to keep running into other people...\n\nNote: while everything was really delicious, the food was not cheap at all, I somehow spent $40 with no alcohol!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbDhyZTJnRRAB",
            "text": "That Gooey Gratin Sandwich 🤯 Lawd Have Mercy! The Cauliflower + Leek Gratin Sandwich with Cheddar & Gruyere is incredible – cheesy, crunchy, and the lemon drizzle is a game-changer. Fried chicken sandwich? Perfect. Coffee Cake Layer Cake? Grandma-level good. Cozy vibes, amazing food. Highly recommend! @greedygirlsclub"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyXy1tRVlnEAE",
            "text": "Cute minimal retro style spot selling great sandwiches and some pantry staples. I loved the rotating dessert display, not to mention how good the s’mores dessert sounded. Both the Tuna and Turkey sandwiches were great; recommend splitting sandwiches if you’re going with 2 or more people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dXNQdi1BRRAB",
            "text": "Look, I live for places like this. The concept is simple they make sandwiches and serve slices of cake. I mean not a lot too wrap your little head around but it’s executed very well. The staff is warm and welcoming and it appears they don’t even have paper menus yet (this place is like 4 months old maybe, sorry to all the gatekeepers) but who cares there’s a big chalk menu board you order at the counter and you listen for your name like I said SIMPLE. But there is brilliance in this simplicity and is noticed at first bite. The sandwich construction is crucial and both the sandwiches we ordered were well considered in flavor, texture, layering, bread choice and the dearth of many sandwiches the “slide out factor” when all the contents of the sandwich squeezes out one side due to lack of considered construction. We got the Chicky & the Fancy Bologna sandwich both winners. The peanut butter chocolate cake was exactly what you would want from its namesake. There’s very little fat on this menu but that might be why it succeeds. Great work guys."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREZ1BhV0d3EAE",
            "text": "The sandwiches were really good but the price was a bit steep with $15 without any sides. Had the green eggs and the chicky sandwich which oh boy be ready for a messy eat coz everything in the chicky just slides out when you take a bite.\nTheir pie was the winner for me, fluffy and the crust just crumbles away."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMHJHeHNnRRAB",
            "text": "I LOVE THESE SANDWICHES! Every time I come here i'm greeted by friendly staff and have the most delicious food. Today I tried the \"Dill Party\" sandwich and loved all of the diverse flavors! I cannot leave without getting a slice of cake, as the dessert menu changes daily. The portion sizes here are always on point. It's really nice to see this space utilized after being vacant over the last few years!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQN3QtZlFREAE",
            "text": "Salty Lunch Lady’s Little Luncheonette\n\nLayout/atmosphere\n*Nine tables; six seat counter; tables on side of building\n\nService\n*Self-bussing plates/silverware\n\nFood/drink\n*Complimentary water cooler\n*Tuna Melt (Classic tuna, Cooper sharp cheese, chopped pickles) [daily special] - good; crunchy bread; salt from the tuna, fat from the cheese worked together; little greasy but to be expected from the ingredients\n*Dill Party (Roasted turkey, dill havarti cheese, dill mayo, dill pickles, lettuce) - quite good; creamy textures; freshness from turkey & avocado\n*Pistachio Sour Cherry Sandwich Cookie (Brown butter sour cherry cookies filled with pistachio cream and rolled in crushed pistachios] - outstanding; cookie was both crunchy & chewy; enjoyed the cream"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOTRuMlJnEAE",
            "text": "step into 50s Americana and indulge in a sandwich and a pie. a handwritten sign proffers wondrous combinations: an autumnal squash with seasonal vegetables; a leek-cauliflower gratin; a dill-forward turkey; a chicken-mayo; and a tuna melt, with or without embedded potato chips. The dill turkey is popular, so I opt for it, and there are no regrets there, it is a savory, herbaceous treat. Both the turkey and cheese are thinly sliced for balance of flavor and a layer of mayo serves as an orchestral interlude. The meat and cheese are layered within thick focaccia for a nice textural bite. It is not your typical greasy diner sandwich, far from it.\nbut don’t leave without having a pie! especially when they offer one with meringue: it is like entering the clouds in a plane, like floating in a blissful wave of sweet elegant dancerly bliss. the chai filling was creamy and light, and the crust provided a crunchy, gingery snap. but oh, the meringue, the billowy pillowy meringue will be the reason I spend an hour and a half on the train to come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqc3J2d0pnEAE",
            "text": "Amazing. I can't stress enough how good and fresh the Chicky Sandwich is. The atmosphere is cool, if you're into the hippie vibe. It's a cute little spot. A little upset there were no desserts when I went but it just goes to show how good they must be."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cXNLcmhnRRAB",
            "text": "While going on a walk, I passed this spot and decided to give it a try, ordering on the square app was easy and the food was ready right on time. I decided to get the Spicy Cully and then couldn’t pass up a slice of coconut cake. Everything was so fresh and hit the spot, the sandwich was savory and spicy with a nice cooling crunch from lettuce and onions, the coconut cake was so dreamy, the luncheonette looks adorable, I’d definitely go there for lunch sometime."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfb0pmLU5nEAE",
            "text": "I love supporting small women owned businesses ❤️my favorite is the chicken meatball sandwich, Mexican coke and a sweet treat! There's also a small corner where you can grab speciality grocery items"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGcTlySzZ3RRAB",
            "text": "sooo good she’s so creative and i always look forward to what she’s going to make i love that the menu is rotating. I got the breakfast special and it was one of the best sandwiches I’ve had in a long time - she really thinks through all the details"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxcFkyTmhRRRAB",
            "text": "It’s not often that you can get a great lunch AND a beautiful slice of cake at the same restaurant but SLLL has done it. I got the mortadella sandwich and the bread was nicely warmed and crispy to match the tender meat and curly escarole. The coconut funfetti cake was equally cute and delicious. I bake a lot and a great slice of cake is hard to come by. Service was courteous and kind, and the spot is everything you want it to be and nothing else—tin details and pastel colors galore. Overall mood boost maximally achieved."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKclo3Qm9RRRAB",
            "text": "The lemon merengue pie is the most delicious I’ve ever eaten. The chicly sandwich is also amazing. Great addition to the neighborhood, I’ll be back 100%"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dE1iMDV3RRAB",
            "text": "I’ve heard lots about Salty Lunch Lady since coming to the area, I didn’t except the counter area to be so nicely spaced out with room for a Creams*cle Layer Cake slice, drip cup of Williamsburg’s roasted Young Coffee, and a Squash Me sandwich which was nicely balanced savory and sweet from the squash and cheese, on a ciabatta bun sourced from Balthazar. Other bread sources include Sullivan St. Bakery and a gluten free vendor. I felt lucky there was time to speak with founder and chef Dria Atencio who came out briefly. It was great to speak with her and hear some of what they have planned coming up like expanding their grocery section. Dria highlighted some chili crisp from a local maker recently stocked.\n\nThe dining experience was super delightful with unique plates served to every customer, and hanging lamps sourced from apparently Yugoslavia countries. Even the wooden stool had some hand painted fruit flares and design. All service is counter so be sure to hear your name called from the kitchen. I need to come back for the Pandan Coconut Cream Pie, which you can preorder among everything else, form their website."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMDg3cjBBRRAB",
            "text": "The best tasting sandwiches ever I always try something new and even if it’s something i don’t normally enjoy they always find a way to make it delicious. Huge fan of the chicky! Also never seen tall cans of diet coke like that. Wonderful atmosphere with great food to match. I bring all my friends here"
        }
    ],
    "reviews_count": 70
}