{
    "name": "Julia's",
    "place_id": "ChIJdeS2mydcwokRRhTrtCgbGYs",
    "grid": "QN5",
    "address": "8-18 Woodward Ave, Ridgewood, NY 11385, USA",
    "rating": 4.7,
    "user_ratings_total": 511,
    "phone_number": "(917) 909-1314",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNU0wcHVYMFZJTTIwMGFXSndaRlZPYkRKcU5HYxAB",
            "text": "Very cold inattentive staff, food was very bland and dry. Coffee tasted metallic and acidic."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV1ZsZFFWbEJaZG14SVgydHdWSEZ2VDB4SlVVRRAB",
            "text": "Yummy and homey! Solid brunch food. Loved the matcha lemonade, BEC, lox sandwich, and cubanish."
        },
        {
            "date": "1달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOS01XZHVPSFZqWjNWa1F6SkxOV3AxYTFKTVEyYxAB",
            "text": "Heerlijke lunch gehad"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWFRWWndYMnRuYm5GblFrWllVV0l3Tm14Q1FXYxAB",
            "text": "very very excellent & a creative brunch menu"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RE9XMWlPRkJWU0doSFpGcDNXbmt6YkRkUFVYYxAB",
            "text": "Delicious food, amazing cocktails, great people and now they have oysters! Julia’s is a true Ridgewood gem."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNFIwa3RNSFpRZFdKdVNtWXpaMFZSZW1oRlYzYxAB",
            "text": "Julia's has a fun menu and everything I've had there is solid. I like the staff that work here as well. Good environment."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BekxXRjVhVkpKVEdoU1dESTRWRzg1TWtsRFpHYxAB",
            "text": "I ordered pasta and it tasted like desert and milky. The quantity is so less and it is overpriced. I got stomachache and puked. So disappointing!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WZmJFaDFSVU5yUkRaQ05FaG1SVkZxWjJ0dGVYYxAB",
            "text": "It’s pretty small and cramped up inside. It’s hard to hear yourself speak too. As for the food, I don’t eat pork, and there seemed to be a lot of pork options, so it was kind of a turn off to see that."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ab2RHSlJhbmc1UlRRM2FtSkZkSGhFVW1SQ05FRRAB",
            "text": "Good place to get a pretty classic breakfast/brunch. Usually not too long of a wait for a table"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMGFGSmlOMWhGUWt3NFltUkJiMDlFU1UxcFIwRRAB",
            "text": "This place has significantly gone down in quality this year. Used to be a pretty decent brunch option. Not sure what’s changed recently at Julia’s but I’ve had two, back to back poor experiences here that have changed view. Last month my friends and I were served severely under cooked bacon in our meals. We brought this to our servers attention, who took their time investigating it but then brought us a fresh plate of cooked bacon and assured it would be “on the house”. Sure enough, we were billed for 3 extra sides of bacon. We only realized after leaving and contemplating the steep bill + tip. Didn’t feel great. And just this week after having gone to Julia’s again despite that, we found they’ve changed their core menu items and dining experience. It’s even more expensive and smaller portions than prior. Food comes out in baskets instead of on plates. Service was seriously lacking.. With both recent experiences. I won’t be flipping the bill at this place any longer. We kept saying we shoulda jus got bodega BECs instead for 1/3 the price and ate at home"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeFoyVlBYMVJCTlVoblNGSnlOekIwTUVoTVUwRRAB",
            "text": "We recently had a great brunch here! I loved the decor inside, and the food was delicious. I particularly liked the BEC biscuit"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJTDU5WnFtbHZhZU5nEAE",
            "text": "My family and I were excited to go back here for the second time.  What a disappointment! It's one of the most expensive brunch we've had and left there still feeling hungry. My plate was filled mostly with leaves. Service sucked also. A waiter who was not serving us asked if we needed help, I said thanks but we're already being helped. He rolled his eyes and said that he can help us too. Really? This was the worse experience. Left there disgusted. Never again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNckFpOHlDM29TTUdBEAE",
            "text": "Very good!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKenJvZG16dWVxdGJREAE",
            "text": "Julia’s is a great local spot for drinks & brunch. All the brunch items were good but the Arepas Con Huevos were a real treat. I’ve never seen this brunch item before and it was perfectly balanced with savory and sweet. I would recommend! But again it’s hard to go wrong anyway to go at Julia’s."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQeVpsdC1Kdk82bnZRRRAB",
            "text": "Aggressively mid\n\nAte the food to be polite, and price was not worth it. Wine tastes like box wine"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKM01wTktJaHFha2V3EAE",
            "text": "Disappointingly mid food. I had the hamburger sliders and the presentation of the food was on par with a pub food in Boston - unexpected of a restaurant with 4.7 star rating in Ridgewood NY. The bread was somehow burnt yet cold to the touch and bite, inconsistent in the amount of ingredients per sliders, and the patty was flavorless. I would let this slide if not for the cost of the bill. Spend your money elsewhere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VPcVAxZkNUckwxbhAB",
            "text": "Julia’s is a cozy neighborhood spot where no reservations are needed—just walk in. Be prepared for longer wait times during weekend brunch.\n\nA personal favorite is the Toasted Goat, a deliciously simple dish featuring toasted sourdough topped with goat cheese, fig jam, bacon, and honey—a perfect combination of flavors."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQU2FpTXFWNGZfYndRRRAB",
            "text": "Was here for a wedding party, had a blast service was great. The servers was funny and amazing. Drinks were deff on point try the pineapple margarita"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLM3U2cC03ZzRhU3RnRRAB",
            "text": "An underwhelming experience. Drinks were fine. Food was flavorless all around, things that should have come out hot were cold, no excuse for this since the restaurant wasn’t busy. On top of this the food was very expensive for the portions and quality you revive. Oddly could have gotten a hotter, fresher, and more flavorful meal from our local Chinese food takeout spot. I think that tells you all you need to know right there… Meh, hard pass."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZN29tQldBEAE",
            "text": "Went to dinner with our conference group and enjoyed the entire experience. Each dish was excellent--heard not a single complaint--and the assistance on wine selections for the table was appreciated and on point. An open atmosphere made everything a bit festive, and the evening was very pleasant thanks to Julia's."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaG9iU3VRRRAB",
            "text": "They were pretty busy for weekend brunch; we went Saturday around noon. Service: The bartender assisted with bringing food to the tables. She was super nice, knew I was waiting for my friend and offered me a jug of water with cups for self-serve. There was a hostess and she was super nice. She was in tune with her customers and brought drinks and food promptly to the table. Now the waitress was another story; she was dressed in all black and seemed to have a chip on her shoulder. Kind of snotty- feel about her. I asked to be seated on the regular tables instead of the bar or high table and she said she would seat us if there was availability but when a table opened, I had to go to her again and she was not proactive to sit us there. Later on, we asked her for extra napkins, and she never brought it. We ended up asking the hostess who was super nice and brought it right away. Service was 4/5\nFood: we ordered the arepas, the biscuit, the lox sandwich and mimosas. All were pretty good but prices a little higher. Total bill including tips/tax: $90.\nService size was on the smaller side, only gave 1-2 pieces of salmon for $20. 4/5 due to pricing\nAmbiance: it was a nice relaxed atmosphere, we stayed for a bit after our meals were done and they were getting ready for a private party. We were not rushed to leave until they informed us we could go outside to continue to chat. The outside patio was nice. 5/5\nOverall: 4/5, would either have larger serving size or reduce prices by $2. And the waitress needs re-training."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvb1otZUZ3EAE",
            "text": "I went there for the first time recently. Food was great, ambiance was lovely and the service was great. Loved it 🥰"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MC1TdVVnEAE",
            "text": "This place is fantastic all the staff is super friendly and helpful, I can't speak highly enough of this place , bacon 🥓 perfect, goat cheese sammitch 🧀 perfect. Outdoor seating with many doggos walking by that want pets 🐕 perfect. I honestly almost don't wanna leave this review and hope this place doesn't become impossible to get a table at . But no, they deserve all the praise. 10/10 will be back\n** The arepas are fantastic, finally tried a new thing here"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aEtELTd3RRAB",
            "text": "Amazing cocktails, friendly staff, and yummy bites. One of my fave bars in ridgewood 💕💕"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNHFIZVdREAE",
            "text": "Julia’s is super chilled, repurposed mom/pop vibe with a modern touch. Intimate but inviting. The food is amazing. Never left unsatisfied. The guava mimosas are everything. Staff is friendly. Love this place. Go every chance I get."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCaXJ1LWtnRRAB",
            "text": "By far my favorite restaurant. I have the brunch menu memorized."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbDZ6WVFnEAE",
            "text": "Great blood orange mimosa. Super attentive staff."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneXUyRmRBEAE",
            "text": "So good!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnd2Z6SVdBEAE",
            "text": "Admittedly, not a brunch fan. This place almost convinced me to think otherwise but didn't accomplish it.\n\nService was super friendly and attentive. It's a fairly small place so recommend getting a reservation. We got two sandwiches: the Cubabinsh and the golden lox. The Cubanish was meh, I have to say I missed having the ham that a Cuban these usually come with but the pork was delightful. The bread was nicely toasted. I get why this is such a must here. I was actually quite surprised by the lox sandwich. This roll was perfectly tailored to this sandwich. I wish the spread was a bit more evenly distributed. We got the greens and the potato salad for sides, neither of which added much. However, we also grabbed the potatas brava, which was absolutely a scene stealer.\n\nThe price is on the higher end for brunch (maybe not for the area but $20 for a lox sandwich is... a bit much). The menu beyond these two things wasn't the most interesting so we probably don't need to come back but it was worth it for this combination of things."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdjkzdFhREAE",
            "text": "Just simply amazing."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBZ29IWlN3EAE",
            "text": "Delicious!!!!!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNmZqdnl3RRAB",
            "text": "In love with the biscuit sandwich and the lavender gimlet 🥰"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbFpDb05REAE",
            "text": "Bland, overpriced and small portions. Half of my plate was covered by a giant, single piece of lettuce"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa29xX3RBRRAB",
            "text": "Tried their soupy happy hour (soupy hour?) tonight and it was well worth it - any house wine or cocktail or mocktail + cup of soup and bread for $15. Delicious cocktail and yummy soup."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcDRHcUVBEAE",
            "text": "Tried the brunch. Arepas were small, dry, and flavorless, and half the plate was leaves for $18. The waffle was nothing special and was $15. Need to make better food to charge these kinds of prices… Only thing good was the coffee from Loveless"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaXJyYUZnEAE",
            "text": "Worth the venture to Ridgewood! Cute little place with delicious drinks and food"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtZ28yMHpBRRAB",
            "text": "Lovely ambiance, we went for dinner and it was a very friendly and romantic atmosphere. The food was good as well and overall very balanced. I’m definitely coming back for the chicken pot pie!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNlBuOFFBEAE",
            "text": "The toasted goat sandwich with potato salad was delicious. Be sure to take a moment to take in all of the decor - my favorite feature was the gold ceiling and the dark green wall behind the bar. Great vibes!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbjRPbUR3EAE",
            "text": "Great food, great vibes! Happy hour is a steal."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmM2RHMlVREAE",
            "text": "I’ve been a loyal customer at Julia’s restaurant since they first opened, and I can confidently say their customer service is unparalleled. Over the years, their staff has consistently gone above and beyond to make every visit a delightful experience.\n\nCompared to other nearby spots like Rolo’s, Julia’s stands out as the best, not just for their excellent customer service, but also for their cozy ambiance and attention to detail. One thing that truly sets them apart is their amazing Hispanic waiter, By. He’s an absolute game changer! His warm personality, attentiveness, and ability to make every guest feel special are unmatched. Honestly, (aside from the delicious Toasted Goat sandwich) By is the reason I keep coming back every time.\n\nI moved to Florida three years ago, but every time I’m back in NYC, I make it a point to visit Julia’s daily. It’s just that good!\n\nIf you’re looking for a place that combines fantastic service with an inviting atmosphere, Julia’s is the place to go!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOTlUYnJRRRAB",
            "text": "Wonderful cosy place"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeGZxSC1BRRAB",
            "text": "This place is super cozy we waited a little longer for food but it was worth it I had the cubanish sandwich and the pulled pork was amazing all drinks from coffee beers, mocktails and cocktails"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2d2RERTRRRRAB",
            "text": "Went for dessert, cakes were good. Nice selection of teas. Very attentive and helpful servers."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dEs3c3J3RRAB",
            "text": "WOW!! That is all I have to say. The food is amazing. I have been waiting to come here for a few months but I never really travel so far up Woodward. Somehow I missed this delightful hidden jam all these years. JUST GO :) everything is delightful, including the staff and the owner is lovely. <3 we love a good neighborhood spot and you know Ridgewood is filled with those. This one is on the very top of my list now! Thank you Julia’s!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bmZ6T0VREAE",
            "text": "Wouldn’t return and couldn’t recommend having experienced this place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeW9UaVpREAE",
            "text": "What a jewel of a surprise deep in Ridgewood. At Julia’s we felt welcome, greeted with warm smiles and alluring appetizing aromas.  The menu reflects imagination and levity—of having fun while  inspiring conversation before savoring each edible delight."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYak4yX1BnEAE",
            "text": "The food was fantastic I just hated the outside tables because we kept spilling things cuz they have large spaced planks and we had just 5 people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNub2NpMmhnRRAB",
            "text": "Amazing first meal in NY.\nReally recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbjRUc0lREAE",
            "text": "Nice outdoor seating. Delicious dishes, add the spicy pork to your dish if you can, worth it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNId3VIM3lBRRAB",
            "text": "Delicious brunch at Julia’s in Ridgewood!\n\nWe started with a Blood Orange and Classic Mimosas 🍊\n\nI had the arepas con huevos and they were so good! The sauce and cheese on top was everything, and the greens were a perfect way to balance the plate. The arepas were freshly made and super flavorful.\n\nWe shared patatas bravas which were AMAZING! Smothered in cheese, sauces and bacon 🥓 I will definitely be getting these next time Im here!\n\nMy friend got a classic breakfast plate which they also enjoyed very much 😊\n\nShoutout to our awesome server, By! Thanks for the great recommendations and awesome personality."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyX3FlemZBEAE",
            "text": "Terrific Sunday brunch. Had the Cubanish and Golden Lox, both with the potato salad. The salad was creamy and delicious. The Lox was my favorite because of how stellar the caper dill schmear and pickled shallots were. The presentation of the dishes was beautiful. Wonderful small brunch spot at a good price point that I will be returning to!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCeThhSEhnEAE",
            "text": "Really great brunch menu with simple but great plates, lot of variety and some vegan options. We got 2 patatas bravas to share, cubanish sandwich, golden lox, old standby and toasted goat and they were all hits. Great atmosphere and friendly staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoZ2QybjBRRRAB",
            "text": "Julia's is always enjoyable to go to. The menu is small and intentional and the service feels like going to someone's house who's a great host. They genuinely want you to enjoy the food and I've never had anything I don't enjoy there. Simple dishes that are well done and perfectly portioned so you don't leave stuffed. Also their coffee is just really good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsczZIZ3dBRRAB",
            "text": "The most amazing Thanksgiving meal! I started looking for Thanksgiving options a bit too late this year, and Julia went above and beyond to accommodate me (calling me back and emailing me herself multiple times to get my table booked!). The atmosphere of the restaurant is cozy and rustic, yet upscale and sophisticated. The staff couldn't be more friendly and accommodating- Julia herself went around to each table welcoming everyone.\n\nIt's hard to pick a favorite course, but for me it had to be the Butternut Squash Bisque- so creamy and flavorful. What autumn soup dreams are made of! We raved about this course for days to come. Other top bites include the popovers with maple butter, the Blackhead Mountain Salad, roasted cumin carrots, the and Lemon Tart. Can you tell we liked everything?? The price for the many high quality, large portion courses included in this dinner is an absolute steal.\n\nWe can't wait to come back. Thank you, Julia and team, for making our Thanksgiving so special!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbG82bld3EAE",
            "text": "Great brunch spot! Delicious drinks and food.  The ambiance was nice- despite being small,  it wasn't loud and didn't feel crowded. The arepas were nicely cooked and my sunny side up eggs were perfect! Loved my Bourbon Bee's Knees. Can't wait to go back and try more drinks and plates."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURoeUwwVhAB",
            "text": "Came here for brunch and had a really good time, we didn’t have a reservation and got a table without waiting in line! Service was really good, friendly server and food was yummy! The only dish we didn’t love were the arepas! But would definitely come back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1Njh1YmdRRRAB",
            "text": "First time visiting, and I will definitely be coming back.  The staff at this restaurant made me and my partner feel so cared for. Everyone was so friendly,attentive, and happy to do their jobs. The food was great. The drinks are amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeVo2X0NREAE",
            "text": "I only went for a quick bite and had the fig, goat cheese with bacon toast which was good ($16).\nThey have a tiny kitchen so service will be slow and nothing is quick. It can be a cute brunch spot for a lot of people but it was too loud for us. Not a great spot for a date because youll be screaming at each other.\nOther than that the workers are friendly. We went on a Saturday at 1:30 and waited 30 minutes for a table."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRME5LSmd3RRAB",
            "text": "The food for brunch was DELICIOUS! I had the sandwich on the menu. The staff was extremely friendly, the dishes were adorably plated, and reasonably priced. It's a gem in the middle of Woodward Ave. I would definitely recommend checking this place out"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMlpyYjRRRRAB",
            "text": "Wish this was closer to where we live in Brooklyn, because we would be here *all* the time. The decor is beautiful – very bright, plants everywhere, lots of quirky touches. It actually feels like someone’s living room. And the food was incredible, so fresh and full of flavors."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdzhqZFh3EAE",
            "text": "Amazing! The food is delicious, fresh and reasonably priced still lol I came here with my friend for Sunday brunch and waited 2 minutes for a table 👌 I had the scrambled eggs with toast, potatoes and bacon and everything was SO tasty. I'll definitely be back 🔥…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlN19mQmZnEAE",
            "text": "Lovely neighborhood spot with great food and cocktails. We had the beet salad, sweet potato hash and cocktails. Was tasty and satisfied with everything. Kind and nice stuff as well."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dUlDQUdnEAE",
            "text": "Literally 5/5 stars !! Went for dinner on a Friday night and we could choose from inside, outside or bar seating.\n\nGreat vibes, music, and service !\nExcellent vegan options!\n\nI got the sweet potato hash (I normally hate sweet potatoes) and now I’m a sweet potato believer !!\n\nWill definitely return :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd2ZYbERREAE",
            "text": "Brunch arepas, Cuban sandwich and olive cake for dessert...delicious!! Lovely staff!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOUtpa2pnRRAB",
            "text": "A friend and I went in about an hour before closing, and the vibe was cozy (very small space) and intimate. Very cute space. There was a larger party present so it was quite loud and it took quite a while for someone to come over and take an order for our drinks.. even though there were only another 2 people there along with the party. That was a little annoying.\nDrinks - Spicy margerita was average. My friend got the lavender drink, which she enjoyed.\nFood - the vegan/veggie hash looked good but it was nasty.. I don't know how else to describe it. There were maybe 4 or 5 chunks of potato, and then some cauliflower and brussel sprouts. It was a very, very small dish for a ridiculous price, definitely not worth it.\nTheres seems to be glowing reviews here about this place's brunch, so I may have to check that out."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdDdlbjJRRRAB",
            "text": "perfect location, perfect food and outstanding service thanks to Sasha, she was so sweet and so helpful with our food and her recommendations for the cocktails."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCeGF1WEtREAE",
            "text": "Really great brunch. I got the Golden Lox and it was super yummy and would def get it again. Great spot to grab brunch and have a fun hangout with friends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdGVIVllBEAE",
            "text": "Just the best local brunch spot in Ridgewood. The food was amazing, plus the service was exceptional and quick. We will def be going back!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbVBXUWd3RRAB",
            "text": "Came for breakfast with my gf because she had previously been here with one of her friends. The first time she came, she raved about it. This time it wasn't as good for her. For me it was pretty good. We ordered: Julia's breakfast sandwich - other than the biscuit being too thick it was a good sandwich (the sauce was really good, wish it had more). Mushroom omelette topped with goat cheese - really good! The goat cheese made it much better\n2nd visit - Delicious! We got the cubanish sandwich and the toasted goat (me and the gf ordered one of each) we shared half with each other and I would recommend you do the same. The Cuban is savory and the toasted goat is on the sweet side, a great combo."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMGZiZnFRRRAB",
            "text": "Staff v. nice and welcoming - I requested a mocktail and the bartender asked me a few questions to determine that I wanted it tart and fizzy. The passion fruit based drink was lovely and tasty, did not disappoint.\n\nI ordered the mezze plate and added a side of greens, good amount of food and delicious tortilla chips. I decided I prefer my hummus with more lemon and drenched in tahini - this was still yummy, just not my favorite (served with a drizzle of olive oil and minced cured black olives).\n\nNice covered patio area and they were open for indoor dining as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcXJYZXZBRRAB",
            "text": "Amazing brunch! Food and service was so good. Gotta try the pumpkin pancakes and get it with bacon 👌🏼 absolutely delicious! Came with my gf, will be a regular!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1Mk4tQzR3RRAB",
            "text": "This place was incredible! Great ambiance and the two vegan options were delicious. Highly recommend."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZOHBTMDR3RRAB",
            "text": "This is literally my favorite spot in the world. My fiance and I have dinner, brunch and drinks here often, and most recently had our engagement party here! When I proposed I gave her a scrapbook and there are two whole pages of photos of us eating at Julia's (and I even had to leave some out).\n\nThey are great for any occasion. DELICIOUS food, WONDERFUL people and THE BEST atmosphere. They were wonderful to work with on the engagement party, the catering menu was somehow just as amazing as their regular dinner and brunch menus, and it was the best night of our lives.\n\nDo yourself a favor and go here. Often."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqX283NW9RRRAB",
            "text": "We were so excited to try this restaurant and ordered some delicious sounding food!\n\nWhile the drinks were good, our server completely forgot to input our food order. It took for me to ask them where the order was for them to realize it was never inputted in the first place.\n\nWhile they removed the food from the bill, we will not be coming back which is a little unfortunate.\n\nPS: I write this review as a person who works in the service/restaurant industry as well, I understand the difficulties and challenges of the job."
        }
    ],
    "reviews_count": 74
}