{
    "name": "Cachapas y Mas",
    "place_id": "ChIJ5Qpq5iBcwokRXAiqaAUuS_A",
    "grid": "QN5",
    "address": "6-78 Seneca Ave, Ridgewood, NY 11385, USA",
    "rating": 4.4,
    "user_ratings_total": 1051,
    "phone_number": "(347) 721-3767",
    "reviews": [
        {
            "date": "6일 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VeFMwMTNTa2N4YldScVYyTXhZbWREVmpabVZuYxAB",
            "text": "Cámbien el maldito personal que uno llama y pareciera q el dinero de uno no vale siempre q llamo es lo mismo"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201T1gzcEJORmRwVXpSM2JFRmZkV1J6T1ZWMlZrRRAB",
            "text": "The meals here are amazing and I'm surprised since this is my first visit. oh yes, the team knows how to treat customers right. You can experience unique flavor profiles that delight consistently. This place creates a mood I want to stay in. This spot offers outstanding dishes!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNGRUbE9jVkpuTkZReVgySnpXVFkxY2pGd1JtYxAB",
            "text": "Food was good but we came in at 11:15PM and they close @12AM. We were told we can only order to go because they are closing soon but then people came in and ordered food and were allowed to sit down. My family felt discriminated against. The woman who told us this was a chubby darker skinned tone woman."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVE0yRnNhMnBsYzFsT1preG1SMXBJYjFVMmJGRRAB",
            "text": "This was my first visit to this location, and unfortunately, the Arepa Pepiada did not meet expectations. Traditionally, this dish is served with the filling stuffed inside a single arepa, but here it was presented more like a sandwich, two arepas with the filling in between; which felt off. More concerning, the chicken inside was noticeably cold, raising questions about its preparation and freshness. I was really looking forward to trying this, but the execution left a lot to be desired."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeFgxWnJORTFzYmtrMVQyZGZhRTk0YjJ0V2QyYxAB",
            "text": "Love love this neighborhood staple. Cachapas are crunchy, fresh and flavorful. A must if you’re in Ridgewood."
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa1RHWklWSFYxYTE5RmMwb3pUVTFXYTJ0VlkyYxAB",
            "text": "Tiene nombre Venezolano, porque la Cachapa tiene su origen en Venezuela, pero todo adentro es Colombiano, empanadas colombianas que son muy diferentes a las Venezolanas , las Cachapas era una masa de maíz floja, nada que ver con una Cachapa. Este lugar no lo recomiendo. Ya me habían dicho que era mala la Cachapa, pero quise tener mi propia opinión. También comí un golfeado, aunque seco estaba mejor que la Cachapa. Tenía buen sabor el golfeado"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSk1VeEdiMmR4YldsbVVsbHFYMHd4ZGt3ek1FRRAB",
            "text": "I ordered through the official website for the restaurant. it took 1 hour and 40 minutes to arrive. When i called multiple times to the restaurant so they could help me get the order they said that i would have to just wait, and that sometimes it takes several hours to get the order. when the food finally arrived was cold and soggy."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RFFUY3pTVzk0ZW5wWE5WbHRVbU42YjJObmFWRRAB",
            "text": "Negocio en decadencia debido a su mal servicio. Estos restaurantes tienen historia, su comida originalmente era buena, hemos escuchado al señor Larry como con tanto esfuerzo empezó su negocio, y en esta sede no respetan su legado. Este no es el primer review de clientes relacionado con el mal servicio, pedidos mal tomados, comida tirada en la mesa, a mi me ha pasado lo mismo, no en una ni dos o tres visitas, esto algo crónico a lo largo del tiempo. Personas como Raquel y un par de cajeras más hacen que la experiencia en este lugar sea pésima. Lastimosamente también se han perdido recetas y sabores originales, o quizá esta percepción nos da al recibir siempre un mal servicio. Ojalá algún día se tomen en serio estos comentarios y los dueños revisen esta problemática y hagan cambios. Ya que optamos por buscar otros lugares en queens que valoran más el esfuerzo con el que llevamos a nuestras familias a un restaurante."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONWFEVjRhVmRzYUdwcFRtaFpORjl1VTNONExYYxAB",
            "text": "No vuelvo nunca más ❗️. Pusieron. -Diferente comida a la q ordené\n-Me cobraron un plato que no pusieron\n-Las cachapas fatales no sabían a nada    -De verdad NO LO RECOMIENDO 👎.   Q pena pero como Venezolana lo lamento ❤️‍🩹"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMFltdEZOV05hYWxkUGNuSkpPRmRaY0MxMVkxRRAB",
            "text": "It’s not fancy, but it’s so darn good. My go to order is the pabellon arepa. It’s a whole meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WmJuTXRhVWhEUm5wUVJUQkNaSFV5UnpoeVUzYxAB",
            "text": "Wow wow and wow! I can't believe how perfect every dish was. This spot breaks the conventional rating system. The team delivered superior attention and food was served rapidly. Their kitchen delivers freshness with artistic presentation. A totally satisfying meal!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeWNHaEtSV2N6ZGpsUk0xSm5WMHRuY3pNMlFuYxAB",
            "text": "Llame por teléfono para preguntar los precios de las cachapas  y la deferencia de los quesos con qué las venden y la persona qué me contesto no resolvio mis dudas, le dije que iba a ir para q me explique mejor y me cerro el teléfono … cuando llegue me atendio una muchacha muy amable hice mi pedido y me sente a esperar hasta que me lo entreguen … en seguida llegó la muchacha que me contesto el teléfono le reconoci la voz es una gordita pelo castaño …. Y cuando ya estuvo mi orden la muchacha antipatica me la puso en mi mesa y la dejo allí …. Después me dijo que me salga que se iba a sentar a comer ahí consent estaba ..//\nPesimo servicio camine 20 minutos para llegar al local una amiga me redomendo su lugar … La proxima solo pedirle que me envien a mi casa"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdk1WUkljMkp4Y1dKaGJWRlFRM3B2U0Y5RVlVRRAB",
            "text": "Las empanadas estaban riquísimas pero la cajera era un poco grosera con una pésima actitud."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOalFVRlFOMW95VUdKMlkyb3dZWFp1V0V4NFRGRRAB",
            "text": "The quality of food is really high. The sauces blew my mind and would go back just for those. I have never tried this before but walked by all the time. It's definitely worth it! They also give you a ton of food at once which is great."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTGVucDZlazFxUlROamN6RTFUMDlIWkV0VE1YYxAB",
            "text": "El servicio fatal, la comida recalentada horrible, los Tequeños malísimos , las empanadas viejas … en fin malísimo no lo recomiendo"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5a2VFdzBNamxrYTBab2FIZGlSRlZ4TFRSNVdFRRAB",
            "text": "Me gusto regresaria."
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nME5HZHBia296U0dWbVRUVm9SSFowZUZOamFHYxAB",
            "text": "Muy buena la comida pero las q atienden son muy mañosas siempre se equivocan a su favor .ojalá y pudieran mejorar el servicio"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbVZ6ZDBjM0ZWY2paMmVEZFNWRWwzWmpSeE5VRRAB",
            "text": "Me encanta este lugar y sus cachapas 🤩🤩🤩…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobFpGWkRSMmhLU0ROWE5XWTFNRWxFZDNoRWFHYxAB",
            "text": "Food and service, everything is amazing. Get the chicken empanadas for 3$!!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRU1rZFJSSFptZW5sQkxXZFdXazVXYWxCcmEzYxAB",
            "text": "Siempre que vengo y pido algo se equivocan se olvidan de algo o no te dan la orden correctamente, presten mas atención a los clientes!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUGJERnpNbEJpYkZONE1sRjZWall4YXpnMlduYxAB",
            "text": "You’ve got to try it! Whether you’re craving something sweet or salty, this is the place to go. Their cachapas with carne (meat) are so good. For my Latin ladies who love plátano maduro (sweet plantain), go get the Yoyo with cheese and/or meat (see picture). So delicious! And the sauces? They’re phenomenal and go with everything. They also have empanadas and pastelitos. If you like maracuyá (passion fruit — see picture), the juice is yummy. It’s very sweet though, so if you prefer it less sweet, get some water to mix with it. You can sit and eat at the place or grab and go. Enjoy!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVlNYQXpXaTFqT1Y5dloyaEtkSE4yYVRKb1MxRRAB",
            "text": "Las orden Duran mucho  y avese la cojen y no la envian"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MGJXSXlPVmxHYUdGalFtdGhjMmRNT1VwcllVRRAB",
            "text": "food is always so good. staff always friendly. love it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvM05uWjJXVmxGUTA5dWVWQXpSa2gwVkdVMldHYxAB",
            "text": "Hands down the best Venezuelan restaurant in New York.  Owner is from Maracaibo, where the best sazón in the country lives. I can’t recommend this enough. - A Venezuelan living in New York"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBemNVdGtaMDlPVUZsdk4yNXFkRGt6UjJwUlRrRRAB",
            "text": "Yo fui en el 2023 estaba todo rico ! Pero ahora volví y que horrible dañaron la comida venezolana horrible me dieron una cachapa con lechuga y tomate! Y la chicha no sabía a nada! Que horrible an dañado la comida ! No tiene nada de sabor"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaFJXVlZOVFJ3YW5KSVVHd3dWVFJtWVc0NU9WRRAB",
            "text": "I liked the Reina papeada with all the sauces plus a maracuya drink."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReGRrRXpSR1pITUd0cFoyaDRiM0V5TlVScWJYYxAB",
            "text": "Love their food."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSa1RHVndNekF4T0ZocWN6TnRZWFpqTWt0cWRuYxAB",
            "text": "El servicio al cliente es pésimo; La Niña que te lleva la comida a la mesa te la tira como un perro, La cachapa no sabe a nada,  la comida  no tardo ni 5 minutos en llegar a la mesa la carne y todo el relleno estaba  frío y sin sabor venir desde tan lejos para irme decepcionada"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvaTRQeU5nEAE",
            "text": "I usually order online and everything is perfect. So I hyped this place up to my coworker and brought her in...and received their absolute worst. I've never been so dissatisfied and disappointed. Ingredients were missing, my cachapa was half empty. SHE EVEN ASKED ME IF I WANT EVERYTHING IN MY CACHAPA AND I SAID \"YES!!!\" WHAT THE HECK?!?So sad 😕"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTGJtTm1XbVpoWjJnMFp5MTBRMjVJVkhkSmQxRRAB",
            "text": "Yummy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOZkJ4TkhncDVfWlhnEAE",
            "text": "Doesn’t know how to drive."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKV3I0OGZ4aW9XV0RnEAE",
            "text": "Son muy buenas las empanadas que fue lo que comí y el jugo de maracuya"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJWGQxNTJyMGQ2c05BEAE",
            "text": "Food is good but why they don’t add the sauce? It’s pictured and it makes sense on the arepa, although still good, without the sauce is kind of dry. Second time I order and get no sauce"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNSHk4cWlWaFBmRDlRRRAB",
            "text": "I absolutely love this spot. I always order the same thing every time because it’s just that good. The food is always consistent and never disappoints!Their cachapa is the best, made with corn. I usually get mine loaded with a mix of meats or carne asada, mozzarella cheese, lettuce, tomatoes, and a side of both pink and green sauce. Absolutely delicious!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKVFJsN2I0aUlYYzd3RRAB",
            "text": "Muy buena"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPMzAydXkxeDUzODZBRRAB",
            "text": "Quick, easy, and cheap food. Most of the time it is good, but a few times the quality seemed off. Overall an amazing spot in the neighborhood."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNFk2TDdRRRAB",
            "text": "Estaba cerrado, perdi mi viaje abren muy tarde desde mi punto de vista"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2Y2bF9BRRAB",
            "text": "I’ve been a customer here for years. Not coming back, food quality is very bad, it wasn’t like this before, prices are going up but quality is going down. Very disappointed."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdGUzYnpBRRAB",
            "text": "Used to be on point. The recipes seem to remain the same, but the execution lately has left a lot to be desired."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMThhLVhREAE",
            "text": "No lo recomiendo para nada, las cachapas son muy secas"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbzY2MS1nRRAB",
            "text": "Their food is delicious. I would say even better than Venezuelan food in Venezuela. It is incredible. It is a bummer the increase in price, that’s the only thing holding me back from ordering again."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeXJUQkZBEAE",
            "text": "Las cachapas como buenas buenísimas"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMHFlNUpnEAE",
            "text": "Worst yo-yo ever ! Cada día van de peor en peor con la comida la carne toda cruda y pasada. Si pudiera darle 0 les daría !!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cm92UktnEAE",
            "text": "Always a great vibe, great music, love the arepas and the horchata shake and the papelon"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3Z016dHBRRRAB",
            "text": "Ha desmejorado"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNS1tTldBEAE",
            "text": "Very clean inside. The art on the walls are nice and colorful. I ordered the area with chicken, and it comes with (if you want) lettuce tomatoes green sauce (wish is light and so good. Idk what it is.) Ketchup and a slice of fried cheese! It was crunchy. The chicken was flavorful.\nI also had before a Tequeyoyo. It's a sweet plantain with ham and cheese. (Like a potato ball sorta) That was a nice flavor, sweet because of the plantain, but the ham and cheese made it a little salty! The bread is sweet soft and sorta wet ish.  You should go if you're in the queens area. The girl behind the count is polite and helpful.  And they have a bothroom that is clean!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMGVxRHh3RRAB",
            "text": "One of the best dining options in the neighborhood. Ate here a ton of times and never had anything that wasn't delicious."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbU91Xzd3RRAB",
            "text": "La mejor cachapa de NY🤤🤤🤤!!! el Kenny power en cada bocado 💛💙❤️"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNF9iamtRRRAB",
            "text": "Mal"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdWR1bC1BRRAB",
            "text": "The pernil yoyo was absolutely delicious - so tender and flavorful, and the passion fruit juice went along with it very nicely. The space is comfortable, lively and adorned with colorful paintings. Definitely looking forward to stopping by here again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Z3ZpcmFnEAE",
            "text": "The food is delicious. The service too. The only thing is that they won't go to your table to take your order. You have to go to the register. I didn't know and waited for my order to be taken lol until I told the ladie I was ready."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbzhibVhBEAE",
            "text": "Cachapas y más is located in 678 Seneca Avenue in Ridgewood, Brooklyn, NY. They’re casual Venezuelan kitchen offering classic street food such as corn pancakes & plantain sandwiches. We were six and the delivery was timely and the food arrived hot. We had an excellent experience ordering from this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OUpTZENREAE",
            "text": "I have went to the location in the Bronx and this time I went to the Cahacapa in the Brooklyn location and all I can say is that the customer service is 10/10 and so is the food 10/10. I had ordered the Cahacapa Venezolana and it was a 10/10😍. I will be coming here again!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWXzUtcmpRRRAB",
            "text": "Restaurante de comida típica muy recomendable.\nProbamos cachapa y arepa además de unos te que los y todo estaba muy rico. Las salsas del local muy ricas también, acompañan de maravilla los platos.\n\nLo recomendaría para comer algo rápido y barato."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbE1lRVpBEAE",
            "text": "Got a chachapa con pollo with pink sauce, and damn it slapped. The corn pancake with the perfectly seasoned meat and the sauce was fire. Got a chachapa and a beef empanada for under $15, you can’t beat that price in NYC. I have had other popular orders from there as well they are so good. The workers are always friendly. I usually order ahead because they get busy sometimes, they make it super easy by pairing with DoorDash and Uber eats so you can order ahead. It’s hella close to Dyckman st. Station and the neighborhood is soooo chilll there’s no excuse not to check it out."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvdmJ6TUhBEAE",
            "text": "Delicious food! Customer service was stupendous and it’s a very nice cozy place.\nI had the Cachapa with shredded beef and queso venezolano. I also had the Arepa with shredded beef and everything inside( cheese, lettuce, tomatoes and sauce). The only thing I found strange is how the Arepas are done. They consisted of 2 patties but, in other places it’s usually one large patty stuffed. The passion fruit juice was delicious! And I hated the 3 leches cake, it was VERY dry! Nonetheless, will definitely be back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZdE51SGpRRRAB",
            "text": "I ordered the roasted pork cachapas. It was good, but I guess I was expecting a lot more based on the hype surrounding this place. Next time, I'll definitely try the cheese cachapas! @goodforjo"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5bXBhTmRnEAE",
            "text": "Loved their Yo-Yo! I got two meats: shredded chicken and shredded beef. It was filling and exceeded my expectations! Can’t wait to come back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDb3FqZzVRRRAB",
            "text": "The place was great, really enjoyed the food. I had the chicken empanada, the Cuban Yoyo and a glass of chinola. Everything was great, the only reason they didn't get 5 stars, was because of the outdoor seating, unfortunately it's small and the weather didn't help."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNaDdpZ3B3RRAB",
            "text": "It is a really really good place. Nice and spacious and clean, yeh food is awesome. Ver tasty and it’s not expensive. My favorite is beef patacón. You’ll love it. They also have delivery"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwaHFDcGdBRRAB",
            "text": "I ordered the one with sweet plantain and shredded beef it was very yummy and worth the price. I did not like  maracuya fresh water it tasted  artificial."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1N2FMcEpBEAE",
            "text": "Cachapas y Mas? Este lugar de Cachapas solo tiene el nombre tanto en sabor como en presentación son horribles no lo recomiendo, hay otros lugares donde se puede comer con mejor calidad y por el mismo precio."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCOHBMc2VnEAE",
            "text": "So flavorful & juicy. I always get the same thing when I go there but they do have a great selection 😋"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aTQtYlFnEAE",
            "text": "I ordered cachapa before and they were really good. Now they taste different and not the same quality. I ordered one last night and couldn’t eat it.  Look really bad and taste bad."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMlBmcHB3RRAB",
            "text": "You guys need to clarify about your 1000 types of cachapas. I was expecting the only one with cheese and I ordered extra shredded beef and I received this (photo) . Food is good, but this got me really mad."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2M08yTEF3EAE",
            "text": "My friends who moved to Bushwick recently shared if we would like to try the best sandwiches in the neighborhood, Cachapas y Mas is a must.\n\nThey serve 7-8 styles of Venezuelan sandwiches with various ingredients. We ordered one of each and 2 bags of finger food, Tequeyoyo & Cheese Pastelito to share with a group of 8 people. The portion was more than enough with super reasonable price.\n\nThe food was an amazing hit and our favorites were Cachapas, which was made by corn pancake & Patacon, which was wrapped with double-fried plantain. Both cheesy snack was also really delicious and satisfying."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OHJ5bkpnEAE",
            "text": "Me gusta la comida del lugar pero la semana pasada vine y se notaba que ya tenían el aceite viejo por el color de las los pastelitos y empanadas, hice el comentario y me dijeron que ya era tiempo de cambiarlo esa semana, hoy vuelvo a pedir comida para llevar y este es el color de la comida frita, (se ve peor que la semana pasada) deberían de ser más cuidadoso con el cambio de aceite ya que no solo es que cambia el color de la comida sino que se torna más dañino para la salud ‼️⚠️"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcHRXZ3ZRRRAB",
            "text": "The service was good but unfortunately the cachapa was very disappointing. I've had a lot of them and this was by far the most \"meh\" one, bland, too little cheese and you don't even get that nata cream that any self-respecting Venezuelan restaurant would provide."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTNE5iZTJBRRAB",
            "text": "I got the wrong order 🤬\nI ordered from seamless: 1 steak pepito and 1 3 meat pepito..... I got 1 shredded steak and 1 2 meat pepito and both pepitos were saggy af. I have ordered from them before and this is my first time getting an awful order. First and last time!…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3aHJMWFl3EAE",
            "text": "Really great food!!! Ohhh I really love Patacones, you should try that one, with grilled chicken. And the place and service it is nice 😁👍…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMDRuQVV3EAE",
            "text": "This was by far one of the most delicious things I’ve ever eaten. Eating this (full Cachapa) was a combination of a huge meal while eating desert. I absolutely loved it and if you’ve never heard of it before, or heard but haven’t tried it yet.. what are you waiting for? This is a no brainer 5 ⭐️ I’ll be back again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMTRDWDdnRRAB",
            "text": "The staff was very helpful and friendly. Always love this spot. The food is delicious. The Chachapas, empanadas, and the sandwiches (forgot the name) are all amazing!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNHFEZHZRRRAB",
            "text": "La comida normal! El sazón venezolano no está! La arena que comí estaba bien pero mejor si la arepa fuera asada y no frita! Para la cachaza solo había queso mozarella o venezolano!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZOEltNGlBRRAB",
            "text": "I’m telling you, I literally get the steak Tachucho all the time because it’s soooooo good!!! This is it without the burrito but I’m almost finished because it was so delicious. They do not cheap out on the steak like most places. I wanted…"
        }
    ],
    "reviews_count": 74
}