{
    "name": "Rosa's Pizza",
    "place_id": "ChIJK77vNoVewokRhEjVTZf0FyU",
    "grid": "QN5",
    "address": "62-65 Fresh Pond Rd, Ridgewood, NY 11385, USA",
    "rating": 4.6,
    "user_ratings_total": 2337,
    "phone_number": "(718) 497-7672",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5T1FsVkVaMGx3V0RkdVJITkNSazl4WmpkcGNWRRAB",
            "text": "The pizza is good I just think they are super over priced !!!! Also I feel like they are not very welcoming!!!!I also bought a lasagna and never again !!!it had a bunch of tomato sauce and hardly no meat and no cheese!!! if you’re  over pricing for things then give people what they are paying for !!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQlpVdEtaVEZ6UzBKRk9XdG1hSEJMU0dkS1kyYxAB",
            "text": "Baked ziti sooo good 👌🏽"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKa0xXOXJiRmN3YmxSSWVtbGZabDl3YW05eVFrRRAB",
            "text": "I haven't been here in a few years but just had the margherita slice and it was incredible. $5 per slice but the size/ingredients were worth it. (also check out the ziti slice, grandma/Sicilian, chicken Caesar salad slice, and the plain slice.)"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwdXR6aDdBRRAB",
            "text": "Update: Phenomenal Sicilian Pie.\nSavory Tomato over salty mozzarella cheese. Wonderful atmosphere.Hospitable and 2 hr meter parking one block away.\nQ58 bus stops right in front of Rosa's Pizza."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGV1RWOTFWMnAwYkdOVFkzQnFMV05EUkZGUU5uYxAB",
            "text": "Good food and service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxT1MzRlpjRGRSY1hSRFVYZFVRazVWT0Y5d1pGRRAB",
            "text": "UNWELCOMING EXPERIENCE!\nThe variety of pies is great! The pizza was very good. The staff on a Sunday afternoon (9/28/25) were unfriendly and cold. Almost as if they couldn't be bothered. I had never been there and didn't know the ordering/serving/paying routine. No smiles, no \"don't worry about it\". Callous. Unfriendly. Unwelcoming."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeVlWbG5SMU5NZEZWdmJUZGFVRU5rY1RSSmMxRRAB",
            "text": "The pizza here is good, one of the better spots in the neighborhood. But every time I come in, the TV is tuned to Fox News and the staff are joking around loudly, sometimes making political comments in earshot of customers. 3 times they’ve forgot to put my order in the oven because they’re too busy with their Fox News. I come here to enjoy a meal, not hear about politics, so it can feel a bit uncomfortable. The food is worth it, but I wish they’d keep the atmosphere more neutral and welcoming for everyone"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMVJYTjVRWGRTUlZSaGIwZEZOWFJsU25JMGVHYxAB",
            "text": "Quality and price are unmatchable"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBM2FYTktZbVZSTW1KWmFGcGlTalZFTVVjNFlWRRAB",
            "text": "Everyone knows Rosa is the best! And if you don’t, you should try. See for yourself."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMWJsQjJXREkxZVdZd1kwczNUekkxTFd4dU0wRRAB",
            "text": "Best pizza en queens new york"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeFduQnRabFF4Y0VKWVh6UkJjWE5qYmkxMlZrRRAB",
            "text": "Place is exactly the same as it was 20 years ago when I went to the nearby high school. Great pizza reasonable prices plenty of seating"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdE5GTlVhVUpGYTNSVlQwVTRiVlJNYmxOblNGRRAB",
            "text": "Very tasty"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTWRXTjBhRlY0VmpSeE5UUnNURUUzTFhCcGJGRRAB",
            "text": "Ive been going here for awhile their sicilians used to be my favorite pizza around however their food quality has gotten worse and worse, they recently redid the place and the way you order is a little dumb because of the lack of communication between the register and the pizza chefs. I recently went in ordered 2 slices  and a mozzarella stick to go they were all ice cold . I liked it better in the old system where you order then go to the register. new tech makes them visibly more lost and their food quality is suffering from it. It took them 22 minutes to get my food out, and was ice cold"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGYU1UUnJXVlp0VFhkbldVVndWWHBuYkU1VU5IYxAB",
            "text": "The most New York City slice that has ever existed. Authentically New York with a capital NY…"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDcnNHNjd3RRAB",
            "text": "This is by far the best Sicilian slice around"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jd1praGZObGcyU1V0d09GZzNSa3RqTVV0aVZuYxAB",
            "text": "Would give 10 star if I could. When I go to New York all I think about is getting a pizza from here. It's too good and I have never (not for lack of trying) found a place that can compare."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVVlYaFZSSGx1U0VVdFpVUjRiVWxvWkU5MFYyYxAB",
            "text": "Great neighborhood pizza shop with a  variety of pizza, sandwiches and pasta dishes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZdGRsbGFWSEIzU200M1dtbDBXbGhKVVdoT01FRRAB",
            "text": "Good pizza. Real authentic pizzeria. Good service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TE5GUlVObmhWTjBwdGVGUkhOM0ozYm5GdVZFRRAB",
            "text": "Been coming here for years. Upside-down Grandma sicilians are the best"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTWFURm1ZVTVVVVUwME1FMUtOVXhVWkVGU09IYxAB",
            "text": "The Buffalo chicken pizza and BBQ chicken pizza are always superb."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMGQxQlNRWGhHYXpoRGJsTnRWVXRSYUd4aGJIYxAB",
            "text": "Absolutely Fabulous NY Pizza"
        },
        {
            "date": "2달 전",
            "language": "la",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sak5VaEtla3RCYVVsU2NEbENlbTFXTm13NFkyYxAB",
            "text": "delicius"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JM1MxcE5ZMDlYYVdsNlRYcG9URTlHWDFoNlVIYxAB",
            "text": "Been enjoying Rosa's Pizza for over 15 years. There food is always excellent"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRGVVTlZZblk1TUZGS1dXSk9hRkZYU1VSaVgxRRAB",
            "text": "Great pizza, anytime I go to New York I always stop by"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5amRqTlZVWGQ1VURGUmJuRkxiSEZXWmtOQlIxRRAB",
            "text": "Great wings!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMWJsUlRRbTV2Ym5aeExXMXlUVVJ4VHpsNk5IYxAB",
            "text": "Just ordered a margherita pie.  While it tasted ok, it was so badly undercooked I had to bake it in the oven.  Always possible it's an off day, but given this is the first time I'm trying the place, not sure I'll be going back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUlJscDNhR0ZWVFVoYVluSnBUVlJqY0U4MlJVRRAB",
            "text": "A hidden gem for a long time.  Authentic NY pizza and Italian dishes.  They have all types of slices.  I have tried almost all of them over the years and have never been disappointed.  The Sicilian is one of the best I've ever had.  Fresh mozzarella, thick sauce, crispy bottom, and a balanced dough.  Love the vodka rigatoni slice.  Always grab a sfincione to go.  Garlic knots are great.  Rice balls are large and tasty.  A must-try for any pizza enthusiast.  Always freshly made with fresh ingredients.  Service is always courteous and quick.  Just don't ask for delivery."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSVVEWnZielZ6TlhGTk0ydHVURE5FVmpkUlNsRRAB",
            "text": "Rosa's Pizza is one of the best! Their Chicken Ceasar Slice is amazing! The entire staff are warm and welcoming."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeGEwcEZXbXN0UTFsb1UxbE9ZbFpZVHpnM2RVRRAB",
            "text": "Mmm excellent!  First time trying Rosa’s.  Will be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WV1RqRTRVM2d5ZUhoV01GazVXR295U214RlNsRRAB",
            "text": "Excellent pizza!  There's so many kinds of pizzas to order as well as rolls and hot meals. The staff is very friendly and helpful. Prices are very good as well."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVU5sVnVSWE0xUVdrMFJXSTRURkpDTkVoaWFYYxAB",
            "text": "Best pizza in Queens, NY.\nThere are two other Rosa's pizzarias in Queens, but the one on Fresh Pond Rd. Is the best.\nIt's NY, so parking is tough. You can pay the parking meter or try to find a spot on a side street. Wherever you park, it will be worth it for the pizza. Don't forget to try the sausage, eggplant, or chicken rolls, too. For that matter, you can sample the menu as it is full, and I have not tried it all, yet."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbmFWTnRRMTl5WkdWSmEyTXpRV2hEU0ZKWVUyYxAB",
            "text": "Rosa's Pizzeria great place and the owner Mr. Mario is gentleman ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keVZreFpXR3BzWlhaR2Eya3hWbEpFWTJkQ2EwRRAB",
            "text": "The best grandma slice in New York City"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTlFtMUVRWEY0VWxabFJFUlpZMWRNV25wTFFXYxAB",
            "text": "Awesome pizza, almost no waiting."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psM1NubFdZV050YXpoS1lsOTBhMjB0WVVsM2FFRRAB",
            "text": "Great spot I visit frequently they have the best pizza, pasta and chicken rolls 😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wZlVFVXdjVmh5WDBSd1QzUm9ZMHQ0UmpONFFWRRAB",
            "text": "Amazing NYC pizza spot. Local neighborhood gem with my favorite mozzarella sticks.\nWish I lived closer or within delivery zone. Great prices for tasty food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WeWQwSnZjVmxVUVVKa1JsVkdjMGN6ZEVrM2FFRRAB",
            "text": "The best slice in queens.  The Best Chicken Roll in the world!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Wk1GRkVhRGR1YzNrdFIzaHdWRWMxVWt0cWJGRRAB",
            "text": "Didn’t taste fresh. Chicken had slightly freezer burnt taste & aside from that had really had no other flavor. Cashier walked away while I tapped my card. No thank you or have a good day. Nothing redeemable this visit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLZjQyWkcxZ3VXTWF3EAE",
            "text": "Been going here over 40yrs, i know the Owners, there Great. Today Father's Day, ordered what I always order, I know the exact price. The waitresses did a Awful Job, should get 1 star, the owners should get 6 stars if I can give more. I had to clean the tables on my own. Also to make matters worse, the girls charged me I paid,  done. Then they try to charge me again for someone else's bil, I caught it, the waitress girls are sneaky. Owners need to know. They need to get a guy waiter also, to make things better. Waitress are DISHONEST!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOUDk5dWlfc0tmRmJREAE",
            "text": "Great pizza spot\nLove the interior design 10/10\nGreat pizza\nRecommend to take your family,friends\nThey have verity of pizzas\nRecommend the square Chicago looking one\nWish I took a pic"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VON3cwOGJpbGJuRS1nRRAB",
            "text": "Rosa Pizza Isn’t What It Used to Be\n\nThis place used to be great — fresh, crispy, tasty pizza every time. But now, it feels like everything has changed. When you order, they just take a cold pizza from the display (probably made hours ago), reheat it, and hand it to you.\n\nEven the Chicken Scissors pizza, which has salad on top, gets thrown in the oven — so the salad comes out wilted and gross.\n\nThey used to make each pizza fresh, box it, and put your name on it. Now they cut corners, and the quality shows. Honestly, it doesn’t even deserve one star anymore. Really disappointing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJVElwby01bUpudG9BRRAB",
            "text": "Rosa’s is the standard when it comes to pizza. I’ve been coming here for so long and it is still consistently great. Between the Grandma and Upside down they can’t be beat for miles."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEODkzNFl3EAE",
            "text": "I love Rosa’s Pizza here on Fresh Pond Road. I’ve been coming here all throughout my childhood and I continue to come back whenever I can. The pizza is the best because it’s fresh and delicious. There are always people in here buying it, so they have a quick turnover. My mom used to bring me their eggplant roll when she would come to school to do lunch duty for me at Our Lady of Hope. I still love their eggplant rolls and the others as well. I love ordering the little marinara sauce with it so I can pour some on to it.\n\nTheir rolls can also be made without cheese. While I love cheese for most, they do a spinach roll that I love without the cheese. You can order it ahead of time for pickup. I always judge a pizzeria by their plain slice and theirs is the best and my favorite. I also love their Margherita slice, chicken tomato, the grandma slice, taco slice if I’m starving lol and so many more. This place has my heart and all of my cravings! I’m literally going back to get a few other things for home as well. I’ve scoured my phone for Rosa’s pizza photos, as I’ve been here plenty throughout my childhood and adulthood."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQVE9vYXJybVBIRExREAE",
            "text": "Great slices! Not too doughy and not too crispy. Fresh toppings and great variety."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNDYzRTNBRRAB",
            "text": "I eat pizza almost every day. I’ve eaten at hundreds of pizzerias over the years but just stumbled upon this place about two years ago. WOW!  Everything here is excellent. The sauce on their pizza is amazing. Not every pizza is good cold. Theirs is. I’ll take two slices home with me and eat them at room temperature and it’s just as delicious as fresh out of the oven. I’ll take pies home and freeze them two slices per zip lock because I live 25 miles away. I have 9 pizzerias within five miles of my home yet I won’t hesitate to travel the 25 miles for excellent quality pizza and service from this place. I’ve written many reviews and I always read other people’s opinions as well. I’ve never experienced anything but professionalism and friendly service from these people, that’s why I was shocked to read some of the negative reviews. I can walk in there and order a pie and watch it being made and walk out with it in about 8 minutes. Look at the cheese pie I’m posting on this review. Got it at 12:30 AM today to take out. So delicious!😋. I recommend that anyone who truly loves pizza 🍕 should try this place. I’m a simple guy when it comes to pizza (regular or Sicilian) but I notice other patrons eating all kinds of varieties of their pizza and loving it. My recommendation is to put Rosa’s of fresh pond on your bucket list…..if you’re a true pizza lover."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLXJ1QXVnRRAB",
            "text": "I predict that this will be a 5 star restaurant one day. Their portions are amazing for price. Extremely affordable. My favorites are:\n\nGrilled chicken salad\nChicken Parm\nCalamari\nLinguini Seafood\n\nPizzas are amazing too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbUliTGhBRRAB",
            "text": "Regular neighborhood pizza place, stopped in for lunch. Slices are normal sized, crust was soft along with not being hot, just warm. Sausage slices looked a little undercooked but tasted ok.  Good cheese to sauce ratio, not very greasy.  I won't be back but it's not bad pizza ( I dislike bad reviews unless it's necessary)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaklhb3NRRRAB",
            "text": "After not being in NY for 5 years and living my life as an expat in Spain, I had to immediately go to Rosa’s. Always great service and even better pizza. Without a doubt. I dream of this pizza often. Pictured below is one pie I tried to eat myself. I almost made it. I would love if they had a frozen version I could buy here. While there are pizza places in Spain, it’s nothing close to anything like in NY. Not by a long shot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4M1l1QV93RRAB",
            "text": "Really disappointed of the system and how people organize at this place. The restaurant got tons of good reviews but not for me. Our party got food except me. They forgot my order and I have to follow up over three times still missed it. I had to go to the register to order my food again.\n\nThe place has huge space of seating area so it looks like food court to me because self-service is the best even they have a server, LOL."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPLWF5UzF3RRAB",
            "text": "this place slaps and i can't believe i've never been here before. the sicilian is close to take the cake for the best (sorry that goes to L&B) but overall every slice i had was bomb as hell. line can seem a little hectic but they're on top of moving it and no one is too savage- everyone gets a hot slice. can't wait to come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtak0tWTh3RRAB",
            "text": "The place is huge and clean, great to stop by with kids for a couple of slices. The pepperoni was good, the eggplant was not cooked well,  and the  mozzarella sticks were just ok.\nPros:\n- Service was great\n- Food was fresh\n- big portions\n- good prices\nwill return to try different slices."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBemNtZVNBEAE",
            "text": "The food here is awesome. Highly recommended. Portions are plentiful and you definitely have to try their famous Sicilian slice, it is off the hook.. Guaranteed you will not be disappointed with anything you choose to order."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLdmx1NFROaTVIRzNnRRAB",
            "text": "Rosa’s is a Ridgewood classic, known for its consistently great pizza and welcoming staff—you really can’t go wrong. For a late-night bite, the fries are a must-try! They’re perfectly seasoned and absolutely delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQR25fTDZ5Z3YzdTZ3RRAB",
            "text": "They have huge rats running around in their parking lot. Omg the amount of rats in that parking lot was astonishing.  Your not gonna tell me they don't make a late night stop inside after hours."
        },
        {
            "date": "5달 전",
            "language": "pl",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMbjJwOXpIak9lQXFnRRAB",
            "text": "Było ok,ale jadłam lepsze pizze w życiu. Ciasto mi nie smakowało,było dość grube i pulchne, dość duża ilość składników była na nim( pizza Cesar)."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNUxEOFJBEAE",
            "text": "Este a sido mi lugar favorito desde mi infancia. Y Después de tantos años , aun ha sido mi pizza favorita. Te atienden bien,  tienen el lugar muy limpió. Muy recomendada."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbUs2VXJnRRAB",
            "text": "Out of the 6-7 pizza shops in ridgewood. This is hands down the best tasting and best priced pizza in the neighborhood. People say joe and johns is the best but the price and taste don’t compare. Service can be better but still gets a 10/10 for me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNS1fSnN3RRAB",
            "text": "Classic pizzeria with futuristic slices. I strongly recommend getting some garlic knots as well. You gotta try the lasagna slice ❤️"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNc1lPT0x3EAE",
            "text": "Let me start off by saying the pizza was delicious! Friendly staff, clean restaurant, wheelchair accessible entrance, decent prices and great food. Their large slices are packed with flavor and many toppings to choose from.\n\nDuring my visit, I assumed eating one slice wouldn't be enough, so I got two. I would only recommend this if there is someone to finish the second slice after you, or if you're really starving, as you will be forcing yourself to finish them because they're just that good.\n\nI do believe the menu posted on the door was outdated, but a slice like that for $2.75 was well worth the money.\n\nI would highly recommend visiting Rosa's Pizza if you happen to be in Queens and in need of a snack or hefty meal."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VONy1nT0x0NHRyTnNBRRAB",
            "text": "Last night I bought baked manicotti.  The manicotti cheese inside the pasta was beginning to spoil, and the parmesan was clumpng and spoiled.\nUsually the manicotti is excellent.  I am very disappointed.  This was my go to place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPalBpcW13RRAB",
            "text": "Beautiful slices that are fresh baked, garlic knots are phenomenal and the service? no doubt in my mind that it’s the best in a 5 mile radius. you won’t regret it."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRMjd6VzdRRRAB",
            "text": "Good pizza good variety always fresh out of the oven awsome lunch , dinner spot always  crispy and ready no waiting. Come see and tate the finest pizza"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNUtqRll3EAE",
            "text": "Best pizza ever. Have been going for over 10+ years now, still my top choice. The sicilian and rigatoni slices are the way to go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeElmaE93EAE",
            "text": "Rosa’s Pizza is one of the best if not the best pizza place in the area. For any occasion, you can’t go wrong here!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjdC1MdUpBEAE",
            "text": "I lived in Ridgewood for 4 years and this was the spot to go to for pizza, if Rocky’s was closed (minitalia). Rosa’s has so many different options so if you love variety, this is the place. You can never go wrong with the plain but pasta,…"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdUsyQ0NREAE",
            "text": "Some of the best pizza in Queens. Constant turnover so everything is always fresh. Friendly staff, comfortable atmosphere. TV and plenty of seating."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOVHoxYzZwMUpmbjZBRRAB",
            "text": "Went after my mommy's funeral with our group, about 15 of us. The food was delicious n fast. 😋 definitely recommended it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMN2Q3LUZBEAE",
            "text": "My parents brought me here all the time as a child, starting in 1995. Love this place. It’s a must stop everytime I am in the neighborhood."
        }
    ],
    "reviews_count": 68
}