{
    "name": "Pupusas Ridgewood",
    "place_id": "ChIJRRxg9y5dwokRSeT-3Z1_cv8",
    "grid": "QN5",
    "address": "71-20 Fresh Pond Rd, Ridgewood, NY 11385, USA",
    "rating": 4.4,
    "user_ratings_total": 362,
    "phone_number": "(347) 599-0858",
    "reviews": [
        {
            "date": "22시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTVNsWjNaM2xaVG1oa2RsZFVWRUo0Y21GalYyYxAB",
            "text": "Mmmmm delishhhh! The chicken mole one was especially realllyyy good. The spinach one was good too.\nThey’re so nice! There’s space to sit outside, nowhere to sit inside.\nTwo pupusas were $11 and really filling. All have cheese. All are gluten free.\nThey also have desserts."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MFVIWjRlV1YyV2sxTFMweHRhbEZmY0UxbmNsRRAB",
            "text": "Very good pupusas.  Nice friendly service.  Seating in front of the store.   Variety of soft drinks."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaT1RYSk1Ta1U0VlcxSFdWQlVNWEE1UkdnMWMxRRAB",
            "text": "Very enjoyable meal at a good price. Fresh, HOT pupusas made with love in ridgewood. The staff was very nice and helpful with the options if we didn’t know what something was. All the pupusas were delicious but I recommend getting several meat options as the vegetarian ones tasted mostly the same. The flavor of cactus and blossoms is just not that strong in these pupusas. Great selection of beverages and daily specials. Will be back to try more."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSGVHeHJUekZFTkVwME5rOXdPRU5IZVRoSmFsRRAB",
            "text": "This place is great. Papusas are awesome"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5c2IxQkNZWFJDWTBKVFFuWnpkVzFJYzBkdVJIYxAB",
            "text": "He comido en este lugar varias veces, las pupusas, y las flautas de pollo son súper DELICIOSAS. Pero los tamales son MALÍSIMOS!!!! Está secos la\nMasa es insípida pero sin duda tendrían que poner atención en la cálida de los tamales y pagar $5 dólares por cada uno de ellos literalmente estás tirando esos cinco dólares a la basura. Conclusión no le recomiendo los tamales."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkd2JXaHdaVVZCY1VGMVUwODJhbk5HYjNCUlFXYxAB",
            "text": "So bomb. It’s really no frills, so don’t go expecting a fine dining service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWU5XbFFZMDlNZG0xcVUyaFdOVXgxVVdWNE4wRRAB",
            "text": "this place has become a go to spot. the revuelta pupusa is delicious and the prices are even better."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkZlRURldhblZ1Ym14MVJGaEhiWEl0TURkNmVXYxAB",
            "text": "Deliciosa comida un buen precio"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbGR5OUN3EAE",
            "text": "As a Salvadoran I would describe my experiences as unorganized. I asked for 4 mixed pupusas and 5 with cheese and beans, the problem was at the moment I ate them, I saw that all the pupusas were mixed and none of cheese and beans. This problem has happened to me twice, so I’m not buying there anymore.\nAlso, I’m not discriminating anyone, but I’ve noticed that employees and cookers at the restaurants are mostly Mexicans and none of them Salvadoran."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNGNGSmtNM05tVDJzeFoxZHJUV1JsTm5sNGVrRRAB",
            "text": "Best pupusas in Ridgewood, hands down. Guillermina, the owner, treats you like family and the food tastes like love. Tons of veggie/vegan options, fresh frescos, and every bite hits. Don’t sleep on this spot!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWlNWSllXRWhJVkZKeFlrNVBRVkpsYXpjd01WRRAB",
            "text": "Delicious and they're naturally gluten free. I have celiac disease and have had zero issues with any of the pupusas here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaMFF6TjNNbTFHUVZCWVMwSmljelpvVkUxVVQxRRAB",
            "text": "a really good dinner for $5.50. unheard of!!! many vegetarian pupusas also. I come here every week. undoubtedly the best place ever"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSU09FWXdkQzFFVDBOSlZ6RklXWGhyUjFkaFdsRRAB",
            "text": "Perfect late night spot for a good pupusa"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRFdtUlZjMlJsYldkcVZVcDBjRkpOVGxkMGVIYxAB",
            "text": "Yum yum! Delicious !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkamFFSmZWbTlsUkMxNU1EUXRlRlExTlRCMFNIYxAB",
            "text": "Great pupusas! Large portions great price"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcVgwUklVRTgyTmxrd1MyMDBaelZOZDFOT1ZsRRAB",
            "text": "Was not good at all they came soggy and with no flavor. I will not waste my money again and definitely not a place I will order from again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNE56UXlYekZHUTA5VGVXdEROMk01VEUxcU9VRRAB",
            "text": "They are the best pupusas outside of El Salvador that I’ve ever had.\n\nThe curtido is fantastic.\n\nPupusas are fresh, and super tasty. My favorites are the Pumpkin Flower and Huitlacoche. Great place if you’re a vegetarian, and the meat options are also fantastic.\n\nNow, they sell a really good horchata. And the large horchata is HUGE. A steal for 7 bucks (in NYC)."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOS1dxSVA1azVYT3RRRRAB",
            "text": "Super ricas"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUGE4N0xrbXB1WGJnEAE",
            "text": "Affordable and absolutely delicious. I dream of this meal each day ❤️ One of my best meals living in nyc. The tres leches cake was absolutely to die for. I loved the female presence in the shop too, such cool ladies."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJT0VyZkc3N2ZHY1hnEAE",
            "text": "Only one word to describe this restaurant DELICIOUS!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQSEt6SkxHNk8yX2JREAE",
            "text": "House made sauces, slaw, and tasty pupusas! I liked their revuelta, looking forward to try more. Lots of imported drinks too, as well as a non-pupusa menu."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNGJtRGhBRRAB",
            "text": "La persona que atiende a los clientes no sabe cómo  ser profesional y atender sin dar actitud."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNGVhcTl3RRAB",
            "text": "Food is good, but customer service is really bad. I requested 4 bags of cabbage lol the lady told me she could only give me 2. I said I paid extra and she charged me  $5 for cabbage. Robbing your customers won’t make you rich. Also for 6 pupusas u only entitled to 1 green sauce. She didn’t wanna give red sauce. Don’t recommend it. Run . Done being a regular customer."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvanM3bDBBRRAB",
            "text": "Lastima que no puede comer uno allí\nEs muy sabroso y buen precio"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNlBLTWFBEAE",
            "text": "Tasted fine,  but not worth the food poisoning"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJN3VYbEJnEAE",
            "text": "16 dolares port tres pupusas de sabor no estaban mal."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcU5QTWZREAE",
            "text": "The pupusas not good at all, I don't know y they offer pupusas they don't have no idea how to make it, they make pupusas like quesadillas  2 tortillas with cheese ,beans  and meat, nothing to do with pupusas rebueltas, i will never buy food from this place,"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3M3MzODd3RRAB",
            "text": "Amazing chicharron pupusa - the masa was so fresh and smelled great! The corn cookie tasted just like horchata - a bit overbaked but good flavor. Not a lot of searing outside this counter establishment but still worth it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bHVENVZnEAE",
            "text": "One of the best restaurants in the neighborhood."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMVliMkJnEAE",
            "text": "As a Salvadorian my self. I just had to leave a review. By far the BEST pupusas I had in a long time. As soon as I took a bite of the pupusa revuelta I teared up because it just reminded me so much of my childhood. I recommend that you come EAT HERE! I also had the pupusa de loroco and it was amazing. And the Chan was also amazing. Something I haven’t had in a long time !\n\nBest pupusas in all of 5 boroughs and Long Island !"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMEtxNU53EAE",
            "text": "Pupusas are huge but on the greasy side. Horchata is mexican not the morro one described from el salvador which was disappointing."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURna05QVWdRRRAB",
            "text": "Menos 5 estrellas pupusas crudas y aguadas nada que ver como una pupusa salvadoreña y aparte de eso no tiene para comer ai y otra cosa muy caras 5 dolares"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncXZpV3RRRRAB",
            "text": "— 5 estrellas Honestamente si pudiera darlas las doy con todo gusto es el peor lugar donde e consumido,\nprimero la persona q atiende pésima super grosera, contestaba de mala gana y trababa los ojos Segundo una hora esperando la comida y ella coqueteando no ponia atención se le confundían las ordesnes..!! Asi de escondido como esta se deveria de quedar y lo mas lamentable q son latinos y no deverian de ser asi..!! No lo recomiendo ni ahunq tengan mucha hambre señores 🤷🏻‍♀️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBalpLTktBEAE",
            "text": "My favorite place right now!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcGNTMEJnEAE",
            "text": "Must go delicious popusas. A+++"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbFBXY3dBRRAB",
            "text": "The absolute best pupusas I’ve ever had. They were cheesy, greasy, and just overall yummy. My fiance 🇸🇻 said these were incredible and authentic. 10/10!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmXzV6SkpREAE",
            "text": "Good food and affordable!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcktQUF9BRRAB",
            "text": "Good pupusas! CRAZYYYYYYY EXPENSIVE for 16 pupusas I paid $90"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OTVMSlRnEAE",
            "text": "Horrible food for the price. Not worth it. Went once… was disgusted.. went another just to give it another chance but was extremely disappointed once again. Quality is not there and cashier was nasty."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OV96VmhBRRAB",
            "text": "this food isn’t authentic, the people working the place aren’t even Salvadoran and as a native from there the pupusas are subpar at best and WAYY overpriced, this honestly is mostly all for show to attract recently moved folks instead. If you really want authentic food go to El Pulgarcito in Fulton(cash only) or El rincón salvadoreño in Jamaica. Or the last choice around here would be Bahia but don’t recommend as much as the other places."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dmYydnZRRRAB",
            "text": "Hands down the best"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OEp6S1ZREAE",
            "text": "my favorite local spot for breakfast that is good at any time of the day.\nyou can ask to mix any toppings."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQX1lIdmZBEAE",
            "text": "The food has always been good...for the price, but recent visit was totally different. Perhaps they should reconsider the angry,  nasty person taking orders in the front. Yelling, cursing and slamming around is definitely not the way to get repeat business.  Especially since the prices have increased by two dollars a pupusa from when they first opened. I do understand inflation but really for the quality this is no longer a good deal, especially considering the nasty attitude!!!\n\nAlso, be prepared to pay extra for everything. They give you one small tomato sauce 2 pupusas, ask for extra and get charged  $1. So it actually is $6/pupusa with tax and tomato sauce! Definitely not worth a nasty attitude!!!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdUkzRnl3RRAB",
            "text": "Pupusas here are delicious! I’ve been coming here for the last 4 years and it gets better and better. At first it was a hole in the wall for authentic pupusas, but now they have more delicious options - from breakfast to tortas to burritos + tacos its good all around. No frills, consistent spot. If you’re wondering the fav is the revuelta pupusa, 100% recommend overall. Come and enjoy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdFlQQ3VnRRAB",
            "text": "Very nice the attention the service very fast and food i personal experience deliciosas las pupusas i la mexcla de mexicanas the best"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeHVPNjF3RRAB",
            "text": "Sweet little hole in the wall spot for pupusas with vegan and gf options >> Great place to stop by for a quick bite"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuODZQYUtnEAE",
            "text": "The food is great, but I'm giving 1 star for the service and will explain why.\n\nOne day I ordered pupusas and wanted to pay with credit card, so the lady at the cash register took my card and swiped a few times. She told me the card didn't go through and that the internet service was down, so she asked if I could pay via cash and I agreed.\n\nLater when I got home, I see two charges on my credit card statement, which were the same charges that supposedly did not go through. So I basically paid for my order 3 times (two via credit card, and cash that I paid in person).\n\nI called that same day and explained the situation, they took my name, my number and said they would get back to me. Never did. I called the next day, explained the situation again, they said they would call back. Never did.\n\nI ended up having to call my credit card company to dispute the transactions. I am lucky enough to have the privilege to dispute the transactions but if I didn't have that luxury, or used debit, then I would've been screwed. It seems this business is simply OK with stealing money from their customers. That is not ok so I have to give 1 star.\n\nFood is great there. However if you're paying via their card system, be very careful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucnR6WDNBRRAB",
            "text": "The food is disappointing. I’ve eaten pupusas since I was a child and these have to be the worst I’ve purchased. The price isnt worth the quality. All my favorite spots are cheaper and more delicious. Nueva puerta del sol in sunset park is a better choice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOXMtSVlnEAE",
            "text": "Very bad service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIalliSk1nEAE",
            "text": "A sign outside says “aquí se cocina con amor” and you call tell!!!\n\nThis is a quaint take-out spot with generous outdoor seating.\n\nI ordered a variety of vegetarian pupusas—loroco, espinacas, frijol y queso, y jalapeño. My favorite was frijol y queso, though all of them were delicious. If you’re vegan, you can veganize your pupusa for a dollar.\n\n$5 per pupusa is more expensive than some places, but they are larger than most."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxa19xUUdBEAE",
            "text": "Heard from friends this was a must in the neighborhood. Got the bean and cheese, and spinach pupusas for a total of $9 after having trouble deciding between the many filling options. I didn’t expect there to be seating outside which made it even more of a special experience. The hot sauce on the side was great too. Service was quick and easy. I’ll be back to try more of the menu!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MGZQXzB3RRAB",
            "text": "This is literally  a hole in a wall, there is only space insde for 2 people, you can call ahead and place your order and they  have plenty  of seating space outside. Got the chicarron and chorizo and definitely the chorizo was my fave.…"
        },
        {
            "date": "1년 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydGJidmJBEAE",
            "text": "202406\nHorchata很好喝 pupusas我點了豬肉起司、雞肉、菠菜起司 我覺得肉比較驚艷 烤玉米也蠻好吃"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiaXJhRUNREAE",
            "text": "We order the frijol y queso and it’s soo delish, literally time travelled me back to El Salvador 🇸🇻 where we would buy steaming hot pupusa’s in boiling hot weather while mosquitoes were sipping on my blood. It’s also so filling! I suggest just getting your grimy hands in there and eating it up!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscGNMcXRnRRAB",
            "text": "They make the prettiest pupusas ever! Zucchini flower on top is so lovely and delicious. Service is amazing and friendly!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbUwzVFVBEAE",
            "text": "As a fan of Central American cuisine, I was ecstatic to discover this family-owned establishment Each pupusa is made fresh to order, ensuring the highest quality and taste.\n\nThe pupusas are perfectly cooked, with a crispy exterior and a soft, doughy center. They are generously filled and bursting with flavor. The side of curtido, a cabbage slaw, and tomato sauce complement the pupusas perfectly and add an extra layer of deliciousness.\n\nIf you're in the Ridgewood area and craving authentic Salvadorian cuisine, Pupusas Ridgewood should be at the top of your list. With their friendly service, delicious food, and affordable prices, it's a dining experience that is not to be missed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsN3JYOHJBRRAB",
            "text": "Beware!! FAKE SALVI FOOD!!\nAs a Salvadoran, I was excited when a pupusas spot opened so close to me. Sadly, utter disappointment. I am convinced that these are not actual Salvadorans, rather Mexican owned/operated. How? Most obvious, the Horchata. Strong cinnamon oatmeal taste, exactly as Mexi Horchata. NOT the same thing, shame on them for also selling this simple drink for a small at $4.00 Gentrified much?!? Now, if I only that was all but that was the least disappointing issue. Their tamal de elotes and tamal rojo aka sad version of a tamal de gallina, are surely cheap Goya frozen tamales. The kind u get at Stop n Shop. Nothing soft on the corn tamal. Literally a brick! U can pick it up and eat it as u would a candy bar but don't want to bc it has no flavor. Exact same with the chicken tamal. Extra no flavor!! I personally don't cook with salt but that poor tamal desperately needed some! It needed straight saline IV, that's how dehydrated that thing was. Another clue these are Mexicans, the \"crema\" that goes with the tamal de elote was literal sour cream, as Mexicans use on tacos. Salvi crema is TOTALLY different taste! Again, shameful!! Now the pupusas themselves. I will say, decent for an amateur which says a lot since they've been open for a few years at this point. The chicharon isn't even grinded down, it's chunks of pork. Seriously?! Cheese, definitely mozzarella. Not authentic either. But taste was tolerable at best for a Salvi American like myself. I'm sure gringos love them as they don't know better and not like there's anything to compare to nearby. But don't get me started on the red sauce! It's freaking orange 🍊 literally this color. Why? Bc they cheap out on ingredients. Taste, terrible and pupusas can't be enjoyed without the sauce. The curtido, sad. Just honestly sad. The amount they send is so small and authentic Salvi places send u a good amount of sauce and curtido always. Overall, they make me want to leave my work just to open up an AUTHENTIC Salvi place and make sure they either step up or go out of business bc it's shameful what they're selling and for the prices they're doing it for.\n\nAlso, they forgot a few items on my order. The delivery guy was soooo nice. They sent him to the wrong address bc the girl on the phone wrote it wrong. But after finding me, he said no worries, he'd go get my pricey Horchata and missing sauces. Had I known theyd be so bad, I would've saved him the trouble but nevertheless, his service was by far the best & ONLY high point of this order. The girl on the phone, she really tried to gaslight me that the address looks wrong and that's why she wrote it wrong. No girl! U read it wrong. Seamless has it written right in the system. You would think that as a courtesy they'd at least send me an upgrade Horchata but nope, she sent the small and not even full bc I asked for no ice. Cheap cheap cheap. Will never order again and better yet, order from Cecilia's instead. They may be pricey too but way better and authentic Salvi food. Also more options. I'm going to El Salvador Wednesday thank God, to rid me of this bad experience. Shame on this restaurant!! Fake Salvi food 10000%"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3amVLVHl3RRAB",
            "text": "It’s a take out spot with outdoor dining available only. The pupusas are always fresh and delicious. This time around I had two cheese pupusas to go and got so excited I forgot to take a photo of my food lol. But here are some other pics I took"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCOExudHlBRRAB",
            "text": "On my quest to try all top rated Ridgewood restaurants I landed at Pupusas. Really homey feel and small inside but big outdoor covered seating. Each pupusa is $4 now and they have so many filling options. I had spinach cheese and chicken mole and they were both delicious but the chicken mole was amazing. I took them to go and it took about 10-12 minutes to be ready"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaUtMd1l3EAE",
            "text": "Las pupusas son buenas pero se pasan de tacaños con la salsa!! Por dos pupusas dan un poquitito de salsa y las pupusas se acostumbran a comer con bastante salsa. No se puede disfrutar porque se queda uno sin salsa y sin curtido Antes de terminar. No sean tacaños! A cuatro dólares la pupusas les alcanza para dar salsa y curtido suficiente!!! No se pasen. Pedi seis pupusas y ahí está toda la salsa que incluyeron. Nombre."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5X3Jfd3Z3RRAB",
            "text": "First time here and the pupusa's here are one of the best I have experienced. The cashier was super nice. The pupusas taste and quality was perfect. It is at a great price as well. I highly recommend getting the queso y Loroco."
        },
        {
            "date": "수정일: 3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteGMtZjRRRRAB",
            "text": "Ordene 6 pupusas y una horchata grande. La señora que me atendió me dijo que se demorará 40 minutos en llegar la comida. Una hora y media después llamo a preguntar donde esta mi orden y me dicen que acaba de salir y que les de 30 minutos. Otra hora pasa y vuelvo a llamar. Primero me dicen que la comida fue entregada. Después me dicen que la orden fue rechazada. Nadien sabia lo que pasaba con la comida. Después la persona encarga del delivery me llama un poco frustado a decir que la comida fue rechazada. Nose quien la rechazo pero no fui yo. Le explico al señor del delivery que a mi nadien me llamo por teléfono o me toco el timbre. Es un edificio de 3 diferentes apartamentos. Como los vecinos van a saber lo que la otra persona ordena. Bueno despues de 2 horas y 40 minutos mi comida llega todo fria. Las pupusas un poco quemadas. 😒☹️."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdHJuSi1RRRAB",
            "text": "Best pupusas I’ve had! The cheese pull on the loroco y queso was amazing! The staff is very friendly."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLMzk2QXlRRRAB",
            "text": "Okay, so this cute little hole in the wall has everything you need. I don't care what you think you need, if it isn't these pupusas, you don't understand yourself.\n\nCheese is cheese, you know it's good. Bean and cheese is a staple, and yeah, they've got that. But when you get into the loroco flower pupusas, you know you're on another level.\n\nThey have a variety of drinks, but if you're like me, horchata is the only one I have eyes for. That said the tamarind is pretty bangin too.\n\nThe music playing is top notch and overall, if you're not eating here, get your life together and make it happen."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhd0tHdzBBRRAB",
            "text": "Popped in for a quick bite. Bean & cheese pupusa was proper. Absolutely delicious. Great way to spend $3."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5eU5iV2RREAE",
            "text": "Pupusa's are the El Salvadorian equivalent of  Mexican tacos. Clean, fresh, and simply delicious food. Great spot! 👍👍…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbzUtRFhnEAE",
            "text": "Delicious pupusas and great assortment options! I had both the chorizo and revueltas, they were both delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGZzVYWEVBEAE",
            "text": "I went for an easy and simple pupusa with zucchini and cheese.I was left impressed, definitely coming back to try more!!⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OU5XNGZnEAE",
            "text": "What a great little place to eat! Very fair prices and excellent quality of food and services!! Highly recommend. Workers are smiling and in a good mood always!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcU1LVzVnRRAB",
            "text": "Very delicious papusas, great option for lunch or dinner. If I go for lunch I usually get one papusa and it comes with the spicy vinegar slaw and is the perfect amount of food and for an affordable price. Love this place and have been going here a few years and always enjoy it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMelpuSWpBRRAB",
            "text": "This is a great location for Spanish food. The food was okay. I've had better pupusas. The customer service experience was good. The seating area outside was not kept well, and there were too many flies."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidnNlc2tBRRAB",
            "text": "The pupusas were absolutely delicious. The masa was perfectly cooked with a slightly crispy exterior and a soft, flavorful interior. I tried the cheese, pork, and loroco pupusas, and each one was a delight. The cheese pupusa was gooey and rich, the pork was tender and savory, and the loroco added a unique, floral flavor that was simply!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6LU5XNHhRRRAB",
            "text": "The pupusas are incredible, gluten-free, and the kind woman taking my order was very knowledgeable about celiac needs, even knowing about which spices might contain flour. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydDhPZzhnRRAB",
            "text": "Eat outside or take it with you. The food quality is great and the amount of food for your buck is a very good value. Don't set aside the hot sauce and slaw that comes with the pupusas. The horchata and frescas are also very good on a hot summer afternoon."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1bG9MbVZ3EAE",
            "text": "It's a homey place. Two people don't really fit inside. They're very attentive and quick. I've ordered several times online and I am absolutely in love with it as well as my boyfriend. The best pupusas that I've eaten.  They do an outdoor seating but my boyfriend and I didn't decide to eat outside because it was swarmed with mosquitoes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxZzl5cm93RRAB",
            "text": "This place looks nice and cozy and the lady who took my order was nice and all but later I notice while the girl in the kitchen was preparing the food her nasty self kept licking her fingers. I mean come on. How disgusting is that? You're handling food and you're licking your fingers? That is not sanitary. People like that shouldn't be working in the kitchen. Most disgusting thing I've seen. Beware-Buy at your own risk!"
        }
    ],
    "reviews_count": 76
}