{
    "name": "Jungly",
    "place_id": "ChIJHVUQrqhZwokRiXgdrEbrqQ4",
    "grid": "QN1",
    "address": "12-23 Jackson Ave, Long Island City, NY 11101, USA",
    "rating": 4.4,
    "user_ratings_total": 252,
    "phone_number": "(718) 440-9456",
    "reviews": [
        {
            "date": "23시간 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KR01WaE9jVUZvUjJkeWQyTXlZMnBCWkV0dlkwRRAB",
            "text": "It’s a strange and disappointing experience in this restaurant since they have rich and flowery discrimination in the website, we took reservations by thinking will not get a table once we were there only tow tables were full including ours hehe and only one guy is there he was doing everything, receptionist, bartender and server it’s crazy whom we supposed to blame now.despite the guy is nice and made some nice cocktails. This happens most of restaurants in New York? I don’t much here normally I never really go to restaurants where you have to make reservations. Let me know"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SlJ6SlJjVGRyT0ZrMlZHcHZUREJwVDFVNE4yYxAB",
            "text": "I went on halloween and they made everyone wait an hour despite having tickets. It looked like they let children inside. I would not come back here if they paid me. Also why were there only two bartenders for the event they sold out for children??"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWE5HYzJXbXhrVVUxcVJrYzFPRW8wYVU1MGNFRRAB",
            "text": "Terrible organizers!\nThe Halloween party was a complete disaster. They oversold tickets, and we had to wait in an incredibly long line for over 40 minutes until more people left before we could get in.\nThey're supposed to have an estimate of the number of people allowed and shouldn't sell more tickets. We bought our tickets two weeks ago, and we still had to wait almost an hour to get in!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMGJEUkhibmhxU2xkTFZsWk5XRm95Um5CQ1prRRAB",
            "text": "This event was extremely disappointing. They promised a big Halloween party, but it was nothing like that. The DJ was terrible, the security staff had a very bad attitude, and it was completely disorganized. It looked like they oversold tickets because there were a lot of people outside waiting to get in — even though we already had tickets!\n\nMy friends and I had to wait around 30 minutes in a line that barely moved, and they wouldn’t let anyone in unless others left. That’s unacceptable when you’ve paid for tickets in advance. Overall, it was a really bad experience and a waste of money. Definitely not recommended."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMVNrNDVlVWxIVkVzNVIwNWpURGhVYzJoUWNIYxAB",
            "text": "Terrible dj for Halloween, was supposed to have dj ram and they didn’t. Mad young head like 18yr old vibes just jumping around. Wackkkkk vibes"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sU1VtOVdaMWRxV0d0NFlWSnVaalppVVVjdFJHYxAB",
            "text": "Was promised a certain dj they didn’t come. It was highly unorganized two stalls were broken. Lights kept coming on and off. 18 year old kids"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjd2R6UXRRbEpKYkVOU01raGtORmhzUlZkbGEwRRAB",
            "text": "I had a very disappointing experience here. To start, I made a reservation but was left standing for about 20–30 minutes before anyone greeted or seated me — and that was only after I asked for help. For context, if there had been a line, I’d understand, but I was literally the only person waiting. I had planned an intimate night with my girlfriend and even called the day before to arrange something special. I spoke with, I believe, the owner, who was friendly and open to the idea of me having flowers delivered there beforehand.\n\nWhat I didn’t appreciate, however, was the complete lack of communication about a Comic Con after-party happening that night, which took over the entire space. While I understand the importance of events and bringing in business, a simple heads-up would have gone a long way. We would have gladly chosen another night if we had known — it felt misleading and inconsiderate.\n\nAs for the food, we ordered truffle fries, fried calamari, wings, and salmon. The wings and fries were decent (about a 6.5/10), but the calamari and salmon tasted low-quality and clearly frozen. To make matters worse, we had to deal with flies landing on our food, which completely ruined the experience.\n\nThe only positive note was our server, Jorge, who was friendly, attentive, and seemed to be doing his best despite being the only one managing the front of house.\n\nOverall, poor communication, lack of organization, and low-quality food made for a very disappointing night. I truly hope management takes this feedback seriously, because with some honesty and better preparation, this could have been a great experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNmExUnhVamRHU3pKeFUxbHlMWE5qTkROQlNFRRAB",
            "text": "Great for any family type! Get there SANGRIA ! TRUST ME IT IS SO GOOD AND GETS YOU RIGHT! The places looks amazing tooo"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdmVrSTJUVk5FWlRONWJXOXdaak0xWkRWVE4zYxAB",
            "text": "As someone in the neighborhood we've passed by this place so many times wondering why it's empty. After trying it now I really wonder why it's empty. The food we got was incredible, the service and the drinks as well.  Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWGNsY3hZbTlUTTNWM00wRk5ZamhWWjFJemIzYxAB",
            "text": "We had a great time at happy hour with amazing drinks.  We would return in the future."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdU1UVkRUMWMxWDNKdWJHZFBZVzUxT0dwdFZXYxAB",
            "text": "This service was absolutely subpar. I am so disappointed. I came here to celebrate my bestfriends birthday and the food was terrible! Everyone at the table was very disappointed with their meal. I initially wanted to order the Jackson Steak and the waiter looked me dead in my face and said he only had two steaks left ( the people prior to me ordered steaks) so i was left to settle for something else. Mind you, it’s 6pm in a Saturday. My friend ordered her steak med well. They brought her steak out medium! When she asked for them to cook it a little longer they burnt the top and the middle was still medium 😒. The food lacked salt and seasoning. Rasta Pasta was nasty, chicken fried rice was nasty, chicken and waffles were nasty the chicken parm was nasty. Just ugh I’m pissed and disappointed. Do better!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WVdtbEtVRzl0YWtoMVYwMDBRekk0U0ZkU1JVRRAB",
            "text": "I came here with family and friends for my sisters birthday. The inside is physically nice, but the food was so trash. Everyone who ordered food disliked their food. I had the Jungly Fried Rice. 0/10. No flavor. The service was ok, but not the best."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMGVGTTJNbVZ1YVdkaGRUQXhXbEZWWDJVeWNHYxAB",
            "text": "Beautiful interior design, great music selection, great drinks, food variety can improve but still very tasty. Unfortunately, this place is never packed. Great if you don’t like crowds but terrible for their business. If you’re a Queens Native, or LIC resident, add this to your third place options! ~NYC Native"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MllYVm1UMlJWUVVocFRXVXhXbEJ6Y0hNeWRYYxAB",
            "text": "they don’t honor their happy hour pricing, the waitress said it’s not on Sundays even though the menu said 4-10pm on Sundays lol then said just not THIS Sunday - I think it’s a ploy to get people through the door. but it’s a good vibe, just wish you knew how much you were paying before you get blindsided by the bill"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNWRHa3lOVWd6WTBkS2NsZEVSVk41YURaM0xWRRAB",
            "text": "Always amazing, consistantly one of the best spots in the city"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeVRXcEJhMDV3UzBwNVgwSkhOVlF3Ykd0blEyYxAB",
            "text": "Went there for a private event and the food was ok but nothing really special for the price that you pay for. Drinks were also a little pricey but the 2 drinks that I wanted to try were missing ingredients. Cute little bartender girl with the glasses can make any drink delicious, but the other guy totally messed up a drink and had to send it back and his second drink was still off. Ok place overall"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCU1drMVFYMUoxZUY5ME9GUTVkbVJEUW1kMlEzYxAB",
            "text": "Un lugar maravilloso, buena música buen ambiente nos atendió a mi y amigas el mesero Luciano muy amable y nos dio un buen servicio 100 ✨️ la comida estaba muy rica volvería otra vez"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VFdFUnVTRFZOV2xCeVJEaFdSWFpvWHpsNE9HYxAB",
            "text": "amazing place i go on thursday usually for the special prices are great staff is amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Zd1dtcDRRMVJPVTJaVU1IazNUWE5tTWxkUllYYxAB",
            "text": "Nice place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPN0EtTVBicF9MMzlnRRAB",
            "text": "I wanted to love Jungly in Long Island City, but it just didn’t hit for me. The food wasn’t that great and the service was pretty underwhelming. The vibes felt kind of off too. Just not the experience I was expecting. Probably wouldn’t go back. 6/10."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJVG9xZnpicjlHWll3EAE",
            "text": "I’m amazed by the service and the quality of the food !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLeUk5LUtVdFBuVnh3RRAB",
            "text": "Nia was great! And so was kat!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLWluSTNRdnVHRElnEAE",
            "text": "Nia gave great service and was professional…."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNYm1zYVdfZ016eXh3RRAB",
            "text": "Nia is an amazing and attentive server! Food is amazing! I look forward to returning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbTNyNTJJdWI3cFZREAE",
            "text": "The food was amazing and the atmosphere was friendly.  Nia was pleasant and has an upbeat personality."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLVzRqcGFLZ3Nlc2pBRRAB",
            "text": "Quick service, everyone is so nice, Nia is so much fun and loved that she helped me figure out what drink to get!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOajF0OEc2NEthaEJREAE",
            "text": "Nia was soooo sweet and the beer and shot combo is elite"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdmcySW4tamRpUG9BRRAB",
            "text": "Will be back again. Nia is so amazing"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNWJESEJ3EAE",
            "text": "Went in optimistic a few times, but the vibes are just off. On multiple occasions, we’ve gotten a couple of identical drinks, only for them to be made completely differently: different glasses, different pours, different garnishes. Went to a private party and we were limited to well drinks only despite no prior communication of that restriction. As a more upscale spot, we were looking forward to using the opportunity to try some of Jungly’s specialty drinks and get a flavor for the spot. Why would we pay a hefty flat fee to get the same beverages you can get at a college bar?\n\nThe decore is attractive and has been carefully designed, but there’s far too much light for any sort of ambiance. It feels more like a wedding or mixed event space than an intimate lounge where you might want to get food and drinks with a bunch of friends.\n\nOn top of that, on one occasion the bathroom absolutely reeked of urine despite being outwardly clean, as if a botched plumbing job was letting in sewer gasses. It might have just been a temporary issue that day, but it did not aid impressions.\n\nThe servers have always been nice, the bartenders friendly and reasonably quick, and the space has always been clean, But overall, feels like there’s too much style over substance."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdW9hTnZ3RRAB",
            "text": "Music was a little loud for myself but the place was nice food was good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbmVYaWJBEAE",
            "text": "“lackluster” is a great word to describe just about every part of this restaurant. The servers need to go through a training on how to be attentive - we sat with glasses empty for almost 10 minutes, no water or anything, and throughout the ordering process the server paid more attention to his handheld than he did to us. it was almost as if he had never been to dinner or served anyone before. We could have had 3 rounds of drinks but only had one because they never came back around to see if we wanted anything.\nQueens is known for its food and our meal was midtown manhattan quality at best. everything lacked flavor and depth. three dishes came out and then the fourth dish came out late and it was incorrect, and then we had to ask the server 15 minutes later if the correct dish was going to come out, to which he replied with using his handheld to prove that he had ordered the correct dish. who cares!! just go get the right one!!\nwe were there for Trivia (which was enjoyable although it had some internet issues), and when we asked for our bill there was a 20% auto gratuity even though we were not a party of 6. I am totally fine with an auto grat - what i am NOT fine with is not telling customers that there is an automatic gratuity added and THEN the handheld prompts for an additional gratuity to be added. This means the average unobservant person is over tipping for poor service. if it sounds like a scam and smells like a scam, ITS A SCAM.\na lot of potential for this place but i’ll be going to trivia elsewhere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJekppTC1BRRAB",
            "text": "Went with my friend and they kicked us out at 11 pm when they close at 1 am??????"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NHN5SmtnRRAB",
            "text": "Excellent food and great ambience!\nWe went for a bday party and they were welcoming with our baby."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NDVYc2t3RRAB",
            "text": "Awesome service and food. Celebrated my bday here as well. Great catering"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dzRfRVBnEAE",
            "text": "I went to Jungly about a month ago (Feb 23) for trivia night. After my team ended up winning first place we went to claim our gift certificate. The first red flag was when the manager confirmed \"$50 gift certificate, correct?\". The trivia host explicitly said that first place prize was a $75 gift certificate so we corrected the manager. I provided my email address so he could send my gift certificate. After a week and no gift certificate I called and was told that they'd get back to me the following week. After no communication, I realized that they were giving me the runaround and never intended to award my prize.\n\nI contacted the NYC Trivia League and was told that others have had issues in receiving their prize from Jungly as well.\n\nNever ever go to this bar for any reason! If they're unwilling to award a measly $75 gift certificate for trivia what other dishonesty are they capable of?!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcHVXekx3EAE",
            "text": "Food is 🔥"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncDVPT1dBEAE",
            "text": "Hey,\nRestaurants in your area are getting hammered with complaints about pricing and service.\nThat means customers are looking for a better option—you.\nIf you know why they’re leaving competitors, you can win them over—without spending more on ads.\nI’ve got a free AI tool that shows you exactly how. Want the link?\nBest,\nMatt"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMDhEc2d3RRAB",
            "text": "Great food and very nice staff. I highly recommend this place!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndkwtMHV3RRAB",
            "text": "The food is A+++"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNma3VLTXZRRRAB",
            "text": "Beautiful environment to chill and vibe with the girly"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bmJxOEJBEAE",
            "text": "Walked in happy and walked out gay. Best decision ever"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bmVyRnpnRRAB",
            "text": "Fantastic service and atmosphere. The staff is very friendly. I highly recommend it if you're looking for a fun night out with friends."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bmVyRVBBEAE",
            "text": "phenomenal vibes, drinks are YUM, food was delishhhhh, this is the spotttttt"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MkxQdWdBRRAB",
            "text": "It's okay"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MV9QWVh3EAE",
            "text": "What an AMAZING hidden gem in Queens!! The staff, the food, and atmosphere were TOP NOTCH!! We had a party here and it was such an incredible experience! I HIGHLY recommend this spot"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M09pdG1RRRAB",
            "text": "Great Decor, Delicious Food, and Huge Potential\n\nThis restaurant has fantastic decor and so much potential to become a standout spot in Long Island City. The food is consistently great, and the service is attentive and friendly. Plus, the seating is incredibly comfortable—something that’s surprisingly hard to find in the neighborhood (if you are looking to hang for a bit). There’s really no other place around that combines such high-quality seating, beautiful decor, good food, and great drinks.\n\nHowever, it feels like they’re missing an opportunity to lean into what makes them unique. The loud, repetitive music detracts from the otherwise great vibe—it’s hard for a table of four to hold a conversation without shouting. Lowering the volume and offering some variety in the playlist would make it much more inviting.\n\nThis could also be the spot in LIC to watch sports in a lounge-like atmosphere. With their TVs, good bites, and solid drink menu, they’re perfectly positioned for it—but blasting music makes it less appealing (could play game sound during big local games!). Creating a chill, upscale vibe for sports fans with comfortable seating and quality drinks could set them apart in a neighborhood that doesn’t currently have anything like it. Every other place is dark/dank.\n\nWe love coming here and truly believe that with a few tweaks, this place could become a favorite for locals and visitors alike. Looking forward to seeing it thrive!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcWM2ZzRBRRAB",
            "text": "A lot of high stars in the reviews and we decided to check it out based on the hype. Went for brunch and would not recommend this for brunch to anyone. The pancakes were like plastic, not good. All the food on the table lacked flavor with the best thing being.... The fries..\nDrinks were good. Service was slow which sucks given there were only 3 tables in the whole restaurant.\nAtmosphere is great ... They'll need to turn this around and definitely fix the menu."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcnVudkVnEAE",
            "text": "Came here for brunch party of 3. Honestly I don’t think I’d be coming back. The pancakes were absolutely disgusting, it tasted like Silicone  rubber or something. I’m not sure who’s in charge of the dishes/menu but that one HAS to come off the menu. The breakfast burrito was good but definitely lacked flavor including the side salad that comes with it. My friend didn’t like her burger very much but the French fries were good. The bottomless brunch we had mimosa and Bellini, the drink itself were good however, when you do bottomless it’s expected to keep the drinks coming not waiting periods of time constantly asking for a refill. The restaurant was super dead. Is unfortunate because it can come off being nick picking but this was our honest experience & feelings. The place has potential for sure, maybe needs a new location too although I hear it’s a fairly new opening time will tell."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaV8tR1V3EAE",
            "text": "Awesome place...had my birthday party here and the staff was tremendously catering to our needs ..would highly recommend!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdXF6UG5RRRAB",
            "text": "We celebrated my birthday at Jungly and the food was amazing. We had a makhani pasta and my kid loved it. Jungly fries was too notch. Cocktails are good as well. Ambience is good  and a must visit fusion restaurant in LIC area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURILVlMajFBRRAB",
            "text": "Enjoyed this lovely place, we explored it on our trip towards queens. This was an amazing place, beautiful aesthetic, great range of food options. To our surprise we got Vegetarian options (eggless). The shinning star of our meal was SALAD✅\n\nGreat service team. Thank you for serving us with delicious food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwd0lHYmtnRRAB",
            "text": "My twin sister and I recently went here for our 31st birthday dinner with family and the experience was great!!!! The food, drinks, atmosphere. I mean Just 10/10! The manager Jay was the sweetest and went above and beyond to make sure me and my sister were satisfied and then some!  I can’t thank y’all enough! It feels great to be serviced properly and professionally. I had a great time! Please don’t change!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMGRiX1RREAE",
            "text": "This is the spot to be in LIC, great for Happy Hours or just a work meetup. It’s very spacious and great ambiance. I heard their house cocktails were really good , so we tried a few. Food seemed a bit average but the drinks really made up for the place. Service was amazing , super fast."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMWNQZjVBRRAB",
            "text": "2/23 first visit. had dinner and celebrated a birthday with a friend. As you enter you’re greeted by Jackie with a very friendly and welcoming smile. Everything about this restaurant was great and you will be enjoy it! Our waitress Almeida (sorry if I didn’t spell it correctly) was wonderful. Live DJ music starts around 8pm and Cameron’s music selection is awesome. Had a funtastic time and must return and recommend 👍"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbnRLRTd3RRAB",
            "text": "Very modern, minimal and classy vibes at Jungly. There is a ton of space we came for my buddies birthday dinner. The steak and Brussels sprouts were amazing. The drinks were fun and strong."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleHZXLU5nEAE",
            "text": "This has been a rather popular location in the neighborhood - Jungly did a nice job in reshaping it with some young vibes. The cuisines are flavorful and overall service quality is nice. Recommend a visit. P.S. This place seems to be newly renovated so there’s still some smell when first come in."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bzlmdkVnEAE",
            "text": "This is a really fun nice bar. Excellent decor. They were so warm the first time I walked by, inviting me in and talking with me, but I had other places to be. I returned last weekend after a MoMa event, and sat for several beers. I didn't eat. The bartenders are cool, especially the Asian man with long hair, really friendly. Definitely going back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleS1lTkNBEAE",
            "text": "Let’s start with the 4.9 star reviews. This place had a soft launch with friends and family a couple of days ago and I assume they are the ones giving out 5 stars.\n\nThis review is purely constructive criticism. My partner and I came here for dinner for the first time. The drinks were okay, the ambience was really nice (loved the music), the decor is really nice too( the table for two are a little too small but we managed well) and the staff is super nice and friendly.\n\nThe two stars I’m giving is due to the food. We ordered the octopus ( extremely dry and chewy), the corn fritters (almost burnt), the beet carpaccio was more like a salad and the pappardelle lacked flavor.\nLiving in this neighborhood and having visited almost every restaurant, for the prices this place is charging I would recommend going to R40 or Bellwether, you’ll be eating quality food for the same price.\n\nAll I can hope is that the owners read this review and really consider investing more in the food. I would love to come back and have a better gastronomic experience. I really love the ambience and LIC was missing a place like this one but the food is really disappointing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENDl6YVl3EAE",
            "text": "Do not recommend this restaurant for brunch what so ever. Came here for brunch being that social media hyped it up as an amazing brunch spot but it honestly it isn’t.  It’s a beautiful restaurant don’t get me wrong decor is immaculate but the brunch menu and the food served for brunch is just not it.  It was honestly a waste of a brunch date and money.  Very bland basic pancakes for $20 sticky thick syrup, & basic cheese & eggs burrito salsa on side.  I didn’t even bother having a drink being that i was so disappointed with their small brunch menu and lack of flavor.  I suggest they get more creative and add more egg dishes and brunch dishes or just not offer brunch at that point very misleading."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNTlfUjNBRRAB",
            "text": "What a lovely spot! Love the ambience (nice relaxing latin music) and decor. Very sleek and clean. Great specials during the week on food and drinks. Food was delicious and staff was super friendly I will be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaLXN1a2pBRRAB",
            "text": "Always a good time at Jungly. I love their comedy nights show. The drinks and service is amazing too. I highly recommend stopping in when you are in Long Island City."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlN2NEOVlBEAE",
            "text": "New place on the block! Went around 6 pm when they opened and the place filled up pretty fast. Imagining this as hang out clubby spot later at night. Menu is perfectly balanced - various options to choose from but not super extensive. Tried…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcHJxZEdBEAE",
            "text": "I had my daughter’s 30th birthday party there and everything was amazing! Everyone had a great time. I give the food, the place, music, service and everything else a Triple 5-star!!! The management was so organized and professional. I would do another party there!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaGR1ZUpBEAE",
            "text": "Get the octopus appetizer! Very refreshing. Tried both chowders great for fall. Very filling. Big cocktail menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGa292cFJREAE",
            "text": "One of the best experiences I’ve had in a long time. Food was delicious also the drinks are to die for! The Manager Justin was phenomenal! You must make you way to Jungly ASAP!  FYI locals get a discount."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6OXRldHZBRRAB",
            "text": "I wish the new owners all the luck for success. But as it is now, there’s a lot of issues, which other reviewers have noted. First, though the place was basically empty, it still took them a good twenty minutes to come around and get our drinks orders. After that, it took another twenty minutes before we got our drinks. Remember, this place was almost entirely empty. Second, many things were not available even though they are on the menu. For example, the biryani were not available for dine in, only take out. Also many drinks like beers were not available. So we ordered what they have available. Halfway through the dinner, the manager (I think) came over and apologized that the biryani were not available for dine in, only for take out. So I said to place a goat biryani for take out so after dinner we can take it home to eat tomorrow. Ok. When dinner was finished and the bill came, the order for the goat biryani was not placed. So there’s a lot of issues to work out before I will ever consider returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSXzd6YkF3EAE",
            "text": "After eyeing Jungly restaurant for a while, my partner and I finally decided to give it a try, and we're so glad we did. We were initially hesitant due to the perception that it was pricy American food, but we had heard that they had lowered their prices, so we gave it a chance.\n\nWe ordered the steak and eggs, Szechuan chicken, and waffle, and were pleased with the taste and the price. Although the Szechuan chicken wasn't quite authentic in flavor, it was still delicious, and the waffle had a great Asian fusion twist. The space was also very spacious, and we were able to get seated for brunch without any wait time.\n\nOverall, we had a great experience at Jungly and hope that they get more business, now that they've lowered their prices."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MXB1SThRRRAB",
            "text": "The decor by itself is amazing not to mention their happy hour specials and a great taco Tuesday"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSLUs3UEdnEAE",
            "text": "Amazing cocktails and super friendly bartenders! All cocktails are super creative and great quality. They have new menu every few months!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ODV5SGhnRRAB",
            "text": "Jungly is a very innovative restaurant, always finding new ways to not only serve us food but provide entertainment. From live music to movie nights. Their food is so great and their cocktails are amazing (ask for jungly juice 😏) and their crème brûlée 🫠🫠 wow 🧑‍🍳💋. This is my official go to restaurant for family outings or even to bring visitors 🥰🥰🥰"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldDRxcDZRRRAB",
            "text": "This is a great restaurant to go to with great interiors , great food and great vibes -(tonight they had a  live band).  Loved the fresh pizza and the pasta. The entrees were great too. Have dined before and steak was amazing.\nUpscale and classy. Great service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dTdPeFdBEAE",
            "text": "Best vibes and best happy hour in LIC. the staff goes above and beyond, management is always involved and friendly. I was skeptical about their Taco Tuesday because I am picky with my tacos but they definitely surprised me! They also do such an amazing job being involved in the community and have great pop ups."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoM2ZDNHlBRRAB",
            "text": "Live Band. Sunday Brunch. We had an awesome experience. Drinks and food, great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaODl1TlRREAE",
            "text": "The food was really good. Go on a Thursday night or Sundays, cuz they have game day, all day happy hour for some food and drinks.\n$5 tap beers and $10 margaritas.\nService was up and above!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdE4tQjZ3RRAB",
            "text": "The food is really good! You should really come for their wing Wednesdays. They have different flavor wings and if you like spicy they have a level of spices now! The drinks are great and they are great listeners when it comes to your likes/dislikes for drinks. The best part of this spot is they’re very welcoming and they make you want to come back! Definitely should check this place out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZ2EyTHd3RRAB",
            "text": "This whole place was a breath of fresh air. From the staff to the food, everything was marvelous. Rasta Pasta was amazing and the margaritas out of this world."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycFpDNEZREAE",
            "text": "I always go on their $1 wings Wednesdays where happy hours is all night and I love the food the drinks will have you smiling all night!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSc0pPX0dREAE",
            "text": "Really nice place, food is good and fresh. Service is really good, atmosphere is warm."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbU9yTlNnEAE",
            "text": "Made reservations for a large party of 35 adults. There was only 1 waiter for our entire party and the same bartender for the entire restaurant. Seems like they were in desperate need of more help.\n\nWe had a prefixed menu of food choices. The appetizers were delicious. We had a calamari, salad, and pizza. The wings were a bit tough to chew. For dinner  only the guests who choose salmon or the other option of steak enjoyed their food. The burgers, chicken and waffles were not tasty to us. The tartufo ice cream was also delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaXZUVmtBRRAB",
            "text": "Jungly had me the moment I walked in the door. The decor was chic and excellently curated. Food, Music, service, and overall vibes were amazing! Jungly staff and team were very welcoming and shout out to the GM, Robert who made me and my bestie feel super comfortable and welcome. Would recommend and def going back."
        }
    ],
    "reviews_count": 80
}