{
    "name": "The Grand",
    "place_id": "ChIJGTRAZT9fwokR5nDN7FxwiKI",
    "grid": "QN1",
    "address": "37-01 30th Ave., Astoria, NY 11103, USA",
    "rating": 4.1,
    "user_ratings_total": 1625,
    "phone_number": "(718) 806-1504",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdWNEaFBXbGRaU3pkS1gybFVZM2hhUjJKNGVIYxAB",
            "text": "Katerina exceptional customer service love her as my beautiful attendant"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVGFYZzJRMTlsWWxjMmNVNU1ZbnBhY0VVeVVrRRAB",
            "text": "Go-to brunch spot in Astoria. Great food, prices, and service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUFpqbG9jVjlVY0dWMk1WaGZRbTB6WDFCblRFRRAB",
            "text": "Hostesses sat us right away, we waited 15 min to be acknowledged by our waitress, waters came 5 minutes after that, by the time we gave our order we had been there about 20 minutes. Food came before the drinks, food runner was nice and accommodating as we were told utensils were coming twice by our waitress and they did not. Shrimp was undercooked and gave me a stomach ache, eggs were ordered over medium and were very runny, potato’s were dry and had no salt. Took 15 more minutes to be able to pay. Better restaurants and fast casual spots in the area with better service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdGMzcFNURzF6UkdoMFlXMVdiRUZFZFhCNWExRRAB",
            "text": "Suggested this place to a group of eight friends for coffee and dessert after we had dinner in the neighborhood. It was a Friday night and there was a DJ blasting club music. A bit loud to have a group conversation without screaming across the table and it was too cold to sit in the outside area. The waitress gave us menus but did not inform us that the coffee bar had run out of coffee until she came  back to our table when we were ready to give our orders. We were utterly shocked that a coffee bar did not have any coffee or latte. We were too tired to go to another cafe. Some of us asked for hot chocolate and we were told that the guy who handles the coffee bar had already left for the night. So they could not serve us hot chocolate 🤷‍♂️ My order of calamari and cheesecake was okay. The ambiance was the main reason I suggested the place but it was embarrassing when we could not order what we went there for; coffee and latte."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ack5XWldYekpKWDI1UGExbzNSeTE2T1ZkVWJFRRAB",
            "text": "We totally LOVED STEPHANIE!!! She was amazing. It was a pleasure dinning in at THE GRAND…"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xac2RYSnViMkpqYTFCSVRFSXdUbmswV0ZCRWJVRRAB",
            "text": "This place has gone downhill completely.\nI’ve given The Grand in Astoria three chances recently, and every time was worse than the last.\n\nThey don’t even carry basic glass-bottled water like San Pellegrino or Perrier — only cheap plastic bottles. The manager is rude and unprofessional. Last summer I came with a friend recovering from throat surgery who couldn’t speak, and he actually approached her about smoking — completely inappropriate and unnecessary.\n\nThe second time, our waitress made us wait over 10 minutes for menus while she joked around with someone. It was freezing outside, and even though we ordered a bottle, they refused to turn on the heaters.\n\nToday, same story — cold, wet weather, and they again refused to turn the heating on, with a disrespectful attitude.\n\nThis place used to be great before the pandemic, but now the service, staff, and atmosphere have all gone downhill. Save your money and go somewhere else."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsU2EwSkZiRTB6VXpaalpYY3hUWEo0Y1ZSTE1VRRAB",
            "text": "Stephaney was an  amazing Server 10 out of 10 will definitely be asking for her again"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMlV6TkpTRXR3VkdwaGNrazVaVTQyUTFGT04wRRAB",
            "text": "The place has nice decor as it caught our eye from the outside. We got the Salmon wrap which comes with a salad and the Halloumi Chicken sandwich which comes with fries. Very simple but delicious dishes."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeldXMTJhM1ZpYjNaNVEzbGZlV2xCUjJWRVVGRRAB",
            "text": "The food was amazing, the bubbly as in Mimosa or Bellini was amazing. However, the other drinks for the bottomless was not it ,"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSVlUWmhOakowWW1kTU0wNVFhWEUxWkdzek1uYxAB",
            "text": "Loved the food but the service is lacking. The bottomless drinks were not that great just get a full priced drink unless you like bubbly drinks."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dFRHZElWVkZNT1c1RVNVOXJZbTVXUVVRelMwRRAB",
            "text": "It seems like a fun place! But after eating and drinking here, it seems like a very mediocre restaurant. The prices are too high for the very average food and cocktail selection."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGM1VVeFlSVEZ0ZDJ0eU0zSTBWbVZ4UzNrMWQxRRAB",
            "text": "The food had no taste,the waiter was ignorant and in a bad mood.The only good thing was the cheese cake and the cookie with the ice cream."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWmJYSm1XQzB3UjJGcVgzWjVTRmMzTm5FNWNHYxAB",
            "text": "The servis so slow(the waitteers) doesnt understand good english.The music so high volume.So heat inside(no good AC).To much noise"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTFFsTXRka2xGTTFsQ2FVbEpiVVJEWkhwWWRHYxAB",
            "text": "I ordered a beer after 15 minutes and the waitress who wasn't there came and served only a drink to my girlfriend. We ordered another type of beer. I waited another 15 minutes. Total 30 minutes for 1 bottle of beer. The place has no…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWc09FOUZXa056Y210S2JXazJNWFZZY0hwaWNFRRAB",
            "text": "Our waitress had the most horrible attitude, all the time responding with sarcasm like she doesn’t want to work that day, the food was cold, we even expressed our dissatisfaction with a manager but they really didn't do much to fix the situation."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sa05EY3dZV3hVVWpoVE5USlJlVWhCTTBab1JHYxAB",
            "text": "Place is nice, spacious, with fun vibes. However,  the service was HORRIBLE. I don’t write reviews but this will be my first review EVER. So I dined in, ordered my meal, paid, and gave a tip I thought the server deserved. But since it wasn’t what the server expected, she got upset, and questioned why I was giving that amount. First of all, a tip is optional, it’s a “suggested amount”. Second, having a nasty attitude is unacceptable in the hospitality world, considering she never checked on me once. When I got up to use the rest room, I had to walk by her, and heard her talking about it to her male coworker at the register. Don’t know her name and not trying to stereotype. But she was Latina, tall, curvy, had somewhat of an accent, with a ponytail. I would never back off that experience alone!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUVNEUTROMnBTTW1KYVYzSktjRGRGYlcwNVFWRRAB",
            "text": "Overpriced, $8 for small capuccino"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xObk1WSTRMVmRZTFVsME1rc3pReTFTVTBSb1VIYxAB",
            "text": "Greatly decorated. The service was slowest I've ever seen.  Waited 15 minutes for someone's to take our order.  Waited another 45 for steak and eggs that was super flat steak and super basic. Def not a ny strip like they say on the menu.  There are diners better in the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pka1dXeG5VM1ZaYUVoWkxXMXBjVTB5UmpWSFYxRRAB",
            "text": "Customer service and food were outstanding !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMlRFZE9WMU5tVUVvMFN6Y3plRVF3Y1dvNFlsRRAB",
            "text": "I had such a wonderful breakfast experience at The Grand! From the moment we sat down, our server Ruby made us feel welcomed… She was incredibly kind, attentive, and made sure everything was perfect throughout our meal.\n\nThe food was pretty amazing :) The eggs were cooked perfectly and the potatoes were seasoned just right. The Eggs Benedict was also good. The hollandaise sauce was pretty flavorful, paired well with the spinach and ham. We also enjoyed fresh mimosas that made the perfect touch to our meal.\n\nOn top of that, the atmosphere is gorgeous; charming decor, lively yet relaxed vibe, and a setting that makes dining here feel special.\n\nIf you’re looking for a place in Astoria with delicious food, friendly service, and a vibrant atmosphere, I can’t recommend The Grand enough. A big thank you to Ruby for making our morning so enjoyable! We’ll definitely be back! :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MWFuRnFVek4yVUV4RFdWQk1NMWhtZDFKWFRHYxAB",
            "text": "The Grand is always a great vibe, whether you go in the early morning, afternoon, or for dinner. I highly recommend this place. The staff is nice, the decor is nice, and the food is delicious! Their coffee is pretty good, and their espresso martini is great! They have a DJ playing tunes on weekends which really sets the mood. Great date spot!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWUxUaE1Oa1pPVFc1b00zcGhWVlJzWDJsQ1NFRRAB",
            "text": "Ruby una  excelente mesera gracias por tu atención"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGelFWSkpTelpSTmxFeFVubE1kRmhaT0RGNFdFRRAB",
            "text": "Great place to chat and spend quality time. Ruby our server was the best. She nicely explained the menu and was very nice and friendly. Will definitely go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMFEwWXRSMWMwVFdkdVNHTjBSblZQTlhRMVExRRAB",
            "text": "Amazing experience❤️ food and cocktails extremely good 💃"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabGFXMUVTMmd5UjFkdkxXaEpTRUZHZEZCTExVRRAB",
            "text": "ruby was the highlight of the day. she made me and my group feel so welcomed and special. next time i come here I’m requesting my special queen ruby. also get the eggs benedict it was yummilicous"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STVRXMTZUVUo2VkRGaVpsQkpkWFJzTnpaeFgxRRAB",
            "text": "Good food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25salFVeExWa1IzWWxOd1YzaEVjRmRyUTBNelJuYxAB",
            "text": "Come here for a great night of drinks, good portions in their food plates but I come here for drinks mostly!\n\nDjs on the weekend and great cocktails 👍👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aZmVGSXhOM2wxUkU5VFNrdElRM3BYWWtOR1dWRRAB",
            "text": "Throughout 2025, the Grand has proven itself to be consistently on top of what they consider to be the best for their crowd, and they have out deemed themselves! Everytime I come back to the Grand, it seems they have added something new, better, and maintains the same upbeat vibe I know and love the restaurant for. Their staff, such as Martina and Alisia, keep interpersonal relationships with their guests and make me feel extremely welcome every. single. time I am there. Thank you to every worker here for creating a welcoming ambiance that makes me a consistent guest and to the amazing food and cocktails that never disappoint!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRE1VOUtWMUJxZVcxWmEweExZbFJEWVhWSk5WRRAB",
            "text": "I’ve been to the Grand many times now and have always enjoyed the food and service. Ruby was my server and she was very attentive, friendly and upbeat."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVGVVeFdMV2hSTUc5VVYyUk5lVkYxZFRRd1JYYxAB",
            "text": "The food was delicious.. I really enjoyed it, the Mac and cheese 🧀 balls were yumm .. the chicken and waffles 🧇 were delicious .. drinks were meh ..but overall we will eat there again !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxb1NsQnlUbkJYVG5CbE4yRjVRelpYYTA1Tk1tYxAB",
            "text": "Very overpriced for mediocre food. We ordered two Mediterranean scrambles (pretty good) and avocado toast. The avocado toast was one tiny piece of toast (barely toasted) for $18!! When we were laughing about the value and asked the waiter he said it was an appetizer, but it was listed on the regular brunch menu along with breakfast entrees. We also ordered two iced green teas which tasted like watered down Arizona iced tea for $7.50 each. I wanted to like this place, but it’s truly not worth the value and would only recommend for happy hour."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWVUzWnNWekZKZFZGdGNscERaRkpVWVVacVpuYxAB",
            "text": "This was my second time there in 2 months. Both times the food was tepid and the home fries were ice cold. The food must be pre made as it's served with 10 minutes, if not less, from the time it was ordered."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVWNUaDJTWEJhWWxCTU9ISjRWMll5V2kxR1RHYxAB",
            "text": "Great spot! The atmosphere here is perfect — lively without being overwhelming. The bartenders know their craft and made some of the best cocktails I’ve had in the area. Drinks were balanced, strong, and came out quickly.\n\nThe staff was friendly, attentive, and made us feel welcome right away. Music and vibe were on point, making it a great place to hang out with friends or start a night out. Prices were fair for the quality, and the overall experience felt well worth it.\n\nDefinitely a bar I’ll be coming back to and recommending to others."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMk1XMWhkbUoxVlU4eFkwMWllV0ZxWjFCVk5sRRAB",
            "text": "Service takes very long to approach to table.  We were sitting for 10 minutes before they came to give our menus and to guce us water took another 10 minutes.\n\nThey do not prioritize the clients. The staff were in the back chatting and management doesn't seem to care ."
        },
        {
            "date": "2달 전",
            "language": "el",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwQldYTk5WR1JNUm5KdVZrNU1RbnBsZDE5UmJIYxAB",
            "text": "Πολύ ωραίο μαγαζί, φιλική ατμόσφαιρα και τα παιδιά όλα ευγενικά και πρόθυμα."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSalpFeE5OMVZZV1dSQ1NWTnFUVEJVYTBsQ1RsRRAB",
            "text": "I was a regular customer for many years. It was my favorite place in Astoria. Then quality of food changed. I recently visited The Grand Cafe and was very happy. Service was great and the drinks & food were delicious. I recommend the Lychee Lady, White Peach Sangria, the Guac Salad and Crispy Calamari. I look forward to being a regular customer again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SFZrOVBOR1ZvVjBKM2EwOUxSelJMVUdwU1dWRRAB",
            "text": "Beautiful decor, good service and delicious food!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVlVrdEtXbkEzWld4a01XWnhibkphVlRCd1QzYxAB",
            "text": "We had such a nice experience at The Grand. The food and service were both amazing! The manager, Alisia was so welcoming and hospitable. I can’t wait to go back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSE1qVkVhMDFqZVRFMWJIRTJZME5TV0VweVVHYxAB",
            "text": "The Grand is a great place to have a pleasant breakfast and early lunch! Coming by around opening hours to have a cozy and chill atmosphere to do work on the computer is quite nice as they keep the music a medium level. On some mid-late afternoons, getting a drink by the bar with my friends is a vibe since the bartender is attentive and makes the drinks really well and refreshing! One of the bartenders, Martina is welcoming and friendly to the customers; she is also pretty engaging and makes sure we have our food and drinks and what we need!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRFkyRkxjSEZTUWsxNlZrWndPV1JHVFhwWE9VRRAB",
            "text": "Love The Grand—such a fun spot with great drinks and good energy. Elizabeth is the best behind the bar! Super friendly, quick, and always makes the night better. Definitely grab a seat at the bar and let her take care of you!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNWFrMURlRmQyWXpGbFVteHBOa294UVc1ck4wRRAB",
            "text": "Elizabeth is the best !!! Amazing drinks and amazing service I will definitely be back again to see her ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25acVZubHJkVU56WTBJdFp5MHpORkZqVjFsUFpWRRAB",
            "text": "Elizabeth is a fantastic bartender!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cVdVaEdOazh6VUZCWFduQmpZemRoVTE5S1FrRRAB",
            "text": "Elizabeth made my experience at The Grand very enjoyable. Excellent drinks and great conversation. Music could be a little better. Love when they have a DJ! Order the espresso martinis!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReE0yNUhaM1I2VVZwVmMzcDFhMVF4UldkMWJrRRAB",
            "text": "Had a great time here, bartender Elizabeth was the best! Drinks were so good and she was so nice and fun to talk to"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMk1rMHRTVmhYY1U5NU9HNXdObWRhU1U5clkyYxAB",
            "text": "I came in for a dinner with family and the vibe of the restaurant was amazing. They have a lot of different options, service was great, and food didn't take long. I felt very taken of and my server, Martina, was super nice and accommodating. They have a dj during the weekend which created a nice ambiance. Overall 10/10, the place itself was decorated very nicely and neat."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvM1JESTFPRmxwT0RCMWRFVnJjV1Z5TVdWbGRFRRAB",
            "text": "Amazing space to hang out and grab something to eat with friends! Food was amazing, drinks were even better!! Martina was my server and she was the best!! Couldn’t have asked for a more caring and genuine waitress."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NU1URTJXRzVmZWs1MGIxRXdOREJDVUhNNVMzYxAB",
            "text": "Hands down, one of the best dining experiences I’ve had — all thanks to our incredible server!\n\nI think my servers name was Lisa or Isa, not too sure but she was super sweet!! It’s rare to find someone who makes you feel like a VIP without overdoing it — just the perfect balance of professionalism and warmth. The food and cocktails were fantastic, but the service is what will bring me back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScFZWSnFUV3N4TlZOeFduTmhTelF5VEVjNVZXYxAB",
            "text": "I cannot express enough, how great the experience is at Grand! The food is delicious, the atmosphere is great and the service even better. Everyone on the Staff team is always so kind, honest and attentive. I always jump at the opportunity to be seated in Luisa's section - she is my number one server! Thank you guys!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeU5FdFZibU5vYXpKRU5XVldiVzVaZEVJek9YYxAB",
            "text": "Had brunch at the Grand a few weeks ago, and the experience was outstanding. The vibe is chill and lots of options on the menu. The service was top notch, our waitress Isa was very kind, sweet and very patient with everyone she also made food recommendation and was very attentive. Will be back for sure, and already made recommendation to friends and family."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR1JFMVpabnBCVkc5eldVRjBUMkZDYlRVNE1sRRAB",
            "text": "From the moment we walked into The Grand in Astoria, we knew we were in for something special. The ambiance is  inviting, striking the perfect balance between upscale and comfortable. Whether you’re out for a date night, brunch with friends, or just treating yourself, this place delivers on all fronts.\n\nBut what truly elevated our experience was our incredible server, Isa. Attentive, warm, and genuinely passionate about the menu, Isa guided us through the evening with top-tier professionalism and charm. She made thoughtful recommendations (which turned out to be spot on!) and checked in just enough to make us feel taken care of without ever being overbearing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQM2o5NlBDZ1kzdjZRRRAB",
            "text": "We had a great time at The Grand in Astoria! We tried the pasta, wings, and mashed potatoes, and everything was absolutely delicious. The pasta was rich and flavorful, the wings were crispy on the outside and juicy on the inside, and the mashed potatoes were creamy and perfectly seasoned. Easily one of the best meals we’ve had in a while.\n\nThe staff was very friendly and attentive which made the experience even more enjoyable.\n\nThe only downside was the wait time. It took much longer than expected for the food to come out after we ordered. That was a bit frustrating but once the food arrived it was worth the wait.\n\nIf you’re not in a rush and want a solid meal with great service, I’d definitely recommend The Grand. We’ll be back for sure!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VldrMHlkR1pMVkhkUVZIazFWMFJNTlROT2MyYxAB",
            "text": "July 2. 2025 I haven’t been here for some time. I came today for brunch. It’s everything I expected and Stephanie the waitress was the best.She made everything even more enjoyable and pleasant. Her smile, and personality  lights up the environment. 😀\nMattie"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cVp1S1VnEAE",
            "text": "girl's night @thegrandnyc was such a blast! we really enjoyed the dj while we were there. great vibes for sure!!\n\nft:\n-aperol spritz\n-espresso martini\n-moscow mule\n-shirley temple\n-pineapple express\n-salmon with quinoa and salad: LOVED IT. the top of the salmon was so crispy and salty while the rest of the salmon was soft and flakey. the quinoa and salad was perfectly complimented the salmon.\n-steak: super tender, cooked perfectly. the mashed potatoes were divine.\n-penne alla vodka: great sauce, had a good amount of chicken, and was so delicious\n\nwe really loved the plating and aesthetic of all the foods, drinks, and ambiance\n\n📍The Grand\n37-01 30th Ave., Astoria, NY 11103\n\nfollow @rebeccatakesnyc for more nyc content!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeVZsaDBUelJ1Tm5SRGRIZzJRazV2VFZCd1VGRRAB",
            "text": "La comida deliciosa pero pudo estar mejor, las bebidas si estaban increíbles!! El lugar es muy bonito, amplio y fresco para este horrible calor del verano, a los amantes de las mesas en exterior este restaurante es una buena opción!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeU9xQWV3EAE",
            "text": "The grand is a great breakfast spot 5 star at that . I was seated immediately, the waiter came and took my order and checked up numerous times . I had a cappuccino which was great , chicken and waffles were also great , the chicken was well seasoned and crispy . The ambience was nice , menu was easy to understand. I will definitely return ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZX29mX3hRRRAB",
            "text": "The atmosphere is good, nicely decorated, loud tolerable music but the service is absolutely disgusting. We were sitting right in front of the hostess stand and every time we tried to call for one of the servers or wave them they would just walk the other way. We had to wait over 40 minutes for a fork. The food was absolutely mid, worse than mid. My friend had to return her chicken and waffles cause it smelled and was soggy. The bread, you could use as a brick. I got Eggs Benedict and the muffin was soggy and cold. The spinach was blanched and bland not crispy or fresh. The whole dish was just cold. For the price and all, never returning and wasting my time again. To think I traveled over 1.5 hours for this is unbelievable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcWNsaG5iMnRDTm5GcU0zWjJZWFJQZEdObmRuYxAB",
            "text": "I had such a great experience at The Grand! The vibe is friendly and inviting, perfect for any occasion, whether you’re out with friends or celebrating something special. The staff is warm, attentive, and truly go out of their way to make you feel welcome.\n\nIsa, our server, was absolutely amazing! She was kind, professional, and completely on top of everything. Her recommendations were spot-on, and all of our food came out hot and right on time, which made the whole experience even better.\n\nHighly recommend The Grand, the food, drinks, and ambiance were all fantastic. I’ll definitely be coming back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLW8zeDdBRRAB",
            "text": "The food wasn’t good and the service even worst!\nThe servers act like they really don’t care about you.\nWe ordered some appetizers and then some sandwiches and rice bowls as main course. We change the table because one of my friends wants to watch the soccer game, no one let the runner know and he was walking around with our food 🤦🏼‍♀️ We had to call him!!\nAlso the food came almost at the same time ! We didn’t have time to eat the appetizer. We let the waitress know and the answer was “ yes I know “\nFinally we asked for the check and our server sent her co-worker to charge us 🤷🏼‍♀️ I’m not sure if she doesn’t want to attend us at all or she was having a bad day 🧐 .\nI ordered the steak sandwich, the mushrooms inside were cold and the French fries under cook for the price $30 you can definitely find something better !!\nThe only good thing was the rice bowl."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvb3EzdGhRRRAB",
            "text": "The cappuccino was good but the crepes i didn’t like it much . They were thick. . Also the server didn't ask if we needed anything else. I like to be honest with my reviews."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRc3RIWjl3RRAB",
            "text": "Had an amazing boozy brunch at The Grand in Astoria with two of my girlfriends! 🥂 The vibe is gorgeous, with both indoor and outdoor seating options, and the floral decor adds such a lovely touch 🌸. We had a great time sipping on drinks 🍹 (which were strong) and enjoying some delicious food 🍽️. Standout dishes for me were the Mac and Cheese balls – a must-try! 🧀 The Nutella pancakes and Berrilicious waffles were the perfect sweet treat to balance everything out 🍫🧇. We ended with the homemade tiramisu, which was the perfect finish 🍰.  Perfect spot for a fun brunch, just be ready for the cost! Highly recommend!\n\nMy favorite items (in order):\n🧀Mac and cheese balls\n☕ Tiramisu\n☕Ice Brown Sugar Freddo Espresso\n🍞French Toast Bites\n🍯Iced Honey Oat Latte\n🥞Nutella pancakes\n🧇Berrilicois waffles\n🍳Skillet baked eggs\n🥚Eggs Benedict\n🍸Lychee lady\n☕Espresso martini\n🍍Pineapple express\n🧇Chicken and Waffles"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Zk1tWmpOazlWY0hoVFZHODFhVVZOZVdGNVpFRRAB",
            "text": "Went out for dinner with friends and we had a reserved table, so there was no wait to be seated.  Ordered the Rigatoni Bolognese with 2 glasses of Pino Grigio and it did not disappoint! Great service, great ambience, and definitely can’t wait to go back and try out the Brunch menu. :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeDZmWXhRRRAB",
            "text": "My first impression about this restaurant is that it is very large and they have a very nice decoration. From the moment we arrived the attention was good and fast.\nI suggest that if you want to go with a large group of people it is better to make a reservation because although the restaurant is large, many people will come to eat.\nIt's my turn to have the brunch menu. If you are celiac, the truth is that it is not a very extensive menu. But I suggest the eggs with cheese and homemade potatoes, they are very good. The salads we ordered were accompanied with meat and chicken as an extra.\nThe food has good flavor and good size. The prices are not excessive and the size of the dishes is worth it. I hope to return to this restaurant to try the lunch menu, which they start serving I think at 4-5 in the afternoon.\n\nI give the food 4 stars because it would be perfect to have more gluten free options."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMFYwZDRVWEpPTVRGWFRHMXBVRWxuUWpoTlZIYxAB",
            "text": "I had dinner at the grand and it was a really good experience. Our server, Isa, was friendly and helpful. She made sure our drinks were full, our food came out hot and everything was right!! The whole staff was friendly and accommodating of any requests we had. We will definitely be back soon and we’ll make sure Isa is our server."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNV92U2lnRRAB",
            "text": "5*!\nBefore the food even arrived, we were already pleased with how fast and attentively the staff greeted, seated us, and took our order. The lighting, music, and environment make this an ideal spot for getting together with friends or significant others for a good time, food, and drinks! We had the nachos, salmon, lemon chicken, and chocolate chip cookie skillet, and they were all amazing! Price is great for the quality and quantity (I almost didn't finish my chicken). We'll be back, and this is an easy recommendation for us."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNGVETjBWVkk1WTJNeVVHTnhaRWRhYjIxc01HYxAB",
            "text": "Recently came for brunch with my dad and I ordered Eggs Benedict and my dad ordered Chicken and Waffles. I liked that there were different options for the Eggs Benedict! I also ordered a Freddo Cappuccino. The food overall was very delicious but what I enjoyed the most was the ambiance of the restaurant. The service is what sold me the most. Often times when I go to a restaurant the waiter/waitress is there to just take my order and go about their day but my waitress, Stephanie, gave off such a welcoming and caring energy. It all started when I walked in as well with the hostess welcoming us in and being so high spirited. I highly recommend The Grand for a great food and drink spot in Astoria."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfd05MQjdBRRAB",
            "text": "Great food, great service, great atmosphere! I walk past this restaurant all the time and wanted to try it and I was not disappointed. We had the Smoke n S’mores frozen drinks and it was top notch. Chocolatey and smooth. The lemon chicken was great as well. Would definitely come back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOUlDVFFREAE",
            "text": "The food was pretty good but I’d say a tad bit too overpriced. Though the food does come in pretty big portions. The atmosphere is lovely but it’s very noisy and loud as it was brunch hour when I went. I’d go back though, probably just at a later time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdnFtX0hREAE",
            "text": "I had the 12 oz. Prime N.Y. Strip Steak ($41) which I ordered medium, but it was served well done. It was served sliced, and had virtually no taste. The waitress recommended the mashed potatoes which I found to be without any taste. My food rating, one star, is based on this dining experience only."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMC1mRDdnRRAB",
            "text": "“This was my second time at The Grand, and once again, it did not disappoint! The food is absolutely delicious, especially the French toast bites, which are a must-try. The decor is stylish, and the atmosphere is warm and inviting, making it the perfect spot for a great meal. I’ll definitely be back!”"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6ODZLYlV3EAE",
            "text": "Great food, staff and atmosphere! The food was delicious and the birthday cake was yummy.!  Lauren the waitress was on point and very attentive. I will definitely come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUck9PSS1RRRAB",
            "text": "Hosted my mom’s 50th birthday brunch this month at The Grand. We had such a great experience! Thanasi was so helpful and communicative from the moment I reached out to inquire about having the event here until the day of! The entire staff was so attentive and went above and beyond to make my mom’s birthday celebration a success! Our servers were absolutely amazing and so accommodating. They even saved us the top of my mom’s cake for us, which was so thoughtful. We had a pretty large group and I know things can get crazy but everything went so smoothly! Definitely recommend hosting an event here and I know we will be back soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeVl5bW9nRRAB",
            "text": "My third time coming here and this time I did not go without taking pictures!! Lol. The Grand is an amazing restaurant to go to, for brunch or lunch. They are busy but we had no wait time. The atmosphere is nice. The decor is gorgeous! Went with my kiddos for brunch and it was all delicious plus kids loved it too so that’s good. Definitely recommend having brunch here! PS: I have also tried their lattes here before and that was delicious!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbGRmdndRRRAB",
            "text": "The food here hits every time, definitely check out the Haloumi Chicken sandwich with a side of sweet potato fries, you'll thank me later! The atmosphere at The Grand is cozy and elegant. The brunch here is one of the best in the city especially when the music and drinks are flowing. Also, you'll find that they have the best coffee Queens , Manolis the coffee expert and the entire staff treat you like family as soon as you walk in and you end up spending hours just enjoying the whole experience. Now this is my daily coffee spot which is made to perfection every time! Go check them out you wont regret it!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbWMyVFFnEAE",
            "text": "Food was Devine! We had the Halloumi chicken sandwich and the cheese was soooo good with grilled chicken! Also tried the Grand Chick a Boom and that was really good if you’re in the mood for fried chicken the sauce they had on it really elevated the sandwich to a different level. Drinks were also great! Highly recommend for a group or even cute date! Only thing was missing was some Greek music to go with the scenery!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZzRPVDZnRRAB",
            "text": "This place was very…underwhelming. I wanted to love it because a friend of mine had a baby shower here and the service was so good I wanted to come back.\n\nThis time I came with friends for a friday brunch. We were sat right away but it took them about 20 minutes to get our appetizer and drink order after asking twice for our server. It also wasn’t particularly busy either. We ordered unlimited mimosos, $25 for 90 mins and the glasses are huge. So that was a good deal however, it took another 20 minutes for them to come back to place our entre order.\n\nI ordered a simple breakfast with scrambled eggs and potatoes with a side of avocado. The avocado came out first by itself and while everyone else had their order, I still didnt have the rest of mine. Then the waitress comes to ask how our food is as if avocado was the only thing I ordered.\n\nThe food was ok. The place is cute. It looks like its family owned. There isnt a lot of culture in there so be ware. And we finished of with ice cream and a warm cookie, which was also just ok."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoS2REYzRlSEYyYjFZdGN6ZzNXbmhQZDNOU1RVRRAB",
            "text": "I had such a great experience at The Grand in Astoria — and a huge part of that was thanks to Isa!! She was so attentive, friendly, and made the whole vibe feel welcoming and smooth from start to finish. You can tell she really cares about her guests and enjoys what she does. Service was fast, drinks were on point, and her energy was just A1. Definitely ask for her if you go — she’ll take amazing care of you!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcVl1VHl3RRAB",
            "text": "The ambiance is good, but the loud music inside makes it hard to have a conversation. I ordered the lemon chicken, which was overly seasoned with salt, and my friend ordered the pasta, which tasted bland. Overall, the experience was disappointing and could use some improvement in both food and atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSE5reGhRVzk2ZUVOc01EZGlUemx2UWpjME5YYxAB",
            "text": "I really enjoy my time at Grand — it has such a great vibe! The staff are always super friendly, and shout-out to Isa who was absolutely awesome last night. I used to just pop in for a coffee to go (which is always top-notch), but the drinks here are even better! This spot has officially become a staple hangout for me and my friends. Can’t wait to come back! 🙌☕🍸"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMzRLaGFREAE",
            "text": "Visit to the grand was phenomenal due to the atmosphere and the people just enjoying a nice weekend brunch. The place was packed and socializing was in effect. The grand gives you the feel of what you would expect on a brunch. The food…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMWNxejNnRRAB",
            "text": "Beautiful place, the food was delicious 🤤 and the drinks were good 😊, good place to just relax , the service was not great. The bathroom was dirty and smelly ."
        }
    ],
    "reviews_count": 80
}