{
    "name": "Jora",
    "place_id": "ChIJMRDMWiRZwokRclRF5GXOLKM",
    "grid": "QN1",
    "address": "47-46 11th St, Long Island City, NY 11101, USA",
    "rating": 4.5,
    "user_ratings_total": 2004,
    "phone_number": "(718) 392-2033",
    "reviews": [
        {
            "date": "1시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTVYwbEJYM0U1ZDNOSWRHaHNaRlEwY1VGcE5XYxAB",
            "text": "We had a delightful Sunday lunch at this restaurant. We ordered almost everything on the entrée menu, and it was absolutely delicious. The portions could have been a bit larger, but overall, it was a perfect spot for a group gathering."
        },
        {
            "date": "18시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVmJtWXdabXQ2Y21oMldEZHROa3RLZUc5TWRrRRAB",
            "text": "Have eaten here several times and absolutely love this place. Not a single bad appetizer or entree. Pisco drinks are so, so good and very strong! Servers are always warm and friendly. Never had a bad meal here.\n\nSo why only 4/5 stars you ask?\n\nJORA, I AM BEGGING YOU, PLEASE BRING BACK THE MATCHA LAVA CAKE 😭 I was genuinely so sad to see it taken off the menu and the other desserts, while delicious, simply do not compare. A lot of restaurants use matcha in their desserts but don't have actual matcha flavor. The matcha lava cake at Jora was not only perfectly cooked, but had such a nice matcha, strong flavor to it that every bite made it better and better.\n\nPlease bring it back 🥺"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pob1NFaG9TV2c0UWtVeWJuWlRWbWhaTWxwalUzYxAB",
            "text": "Food was okay. Terrible service. Won’t be back."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTlRUWkJZMlJzU2twWU1UZzBUMGc0WWpGNGMzYxAB",
            "text": "My favorite place ❤️ tha food is amazing"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSFZtWllRMDFtVDI1MVlqbGtaSEJYVDFCSFRGRRAB",
            "text": "Delicioua food and nice place"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbVZsZHZWRmRGVFRaSGFtaFZiSEpWVW5aT2FXYxAB",
            "text": "The service was great everyone was on top of everything never had a empty cup of water or drink. Food was delicious specially the empanadas, cant wait to return"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OZlFYQkJaMnRTYUZWM2FVbExWbEZFWjA5WExWRRAB",
            "text": "Excelente restaurante peruano en Queens!\nFuimos a las 4 un martes y no estaban disponibles los main dishes pero los appetizers estaban espectaculares. El servicio también fue muy bueno y los meseros muy amables."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGYU5VeE9aalYxY0c1UVdrSkliMnhOYW10WE1WRRAB",
            "text": "Really great!!"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwdFV6RkRabkZyZVZJeFZWTklhblJHYzBkclZsRRAB",
            "text": "Es uno de mis lugares favoritos, la comida es deliciosa y la atención de cada uno es excelente, se preocupan por tu bienestar y buena experiencia en el lugar, los cócteles, la comida y el ambiente es 100% recomendado, el chef Javi y el manager Miguel están allí para brindarte la mejor experiencia! Gracias♥️👌🏼👏"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTGRtZFJkblpLU2s1ZmIyUlpVVk55ZFVSa1JGRRAB",
            "text": "Unique flavors that taste familiar yet different.  All the presentation of the food was beautiful."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214V05VNVVRa1o0YVhaSVdFdHdaSFZaV0haalgyYxAB",
            "text": "Fantastic food. Very tasteful. Great ceviches."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xU2R6RkZTVXhsUlVoWlVVNDBSbTVUUjFVeFlsRRAB",
            "text": "Used to work in LIC and came here semi regularly.  Great cocktails, great service, great food! If you haven’t tried this place, please treat yourself!!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5LTltWWhnRRAB",
            "text": "The best Cebiches in Queens.\nThey also serve a great Lomo Saltado and fantastic Aji de Gallina. Try also the Seco de Carne with beans. These are the dishes that will bring you back in Peru if you ever went there.\nAlthough only on Sundays they serve the Arroz con pato, it was not even close to the real deal, so I wouldn't ask for that again, but everything else is fantastic.\nFor desert try the Lucuma panacotta. Simply delicious!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWFJpMDVObFJETURWb1oybDBjRGhUVFZFMFdrRRAB",
            "text": "Brought a group and ordered like half the menu. Everything was fantastic!"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnM1NUWXlZMnRhZVd4MlpVWkNaR05rU1haQldIYxAB",
            "text": "Les recomiendo la Panacota de Lucuma🤤…"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbmJrbFhiRE5QZUdad1NrWnZZMXBvTVdaaE1tYxAB",
            "text": "been there when it has been a bit slow, overall good however the service a bit slow although it was not busy, the drinks/food are mid.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcmQwSTJaSEp1Y25obGVrNHpOVEpoU2pCNllWRRAB",
            "text": "We celebrated a friend’s birthday at Jora and the experience was outstanding from the very beginning. I made a last-minute reservation for a large group of 15 people, and even so, the manager Raúl was extremely kind, attentive, and professional. He handled everything through emails and phone calls, and thanks to him, we were all seated together at one large table, which was truly amazing.\n\nThe food was delicious, the cocktails excellent, and the desserts outstanding. The service was top-notch: our waiter was always attentive and made sure we felt well taken care of throughout the evening.\n\nA very special thanks to Raúl for his dedication and hospitality, and also to our waiter for his patience and kindness. We will definitely be back and I highly recommend this restaurant 100%."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVNWFUWXhabGR1YVdwWWFXZGZNbnBVYjJFNU5IYxAB",
            "text": "We came with high expectations for this restaurant, but unfortunately, it fell short. The menu is quite limited, so I’d recommend reviewing it in advance to ensure it meets your preferences. While the food quality was decent, the portion sizes were small relative to the high prices. If you’re in search of truly authentic Peruvian cuisine, this may not be the best fit."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWlJrY3pTbVpVVkd4Q1NEbG9RWE5DVFhCelVHYxAB",
            "text": "Jora is a fantastic Peruvian restaurant! I absolutely loved the food, the service, and the atmosphere. Everything was excellent, highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc2FWWk1OelIyY2pWYU1GcGxVSGhQTFdvNVNGRRAB",
            "text": "Delicious food and very friendly waiter and attentive. I choose the shrimp causa, it was amazing presentation and so delicious. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dVNVUTRZekpmUms5cmNUSnBSVGxZVFVGeU1YYxAB",
            "text": "Un sitio INCREIBLE para disfrutar de la mejor comida peruana. Además el personal es encantador, sobretodo la camarera que nos atendió. Recomendadisímo."
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1clptb3ljVWhKT0RKU1RXOWpXbGRLV25KZlIwRRAB",
            "text": "Une merveille !!! Aussi bon qu'au Pérou et même révisé pour les USA.\n\nBravo et vive la cuisine péruvienne ♡"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Jd1MzTjNkemgxTmpaaFdIRnJTREpWVkUxMFVXYxAB",
            "text": "The food here looks as good as it tastes. Their design creates the right atmosphere. The bill adds up, but prix fixe options are better value. The team members are notably pleasant. I willingly endorse service performed this well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OR1dtWk1RemR6UlU5bFlXWXdSMVJYZDFoTVEwRRAB",
            "text": "The food was delicious and the service was excellent."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdlkwcFlSMlZSUTFFNVpFVmxOSGh5UjIxbGNsRRAB",
            "text": "Excelente servicio"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTlZrdG1lVUUyZWtoRWNHcDZOWHBGVkZKR1gxRRAB",
            "text": "Gorgeous incredibly delicious, wholesome food. Service is top. The menu is small but that’s all you need. Loud inside, the have outside seating. Places like this is why New Yorkers are food snobs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VME1WUjVaVWxUZEd0MlVtUjNYME42VlU5WVFXYxAB",
            "text": "Ordered lomo saltado to go. It cost over $30. Disappointed. It had more French fries than beef. I ordered medium rare meat but all pieces were overcooked and hard to chew. I doubt how they have so many good reviews."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWFdWcENVRVY0VURGb2FGbHZUbHBGVmxWVFVtYxAB",
            "text": "The dishes and the cocktails were amazing, the terrace was perfect on a summmer evening, we had a perfect date night!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ2JqQkJiSGx5TkRrd1RsUTRWMEYxWmpGTGVHYxAB",
            "text": "We had lunch and it was a nice experience. The food from the appetizers to the dessert was delicious. We had Camilo as a waiter who was very attentive and friendly, he helped us with all our questions. We are definitely going to return with my family and apparently I have already written it down as one of my favorite places."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVk1HUjFla1ZpVDFKdlVGcExWRFV3YWxacExYYxAB",
            "text": "Great Peruvian food with a modern twist. We had the corn causa, the ceviche and the croquetas for apps. Each app was super flavorful. For mains, we had the aji de gallina and the seco. Both were very good. I thought the appetizers had a bit more flavor than the mains. Decent portions. The only thing was the service was lagging. It took a while for someone to take our orders. When we did receive service, they were on top of it. It’s my 3rd time there and will definitely go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210c04xcFdOa0ZVWmtKTFRGSXpiRTQ0TkdGQ1NXYxAB",
            "text": "Wow, some of the best food I've ever eaten in NYC, 15 years in the city!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMVJqWXRhbGM0U0hwck1tOW1ZVU52WlY5aVNGRRAB",
            "text": "this is the second time I visited Jora, and the service, atmosphere, food is incredible! The first time I went, I had a reservation. The second time I went, we walked in and they had a table available. Our friends were able to join us on a whim too, and the staff was super accommodating to that.\n\nHonestly, all the cocktails, food, and dessert that we got were amazing and no complaints. The staff is super mindful about giving the table space to eat, watching the table if anybody needs anything and the food comes out pretty quickly.\n\nHighly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUU1VSjJYMnBzTFRScE1sbGFZWG90YlZaT2JIYxAB",
            "text": "the entire menu is amazing. we had a party of 15 come in over the weekend. there was clear communication with Raul to set up everything, amazing service by the entire staff, and the entire group was wowed with the menu. this is a must visit in LIC!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Qk4zaHVSRVJVZEc1YU1tRmpRVmh2UVdVelVGRRAB",
            "text": "Es tan bueno,que todos los cumpleaños los celebramos ahi."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWldVVmlValV6VGpBelpYbDNabkZhU1d4aWRXYxAB",
            "text": "Yesterday I had a wonderful experience at Jora with my friends. When we arrived, the waitress noticed we were Brazilian and she spoke Portuguese, which made us feel even more comfortable at the restaurant. The food was delicious, the atmosphere was super pleasant, and to make things easier, they even have their own parking lot. I highly recommend Jora."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Nd1JWUkphbGgzTmtJM1pYbGtjRXBxYzA5bFkyYxAB",
            "text": "Good food, horrible service! Waited for my food more than 1.5 hours and end up telling me my dish ran out! Pissed"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTGExSjBZakkwTUhJeFpURnBWR1k1TFRKcVgyYxAB",
            "text": "Excellent Peruvian food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUFJFaFFhRVZGTTFWNlVuQnFRbTVWV0VSUkxVRRAB",
            "text": "A Hidden Gem in Long Island City!\n\nWhile riding my bike through Long Island City, I came across this cozy spot—Jora Restaurant—and decided to give it a try. I’m so glad I did! I’ve always enjoyed Peruvian food, but this place took it to the next level.\n\nFrom the moment we walked in, the atmosphere was warm and inviting. The food was absolutely delicious—every dish was bursting with authentic flavors that were both bold and uniquely Peruvian. The drinks were also crafted to perfection, complementing the meal beautifully.\n\nThe service was excellent—friendly, attentive, and knowledgeable about the menu.\n\nIf you’re in the area and craving something different, flavorful, and memorable, Jora is definitely worth a visit!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabUxYZExiSFpNZGpGUVQyWlhSWGRHTUdkNGVHYxAB",
            "text": "All Are very good...I like it.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBdFdraG9iRlYzTmw5TVZqbGpRMGxHWTJOQ2QyYxAB",
            "text": "I went here to eat with my lady. It was my first time and the food was phenomenal I will be going back to try more food and the drinks as well."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeGNreE1VSHBrVkhodlFUVTBjSGRLTjJGVlVtYxAB",
            "text": "Pedí el pastel de choclo esperando ese sabor casero y auténtico, pero la verdad me decepcionó totalmente. El plato no sabía a choclo en lo absoluto: el sabor era plano, sin dulzura ni frescura propia del maíz tierno. La textura estaba seca y poco apetecible, parecía cualquier cosa menos un pastel de choclo."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOM2VHOVVjV0pGUkRGak5WVmpTM3BQTkZkdVQyYxAB",
            "text": "Delicious food, good service - very pleasant experience. I would definitely come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Zd2JrbG5ZbFZHVnpRMmJVWnRiREZZVEdsdVRsRRAB",
            "text": "Would highly recommended the plátanos machos, the broccoli, the empanadas and the cheesecake. The lomo was a little tough, but the flavor was good. I would give this 4.5 stars but I'm rounding up."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRFRVMDFaRkpHVUc1bVUzZDBabHBoU1VkMGQzYxAB",
            "text": "Great place to go grab some Peruvian food, what we found strange was that the cocktails and the main dish came fast but the appetizers took a while to come to our table. But everything was good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzdGQyOXFUbU5ZZGxGT1owcHVUbXA2U3pVdFkzYxAB",
            "text": "Great ambiance, good food, good pricing! Loved my pisco sour"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNFVXdEdRbFZDVUROWVFWaGFhbEZpY2xaQ1ZHYxAB",
            "text": "Tried this place for the first time with my family for my mother's birthday. Atmosphere was clean and beautiful, service was 10/10, and every single dish we ordered was delicious!\nThe Maduros, salmon, and lucuma panna cotta were my personal favorites 🥰"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScWVDMHdia293UVRNMlIzbGpUVWRxZFRVd2NtYxAB",
            "text": "The dishes taste good and the servers know what they're doing. Every dish shows care and freshness that surpasses typical casual dining expectations. The taste pairings here work surprisingly well. Excellent one-on-one care. This place exceeded expectations - I'm planning to return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSkxXSnJTRWhsVFVjeWNqUllUa3hmZFdoM2VuYxAB",
            "text": "Great food and service! Will definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VlRXbHJjVTA0Y25sb1ltbDVTa3haTXpkM2QzYxAB",
            "text": "The flavors are vibrant, and the ingredients are incredibly fresh. You can start with the Grilled Octopus, which is perfectly marinated and packs of flavors. The lomo saltado is another favorite, combining tender beef with sautéed onions and tomatoes over a bed of rice and fries. The atmosphere is warm and inviting, making it a great spot for casual dinners."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeGRIWk1lRWhNVkZkcWVEbGhhMEZ3YUdsc1YwRRAB",
            "text": "My fav Peruvian restaurant in NYC. I came here 5 years ago and just recently went on a date here. The quality, flavor and freshness is everything ! My fav dishes were def Pastel de Choclo y Aji de Gallina!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTFYzcHFPVzQzWjJaTWJVSk1kbmhSWVhKU1VsRRAB",
            "text": "This is one of those places where it’s worth trying everything on the menu because every dish fully meets expectations. I really liked the presentation of the plates, and the octopus is a must-order. The restaurant’s atmosphere includes elements representative of Peru, which elevates the overall experience.\n\nUnfortunately, our waitress was not friendly. She made us feel rushed the entire time and even brought the check before we had finished eating. Still, we left a 20% tip because the rest of the staff was very kind and the food was top-notch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoZlRVVnZjRlZQVlZOcmJuSnVkazlITUc5WmRuYxAB",
            "text": "The paella was so delicious, along with the ceviche as the app. The charred broccolini was also phenomenal.\n\nThe only dish I would advise against getting is the grilled octopus. It was so salty that I was taken aback. I normally love my dishes with a dash more of salt, but this had me reaching for the water almost instantaneously.\n\nThe drink menu is great with wine, cocktails, and beers. The atmosphere is lovely with the most wondrous decorations."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKQzQwT095bDVTNTZnRRAB",
            "text": "I’ve lived in this area for years and always wondered why this place is always packed now I get it. The food is amazing and the staff are on top of everything. My partner and I walked in for Friday dinner, and even though we had to wait about 30 minutes, it was totally worth it.\n\nI’ll definitely be back and will recommend this spot to friends and family.\n\nThe only downside is that it’s a bit pricier than other places, so it’s not an everyday meal but overall, it’s absolutely worth it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRE1IRmhUV3BzVm1FNFdHRXpYMDB0ZGtwUFFWRRAB",
            "text": "Best Peruvian food in NYC. Even if you don’t drink get the Pisco Sour, it’s amazing. The menu is always changing get the civieche and whatever authentic food the server recommends"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SaVIzSkdjV0ZRUTBkV2NFNHlUV2M1VG1wT1VHYxAB",
            "text": "Very flavorful food, very nice dishes. Pricier than expected but the food quality makes up for it. I had the ceviche & grilled octopus. Both were cooked to perfection"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weWJGRTRWWGh0ZUVsdVZEaHRVR3BmVUdadWVWRRAB",
            "text": "To preface: I am vegetarian. The ambiance was beautiful and the staff were incredibly polite. We came in a bit before the kitchen closed and they still accommodated us. I ordered the only labeled vegetarian entree and to be frank it wasn’t the best. It was just French fries, onions, mushrooms and 2 cherry tomatoes basted in a balsamic-y sauce. I opted for no rice which probably was a mistake, but either way I didn’t think that dish warranted a $20-24 price tag. My brother ordered a meat dish which he throughly enjoyed so I would definitely come back if I could eat meat or for the drinks."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMN0c4Nnpja1lLXzJBRRAB",
            "text": "This place is absolutely phenomenal. Amazing vibe, kind service workers, and absolutely delicious food & drinks, the best ceviche I’ve ever had. I will definitely be going back I think about this place every day"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnc3N6amdnRRAB",
            "text": "So impressed by the food and vibe!\n\nWe tried the veal heart skewers, grilled octopus, and arroz con pollo, all very flavorful and fresh! Service was warm and welcoming. The interior design is another highlight for me: a nice blend of Inca historic and modern open feeling. Will come back to try other dishes!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOUoyYk5BEAE",
            "text": "Took my parents to eat here as we've been wanting to try a new Peruvian restaurant.  The first thing that made us super happy?  They have parking across the street, though maybe a total of 10 spots?\n\nWe got there shortly after they opened and it seemed half full already.  The service was great and everyone was very attentive.  We started off with ceviche, and they got the tang on point!  My mother and I had the salmon which had the crunchiest skin and the broth underneath was great. My father had the ribeye, and they must have done something to the brocollini because that man does not eat veggies and he devoured it.  He gave me a taste, and even though he ordered it medium well, it was super soft and tasteful.\n\nMy parents got deserts which they loved.  Overall the Jora staff were very attentive and the food was great. The ambiance for noonish was great for chats with lots of families as well.\n\nOh yeah, my mother had a psico sour and was very impressed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaVpuUTVRbWxqYWtOelNsZEdiMFJmUzBkcFJrRRAB",
            "text": "Craving some Peruvians food and a little Google maps scout and found this place; guided by the good reviews. It didn’t disappoint. My friend is peruvian and she approved. Even though not the biggest fan of fish. I’d have that ceviche any day. Pisco was tasty (we even got a free shot of it as it was a Peruvian holiday). Would come back and recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNU3EzdTNscjhqN3hRRRAB",
            "text": "This is easily one of the best Peruvian restaurants in NYC! Every dish is spot on and absolutely delicious.\n\nOf course, you can't visit a Peruvian spot without trying the ceviche--it's a must! The jalea, a platter of crispy fried seafood and yuca, is incredible. Be sure to try the octopus, perfectly charred and served with a delicious sauce. The empanadas are also a solid choice. For the mains, I highly recommend the arroz con mariscos--think of it as a Peruvian take on paella, perfectly seasoned, fresh, and absolutely amazing. I can't recommend this restaurant enough!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dVFUQTJOV3BNVHpWTFYwWm5XbmRQUVdONVlrRRAB",
            "text": "Great atmosphere and service. Food was delicious and dessert too. Chicken causa very yummy, crunchy, and tasty. Desert Lucina panna cotto sooooo good."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaFdtSnBORkJmVW14R1VXZHBaakY0UmtGcFpuYxAB",
            "text": "Como siempre delicioso , pero sentí antipatía en algunos meseros ! Creo que deben ser más amables y carismáticos"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb1BtWENBEAE",
            "text": "I’ve never written a follow-up review before, but I felt compelled to update my experience with this restaurant.\nWe drove an hour to return, expecting to enjoy the same delicious dish we had during our last visit.\nUnfortunately, we left quite disappointed.\nNot only were the portions noticeably smaller, but the flavor simply wasn’t as good as it was before.\nI would try to come back in a couple of months when I’m near Long Island city but I know that I’ll be back alone because my wife already told me that she definitely doesn’t wanna come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX3RubUtREAE",
            "text": "Great food. Went on Valentine's day with a reservation and was given a rose at the end of my dinner. The stand out dishes were the apps and the dessert. I've have better entrees elsewhere but all around a great restaurant."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdko3Yk9BEAE",
            "text": "They have a great space with some nice decoration. The staff is nice and friendly, and the service is general was pretty good. The food was prepared fast and it was tasty. They don’t charge the box and they bag in case you need to bring some food home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNTZxeEZREAE",
            "text": "Me and my family had a great time for my birthday. This restaurant it’s perfect for big parties, food was delicious and the server was great. The only complaint is that they don’t have a kids menu and even though my two year old enjoy the “picante de Salmon”with me, my nephews barely ate. Beside that everything else was fantastic"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMenc2ZXFQbWFmYVNREAE",
            "text": "Service is good, just the food menu didn’t have much options and nothing makes want to go back try again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3a09iUzNRRRAB",
            "text": "The food was delicious, very soft and tasty beef on our entree, and the service was perfect, always checking up on us should we need anything else. We had the “Lomo Saltado” & the passion fruit cheesecake. I love cheesecake & I love passion fruit margaritas, so why not have both of best worlds. Well, it was so good! I highly recommend. We also had the Margaritas, which were very well made, I have had many, and this Margarita made it to the top of my list.\nP.s. We had already started eating when we took the picture of the entree “Lomo Saltado” .."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N3Vmel9RRRAB",
            "text": "FANTASTIC EXPERIENCE WILL BE BACK!!! The best Peruvian restaurant in NYC. Coming from a Peruvian who loves to cook and who has been in the fine dining industry for years. I recommend this to everyone. Went for a birthday and an anniversary.  I had the best time and can't wait to be back. They even have outdoor seating and serve your dog water :) This little difference stands out alot of people have dogs and remember this special care. The food quality was delicious and the bathroom was clean. My one feed back is that it's very expensive and for the price your paying the portion sizes are very small so I hope they can take this into account. Otherwise amazing spectacular experience can't wait to be back!!! If you're looking for good Peruvian cuisine this is the place for you :) 🇵🇪🇵🇪"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2LUlfZ2N3EAE",
            "text": "We came for lunch and Jora did not disappoint. The ceviche classico was perfectly balanced, the purple potato dish was fluffy and light, and the octopus was tender and charred to perfection. The salad was not anything to ring home for but complemented the bold flavors of the other dishes nicely. It was a bit pricy for lunch but overall, delicious. Oh, and the best part, they have parking!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd2VERlVkazFPZFdnM1JYbFpabGR5VlUxWldHYxAB",
            "text": "As a Peruvian, can confirm food is tastes like back home. The ceviche and ají de gallina were great. The pisco sour was off though, tasted good, but not exactly like the peruvian one."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzaHVTRlFnEAE",
            "text": "Excellent experience! Was told there would be about a 20 minute wait, only ended up being about 10. The restaurant is decorated beautifully. Server was incredibly helpful, attentive & polite. Drinks were so unique, fun & delicious. Food was incredible, we started off with yuca chips which were great. I had the arroz con mariscos & my date had the seco & pepian. Both were so incredible, the meat was cooked perfectly. Will definitely return!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNmNtU0dnEAE",
            "text": "I've never had a bad experience at Jora and I've been here multiple times over the last few years. Fantastic food: I'd recommend the Octopus, the corn causa, the Lomo, and the Jalea. All of the meats were cooked perfectly. The staff was awesome and would definitely recommend this place."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnai1Hb0lBEAE",
            "text": "Jora is hands down our favorite restaurant in all of New York City! The team—especially Gipsey, Sergio, and Miguel—makes every visit feel warm and welcoming. They are intentional and always go above and beyond to ensure that we are taken care of, that our meal is great.\n\nJora is everything that you could want in a restaurant experience.\n\nThe food is simply outstanding—bold, flavorful, and consistently delicious. Our must-try dishes: the empanadas, jalea, and plantains to start, followed by the Lomo Saltado or octopus, and finishing with the decadent lucuma ice cream.\n\nWhether you're visiting or a local, Jora is a must-try. You won’t regret it!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmenZLZW53RRAB",
            "text": "Upscale Peruvian restaurant in the heart of LIC. Street parking is not that difficult.\nFood is amazing! What an experience! The ceviche is a must try, and the yuca fries, and lomo saltado. We got a lot of dishes to share, and loved them all. The dishes are small, but super flavorful with an amazing blend of spices. They do not take reservations,  but on an early Saturday dinner, we got seated right away. Best drink was the fig boss"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtel9EM293RRAB",
            "text": "The atmosphere is business casual. The restaurant is very big with a lot of seating. There is a full bar in the back. You can't go wrong with any of the cocktails either. The presentation of the food is so lovely with floral embellishments. The flavor of all the food is so delicious as well. Coat check cost money, and we didn't know that ahead of time. It's pricy but we'll be worth the money. Service is quick, and everyone is very attentive and kind. Great for group settings. I highly recommend it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMFB5SElREAE",
            "text": "I love this restaurant! Delicious food and drinks! Perfect for family or friends. The portions are always very filling, and always great. The menu is quite small and has a changing special which is always yummy. I really hope they bring back the skirt steak and potatoes."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRb0wtZlVREAE",
            "text": "This place did not disappoint!\n\nMe and my future wife had a complex and well garnished pisco sour that was neither too sour or too sweet and a clarified piscolata with coconut and mango foam that really impressed with its tropical flavors that didn’t overpower each other\n\nThe meal opened with a lovely choclo short rib tartlette that had a depth to its smokiness I found it heavy but not in a negative way, rather it was welcomed and paired well with the refreshing lightness of the spicy ceviche\n\nFor mains their aji de gallina was a well executed classic that was elevated but not over done and honored the original well. The lomo saltado had a tangy sauce and was beautifully presented and though I am not a fan of matcha the matcha lava cake almost made me love it. Worth the 15 min wait.\n\nThe only thing we did not like was the single person bathrooms, on a semi busy night I was waiting 15 mins for the bathroom and that was for the men’s room!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZ096R0VnEAE",
            "text": "Solid spot for Peruvian eats. The lomo saltado and the arroz con pollo were great. We were sat on the bar side for a little bit while waiting for our dining table, and the drinks were good too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeVotZ2tRRRAB",
            "text": "Had a wonderful meal at Jora in Long Island City!\n\nI tried the Tuna Ceviche, Seco & Pepan, and finished with the passion fruit cheesecake – each dish was excellent, with fresh flavors and beautiful presentation.\n\nThe atmosphere was warm and inviting, making it a lovely spot to eat and socialize. Service, however, was a bit slow at times, which was surprising since it wasn’t very busy. Still, the quality of the food and the ambiance more than made up for it.\n\nA great place to experience Peruvian cuisine in LIC!"
        }
    ],
    "reviews_count": 81
}