{
    "name": "Porta 23",
    "place_id": "ChIJufkQ_9pfwokRe8KcMNHEBLI",
    "grid": "QN1",
    "address": "29-17 23rd Ave, Queens, NY 11105, USA",
    "rating": 4.8,
    "user_ratings_total": 134,
    "phone_number": "(718) 777-9477",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dmFuaE5VakJRTWtGWmJYcEJkM1pNWW05U1pHYxAB",
            "text": "Great Happy Hour, Super friendly staff/service and cool vibes. The Caribeño was fantastic and the sriracha brussels were also awesome. PDQ is a must order app as well. Highly recommend!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUGN5MWpXWHBWUlVGeFJ6Uk1RWEJHYkdRME5XYxAB",
            "text": "Excellent service, food and family ambiance! I will definitely recommend this wonderful restaurant to everyone I know."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KS01GbDRSVzFpU2xadWVIbHRWMGsyWkVWaFNsRRAB",
            "text": "Porta 23 is a small, nice place in Astoria. Its dishes are so good. My wife and I shared calamari, poke ahi tuna crisps, and some signature drinks. I didn't know that the Brazilian and Indian combo of sweet and spicy deliciousness was possible! I don't even like too much spice in my food, usually, but this was too good to miss. Good prices and service too."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVmJWOXFiMlJyTW5sT1pVMXRSMlJwY0VOTlYwRRAB",
            "text": "Amazing food and drinks"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMlptRnVialZmYjB4b2RtdFdiVFJ4Y25GTFdsRRAB",
            "text": "Delicious food & awesome happy hour deals!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQ1FXOVZTMlZFYTFGdFQybDZXVzl0WkRsNFlXYxAB",
            "text": "Hidden gem! Small spot you might not notice walking by but such good food. We had a friendly and attentive waiter. And the PDQ cheese bread app is so unique and delicious, must try."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swd1JtOW1ibFUyYjJjNWMwUmFSSFl0Ulc1amFXYxAB",
            "text": "If your reading the reviews on Porta 23 what are you waiting pick up the phone and make reservations!  I had the BEST mussles fresh perfectly cooked and full of flavor. The vibe is unbeatable shout out to Patrick making my husband and I feel right at home. He even took his time  to speak with ny sons girlfriend whose also from Brazil. The service was attentive which made the whole evening much better. Whether you're a local or just passing through Porta23 is for you! They wont disappoint. You must try the mussles!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMmNGaDBUamR0V21GU0xWSnpibmR4Yld4dFdXYxAB",
            "text": "Food was great and staff were lovely ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMmRsVnVTbXhIV0VKSU5EZHRWM2cwYWtoRmRWRRAB",
            "text": "Had a great time at Bossa Nova night. Can't wait for the next one."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sZloyOHhRbWRTVGpCdlVFTnJheTA1Y0d3NVYxRRAB",
            "text": "Absolutely incredible. First time coming here and it’s a gem! Got the taco tuesday special which included 3 tacos and a marg. It was so good I don’t have a picture."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNFZsTlRNRGMyYzJVek4wUmxObmczZVRWdldGRRAB",
            "text": "Food, drinks and service are awesome."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTVRYaDNXVU15V0ZsTVkyNVlVa2xXZFhZMVkyYxAB",
            "text": "Delicious flan and wings!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMFNXUlBkbmxZUjNoelNYRlVlVmcxU1hCWFJXYxAB",
            "text": "My husband and I had a wonderful evening at Porta 23. Adrian our server was very friendly and accommodating. Food and service was a 10/10, I highly recommend this establishment."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbVMyNHpTeTFvWVVSWVlrcEJRamxrY1hsd1UxRRAB",
            "text": "Best burgers in Astoria!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYVQxaE9NMlJYZHpoTlIyaDFNbTluVm1aaGRXYxAB",
            "text": "One of my favorite Astoria spots. The food is always great and we love the staff!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcWJ6Uk9aMnh3WWtVNVZtOVNjV3g1ZW5aeVFtYxAB",
            "text": "Service was amazing and food exceptional. Will 1000% be back"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U1QyaGZTekpGYkVJM1MybGtXRzEwY1V4d1ZYYxAB",
            "text": "Comida super buena, buena musica y muy buen servicio la persona que nos atendio super amable, pidan tuna tartar y la picaña delicioso"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbmFISlhRekJMZEUxZlVIWTROMEV5Y0ZabGRVRRAB",
            "text": "This was our first time eating here and we loved it ! Food was delicious and the service was excellent!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSWJuUkVXVUpJZEhRNVVrNW1NRlZ4TFZoSlptYxAB",
            "text": "My fiancée and I came looking for something quick and delicious and happened to run into this spot. The Smash burger and chicken pilaf were absolutely delicious, service was great, definitely recommend to anyone looking to dine on ditmars away from a crowd."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNExUUmFZVkZxVVV4c05qaHlUVGRNY2psNVMzYxAB",
            "text": "Fresh flavorful food, great drinks, stellar service, intimate but family friendly ambiance with great lighting. Patrick was amazing from start to finish, very pleasantly surprised for a last minute dinner overall. A must try if you haven’t already!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNMlI1UFcxMHNPaW5RRRAB",
            "text": "Everything about this place was amazing service food, atmosphere definitely coming back here !!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aamJHVjNNVEV0YW5GT2NHNVFjMFYyUWpFelJHYxAB",
            "text": "I love Porta 23. Thé food is always delicious and they are so accommodating. Easy to walk by cause it is small so keep an eye out. Wonderful service and they treat you super well and make a point to remember customers who come in often. It is my favorite spot in the neighborhood for an intimate date or to take myself out and relax when I don’t want to eat at home and want to treat myself. Also great to pick up the cheese bread for if you are hosting"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJRzk4ZUhPaUtxVERnEAE",
            "text": "The place its really cozy, the staff and the owner are super friendly, the drinks were fire, and the food was so tasty🙌🏽"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJdWtvdGJmemI2QnlRRRAB",
            "text": "What a fantastic quaint restaurant. I can wholeheartedly say service, food and drinks are all top notch. Incredible happy hour drinks to add.\n\nSo many places to eat in Astoria and this is a standout spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaHNxUlN3EAE",
            "text": "Great new restaurant in Astoria. Wonderful varied menu. The crisp bbq chicken wings are unreal as is the chicken sandwich and the burgers. Great attentive service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvczVQUGJBEAE",
            "text": "great atmosphere + food, and fantastic margaritas!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvN2MzeTBnRRAB",
            "text": "Great experience!!\nI had a great experience today! From the quality of the food to the price and service, everything was on point. The place is warm and welcoming, definitely worth a visit!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMktuMExnEAE",
            "text": "Adrian was the best server! You should add the tip on the check, food was amazing! Please try the picahna and half chicken!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOVlUOGJREAE",
            "text": "Ah yes, Porta 23. Love this place. Adrian is the best. I came back months later and he remembered my drink order! Impressive, if you ask me. Food, drinks, ambiance, all incredible. Hazelnut espresso martini is incredible! Also enjoyed the burrata, shrimp app (gambas al ajillo) picadinho, and smash burger. They've all been stellar. Love this place. I try to come back when in the area. Can't recommend this place enough."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNGZ6blFBEAE",
            "text": "Well, presented food but it needed a bit more flavor and got cold quickly. Passion fruit margarita hit the spot. Thank you."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbi12TTBnRRAB",
            "text": "The yucca fries and cocktails were great! We sat at the bar and the bartender was friendly and attentive. Great cocktail variety on their happy hour menu."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnLWZEVUpREAE",
            "text": "The bartender was so good  the food was amazing and the place very kind"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnek1UVWtnRRAB",
            "text": "I came here for dinner and I must say I love the food, drinks and atmosphere. Adrian was very helpful and attentive. I love their burger, will definitely come back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnemFtd0RnEAE",
            "text": "My husband and I went here for Christmas Eve dinner and absolutely loved it, so we decided to go for Valentine's Day dinner and absolutely loved it just as much as we did for Christmas. This time I had the braised short rib and it was like butter, my husband has the seafood platter and he loved it. We spoke with the owner who's also the chef and commended him on the food. He was so grateful. The drinks are so good and great service, everyone is so friendly and they check to see if you need anything. Looking forward to going again. A must try if you like a nice low key atmosphere with great food 🤩!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBd3UzOHZRRRAB",
            "text": "We ended up here unexpectedly after not finding room at a nearby restaurant, but it couldn't have worked out better! Our party of five was immediately seated and brought delicious drinks, entrees, and desserts. The service was amazing, the orecchiette was delicious, and the flan was no joke! I still haven't forgiven my \"friend\" who stole a bite. Highly recommended and can't wait to go back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBazREUUF3EAE",
            "text": "Perfect little spot for date night, cute space and the menu is legit and has something for everyone. Will be back to check out more of the menu.\n\nHere were our must try dishes:\n\n🍖 BABY BACK RIBS\n💦 MUSSELS in a Saffron sauce\n🥗 BEET SALAD\n🍝 FRUTTI DI MARE\n🍮 Homemade Flan"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBc0pha1hBEAE",
            "text": "Genuinely a great hidden treasure. The food was excellent, the service was impeccable, the drinks were wonderful (and there were really  good non-alcoholic options as well!). What a great experience! I’ll definitely be coming back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfcDhqSnhnRRAB",
            "text": "Stumbled upon this little gem with super yummy burgers! They had a Sunday night special for burger and a drink and it was so good.  Will definitely be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNC16eWhnRRAB",
            "text": "Really nice place at affordable prices the food is really good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmc3B2a1R3EAE",
            "text": "Came here for dinner xmas eve. Fantastic food and drinks! One of the best pasta dishes ive had. Everything was delicious! Great service. Will be back soon to check out brunch! A hidden gem."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MTVMT2dnRRAB",
            "text": "came the place with family from the neighborhood and relatives from colorado. everyone loved their meal and the mixologist’s drink of the day was great. good options for those who have dietary restrictions."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MC1ua0pBEAE",
            "text": "I had my Sunday brunch there with my husband. The menu was amazing, you can find so many different cuisine options. We both ordered French onion soup ( so fresh, so yummy), for main, we ordered steak and egg and chilaquiles. They were so good. I will go there again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MHBPLS1BRRAB",
            "text": "This place is such a hidden gem! Everything from the food to the service was amazing. Our server+bartender, Adrian, was super helpful with recommendations on the menu that fit our dietary restrictions. We had the poké crunch and edamame for our starters & the picanha and smashburger for our entrees. The picanha was perfectly cooked—def recommend trying it!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2enY3NmZ3EAE",
            "text": "Great evening date vibes, gourmet food, and delicious and strong cocktails. I recommend the caiphirina & chicken rice pilaf. Plus there’s wonderful service!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2anRQbzNBRRAB",
            "text": "I was craving French onion soup and found this place right by Ditmars stop. The French onion soup was delicious. I also tried the Brussels sprouts with sriracha aioli and they were cooked to crispy perfection. You should definitely get the Brazilian cheese bread that’s made fresh and worth the wait. Cozy small place and a good date spot. Friendly and fast service and I’ll definitely be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2anVtODRnRRAB",
            "text": "If you’re looking for an unforgettable dining experience, this restaurant is a gem! The food is absolutely delicious and you can tell that each dish was carefully crafted area. Don’t miss out on the deserts. The Flan is a stand out! The music and ambience are everything together perfectly, creating a vibrant atmosphere. Adrian is spectacular. It’s the ideal spot for a date night or a relaxed experience with friends!\n\nOh! And the coquito 10/10"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2N05uQU9BEAE",
            "text": "If you go for dinner, you can get some top quality dishes with friendly service. Modern decor, intimate lighting make this place very cozy for a date or a happy hour chat.\nWeekends, Friday night in particular, transforms into more of a lounge style nightclub with a range of house music from local DJs and food, drinks available from the bar."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eE5TblFBEAE",
            "text": "Great local quaint spot. My wife and I came here on a casual date night and were pleasantly surprised with how good the food and drinks are! We started with the yucca fritters which were extremely tasty and light which left plenty of room for the next course. For our entrees, she and I split the chicken milanese and the chicken pilaf bowl which were both very flavorful and exceeded our expectations. Lastly, we wrapped up with two delicious desserts, the flan and the passion fruit creme brulee (which by the way is super unique) hit the spot. I forgot to mention the cocktails were fantastic as well; very well balanced and tasty.\n\nAdditionally, the wait staff is extremely friendly and attentive. We also had the chance to meet the owner who was really nice and even gave us a dessert to try on the house! Thanks!\n\nOverall we'll definitely be returning as this is now another local spot to indulge in that I wish we found sooner!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dVBEeV93RRAB",
            "text": "Adrian was lovely and made a kickass mango margarita. The music playlist is on point and certainly not too loud."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQX1pyanB3RRAB",
            "text": "What a nice dining experience, delicious new American and fusion dishes. Lovely atmosphere and very attentive service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNzhicUNBEAE",
            "text": "Everything about this place is everything you want in a restaurant! I don’t normally write reviews but everything so amazing, I promised our server I would!\n\nFirst let me start by saying we found this place on the Pulsd app (we use it to find cute dinner dates every week). In our experience we’ve had places treat us differently for using it which was my fear going out but not PORTA23. They were like “cool” and the IMPECCABLE service began.\n\nThe overall atmosphere of the restaurant set the tone for ambiance and comfortability.\n\nNOW TO THE FOOD; again the point of us going out was to try new foods, having the taste palate of a 4 year old I was about to order either the burger or chicken Sandwhich on their menu but my boyfriend convinced to try something different. We got a plate of calamari first, it was my first time trying it! It was SO GOOD! They give you marinara and a sweet chiIi sauce. We liked it better with the sweet chili than the marinara. For entrees I went with the safe choice and tried this Chicken Pilaf. I took one bite and almost cried, the flavors bounced around my mouth like a firecracker. It was savory, yet sweet, the pickled cabbage on top really pulled it together and the chicken was fried to perfection. It wasn’t dry at all. 10/10. My boyfriend got the Harvest Squash and after one bite gave an immediate thumbs up. He said he admired the presentation of the squash as he thought it would’ve just been on the plate with sides. But it was like art! He said the shrimp was tender and juicy and he inhaled it.\n\nThe drinks were delicious as well. I got the Sophie B which to me tasted like a Moscow mule which I enjoyed, I also got a District26, which I wasn’t a fan of. I’m more of a rum girl so if you love vodka, that drink is for you! My boyfriend got the lost soul and the vagabond and loved them both!\n\nLastly desert we ended with the churros! As fans of things that are not sweet. You can tell the ice was made from scratch. It was smooth and whipped to perfection. They give you caramel and chocolate syrup on the side either churros. One thing I will say is I wish the sticks were slightly bigger. I’m not a fan of chocolate but my boyfriend is and he said it wasn’t too sweet. The churros itself were light, airy and were perfectly baked.\n\nWe would 100% go back in a heartbeat!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINm9IVVRBEAE",
            "text": "This place was pretty good. I placed a delivery order from Porta 23, as they were running a BOGO on a few items via UberEats and everything showed up packaged well and still in good shape. Order totaled to $147. A bit pricey, especially without the BOGO inclusions, but pretty enjoyable.\n\nI ordered the\n- Picanha- $30 (Grilled top sirloin, arroz maluco & pico de gallo)\n- Seared Salmon - $27 (Sautéed yuca, spinach & honey passion fruit glaze)\n- Calamari - $16 (served w a side of fresh grilled lemon, spicy marinara and sweet chili sauce)\n- Buffalo Wings $14\n- Flan, Pao de Queijo & Yuca Fritters were part of the bogo deals\n\nI typically, on a first time order at a restaurant don't tell them how to prepare my steak if they don't ask outright. Plus I think you should really only mention if you prefer your steak prepared rare or well done, since those are both two different extremes when it comes to preference. It is my sort of test of the chef's expertise. I prefer mine like I think it should always be prepared lol, medium/medium well, so my Picanha steak was a bit more cooked than I prefer, but I chalked it up to some additional cook time that possibly occurred as it traveled to me. They give you a healthy portion of steak and it was pretty tender. I didn't care for the arroz maluco. I typically love fried rice, period, but this was a bit too bacon heavy. Between that and the steak, I was wishing there was an actual vegetable included in the dish, traditional to the entree or not. The Picanha dish is def missing something and could be reworked a bit.\nSalmon entree was good. Ha, restaurants seem to love putting wilted spinach with salmon dishes. This dish could have used a bit of 'bite', maybe asparagus? Everything was...soft, from the fish to the yuca to the spinach, but still good nonetheless. Definitely a comfort meal. Salmon was hearty and tender.\nThe PDQ was delicious, but the Yuca fritters were a bit on the dry side, which can often happen with yuca.\nThe calamari was very good and maintained its crispy exterior even in delivery. No notes.\nBuffalo wings were good, but the garnish that they used to razzle dazzle them made the wings a bit soggy, so I would have them as a dine in option or ask them to not include the slivered carrots and celery if I ordered them again; however the flavor and tenderness was there.\nAll in all a good experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMnQzQWJREAE",
            "text": "Porta 23 has a great looking menu, I order a few appetizers and drinks. The wings were the perfect blend of sweet and spice, a calamari was probably the best calamari I’ve ever had, the sauce were fantastic. The burger was so juicy! This is the first time in over a year I miss living in the city just so I could be close to the gem!\n\nThe service was impeccable! The owner clearly has a passion for the business. The atmosphere is so chill and I had a great time out!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNW8zOW5nRRAB",
            "text": "I was visiting family and we came to this restaurant, the staff was very friendly and welcoming. The overall atmosphere was comfortable yet classy. Our food was prepared and displayed perfectly and the portion sizes were just right. The owner even came over and talked to us to make sure that we were happy and that we were enjoying ourselves. Definitely would come back, I highly recommend Porta 23."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxX0syT2hnRRAB",
            "text": "Porta 23 was a fantastic experience from beginning to end. The food looked so delicious that my fiancé and I had to try it, so we decided to go for our engagement anniversary since we were local. We started off our night with a couple cocktails and mussels. We tried their El Vulcan and La Picador. Just wow! El Vulcan was by far the best spicy cocktail I have ever had and La Picador was delicious. The best part is they use NO SYRUPS! That was big for us. We usually get mussels everywhere we go and let me tell you, these are at the top of our list now. The sauce was too good. For our main meals, I had to try the Moranga and it did not disappoint. It was very comforting and flavorful. My fiancé got the 1/2 chicken and she really enjoyed it. We also got to try a couple of shots of their house pineapple infused Stolinachya Vodka. Ask them how they make it and you’ll have no choice, but to try it. So delicious and the smoothest vodka you’ll ever have. We then finished our night with some of the best flan we have ever had. I grew up eating flan and I had nothing like this one. The consistency and taste had me wanting more. The owner, Patryck, was really nice and we enjoyed our conversations with him. His passion for food and drinks really stands out and he puts quality first which is what we appreciated. We’ve been to many restaurants in the area, but this is a spot we’ll definitely be coming back to many times."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1ME52aFZBEAE",
            "text": "Came here to celebrate my anniversary with my bf and this place is a must-try. We started with some tasty Yucca Fritters and for the entree we got the Picanha and the Moranga which was a 10/10 so creamy and delicious(Had this mothers…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1X1BYYU53EAE",
            "text": "This was one of the best meals my fiancée and I have had in a really, REALLY long time. The owner, Patrick, was hilarious, kind, and welcoming, and had great recommendations for our meal & drinks. It’s obvious that a lot of thought and care were put into every item on the menu, and that’s reflected in the insanely delicious food. I can’t even pick a favorite dish because everything was excellent (but if I had to pick a fav, it would be the half chicken). We will be back for more good food and good vibes!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMaDdIT1h3EAE",
            "text": "the restaurant owner refused to accept the coupon from Groupon and demanded payment of the full price of the order.  I can send you a check.  I brought a bill for food without the conditions of a coupon and withdrew more money from the card than was in the bill.  when I noticed this, he said that he had made a mistake and would return the money and once again withdrew the full amount of the invoice.  the restaurant is terrible.  the food is worse than the cart on the street.  the service is terrible.  We waited 3 hours for our order, despite the fact that the restaurant was empty on Sunday evening.  I will also leave a review for this restaurant on all Internet resources.   take action"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQN3UtRGhRRRAB",
            "text": "Food was amazing!! The yuca fritters and the yuca fries were so soft and flavorful. The herb roasted chicken with mash and spinach as well. Not to forget the caipirinha!\n\nVery great service. ! :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybU5LbGtBRRAB",
            "text": "Can we like add more stars? PORTA23 is an absolute gem! Their hospitality is top-notch and no I am not just saying this, they make every visit feel special. You can taste the quality in their drinks, which are crafted with premium liquor. Portion sizes are generous, ensuring no one leaves hungry.\n\nTheir all-American cuisine is simply delicious, especially the Mac and Cheese  – a must-try.. like go why you are you still reading this :) And let's not forget their Caipirinhas; they're truly to die for.\n\nWhether with a small group or a large party, their customer service is consistently exceptional. PORTA23 is my go-to for a memorable dining experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbkp1d1FBEAE",
            "text": "I had an amazing experience in the restaurant the service, food and atmosphere was impeccable. I definitely recommend the guacamole and chips, yuca fritters, pichana, churros and the passion fruit dessert was amazing! Definitely would come back"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNTZ2d3J3RRAB",
            "text": "I recently had the pleasure of dining at Porta 23 in Astoria. And I can't say enough good things about this gem! From the moment we walked in, we were greeted with warm smiles and exceptional service that made us feel right at home.\nThe food is simply outstanding! Every bite was bursting with flavor, and you can tell that they use high-quality ingredients. Whether you’re in the mood for something hearty or light, they have a diverse menu that caters to all tastes. The drinks were equally impressive, perfectly crafted and refreshing.\nThe ambiance of the restaurant is another highlight. It's clean and has a great vibe that makes it perfect for both a casual dinner and special occasions.\nI love that it feels welcoming enough for families, yet still has a trendy feel.\nAs a bonus, my husband and son coach basketball just up the block, so I’m excited to make Porta 23 our new go-to spot after their practices and games.\nI will definitely be recommending it to all my friends and family!\nIf you’re in the Astoria area, you absolutely have to check out Porta 23. You won't be disappointed!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQakxYWC13RRAB",
            "text": "Very nice little restaurant with a lot of diverse food options. It doesn't really feel like the menu has a clear theme or vision, however. Cocktails were great, service was attentive, and we enjoyed ourselves overall. This review was solicited for a discount on the bill, but is entirely truthful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbHNuYzhRRRAB",
            "text": "Amazing food, great drinks and wonderful service. The 20 dollar burger+fries+beer+shot combo is unbeatable. Definitely a must in the ditmars side of astoria"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudFBmQnF3RRAB",
            "text": "SUCH a great restaurant! We had such a nice time last night and the service was truly above and beyond. We sat outside and got to try a bunch of small plates (calamari especially was delicious), and were brought out a bunch of fun sauces to try. Perfect for a date night, dinner with the family, or happy hour. I'll be back soon!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQc3RuT0xBEAE",
            "text": "This place is like a little hope in the wall. If you have a Groupon, YOU MUST MAKE A RESERVATION.  Luckily, I was stubborn and asked to speak to the manager. He was able to squeeze us in and invited us to stay for the even starting soon. They had to remove all the tables to make more space. The food was delicious. My wife and I enjoyed it very much, so. Thank you"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOUwyVWFnEAE",
            "text": "All the food was absolutely delicious! Our waiter (who I think may also have been the owner) was exceptionally kind and even gave us free dessert drinks! We went out for Father's Day, and my dad got his wine for happy hour price even though it wasn't the one on the menu. The prices are very reasonable for the servings and flavor, I cannot recommend this place enough!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMZ3NMUUxREAE",
            "text": "I have walked by Porta 23 several times and their burger, beer, shot special caught my eye! I love a good burger. It's a chill spot. Burger was delish! They have green mayo sauce that's on the burger and on the side for the fries. Service was superb. Looking forward to returning ans bringing some friends!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaThHdUVREAE",
            "text": "Where to begin. My wife and I came here for a Pulsd deal and were blown away. Top to bottom this place has everything. The food is banging the cocktails are awesome and dessert was rich and delicious and the music is boppin.  The house made pineapple vodka is unreal and you must try the district 26. Say hi to Patrick and he will make sure you’re taken care of all night. They are putting out some amazing stuff. Run don’t walk. Happy hour all night Wednesday and late night party Friday nights."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqZ2NYaUNREAE",
            "text": "Very cozy and the ambience is great. Food is amazing.\nDrinks are pretty nice."
        }
    ],
    "reviews_count": 70
}