{
    "name": "Edge of Astoria",
    "place_id": "ChIJb_qJR9NfwokRbMbyA_hc4uA",
    "grid": "QN1",
    "address": "27-40 21st St, Long Island City, NY 11102, USA",
    "rating": 4.8,
    "user_ratings_total": 51,
    "phone_number": "(718) 274-4590",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1ZlNFcFNkWFZ0ZEhOVU4xbGpaMFV0VFhOSFRGRRAB",
            "text": "The Yelp community's collective wisdom led me here. Each dish showed real skill. Their attention to diners was extraordinary! Good flavors and nice staff members. This restaurant ranks with top local establishments."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbTZqb3V3RRAB",
            "text": "Omg…..I stumbled upon this hidden Gem the other night. I can’t lie it was empty but the menu grabbed my boyfriend’s attention. We Ieft and returned later. This decision is by far one of the best decisions we made this week. The hospitality was unmatched. The bread like no other I have ever tried. The grilled octopus 10/10 appetizer and my entree AMAZING. The lamb was cooked to perfection, no salt or pepper needed. The drinks were also very tasty and refreshing. Then to end the night with the lava desert. Overall my experience was the best I have ever encountered at a restaurant from the nicest bar tender and could you believe the chef himself came out to greet us and tell us about his craft of creating delicious delights. If ur in the area or in the mood for great ambiance with tasty food. Run to Edge of Astoria. I have lived in Astoria for 30 years and this is by far one of the best I’ve encountered. Check it out and Thank me later 😉"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURId3EtVF93RRAB",
            "text": "Ate outside for one of the last great summer days. We had the octopus, which was generously portioned and tasted delicious. Great drinks, amazing bread, and super attentive service. All around great place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdmRUVlVBEAE",
            "text": "Not very crowded. Has great food like pizza bread. Great service. Modern cozy spot for a nice date night. Or just to treat yourself."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MllDMC1RRRAB",
            "text": "Perfect date night spot in Astoria. The bread, pasta, steak, lamb and dessert were scrumptious! Staff was attentive and friendly. Will definitely be returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiM19paGF3EAE",
            "text": "First time at Edge of Astoria and it will easily become our neighborhood go to! Drinks were great, service was fab and food was on point. A welcome addition to Astoria. Thanks for a great evening. Cheers!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidktXdHR3RRAB",
            "text": "Absolutely amazing food and service here! The server and bar tender were fantastic and super attentive! The food and drinks were out of this world! Great atmosphere and they have a patio as well to eat outside. They have gluten free and vegan options. I’m definitely going back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNE1YS0t3EAE",
            "text": "Service is friendly and attentive! Nice place with beautiful patio, great drinks and solid food choices. Great date spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNianV5TGxBRRAB",
            "text": "My plate was really delicious 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyODZYUzV3RRAB",
            "text": "Food is excellent, staff is so friendly and professional! You can not go wrong with this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyODhYOFpBEAE",
            "text": "Food delicious, service oustanding !!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOXU2STdRRRAB",
            "text": "Super chic vibe, great food, great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMk1yWld3EAE",
            "text": "A Birthday Celebration to Remember\n\nI recently celebrated my birthday with coworkers at Edge of Astoria , and it was an exceptional experience from start to finish. The food was incredibly fresh and innovative, making it a standout dining spot in the neighborhood.\n\nThe highlight of the meal was undoubtedly the Pinsa. Our team tried all the varieties , and each one was a delightful surprise. The crust was perfectly crisp yet airy, and the toppings were a symphony of flavors that did not disappoint.\n\nThe service was another high point. The servers were attentive and pleasant, ensuring that our needs were met promptly and with a smile.\n\nTo complement the meal, I had the Edge of Spring drink, which was super refreshing and the perfect choice for a warm evening.\n\nEdge of Astoria provided a fantastic setting for a birthday celebration, with superb food, excellent service, and a vibrant atmosphere. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMkp6TXR3RRAB",
            "text": "Amazing food and atmosphere 🥰enjoyed the drinks as well! The staff and chef were great 😌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcUlQNkN3EAE",
            "text": "I had an incredible dining experience at Edge of Astoria! From the moment we walked in, the friendly staff made us feel right at home. The ambiance was warm and inviting, perfect for a memorable dinner.\n\nThe food and drinks were absolutely delicious. Each dish was prepared to perfection, with the flavors expertly balanced. The highlight of the evening was the famous short rib pasta. The chef himself came to our table to greet us and explain the technique behind this extraordinary dish. It was fascinating to hear about the process and added a special touch to our meal.\n\nOverall, Edge of Astoria exceeded all our expectations. I highly recommend it for anyone looking for a fantastic dining experience with great food and exceptional service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb0x2VFZ3EAE",
            "text": "The food is amazing!!! Definitely worth try the steak over, service was excellent and price was reasonable. Definitely coming back again 🤤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMb051X25RRRAB",
            "text": "Had a staff dinner celebrating a birthday and this place exceeded our expectations. The chef came and explained how the ingredients for the pizza were flown in from Italy! You could taste the freshness. 10/10 would come back and recommend! The edge of insanity drink was just the right amount of spicy. 🌶️ 🍹"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OXJqM1RREAE",
            "text": "Amazing drinks,and food ! The restaurant has great customer service, the chef and staff are on point with everything, they went above and beyond to make sure my partner and I felt comfortable! Will definitely be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6dG9HaFF3EAE",
            "text": "The executive chef Chris is a gem. The service is outstanding and the atmosphere is pleasant and welcoming. The server, I forgot to ask his name, is wonderful.  These folks make you feel right at home. We would definitely come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6c3NuZDJBRRAB",
            "text": "Very good food, very good service, also beautiful and clean place sure me and my family we gonna come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURULVphMGdBRRAB",
            "text": "Great place to eat and spend sometime with friends and family. Will definitely be visiting soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdXZyU2lBRRAB",
            "text": "The outdoor space here is amazing! And the food and service make it all the better! Highly recommend. I had the baby artichokes and a pizza and absolutely loved them. I’ll be back with my dog outside soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaS1XNVV3EAE",
            "text": "I recently dined at this local restaurant under new management and was thoroughly impressed! The menu crafted by Chef Chris is simply delicious, blending classic and innovative flavors brilliantly. Every dish from start to finish was a delight. Chef Chris's passion for cuisine shines through, making my dining experience truly memorable. Highly recommend giving this place a try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUODZXX2lRRRAB",
            "text": "The best restautant in Astoria! Delicious food and an excellent customer service. Chef Chris is an amazing person to meet.\n\nSo happy we found this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN1luRnh3RRAB",
            "text": "Amazing octopus, steak au poivre and rack of lamb! Hidden gem type of place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bDRIQnZRRRAB",
            "text": "Got drinks in the backyard. I loved the set up and drinks! Would recommend outdoor area and inside was nice as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eVp1dGZBEAE",
            "text": "Attention people who are allergic to dogs, don’t like dogs, or are afraid or don’t like to eat with them:\n\nMy nephew is allergic to dogs. When we walked in, we specifically asked the man at the bar with the curly brown hair if the outdoor seating in the back had or allowed dogs. He said no. While eating in the back area a dog walked up and it was apparently the same man’s dog that stays outside. Why would he lie???\n\nIt walked right up to my nephew. We asked to go inside and the man who lied about the dogs did not say anything or even apologize. Upon looking there was literally a dog feeder and dog toy outside. The man who lied just looked while my nephew, whose allergic and was scared, and the dog kept going closer to him. He didn’t apologize or offer to bring the dog away and he had an attitude because of it. If we knew there was a dog outside we would have happily just eaten outside.\n\nThe food was good and the atmosphere was nice, and so was our waitress Daria. However that man’s attitude and handling of this situation alone will make us not return respite living very close."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NHUtU19nRRAB",
            "text": "Great service, great food & great environment. Recommend 10/10! Also gave us discounts!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5NmJ2cVlBEAE",
            "text": "The food was cold, the staff were showing me attitude for no reason because I asked for the total before the food came out.... very bad place, they are new to Astoria and they don’t belong here. Would not recommend at all, unless you’re into being served cold and old food"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpLUplc0ZREAE",
            "text": "Really good service"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDbDlQUlJnEAE",
            "text": "Amazing food, wine and service. We will definitely  come back"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDclpLNXJBRRAB",
            "text": "Went for my birthday and the food and service were amazing!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDcVBmX1F3EAE",
            "text": "It's a newly open place in Astoria, with an agreeable backyard.\nVery afordable prices, beers are $5, appetizers $15, glass of wine $8-10.\nNot so big menu, but well-sellected and portions are generous.\nKristina & Tony did a great job.\nWe will definately come back.\nThank you, guys!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDbDdleUVBEAE",
            "text": "Really great service and good prices for drinks and appetizers."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNk8zSGJBEAE",
            "text": "Great food and drinks. Very nice location"
        }
    ],
    "reviews_count": 35
}