{
    "name": "Psari",
    "place_id": "ChIJqe-Kai5fwokRo43jYIv3-DM",
    "grid": "QN1",
    "address": "32-10 36th Ave, Long Island City, NY 11106, USA",
    "rating": 4.4,
    "user_ratings_total": 881,
    "phone_number": "(718) 786-6015",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKd1kzbHNXbTQ0Y1ZjM1Zqa3lWRzVrV0ZWWU1uYxAB",
            "text": "Came here for a special dinner and so glad we did. Staff was very attentive and timely and friendly.\nHad to try their seafood soup! We loved it!\nSangria was really good for a person like me who doesn't drink and hasn't in over a year or two.\nFood was soooo good and filling. We ended up sharing the chicken platter. It was so much food even for two people, had some left overs for the next day.\nI'm still getting used to eating seafood and I'm glad I went with it at this spot.\nI can see why people love it here. Prices are also reasonable for a nice local dining experience.\nEverything 5 stars!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KblNUTTJZMFF6UlhWclFXbGpZM0ZJVUZBeFpGRRAB",
            "text": "Fantastic service. We got seated right away. The restaurant is a lot bigger on the inside than it looks from the outside. Just past the bar there is plenty of seating in the back as it opens into a larger dining area.  There is also plenty of seating outside but it was a cold fall night and the sidewalk is a little too loud and busy for dining.\n\nFor drinks we went with the white sangria. As pointed out by the wait staff. The carafe is a better deal. Same price as two but you get a little more. It came out sweet but not too strong. The fresh fruit were a nice treat to chew on.\n\nFor our meal, we started with the mixed seafood soup. Only offered two days a week, one of those days being Friday. The way the waitress described it sounded like it would be so hearty and it was. Had everything in it for 12 bucks.  See the pics.  It was a great deal. A very large bowl could even be consider a full meal.\n\nFor an appetizer we went with the crab cake. Came out warm and tasted so fresh. A good size too. The condiments went welll with it. Tasted fresh from Maryland.\n\nFelt like we ate so much already but for the entree We spilt the chicken souvlaki platter.  Another huge portion. Was so tasted but we couldn’t finish it all. Had enough to take home.  The lemon potato’s as the side were yummy too.\n\nThe garlic bread on the table. Freshly made was a goood touch. The cappacuniob was frothy and delicious.  The star berry birthday cake slice was plate living good.\n\nThey gave us a coupon for 20% off the next meal over 100 dollars. We willl certainly be back again.\n\nService was very attentive during the meal.  Extra napkins. Water refills. Asking us how the food. was throughly the meal.\n\nOverall an excellent dining experience."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWmMwOHdObXBIYm5SdVZUQnNYMFJsVkdKM1VsRRAB",
            "text": "Had a quick little dinner here at the bar. Started with grilled octopus and fried zucchini and eggplant. Shared a seafood platter featuring crab legs.\n\nUnfortunately, I felt the food was slightly subpar than my high expectations. With the place so busy, I expected the food to blow me away. It was all… fine.\n\nThe best dish of the night was the octopus which soft and flavorful; but not sure why it was all precut into smaller pieces.  The fried food was crispy and golden, but the dips were slightly bland.\n\nThe seafood platter had plenty of options, mostly okay.  The crab legs were the biggest disappointment because of how dry the grilling made them. Did I wish they were more juicy or was I missing the melted butter from the other times I eat them?\n\nService was great as was the semi-dry assyrtiko I was served."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWlZIaHVNazFuWkdRelZsTk9XR3RVUkRsWlRsRRAB",
            "text": "I appreciated the thought put into how this place feels. I struggle to fully express how good Psari is. Their dishes demonstrate bold yet appealing choices. The workers display exceptional concern. You need to taste the food here yourself."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aWJHZGphM2d5WlZwSVJFMDVjemxNWkZaTk5uYxAB",
            "text": "Came here on a  sunday with family, unfortunately ran out of crab, but got salmon and it was nice and flavorful! Love their appetizers of bread, would recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQlgxVm1jRVk0ZDFGdmRtSXlkV2t3TTFsdmIxRRAB",
            "text": "Excellent and fresh fish, great service and ambience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeldUWndSelZoZDFjemRrUnlVMlZxZW5ocmFYYxAB",
            "text": "The Greek food was spectacular! The salmon was cooked perfectly and full of flavor. The French fries and calamari were also delicious and well-prepared. Definitely worth coming back for."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sU1VEVkxNV2RDWlhwUUxXeGZXa1pUTTNaa1pHYxAB",
            "text": "Psari is an Amazing restaurant the food and service was awesome 👌🏾"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdk1IWktUWGxtY0daak9IUXlXR016TTJobFgyYxAB",
            "text": "Went here because our favorite fish restaurant was closed for a break 🙁 It was ok. Wasn’t omg this was great. My husband said his fish was fishy and small. And my fries were subpar. Their fish options were limited. I ordered the fried shrimp and it was ok. The tartar sauce was really bad; it tasted like sweet mayonnaise. The service was good though. But i won’t be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSlUwUk5aVFJTWnkxck1FaHFVM1JrZFhkSU1sRRAB",
            "text": "Get $25 off your bill using the link on my profile!\nThis was a fun little restaurant to stop by for dinner. You can choose a seafood option broiled or grilled, and it comes with veggies or potatoes or fries. I love that they give garlic bread as a starter, which pairs nicely with the soups. The soups were well worth the $12, full of fish in the fish soup, and plenty of scallops in the shrimp bisque. The white wine from Greece complemented the food well too. The staff was friendly, accommodating us where needed. I’ll come back to try the other seafood options."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjM01qbHpaSE5DYVVGU2FqRndhMHhOY0ZoTlJFRRAB",
            "text": "I haven’t been in over 10 years, but the memory is still fresh enough to have me planning a trip back ASAP! I couldn’t recall the exact name, but I’ll never forget how delicious the crab was—perfectly cooked, expertly cracked, and served in a way that made every bite a breeze to enjoy. The service? Just as unforgettable as the food. And as a native New Yorker (born on New York Day, no less!), I can say the ambience felt like home. I’m beyond excited to return and see if the magic is still there!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabFVYZFhXVzlXVjJSTlRrUklkbmhvVGxjMVlrRRAB",
            "text": "Amazing fresh food cooked perfectly. We loved the grilled calamari and the grilled octopus and our waitress was fantastic. This is by far our favorite Greek restaurant in Astoria."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMWVVc3lUblZuWVdzM2RGSTViRXN0VFd0eVYwRRAB",
            "text": "Our favorite place for seafood. Slightly off the beaten track in Astoria, just grilled and broiled fish and more done right."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MVptYzBkMGRZV1dGS2JtSlFRelpuV25odldsRRAB",
            "text": "We love the fresh clams, was really really good! The service was also great. Recommended if you're looking for a place to hang out in the area"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcUxuQll3EAE",
            "text": "We met the owner when we dined in, and he was very nice and offered us a bigger table even though it was just the two of us.\n\nWe enjoyed all of our food, lemon potato was sooo good, scallops melts in your mouth, the clams, lobster, crab and shrimp were all cooked very well. We will definitely come back to try other entrées."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b1VWOTRXSFpWWlRSWFNGTklOelJuU2pZMFMyYxAB",
            "text": "i don't think the price justifies the quality of food.  The crab cake had a very fishy taste and smell to it and it looked like deep fried chicken patty.\nthe swordfish steak seemed to be cut in half and dry.\n\nappetizers were decent which were the specials.\n\nchances of going back for a meal ate slim to none."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKdVp0YURsOU1hZlBBEAE",
            "text": "Psari is an astoria staple for my family\nfor many years now . the food is truly phenomenal and the service is always amazing"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcXJfQTNBRRAB",
            "text": "I can't stop choosing this place every time I'm going out for dinner.  Food is delicious and fresh, drinks are really good. I love sangría and the service, the best👌."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdWFyTm1RRRAB",
            "text": "We went there for a casual weekday dinner. Service, food, interior were all great! We loved fresh fish cooked so well! House wine in 1/2 carafe was excellent quality! I'll definitely come back with other friends!!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbmZHT1ZnEAE",
            "text": "Amo este sitio. Excelente atención y maravilloso menú."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwc2NmLW93RRAB",
            "text": "The food was bland and a bit cold. It wasn’t worth the price I paid to have seafood."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReEpDQ2NBEAE",
            "text": "The calamari was fire and the waiters were all so friendly!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM2RDVENBEAE",
            "text": "Everything was delicious"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOHYtYTNnRRAB",
            "text": "Wonderful Greek restaurant had the broiler salmon with baked potato very delicious 😋"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc0xXeWt3RRAB",
            "text": "Excelente en todos los aspectos"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMy1hMW1RRRAB",
            "text": "Nice"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmb3FxSkZREAE",
            "text": "Best  grill calamari   10 stars instead of 5 thank u  , we will be back soon !!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeXF5YUtnEAE",
            "text": "This was a great place for my first taste of NY! The shrimp tacos are amazing, and the service and owner are awesome. It's definitely worth checking out."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ajlTZHJ3RRAB",
            "text": "So yes, this is another late review. Only the review is late, but I'm always early. My best friend took me here months ago to celebrate my birthday. We sat in the front by the glass window. The restaurant is beautiful, and the restroom is squeaky clean.\n\nChristina was our server, and she had her sister serving us after that. Both ladies were lovely and friendly. We ordered cabbage salad, grilled squid, fish taco, and branzino. Everything that we ordered was exceptional! I'm not a cabbage eater, but this cabbage salad made me a cabbage lover. It had a great light taste. Then, we moved on to the grilled squid. Wow! This was my favorite of the night. It was to die for and too young to ignore. Yummy! Then we shared another dish, the fish taco. It came in two. It was pretty good. After that I had the Branzino. Excellent fish with light seasoning. It was one of my best! Hubby came to pick us up, and he thought the restaurant was great and planned to dine in with me soon. He wasn’t joking. Within a week, we came back to order. Then we came back for lunch. They offer nice lunch specials! Restaurants in NY are getting smarter. The lunch specials are important if we can do this at busy locations. It’s $20 per lunch, and you have plenty of choices from the menu. The portion is slightly smaller than dinner plates, but it was worth it. We have tried the grilled octopus, stuffed flounder, swordfish, and smelts. Everything was great especially the stuffed flounder. At lunch, Agnes took care of our table and takeout. Another lovely waitress. I’m glad to have found another Greek restaurant in the neighborhood. I love the restaurant and its menu. It serves fantastic Greek food, and it is recommended to all!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURObnVDUm5nRRAB",
            "text": "- Cute little restaurant in Astoria that also has outdoor seating. Food is great every time! Appetizers and entrees are delicious! You get what you pay for that is for sure. Wine list is great too. Will definitely plan to go back when I am in town.."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbVpEVWt3RRAB",
            "text": "Excelente 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaXBuWHFRRRAB",
            "text": "Great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueGZxbkVREAE",
            "text": "Excellent food, exceptionally attentive staff, clean, highly recommend this restaurant! Thank you for the excellent salmon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMk5Xbi13RRAB",
            "text": "Was having a day trip in the area the other week when I was in the mood for grilled octopus and I found this place. The staff was quick, friendly, and attentive. Their lunch special pricing was great and the octopus was exactly how I was hoping it would be!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcXBhNmxBRRAB",
            "text": "Lovely family owned restaurant with outdoor seating. Xena and her uncle are wonderful.  Ordered Fresh red snapper and tender octopus"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURId1BqQXZnRRAB",
            "text": "I really didn’t like the service food was ok this time. But when I went there last time food and service was excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bm9US1BnEAE",
            "text": "Came to have an early dinner with my daughter. I have dined here before with my mom so i thought to give it another try being my daughter had been craving seafood. Service was quick due to it being a Thursday and staff was friendly. Food was okay I’ve had better. The fried octopus was amazing. My daughter ordered the king crab legs with lemon potatoes and I ordered lobster tails with lemon potatoes. My daughter really didn’t like the seasoning on top of the king crab legs plus it was like six legs. What threw me off was that when the bill arrived it was $172. The crab legs alone were $76 for that portion that was outrageous. Honestly I don’t think I will ever return I have eaten in places around the world that the crab legs and they are way cheaper and I’m given a larger portion. Definitely not worth it and will not recommend or return. The bills didn’t include gratuity either. I’m definitely not cheap but I just don’t waste my money on six crab legs for $76"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiZ1BxVGVREAE",
            "text": "Scrumptious food. Excellent seasoning. Garlic bread is superb."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiejdiam1nRRAB",
            "text": "Such a cute Greek restaurant. Very cozy and great staff. The food was delicious and portions were large. Would definitely come back if I'm in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMTZiUU5nEAE",
            "text": "I want to take a moment to thank the chef and the staff of Psari for not only delicious food, but also such excellent, heartwarming service. My friends and I were there today to celebrate a birthday, among other things, which we had mentioned in passing. And the staff brought out a delicious chocolate cake as a total surprise. I’m touched! And I will keep coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyb2ZPTmJBEAE",
            "text": "Food have no flavor at all the owner don't work his business on Sunday so the kitchen people do what ever they want and offer you the worst service they do not put any flavor not even salt to the food have good representation you get happy with it thinking will be delicious but after we try it was horrible tge worst food I ever try,and on top of that paying pretty much expensive that fish was pretty expensive to come and messup the order like that that fish plate was $40.00 dollars each one I was so disappointed about it because I took my friend out to eat for his birthday when we can go to another cheaper place to eat hundred times better flavor the only thing good there was the friendly waiter that Provide service because I even have to ask to change the waiter cause the one on charge wasn't to favor horrible is many other in tge area way better than this place when I ask why the food have no flavor the excuse they give me was that they cook like that because to keep the food healthy when healthy dosen't mean no flavor at all hospital food was way much better don't waist your time sorry buddy I ask for you but you was not able to work the matter out because the person you live in charge have no restaurant skills...."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyZ1k3dXhRRRAB",
            "text": "A very delightful experience. Excellent and courteous service. Food was great !  Especially , because of the price.  And very nice portions.  All together great place for seafood and a enjoyful lunch !   A must to go !!!     A big fan !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNmFqbWJBEAE",
            "text": "Food is good, very decent scallops and branzino  but… beware of the hidden fees without warning, that they explained were 3.5% cc charge that turned out to be more on paper. Service was subpar for a pretty enmity restaurant. Could do better"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBZ1BuTUJ3EAE",
            "text": "I love this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6c3FLQ2V3EAE",
            "text": "I would definitely recommend this place and will come back for sure. Everything was so fresh and delicious from appetizer to the dessert as well as the drinks. And the services was great."
        },
        {
            "date": "1년 전",
            "language": "ja",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbmVuNlFnEAE",
            "text": "仕事帰りに一人でふらりと来訪。ギリシャワインとベイクドグラムスでまずは一杯。付け合せのガーリックブレッドに貝をのせて食べると、最高のおつまみになりました。メインはグリルドティラピア。白身の淡白さがこれまた良し。断ってしまったけれども、店員の方が勧めてくれたタバスコをかけると味の変化が楽しめてなおよかったかも。大きかったので、半分は家に持ち帰って翌日のランチになりました。前菜、メインとオイルベースだったこともあり、口をさっぱりさせるため、デザートはレモンソルベを選択。甘酸っぱく、冷たいソルベが爽やかな気分にさせてくれました。初夏の夕暮れにピッタリな素晴らしいディナーになりました！チップ込みで総額60ドルで、コスパもよく、店員の皆さんもフレンドリーで、機会があれば再訪したいです！"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb0t5ckJREAE",
            "text": "Terrific seafood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqczltbGZ3EAE",
            "text": "Very good food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4Ml95NEdREAE",
            "text": "Not the best experience. The stuffed grape leaves were clearly microwaved and not fresh. Spinach pie was a bit better, but didn’t taste fresh either. The grilled shrimp were great. I’ve had better Greek food in this area…Staff is friendly and fast."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdC1QZ2VnEAE",
            "text": "Really enjoyed our meal here on a beautiful Sunday noon. There was a beautiful outdoor setup with plenty of seating inside if it got too hot.\n\nThe two of us shared the Broiled Combo and the Greek salad. The salad refreshing but nothing that special, but the Broiled Combo was delicious. It had a good portion of salmon, flounder, shrimp, and scallops for two. The salmon was so tender and juicy that it melts in your mouth. And top the sauce with some of that homemade garlic bread (comp) was a fantastic meal for us."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeU02TzV3RRAB",
            "text": "Psari is a great option for lunch.  There is outdoor seating as well as plenty of seating inside. In addition to the wine menu, they also have some delicious frozen drinks that are perfect for feeling refreshed on a warm day.  The food is great here.  I won't say I love everything on the menu, but everything I have had recently has been on-point.  The stuffed shrimp, rice, fish tacos, house white wine, and mango margarita were all perfect.  In the past I have had the scallops as well which were very good.  The house salad is also nice.  After reading reviews here, I think grilled octopus is the next thing to try here.  The service is good too.  Will definitely return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dUstUXl3RRAB",
            "text": "Seafood is nice. Lunch special comes with large portions so you will be very full. Or take to go. We had a side of half dozen oysters and one was not fresh. Service was quick and good. Greek salad was ok. Garlic bread really good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMmNyRmhRRRAB",
            "text": "The only good thing about this place was the garlic bread. For the price of $86 you can get rubbery crab legs that are no longer fresh. When we asked to speak to the manager they said they couldn’t do anything about it that they’ll give us a call. Even the Greek salad was bad, how can you mess that up? The calamari was also rubbery and tasted old. The octopus was decent. Far better places in Astoria for seafood. Would not recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeGJmZVZREAE",
            "text": "The food here was incredibly sub par. Not at all worth the price we paid or the travel time to get here.\n\nWe got the fried calamari appetizer and it was bland with an unseasoned breading and the calamari was chewy. We had the scallops which tasted not fresh, were chewy, and were way over seasoned. The vegetable side dish was mediocre. Not flavored well but cooked fine. Tuna steak was over done and over seasoned.\n\nNothing we ate here was good. It was not inedible but we did not enjoy anything we ate. We were extremely disappointed. Would not return.\n\nThe only good thing we can say is that the service was great. Very friendly and attentive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdnBQXzdnRRAB",
            "text": "My best friend took me here for my birthday and everything was delicious. From the moscato to the appetizers to the main course to dessert. Even the bread was yummi!  want to go at least 1x a month."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVeWJXQjRBRRAB",
            "text": "Fist time on this side of town. Usually, I write reviews about breweries. However, this seafood restaurant is the best I’ve had yet in NY. The seafood was amazing and portions were really generous. However, the most amazing part was the…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBX1liSU9nEAE",
            "text": "Psari is a dynamite place in Fish and seafood restaurant in Astoria Queens! It was originally called The Greek Captain which has been a staple of Astoria for dozens of years. A new owner took it over and remodeled it changed the name to Psari.\n\nThe ambiance in Psari is very nice intimate setting. Psari is a perfect date place.\nThe service is awesome and the food and very on point! They have a great lunch special as well at a great price point!\n\nPsari is known for its fresh fish and seafood selection. The Grilled Octopus is extremely delicious!  It was seasoned & grilled perfectly. The Clams and Oysters on the half shell we fresh as can be. The Fried Calamari was tender and fried to perfection. and don’t forget to try the Dip Combo With Pita and Saganaki. One word for the Baked Clams “ WOW”\n\nNot only do they just serve fish They also have a great selection of Greek Style Lamb, Pork and Beef as well which are all grilled and seasoned to perfection.\n\nComplimentary Garlic bread is served prior to your meal.\n\nThey have an very nice wine list also a nice selection of Beer & Liquor and also have Champagne"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNk0zVTdBRRAB",
            "text": "This is a small restaurant, I like the atmosphere, it's like being on the beach with their colorful shades of blue. Food wise, we tried the lamp chops and some mussels, they were divine and their bread toasted with butter and garlic was like magic as well. Their Pina colada is great also. I think this is a nice place to go either for a date or family. I am gonna come back for a full dinner and see the experience."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBLXF1cWt3RRAB",
            "text": "Wow, what an experience. This seemingly small spot delivers sea to table quality seafood in generous portions. Half dozen oysters were large and succulent, everything you'd want with a choice of sauces. Broiled combo was a beautiful…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bGV1cGh3RRAB",
            "text": "The service is five star, excellent! I feel very welcoming, and the food is amazing! Love the fried calamari, fresh inside, crispy outside. They have outdoor seating with heater, very comfortable! Will definitely come back here again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcXVXZGRBEAE",
            "text": "Great place to meet for lunch. The food was really delish, and service was fast. The environment was perfect to catch up with friends and not feel rushed. We enjoyed sharing appetizers and left full. Recommend you give it a try if you're in the area."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURncExHZHhRRRAB",
            "text": "Nice little greek restaurant.  Simple but appealing interior, very friendly and attentive service, and the food is very good.  Great option for Greek food in the area.  Not cheap, but typical for good quality seafood these days.  Sole, pork, stuffed shrimp, saganaki, and loukanikos all very good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdThlajJnRRAB",
            "text": "Octopus is in the top tier of what I've had anywhere in the world - fresh and perfectly cooked. Excellent grilled snapper. Great service. Good value. Very much worth trip out from Manhattan!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNHVmejZnRRAB",
            "text": "Years ago I visited the restaurant, by that time one of the waitresses recomend me to try the grilled octopus. My God since then I still go for the same plate. Is a renewed restaurant, but the food have the same flavored. They make a…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnODZ1ZDJRRRAB",
            "text": "Nice seafood restaurant without breaking the bank. They accommodated a party of four without any reservations. Food was great, service was good, just a tad bit slow, which is okay since the restaurant has a nice ambiance. Great location, would definitely come back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNXZpdjN3RRAB",
            "text": "Well, well, well, if you're looking to turn your museum visit into a Mediterranean flavor fiesta, look no further than Psari! Located right by the Museum of the Moving Image, this place has got Greek and Mediterranean cuisine down to an art form. 🍤🎨\n\nLet's talk food, shall we? It's not just good; it's \"skip-the-museum-and-stay-here\" good. Grilled prawns that practically dance on your taste buds, a fish soup that's like a warm Mediterranean hug, and salmon that's so fresh it might as well have been caught a minute ago. And don't get me started on their chocolate cakes – they're the stuff of dessert legends. You'll be dreaming about their asida and ice cream long after your plate is empty.\n\nNow, the drinks – oh, the drinks! After a day of exploring moving images, you deserve a glass of something special. Psari's got you covered with a delicious white sangria that'll have you singing its praises. And let's not forget their house wine and white wine options – the perfect companions to your culinary adventure. But hey, if you're not in the mood for wine, they've got great coffee, lemon juice, and lemonade to keep you refreshed and ready for more museum-hopping.\n\nNow, the best part – you can celebrate just about anything at Psari. Wedding? Anniversary? Birthday party? They've got you covered. With a staff that's as hospitable as it gets, you'll feel like royalty celebrating your special day here. Their cool service is the stuff of legends, and they make sure your experience is as smooth as freshly churned ice cream.\n\nAnd speaking of ice cream, the lovely decor and peaceful atmosphere make Psari the perfect place to relax after a day of museum exploration. It's like stepping into a Mediterranean oasis right in the heart of the city.\n\nNow, let's talk money. Adequate prices? You betcha! Psari delivers top-notch Mediterranean cuisine without breaking the bank. So, you can enjoy your meal without worrying about your wallet going on a diet.\n\nIn a nutshell, Psari is where your taste buds take a Mediterranean vacation, and your soul finds relaxation right after a museum adventure. So, next time you're at the Museum of the Moving Image, do yourself a favor and reserve a table here. Your taste buds will thank you, and you might just end up celebrating something special. Cheers to delicious adventures! 🍽️🥂 #MediterraneanMagic #PsariPerfection"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLaF83cWxRRRAB",
            "text": "I've been coming here for a couple of years now. Consistently delicious seafood. I usually get the Greek combo (Crab legs, stuffed shrimp & clams, lobster and scallops) with a side of potatoe chips with feta. That's literally all I've ever ordered besides the lobster bisque and Sandria..which are both very tasty."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdjVfMV93RRAB",
            "text": "Psari is such a great greek restaurant. It's my go-to for fresh and delicious seafood. We go here at least once a month. Their octopus is perfectly cooked, and their broiled fishes are always moist and rich. I always leave feeling happy and satisfied."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbzZYQVpREAE",
            "text": "This is one of my favorite seafood options in the neighborhood where I live.  Psari never disappoints me. The atmosphere is pleasant and the service is always very kind. The food is delicious. A special highlight for the shrimp soup."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVaDZYam9nRRAB",
            "text": "Another gem Greek spot in Astoria. We opted for the fried smelts (yum!) pita with dips (delish!) and the Greek combo seafood platter (amazing!) Service was attentive without hovering over the table. We sat outdoors so I don’t know how the ambience is inside. I would definitely come back here for seafood night. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cEpfMEpREAE",
            "text": "A bit pricey but no complaints about the food. The seafood was fresh & well done.  Great service as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcXFuN2Z3EAE",
            "text": "Clean and quick service. We had scallops and lamb burgers, both were delicious We loved the lemon potatoes and Greek chips😋"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1d3AtcExBEAE",
            "text": "Such a great atmosphere 👏 amazing service, wine 🍷 was 🥰,little neck clams were to die for. I had the broiled snapper and hubby had the Salmon 🐟 it was just amazing.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycW9lUGd3RRAB",
            "text": "Big oof. So many things were off and it was consistently off across the board. I hope this message gets across to the owner and they can make some changes because these are all easy changes to make.\nMy order: grilled calamari, grilled octopus, grape leaves, fried smelts, potato chip side\n\n1) It’s like someone forgot to salt everything! If you are trying to go easy on the blood pressure, at least give us some potassium salt.\n\n2) none of the fried smelts have been cleaned. It’s like I’m eating bitter sand with a hint of fish. This is a dish I commonly get in NYC and I know the fish is small but to not clean them at all… com’n man.\n\n3) grape leaves, crunchy rice. Raw in the center soft on the outside raw rice. Maybe someone kept opening the lid when cooking. Set a timer and come back next time.\n\nThis would have been a 1 star review but the quality of the texture on the squid, octopus, fried smelts, chips, and garlic bread are all solid. This means that who ever cooked those items knew the timings for those items which is why I have hope for this place.\n\nRespect yourself and your customers and clean the fish. A little bit of salt and you can make a come back. Set a timer for the rice and you’ll be competitive again."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDME5pLWN3EAE",
            "text": "The food here was very good fried zucchini and eggplant are an absolute must, greek salad is stunning & I had the oysters again let me tell you how good these were! Ugh so mouth watering! 😍 The outdoor seating was magical and very warm! I even got to sit with my puppy.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdkxlSkN3EAE",
            "text": "Delicious meal, the price take down one star. And they charge 3.5% if credit or debit card payment. Bring cash."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1emVhNEhnEAE",
            "text": "The food is over delicious 🤤. Try the salmon and octopus 🐙 something to go specially to eat it. Easy to access from the 6th."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROODRQYTFnRRAB",
            "text": "This is a beautiful place very low key decor is nice, food is fresh, attentive staff will definitely visit again. We had the crab cakes and chicken souvlaki. The waitress was so nice and congenial. Really nice experience 👌"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyM3ZtTEhBEAE",
            "text": "I love Psari. I've been coming here for a few years now,especially back when they had the best deals on Groupon. Their lobster , grilled branzino and lemon potatoes are delicious. The food is always fresh and the service excellent. They…"
        }
    ],
    "reviews_count": 79
}