{
    "name": "Blend on the Water",
    "place_id": "ChIJaQR-pCFZwokRNMloynEQPgA",
    "grid": "QN1",
    "address": "45-40 Center Blvd, Long Island City, NY 11109, USA",
    "rating": 4.2,
    "user_ratings_total": 5722,
    "phone_number": "(718) 606-9851",
    "reviews": [
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVlJXaE9XRjlIYTB3MWRrRkdPRkpuTVVSTFVuYxAB",
            "text": "My recent visit to Blend on the Ocean was somewhat disappointing, especially given the restaurant’s reputation and the fact that it wasn’t very busy at the time. Despite the low crowd, the wait for our food was unusually long. I noticed several tables that were seated after us receiving their meals well before ours. The staff appeared somewhat indifferent to the delay, which made the experience more frustrating.\n\nWhen I brought this to the manager’s attention, he was courteous, checked on our order, and offered a discount, which I appreciated. However, when the food finally arrived, it didn’t live up to expectations. The chicken was dry, as if it had been reheated with fresh cheese added on top. The plantains were the highlight of the meal—well-cooked and flavorful—while the rice was just average.\n\nOverall, while the restaurant has a nice atmosphere and potential, the service and food quality on this visit fell short of expectations. I hope my experience was an isolated one, as the location and concept deserve better consistency and care."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GR1puRnVVRGRGWkZKYVNGRk5aMkZ2WkVaS1FWRRAB",
            "text": "The steak tacos are mad good and I lost my voice so they served me green tea with honey and lemon. Atmosphere is lively and the food is good."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaVpXZDFlSEIzYVhCU2JtSjJUVVp3YW05UVVFRRAB",
            "text": "Fantastic experience for a family event. Definitely recommend it."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQmRVdDJXVFZQWkRaMlIzQmhOVjlsYVdGeVdtYxAB",
            "text": "I can’t say enough amazing things about this restaurant! I proposed to my girlfriend (now fiancée!) here the other night, and everything was absolutely perfect. The food was incredible, the service was exceptional, and the views outside were absolutely beautiful. They even let us decorate the patio into the ideal setting for such a special moment.\n\nA huge thank you to the manager, Ashley, and our wonderful waitress, Camila, who went above and beyond to make sure everything went smoothly. They truly made us feel cared for and made the night unforgettable.\n\nThank you to the entire team for helping make one of the happiest moments of our lives so special. Highly recommend this place to anyone looking for amazing food, great service, and a truly memorable experience!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odVFVRmZNMU5uVEdwdFNuRjFabXRxWkhORmJWRRAB",
            "text": "Food was delicious. Great music. Cool ambiance. No complaints."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMWNsWjVNbFZJY2sxc2JqSlJkMHczU1VSR09XYxAB",
            "text": "Visited for the halloween mom dad & me brunch. It was a great time. My kids enjoyed themselves and my daughter loved the activities. Areina (not sure if I spelled it right) was friendly and provided great service!"
        },
        {
            "date": "1주 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeFFrWkNWWE5sV1ZCVlYyWjFVV2cwYTI1VFpuYxAB",
            "text": "اصديقائي العرب ،،\n\nعليكم ب هالمطعم وايد لذيذ و غريب .."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kck0wUk9VbFp1Y0c5WVpEWkNTRmhRY0RKeFZFRRAB",
            "text": "I really enjoyed my Sunday night. Valentina was so sweet and understanding. The food was algo great!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psR05UaGtZa1l3YzFaa1EwRnRkR3BmWW1GaloyYxAB",
            "text": "Great place for event. Not the best place for romantic dining. Menu is limited. Service sucks, everyone feels overwhelmed. When paying the waitstaff stands over you, not directly pressuring you to leave a tip, but you feel obligated. Sucks because its a wonderful location, just expectations were set to high! Great place to meet beautiful women. They dress to impress. However, its NYC there are better options."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todGNuRmFiRmRqUWxGU1gzaFJZbXhtY2tGaWVHYxAB",
            "text": "I was really disappointed with the food and prices. The portions were very small, and the flavor wasn’t great. I ordered the rice with seafood, but it was full of green peas and didn’t taste fresh. I also ordered three tacos, and they were so tiny they could all fit in my mouth at once. Definitely not worth the price."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaVNWSnhaek5sTUdkcFFWVXphMGt4TjJkcFQyYxAB",
            "text": "Was told to take my hat off 30 minutes in side. I find that very rude especially when I see staff wearing hats. Also the server who decided to advise me this later did not tell women to take of their hats as well. Be aware, if you choose to sit at table , you cannot have happy hour rates as well although it is literally a few meters away from the bar. Food was bland."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCV1gwUnFYMGhIZVdSaFpFcDJkamhOTFZkVVdrRRAB",
            "text": "Comida latina muy buena.! El postre excelente"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZd09UUjNkbVJWTURKSllURTBlRlpuZEVNeWJWRRAB",
            "text": "On Sunday, October 19th, I had a reservation for 8:00 p.m. — a table for four adults and two children aged 6. I had to wait almost 30 minutes for the table. The service was terrible: the person taking the order was not paying attention, and once the order was placed, no one returned to the table. We waited a very long time for the food, and the portions were the smallest I have ever seen at a restaurant for that price. We all ate and were still hungry. We ordered seven extra items and still — nothing. The drinks were just as small.\n\nThe only good thing was the fried plantain appetizer, because even the guacamole had nothing special about it. Honestly, a very, very bad experience — I would not choose this place again, especially since they charged a 20% tip even though I was dining with two children under 7 years old. And without any shame, the waitress still asked for an additional tip when we only saw her to take the order and to bring the check."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVFdtdEVWMVZOVFROMFVrMUVjREk0VUhKcU1sRRAB",
            "text": "This was my second time here, and i was SUPER disappointed.\n\nOur group, which consisted of 20 people, made a reservation at 8 for our friend's surprise birthday dinner. We all arrived before 8 pm, hoping to be already seated before the birthday person arrived, but they told us we had to wait. We were a little mad, but we were okay. 8:15 hit and we still didn't get a table. We were all standing between the exit and the bathroom. Waiters, other customers and my group kept bumping into one another. One of my friends spoke with the manager and we got told there was nothing he could do.  We asked if we could get a drink while waiting, and they told us we needed to a order at the bar. . The bar was full.  After a while we asked again, and were simply told there were too many parties and they were still trying to seat us. We finally sat down a little after 9.\n\nGood food, poorly organized.\n\nI am not sure if they even offered a discount for having us wait for over an hour for a reservation made a week before. If you knew you overbooked, they could've given us a call to schedule a little later. Especially if it was a big group!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NFozaDJWMjVxVkV0WFFXWXliemhqTFVaQ05GRRAB",
            "text": "Went for brunch on a Monday it started to get busy more towards the afternoon. Nice atmosphere and nice decor"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBc0piTFJBEAE",
            "text": "Waitress was a five star, dessert amazing but the food was terrible the mussels were really bad the rice w seafood horrible"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdFVGTjJXVWR5VFZCbldqZElWMEpqUWkxcE5tYxAB",
            "text": "Amazing place. Highly recommend.\nMiami vibe."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjdFZsWnNjak16YVhGV2NWQkhXblJ1YWxVMWVHYxAB",
            "text": "Great food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Fd2FUZG1ibTExV1dSTmVVaEVkRkpOZWpCYVoyYxAB",
            "text": "Celebrating my mother in law’s “21st” birthday day and glad we choose Blend…. Thank you for a great night."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMVdEYzBWekJvVlRScFduRnlORGxGVUhocmRYYxAB",
            "text": "I love the place"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWlYzWXdZMnhmT0dNNFJXUlplRGxpUnpWbU5YYxAB",
            "text": "Food is ok small portions you will need McDonald's after . expensive sugary drinks"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRE1ucG5TVzVWTmtwMVpEWkdhalZ1YVd0MWMyYxAB",
            "text": "Hospitality professional,  food delicious  with exceptional presentation. Cocktails done right."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSlkzUXpTbWhtZWtGQ1NrdHlTVGxsYm1rNWFWRRAB",
            "text": "I can not rave about this place enough! Camilla made our first night in NYC feels so personable and magical. She knows the menu like the back of her hand. The food was AMAZING. Wish we could eat here every night!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taV2VHSnJXbVpNWTBsSFVucDZla0Z5T1dwMVdFRRAB",
            "text": "My Sister and Brother in law got married on 10/10/25 and chose this restaurant for us to eat at on their wedding day.The food was good and the Manager on duty that evening was rude, unwelcoming, and unprofessional (the one with the small ponytail in his hair). My Sister made reservations for a party of 13 instead of 16 by mistake. When we got to our table we realized we needed another table added to our party and my Sister notified the manager in which he replied, \"you said 13 not 16\" and my Sister replied she apologize she miscounted by mistake. He helped add a table with a negative demeanor and attitude as if he was inconvenienced even though the restaurant was half empty of customers at this time. My Sister told him thank you after the table was added and he ignored her as he walked away. There were a few other employees there who gave us an unwelcoming stare which we clearly ignored. There was a photographer present at the restaurant who took pictures of my Sister and Brother in law and our dinner party spent over $300 on photos taken with the Newlyweds in it. As we were about to leave the photographer was getting our last photos together and being paid for it when the manager rudely interrupted us and told the photographer \"we need these tables\" which in other words he wanted us out of there. I wasn't raised to dislike anyone different from me and I know racism when faced with it and this was a clear case of it. I'm going to be specific by saying our entire dinner party was African American/Black. We were done eating and most of us were standing up about to leave as we waited to pay the photographer who was great by the way. My Sister and I addressed the manager directly and told him we're done and about to leave we were only paying the photographer for the photos we purchased. He said \"it can be done over there\" pointing to the area near the exit and my Sister told him the photographer asked for the pictures to be taken at a spot right beside our table. My Sister told him \"we paid our tab which was a little over $1,000 and spent a little over $300 on pictures from your photographer.\" The managers' reply was \"She (the photographer) has nothing to do with us\" and remained very defensive and unapologetic (not that we were looking for an apology anyway). It was disgusting seeing someone in charge with such arrogance and a dismissive attitude. My Sister informed him that she owns her own business also and that's not how you deal with customers at all and I told  him that the photographer works in your establishment so it is connected to you (regardless if he was telling the truth or not about her \"having nothing to do with\" them). He went on to say \"there's a 2 hour seating limit here\" which we undoubtedly didn't exceed. Furthermore there wasn't even a dinner party waiting to be seated nor one outside of the restaurant waiting to come in either. Clearly he just wanted us out and made it unwelcoming from the time we walked in. Thank God his pathetic unprofessionalism didn't ruin the Bride or Groom's time at the restaurant and we all still enjoyed ourselves as the waitress we had was great. I don't need a comment with a reply from the restaurant stating \"we apologize for this experience\" or \"sorry\" because the manager wasn't or isn't sorry in the slightest bit. He will continue to conduct himself in that unprofessional manner and treating people the way he treated us. Very unfortunate having a manager there like that at such a nice restaurant with good food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cVNtZEtXSFZOVUZCQk9IZHpMWGRmTVdOeFVGRRAB",
            "text": "The most amazing views I’ve seen!! Highly recommend to anyone looking to see the City from the outside but taking it all in!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOV1dHOHRYemREWlVFMWRVVXRhRTF2WjFGWGVWRRAB",
            "text": "Good view , nice music (a bit loud). The steak, plantain, and rice & beans were delicious. Definitely a good vibe. Would recommend."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeE5HaDRUVTFsWTFwelMycFBiRVpVTmxWcVFVRRAB",
            "text": "A bit disappointed, to be honest. I had high expectations for this restaurant, but from the start things felt a bit disorganized. We had a reservation, yet when we arrived there was no table available. The initial response was to wait at the bar (which had no space either). After a while we asked again, and were simply told there were too many parties and they were still trying to seat us. We were about to leave when they finally gave us a table.\n\nI ordered the filet mignon, which came overcooked and a bit dry. The pineapple tres leches dessert tasted more like a regular cake than a proper tres leches.\n\nThe place itself is beautiful, but it definitely felt disorganized, and the food didn’t really impress me."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWFJ6TTFZMk5aV1ZsamNqUnRhMk5qUmxKU1ltYxAB",
            "text": "Awesome place for a celebration. Food and price was awesome. Love the vibes and the outdoors scenery by the water. Excellent for pictures. I would have given 5 stars but the parking is terrible. We had to park in the lot."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUmJ6bG5kRGhsZG5kR1ZuaGtUMFF4UTA1ME5IYxAB",
            "text": "Should go and try that place"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xYVpHTXdlV3RQWVhCbE0yOXJVSFp4WW5kUE5GRRAB",
            "text": "Great place. I recommend it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSWJERjNlVEZuYmxsMFdrSlhTVk5qT1ZsMWEzYxAB",
            "text": "Chicken was so dry portions are so small Blend lost its spark - stick to the steak."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGYWJIbzVPWEp2TkhoYU1VVktXbWRUTm10eFgxRRAB",
            "text": "We visited on a weekday for brunch. The entire staff was kind and attentive. The food and drinks were amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScVQyZDRSblZrTTFKa2VFbERWa3hQYlZGWGNHYxAB",
            "text": "Love it here. Food is always top tier and drinks too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TGFGaGpZMEZLV1hjek0wWkRRa1JaU2pkMGVYYxAB",
            "text": "Great experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSE4zZG1kMUZmTld4a1J6VnFWa3BhUnkwdFExRRAB",
            "text": "Honestly, this place is overrated. The drinks were actually really good. I had a coconut caprinihia. But the appetizers were soo bad. I was soo caught off guard by not only the presentation, but also the latin flavor being nonexistent in the dishes. Definitely a huge disappointment since it’s in such a nice area. They really need to step their menu, cooking skills, and presentation up. No flavor and very questionable presentation. Yikes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRFQzZDRZMHRqZVZObFlqaHBNMDlQZDI5bFFsRRAB",
            "text": "Really loud and understaffed place. we were not getting service for over an hour and had to wait and wave people down. Would not return,\nsuch a terrible experience.\n\nThe two things I tried were short rib Arepas that were supposed to be crispy, but came out soft. The coconut flan was definitely a stand out and a really delicious dessert."
        },
        {
            "date": "수정일: 1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SR1ZrUmlXbGszZVhCaVowTmlha0ZZTFZBM1FWRRAB",
            "text": "Me encanta fuimos a celebrar el cumpleaños de mi marido lo pasamos espectacular , y tiene buenos precios no tan caros , y pronto volveremos a ir"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVVZIVnBkMFpvUlZCNVgyZHJhRXh0TmxBd1ZIYxAB",
            "text": "I really wish I had chosen a different restaurant. While the ambiance is nice, everything else was a huge disappointment.\n\nThe pasta was undercooked and came out completely dry—no sauce at all—and the shrimp was also undercooked. The dish was bland and honestly inedible. We also ordered the mac and cheese, which was just as bad: flavorless, no breadcrumbs, and felt like something thrown together with no effort.\n\nTo make matters worse, the service was terrible. The restaurant was so loud that I had to literally yell at my server just to place an order. When we first arrived, we had a blue Long Island iced tea at the bar while waiting to be seated, and it was actually hot. Not room temp—hot. Once seated, I had to ask the waiter to remake and shake our drinks to make them at least drinkable.\n\nThe manager’s response was nothing but a quick apology. No attempt to make things right—not even removing the awful pasta from the bill. For the price they’re charging, this was an absolute rip-off.\n\nBottom line: Overpriced, underwhelming food, bad drinks, poor service, and way too loud. I would not recommend this restaurant to anyone"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeFZVcE1SalJuYVVWV2FVcDRObmRFY1ZKcGFsRRAB",
            "text": "Always a go to for brunch on a Saturday or Sunday 🤞🏽"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaGFWUmFjbUp1TVdwVVJreGFjMjlJYTBkdU1HYxAB",
            "text": "The service was good, the food was tasty. I had the salmon with the cilantro mash potatoes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKc2FVWXhSRWhzZFhKT2RGOUlUME52UVhSeVdHYxAB",
            "text": "This is such a great place in Queens. I’ve came here a couple of times with the first time being in 2015. The food and drinks are always good. The place is always nicely decorated and clean. The staff is great too.\n\nLimited street parking but there are garages at a short distance for the restaurant.\n\nThe views are great as well!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RGRtTnpZM0J2WVVOdVZ6aFdaR3AyWVhOUE9FRRAB",
            "text": "ASHLEY IS AN AMAZING EVENTS MANAGER WHO MADE OUR EVENT COME TO LIFE!!!! HER TIME, SERVICE, AND SUPPORT ARE UNMATCHED!! AIMEE IS AN AMAZING SERVER AND WE WOULDN'T HAVE HAD THE EVENT RUN SMOOTH WITHOUT HER!!! THE GM WAS SO HELPFUL AND SUPER SUPPORTIVE!! FOOD AND AESTHETICS WERE TOP NOTCH!!! HIGHLY RECOMMEND!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdWRWOTJXamhMY21acGEwaERTVmx5YjBKcE9IYxAB",
            "text": "Nice atmosphere.  Mediocre service.  Explains automatic gratuity."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STlkySkpVWE5yTldOMVFrVkRRM0o1VTBsVVZIYxAB",
            "text": "The place is a tourist spot. it has nice views of the east river/manhattan and bridges. The food however wasn't the best tasting. Small portions and not worth for how expensive it is. i ordered the lomo saltado, and ive had better from other places. Drinks were okay, overall the atmosphere is nice. the inside of the place is nicely decorated but if you're the type of person who prefers going for the food rather than the aesthetic of the place then i recommend going somewhere else."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQ2RFUkxhamhqWkZsclpqVlZWbXBsVDFsQldYYxAB",
            "text": "Un 10/10, desde la atención en recepción, con los meseros y la delicia de platillos que manejan.\n\nTuvimos la oportunidad de probar arepas, camarones empanizados, brochetas de pollo y arroz con mariscos 😮‍💨 todo riquísimo.\nNi hablar de su piña colada, sin duda un lugar con un caluroso ambiente muy latino y acogedor.\n\n100% recomendado."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oc09Vb3pSRTFrZVUxalVIaFdNM0pOUjJWMldGRRAB",
            "text": "Pedí salmón con puré de papa y estaba delicioso"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUFVqVldabDlpYkRKclluaERNM1J2UTNkTVUyYxAB",
            "text": "Excelente lugar y comida !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMWNtdG1SVmhmY2xONldVNXlZMlZyTmtVd1dWRRAB",
            "text": "Staff was very kind and accommodating. Definitely recommend"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEd3FTdWlnRRAB",
            "text": "생일날 가족들과 함께"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTU4zcHVRV0pyU201eWVTMU9kVGw2YzJKd1ozYxAB",
            "text": "Had a graduation party for my son in the patio and it was a huge success!  The patio space was perfect with a view to match.  The only downside is that the patio is not air conditioned so it got pretty warm in there for our large group.  It didn’t help that it was a heatwave weekend.  They printed out personalized menus, which was a nice touch.  The food came out pretty fast and drinks were included.  The portions are a decent size and the food was tasty.\nHighly recommend this place for the view, the ambiance and the great service.\nAshley was wonderful in coordinating the party.  The pre-fixe brunch was very affordable too.  We will definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dllsbEhTSEJmWTI5UlRGY3laMjFzYVhOTWMyYxAB",
            "text": "Celebrated my cousin's 50th birthday at this beautiful and vibrant Blend.  Loved the waterfront views through large windows while dining.  The coconut flan was a 10 BUT I love anything coconut so I might be biased 😋 😆 the staff was friendly and attentive.  The rating was dropped to 4 stars because of the long wait for the food to come out AND check out/bill pay.  But I'd definitely go back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTFpEVlVUWE0wTFV0VFF6UldRMTlqWjJOSVRtYxAB",
            "text": "Blend on the Water is okay. I think that sums it up. The location is excellent, and the staff is very polite and friendly. However if your dining at night, the atmosphere could be hit or miss. The noise level can be high especially depending on your fellow diners. It gives more of a bar vibe with a large floor space than a restaurant. The food itself was enjoyable, and cooked well. I had the Pork Shank as my entree which was very filling. And my lady had the Chicken with Rice which she enjoyed as well. I read there was a loosely written dress code but none of the diners had adhered to it. Overall, I think Blend can fit into your plans if you’re already in the area, I don’t think I’d go out of my way for the experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCa2N6WkVSazlXY25KYU4ycEJSV2sxU1ZoRmVsRRAB",
            "text": "Nothing less than AMAZING !!!! 10 out of 10 stars. Any time we visit New York Blend on the Water is a must have for us. From everything to the decor the hospitality and the drinks and omg the food.  I highly recommend this restaurant. You will not be disappointed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeFdsRXRVRkZvYzBrMVVXZ3RlblZYVG5Wa2FsRRAB",
            "text": "I went here for a solo date and had such a great time. The prices were very reasonable, and the food was delicious. The restaurant's location by the water made for beautiful, relaxing views, adding to the whole experience. It was the perfect spot to unwind, enjoy a good meal, and take in the scenery. I'd definitely return!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbVFsOTRla04xT0dZMlZqSmxjMDlXYTJaMmJuYxAB",
            "text": "This is a beautiful and clean restaurant with amazing views of the Hudson River—perfect for a scenic dining experience. However, the atmosphere can get quite loud, especially during peak hours. The food tasted good, but unfortunately, the staff attending our table forgot to bring a few items we had ordered. Despite that, it was overall a good place to enjoy a meal and relax with a nice view.\n\nEste es un restaurante hermoso y limpio, con vistas impresionantes al río Hudson, ideal para disfrutar de una experiencia gastronómica con buen paisaje. Sin embargo, el ambiente puede volverse bastante ruidoso, especialmente en las horas pico. La comida tenía buen sabor, aunque lamentablemente el personal que nos atendió olvidó traer algunos de los platos que habíamos pedido. A pesar de eso, en general es un buen lugar para disfrutar y relajarse."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwU1RYUlZkVFJ6ZVdwUFJuaDBTalpNVVRkdlQyYxAB",
            "text": "One of my favorite restaurants ! I love their drinks the food everything is always a 10/10 ! Went there in the evening I will say that it can get noisy if you're trying to have a conversation, between the music and the people but something's are outside of their control :) Overall staff was amazing as usual and I love their location, great view of NYC !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aS2JHbzJOMHRaTWxwU1EyUnBlRmxCTjJoME9GRRAB",
            "text": "Attractive interior with river views. Food good. My one complaint is that several of their mains are served with rice with fries rather than with beans. That may be a thing in some Latin country, but I've never heard of it. I asked to substitute the fries and was told no substitution. Wound up ordering something totally different: tacos, which were tasty--but tiny."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOaVlpY2ptaU1YdHJnRRAB",
            "text": "Blend used to be a favorite dinner spot for my family and me, but our recent visit over the weekend left us disappointed. Both the food and service fell short compared to our previous experiences. Upon being seated, we were asked to place our entire order right away due to how busy the restaurant was. We were told we had a 90-minute time limit, which was understandable, but after receiving our appetizers, we waited an additional 45 minutes for our entrees.\n\nUnfortunately, the quality of the food did not justify the prices. The presentation however was great. We also noticed a discrepancy in the cost of adding shrimp—what was listed didn’t match what we were charged. When we brought it up, the waitress mentioned it was due to a recent price change.\n\nThe highlight of the meal was definitely the drinks, but overall, given the cost, there are better dining options available."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcEtLeV93RRAB",
            "text": "Blend was an amazing experience. Amazing vibes and service. They even remember your last visit and last ordered items to remind you of what you had last time. The food was made with love, and the dessert was amazing. Perfect for date night with amazing views of the water. 10 out of 10. Will definitely be going back again for another round."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbnM3Q1R3EAE",
            "text": "Beautiful location, the food was excellent. Not a rushed place and they still have a bathroom attendant which was a little weird but whatever. Everything came out well done. The drinks were spot on. It’s a trendy place right next to the Pepsi cola sign and we took pics after. We ubered from the train station and back, I highly recommend reserving the ride from Jamaica station to there if you are going via uber from there. You would also need to plan it out so you would get back with less waiting time for the train. It’s a beautiful space inside and you do need reservations for busy days Thursdays through the weekend probably. Waitress and bartenders were excellent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JemRHazRka1IyWjNCclMwbE5OMVYzTVRsclFXYxAB",
            "text": "Food is overcooked and dry. Lobster was rubbery and the rice was mush. Shellfish tasted like wet salt. My partners chicken was dry. Servers were great. Great for drinks, not so much entrees. Ambience is really nice but paying for vibes not good food lol"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MDRqdlF3EAE",
            "text": "Great place to eat and hang out. Great atmosphere and lighting with good music and a great view. We spent alot of time there after our meal and drinks and we had a really good time. Staff was very friendly and made sure we were all good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd1dEVkliVzFsTUdwRGFtbEJNREpwWW5CNlQzYxAB",
            "text": "Made a reservation for lunch and we where very early but it was no problem to change. This place is stunning, the staff were all very friendly and polite. The food was amazing and great prices."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLWJtNnVBRRAB",
            "text": "We came here in a Friday evening to celebrate my best friend daughter’s 16th birthday. Since we were a group of 9 they arranged a PF(pre-fit) menus for us. This was ok considering that none of us are big eaters. I will attach this in my photos along with the recipe so people have an idea of what to expect. The place itself is very nice super good vibes from the employees and the crowd. I love this area so for me was a win. Not sure how I feel about the amount of the bill considering that we brought over the cake and we couldn’t cut it, cause they were charging us $5 per person just to cut it down 🥺. The food was good. I think if you want a place for a casual celebration this will do. Thanks Camila D. our waitress for such an awesome attentiveness."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeFpQOU93EAE",
            "text": "The food here is amazing — seriously, 10/10. But just a heads up: if you're booking for a special occasion like a birthday, MAKE SURE YOU call the restaurant yourself to confirm everything. I selected the birthday option online and never got the confirmation call it said I would. Also, tell your SERVER yourself about the celebration, because the host didn’t pass that info along, and it led to some awkward moments — like the server asking about dessert in front of the birthday girl as if I hadn’t planned this whole thing. We weren’t walk-ins. We had a reservation.\nService was okay but could use some tightening up — I asked for a straw twice and never got one, and we felt rushed after eating (plates were cleared the second we finished). Bathrooms are gender-neutral, which is great, but it might help to have someone check in occasionally for guests who seem unsure.\nAll that said, the food made up for a lot. Just hope they improve the communication and pacing a bit. we paid a good amount for 5 people, so if we do eat here, maybe it'll be for takeout."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLN0NoZjNNMFktWGxRRRAB",
            "text": "I came in from out of town to celebrate my birthday! I had a reservation however, my party was seated 35 minutes after our reservation time. Condolences were offered as well as free drinks but we never got them lol. Only reason my star was deducted.\nThe food made up for everything. Every dish was great the portion on the ceviche was very small for the prices not shareable at all but was very good.\nThe Mac and cheese is amazing, great mojitos. Overall a great vibe."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMVJ6VkdhekpDWXpoa05Fc3RlV3BxUlVsVU4yYxAB",
            "text": "Loved finding this treasure! Classic Mojito are spot on. The Butternut Squash Soup was so delicious 😋 Arros Con Mariscos was so good.  Mofongo was not what I expected but it was okay."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLXNHZHN3RRAB",
            "text": "Beautiful restaurant on the water in Long Island City! It has a beautiful interior but can be pretty loud at times which makes it feel a little more “promoter like” than intimate at times. The lighting did help with that though and the service was really great! They were fast and attentive and it was appreciated! I enjoyed the sangria and the Atlantic Salmon was delicious. We also shared the croquettes (which were a little too small for my liking) and the chocolate cake which was amazing! Definitely a cute spot with a view!"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJdFMxcEtTMk5zV1U5TmIyZE5UMkkxY0hoRFduYxAB",
            "text": "Posto trovato per caso perché stavamo morendo di fame. Servizio gentile e veloce. Il locale era bello."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eEtUaFVnEAE",
            "text": "One word to describe my experience here : EXCEPTIONAL\nI came here for dinner with my family and we enjoyed it.\nWhat a beautifully decorated restaurant with a gorgeous view this spot presents! You see the colorful lights of the city across the waters which is gorgeous.\nThe food is hands down amazing!\nThe service is spectacular!\n100% recommend coming to this spot."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfX3FDQWxBRRAB",
            "text": "I have been coming to this place for years. And it never disappoints. The food is great, the music is fantastic, the service is outstanding. This last time we were not pleased with seating where they had assigned us our table, and the hostess really accommodated us in a better table. We did have to wait a little longer but nothing out of hand. The bartenders at the bar were really nice and made some yummy drinks. We will continue coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSE5tdE5kVWxtWWpCaE5sRjVOMFV4VDB0UFZXYxAB",
            "text": "Appetizers were really good and delicious,  guac, short rib arepa,ceviche was all on point,  caprihnia was also hitting!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WmRGTkZPVGgxZFY5clowMW5RbTVHU2tsUFYzYxAB",
            "text": "El lugar agradable pero sin aire acondicionado solo con ventiladores. Me imagino que para que las personas pidan más bebidas.  pero la atención de la mesara terrible, dejaba las cosas de mala gana y tras eso se metía entre las personas. Los platos no llegaron todos juntos. La propina obligatoria del 20% sin dar un servicio óptimo. Deberían seleccionar mejor el personal"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNjdtQm13RRAB",
            "text": "First off, the restaurant’s location is amazing, and the restaurant itself looks good. It’s really fancy, clean, and spacious (in most areas). However, my family, and I didn’t appreciate the 30 minute wait for our table. As I reserved our spot a week and half ago. Our waitress Alejandra was attentive and polite to us! So, ten stars to her!\n\nAs for the food, I got a Strawberry Lemonade drink, and a Chicken Lomo (both were so good). My cousins and mom got something different. You’ll have to look at the images of their food. Now, almost everyone expected more from the food. However, they did enjoyed the drinks (10s across the board)! I did believed that the Lava cake for my older sister should’ve been free. Usually, restaurants provided that for free.\n\nSo, a three out of five is fair!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNMlVWUlZhRzVrZVVwR2JtNWhhamxQZDJreGRWRRAB",
            "text": "It was a very nice  and welcoming place.\nI had my birthday dinner there , the food was so good and the presentation was upscale.  I enjoyed every part of it. Thank you, guys, for making my birthday memorable."
        },
        {
            "date": "4달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRVdtNXRZMmRsUW5ocWEwaHBWbWxMVGtacVdHYxAB",
            "text": "Blend on the Water offers one of the most romantic and elegant dining experiences in Long Island City. From the moment you arrive, you’re greeted with sweeping waterfront views and a vibrant, upscale atmosphere that sets the tone for a memorable night. The service is polished, friendly, and attentive — you truly feel like a valued guest.\n\nThe food is just as impressive. Each dish is beautifully presented and bursting with Latin-inspired flavor. Whether you’re having steak, seafood, or tapas, everything is cooked to perfection and served hot and fresh. The cocktails are also worth mentioning — creative, balanced, and full of personality.\n\nThis is the kind of place that’s perfect for special occasions, dates, or even solo sunset dinners. Everything about it feels elevated yet relaxed.\n\nWhat’s your go-to dish when visiting Blend on the Water?\n\nيقدم مطعم Blend on the Water واحدة من أرقى وأجمل تجارب العشاء في منطقة لونغ آيلاند سيتي. من لحظة وصولك، تستقبلك إطلالة خلابة على الواجهة البحرية وأجواء راقية تنقلك مباشرة لأمسية لا تُنسى. الخدمة احترافية ودافئة، ويعاملوك كضيف مميز من أول لحظة.\n\nأما الطعام، فهو بمستوى التوقعات وأكثر. كل طبق يُقدَّم بشكل أنيق ويحمل نكهات لاتينية مميزة. سواء طلبت ستيك، مأكولات بحرية، أو أطباق التاباس، كل شيء مطبوخ بعناية ويتقدم لك ساخن وطازج. وحتى الكوكتيلات تستحق الذكر — مبتكرة ومتوازنة ومليانة شخصية.\n\nالمكان مثالي للمناسبات الخاصة، أو عشاء رومانسي، أو حتى وجبة غروب لوحدك. كل التفاصيل فيه أنيقة بدون ما تكون متكلّفة.\n\nإيش أكثر طبق يعجبك لما تزور Blend on the Water"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ3JMWXVBRRAB",
            "text": "I recently had the pleasure of dining at Blend on the Water in NYC, and it was an outstanding experience. Situated in Long Island City with stunning views of the Manhattan skyline, the location alone makes it a special place to visit.\n\nThe ambiance at Blend on the Water is elegant and inviting, perfect for a romantic dinner or a celebratory meal with friends and family. The decor is chic, and the large windows offer breathtaking views of the city, especially during sunset.\n\nThe food was absolutely delicious. The menu features a delightful fusion of Latin flavors, with dishes that are both creative and flavorful. From the appetizers to the desserts, every bite was a treat. The cocktails were also superb, perfectly crafted and refreshing.\n\nThe service was top-notch. The staff were attentive, friendly, and knowledgeable about the menu, ensuring that our dining experience was seamless and enjoyable.\n\nOverall, Blend on the Water is a fantastic dining destination in NYC. With its incredible views, delectable cuisine, and exceptional service, it’s a place I highly recommend for anyone looking to enjoy a memorable meal."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMXJuNUx3EAE",
            "text": "My experience at blend on the water was absolutely amazing. Me and my family went here for my mom’s 50th birthday and it satisfied all categories. The atmosphere was magical with the scenery of flowers everywhere and the dim lighting. It really set the tone of the evening. The food was also a 10/10 and it is a very clean establishment. My family ordered dishes with steak and seafood and it was a great combination. The drinks were also really good. The customer service was very attentive and pleasant as well. And then at the end of the dinner, we took some professional photos with Ukilay (the photographer) to capture memories to look back on. I would definitely recommend going here for a special occasion."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbGNtVllObWs0UW5WTVpVVlZXSE01V1dSWmRHYxAB",
            "text": "Great location, horrible food and service.\n\nWe visited recently and were very disappointed.\n•\tThe churrasco steak had decent flavor but the texture was mushy and unpleasant.\n•\tThe eggs served with the steak were actually good.\n•\tThe mac and cheese tasted powdery and artificial.\n•\tThe Krispy brunch arepas were good — my wife enjoyed those.\n•\tThe thick-cut pork bacon was terrible — it tasted like it had been cooked the day before and just reheated.\n•\tThe chicken steak was dry, under-seasoned, and clearly precooked and reheated just for color — no moisture or flavor. The rice that came with it needed more time and water to be properly cooked.\n\nThe service was equally disappointing. Our waitress barely checked on us, yet gratuity was automatically included and she still pushed hard for extra tips, claiming they went directly to her. Meanwhile, the busboy was the only one who refilled our water and checked on us multiple times — he deserved the tip, not her.\n\nUnfortunately, we won’t be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRenN5RnF3RRAB",
            "text": "From the moment we walked into Blend on the Water, we knew we had chosen the perfect place. The décor is elegant and modern, with a spectacular view that creates an unbeatable atmosphere.\n\nThe food was simply delicious—each dish was carefully prepared and full of flavor. But what truly made our experience unforgettable was the exceptional service from the staff. We want to give a special thanks to Ashley, who, as the event coordinator, did an impeccable job ensuring everything was perfect on our wedding day. Her professionalism and dedication gave us peace of mind on such a special occasion.\n\nWe also want to highlight Lina, an incredibly attentive and kind waitress who provided impeccable service with a constant smile. Her kindness and attentiveness made both us and our guests feel well taken care of at all times.\n\nIf you're looking for a place with the perfect combination of great food, excellent service, and a beautiful atmosphere, Blend on the Water is undoubtedly the best choice. We highly recommend it!\n\nI can’t wait to get back and use my rewards points!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaXJxamFnEAE",
            "text": "The food is so fresh !!!! Was impressed to have been eating such great things with colors and crispness and flavor . All clean and I love their skinny menu for us light eaters and heavy eaters. ( menstraul cycle) sometimes I want light then heavy.  The fruit salad with churrasco steak was  Perfect menu ! Fun and many options.! The vegan flan was like a soft ice cream with the toasted brown sugar and coconut flakes ! So delicious ! The caprinahan with sugar on rim was AMAZING ! Add a jalapeño for spicy ! lol Camilla is great with the  order and upgrading up to more delicious things on menu . Super clean ! Super pretty !!! I want for a 1pm lunch . Wasn’t packed . It has a sunny great river view . Staff very happy and very cheerful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRLU1uOUpBEAE",
            "text": "Earlier I went to Blend On The Water & wow, the service from when you walk in is so refreshing. It’s not often you find restaurants where you’re greeted with such warmth and smiles that make you feel so welcomed. Tiffany & Lina were absolute dolls so shout out to them, both very sweet. The food was delicioussss & the drinks are tasty & strong. Just how I like it. I would definitely come here again with family/friends. & definitely ask for either Tiffany or Lina when you go. Great energy over all"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMczdIWmhnRRAB",
            "text": "No hats inside. Bouncer told me to take it off as I walked in.\n\nUpscale Latin vibes, which is more rare than common in my experience with the cuisine.\n\nMy personal review is a 3/5 stars, but my guests enjoyed their meals a lot so I bumped the review up to a 4.\n\nThe server was a 11/10. Very attentive, nice, and a nice twist was that the server stayed near the table for the meal. Definitely felt attended to.\n\nThe frozen blue alcoholic drink tasted a little like cough syrup.\n\nI also got a virgin mojito with strawberry added which stole the show. Very tasty.\n\nThe lobster rolls were tasty, but I critiqued the condiment pairing.\n\nFrom what I could taste and see, the lobster inside of the roll was tossed in a spicy mayo type of condiment, and that condiment was also served on the side. In my opinion, a sweet chili or something tangy would have punched up the flavor, instead of spicy mayo tossed lobster covered in a roll that you also dip in spicy mayo.\n\nThe shrimp was very good. Perfect shareable for a party of 2-3. Ironically, I thought the spicy mayo fit perfectly here.\n\nThe menu isn’t super expansive, which is pretty refreshing for moments of decision paralysis, but it would’ve been nice to have classic dishes like quesadillas that might be more simple, but are safe options to enjoy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGaVlWcHBXbUl3T0RsSGVITnNUbUZxVUd0bFJHYxAB",
            "text": "DO NOT WASTE YOUR MONEY HERE, SO MANY BETTER OPTIONS. THE SERVICE IS HORRIBLE. The food is average for the price, i’ve had way better Churrasco and Pernil in other restaurants. I ordered multiple drinks only for the waitress to take their sweet time and forget you even ordered. When I brought it to their attention they were super rude about it. Imagine ordering a drink 2-3 times just to be met with the rudest stare upon reminding them. WILL NEVER COME BACK OR RECOMMEND TO ANYONE. NOT WELCOMING AT ALL"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieUxfcG1RRRAB",
            "text": "The food was excellent. This place has great atmosphere. Service was great very attentive. The price extremely reasonable. I wanted to give them 5 stars but I couldn’t because a couple 3 tables away had a dog that barked every time and clapped (there were a lot birthdays that night). Then a woman sat next to us with a dog in a stroller that was in the middle of the aisle which slowed down the servers. The dog kept barking. I do not think I will be going back"
        }
    ],
    "reviews_count": 85
}