{
    "name": "Casa Enrique",
    "place_id": "ChIJv4bbdSNZwokRCgKfDGF8az8",
    "grid": "QN1",
    "address": "5-48 49th Ave, Long Island City, NY 11101, USA",
    "rating": 4.5,
    "user_ratings_total": 2939,
    "phone_number": "(347) 448-6040",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRU5IbDFhM1ZZUVhweVkzTkJMWFJEVkhWSUxVRRAB",
            "text": "Good vibe. Guacamole was decent.  Sauces were flavorful. Tacos (pastor and chicken) were notably subpar - meat was dry, tortilla had no texture or flavor"
        },
        {
            "date": "수정일: 23시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNnFLUmR3EAE",
            "text": "It is a great restaurant the carne asada is one of my favorite food. Also, margaritas are very authentic."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOd1owVmhaMlJ6WkdOa2NWZE1TSEJPVFd0c1MxRRAB",
            "text": "delightful birthday here"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVFNqbENMWFJXVG5Oc1dYSkJZV0ZLZW1OeVExRRAB",
            "text": "The food was delicious - I had the verde enchiladas and the tres leches (sublime). Service was quick and staff ever so friendly. As a solo traveler, it’s a bit more expensive but the food was so worth it. Great cocktails too!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNFJIaHZaVEExT1djeFJIbE9RMmhYWVY4dFpWRRAB",
            "text": "Great meal at Casa Enrique last night. We had an 8:30 reservation but were able to get sat early, as we arrived faster than anticipated. Lovely service, and we had enough pozole to bring home with us. Perfect as the weather is turning cold. Need to return to dig into more of their long cocktail list!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUloySkJVekpmUm5RMlpUUjFWSGxzY1dabmVtYxAB",
            "text": "3.5 stars for me.\nSome dishes are excellent and some dishes def don’t order. Awesome seafood, mole and ribs. Dessert was phenomenal. Tacos and guac def avoid"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twc1UxSkZSVlpITWtoVVdYSjNRM2RGT1hSWFNIYxAB",
            "text": "Really mediocre restaurant, tiny portions, dry meat, and service deplorable, with the waitress complaining about my tip !!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkQmVFUjJhRGROWlZCbU5IRlFSRGMzYjAxQ01YYxAB",
            "text": "Great food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnM1pWTm1kemh1WjJWdWFtVlhNR1UzU2xZMGJrRRAB",
            "text": "I have had a great time in Casa Enrique, the drinks are so well prepared and the food is Mexican-grumet, in other words, it's delicious! The server was friendly and attentive! I highly recommend visiting Casa Enrique in LIC."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTlZYWXRhMU5VTW5ORFZtMW5URTFzUVhwc1NuYxAB",
            "text": "Thay have amazing Mexican foods"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbWEyeFZiRTlOTkV0WVNTMURaakJYUTB4SlQyYxAB",
            "text": "The Casa Enrique brunch menu was a mixed bag. The flautas de pollo ($22 plus tax) and the pastel tres leches ($13) were hits. The guacamole ($18), though creamy, was very bland for something supposed to be medium spicy. This was concerning because the classics should be executed exceptionally. The virgin Bloody Mary was also a miss, the added sugar imparting an odd syrupy taste."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMFUzaHZhWG8wV1U0M2REWlpSMVY2ZWxNd1YwRRAB",
            "text": "Great food, that is the main focus of the restaurant, and the drinks were superb"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTFFVcEdSV2t3ZGpSeWVsa3dOa1p4TUVSa2JWRRAB",
            "text": "We booked a table for brunch here because it’s a Michelin-star restaurant, and we wanted to see what the hype was about. Unfortunately, the experience was disappointing from the start.\n\nOur waitress seemed annoyed as soon as she greeted us, which set the tone for the meal. We ordered a couple of starters and drinks, and when we asked if we could swap the base alcohol in one of the cocktails, she looked irritated and came back to tell us that if we didn’t like the drink, we couldn’t send it back. It was an odd and uncomfortable interaction, especially for a place with this level of recognition.\n\nWe decided to skip the drinks altogether, stuck with water, finished our starters, and left. The food was fine, but the service and overall atmosphere just didn’t match the standards you’d expect from a Michelin-star restaurant. Honestly, it felt pretty average."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205amJtWnJjV3BEU1RWblQwaGZjVlY0VDNGTVJFRRAB",
            "text": "Great food"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVVFtUmFNMVpMWjJoTk5tMVNTM05zVDBOdlMyYxAB",
            "text": "Good tacos"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVE4wRmpVVTVhT0RZM1JURnhUVTlVTWpGblRHYxAB",
            "text": "Went here last Sunday. My group got a spread of 12 tacos: 4 chicken, 4 pork, 2 brisket, 2 fish. The brisket was the best. Came shredded and juicy. The fish was also pretty good. The chicken and pork tacos were pretty bland and very dry.\n\nAll the tacos were served at the same time and all were tepid apart from the fish (which was nice and hot), so I think it might have been hanging around for a while waiting for the fish to be ready.\n\nOn the bright side the service was lovely and attentive. We also got the cocktail specials which were delicious.\n\nOverall it's a nice place, but at $9 per taco, I had expected to be amazed, and they were just middling. An al-dente carrot slice in an already dry taco just does not work!\n\np.s. we were sat outside and got mobbed by mosquitoes towards the end of the meal, so had to leave in a hurry. The staff did kindly provide bug spray though."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONGR6UjRZamg0U2pZdGNuQlFielpXZDB0SlkxRRAB",
            "text": "The food was delicious, but the atmosphere didn't give me Michelin vibes. The menu was dirty :/"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScVZEWjFTVms0Y3pWaWVXMVhVRzB5TkROcFYxRRAB",
            "text": "ten stars for tres leches cake."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUFNVWXpOMFpMY0ZNNWVrTkRWbE5OY25KVFlWRRAB",
            "text": "Tasty drinks. The beet&jicama salad and my lamb shank were juicy. Loved the red salsa/hot sauce from the combo that comes with the table.\n\nNot up to expectations: The enchiladas verdes were dry in the middle. We'll be back but definitely won't order them again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUE5FUkxhbFY0UlRsRVdFOW9VbVEyVlZVemVWRRAB",
            "text": "Enchiladas mole were delicious. Cocktails were delicious.  That’s all I can speak to. Will definitely come back to try other things."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psU2QwbE5ZMmRzY3pWaFVVZHpjM2MzYTB0M01IYxAB",
            "text": "Beautiful spot - not too casual and not too upscale - perfect balance hence the rating for the atmosphere. My food was okay - tacos were quite small and lacked a bit of taste, however another diner (who was older) loved the mole so maybe I just didn’t prefer right. It took a long time to get drinks but when they came they were excellent and the presentation was beautiful. The waitstaff that night looked over worked, for example, the woman serving our table didn’t spend much time with us, and we opted out of dessert because she couldn’t get over to us to ask what we wanted. Good for folks that have time - dates to keep it classy but reasonable and large groups. I’d go here possibly again but wouldn’t seek it out like I did the first time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cU1HRldXa2huT0ZsSE1GOXZNMk40VkRSVWRtYxAB",
            "text": "Food was subpar,  ordered Taco's Pastor it was not even close to Authentic, basically fried pork strips with none of the Al Pastor flavour.. ordered spicy guacamole and all though decent guac it certainly wasn't spicy.  Vibe and service though was very good.. Latino staff didn't even ask how the food was, and I think cause they know it's subpar.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JdFJ6WlBWRTV6VW00NVNWSnNOa0owTFVWTWFHYxAB",
            "text": "Tried Casa Enriue given all the good reviews but was unfortunately disappointed.  Everything was rather overpriced for the taste and portion of the food, the tacos especially.  The staff is absolutely wonderful, but truthfully very disappointed with how much we paid for the food that was presented. With what we paid, going deeper into Queens would give a substantially better experience for Mexican food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWFIwRkZRMncwZFhocGFETlNiRU5yT1ROWFYxRRAB",
            "text": "The best Mexican food in New York!!! Long Island City to eat like a King in Queens!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210elkyOTJhVFpOYmxrNFpEVlFVV3hvY21WNWRGRRAB",
            "text": "Our server was kind and attentive. The menu had great variety."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twU1FXdEhWRlU1UmpSMFNsTnlXalkwV25wM04zYxAB",
            "text": "Every dish had a unique flavor profile. Loved the creativity."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMmJURlJNWG81UjNKT1RsTjZWVTVyVVV4NmRuYxAB",
            "text": "The eeffoc that Enrique gave tasted like mustard and mango, was worth my 6-7 minute wait It would be nice if you had more stores in Ohio or Cupertino because I can enjoy"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSFZsRmxWR0ZhVm10MldtdFJibk5UUm5CWWFrRRAB",
            "text": "Excellent food, excellent staff. Would definitely return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaak5qbFVSSEZxVmprdFJVTlVOMWxmTVZCT1ZuYxAB",
            "text": "Fantastic experience from start to finish. The food came out fast and every dish was spot on. The guacamole with warm tortilla chips is a must, seriously addictive. The chicken mole was packed with rich flavor and the verde enchiladas were just as satisfying. Drinks were excellent too, especially the coconut margarita and soursop cocktail. Dessert sealed the deal, the flan was silky and smooth with a light fresh syrup.\n\nWe went on a Wednesday and the place had a good crowd, but service stayed friendly and attentive. There is no parking which makes it tough, but luckily there is a train stop just a block away. Overall, one of the best Mexican spots around and probably one of the most affordable Michelin-rated restaurants I have been to"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUVN6bHdhRFZKV0dsQ1dpMUpRMmRRWmxKc1YxRRAB",
            "text": "Delicious food. Perfect textures and flavors. I got the enchiladas. Simple ingredients but cooked to perfection."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNFkxUllPVE5qY21GalRqZFlOMFZpU2pKUWMwRRAB",
            "text": "Pedi Los Chiles en Nogada pero no superarón mis expectativas, el arroz ni medianamente caliente."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRk1sZFVVRkZXZGxsTmNHSXhjRE5CUmxOSWRrRRAB",
            "text": "This is a terrific Mexican restaurant with some of the most delightful dishes. Steak is super tender, perfectly cooked at medium raw, juicy and melts in your mouth. Tacos come with fresh corn tortillas. The meat is fresh, sweet and savory. Fish ceviche is tangy, spicy.\nThe restaurant is right off of Vernon, slightly more secluded being next to a children park/playground. Outdoor seatings are available. Service is quick. We were able to get a table on a Saturday afternoon for an early dinner without a reservation. The price is on the higher end for mexican food but I still recommend for occasional treat for anyone to try."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNmRXcHdOMTlTWm05Mk9ISlVhMU5QZVZCeVUxRRAB",
            "text": "I love this place. Food, service, atmosphere always well done. The enchiladas (all flavors) are so good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVVVFaFBiVFZyZUhCdVlYTllOeTFKTW5kYUxVRRAB",
            "text": "I probably didn’t have the best experience for the first time visit, came with a lot of expectations but maybe that day just didn’t work.\nOrdered the famous Mole, was ok.\nBut the server suggested us so bad to order a carnitas tacos 🌮, she did not advised that was 36 usd , Insane for 3/4 carnitas tacos.\n\nThe bass boy was so good, extremely nice. The drinks where good, but they charged us more than it was on the menu saying “ they were special” when they were simply an option more from the menu. That I didn’t like.\n\nI would say, drinks are amazing and the tres leches dessert was very very good!\n\nEnvironment , not sure why but the lighting was so so so low, I could barely see my friend and the food, I’m an architect and I appreciate lighting design, but those lights were definitely lower than they should. If that’s the intention they need to have better candles on the table.\n\nOverall, not the best experience, but I want to believe I was just not lucky that day :)\nI would probably give it a second try in the future.\nPrice :  85 per person."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcWVWOWhSbU5QV1MxSVdtVnFlVkJDZEZFMVNWRRAB",
            "text": "If we had known reservations had a one-hour-and-leave policy we probably wouldn’t have picked this place.\n\nFood was solid (if a bit pricey — my sandwich was $25). What brings it down for me is that around an hour into our brunch, they started trying to take my friend’s food away. Over the next fifteen minutes, they tried to take her food away around four times even though she kept telling them she was still eating. We got dessert elsewhere.\n\nNot like the place was packed either. We noticed at least eight open tables as we were leaving."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSalIySlNkVXRpVEdOWE1uQlBTVEJJUnpCQ1QzYxAB",
            "text": "My boyfriend and I walked in on Sunday around 8pm over Labor Day weekend and the place was packed. There weren't any tables available, so we sat at the bar. It was very busy, especially at the bar, so the seating wasn't ideal, but the bartender who served us was such a nice guy. He was very gracious and personable to all guests, not just us, even though he was clearly very busy. We ordered the shrimp ceviche, enchiladas, ribs and tres leches for dessert. Everything was delicious and the service was great! Can't wait to return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdVlWbHpaMDVpUjFGd05ITXRZMUJpV1VoSFJIYxAB",
            "text": "Just so so"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aS1pHa3lUMWs1TlRSbWVGZEpjRlJYY2t4RlRYYxAB",
            "text": "Came here last night for my bday dinner. I Had been wanting to try this place out for a long time and it was perfect! The staff were so friendly and welcoming. The ambiance is cozy and relaxed and then to top it off the food and drinks were amazing! Prob best margaritas ive ever had. So happy to have spent my bday here and cant wait  to come back again. May have to check out brunch 😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OU1JHVmlXVXBtUlhwbVNEaEtOVEJUYlhKRWFsRRAB",
            "text": "Food + cocktails/ price= 5*\nEasily"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0VFFWcGFRVkJJUzFoNVNuWkdjRFJyY1dJNFptYxAB",
            "text": "Nunca eh hido pero lo encontré explorando en Pokémon go y lo encontré en Google"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPSEQtYXZoMU8zZ3dRRRAB",
            "text": "An amazing slice of Mexico in LIC. Everything is delicious - the cocktails are very tasty, with care and effort put into each one. The watermelon margarita, which was a special, was fantastic. The beet salad was very tasty - earthy, but also creamy with goat cheese and nuttiness from the pumpkin seeds really balanced it. The chorizo Torta was very good, but rajas con crema stole the show. Spicy, fresh corn flavor, a little heat from the enchilada sauce, soft, cheesy poblano. The tacos al pastor were very good - not quite at the very best I’ve had, but just extremely good and a great side plate. Definitely come on a date night or brunch experience an hour in Mexico with some of the best food in NYC.\n\nAdded 8/19/25 - the guacamole, even on spicy, was a little bland. That said, the flautas de pollo was delicious and one of my new favorite items on the menu."
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbFlrMUViMFpDU213d00wOWZRbll3YUZkZmJIYxAB",
            "text": "Locale piccolo e accogliente.\nPersonale davvero gentile.\nIl cibo è di ottima qualità, ampia selezione di antipasti e piatti perfetti da dividere.\nAtmosfera rilassata.\nDavvero consigliato per assaggiare del vero cibo messicano."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdmNqZ3hNV04yVW5WTmFUQmhiR2hQVG01bGMwRRAB",
            "text": "Didn't put a whole lot of research into this place but randomly googled Michelin stars in New York, we love Mexican food so we tried it out. We were able to get in without a reservation. About a 15 minute wait for us (2 people). The service was accommodating, knowledgable and kind. All of the food we had were really really good. We got the ceviche and guac, both were unique but incredible. Had tacos and drinks yadada it was all amazing, highly recommend!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJUy1tT1hPc3RIN05BEAE",
            "text": "Gone super down hill."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWFFqTkZaMDB4TFhBMWMzQlRjbXRLVkZadWJGRRAB",
            "text": "This place is the perfect blend of upscale Mexican cuisine, and it’s authentic. Yes, it’s a bit pricey, but you can taste the quality in the ingredients and the depth of the flavor profiles. Honestly, if you’re in the area, I’d highly recommend it.\n\nWe started with the aguachile and the ensalada de betabel con jícama as appetizers, and both were incredible. Don’t sleep on the side salsas either, they’re so good!\n\nFor our mains, we had the steak, their carnitas special, and the tacos, all outstanding. We also ordered drinks, and let me tell you, they’re strong (in the best way).\n\nOn top of that, the service was impeccable, even though we arrived late for our reservation, they still had our table ready and waiting.\n\nIt truly feels like a piece of Mexico has been transported straight to New York!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNFVXVkxNakJmVkZWaWFtaHFOa014T0RaQ01uYxAB",
            "text": "Michelin-starred Mexican food that’s bold and authentic."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUWNIaHlORTk1VVRGVlEzVk1SRzQ1ZFV0SGNWRRAB",
            "text": "I sat at the bar and had the chicken enchiladas. Service was quick and the food was delicious."
        },
        {
            "date": "2달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeWEybEhVUzFvVkZKME0zQkRYMVpDUlhwS1pYYxAB",
            "text": "Pyszne jedzenie, każda potrawa była doskonała! Przyszliśmy zaraz po otwarciu restauracji, a po chwili niemal wszystkie stoliki były zajęte. Polecamy to miejsce, warto spróbować 😋"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaczRYalFnEAE",
            "text": "They lost their Michelin star but I didn't notice a change in the experience. Maybe Michelin is chasing after hype. Regardless, this place is tied for my favorite Mexican restaurant in New York."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSYVdWbDZWRk5rWW1VeU9UVXRMVzVXT0RZMGNXYxAB",
            "text": "I when to casa Enrique because I heard they had michellin star the place is beautiful drinks where good but the food disappointed me to be honest I expect more. I visit other places with way better Mexican food. I won’t be going there again and I pray the it was the chef having a off day cuz I heard great things about this place but that was no my experience"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdXVmTlRREAE",
            "text": "다른 가성비 멕시칸요리집에 비해 월등하게 훌륭한 맛이라고 할수는 없지만 평균이상의 음식, 최고의 서비스, 분위기도 너무 좋은 레스토랑입니다. 왜 미슐랭 스타를 받았는지 고개가 절로 끄덕여지는 훌륭한 곳입니다."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205a1IxQkNibXBYU2t0eWRVNUJhV3RLTFVOMmJsRRAB",
            "text": "Great experience here on a Friday night! We were seated at the bar and our bartender/water was super attentive and made excellent drink/entree recommendations. One of the best spicy margaritas I’ve had in a while! He was very knowledgeable about the tequila/mezcal options which I appreciate. The food was good, elevated takes on traditional Mexican flair. Pop in if you can get a seat! It’s very busy!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveXByWV93RRAB",
            "text": "Went on a Sunday evening without a reservation and was warmly welcomed. The service was attentive and kind throughout. The guacamole was excellent—creamy and full of flavor—and the fresh chips were a perfect match. I also tried the spicy margarita, which was satisfying, though just a bit too spicy for my taste.\n\nThe mole chicken was something new for me—rich and interesting, though I personally missed a touch of fresh herbs to round it out. The tortillas were fantastic, though—fresh and full of flavor. And whatever those crunchy little things they bring out before the meal are—totally addictive. Yum!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNmJVVm9iR0Z2V0hZd2QzRldVME5RUVRKemNtYxAB",
            "text": "Casa Enrique is a great experience with incredible flavors. The staff is passionate about their service and the ambiance is bright and welcoming. The food is excellent and I highly recommend the Rajas con Cremas. Wife and I love trying Michelin star restaurants and this one did not disappoint."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJck5ndXFRcXVDWXlnRRAB",
            "text": "What a perfect experience, the staff, food, and ambiance was thoughtful, authentic, and original. This was the best way we could have spent the first evening of our honey.  Order as many different dishes as you possibly can and let the well trained team take you on a culinary adventure."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveGZ1RE53EAE",
            "text": "Fantastic. The roasted poblano peppers with cream was my favorite dish — and the crab tostadas… and the beet & jicama salad. There were so many memorable dishes. The weather was cool and breezy so it was perfect eating outside. They were also doing a special frozen watermelon margarita with fresh watermelon. Delicious!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMRHM1OUNVNTVYYmxBRRAB",
            "text": "Incredible food! All the dishes we ordered were fantastic. We started off with the Chorizo Sopecitos and Saundero Tacos - 10/10\n\nThen for dinner my wife had the Pozole and I had the Chicken Mole - again - 10/10\n\nTheir aqua frescas were great too - we recommend the limonad and tamarindo one\n\n☝️ small con - service was spotty - we waited for our bill for quite sometime at the end after asking for it. Although the servers were very nice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUlMzSTJOMlJ6WDBkTWFGbHRXVE5zY25Sbk9WRRAB",
            "text": "The service is incredible! However, the dishes were not worth the hype. I was very disappointed with the chillaquiles. It was just hard tortilla chips with barley any sauce. We asked if the enchiladas were spicy and they recommended the green sauce but it was still too spicy for us."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScVdsVkRVMjlQUkRsbVUyZFhUbEpIVEhreGVHYxAB",
            "text": "Great Mexican food paired with a beautiful atmosphere. The flavors were authentic and satisfying, and the setting made the whole experience even better. A perfect spot for a relaxed meal with great vibes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNGVGOWhibTFxTVhCVmRHaFlTME14UVdSSVNYYxAB",
            "text": "We went for Sunday brunch and it wasn't bad. But it was a bit humid inside and while our waitress did her best, the food either came out too quickly resulting in poor quality  or the drinks came out delayed and we were forgotten. I forget what dish but one of the brunch menu items was completely inedible. Also, the bathroom location was a bit odd..\nDrinks were pretty good though."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NVozaFFiVFpGVXpOSWVEZE5kazVrYmtJeVozYxAB",
            "text": "Horrible experience. We came in on Tuesday for our anniversary. I ordered the chicken tacos and grilled branzino fish. After eating the branzino fish, I felt very nauseous and ended up throwing up in the bathroom. Some serious food poisoning. The whole night was ruined as I felt so sick for two days. Never experienced anything like this. Really had high hopes as it was a Michelin but I can see why it’s not anymore. The food was mediocre had better tacos at los tacos no 1. Definitely would not recommend."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCT1pVODRUMkZ5UmxsSFpYTnBWM0JrTkdsdVRsRRAB",
            "text": "After tasting Oaxacan, Sonoron , Sinaloan and Northern Mexican cuisines in AZ, the bar was really high when we reserved a table at Casa Enrique.\n\nThe food almost lived up to our expectations, but maybe we were expecting something out of this world when we heard about their Michelin Star.\n\nService was good. Chasing us to give more tip wasn’t. But in the end we did give a 23% tip for their service. The Mole and the Flan were the highlights of the experience. Definitely worth a visit.\n\nI think some of the restaurants in Phoenix , Tucson and Tempe should be visited by Michelin evaluators."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbjk1dUNJaTQ2REx3EAE",
            "text": "Everything was good but particularly enjoyed the cow tongue tacos (so tender!) and tres leches (very sweet but not satiating)."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYnF1SzdzNjVfTld3EAE",
            "text": "A lovely Mexican experience with high quality ingredients. A friend invited me to try the Michelin-rated restaurant and it did not disappoint. As a vegetarian, I only had two options from the menu. I chose the Doña Blanca Enchiladas, which I really enjoyed. The Oaxaca cheese inside the enchiladas was very tasty. I also enjoyed the quality of the tortilla chips in our guacamole and chips order. However, the star of the show was the amazingly delicious Champurrado ice cream! I’ve never tried the frozen version of the Champurrado and it was a hit. The graham crackers at the bottom were also a great addition. Awesome offering, and it was the cherry on top of our meal. I appreciate the experience Casa Enrique is offering the NYC community. Thank you!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeUtEVzNnRRAB",
            "text": "Incredible dish creations that are exciting to eat and fascinating as to how they’re prepared, like their house made tortillas that are the best I’ve had to date. The fried oysters are awesome and have a great fry, the sopecitas are outstanding on those perfect tortillas, and the Chicken Tomatillo Enchilada had some amazing sauce. My main was the loaded Lamb Shank, this was great and like many other dishes here, I love the sauce. The tres leches cake for dessert was fun and not something you will see often."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3clk3R0dREAE",
            "text": "I am grading this as a “top tier restaurant” which is why I am a little less forgiving. If this was a $20 hole in the wall I’d be super happy, but it wasn’t, so here we go!\n\nThe good 👍🏼 : the service was awesome. Incredibly accommodating! The lamb 🐑 shank was amazing 😋 . Super rich flavor and perfectly cooked. If that’s all I ordered I’d give this place five stars ⭐️ . The tres leches was also yummy\n\nThe mid: The chicken mole was yummy but didn’t blow me away. I’ve had better mole a number of places (maybe not in NY hence lack of good Mexican here!). The crab tostadas were fine but I wish there was more crab flavor 🦀. When I order seafood I want to taste it! I couldn’t discern the flavors, could definitely be elevated.\n\nThe bad 👎🏼: $18 for a tiny mediocre guac??? Either give twice as much or twice as good but that was seriously a huge letdown.\n\nAlso the branzino couldn’t feed a toddler. It was fine taste wise, but tiny and absolutely not worth it 🐠"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMGFheW9RRRAB",
            "text": "Our meal and drinks were SO good, we had a wonderful time. My only issue was the sound. We sat in the back, which is open and rather loud if the restaurant is full. It’s not terrible but something to note if you are looking for something quiet or intimate. Also, it is A TON of food, we ordered for four of us family style and it was too much, so something else to consider."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOSGZ3NnJXLUlyTkhBEAE",
            "text": "We made a reservation but got there early and sat at the bar. They were able to seat us shortly after. Food was absolutely incredible. My favorite dish was the ceviche. The carne asada is marinated to perfection and melts in your mouth. Service was good\n\nCeviche: Excellent (my favorite)\nPastor Tacos: Excellent\nCarne Asada: Excellent\nEspresso Martini with Tequila: Good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3Z1pIazlBRRAB",
            "text": "If you’re looking for an amazing dinner date stop here 🛑 Everything checks off as amazing! Fine stars throughout. I love all the dishes and service was amazing. The guacamole with the fresh tortilla chips to the the ceviche and mole was out of this world. There are only two paces that make the best mole sauce and this one makes the list."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbktvb20wd05qMjd3RRAB",
            "text": "Everything was so delicious! Ceviche looks small but it's so filling! The most delicious with just the right amount of spice\n\nFlautas de pollo tambien super delicioso y Tacos de Lengua."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaXZpWl9BRRAB",
            "text": "Casa Enrique in Long Island City is hands down one of the best Mexican spots in NYC. The moment you walk in, you can feel the warm and welcoming atmosphere, and the service is top-notch.\n\nThe enchiladas were incredible, perfectly cooked with just the right amount of spice and flavor. The carne asada tacos were on another level, with tender, juicy steak wrapped in soft tortillas that had the perfect balance of smokiness and seasoning. And to top it all off, the Tres Leches cake was absolutely amazing—moist, rich, and just the right amount of sweetness to end the meal on a high note.\n\nIf you’re in Long Island City and craving authentic Mexican food with bold flavors and top-quality ingredients, Casa Enrique is the place to go. I’ll definitely be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidE1YUjdRRRAB",
            "text": "Overall, Casa Enrique was very good, but it doesn't quite live up to the Michelin star hype. I’m guessing the quality dropped within the last year or so. The service was abysmal as it took over 20 minutes just to order, despite having to flag the waiters down multiple times, and then another 40-50 minutes for the food to arrive. It wasn't just our table; the surrounding tables were also visibly frustrated with the slow service. While the food was also pretty standard for a mid range Mexican restaurant — nothing too special."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURnb0xBZRAB",
            "text": "Absolutely delicious meal here at Casa Enrique. The tacos are delicious, my partner said it was the tenderest lengua he’s ever had. The Mole was also perfectly made & the Branzino was flavorful. The tortillas were also perfectly made. They have great service & great drinks. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBak5hczhRRRAB",
            "text": "Delicious!!! The branzino is another level. Perfectly cooked and bursting with flavors. Paired with the tortilla, my taste buds were so happy. The mole enchiladas were delicious as well. The mole sauce we up there with some of the best I’ve had. For dessert, the tres leches was so rich and sweet, id highly recommend. & I loved the n/a margarita and n/a mojito."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcmR5NUdBEAE",
            "text": "Came here for dinner a little while ago for the first time - and was stoked because it's been so hard to get a reservation! I was a little confused because while seated, there were many empty tables throughout the restaurant but maybe they only have a few reservations to encourage walk-ins? EITHER WAY, on to the food - I loved everything we had! We had the sopesitas which were excellent, the carnitas with the hand-pressed tortillas also excellent, the chicken mole with rice, and the enchiladas with salsa verde.  All of these were great - though I will say the mole was sweeter than I was expecting. The mojitos (even without alcohol) were delicious - I recommend the strawberry and the mango. Lastly, we tried the tres leches as well as the chocolate pot de crème and the tres leches, despite being soaked, was still a light dessert overall. The chocolate was incredibly rich so would recommend maybe doing just that one on its own. Service was great - everyone was attentive and the best was that we essentially stayed until closing and weren't rushed out."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcllhQ0JREAE",
            "text": "Casa Enrique in LIC is worth every mile of the trip! Even though it’s a bit far from my apartment, I make it a point to visit at least once a year because the food is that good. The enchiladas and tortas are absolute perfection—my go-to is the chicken mole enchilada and the pork torta (a personal favorite). This time, we started with the chorizo sopacitos, crab tostadas, shrimp cocktail, and seafood ceviche, all of which were incredible. We ended the meal with the chocolate custard with cookie crumbs, and it was the perfect finish. Every bite is a reminder of why I keep coming back. Can’t wait for my next visit—Casa Enrique never disappoints!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvam9EM0lnEAE",
            "text": "The lengua, and pastor tacos were delicious and the little chicharron chips with the salsas were bad ass.\nI recommend the sopesitos con chorizo to start with."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cUxydW93RRAB",
            "text": "Amazing Mexican food! I definitely am not seasoned enough to dub whether this is authentic or not, but I found the flavors and quality really great. Came here for a birthday celebration with a party of 4 and got the guacomole, tostadas de jaiba, pozole de mi tia, mole di piaxtla, branzino al pastor, and the pastel tres leches. We also got the tacos de pescado, tacos de carne asada, and the suadero. The guacomole portion was a good serving size, and I loved the salsas, and other snacks that came with the meal. Everything was pretty good but we especially liked the tostadas de jaiba, pozole, branzino, and pastel tres leches. The tostadas had the perfect amount of meat and jalapenos, they were just bit small. The pozole was so hearty and homey, very citrusy and I liked the ratio of choclos, meat, and lettuce. Loved the food and would come again!"
        },
        {
            "date": "1년 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNGYtLVZnEAE",
            "text": "把墨西哥菜做的很精致，在调味上很用心。\nGuacanole特别丝滑。Ceiviche de pescado是生鱼片，特别令人惊喜的一道。鱼肉很鲜，在口中有香味存留，韵味十足。青柠和青辣椒的味道非常灵动清爽。\nTaco我们点了Lengua，牛舌特别嫩，肉质紧实；Taco de carne asada是牛排的，也很多汁。\n当天有限定的西瓜鸡尾酒，非常清新，好像一下到海边度假了。"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUZzluVE1nEAE",
            "text": "We’ve been meaning to visit Casa Enrique for some time, and finally got around to it!\n\nThe food was very good, though I must admit not quite living up to the (perhaps over-inflated) hype. It tasted fresh and authentic, but perhaps lacking a little bit in edge and kick. We ordered the quesadillas, a sausage-based appetizer, chicken tacos, and Dulce de leche — which was really pretty great.\n\nIt’s the service that let the place down. We had to wait for almost 50 minutes for our food to come out. Our repeated requests to our hostess to please check yielded very little. Our complaints resulted in nothing — no offer of say a complementary desert or drink, or even a real apology.\n\nSo overall — good, but we are probably not coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbVpVRllhVzA1UldKWWVYQmtZMUJHVFZkblZFRRAB",
            "text": "incredible food from a cozy neighborhood spot. Everything we tasted was incredible. The branzino was hands down the best fish I’ve ever had in my life - I would describe it as “melt in your mouth.”\n\nHaving had a Michelin star for years, you would imagine a hefty price for their dinners. However, this wasn’t the case. We “splurged” with two drinks, an appetizer, two entrees, AND dessert.. and it only cost $135 including tip. Highly highly highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqZ0liNlZREAE",
            "text": "We were excited to bring family here hoping the brunch would be good given the popularity but it was really meh. Biggest issue was food that came out cold and felt like it might’ve been cooked and sitting for a while before it was brought out. Considering this happened with the meal with medium steak, that was a bit concerning. We are pretty sure they just microwaved the dish and brought it back out. The enchiladas were not good … perhaps we just don’t like mole and salsa verde sauce - can’t tell. Tacos were fine, but many places make fine tacos for a fraction of the price. The best part was the guacamole, which was priced like an entree."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdWN6MHdRRRAB",
            "text": "I cannot believe what the interior of this Michelin restaurant is like. The walls are bare and it was just meh in the worst possible way. I have seen other restaurants that make their dining experience much more comfortable.\n\nThe food was yummy and the drinks were ok. My waiter did not know the margarita flavors offered. Honestly did not live up to all the hype."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeXF6aG9RRRAB",
            "text": "Loveeee it here. The sopecitos de chorizo and fried oysters are so good everytime. This time we tried the crab tostadas and they were super refreshing. The lengua tacos are excellent if you’re not scared to eat cow tongue. For my main I got the roasted pork ribs marinated on guajillo chilies and they were to die for. I’ve also ordered the skirt steak before so I will picture it here because it’s also an amazing dish. For dessert, the pastel tres leches is a must order. It is truly special and one of my favorite desserts to date. Make sure to plan a visit here I highly recommend it."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbHBHQUZBEAE",
            "text": "Really great brunch here.  Attentive staff.  Rajas Con Crema was super delicious and interesting.  Great depth of flavour on the taco fillings.  Tacos could have been slightly more refined, chunks of carrot and radish were super chunky and too much herb.  But perhaps I’m spoilt having Leeds’ finest PinchePinche on my doorstep!  All together a great experience with super food, good service and buzzy atmosphere."
        }
    ],
    "reviews_count": 85
}