{
    "name": "Mar's",
    "place_id": "ChIJwX48nTpfwokR63DTWAN8KyA",
    "grid": "QN1",
    "address": "34-21 34th Ave, Astoria, NY 11106, USA",
    "rating": 4.4,
    "user_ratings_total": 539,
    "phone_number": "(718) 685-2480",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GT1YxSTBWMWxGWTBoMVgwcGlZMFJNYWpOQmJVRRAB",
            "text": "Super cozy great for a great night! Yummy shareable plates and interesting cocktails."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeWJVOVdPRk5XVjNObGFubHRVRVJYUTJkVFpHYxAB",
            "text": "This rating is just for the drinks! Their non alcoholic drinks are so well curated. They have lots of flavors and ingredients like teas and spices etc. One is even smoked. Can’t wait to go back for the alcoholic ones!"
        },
        {
            "date": "2달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paclluWnBiVTEwYTNSdFMyTjRYMkZXTUhwUlIyYxAB",
            "text": "Lugar calmo, comida e atendimento de primeira!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMGVUTXdZbDk2ZG5oTVNuZzJZVU54Y2xjM1VYYxAB",
            "text": "I was passing by this spot a lot and it looks so picturesque. And it was always busy. So one day I decided to have a dinner there. I had lobster roll, desert mars and mocktail. The lobster roll was cold. I was expecting hot. And it didn't meet my expectations. The desert was fancy, small and really good. The waiters were a little bit too annoying, keep coming, keep asking, I had to talk to at least 5 different persons while my dinner"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oYWNuSlBWa1E1YW1OUmFrZE5TMlJ6T1Y4eFVHYxAB",
            "text": "Came in for the oysters and ended up loving everything. Great happy hour, tasty bites, solid drinks, and the friendliest service. Definitely coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eVVrZ3hOak5TTjJKRWRYbFVNbGxKUzFkU1VFRRAB",
            "text": "Food and cocktails were beyond excellent. I do wish the chairs for outdoor seating were a touch more comfortable but all in all, amazing experience and can’t wait to go back."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1alp1UUlBEAE",
            "text": "Great wine selection (love being able to do half carafes) and excellent fries and mushrooms!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSFZrTXhaMUZqVEZSeU4xbDBjVmN4ZERGb1QwRRAB",
            "text": "I've  been wanting to go to this place for so long. We finally made it for our anniversary and we loved it. Friendly staff, nice atmosphere and the food was the best!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxelEwOVdVVVJvVDJaU1NGWmFjV0ptWjFOT2NFRRAB",
            "text": "Our favorite spot in Astoria. The absolute best cocktails (in all of NY). So much care and passion. A relaxed setting. Service that is untouched. Romantic. Cool. Forever patrons."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJcmw4TFBpam9McDlnRRAB",
            "text": "Mar’s Restaurant Review: 3/5 Stars\n\nHey everyone! Just a heads up, this is my personal take on Mar’s. If you’re curious, I definitely recommend checking it out for yourself!\n\nFirst off, Mar’s is a nice spot for a dinner date, but I found it to be a bit overpriced for what you get. The quality of the food didn’t quite match the price tags, which was a letdown.\n\n**Service:**\nThe service was fantastic! The staff was super friendly and professional, making sure we were well taken care of throughout the evening. We never felt neglected, as our waiter was always nearby.\n\n**Atmosphere:**\nThe atmosphere is lovely—perfect for a romantic dinner. We opted to sit outside, and it was surprisingly peaceful, with minimal noise from traffic. The interior looked great too, but we chose the patio since it was quite warm.\n\n**Drinks:**\nWe tried the Old Fashioned and the Box of Chocolates cocktail. The Old Fashioned was impressive—balanced and well-made, which is a big deal for a cocktail enthusiast like me. The Box of Chocolates was also fun and unique, making it a great choice for anyone looking to try something different.\n\n**Food:**\nHere’s where things get dicey. The food was pretty average and definitely not worth the high prices. We had the oysters and shrimp cocktail (forgot to snap a pic of the shrimp). The oysters were okay, but the shrimp cocktail left a lot to be desired—four pieces for $19 felt a bit outrageous. I’ve had better for less at local bars.\n\nFor our mains, we ordered the Top Burger and Fish & Chips. The burger, priced at $26, was bland and lacked creativity. No fries or salad included, which felt like a missed opportunity. If I’m paying that much, I expect something special! The Fish & Chips were similarly disappointing, with just a couple of small pieces of fish and one shrimp (which seemed like a repeat from the cocktail). While the flavor was decent, it still didn’t justify the price.\n\nDessert was the Mar’s Bar, but it really needed a dollop of whipped cream or some sauce. Especially some sort of crumble on the bottom. Something. Anything. It was dense and lacked texture, tasting more like a dry fudge tart than anything special. With a confusing sugary rosemary on top, that didn’t add anything other than it made it look good for photos.\n\nOverall, the service, atmosphere, and drinks were the highlights of the evening, saving the experience from being a total letdown. I’m not sure I’d return for dinner, but I might swing by for breakfast or just drinks in the future.\n\nIf you’re in the area, Mar’s is worth a visit, but unless you’re mainly after the service and ambiance, I’d recommend exploring other options for food."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNMm1pdFRvMDdTZ0xBEAE",
            "text": "The escargot was served in a shallow bowl with gummy bread. We brought it up to the server, but we were ignored.. There wasn’t even enough butter if you wanted to soak it up with the bread.\nThe one crab cake portion was tiny and expensive for the serving. The burger bun had a weird texture. It was dry and flat. When I bit into the burger it fell apart. No one came to ask how everything was. We went 20 minutes before the kitchen closed on a Saturday. They should still be on their game for the price of the burger and the $180 we spent. This was big disappointment.  When we paid the check, I didn’t mention the burger being bad, but we were so hungry I had to eat it anyway. Also the servers didn’t seem to care about anything."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPamM5Y2JfenB1M1JnEAE",
            "text": "This place does not offers too much options on the menu but the food was okay. I was like to mention that this place is an extremely white oriented restaurant, I can feel the passive racism from the workers (all the white ones), unsafe being there as a woman of color. Should’ve not tipped. Fix your attitude before running a business."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLWZ5Sm1nRRAB",
            "text": "One of favorites in NYC"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJb19lZVZBEAE",
            "text": "What a lovely evening we had at Mar’s! The cocktails are without a doubt some of the best I’ve had, so many unique yet amazing options. The atmosphere is perfect for a date night. The only downside was the portions… while the fries were amazing and the portion was generous, the cheese plate we ordered consisted of two small slices of cheese with some pecans, and dollop of jam and honey - wasn’t cheap either. It sucks because they do everything else right. Our server, Tristan was such a stand up guy, made the evening even better with his friendliness and quirkiness. I think all in all, a great spot to drink their cocktails and get a snack. I’ll be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOHRQb053EAE",
            "text": "Excellent service and delicious food! There’s plenty of seating, making it easy to enjoy a relaxed meal. Be sure to try their Oyster Martini—it’s a unique and flavorful must-try!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMU9qcV93RRAB",
            "text": "Has a speakeasy vibe. Very classy spot, perfect for dates."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bXZmVTRBRRAB",
            "text": "Perfect spot for a date night with oysters and well-crafted cocktails! The oysters tested really fresh. The atmosphere was also nice, it looked upscale inside but with their everyday happy hour the prices were’not bad at all.\nWe live in the neighborhood and I’m glad we have this bar for our impromptu night out."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnX2J6QklBEAE",
            "text": "With one of the best martinis in the city, Mar’s is perfect for a first date or an anniversary dinner. Quick service, elevated bites and a lovely atmosphere makes this neighborhood gem a must visit when in Astoria"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMHBqYkdREAE",
            "text": "Was there for Valentine's dinner with a prix fixe menu. Was seated at the rounded corner table which gave us a unique view of the restaurant. Service was amazing, you to the waitresses, hostess, and bartender for keeping things in order for the event.\n\nDinner itself was great, it came with complimentary champagne which was very enjoyable. Most dishes I got, I believe are not from the main menu which I wanted to try.\n\nThe lobster salad was good, it did feel lacking with a cold lobster, some grapefruit, and onions on a bed of leaves but it was still good.\n\nThe mushroom ravioli was very good, sitting on a sea of butter. I would've liked it to be more filling but it was perfect considering a prix fixe setup.\n\nFor the main dish, I got warm whole lobster which came with butter and white asparagus. I focused mainly on the lobster which was nicely cooked and warm theoughout. I personally normally wouldn't get lobster because it can be a messy eating process, but I was glad to have a whole lobster. The white asparagus was also delicious but I didn't get to fully enjoy it since I was focused on the lobster.\n\nFor dessert, I got the cocoa bites which consists of 3 items, almonds that were bunched up in chocolate, a brownie, and chocolate mousse. The almond was OK, cant go wrong with chocolate covering but hard to eat because it was a spiky assortment and felt like it was hardened in chocolate than covered. I loved the brownie, it was very moist inside but crispy outside. And the chocolate mousse was very delicious as well, couldn't get any better.\n\nOverall nice experience, I do recommend looking at the menu beforehand to decide if you'd like to dine at the restaurant. I mainly did so to eat dishes that were normally not served."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBb2J5OGlRRRAB",
            "text": "It has a lovely atmosphere, but what you get for $100 is minuscule and not that inventive/interesting."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfemY2Q0F3EAE",
            "text": "Mar’s is a quality neighborhood spot. The vibes are great it’s cozy it’s welcoming. It’s all of the things you want. They have a nice little patio area for outdoor dining in the summer. The staff is attentive, friendly, and do a great job when it’s busy. The food is also great! The oysters are great especially on Happy Hour! The Brussel sprouts and crab cake are both delicious as are the Sage Fries. The whole fried sage leaves are so crunchy and flavorful. The burger is also simple but very well done. It’s not too much or too little, flavorful and understated. 8.3/10"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMHBpUHZnRRAB",
            "text": "This was my first time dining here and my friends and I did so out of convenience to her apartment.\nFood (3/5):  We ordered an appetizer of fries which were a 4/5, especially with the sauce it came with. I got the burger as my dinner and it was dry and not much flavor. I asked for a side of Mayo but I was told they don't carry plain Mayo. I ordered the Mars Bar for dessert and it was good but not great.\n\nService (5/5): we had a great waitress who was attentive to our needs and our waters were consistently filled and were asked if we needed anything. However, I asked for no tomatoes with my burger and it came with one.\n\nAtmosphere (5/5): I went on a cold winter night and it was dimly lit with beautiful bathrooms, unique wooden bar and spacious tables next to a brick wall. I loved the atmosphere."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNzdEcURBEAE",
            "text": "Highly recommend for events! Working with Nur from the Mar's event team, planning my daughter's first birthday, was a dream. She was so kind in working with me within budget and working to accommodate my vision for my girl's special day. I can't say enough good things about the team there. If you're looking for an event venue, definitely consider Mar's!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcjRpYWlBRRAB",
            "text": "My dining experience here was incredible! The food, the holiday decor, the cocktails and the service were above my expectations! Highly recommend!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNmYzMTZBRRAB",
            "text": "I recently dined at your establishment for Thanksgiving dinner on November 28th. While the atmosphere was pleasant and the service was attentive, unfortunately, both my partner and I experienced severe food poisoning after our meal. I ordered the swordfish, and my partner had the glazed ham. We were both ill for five days following the meal.\n\nAdditionally, I was unable to finish my meal and had it wrapped to go.\n\nI wanted to bring this to your attention, as it was a very concerning experience."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdllQd1RnEAE",
            "text": "Great vibe. Quiet neighborhood restaurant, yet upscale. Wonderful cocktails. Food was super tasty!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbnJxbTFRRRAB",
            "text": "Oysters were great, new Zealand > west coast"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzanRyMlhBEAE",
            "text": "Ambience and decor was dark and cozy. Ordered a dozen oysters, most had shell fragments. Calamari seemed cut in house from a small squid, but was on the dry and chewy side. Fried nicely, and fried chickpeas and peppers are a nice touch. Ordered steak tartar, didn't try, but saw on the menu it came with a baguette but didn't see it, maybe I misread the description 🤔."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaC1IeWVBEAE",
            "text": "A bright spot in Queens that answers the question ' Can I get a well made cocktail with a great dinner? '"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYLTV6eTJnRRAB",
            "text": "Salsa margarita and fish and chips were really good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbzl1V2lBRRAB",
            "text": "To be clear, the service was great. The waiter was very pleasant and the service in general is very attentive. But, for a Saturday night, half of the items we tried to order were not available. Also, not serving fries with the burger is fairly aggressive considering the price point. The bun was dry and unappetizing. Fish and chips was ok. Given everything, i doubt i will be frequenting this venue."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuXzdPSkl3EAE",
            "text": "Love love love this spot! The food was phenomenal. Drinks were delicious. The broth with the mussels was perfect. Taylor took spectacular care of us- attentive, knowledgeable and very kind. Don’t skip dessert!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua04ycXBBRRAB",
            "text": "Any place that doesn’t allow dogs in patio when place is empty sucks. It’s NYC 2024, also bartender guy was a tool as soon as I walked in, mentioned dog then walked off and ignored me. Chill guy, you slanging drinks, not that serious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcHVPcG13RRAB",
            "text": "Great Raw bar Happy Hour. Cool space, felt like I was at Maison Premiere but in Queens. Service was impeccable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcTZDQmJnEAE",
            "text": "Went out with a couple of friends last night. Place and cocktails are amazing. We ordered tons of plates. Loved all - except they sent out the lamb Italian sausage raw. They were apologetic but shame on that cook. Also because I so wanted to try it!!!! Looked delicious, maybe next time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdmJ2cmlBRRAB",
            "text": "Food is frozen, presentation is average. Pretend to serve fancy food but it's not"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMTZ5UC1BRRAB",
            "text": "Walked in on a sunny Saturday at 3pm, but only one table was dining. Very surprising. We ordered a few varieties, oysters from the raw bar, fish and chips, and a burger. Their Eastern oysters were okay, but the Dutch oysters were HORRIBLE. First, they were extremely fishy. I had to spit out. Also too many little shell pieces that almost stuck on my tooth and felt like the kitchen doesnt know how to shuck the oysters.\n\nFish and chips were not fresh. I could tell the fish has been re-fried multiple times for the past few days. It’s not a day old. More than that. It was hard and dark batter. Crunchy and hard is different. It was beyond ridiculous kind of fish and chips.\n\nBurgers were very dry. The bun was cold and dry. Homemade burgers are better.\n\nOverall, foods were horrible. $125 before tip for dozen of HAPPY HOUR oysters, a coke, a burger and fish and chips was not worth it. I know my food. Spend your money to other local good restaurants.\n\n*it is a cute (decent) place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNGRUam9nRRAB",
            "text": "You can’t sit outside with your dog, first place I’ve ever been that doesn’t let you sit at an outdoor table with your dog.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OXF2WVpnEAE",
            "text": "Love this place friendly knowledgable staff and tasty food\n\nMy partner love the oysters and cocktails  here. Great place for seafood lovers"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6a3N1U0VnEAE",
            "text": "Literally very upset about this service.  Our woman waitress was nice and kind and has nothing to do with this. The fuller sized blond male waiter who was walking around approached us and ask if my kids were going to \"stay seated\" . After ordering a bottle and many plates I then asked if they welcomed children as this is NOT a comment for an empty restaurant that we have happily ordered more than enough for this treatment. As a local astoria/ lic restaurant they should know this is a family neighborhood and would help business if he didn't act RUDE to familes!! I used to come here regularly the service has put a different taste in my mouth as we ALWAYS eat out in lic and manhattan and have never had someone speak like this."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEZ19iT2ZREAE",
            "text": "Not worth the price - if yr spending this much on dinner go elsewhere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MS1EVVl3EAE",
            "text": "A huge disappointment. Came for the Sunday roast which for $36 got you 4 slices of overcooked beef, a pile of spinach and a small helping of mashed potato - a far cry from the ‘British weekend tradition’ that the menu claims. Service was good but otherwise this place really missed the mark"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N3Q2ZzF3RRAB",
            "text": "Had a great night at Mar's!  I have been a semi-regular patron for a few years but the other night was special.  The food was excellent, the pre-dinner cocktails were very creatve and the staff was lovely to us.  We had Steve as a server who was funny, attentive and gave great recommendations.  My dining companion said the burger was one of the best she's had.  I ordered the Salmon and it was really flavorful and tender.  The wines that Steve recommended paired beautifully with our choices.  It was a really busy night but didn't feel crowded... the atmosphere was elegant and friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMWNmZjhBRRAB",
            "text": "So impressed by this place. The drink menu is unique, food is incredible and the people are super friendly. Pricing is amazing for such a high quality experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbWRyMXBRRRAB",
            "text": "You probably won't have a good experience here if you're a person of color. I've come here several times and always felt dismissed and unwelcome.\n\nOnce came for an oyster happy hour and it took over 30 minutes to put raw oysters on a platter."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkak5xRnFBRRAB",
            "text": "3 magic words: Weekend Happy Hour.\n\n3 more magic words: sage french fries."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkLU5fb09BEAE",
            "text": "Amazing oyster happy hour, impeccable service, incredible vibes ✨"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0c0lpazJnRRAB",
            "text": "A friend and I walked in right as Happy Hour was ending but the waitress was very nice and still put in our HH orders.\n\nI ordered the shrimp and they were very overcooked. The cocktail sauce on the side was good, but could have used a little more bite to it. I didn't try the oysters, but my friend did not complain about them.\n\nMy favorite of the night was the calamari frito as it came with fried peppers and chickpeas which I've never seen before, but maybe that's just me. The crab cake was very salty, but the portion was big enough for 2.\n\nThe restaurant got progressively louder as the night went on, and I was almost shouting by 9pm. Not an awful experience, but probably not a good first date spot. The tables were also very close together which I personally don't like.\n\nOverall a cute spot but not worth going out of the way for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdXJxMWhBRRAB",
            "text": "What a fabulous experience! The waitstaff was so kind and attentive. Gave us space but were also readily available as needed. Their recommendations were excellent! We got the chef’s special Sunday pot roast, very flavorful and balanced, as well as the special oyster’s Rockefeller which was a true standout! Probably some of the best oysters I’ve had!! We also tried the chocolate ganache dessert which was thoughtfully prepared with a dash of olive oil, flaky sea salt, and candied thyme which we were instructed to crumble over the chocolate. That tactile component was actually quite fun! Overall it was a lovely experience. The ambience felt like you were in a cozy neighborhood cafe in Europe, with warm lighting, paintings, and original word work. I’ll be happy to come back sometime soon. Do yourself a favor and check out this delightful spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOcDQtNTFnRRAB",
            "text": "Great atmosphere during dinner and the cocktails were very tasty. Unfortunately the food was high quality but slightly lackluster. Service was a highlight; friendly and attentive. Brussels Sprouts were my favorite appetizer. Go for the cocktails and a snack."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNbXJhT1d3EAE",
            "text": "In my opinion Mar's is one of the top three restaurants in Astoria. The rustic interior is the vibe I love, but let's talk about the cocktails! Their cocktail menu keeps changing meaning they love to experiment! Needless to say there will always be staples.\n\nRecently I came in after work and sat at the bar. I tried the of their cocktails and their were all fantastic. The bartender is top notch and knows his stuff including music!\n\nI had the following:\n- Heat Wave (seasonal summer drink)\n- The Paper Plane (a staple)\n- Spicy Margarita\n\nAll fantastic!!\n\nTheir food menu is underrated but this time around I didn't order a bits, but I will next time.\n\nCheers!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNzZ6b25nRRAB",
            "text": "Fantastic service, and the atmosphere was nice, like a European cafe.  The food was good, but not great. The quality was ok...what you expect. The portions were on the small side for the price, atmosphere and location. The saffron seafood risotto was full of flavor - I recommend this dish. The happy hour oysters were good as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1enBXVU53EAE",
            "text": "My wife and I came here for the first time for our anniversary.\n\nReservations were for 2 at 6pm. First impression of the establishment was it had an old school vibe and decor, almost like a speakeasy.\n\nWe started off with a LEATHER AND LACE drink,  the server spritz with what looked like a perfume bottle. Wife was intrigued and really enjoyed the cocktail.\n\nI started off with the TABLE BEER SAISON which was ok, im more of an IPA man but gave it a shot.\n\nFor appetizers we began with the CHARRED BABY ROMAINE SALAD. It was ok, flavor was mild and I personally think the almonds should be slivered instead of whole.\n\nThe STEAMED CLAMS were great. For the price I think 4 clams instead of 3 would be nice especially for sharing.\n\nMy wife ordered the CROWD PLEASER which transported her to the Caribbean!\n\nFor the mains we had the TSIPOURA Dorado fish which was delicious!!! The charred corn was incredible.\n\nI ordered the 5 boroughs summer ale on tap which did not taste fresh and was very flat.\n\nI then ordered the SINGLECUT 18 watt IPA which tasted like it was poured straight from the brewery which is not far away.\n\nWe also had the STEAK & FRIES.The steak Bavette cut which im not familiar with was cooked perfectly but was a very small portion. It came with Sage fries which were ok. I would have preferred Steak fries. I'm not a fan of very thinly sliced fries with steak even if they are fresh. The sage did not make much of a flavor impact and seemed unnecessary but overall not bad.\n\nLastly for dessert my wife had the MARS BAR which appropriately named was great. It was not overly sweet. She washed it down with a Saveiro Madeira which was an excellent pairing!\n\nI finished with the HONEY WALNUT CAKE. I think it could have been a bit warmer. The description does say sweetened only with Honey but it was not sweet at all and was not crazy about it.\n\nOverall would return and would love to try the rest of the menu."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndHNXZUtREAE",
            "text": "I quite enjoyed this place. Staff was very courteous, much more than I would've expected. We got brunch here and I went for their dirty rice, which was very well cooked, with great flavor and overall even looked very nice presentation-wise.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbUxmY3FnRRAB",
            "text": "Lovely surprise when we visited Mar's yesterday by the first time. It is located in Astoria in this unassuming neighborhood; inside reminds me of old restaurants, pretty, refined and cozy. The service is top notch, everyone is so friendly and helpful. The drinks were craftily made and you can see that they spent some time thinking about the ingredients and recipes. The oysters were MAGNIFICENT - fresh and delicious. If you only go for oysters and drinks, it is worth the trip. We asked for grilled octopus as appetizer, super flavorful and the quantity was pretty good. Our entree was the snapper with two sides, and let me tell you, it was superb.  I love the experience of dining at Mar's. It is a keeper for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdnZySlRnEAE",
            "text": "Leather + Lace cocktail is definitely recommended.\nFondue was interesting.\nService was exceptional!\nIt’s a classy place so you should come here for special occasions"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWMFB5X1lBEAE",
            "text": "The waiter is very knowledgeable and helpful. There is an oyster happy hour that’s also on the weekends, and the oysters are my favorite in the city. The mignonette sauce is very good. This purple drink on the happy hour menu is good too. Some of the best cocktails!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBei1qM1BnEAE",
            "text": "Great vibe, good music. Drink menu is pretty varied and interesting. They have a good selection of beers, plus wine! I got the seafood stew...it could be a little more flavorful either by having more seafood stock and/or salt. Clams were a…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNeVkyX3NnRRAB",
            "text": "Great finding in Astoria, NY. Had a great time with my brother. Small cozy warm place. Had an early dinner on a Sunday. Great cocktails. Great food. Great service. You feel like you've walked into another place and time. Highly recommended"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKc19PcDN3RRAB",
            "text": "This place was recommended by a friend.  I was going to be introduced to an orange wine.  We asked if we could taste the 2 types of orange wines from the menu.  We could only try one of them.  The waitress brought 5 drops of the wine in shot glasses 🤣. I was not crazy about it so we ordered the other one which was only available by a bottle.  It was smoother.  Before we finished the bottle, the bus girl took it away.  When I told the waitress about it she said that the bottle is probably in the garbage now.  It was the end of the wine story.  We also ordered a small ceviche.  It was xxsmall.  The steak tartar was hard to chew and the meat was served in chunks unpleasant to eat."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMU1uVGJnEAE",
            "text": "Quiet spot off the beaten path in Astoria. Delicious food! Good service. Pricey, dinner for two easily over $100. Oysters are normally $3, $2 all day Sunday and $1.50 at happy hour (I think 5pm-7pm) and or server was very helpful with selection. Will definitely be back for happy hour."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHMl9fYUF3EAE",
            "text": "I heard about this place from a couple websites listing the best restaurants in the area, so I wanted to give it a shot. Overall, it was alright. I went for brunch, and the food was overpriced and nothing amazing. My meal was essentially two hard-boiled eggs with some mustardy sauce, cole slaw, and one sausage patty for $18. My friend's dish (dirty rice) was equally underwhelming. The portions were small and unimpressive. The drinks were good, the vibe is nice, and the service was fine, but I probably wouldn't recommend this place for brunch."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5LTUyS29RRRAB",
            "text": "Great ambiance and service. Their food was fresh and delicious. Their cocktails were amazing. So glad to have this spot right in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1NTRiR3FRRRAB",
            "text": "This place is amazing. If you love raw fish this is your place. The oysters are very good and the waiters are very professional and will guide you through the experience. Perfect for a date, an anniversary or just for a taste of good food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2c0xTN0lnEAE",
            "text": "Excellent cocktails and service but small overpriced dishes. I paid $25 for these fish tacos. Thanks but prob not ever again for a full dining experience"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVMU1lX1FBEAE",
            "text": "It's a lovely space and the staff is great!  I thought the oysters were ok.  $2 oysters all day Sunday.  An interesting selection.  Coffee is standard.  The pancakes were horrible.  I couldn't finish it.  Asked for butter and it was still…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5ajhlV2lBRRAB",
            "text": "I love Mar's. Go there and have a nice time. Watch the setting sun cast crepuscular light across the Kaufman Studios, and sip on a beverage. Draw a finger, lazily, across the rim of a glass, ok?"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXc01EOW13RRAB",
            "text": "It was my first at this spot and I was in a date.\nIt has such an intimate ambience that really sets the tone for dates of any type.\n\nI say at the bar and asked for a mango margarita, unfortunately there was no mango syrup but the bartender was gracious enough to make me one with a pineapple flavor. It was SO GOOD. Just a little small in terms of quantity, lol. I ordered for another one and this time it was a really good pour.\nMy date’s first pour was also little then subsequent ones were a lot more. I’m guessing this is the bartenders way of making you order for more.\n\nAll in all, I enjoyed my time here and will definitely be coming back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPc2JucXBRRRAB",
            "text": "Most of the bigger oysters were good and fresh but the octopus was chewy worst than a chewing gum and the wine wasn't that good,maybe because of happy hour?? Anyway won't be coming back"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cWRycWlRRRAB",
            "text": "Lovely vibe, great decor, food good for brunch but not the most exciting options. Looking forward to coming back for happy hour"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bnQzMG9RRRAB",
            "text": "Still a great spot haven't been back since before the pandemic. Great food great Sunday oysters for $2. Great drinks friendly service parked on the street."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNS02R253RRAB",
            "text": "The paella was AMAZING!! The happy hour is great! The service super friendly! I loved this place! Super recommend!"
        }
    ],
    "reviews_count": 72
}