{
    "name": "Telly's Taverna",
    "place_id": "ChIJ7Sw_SF1fwokRybg2bJuAXd0",
    "grid": "QN1",
    "address": "28-13 23rd Ave, Astoria, NY 11105, USA",
    "rating": 4.5,
    "user_ratings_total": 1252,
    "phone_number": "(718) 728-9056",
    "reviews": [
        {
            "date": "1시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toV1JFNVhSVWhqY0RGTVJYSk9Zamw1Y0VZMVVWRRAB",
            "text": "Lovely place. Friendly atmosphere. Food is amazing only recommendation would be to change the plates for the salad. They have holes on sides which makes it harder to stir your salad. The drinks menu can be enhanced with more options"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUFl6bFJhRUZ1VFVkMFRuWjJPVU50Wm1rNFprRRAB",
            "text": "I can't get enough of what they serve at this restaurant. This staff member showed real personality and engagement. The meal preparation and service attention were notable. The place has warmth, helpful servers, and minimal but nice design. The visit was wonderful; I'll come again :)"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdFJsWlBlRzloUjJwMFZYZFVOa1I1Y1Vab1JYYxAB",
            "text": "The best Greek food in Queens!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVVltbHliVEpqU0hCeE5qWmlVR05KUWxScVoyYxAB",
            "text": "As always worth every penny ! What a wonderful dinner we had today, we were so lucky to have Rafaela today ! She is honestly one in a million ! What a beautiful person, from the moment she greets us to the moment she says goodbye ... always a pleasure to dine in a place where they make you feel like family. Besides the wonderful and kind service, you cant go wrong with the food. The octopus is a must !!!!! Its the most tenderness, flavorful octopus you'll have in NY. I love the saganaki, the baklava, the salads, the fried calamari ... we tried the pasticcio for the first time and it was delicious. All the busboys and staff are wonderful, I have to say nowadays you rarely find an establishment with people that actually care about their jobs ... this place is always consistent with the people they hire. I love Tellys and will continue supporting them."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTGNrUnRkVzlKU0RWVVMyMU1aM010YVRoeVFsRRAB",
            "text": "Great family dishes"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSU1rTlhlbTVMVldkWmVuZzFia1JsUlZNNVQxRRAB",
            "text": "Made a quick pit stop here while my flight was delayed and I'm so happy I did. I enjoyed my solo dinner here. Sophia the waitress was a sweetheart. The food was amazing especially the grilled octopus. The place was gorgeous. I will definitely be back!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaV1dIcHdXR3RqUXpka1NUVmZVVUp0ZHpKWFJIYxAB",
            "text": "great greek food"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MVkzVkhVRkJGU0VGUFNqQlFWRVpOUlZCSVlsRRAB",
            "text": "I visited today and waited over 40 minutes for a fish dish that came overcooked. My son’s fried cod was overcooked too. The staff said a new one would take 25 minutes more, so I left after paying for sides and drinks. I wanted to share this feedback because it was disappointing, especially since I came specifically for the fish."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSWNHdHlPVzQwTkdwRU1XMXBlRGhZU0U0d2MwRRAB",
            "text": "Rafaela was so great. Very honest and super helpful."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMWFXNHdVME5qYVdSblEydGhWM1oyZVVOWVRWRRAB",
            "text": "Always on of my favorite 🇬🇷 Greek cuisine spots. Great place for a date with your loved one 😍\nThis time I had the sardines and octopus 🐙 with 🍷"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWT2JUSlZVUzFuV0ZGTFgyZ3RaVm81TTBSR1JVRRAB",
            "text": "Amazing food! Outdoor seating is a plus. We already get treated with great hospitality"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVWREUnVSREZQUmpNeFZGcHJXRkZMVW5GV1dXYxAB",
            "text": "Simply the best! Have been coming here my whole life and just celebrated my 30th birthday here !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTVFsWlVVamh1VVVRek1WVTNOMXBCTlhoVGVHYxAB",
            "text": "I went for my Anniversary, made reservations. Thet table we were seated at was up against another so you have to sit on one side 3 of us cramped. I was having dinner with 4 other strangers I was facing, it was an hour and a half wait for the appetizers. They were great, then another hour for the food. I don't know why they didn't bring it all at once, I ordered a chicken kabob burned to a crisp and the soutzukakia meat was spoiled. If your idea of a great evening with your family is to be squeazed into a wall and sitting so close to another table that you are practically dining with them, and food that isnt fresh, then this is your place. This was well overpriced. The waitress was nice."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Uk9HRlFVRTh3Y0ZGb1JFUnpWbGhxWWtjM2IxRRAB",
            "text": "Went first time it was not bad seafood tasted somewhat fresh and lady server was nice , went back 3 days after since i thought it would be the same , I orderd pretty much same food ,couldn’t believe how much of a different experience it was not only the server approached strangely but most importantly the food , horrible not fresh , everything tasted too fishy(old seafood smell) other then that there was also a strange odor from the food , also cold lemon patatoes , i wouldn’t recommend anyone trying and this is comming from someone who NEVER writes reviews at all bad or good ."
        },
        {
            "date": "1달 전",
            "language": "el",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQlluaEVUMGR0WkRsb1ZrOVVkbVEzV0dOblZFRRAB",
            "text": "Απογοητευμένη δεύτερη φορά παραγγέλνω σε σας και δεύτερη φορά Λάθος Γιατί ηταν σκουπίδια και τις δύο φορές"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTWVTMVVSR1ZtUjNjNVpWQlZMVXBPWVdabU5XYxAB",
            "text": "We had the opportunity to dine for the first time at Telly’s taverna on Friday, September 12th, 2025.\nWe were a group of three and Sofia was the person guiding us in the experience. Sofia was polite, kind and fantastic! I want to appreciate her patience, professionalism and to all the members at Telly’s Taverna! I can’t wait to go back there and visit! Best regards!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUE0wTldUVGxyVkVRdGMybHNNVmRIY1MxTE1sRRAB",
            "text": "Fantastic authentic Greek food. Great for lunch, dinner and family gatherings"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNmF6SnpZVGMyYWpaeU1GY3pNalJLTUZJMmMzYxAB",
            "text": "I only give one star because I'm not allowed to give less, I don't know how the food is but I was dying to try it and I came from far away for it. But when he arrived at the place, only a busser approached to put the water and the bread. More than 20 minutes passed from there and no one approached even to ask what they wanted to eat, there were 5 waitresses in the place and they passed by without even looking at our table. HORRIBLE ATTENTION not even a star is given. His waitresses are useless. Very bad."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVmNsSlNORlpPYWtOcVRXTlpZMGgyZW5CMmVYYxAB",
            "text": "Food was on point."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aFFubFNjVGRCVDNremNYZEJla0paZVVWclJFRRAB",
            "text": "the food was delicious!!! we got the octopus to share, whole dorado + whole porgy and sat outside on their lovely terrace. staff is super sweet too, 10/10! can't wait to come back 💖"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRE1WTTRNSE56VERsaldGUmxhMlJsWnpGTlRtYxAB",
            "text": "El fish buenísimo!"
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQ1FUWjJVM2RvZUdsZlUwdDFUMWs1V0VwdWExRRAB",
            "text": "Très bon restaurant familial grec, les plats sont très bons."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WmJYQXlaRkJsZERGck1GRjFhRkZEV1RKUWRrRRAB",
            "text": "Comfort food to the max. The most delicious prawns with awesome sides. Lamd or sea can not go wrong"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeFkyaGhWRWR1VVhreVUyUXRiVXBXV2sxWmJFRRAB",
            "text": "An Astoria gem!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdGVtZEJUR0ZqWDNGdFEyZG9YelJGWVcwd1QxRRAB",
            "text": "Really fresh well-grilled fish"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOb1VtbHdPRzl1ZW5GRlJUSldNbFZZY2w5dGIzYxAB",
            "text": "The best food and amazing staff!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVGNWUlhSR0pVUmpKUVZXd3RTazFQUTAxVmRXYxAB",
            "text": "Great fresh Greece good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUVNVSXpNMlZtUzBOVmNVaENNV2RaVVVOemNsRRAB",
            "text": "Food was excellent. In my opinion very reasonable prices. Outdoor dining. Service a bit slow, but it was the start of Sunday dinner rush."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdVZFeFhXbXRrVkU5TVltNHRVMUV4YVRabU4yYxAB",
            "text": "Excellent 👍…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KamVVMUZRVTFOVlVKNE9WUkNYMnhFTkVWcU5WRRAB",
            "text": "We had the most amazing lunch here. We had three different types of grilled fish (the branzino was our favorite), and enjoyed an amazing Greek salad, Octopus, and tzatziki. All the desserts were amazing as well. I really cannot wait to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbWExcEZTMU10WlVadGF6bFhkVlJMVFVGQ2RIYxAB",
            "text": "I came on a Sunday at 11:30 and dined alone for various unfortunate reasons. I was there until almost 2 and left much happier than when I went in. They made me an individual Greek salad which was very fresh with huge chunks of feta. I was also given half a loaf of very good bread. The tender lamb kabob with crispy potatoes was significantly more food than I had room for but I persevered. After all this I had to forgo dessert which is simply a travesty and instead ordered a hot tea to attempt to steady myself before going out into 90 degree heat. No one rushed me, they continued to refill my water glass as I made peace with my stomach. Suddenly a plate with a napkin and fork appeared. I checked underneath for a bill but it wasn’t there.  Then a plate of the most beautiful and delicious Loukoumades I have ever eaten was placed before me. They were crunchy and feather light, coated and sitting in a pool of pure honey.  Suddenly I felt able to chew again and I ate each one, savoring it slowly.  Delicate crunch, soft inside, thick sweet honey. Hey, some days you just get lucky."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOV2RqTjFTV2RWVWs1Vk5IUjVSSGRxUmpVNWJGRRAB",
            "text": "Incredible, delicious greek food! We tried the lemon potatoes, grilled jumbo shrimp with rice, and grilled calamari - everything was absolutely perfect. The flavors were spot on and everything tasted so fresh."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORWVEbDVNbXBGUWkxc1VXdFNaUzFTUTFkWFZXYxAB",
            "text": "Great place for Greek food in Astoria.  And so lovely after the renovations"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSVdEbFBRMGRCUkZSdmFrVlhTRjk2Um1Ka1oyYxAB",
            "text": "A Greek restaurant in the heart of Astoria that withstood the test of time earning a reputation for high quality Greek food. I ordered fried calamari with horta (boiled greens) and the calamari was tender and crispy. Some nice touches are the best bread I had in a while and the bottle of extra virgin olive oil on the table. The Cypriot waitress was quick and efficient and had a wide smile. The decor is lovely and like a taverna at seaside in Greece . I highly recommend this place and it could be a better experience than other over hyped restaurants in the area ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYlR0ZVBicUszeWdBRRAB",
            "text": "My favorite place 😍\nI love the the food is amazing 👏"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ2p1Nm4wbGZiQmJ3EAE",
            "text": "the food is so good and reasonably priced!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLalctc0ttMXQzY0NnEAE",
            "text": "I always ordered from this place, and food was always on point.  I'm giving it 4 stars because I went there with a friend around 2 pm. during the week to grab some lunch, and they wouldn't serve Gyros at the restaurant. They only made it for takeout. Shame I traveled from out of state to specifically have their Gyros, only to find out they didn't make it to dine in. Bummer!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLZmRfTWlROThLbmlRRRAB",
            "text": "Overpriced for the portion size."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMR3N2NU93a0oyUzh3RRAB",
            "text": "Food was good, loukoumades were even better but overall it was overpriced!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcl9yWV9wOXA2UzNnRRAB",
            "text": "Excellent Greek eatery which stands out amongst similar other ones because of its friendly service and good food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQV3A0OHZUZ0x6X2VnEAE",
            "text": "They have the best Spanakopita, fresh"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLWhrOWpSNlBHT3pRRRAB",
            "text": "Amazingly tasty and atmospheric. A real piece of Greece in New York."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaUxUTFRnEAE",
            "text": "Some of the best Greek food in all of Queens."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdlpqR0NBEAE",
            "text": "great place for family and friends, very spacious and easy going vibes. the decor and furniture made us feel like we were in greece. the food was all delicious. menu highlights: lemon chicken soup (creamy and delicious), the dips (we devoured them), and the meat platter (great assortment doused in olive oil). we were so hungry and excited for the food that we forgot to let the phone eat first."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdVllcElREAE",
            "text": "It's a great restaurant"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMFluNUxBEAE",
            "text": "Hands down to one of the best Greek restaurants in NYC! . I’ve been going here for over 6 years , and I always come back. why? Because the food and the people make you feel like home away from home 🇬🇷\nI have tried so many other restaurants in NYC but nothing like Tellys. First of all, the quality of the food is beyond my expectations. Always top quality.\nThe people who work here they provide excellent customer service and shout out to my sweet Rafaela ❤️  Tellys Taverna never disappoints.\n\nGo here if you want to try REAL AUTHENTIC Greek food 🧿 I luv this place !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbnJfVVhnEAE",
            "text": "Delicious! Tellys is one of my favorite greek restaurants in Astoria. Their food is remarkable. Highly recommend!!"
        },
        {
            "date": "6달 전",
            "language": "el",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaHQtTHJBRRAB",
            "text": "Ήρθαμε για Πάσχα στην Αστόρια από την Ελλάδα 🇬🇷 το μαγαζί είχε άριστο σέρβις και το φαγητό ήταν πολύ νόστιμο! Περάσαμε πολύ ωραία και νιώσαμε ευπρόσδεκτοι! Οπωσδήποτε να το επισκεφτείτε!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbk9IUnRRRRAB",
            "text": "I had a lovely lunch at Telly's! It was genuinely the best feta, olives, and keftedes I've ever had. The employees were very kind and I thoroughly enjoyed my time there. Thank you Maria and friends! :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdjVqTWNBEAE",
            "text": "Very busy, as expected because of Easter Sunday.\nThey still managed to find a spot for me. The lamb on the spit was tempting, so I had to stop by.\nVery tasty, staff is very friendly and attentive."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQLXFtbU53EAE",
            "text": "We just had Friendsgiving last night. The service was great. The food was fresh and delicious. The atmosphere was chill and relaxing. I can't wait to come back, but I might have to make a quick stop some time to get the Greek version of their donuts and one of their feta dips just because."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaTVhbTRBRRAB",
            "text": "To be honest, the best Greek food I have had in New York. The beef and sausage was so flavorful and would get a hundred more times. The pita was fresh and delish. Service was good and it was good vibes."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQek1yYnBRRRAB",
            "text": "Came here to celebrate my mothers birthday. Made a reservation the day before, beautiful place, bigger in the inside!  Our waitress was Amenda, she was very accommodating to all of our needs. Food is good. Prices aren’t cheap, service is good, the place was not busy, which was nice. We were able to alert the staff that it was mom’s birthday and they came with a giant sparkler and sang HB!  As with most Greek cuisine, they give you complimentary Greek donuts as a dessert :)\n\nNot shown is the grilled octopus and fried calamari, rib eye steak, moussaka and bread.  Nice place to go for the family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGN19tbkdBEAE",
            "text": "The food here is extremely fresh and extremely well prepared. We only had the Greek salad, fried calamari and grilled octopus for lunch and the food was delicious. The food in my opinion is even better than Kyclades which has been my favorite Greek restaurant for a long time but I have to say this place might be a little bit better..."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OE0zdmtBRRAB",
            "text": "Really delicious food. Recommend getting the meat combo platter and seafood platter for a group of people !!! The spicy feta dip and tzatziki was my favorite"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsOUxlUVFREAE",
            "text": "Always a fun meal at Tellys . We usually have a large group and order everything we love. We mixed fish and meats this visit. It’s also great to be treated with kindness. Thank you all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkeFBubVRREAE",
            "text": "Ordered the lamb kabob, seafood platter, lemon potatoes m, Everything was done very well. Wait staff was friendly. They give you fried dough at the end. The dining area is a little cramped, but the food is fresh. A great place for a special meal."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhcFlHWDlBRRAB",
            "text": "Found out about this place on Instagram, went during the New York food week but it doesn’t serve the $21 menu on the weekends (bummer) i didn’t know. Anyways, honestly it’s a paradise for cheese and fish lovers.\nWe had a humus platter, soooo good! They give you a loaf of bread on the side, chewy and good. Pita bread was a little overdone but I won’t complain. We had baked cheese, chicken and fish. The drinks were so good. Not a super extensive menu, but we asked if they can make them stronger and I literally couldn’t tell, they were good.\nThey also have a small store at the entrance if you wanna buy some fish.\nIt’s around $140 for 2 including 2 drinks each.\nI’d definitely recommend the place, nice vibes. Until aug 8 2021 try to go on the weekdays for the NY restraint week menu."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dDgtWlVREAE",
            "text": "Spacious spot for Greek meals. We got the grilled seafood platter for two and the lamb chops. Friendly staff."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdjVtaWJnEAE",
            "text": "This restaurant consistently serves fresh, delicious food that keeps me coming back for more. The cozy and warm atmosphere adds to the overall dining experience, making it a favorite spot of mine."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNDhQR2ZBEAE",
            "text": "We had the BEST birthday dinner! Food was divine and the staff was SO nice and helpful. Octopus and saganaki are must haves, Greek salad is huge (we had the small size) and the unlimited warm bread was heavenly! The house white wine was delicious and affordable. The staff sang happy birthday for us and brought us a sparkler candle, highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcGJTeGh3RRAB",
            "text": "Every bite was amazing. We got the Greek salad, saganaki, fried squid, shrimp scampi and finished off with pudding in philo dough and the best baklava I've ever had! Would recommend and will be back soon. Also the service was very friendly and very attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5aHA2TG9BRRAB",
            "text": "The food was excellent, Greek, the souvlaki were not exactly on a stick but had a very Greek taste. I liked it, similar to in Europe. The prices are higher, which I found surprising, that they call chicken gyros a kebab. I wonder how the Greeks feel about it, as it seems strange to me too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNmJxX3RBRRAB",
            "text": "Absolutely delicious. Best spinach pie I’ve ever had. And free dessert — so good. Would recommend to anyone in Astoria!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZdEpmdjlnRRAB",
            "text": "Telly's Taverna is delicious Greek Style restaurant that serves fresh fish in a cozy atmosphere. The first thing you see from the outside are the chefs grilling fishes and the smell immediately makes you want to order some fresh fish.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxb2RYQlR3EAE",
            "text": "Big fan of the food here. Before my most recent visit it had been about 3 or so years since my previous one yet I remembered so a few dishes very clearly. The food is good and the service is great as well.\n\nI'm not Greek nor did I grow up eating Greek food, so I can't tell you how authentic it is here. But what I can say is that the food is good. For special occasions this is a really great Greek place."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5X3Z5eVZBEAE",
            "text": "From the decor to the service to the food, this place blew me away. My boyfriend and I went out for date night and wanted to try this place for a while as we always see it’s bustling. The ambiance and the decor was great. The food was delicious. Our waitress down to the busboy were sooo sweet. Some cute things to point out, we got seated in the private room in the back with the cutest decor ever! Side note, the roof retracts in the nicer months and cannot wait to come back and sit back there). We immediately got warm, fresh bread that is made on the premises. We also got a bucket of ice when we ordered another side which we laughed at because it was so cute and it was our first time we got an ice bucket on the side of another drink. Also, they have complimentary friend bread with honey at the end for dessert."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdC1tVGt3RRAB",
            "text": "Typical Greek restaurant in Astoria.\nLarge selection of salads, fish and traditional Greek dishes.  We especially loved the grilled fish and of course the ouzo.  The price is very fair."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEN1lTczJnRRAB",
            "text": "Est. 1990\n\nLayout/atmosphere\n*Grill & display case with the fish next to entrance, then the bar area before the main dining room (skylight in back); nautical theme; wooden chairs with wicker seats; covered area with tables on sidewalk; covered outdoor dining structure in the street\n\nService\n*Good\n\nFood/drink\n*Greek olive oil bottle on every table\n*Complimentary bread - came out warm\n*Tzatziki (yogurt, cucumber & dill) with pita bread - very good; creamy, the cucumber & dill were fresh\n*Swordfish kebab (with vegetables) - good; little extra char on the fish but the meat was tender"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLOTc2Zm93RRAB",
            "text": "Good food and service. Very generous with their portion sizes. They even gave us complimentary loaf of bread before dinner and dessert after dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobE1LNGxRRRAB",
            "text": "We visited Telly's taverna at Astoria and had a great experience. The atmosphere was authentic, and delicious food with generous portions. The service was excellent and the wait staff were really friendly and patient. Prices are more than reasonable! The appetizers were on point - Greek Salad, chiziki, hummus & warm bread.\n\nOverall, we had an excellent dining experience and would highly recommend this Greek taverna to anyone looking for authentic Greek food"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLaC1xM3V3RRAB",
            "text": "Hey , I’m a fan of of Telly’s taverns for more than 25 years since this place was a small restaurant with only a few tables.  No Doug is my favorite restaurant of all time, this time I order the octopus and the grill red snapper (fist)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdUkyTTVBRRAB",
            "text": "Still hands down one of the best Mediterranean restaurants in NYC…our server Metaxia was exceptional; kind, knowledgeable and gracious. The entire staff is! Will continue to visit here and location in Portchester (Westchester county)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLZ3A2emdRRRAB",
            "text": "We came in at 12:30 on a Tuesday and were the patrons there and dined outside. They came out with some fresh bread. I ordered the Moshari Kokkinisto Lunch special for $16. The portions were sizable and the stew was cooked to…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBZ09xUXhBRRAB",
            "text": "This restaurant is an absolute gem! The fish dishes are incredibly fresh and bursting with flavor—some of the best I've ever had. The staff are warm, friendly, and go out of their way to make you feel at home. The atmosphere is lively yet cozy, perfect for any occasion. We celebrated a birthday here, and it was truly unforgettable. Highly recommend for delicious food, great service, and a fantastic vibe!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHa0xIeDFnRRAB",
            "text": "Food was delicious and had great service! What else could you ask for. Place itself was clean and staff were very professional. Would definitely recommend friends and family."
        }
    ],
    "reviews_count": 76
}