{
    "name": "Blend Astoria",
    "place_id": "ChIJ0Z40cT9fwokR8aKrtGOLG0Y",
    "grid": "QN1",
    "address": "37-17 30th Ave., Astoria, NY 11103, USA",
    "rating": 4.2,
    "user_ratings_total": 2177,
    "phone_number": "(718) 606-6383",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaFozQklkWEU1UzJoYVRVSkpWbEV4VjFSbE5WRRAB",
            "text": "Great food and drinks. But the service from Savanna really made it an experience. Will definitely go back just for that"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xT01EWlBWRFI2ZDFRM1J6aDZSMnRYYm1aNVNsRRAB",
            "text": "Beautiful location, and staff is fenomenal! Thanx Savannah for hosting our party upstairs last nite! U.u all were very very accommodating and kind, and the whole atmosfere and vibe were astral!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveWIyeGpORE13YjFKQlZ6RXlWek5aT1VwSFZYYxAB",
            "text": "Good food and nice atmosphere, but the overall service could improve.\nThe food at Blend Astoria was really good, and the place itself has a warm, family-friendly vibe. However, the service — from the moment we arrived at the entrance to the table experience — could use some improvement.\n\nAt first, we weren’t allowed to sit until our whole group was there, which is understandable, but once everyone arrived, the food still took quite a while to be served, even after waiting for two more guests. The staff wasn’t rude, but overall their attitude felt a bit too serious and not as welcoming as expected.\n\nIt was still a good experience overall — tasty food, pleasant ambiance, but the service could definitely be smoother and more attentive from start to finish.\n\n⭐️ Food: 4/5\n⭐️ Service: 3/5\n⭐️ Ambiance: 4/5"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMk1VRktiRWg2TnkwME9WQkVVV1JRV2taNU1HYxAB",
            "text": "Everytime I come Adriana the bartender is the best even if she’s busy, She’s makes sure to acknowledge me . One of the best in the business. Thank you guys for the hospitality"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taT2QyMU5jelV6ZVVKdGRIWTJhMlY2TmxsbFZXYxAB",
            "text": "Food . Drinks  very delicious. waitress friendly\nperson"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdVdqQndYMGRJTXkxRllYQm9UbVZOYkZKMVpGRRAB",
            "text": "Took a 2 hour drive just to come to the famous blend and let me tell you my experience was a 10/10! My server Leidy was very attentive and cheerful! Highly recommend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQ2NqWk1jSHBmVlRoMVF6bEtiMnhaVmt4ek5XYxAB",
            "text": "Blend is 10/10 the food the service and most of all the drinks."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMFNtWldURTFKYURKemVEazJTbkoyTUVoUFoyYxAB",
            "text": "Leidy was a great server and took very good care of us. We come from NJ and we make sure to come here for the drinks!!! The arepas are also our fav!!!"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVGEzUkhVa1p2UVRKak1WYzFhbVEzZW1oaU5XYxAB",
            "text": "Nuestra experiencia fue muy excelente nos atendió Leidy y la verdad todo muy bueno quedamos muy contentos el servicio excelente 100% recomendado"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKemRIbFBjbkJHV1d0bFZUazVUbGx4ZWpGRVQxRRAB",
            "text": "Had an amazing experience with my family for brunch and our server leidy made it a more pleasant experience a great waitress."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNWFreFJiRUpMYWt0UVRWcEtVRTVEYVVOMmVtYxAB",
            "text": "Fue una buena experiencia la comida estuvo espectacular, un excelente servicio.\nLa atención de leídy fue muy acogedora. Muy recomendable"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaGJYWkVhRlV6VXpCeGFHeENOSE5uVkhwVlMzYxAB",
            "text": "Fue una experiencia muy bonita\nLa comida deliciosa y la atención me pareció muy agradable, Leidy fue una mesera muy atenta."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pObk1VOVZkbGxvTmpkT1kxaElkMkpUZDBocWMyYxAB",
            "text": "Amazing prices, great food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaME4wNHlhelJvWlRsR1drZHdabkJqWVVoc1VXYxAB",
            "text": "Great dinner spot !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbU5FaGlXVEZvWDFOalNFZGlibVJwVWtONVEzYxAB",
            "text": "Such a vibe"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taa1FqQnFSblYzYVhwVE0wWjZjVU5FVlhCaWMyYxAB",
            "text": "Nice place to visit the server was great and the food 👌 excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kbk5HSnpUbUpDZUMxMWJHZGhObkV3UkU5QlIxRRAB",
            "text": "9.5/10 the fries were mid till I put the garlic sauce on em\n\nSteak and cheese sandwich was a 10/10\n\nThe chicken marching was 10/10\n\nFries were not it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNFJrVkNMVlZaVDJWTE1WcExTek5IYWxKU0xWRRAB",
            "text": "Savannah and the blend crew are the best, they always take care of me, treat me like family, the best bartenders, Adriana and Alexis always make great drinks, also jade is a really great hostess, the best spot for parties and family. Im always here for the vibes lol"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aWMyNVhXVkJQYkRORGJ6UmZVRVozV1RJMFVIYxAB",
            "text": "Juanita was the best bartender. Drinks were great and service was spectacular!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWVNHSnJOMlpTY21vMVltNDFaVEU0YzBwbmRYYxAB",
            "text": "The food was good, loved the appetizers. The sangrita drink was so amazing, only need 2. I will visit again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMFNrUjZkSEpzVnpCdlh6ZG5kazE2YlZweGIyYxAB",
            "text": "I had such a wonderful experience at Blend! The food was absolutely amazing — every dish was bursting with flavor and beautifully prepared. What really made the experience extra special was the incredible service. Savannah went above and beyond to make sure everything was perfect for us, and her warm, attentive care truly elevated our dining experience. Savannah gave many food recommendations and made sure the kitchen accommodated all of our requests.\n\nI highly recommend Blend Astoria if you’re looking for delicious food, a lively atmosphere, and outstanding service. I’ll definitely be coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScmMxSmpjMDVNYVZBdFozbGZlR2RUV1c0NVFrRRAB",
            "text": "I had an amazing experience dining here thanks to Savannah! From the moment we were seated, she made us feel welcome and taken care of. Her attentiveness, warm personality, and knowledge of the menu really stood out. Every recommendation she gave was spot-on, and she managed to balance professionalism with a genuine friendliness that made the evening even more enjoyable.\n\nService like hers elevates the whole dining experience. You can tell she truly cares about her guests and takes pride in what she does. I’ll definitely be coming back and recommending this place to friends thanks to the outstanding service she provided!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNk5HcDRWWG80YVVwcGRFMDBVbGhzZDJWRlpWRRAB",
            "text": "Been coming here for years, love the food and the service. Savannah is my favorite!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZM1J6QmtVM1YzVTNWQ2JreDZhRUpXWkU0dFNVRRAB",
            "text": "The best Latin food in Astoria hands down! Savannah is the best she always makes sure her guests feel welcomed and taken care of. Amazing food & amazing service always"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWGJXZFpSM1V3TW5SM2VFSjZjV1JqYTBGZlJYYxAB",
            "text": "An 18% tip is already included and then they show you another screen to tip twice if you are not paying attention so be wary of that. It’s not good business practice. Small portions, we were still hungry after and needed to find something else to eat. We had the churrasco and pernil. The churrasco was good. Pernil just tasted sour from lime already put in, I’ve had good pernil (for less) so it was a little underwhelming."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaWRLR0J3EAE",
            "text": "Tried twice. Late order, small portion"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNFRUUkJSMUk1Ymt4aU9YaFNiMDA1UlRsS04yYxAB",
            "text": "Food was so good, and so were the drinks and service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRGJURllXRWRFWkdkRlZIaDFkbmhwZUZwbWEwRRAB",
            "text": "Grabriella is cool and the service was good! Make sure to get the steak."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paT1JERXRjWFkzYTB4bVprcGxkMGh2VFMxVU4wRRAB",
            "text": "Excellent service. Gabriella was very professional and kept checking in. Plus the music is a vibe. Highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201eFMyNW1WMkk0UTFoMk4zZDVTbEJ1V2tGUExWRRAB",
            "text": "Had brunch, Gabriella is the coolest server. Food was great and we had a good time!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWVIwWlhSSEExUlhSc1EyUlFTWFJvYTFSTFlVRRAB",
            "text": "If you’re a masochist and enjoy the poor service from wait staff and hostile attitudes (Tips are included in the check) You’ll enjoy a full five star experience. The atmosphere and food are amazing (especially Blend on the Water location) but the poor service in Astoria cause my guest and I to lose our patience and appetite while welcoming new comers to the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQlpraEVOMk41Y0VGSU5YaGlMVFZxT0RreFYxRRAB",
            "text": "I loved it. I went out to eat with my Daughter, for her Birthday. Great food, drinks and service. The atmosphere was nice too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veVkxRjRlR2xTVUZwTFFsQkJabXRaWWpkUFVYYxAB",
            "text": "The happy hour was soo much fun. Wonderful food and drink options. The Thai Shrimp Tacos is a MUST HAVE, the lemon drop was delicious.  Our bartender was EXCELLENT!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOb1dscEViWEZwV25GaU5WVmplRzVZYzNveldWRRAB",
            "text": "Do not go to blend Astoria!!!!\nThis was by far the worst experience I have had at a restaurant. The service was extremely slow and there were just two tables one two top and us( we were a 4 top with 2 kids). We ordered the empanada sampler which was good. We also ordered a churrasco. We specifically told the waitress that we wanted it medium rare and received a well done steak that was under seasoned and drenched in chimichurri sauce that added nothing to the dish. We also ordered two burgers for our kids and I made sure to tell the server to bring it plain with just Cheese. When the burgers arrived they had everything on them including a disgusting sauce that was impossible to scrape off. When the bus boy brought out the food the server never came to check on us to see if everything came out ok so that I could tell her that the burger came out wrong and the steak was overcooked and we were all starving. When she finally came to check on us we were basically almost done but my son did not want to eat his burger because the sauce was so disgusting. She asked if we wanted them to fix it but at that point we no longer wanted to wait for them to make it all over again so she said she would take one of the burgers off the Check. She claimed she didn’t hear me tell her that we wanted it plain. Maybe she would have heard me if she didn’t have an AirPod in her ear. After that she walked away and we were waiting so long for the check I had to tell the girl collecting our plates to ask her to bring us the check. Then when the check came she wouldn’t let us see what the charges were for every item we ordered and they automatically charged an 18% gratuity which is why the servers don’t work hard to try and earn their tip. This was unacceptable experience since the restaurant was literally empty."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNWJXNU1NVkpLT1dndGQyODBNUzFvY1VORk9HYxAB",
            "text": "I was very disappointed with my visit. We had to wait far too long for our food, even though the restaurant was almost empty, which made the delay very frustrating. When the food finally arrived, the chicken had a strange taste and was not enjoyable at all. The quality did not match the price, and the overall experience felt careless. Unfortunately, this visit left a bad impression, and I would not recommend this place to others"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGb2F6TlpNRTFCTlZwdVkxWjZjMVZJTXpka2NFRRAB",
            "text": "The food was slam dunk amazing! The portions were perfect! The service from the host to our server Salima was absolutely excellent and the drinks were delicious as well! Highly recommend! GREAT JOB BLEND ASTORIA !!! ⭐️ ⭐️ ⭐️ ⭐️ ⭐️"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poYVNtdFBXRlZTZHpBeVF5MWhXRWxDWDJGck1IYxAB",
            "text": "Todo\nRico\nComo una carne pero\nEs muy poquita pero\nRica"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaGFGaHdOVUZsWjJscVJUQlVZbTVWYXpObVNsRRAB",
            "text": "Adriana made one of the best Old Fashioneds I’ve ever had—perfectly balanced and smooth! She also created such a warm and welcoming atmosphere that truly elevated the entire dinner experience. Her attention to detail and friendly vibe made the night feel special. Highly recommend asking for Adriana if you want top-notch service and cocktails done right!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJNE8zRDlnRRAB",
            "text": "Always a great stop... good food, good drinks, and great staff. If you're in the area come in for an amazing drink and chill vibe. I stop here everytime I'm in town!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOck9UaFlYMnAzUmxBdFdrc3lVVEUzUkVoUlZrRRAB",
            "text": "Juanita was sooooo great. Very attentive and knowledgeable of the menu. Will definitely come back."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTFRYRm5hbmhoVjI1U2Iwd3hhVVZJUzNGMFZGRRAB",
            "text": "Muy buen lugar me atendió leídy y me pareció una persona bn agradable y el servicio en general fue excelente 💪🏾…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veVVFY3lNSEp4UVU4eVZFTnlabTVUWjFWamNrRRAB",
            "text": "Don’t even waist your time coming here the food it’s mid they don’t got variety I had over 10 people over since it was my bday and they told me I had to be waiting standing until the 10 people would come, bad costumer service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bWMxZHhabU5xZVhSS1ZHaHViM1pVY1cxR1UwRRAB",
            "text": "Came to blend at 10pm and asked if the kitchen and restaurant was open and was told it was. Service felt as if they didn’t want us there right from the start. When our main course came through was sitting there with no food as I watched my guest eat without me. I asked where it was and understanding mistakes can happen but there were no apologies or care. The food took forever but it came and right when I started eating they turned the lights up. I stated I was disappointed with my experience and questioned why bother sitting me if you were going to try and kick me out, I’d much rather go somewhere else if that’s the case. Server said there was no boss or management present to talk to and offered to cut her auto gratuity off the check. Which I’m not a fan of I would rather have the workers get paid and have the restaurant remove my extremely delayed item. This experience was had with only 1 other table in the restaurant as well. Don’t come here, they missed the mark what hospitality is, extremely embarrassing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZM1MwdzNha2xpWTNNMlRtSlZXaTFKTFhvNVJsRRAB",
            "text": "10/10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ2htSktodGZ2bUhBEAE",
            "text": "2 ppl dinner, charged me a tip of 4 ppl smdh.. Happy hr was 6 and charged me 9 per drink.. What's going on here.. I'm with a first date, who wants to complain, I just want to be treated fair!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOSGYyNWFxN3ZtQTBnRRAB",
            "text": "Excellent service from our server Juanita."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJX3Q2LVN3LTVYZm13RRAB",
            "text": "Save yourself the trouble and go anywhere else in Astoria but blend you won’t regret it …….\n\nThe only reason I’m giving 2 stars is because of the server I had last night she was kind, and so was the rest of the staff. Other than that, this place is extremely overrated.\n\nWe ordered the Bulldog Margarita, which came out quickly and tasted great. While sipping our drinks, the ceviche appetizer arrived—it was just okay. Definitely needed salt. It wasn’t the worst I’ve had, but it was bland and clearly underseasoned.\n\nWhat really bothered me was that just 7 minutes into eating our appetizer, our main dishes were brought out. I still had food in my mouth when they started clearing the table to make room. It felt rushed and inconsiderate.\n\nI ordered the churrasco, which was just okay. My husband had the chicken, which was so bad it had to be refunded.\n\nYOU GUYS NEED TO DO SOMETHING ABOUT THAT DAMN CHICKEn !!!!!!!!!! ITS NOT GOOD (I used to order you guys for lunch and order the chicken sometimes and it was always dry and not edible mind you this was back in 2018 and this chicken still this nasty )\n\nAlso, the music was ridiculously loud—felt more like a club than a restaurant. Yea I know  they have restaurants that play really\nLoud music I get it but blend plays music like your in a club at 8pm and\nYour just trying to get dinner.they need to bring it down a notch not to much but just a little.\n\nEvery time I come to Blend Astoria, it’s a different experience—and not in a good way. Either the service is too slow and the food is bad, or the service is too fast and the food is still bad . Last time I had the sangria pitcher and  YUK ! Very watery and just not it was a waste of money .\n\nI’ve been coming here for years, hoping for improvement, but last night was my last time. Until something changes, I won’t be returning."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLaTdxZnlBNGZITEdnEAE",
            "text": "Came here with a few friends. Food and drinks were delicious, and the service was great. Would come again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNakFvNnpab29fOGFREAE",
            "text": "Pre fix menu for mother's day. I was hoping for the full menu."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNWEs0Y1dIMmZXZml3RRAB",
            "text": "Food was great, the ambiance was a bit too loud! But I would revisit!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcTlESXd3RRAB",
            "text": "I’ll start with the pros before the cons.. The food was definitely worth the 1 hour and 10 minute wait, big portion and great drinks! Beautiful presentation. However! I did not enjoy waiting over an hour for my appetizers. It was fairly busy for a Saturday early brunch however no excuse really, you should be prepared for a rush. They did please us with allowing us to order a dinner item during brunch, that was super nice. We were a walk in which was a bonus to be seated so quickly. But I didn’t appreciate our server dodging us as time progressed of us waiting, a simple “I’m sorry your food is taking longer than expected” would’ve sufficed for our frustration. We did get a round on the house to make up for it but I think our appetizer should’ve been comped as well but I’ll say I appreciated that too. I’m just disappointed in the wait time and lack of service. I’ll gladly apply here if you need the help.."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOXNLYnp3RRAB",
            "text": "We went there for the dinner. The food and environment were really good. We have enjoyed it but from the service points it was not that standard. Server was not paying good attention to us. However, besides the service points it was good we enjoyed it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdmVpWTN3RRAB",
            "text": "It's not a place I'd come back. For a weekday, there were about 6 tables( two 2people each) sitting and the waitress took a while to initially come and take our order. The first drink that came out the lemon still had the sticker on it. The calamari would have tasted fine but the oil that they cooked it in definitely needed to be changed days ago. When our entrees came out not impressed at all. They were a bit dry and lacking flavor. When paying for the bill just be careful. Was just handed the machine without showing the itemized receipt and the tip was already added, I tapped my card and another screen showed that said add tip, they never said that's above the 20 percent...so just take a look at what's your paying for."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOWZXaWZBEAE",
            "text": "\"I had the pleasure of dining at this fantastic Latin restaurant, and it truly exceeded my expectations! The atmosphere was vibrant and energetic, with lively music and colorful decor that transported me to the streets of Havana.\n\nBut the real highlight was the food - oh, the food! I ordered the Cuban sandwich, and it was absolute perfection. The ham, roasted pork, Swiss cheese, pickles, and mustard all came together in perfect harmony, pressed between crispy bread that added just the right amount of crunch.\n\nAnd the yellow rice with chicken? Wow! The flavors were incredibly rich and savory, with tender chunks of chicken cooked to perfection and infused with just the right amount of spice. It was the perfect complement to the Cuban sandwich.\n\nThe service was also top-notch - our server was friendly, attentive, and knowledgeable about the menu. Overall, I was thoroughly impressed with this Latin restaurant and would highly recommend it to anyone looking for a delicious and authentic Latin dining experience. Five stars, hands down!\""
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUeE52M0xnEAE",
            "text": "When I say Blends was a vibe. It truly was an amazing experience. My brother discovered it while searching for a fantastic spot for us to dine. Upon arrival, we immediately began taking photos because the venue features specific areas designed for photography. It had an intriguing design and atmosphere, reminiscent of a club. The food was incredibly enticing on our first visit, and I promise, it did not disappoint. This place was absolutely delectable. I would definitely return for a gathering with friends or a birthday celebration. It was really great!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3c0kyWU5BEAE",
            "text": "First time here and I left very pleased. The drinks was awesome. The fried rice was tasty and nice portion and it was full of seafood. The salmon was tasty as well as the calamari. The service was A+. Will definitely visit again!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQOWRuYnFnRRAB",
            "text": "Valeria served us and she was so attentive, kind, sweet and GORGEOUS yet humble 🩷. The food was delicious, as were the drinks. I got the classic tres golpes and my husband got the churrasco.\n\nUnfortunately we got there too early and the frozen drink machines were still in the process of freezing the drinks so the frose (me) and the margarita (husband) were more slush than frozen but they were still delightful. We had the chocolate lava cake for dessert, which was decadent.\n\nThe restaurant is beautiful inside too. Overall, 10/10 recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMMnRqTzZ3RRAB",
            "text": "The steak is delicious! 😋  They have Rose 🍷  as a daiquiri.   My husband and friend love them.  So refreshing on a hot day.  Service is great, and they don't rush you out.  18% Gratuity is included in your bill, any party size."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveVkzeXdBRRAB",
            "text": "I recently had the pleasure of dining at Blend Astoria, a fantastic Latin fusion restaurant that truly exceeded my expectations! From the moment I walked in, the vibrant atmosphere and warm decor set the perfect tone for a delightful experience.\n\nThe menu is a beautiful blend of traditional Latin flavors with innovative twists. I started with the empanadas, which were perfectly crispy and bursting with flavor. For my main course, I opted for the cilantro-lime grilled chicken, and it was cooked to perfection—juicy, tender, and wonderfully seasoned. Each bite transported me to the tropic.\n\nBut what made the evening truly special was our server, Lorena, From the start, She was incredibly attentive, knowledgeable, and genuinely enthusiastic about the menu. She offered great recommendations and shared stories about the dishes, which added a personal touch to our dining experience. It was clear that she was passionate about providing excellent service and ensuring we had everything we needed to enjoy our meal.\n\nIf you're looking for a place that combines delicious food with outstanding service, look no further than Blend. I can’t wait to return and explore more of their amazing offerings! They had also great drinks specials."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMXJEVV9BRRAB",
            "text": "When I say Blends was a vybe.....it definitely was an awesome vybe. My brother stumbled upon it after searching for a an awesome spot we could dine into. After getting there, we immediately started to take pictures because it has places and spots that are designated for photography, it had a very interesting design and ambiance to it, almost like a club. The food was really enticing for our first try, I kid you not. This place was delectable. Wasn't disappointed at all, 10/10. Would definitely find myself back here for a get together with friends or a birthday event. It was Really great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdGJQcFRBEAE",
            "text": "During my trip to nyc I stopped by Blend for food before my flight. When we arrived the staff was very kind and allowed us to store our luggage away while eating. The mojitos were really good I ordered the mango. My friend got the lychee but didn’t like that it had shredded lychee in the drink. We came during happy hour so the drinks were pretty affordable. I ordered chicken quesadilla and was very disappointed with how it tasted. There were a lot of black beans on it and not enough cheese or flavor. The chicken was dry so I tried to add some salsa but it didn’t help. The rice that was with it was soggy and tasted like cardboard. However, the cheesecake was the star of the show.  Also, throughout our dining we had to let our waitress know that we needed more water. In my opinion that is unacceptable because as a server you should be paying attention and tending to your guests. Other than that the service was pretty good. Not sure if I would be back or recommend to others because the food wasn’t all that great."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NDZ5bGtnRRAB",
            "text": "What an nice experience eating here. The decor is mortem and nice. Outside dining is also a nice addition for those who want to eat outside. They do have heaters in certain sections for outside dining. The staff very friendly and attentive. Frozen drinks are nice and tasty and well balanced. The food is presented very nicely and fresh outta the kitchen hot and tasty. Overall I highly recommend this place for food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvblkyRVlBEAE",
            "text": "We had a great time at Blend Astoria. Good food, good drinks, reasonable prices. Lorena was very nice. We will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUZ0xETWt3RRAB",
            "text": "Great Food, service and atmosphere. The churrasco is amazing! Definitely a must order if you come here. Their mojitos and Margaritas are also delicious."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeTR6dW5nRRAB",
            "text": "Muy buen ambiente y una excelente atención, fueron características principales en nuestra visita a blend, un menú variado, con sabores latinos pero servidos a su manera destacan los sabores de este restaurant. Sin duda que recomendado!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdFBDZXF3RRAB",
            "text": "This happens to be my favorite place, I always come here & I also have done big gathering as well the accommodation they do is amazing they go above and beyond. The staff here are all super dope. I also enjoy the atmosphere cause it’s perfect not too loud but enough to enjoy the music and conversation within the tables. My forever go to server is Savanna she is absolutely amazing I always ask for her services she is always so sweet and humble overall I always tell people to come check it out they will not be disappointed I do recommend reservations but even if your a walk in it’s still great😉😉\nA+++++"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX2F5ZktREAE",
            "text": "This place was real nice. I had the Tilapia with spinach yellow rice and plantains which was fire🔥really good. The desserts were good too. The atmosphere and staff were very nice. Perfect place for a date night. I loved the music♥️🎵It was a mixture not the same genre. Nice bar too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdHQyWDlBRRAB",
            "text": "Quickly seated on sunday brunch, no wait at all. Decor was very cute and picture worthy. For appetizer, the yuca cups were it!! Entrees we got were pollo a la plancha and pernil. definitely recommend the pollo a la plancha. Overall,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbnEtbURBEAE",
            "text": "we had reservations for 745 and did not get seated till 8:20. The place is very busy, we were seated in the upper lounge area, and we ordered our food. The froze was good, the taquitos was amazing definitely made me say wow really enjoyed it while eating the waitress came to the table to and ask if we can move to another table to accommodate and other large party while we was in the middle of eating, was a bit frustrated but ok, I've been to alot of different restaurants it happends I get it. but other restaurants offer you free drinks or dessert for the inconvenience none was giving. It's not a deal breaker. Main course the rice and black beans was good the is steak was \"ok\" perfect salt and pepper the meat was very tuff and it was not how I ask for it it was on the bloody side. this place is good. It wasn't a really bad experience. The taquitos and drinks were amazing. If you go there, you must try the taquitos. I will return but not at the weekend. I think the experience will be better on the weekdays. Hopefully, it's less busy,"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfejRhX3JnRRAB",
            "text": "If you are looking for a place to hang out and enjoy a great time with your girls or your friends , this is definitely the place for you girlies . Food is delicious, we got the pizzas , Lomo Saltado, tres leches and everything was on point!. The attention was 10/10 Leidy was the best , she gave us good recommendations and answer all our questions ! . The drinks were so good . I’ve order dirty martinis from other luxury places and the one from this place hits . All my compliments for the bar 🩷. Everything was great !\nAlso if you like to take cute pics this is the place for you !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNzZyOE53EAE",
            "text": "The environment seemed pretty dope. Me and my party were able to be seated right away. The drinks were tasty, definitely had a good amount of alcohol. Didn’t have any entrees but the empanadas were good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLcWNDR3hBRRAB",
            "text": "Just wow. 5 start servers, fantastic drinks, even the skinny ones, the best empenadas ever, desert was fire, the two chicken dishes were impeccable. The indoor ambiance was trendy, backyard looked like Miami, and outdoor was endless…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMckkycVRBEAE",
            "text": "Savannah was an amazing server who treated us with kindness & respect. The tacos and drinks came out super quick and she had such a positive energy! I would 100% recommend blend Astoria, it will definitely be worth your wait or make a reservation!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycFpuTW1nRRAB",
            "text": "Had a marvelous lunch on a Thursday afternoon. The bartender Juanita was so sweet and hospitable. Her margarita was delicious and strong, the perfect combination. One of my favorite places to eat!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcHBlYldREAE",
            "text": "This has got to be one of my new favorite restaurants. They’ve got a large food variety and they have some of the most delicious dishes I’ve ever tasted. I also love that they have vegan options. Drinks are good too! From two different visits, staff isn’t bad, but not great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeEozMlp3EAE",
            "text": "I recently had the pleasure of dining at Blend Astoria and I can't say enough good things about my experience. Our server, Lady, was an absolute delight - friendly, attentive, and knowledgeable about the menu.\n\nThe food at Blend Astoria was simply delicious. We tried the tacos de lolo asado and they were out of this world. The flavors were perfectly balanced and the meat was cooked to perfection. I also have to mention the desserts - they were incredible. The perfect way to end a fantastic meal.\n\nOverall, I highly recommend Blend Astoria for a date night or girl's night out. The service was amazing, the food was delicious, and the atmosphere was just right. I will definitely be returning in the future."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndHZQa1hnEAE",
            "text": "Excelente servicio!\nLaidy y Dayana son las mejores meseras del lugar , su atención y servicio es extremadamente excepcional, la comida es deliciosa, y las margaritas que tomamos muy ricas. Un lugar 100% recomendado para ir en familia, parejas o amigos. Todo nos ha encantado!."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBckxqQVBBEAE",
            "text": "Everything was great and our waitress Savananah she was just fantastic. The tacos & drinks\nwere good especially the lomo salteado.Savannah thank you for everything especially your recommendations"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcksyVDdnRRAB",
            "text": "We LOVE going here. As an Astoria native, this is the neighborhood spot. Our server Savannah is the absolute BEST- she is on top of everything. She remembers everyone’s drink orders and anticipates when we need more food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwaTRLTzNRRRAB",
            "text": "Located at a very busy street at the heart of astoria this place has limited parking.\n\nHappy hour, they have happy hour specials every day. As well as brunch. They do not have boozy brunch which is a bummer cause their food is good.\n\nThe service is very good, we sat at the bar and our bartender was pretty quick to tend to us and super friendly.\n\nNeedless to say that the place has great decor and it is a very well designed space, they even have an upstairs and back garden.\n\nPOKE TACO-  somewhat a healthy option since is the nice sushi tuna, they were 3 little tacos, the tacos tasted pretty good, but I was not very pleased with the fact that the tortilla was hard shell and those are generally fried, so it kind of defeated the purpose of a quest for a healthy snack. so I would not order it again when looking to eat clean.\n\nCAMARONES AL DIABLO-  it's like a popcorn fried shrimp with a very spicy chipotle sauce yet pretty amazing, this was one of our favorite appetizers as far as flavor, but again fried. so not the healthiest choice.\n\nTRUFFLE FLATBREAD- omg this is the best flatbread I have ever had.OBVIOUSLY carbs and not the healthiest of the choices and we were aware, but the size was just right for 2, as well as the fact that it tasted so good, I am definitely a fan!\n\nOver all we were ok and somewhat impressed with the food. The service  was very good as well as the sitting outside option. I will probably be coming back for more happy hours."
        }
    ],
    "reviews_count": 80
}