{
    "name": "Bahari Estiatorio",
    "place_id": "ChIJcy1LrTBfwokR5zUyDZqHSKM",
    "grid": "QN1",
    "address": "31-14 Broadway, Astoria, NY 11106, USA",
    "rating": 4.5,
    "user_ratings_total": 1707,
    "phone_number": "(718) 204-8968",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSVRFNWtWamh3VG5sRU1GZFNkRFpVYlZOcFRuYxAB",
            "text": "Each bite tasted freshly prepared while each interaction felt sincerely friendly. Bahari Estiatorio! You made me want to return. The flavors were bold yet harmonious. The service team performed wonderfully. The restaurant shows attention to craft."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtb2VtRjBRRRAB",
            "text": "Excellent food.  Excellent service. I have been there for many years, and the food is amazing ."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMFVsVTRiR05STTBKcmIyOUZhblp3WjA0MVEzYxAB",
            "text": "Local gem - attended for a date night. We shared a whole Dorado fish and a salad. Highly recommend the seafood"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJd2FsUXlVamt3UzFWcVRIazBOREJqVVZoTFgzYxAB",
            "text": "I love this place. The food is authentic and great, the service is Greek Friendly, and the atmosphere is relaxed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReU1tcHJiMnBFUm0xNWFqRkpNVmhuWlVSeWRHYxAB",
            "text": "This place is exceptional- the service, the food, and have to say the service again. Amazing!! Welcoming and attentive, and the food was out of this world. Can’t recommend more highly!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Tk1ubHhWMk5ETjBsUlNIUlVXR2xWWjBKR1JrRRAB",
            "text": "Always great comfort food.\nFresh fish nice staff and very fast ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRFREQXdaMWMzYUZKMFNUTmFhM1ZqTFdReFJIYxAB",
            "text": "Average greek food. Huge fresh salads."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdE1rWnJNalZOT0c5QllscDZTbXBTUjFkM2VHYxAB",
            "text": "The food was excellent, but I still don’t understand why the server placed the dishes on the table so harshly, with a poker face, as if we had done something wrong"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padVRXaGFORmxDUlUxdmNEa3lSbHBoUkZNelgxRRAB",
            "text": "Great food, little too noisy when it gets busy"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWGJtSjViMU5RV2s1WVVGSkVXakpNUlhGcFIzYxAB",
            "text": "Food was wonderful as always. Our waiter was rude."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOa1UycDROV1J6TVdSUk16UTJjV0pLUnpjek9IYxAB",
            "text": "The lamb was really good — flavorful, tender, and cooked well, just served at room temperature . The appetizer with the different dips was good and so was the house one. If the above had been the whole meal, I’d easily give this place 4 stars. Unfortunately, the chicken was a big letdown. It was bone dry and even a bit burned, which really took away from the overall experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUVJHUjJZbmh1UlY5NVZGTXpaVkZqU25sb1QzYxAB",
            "text": "Delicious food!  Amazing branzino.  Delicious pita"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWmQxZE5kWE4wVEhkTmJUSnRNMDgxZW5KMVJsRRAB",
            "text": "The food was authentic Greek fare and the portions were more than enough.  The prices were average for the city."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWclNUUlRhVFpwUWxCRVl6Uk5ha0UwWlV0ellYYxAB",
            "text": "I'm Astoria New York staple for the past 20 years! Great Greek Food Spot!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aalEyaE1RbWRWV1hKSmNqaFRhVmt3ZUVoNmJHYxAB",
            "text": "Love this cozy and authentic looking place. Great value and if you want to chill and hang or be with people you comfortable or want to get comfortable with. Definitely my type of place. Clean and no frills but great food and values."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oak5rNTZWbmR3Wm1oc1pXbERkMUI0Tm1SYVNGRRAB",
            "text": "The restaurant has plenty of ratings. Workers here offered adequate service. Everything on the menu tastes great! The area is perfect and the staff is considerate. This place offers something special!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtLUpqVHBnRRAB",
            "text": "Love it here! Great food, good prices. Fun time"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSk0wOW1ZMFJuVkZscGJGTkdURUZoZDJSQ2IxRRAB",
            "text": "This is the best Greek restaurant.\nNo frills. Anything off the grill is amazing.\nThe dips and pita are a must"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKT09UVnZVRFUzVHpCdVRtdFdablp3TTFaNVduYxAB",
            "text": "Chill vibes, delicious food, water is constantly refilled by servers. Wonderful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twYVJERjFObG8zVFdOaFdXTm9WR1JEWm5KMVNXYxAB",
            "text": "Mediocre and overpriced."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neWRuSm1OVzlRTVdJM1ZVZzVaMWx4YlRKVGVGRRAB",
            "text": "Muchas mesas para el local, nada bonito, muchísimo ruido y los muebles a la entrada sucios"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbU1HUjRXa1ZzYjNka1JqVm1VRkpVZFhod1dWRRAB",
            "text": "Best Greek food I’ve eaten in New York by far! The owners are also amazing and kind. Highly recommended."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MU5rZEhWREZNWnpkSVdYRTBiemxTYTJSblZsRRAB",
            "text": "Went tonight for the first time and this place is amazing.  We had dinner and the portions were huge. Please share ! We took home three dishes ! Loved the mixed dip  loved the classic dishes!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWT1pWWjZTWFZXWkhBeVMwbFNNbGxtU1hCeldtYxAB",
            "text": "This is a place I always return to. Very nice European vibes with white tablecloth tables and complimentary bread. The char-grilled octopus is the star of the show, and the olive oil is delicious. They also serve a complimentary dessert at the end, so save room in your belly for that!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVVdTMTBVVk5rYkRacloyczRXazV4TTA0MWNtYxAB",
            "text": "Ordered a salad, with added chicken to go. Really enjoyed. Ingredients tasted fresh and portion size was good. Would definitely recommend and will visit again when in New York"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbFlrRmpZV2xtWlU1dE5rMUNVVmt0ZDJScU1FRRAB",
            "text": "good, authentic greek food in queens — the grilled octopus is a must. not a huge wait even for a late lunch on the weekend. the saha ali wasn’t my favorite but everything else hit. simple, homey feel inside. would return with a group to try more seafood."
        },
        {
            "date": "3달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkR1JtVjBVRmhqTmtaQlZVMWxibXBEWHpadk1rRRAB",
            "text": "駅に近く、昼過ぎに行きましたがとても活気がありました。スターターとメインを何か注文するのが無難だと思います。シーフードが多いので是非食べてみてください。日本人ひとりでも大丈夫だと思います。"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMU5ISmtNMDVIUjBWcGNIQmZURlJHU0hWcU5GRRAB",
            "text": "BOMB food !!! super fresh super pricy tho ! the service is good . also they did forget our order a couple of times"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRlRFUnVXVmRXZG1GRlkwdHlPVE5XZDBsNGJVRRAB",
            "text": "First time trying Greek food with family and we loved it! Excellent baby lamb chops, octopus and side dishes. Plus attentive service.I will definitely come back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dlpXOUpRVWwzWlVkblozWmFWbEJqWVZWUE1tYxAB",
            "text": "absolutely lovedddd this spot!\nDiscovered this spot through a tiktok video of a chef being interviewed, they asked him “where do you go eat when you’re home sick?”\n\nHis answer was Bahari. This place did not disappoint! Proportions, price, service and most importantly ~ TASTE!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GR00wWXhXVXBYVVRSYWEzUTBlbWg1UVZKTVJHYxAB",
            "text": "Excellent Greek food, one of the best places for traditional Greek! Service was attentive and friendly!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrdExVTXhPREF5WjBwaU9DMXJSMHRTY1c5MU9HYxAB",
            "text": "AMAZING"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMmFGcFpkRWhXWjBwWlZVbEViRTlzZW1wUlVIYxAB",
            "text": "So the story is that you can’t make everyone happy and let me tell you this I’ve been coming here now for 3 years the food is awesome you want good service then tip the waiters like I do and you’ll get good service you wanna tip cheap you get what you pay for"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncmF5aTNBRRAB",
            "text": "It was a random choice and we did not regret it!! It is a small business, but it is delicious!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bFUyczFUbWhGWWtOWk9XRlFSRzFRY21oRmMyYxAB",
            "text": "Food is great.  Service is friendly.  Can be a bit crowded on Saturday night but worth the wait."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOM2FfNnF5aGRYOTZBRRAB",
            "text": "We visited Bahari last week and were truly impressed. This cozy Greek restaurant in Astoria serves authentic dishes made with fresh ingredients and offers warm hospitality. The grilled octopus and bifteki stood out as highlights, and the inviting atmosphere made it perfect for a family meal. I highly recommend Bahari to anyone who wants a taste of Greek cuisine."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNUFV4N0dtcmZMTGdnRRAB",
            "text": "Everything was absolutely excellent. We got the branzino, grilled shrimp and octopus and a couple other hot and cold mezes/starters and loved every one of them. Service was also great, from the host to the servers, just amazing, everyone was so nice. Can’t wait to be back to try their meat dishes!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZmktTVBqZzV5VGV3EAE",
            "text": "Holy smokes if I ever go to Greece, I will say that Its my 2nd time going, felt like I was in Greece. Me and my Wife stopped in for a late nite dinner, the lead senior waiter was our guy (name started with a T Greek name - sorry I don't want to mispronounce). You really have never tried Calamari until you try their's. 5th dimension stuff, not kidding, will blow your mind 🤯 grilled or fried are the options and we got the grilled. Michelin stars here, perfectly seasoned and cooked, perfectly seasoned and cooked. Period.The rest of the dinner excellent as well"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMakZtYVNEb3RQQkdBEAE",
            "text": "Stubbled upon this place and was pleasantly surprised. The service was stellar and the food was delicious. Can’t wait to go back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJVzJ2ZTI1X2VQcjVnRRAB",
            "text": "Always good food I been there couple of times. I had try fish and meat plates and always was good. Service is always attentive and honest ( difficult to found this at New York). Very reasonable prices. They are very Greek !!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOZTcwTTNTdEszVXp3RRAB",
            "text": "I have been to Bahari several times with my friends since moving to Astoria 6 years ago. Always had great experience…this time it was not. We choose to come cause is close to my house and my mom was tired. The server was rude and had the nerve of doing faces and commenting with no hiding it all of his feelings towards us. Like dude who cares? We did not order much since my parents are old and got a big lunch and he was annoyed we didn’t, like mad annoyed.\n\nAnnoyed that we did not order more, annoyed that we asked the check…never had in a restaurant in the States someone treat me like this for my choices. Even if in 3 we ordered 1 entree and 1 app you don’t discriminate if is not prior disclosed that you have a minimum order to do. And Bahari is not that kind of place.\nI will stick to Aliada, Tellys or Kiklades next time. And has someone that has experience in customer care that server should not be on the floor."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKYl92dEhJajlhSDBnRRAB",
            "text": "Let me start with the food was very good but they waiter was very rude. We asked question and he was showed frustration when asked about the food. I felt he was prejudiced because a couple came in that was from his country and he treated them very well but to us and the table next to us he was extremely unpleasant. It got to a point where my wife stared him down showing her discomfort due to his attitude. I recommend the food but definitely not the services. I would t visit this location just because of the service, we spent our hard earned money to have a pleasant time not to be treated as hurry up eat and go."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOX2l5NW10dW9LcG93RRAB",
            "text": "Best Greek food I’ve ever had. Authentic, kind, and timely service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcUtydWFsN2MzTDRRRRAB",
            "text": "Shockingly delicious. I hadn’t tried much Greek food before in my life, but I ate here and was blown away. The best calamari I’ve ever had in my life. Love the stuffed cabbages, grilled fish, and the spread sampler. Greek food is so amazing ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaG8zQmRnEAE",
            "text": "Went with my cousin. Great service very nice atomsphere. Food was delish.  Would go again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ3JXeGRREAE",
            "text": "The environment was nice, but overall, the experience didn’t live up to the expectations. I was surprised by the big difference between what we received and what others posted in their Google reviews—especially the $28 octopus dish, which came with just three tiny tentacles. I saw photos from other diners showing portions nearly twice the size. I'm not sure if there were other factors involved, but it felt inconsistent.\n\nThe other dishes were a normal size, but the T-bone steak was just okay. Honestly, I think I could’ve gotten a better sear on it myself at home.\n\nAll in all, it wasn’t terrible, but I wouldn’t go back. There are plenty of better options around—that’s just my opinion."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeFpmWHdBRRAB",
            "text": "First time at this Greek restaurant and it was an amazing experience! We started with the grilled octopus and combo dips. Each one was fresh, flavorful, and perfect with the warm pita. The moussaka was rich and comforting and the lamb chops were grilled to perfection tender, juicy, and seasoned just right. Excellent service by our server George and a cozy atmosphere. Can’t wait to come back and recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcUxYRWlnRRAB",
            "text": "Lovely place in the heart of Astoria. The lamb was so tender as falling off the bone and super tasty. The red snapper was delicious as well. Friendly staff and family friendly atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM2VuQVVREAE",
            "text": "Cute Greek fare in the heart of Astoria. Many selections on the menu. We enjoyed meat and vegetarian dishes and the spreads were all very good. Prices were very fair for the amount of food and the quality"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyX0tqX3VBRRAB",
            "text": "Great food. Sone of the most authentic greek food you can get. Got the Red Snapper, Quail, Fried Cod, Leg of Lamb, Calf Liver, Octopus, and Baby Shark. Very good food definitely recommend. Service was good and they gave great recommendations for wine. Definitely a good place for dinner and would come back here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtb1pPS1F3EAE",
            "text": "The food is great. My partner loved their steak. The service could have been better (waiter disappeared a lot. The Bus Boys were amazing. Honestly they did more than the waiter) The hostess was a really nice woman but the waiter to me felt like he didn't want to serve us. The food was exceptional. Had to take everything home after the meal. DO NOT FILL ON BREAD. Trust just get the salad and your meals and you will enjoy. Decor was great and pretty spacious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdFB6RnNBRRAB",
            "text": "Came here with a few Greek friends, which was really helpful, as they knew the menu, and ordered flawlessly. The service was decent - helpful without being intrusive. The octopus, while well seasoned, was a bit overcooked; but the calamari was made well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldjlYbUJ3EAE",
            "text": "Came looking for authentic Greek cuisine and was not disappointed. The menu has lots of great Greek options and the food was all delicious, fresh, generous, and made with good quality ingredients. It was a comfortable and friendly family-style place with nice service. Order the Greek coffee at the end! We will definitely be returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMzQzQm1BRRAB",
            "text": "In a neighborhood packed with authentic Greek food, Bahari stands out from the crowd! The service is fantastic, the food is incredibly fresh and super tasty! We came in for an early dinner on a Friday night and were seated right away. However, by the time we left at 8pm, there were tons of people waiting to be seated! Would highly recommend!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aXJhdVRnEAE",
            "text": "Bahari is a staple in my families rotation of restaurants in Astoria. The food is fresh and flavorful. I love the Tzatziki, Lamb Chops, and Greek Salad.  The Octopus is soft and cooked very well and the vegetable dishes are great. This is…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLOG9XLWJ3EAE",
            "text": "Overall a great dining experience. The grilled octopus was one of the best I’ve had in the city. An unexpected complimentary dessert served at the end of the meal. Service was attentive, the dining table and bathroom were kept clean. Will definitely come back."
        },
        {
            "date": "7달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ci1McW9BRRAB",
            "text": "Akdeniz mutfağı köftesi tamamen bonfileden tavsiye ederim çalışanlar sıcak kanlı fiyatları da gayet makul"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbTdfQ1JnEAE",
            "text": "Lots of Greek options in Astoria, but my go to spot is always Bahari! Love to bring friends and eat family style with their simple, fresh and well executed dishes. Their grilled octopus is exceptional and can easily be cut with a fork. The…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LU51eEVREAE",
            "text": "Love this place! First time here but will come again soon for sure! food was amazing! The eggplant dip and the fried herring are amazing and also the Orzo and everything else we ordered. Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcl91QnBnRRAB",
            "text": "Food was delish. I will keep it simple. You should most definitely make reservations."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTdTQzbEF3EAE",
            "text": "Came here for brunch with my Greek friend who is a regular. The octopus is amazing, clearly fresh and made to order and probably the best octopus I've ever had in New York. They picked the calamari bodies up and grilled them in front of us.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxc292NUdBEAE",
            "text": "I’ve been coming to this restaurant for years, in fact this is one of my go to joint for good Greek cuisine.\nI love the Saganaki, and hubby and I always get the Grilled Squids which are so tendered. I also like their Grilled Calf Liver and would order it from time to time.\nMy hubby likes the Pan Fried Whiting, Fried Smelt and Grilled Quail just to name a few.\nDecent Greek food with reasonable price and I definitely recommend it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdElDX0dREAE",
            "text": "This is a hidden gem! You can’t find the restaurant easily, but once you enter, you’ll be mesmerized by their grilled giant squid (if you like squid). This is my favorite! Whiting is also not bad. Okra and artichoke sides were fully cooked and had a soft side, and were super flavorful! Best EVOO! We have been here a few times. We saw a whole big fish ordered from another table. That looked awesome! Will try the fish next time. Highly recommended!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaktIVlVBEAE",
            "text": "Finally checked this place out and it’s without a doubt the best Greek restaurant I’ve been to in the city. It’s very lively and casual with friendly service that’s efficient but doesn’t feel rushed. All the dishes we had was awesome with some of the standouts being the grilled octopus and dorado. They have a fairly extensive menu so I can’t wait to come back to try other dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqX2ZmLXZ3RRAB",
            "text": "Let's start with the reservations.\nWe called 2 weeks ahead ,they were courteous and ready to accommodate.Like true Greeks.\n\nOpen arrival hospitality and friendliness like I was visiting my family (Aunt Angela may she rest her soul)\n\nTimely they told us 4pm and mind you every seat in the house taken,Chef and cooking staff hustling.Waiters and waitresses constantly moving.\nOur table was ready for my family!\n\nFood fresh like thea, salad and Greek spreads home made , calamari fresh made just breaded.\n\nLamb with potatoes just like uncle Gus melted off the bone.\n\nThe waiter was nothing but nice ready to make us feel at Home.\n\nWe came from Philadelphia 2 hour ride.\n\nSo worth it.. Xpristos Anesthesi and thank you from Stephanos Haviaras and family."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKM0xqSG1nRRAB",
            "text": "A lot better than most Greek restaurants in Astoria, but not its service\n\n40.76176 -73.92495 Bahari Estiatorio is a family restaurant, originally from Kalamata, Greece, next of Astoria subway station and the N/W train. Father overlooks the restaurant and greets familiar guests, while his children run the restaurant. We did not see a new generation of grandchildren in the restaurant.\n\nIn May 2023, we ordered Elliniki salad with vine tomatoes, cucumbers, romaine salad, onion, green pepper, kalamata olives and feta cheese ($10,5) and Tzatziki, Greek yoghurt with chopped cucumber & minced garlic ($8) as starters and Kalamarakia Tiganita, squid dusted with flour and lightly pan-fied ($19,5) as main course. We asked if the squid was fresh or rather frozen, but this question was not greeted with approval. Everything is fresh was the short answer. The squid tasted excellent. It was fresh. The tzatziki had the right balance between garlic and cucumber. Salad was perfect. This was a very good Greek meal.\n\nThe service was clearly service stressed, and the grumpy sons did not make us feel at home. Small talk about their homeland was not appreciated. When we settled the bill by card, we did not notice the tip was not included. One of the sons said to us: “you didn’t like our service”. He knew. We do not want ouzo as welcome drinks, but where is that Greek hospitality?\n\nBahari Estiatorio serves food that rises above most Greek restaurants in Astoria, but not their service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROc0oyOWVnEAE",
            "text": "Foods are always great and kinds staff. We started with appetizer and whole fish. Everithing was delicious and so fresh. House wine is good and from Greek."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcXF2UDlnRRAB",
            "text": "The food was authentic greek and flavorful. The hostess was accommodating, the waiter was friendly, and helpful with recommendations. Service was timely and on point."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOGRxY2FnEAE",
            "text": "Was surprised at how underwhelming this place was considering the rating it currently has in here. First we ordered a salad which on the menu says it’s cucumbers feta tomato onion and oregano. It ending up coming with olives and green peppers. When my wife asked about it and pointed to the salad on the menu, the waitress insisted it was the same salad and didn’t even offer to take it back to remove the extras that aren’t listed as part of this salad. Was literally yelling at us at the table that it’s the salad we ordered, but could t explain why it had olives and peppers. Also there was no oregano on it and not even a tiny bit of dressing. So basically some veggies thrown into a bowl. Not even the softest tomatoes like a Greek salad should have.\n\nTzatziki and pita were delish, grilled octopus was also delish. No complaints there. Would recommend both of these.\n\nSaganaki was cold and mushy. Not like hot grilled melty cheese with a crispy dough that so many Greek place in Astoria are known for. Definitely not tasty at all. Pass.\n\nMy wife got the spanakopita which she orders everywhere and did not like the one here. Said it had too much of an oniony taste. I tried a piece and thought it was just ok. It’s not a dish I usually like though so don’t take my word for it.\n\nFor main dish we got the marinated and skewered chicken and roasted lemon potatoes. The chicken was grilled nicely and had a good herb flavoring to it on the outside, but inside was dry and not very juicy at all. Underwhelming for the way it looked. Lemon potatoes were just ok. Have had better.\n\nI lived in Astoria for 11 years (just moved out in November) and have been to a lot of Greek spots. This doesn’t compare to any of the other many Greek spots in Astoria. Take your chances if you like though.\n\nLet’s not forget the ridiculous credit card processing fee which they don’t tell you about when you hand them a card. What restaurant does that these days? Ended up being an extra $6. Won’t break the bank, but can’t remember the last time I paid a fee for dinner for using my credit card.\n\nTry somewhere else."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwMUpUUEpREAE",
            "text": "This is hands-down my favorite Greek restaurant in Astoria! The food is always fresh, and the prices couldn’t be more reasonable. Portions are huge, and service is always attentive and friendly. The eggplant dip and grilled calamari are out of this world!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlME83Q3ZnRRAB",
            "text": "When my Greek friend told me that this is one of her favorite Greek restaurants in Astoria , I had to give it a go and I love it. The grilled octopus was juicy and so tasty . The salad was fresh . And the moussakas was incredible good (quality meat and soft potatoes) I also love the side of artichoke (although I though the could have put more than one (I needed it)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHMGVxLTRBRRAB",
            "text": "Great atmosphere for a small or large group of friends. Service was great. Delicious food, I highly recommend the spinach rice! Dessert we got on the house (a surprise!), unsure what it was but I enjoyed it a lot."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNrbHZYX21nRRAB",
            "text": "This place is amazingly good! We spent 2 months in Greece and this place not only serves delicious food but have good quality olive oil at every table to dip the breads with. I tasted the best calf liver here. Every dish comes with a side. Every waiter was polite and attentive. I strongly recommend this place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NUxiMkNREAE",
            "text": "Let the New York experience commence! After getting situated in my hotel, I began my journey through Astoria, New York by heading straight to @bahariestiatorio. I was able to quickly get a table for one, and I had a great view of the dining room.\n\nI couldn't decide between the oktapodi sharas (grilled octopus) and the paidakia (lamb chops), so I ordered both - absolutely my typical strategy when faced with such a choice. I must admit, this was actually my first time trying Greek octopus, having only had it previously chopped up on Mexican tacos.\n\nSince this dinner, I've had the Greek version a few more times, and let me tell you...this was my favorite. The seasoning was perfect, and the texture was not at all chewy, instead proving to be both meaty and satisfying.\n\nI have to say, I am officially in love with octopus - ευχαριστώ, @bahariestiatorio!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneVktSDJBRRAB",
            "text": "The food is great. Fresh and bountiful. What I love about this restaurant is that you can eat at your own pace without being rushed to order. A great place for large groups and even to have a cozy dinner with that special someone. A fresh…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtak1PWkJREAE",
            "text": "It's an amazing Greek restaurant, loved the food. the restaurant staff was very polite and nice. We ordered lamb chops with okra, feta ceramica which was delish and they have a variety of wines that go with the food. Must try when your in the area.  We also got a complimentary sweet, which was nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieFBUck9REAE",
            "text": "Possibly the best meal I've had in Astoria since moving to the neighborhood 1.5 years ago. The assorted dips were all incredible and the moussaka might have been the best one I've ever had."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3bElmM0pREAE",
            "text": "Exquisite traditional Greek cuisine. It's a real stand out in a neighborhood that's known for its Greek cuisine. I recommend it highly to those who are looking for mid to low prices, great service, and a beautiful space. The serving staff is legit old school and can help you find your way around the menu if you need help."
        }
    ],
    "reviews_count": 78
}