{
    "name": "Amylos Taverna",
    "place_id": "ChIJNcVXxklfwokRVyqI-jhfMFY",
    "grid": "QN1",
    "address": "33-19 Broadway, Astoria, NY 11106, USA",
    "rating": 4.5,
    "user_ratings_total": 1113,
    "phone_number": "(718) 215-0228",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkR2RsTXpZVzFFWkV4WlJ6QXlOalJ4WXpKcGFVRRAB",
            "text": "Food is excellent. Staff are friendly."
        },
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNWJWbERNVVptVGxaSFlubHphRmhFTFdjemEyYxAB",
            "text": "Very accommodating to families and large groups on short notice. Delicious food and fun energy!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TWJrOVpkREV0YTA1NGVreG1WMlZWWVV4WldIYxAB",
            "text": "We enjoyed every second of our evening."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaVZIbFZPRmhrTTNsbWJ6ZDBRM05VYmpoTlNHYxAB",
            "text": "The food was amazing. I definitely recommend the burger for a quick bite."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toblVVNVVjbVI0VkdwQldqVkNUa3BvZUc5YWMyYxAB",
            "text": "The food is good but their menu contains false advertisement. They mention that whole fish over 1lbs comes with one side of your choice. This isn’t true. First they will only give you a free side if it’s over 2lbs. Second they aren’t including mac n cheese in this offer. This is disappointing and confusing and I hope they change their menu to reflect their true offerings.\n\nOther wise the food is great and the bartender is awesome. I would come back again."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMlgySTBRbTVHUW10clVrOHdVazgxTVVjelVrRRAB",
            "text": "Quiet place! The fish was burned. Tasted disgusting and had some bones in it. Mushrooms that came with the fish were amazing, the only good thing to be honest. Service was okay but kinda sloppy. An okay restaurant if you have low expectations :)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWVRGZG5UekozUjA5d1oxbHdNemQxUzJKc1pGRRAB",
            "text": "Food was very salty… sea food was not tender"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWVdqRXRYekJvZUhOWVRHSnBlRFExYzJ4Zk1WRRAB",
            "text": "Amazing I love this place this is my second time here and was even better. I love the attention of Paños!! Was really friendly and helpful I totally recommended this place to all my friend and I can’t wait for be back!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaGVESk9OWEJUY1ZsNVRuZEdhbE42TTFkM1pFRRAB",
            "text": "Came here with two friends for happy hour recently. We were the only ones there which was a shame. We got oysters (oysters and clams only 1.50 each), calamari, hummus, tirokafteri, and the squash blossom pastry things. The squash bundles were a little sweet for my taste, but everything else was great. The calamari in particular was banging. Most importantly, the bartender and wait staff were amazing. Even though we were basically  the only people there (tbh we came very early—around 4) they were great to us. I will definitely come back to this place for happy hour or dinner."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWWVIaHBRbEZ6V1ZOZlJWUmhWRzFLU1ZCTFgxRRAB",
            "text": "Place is nice, staff is friendly, food is mid at best. I ordered a burger and it was honestly terrible. The bread was stale, meat was low quality, just one big disappointment. Realistically, if you can’t make a decent burger with fresh bread, it says a lot about your establishment. I didn’t make a big deal about it, mentioned it to the waiter when he brought the check out, they did nothing. Wont be coming back. If you come here, don’t make the mistake I did and order something else."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204dFFVUTBiMGRrUnpacFMyVTJPRUZZUTFadmFVRRAB",
            "text": "Fish and grilled vegetables are delicious"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhOGMtLW13RRAB",
            "text": "I hosted a wedding rehearsal dinner for my son and his wife at the end of June at Amylos Taverna.  It was beyond excellent.  Everything about my event was exceptional.  The service was top notch, attentive, gracious, and accommodating.  Catering menus are provided, but Anna Christina worked with me to make our menu exactly what we wanted.  My guests are still raving about the food over a month after our event.  It was delicious!  The staff arranged tables for an intimate gathering, making the venue perfect for our 54 guests.  The cocktails were fresh, creative, and fun.  I give this restaurant my highest recommendation for lunch, dinner, or an event.  Amazing!  Take a look at my pics – so fun!!!!  I wish I had pictures of the food - soooo delicious.  You will have to see for yourself!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJelkyOWFXVzVZUkhKVFQwTXRNekV6UWxoVWRrRRAB",
            "text": "Gorgeous restaurant.\nFood was outrageously good.\nBrag about experience. Noise level was perfect."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kb1FYcFZMV3BSVWtsVFMzQkNjamN5YldKR1JHYxAB",
            "text": "Everything is good the attention and the food very good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wd2VGSjFjVmhsWXpaNGNFOXNjMWxrV1RaS2JIYxAB",
            "text": "Panos was a great waiter and very attentive. Definitely made the dining experience more enjoyable. As a Greek-American, who knows Greek food, food, atmosphere, and Panos were all A++++. . We will be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OU09HOUlWa3RVVEd4aVlWbHZXVXR0ZFhWS1ZVRRAB",
            "text": "The food is delicious, but be careful that they don’t up sell you!!! My sister and i went and wanted to order the branzino, but the waiter said it wouldn't be enough food. He suggested the snapper, and on the menu it was only $6 more, so we went along. We didn't come close to finishing even a quarter of the fish, and packed it up. The bill came and the fish was $123 alone!!!!! It's on the menu as $44, but that's PER POUND! There's absolutely no way we would have ordered the snapper fish or that size had we known. Guessing the waiter was counting on that."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTFh6ZGhSMGx1U21sRVNHNW9jREZKVmtFMVRWRRAB",
            "text": "I have been to this restaurant multiple times, the food always amazes me and our server Panos was really above and beyond!\nOur favorite dishes were the salmon tarter, scallion (amazingly it comes with figs), and the dessert Baklava. The lamb chops were great too but I wish I ordered medium rare instead of medium. I took my parents here, which was their first time trying Greek food, and they loved it!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdXMtNjVnRRAB",
            "text": "Great food, great drinks, great staff, nice vibe. Everything was delicious. Must try their lamb burger. Thanks for the free shots of μαστίχα after we ate. Left happy- amialos -\nΠολύ ωραία. 🥃…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNFFqQnJPR2N0YVZaR2ExOXdkbmR5WlVkRFpHYxAB",
            "text": "The best green"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeFNYYzRXREpEYVhRNVZqZFBVbmxvTFZCVGQxRRAB",
            "text": "So about that dinner…if you didn’t know, parts of Astoria are known for amazing Greek food (ask my friends Sarah & Darin) so it was a short drive from Yankee Stadium to Amylos…one of my client’s hotel was out this way and he had an early flight the next day so those were the deciding factors to eat out this way…it wasn’t Manhattan, which was a nice break from the hustle and bustle…it was auuuuuuuthentic! From pit Greek server to all the amazing dishes (that octopus was as soft as a stick of room temp butter) it was an amazing meal…if you find yourself in the area, they are definitely worth a try!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbmEybHRUemREY0ZSVmNVTmxjbnBxWldWTlJXYxAB",
            "text": "Great place if you like to celebrate special occasions or impress people you cared about. Smells amazing as well, except the restroom area could use a boost of fresher fragrance."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ca1lqa3pURm8yVG05elVtdFhlV1JCV1ZoMWNuYxAB",
            "text": "Loved! Cool summer vibes… outside table was perfect. Waiter was awesome! Very friendly and able to assist with recommendations and drinks! Definitely recommend and going back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKbWFUWm9kV2RaWjBGeVZGUXpjMUV6V0V0dGFtYxAB",
            "text": "The restaurant was perfect, the service was excellent, especially Panos who served us. The bill was excellent, but not outrageous, nothing but very little for what it offers, one of the best restaurants, if not the best in America"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0c2NuaGxWMU13YVhkVVVHbE9SSFJNZUZKUU4yYxAB",
            "text": "No one in our group enjoyed the food. Everyone was disappointed and I thoughts it was only me. It’s just a fine dine restaurant with great atmosphere and overly priced wrongly advertised Greek food.\nI came hungry and went home hungry only to go home and cook again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aS04xVjJXbmxDYTFoMU4zWkpXV3hFYUY5aGFIYxAB",
            "text": "I am absolutely not satisfied with today's visit. It was my brother's birthday and we decided to go out for dinner. I have been to this restaurant before and I was satisfied with the food and even recommended it to everyone. The menu that we looked at on website before arriving does not exist in the restaurant because thay changed the menu and did not update it. The salmon was raw, we sent it back to cook. They returned it after 30 seconds cooked from the microwave, it tasted terrible, obviously someone is too lazy to do the job. The chicken was  very dry. The only pleasant thing was our waiter who was extra friendly and did his job professionally. I'm very sorry because we left $150 (dinner for three people) and we left hungry, my brother's birthday was ruined. I  feel even worse because I recommended that place and in my last visit they were excellent. That's why I won't give you a rating 1 but 3 because you can do better if you want."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sa09TMWhUVkJXV25STFJtTlNiWGhoTVdWV01rRRAB",
            "text": "A fantastic spot for lunch or dinner! Panos is an excellent server, and he made the meal feel even more authentic. Truly a phenomenal restaurant!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keVR6SjRjSFZ1TmpNM1NsTnNiVkpPVTBVelQzYxAB",
            "text": "Beautiful greek resturant with indoor and outdoor seating. Happy hour drinks only when sitting at bar, not when dining at tables. Found that to be a bit odd. Complimentary pita bread given when seated which is so good. Started with grilled calamari which was a bit  salty but still good. For entrees wife had halibut with spinach which she enjoyed. I chose slow roasted baby lamb with lemon potatoes which was delicious. Portion size was so big that I brought home half of meal. We finished off with 2 capichinos which hit the spot. A bit pricey but definitely worth it. Staff was friendly and attentive. Food presentation was so impressive that I forgot to take pictures. Overall a very enjoyable experience. Parking can be a little difficult."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTExUSlVkVWxmYUZoWkxXeFRNMnBSU25wQlNrRRAB",
            "text": "Very good food, horrible service."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abmFUUnFObFJrZUU0MWVFdGFSSFpOTld0elluYxAB",
            "text": "Fue mi primera vez comiendo comida griega y me encanto. Mi Plato fue un salmon tartare una delicia"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNFdrZHBYMGxrYUdRMFEzQnhiME5HWmtSWlpIYxAB",
            "text": "We went for dinner on a Saturday night.  The cocktails were very good, although both of ours were slightly sweet and fruity (which we don't care for, but they were still good).  Planos was fantastic and attentive, but all the staff worked very hard.  I had the short rib and my wife had the vegetarian eggplant dish.  Both were absolutly wonderful and we'd get them again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORVkzbG1TVzlMY3paWk9VMVFNRXhSZVhoa00yYxAB",
            "text": "Excellent food. Delicious drinks. Panos was the best waiter. He is super friendly and attentive. Can't wait to come back again."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobVVEaDFhV2huYzNreFdGOTFkMDlvYjA5aVdYYxAB",
            "text": "Aprovechando que estábamos en el barrio griego en Astoria, quisimos probar una de sus comidas estrella, el Gyro Bar.\n\nLo bueno de este local es que por un precio cerrado tenias uno y tu podias personalizar los toppings. Nosotros cogimos ternera y cordero, salsa blanca, feta y tomate.\n\nEl local es bastante grande, tiene varios espacios, tanto exterior como interior. Muy recomendable!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UmJISTFhRGQyWTJaNFh6ZEZaVWRmVFZObVNGRRAB",
            "text": "Their menu offers a wide variety of options from steaks to pasta and from burgers to salads and deserts too. The quality of the food served was amazing 👌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVmVYUmFiWGhNYzFaSFdHeHdSVEpXZEROcE9IYxAB",
            "text": "good foodddd love their fresh fish and lemon\npotatoes ! their spreads\nare good too …. it does take a. while for food tho"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCS1dWQXlPVVE0U25kdFJuRlpjbE5EWVVWMlVGRRAB",
            "text": "Good Friday vibe. The white man in his blue shirt and white pant who may be the owner of the restaurant saw me trying to call him and just completely ignored me. My partner’s cup has been empty for more than 30 minutes without water. It’s so hard to stop a waiter in this restaurant. Grilled vegetables and mushrooms are kind of burned. Salmon tartare and the whole fish we ordered were not bad. Cocktails are too heavily flavored."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYVV6aDZORlJhWjAxeFZGUTVTRzVUTVdZMFNHYxAB",
            "text": "The atmosphere was lovely and the food was amazing. I had the garlic shrimp that is grilled. It came with a little salad and it tasted amazing and for my entrée I had a ribeye with french fries which was amazing as well hats off to the chef. Pano my waiter was a friendly helpful person even helped me pick out my wine for my food and I loved it. Amazing environment and would totally come back 100% ❤️❤️❤️❤️❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210R01GUXlTMjlmWlRWcWFqRnZWWFJQYlVreU4xRRAB",
            "text": "Had a wonderful brunch with my mom. The lobster rolls and cocktails were excellent, and Panos was a fantastic server. So attentive and always made sure we were taken care of. Thanks so much for a great afternoon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSlIwMXJWM2xhTjFGaFNXNVNhM0JJVkVkT2RHYxAB",
            "text": "The roasted chicken is amazing, I always come back for it and the pita bread."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dFZHeGpOWEZzTWt0Sk1UQmFTbnBqVGkxQlMyYxAB",
            "text": "The food and service were outstanding! Great waiter! Sitting outside, there's a lot of traffic noise. Next time, we'll sit inside."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veGRYcGtkbFpGWlRWMldYQlhaRGRQYTFnM0xXYxAB",
            "text": "I must say, absolutely fabulous. The lamb chops were delicious (but heavy so brace yourself), and the branzino was so smooth and light and excellent. Amazing service from George (Iorgos) who also guided us with drink pairings and desert (we went with the chocolate lava cake with vanilla ice cream). Service was also so fast, despite the fact it was pretty busy. Gorgeous place. Splendid experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdFVTMTVWbWxOUkV0aWExZDBVVWN4TjA1RU9XYxAB",
            "text": "I would like to share some impressions from our recent lunch at your restaurant on a Sunday afternoon.\n\nFirst and foremost, I want to say that the ambiance is pleasant, the staff is very kind, and the food is tasty and authentic – a real treat of Greek cuisine, which is becoming harder to find. That’s exactly why we chose your place for a family lunch.\nHowever, unfortunately, the overall experience was somewhat diminished by the behavior of certain guests who were extremely loud, taking photos and talking on video calls without any regard for others around them. It was a family lunch hour, yet at times it felt more like a train station than a restaurant.\nWe understand you cannot fully control every guest’s behavior, but when it comes to those who clearly know the staff, it might be helpful to kindly remind them to be considerate of others. A little awareness can go a long way in preserving a pleasant atmosphere for everyone.\nThe tables are also quite close together, which amplifies the sense of crowding. Your staff kindly moved us to a quieter spot – and we appreciated that – but the main issue of excessive noise and lack of basic courtesy from certain guests remained.\nI’m writing this with the best intentions, as we genuinely enjoyed the food and service. We simply hope that in the future, some steps might be taken to ensure a more respectful and relaxed environment, especially during weekend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJVGh6TnFSNUtpOFlBEAE",
            "text": "Pleasant comfortable without too much noise and nice music! thank you very much to the manager (Lampis), he made us feel at home and to the waiter Panos for the very good and kind service. I will definitely come back!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQNmE0OFhhbWUtS0ZBEAE",
            "text": "We hosted a baby shower at Amylos in Astoria and had a wonderful experience! The food was delicious, the service was excellent, and the whole event ran smoothly. Panos, our waiter, was incredible—efficient, friendly, and so attentive. Big thanks to Carlos, Anna, and the entire team for making everything so special. Highly recommend Amylos for any event or a great meal out!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRGlpTi1GdWZ2OGt3RRAB",
            "text": "Alta cocina griega para estar en Astoria. Buena calidad de los ingredientes. Precios entendibles y manejables. Calidad y sabor de la comida en el mejor sazón al estilo griego. Recomendable reservar si van mas de dos personas aunque hay bastantes sillas y un bar. El Mesero Panos de fino trato al estilo griego"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJdWcxY0w5OXI2Yi13RRAB",
            "text": "My wife and I had amazing dining experience here. We were served by Panos and he was friendly. The food was spectacular. We really recommend the halloumi - amazing with the tomato jam, the lamb chops - beautiful charred crust, and the chocolate lava cake - a level above the usual ones. For sure a restaurant we will be coming back to."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZk12cG05aVlTZkpREAE",
            "text": "Highly recommend - delicious food, warm, amazing service and fun atmosphere! We came for a family dinner celebrating our son's graduation, and it exceeded our expectations. Panos, our waiter, was so nice, funny and attentive, checking on us and making sure all was well. He made great recommendations for food and wine that we enjoyed so much! We were hoping for a special night and it was absolutely perfect. Thank you so much!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWmEyaFFTMmx1ZVcxcVMwd3dPV3RmVFRKRFZsRRAB",
            "text": "We hosted a small event at the restaurant and couldn’t have been happier with the experience. The food was delicious, as always, but it was the service that truly stood out. Panos, Carlos, and our event coordinator, Anna, went above and beyond to make sure every detail was taken care of. Their attentiveness and professionalism made the entire event stress-free. Our guests couldn’t stop raving about the food, the service, and the overall atmosphere. Highly recommended!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPN3NwOXVLcVlUYTFnRRAB",
            "text": "My first experience here was sensational. I really enjoyed that atmosphere of this restaurant.  The food was very good and the service was great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJSEcwLTJjbUxIODZRRRAB",
            "text": "We just left after an amazing dinner for 4 and we could not have been more pleased! The vibe, the food and service — all exceeded expectations. We had the pleasure of being served by Panos. He was very attentive and overall made our experience so much better! if possible I would recommend asking to sit in his section if you want to get taken care of"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLcmdwNGZKM1lDWnd3RRAB",
            "text": "The interior of this restaurant is beautiful and the staff are so friendly. We came here to celebrate our anniversary. I loved the entrees we ordered and was interested in so many others on the menu that I had a hard time choosing. The lemon potatoes however were not our favorite because the lemon taste was very strong and I don't think it went well with the potatoes. But we really enjoyed our dinner here!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc2J5QTBnRRAB",
            "text": "Upon arrival, we were greeted with smiles and hellos. Our reservation was for 6:30 pm and they seated us as we arrived. We didn't have to wait. The staff were all attentive and would interact with us.\nThe food was DELICIOUS!! Everything was fresh and visually appetizing.  My drink the ODE was very tasty. If I wasn't a lightweight, I would have had two. 😆 They helped us celebrate my dear friend's birthday and gave us a round of shots for the table.  It turned out to be a great evening."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeVlEWFNBEAE",
            "text": "Happy Hour daily but at the bar counter only! Lots of great fish options which seem to only come in two pounds or more. I don't mind normally but their prices were a bit steep (per pound). I ended up sharing with my dining companion, two pounds of sea bass we shared the grilled eggplant as well. Next time I'd skip that and get more sides instead. The lemon potatoes and sauteed mushrooms were good. Must try the beet salad. And the Zucchini/Eggplant chips are a great starter."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdU9DbElREAE",
            "text": "It saddens me to leave a bad review because I’ve been coming to this restaurant for a long time. I made a reservation 4 days in advance and was seated in the less aesthetically pleasing part of the restaurant because there was a baby shower being held. I would've thought that meant closing the restaurant off to anyone outside of that party. Then the cutlery set on the table contained a dirty napkin with a hair wrapped up inside it (gross) and lastly the portions for the entrees were very small for the price ! 43 dollars for 3 lamb chops and 4 potato  wedges seems overpriced. No reason I should spend over 100 dollars and leave hungry ! I think this last experience is truly my last time dining there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNk9uSU53EAE",
            "text": "Food was good, service was too slow. Waited 45 minutes after ordering just for appetizers.\nThe saganaki was delicious, perfect to eat with the pita bread they served.\nThe butternut squash purses were way too sweet for my liking we actually left them.\nThe Moussaka was good but was served cold so I wasn’t a fan of that.\nThe short rib portion was huge, rich and delicious.\nThe portion sizes are very generous, I would say some plates can be shared if you also order appetizers. Ambiance is laid back, they have outdoor seating which is nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNGJiTVNREAE",
            "text": "I’ve been to Amylos twice now with my parents and my boyfriend. The food hits every single time! The appetizers are my favorite and so tasty. My parents loved the mixed platter that has a bit of everything. The drinks are really good too. The atmosphere is cozy and super inviting. This is a great spot for date night or to have dinner with friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMc3R6VUNREAE",
            "text": "Really fantastic food, service left a little to be desired. We made 1 special request to put the onions on the side for our salad, and it arrived mixed in. We decided not to call it out and just separate the onions for the member of our party who can’t eat them. They also brought the wrong bottle of wine and we had to correct it. Aside from that, our waiter was slow to come back to the table - he was very responsive at the beginning but stopped coming over to check on us, to the point that we had to get up and ask for the check, and at one point, all of us were sitting with empty water glasses for about 10 minutes.\n\nThe restaurant was not particularly busy when we were seated, so would have expected more attention to detail. That said, still really enjoy this restaurant and will definitely return."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMk1peUxBEAE",
            "text": "It took about 40mins for the waiter to take our food order - other reviews call out the poor attention from the server and I encourage readers to take a look. The server was better at the beginning, doing three separate rounds for basic things - giving us the menu, bringing water, and the first wine order. For all other things it really took effort to get attention. For our experience - We saw the server in passing as he waited in tables AROUND us. The server was very attentive to the table immediately next to us but did not provide the same attentiveness to our table. Anyway, it was getting late into the night, we were hungry, and needed to get an order in before the server forgot about us again. We took the food recommendations provided by the server expecting the dishes to be among the best. The meat in both dishes was dry and tough - which you can see in the photos. Between flagging down the waiter, and having to wait later into the night to get a new dish, it was not worth it to escalate. Either way, the dryness of the meat can be seen in the photos. I would expect not to have to raise an issue with the dish when the prices per dish are priced as they are. The oysters and salmon tartare were the better part of the meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcTRTWHpBRRAB",
            "text": "Food is awesome! We ordered pink snapper and it was fresh and delicious. I am a fan of baklava, and it’s my first time having baklava cheesecake, it turns out delicious! Baklava may be too sweet for some people, so the cheesecake actually makes it less sweet."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dDlXVmFBEAE",
            "text": "Really good experience! We were seated by the window area so we’re off to a good start. The service was friendly, attentive, and professional. We ordered Greek salad, chicken, and lobster pasta. All were fresh and delicious. Pretty generous portion and we had to take some in a box. The sun was shining so that helped too. But the music was a bit on the loud side. But still giving this place a five-star score! Would come back!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dWZLVHN3RRAB",
            "text": "Incredible food, great atmosphere very cozy. Food was all perfectly cooked. Service was quick and very friendly. We had Greek salad and the rotisserie grill then baklava cheesecake. The grill easily feeds 3-4 people we had lots of leftover meat"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYay0ySHNBRRAB",
            "text": "Stopped in for lunch.  Fixed menu for $20 each.  For appetizers, we had the Greek salad and calamari, both delicious.  Pita was apparently cooked in a oregeno based olive oil and was awesome.  Main course was somewhat dissapointing.  Mousaka was ok, nothing special.  Lamb looked like plenty but was a lot of bone and what meat there was was dry.  The orzo cooked in tomato sauce was very tasty.  For dessert, the Baklava was OK but we thoroughly enjoyed the creamy Galactobureko."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2X01pRmhnRRAB",
            "text": "Astoria is undeniably the Greek food mecca in the US, and Amylos is at the top of the list for best Greek in the area. To start, it's one of the nicest looking restaurants I have ever been in. The ambiance and decor is beautiful and inviting and really sets the tone for a lovely evening. The food was absolutely delicious and the portions sizes highly exceeded our expectations. The drinks were fantastic and our server was a pleasure. I will be returning very, very often. This is exactly the kind of place I will continue to give my business to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0ME1MZXl3RRAB",
            "text": "Stumbled here on a Sunday evening. Interior was nice and clean. Food was delicious! Service could’ve been better. We waited about 10-15 after we were seated for a waitress. Then after our meal we waited about 15-20 mins to order our dessert. However, she was very nice and friendly."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBaXRXME5nEAE",
            "text": "i had the most amazing meal here - the best during my time in new york!! such lovely ambience , interiors were a tasteful step into greece. i had the roast chicken with vegetables which was so so tasty , cooked to perfection. we were waited on so attentively by panos , who was incredibly kind and friendly- could not recommend this place more!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbGRTWm53RRAB",
            "text": "Although I am not a huge fan of Greek restaurants,  I really enjoyed this one.  Great atmosphere,  good service, and very fresh and tasty food.  I really liked their grilled octopus,  vegetable chips, and zucchini croquettes. Also, the catch of the day - black sea striped bass - was delicious. The only thing that I can complain about is baby lamb - a bit too dry to my taste."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN3BUTDd3RRAB",
            "text": "Beautiful interior, great food, refined cocktails and quick service. I really enjoyed the smoky pear, pita with spreads, grilled octopus and meat platter for 2. Everything our large group had was excellent and I would gladly return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaU1maVVREAE",
            "text": "Very loud restaurant with night club music pumped throughout service.  The food was hit or miss.  The octopus was over salted, the chicken was bland without seasoning.  The halibut was good as was the Mac and cheese, the veggie stack, and the Greek salad.  Service was off as they served the salads, appetizers, and entrees at the same time."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpd3BDcVhnEAE",
            "text": "Wonderful brunch experience! The French toast was to die for!! One of the bests I’ve had! Came out complete with a little wooden honey dipper stick. Presentation and taste were 10/10!! They also brought out some seasoned pita while we were…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPcFByMkRREAE",
            "text": "The service was so good, Rosie is very nice and kind server, thank you!! Beet salad is very unique and delicious! Salmon was a lil uncooked inside and the lentil was cold as it is but I was expecting lentil as hot served. Restaurant is nice as well. I’ll be back definitely!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dl9EbGpRRRAB",
            "text": "Came here for a dinner with a close friend on a Sunday night. We made a reservation for 6:30p - there were plenty of tables available but by the time we left around 8p the place filled up.\n\nOut of everything we got, our absolute favorite were the scallops. The scallops were perfectly cooked and seared. The sweetness from the butternut purée and bacon marmalade really complemented the scallops. We both took one bite of the scallops and aggressively nodded our heads like, “this is IT”.\n\nWe also ordered the wild sea bass to share, for 2lb it came out to $72. Fish was cooked well - soft and flaky. For the order, it came with 2 sides, EXCLUDING the Greek style Mac and cheese (unfortunately). We got the truffle fries (yum) and Brussels sprouts. The sprouts we can tell were probably well roasted and crispy at one point, but it was just oily and soggy when we got it.\n\nService is great and prompt. Would def come back for the scallops."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBaXJYTk1BEAE",
            "text": "Love this place! We were served by Panos who was incredibly friendly and attentive, couldn’t ask for a better waiter. Food was delicious - everyone in our party thoroughly enjoyed their meals. (We had the lamb burger, moussaka, roasted chicken and halibut.) We came here for lunch before visiting the Museum of the Moving Image but honestly this restaurant alone would be worth travelling to Queens for! Thank you Amylos Taverna."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPajVhVVlBEAE",
            "text": "I’ve eaten there a few times now and ordered different meals each time and can I just say how delicious they have all been every.single.time! But first let’s back up to the pita garlicky olive oil goodness they serve fresh and hot when you first arrive! I’d honestly go just for that. The wine selection is so good and I love that they carry Greek wines. The service has always been the nicest and super accommodating. It’s definitely become a quick favorite since I moved to the neighborhood. I think my favorite dish (if I have to pick one) so far has been seafood risotto. Salivating just thinking of it now…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eGVILVNBEAE",
            "text": "We liked it. The 2 of us walked in at around 6 pm on Sunday and were offered some very nice tables along the open side of the restaurant. The food selection is very traditional and plentiful, but doesn't overwhelm.\nDrinks' and food  service was extremely fast.\nWe shared a Burrata Salad as our appetizer - it was fine with a truffle oil dressing, although I personally like it with a more pronounced balsamic touch.\nOur Branzino and Scallops dinner courses were just perfect - very nicely seasoned, as tender as it gets. I also liked that the side vegetables were there just to accompany the main actors and didn't occupy much space on the plate. In fact, scallops dish could probably use some - all it came with were tiny fig slices and bacon marmelade. The pricing was reasonable, our main dishes were in the low $30 range.\nOverall, Amylos is definitely an excellent dinner option. Thank you!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1a01YMm13RRAB",
            "text": "Our waitress, Caitlin was very professional. The cocktails were delicious and tasted like they used fresh ingredients. Very well thought out and unique. The saginaki was very tasty, I believe there was a fig jam on top, which was delicious. I wish they would include bread or pita with it though, as it is very rich. Pita comes when they serve water, because y maybe they should serve it with appetizers. I had the short ribs, which were delicious. Something was a little off with the turnip, but I was still pretty content with the pearl onions, puréed potato and purple carrot. My partner had the lamb chops, which were delicious and very nice sized. He would have preferred a veggie or salad as a healthier option instead of French fries. No room for desert as we were stuffed. I would return and do recommend this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOMmVXT2hnRRAB",
            "text": "This place was great. I ordered the Halibut and the lamb shank this evening and both were spectacular.\n\nThe halibut was seared perfectly on top. It sat on a bed a sautéed spinach with a yellow buttery sauce that complemented each other really well.\n\nDark Ale Lamb shank as well had a molasses based sauce which worked perfectly at enhancing the natural flavor of the lamb.\n\nOverall excellent food. Can't wait to take another trip here soon."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMnZiemh3RRAB",
            "text": "Best Mediterranean food in NY. The beef short ribs was fantastic!! We always have trouble figuring out what to order because the menu is so large and everything looks great!! They also had some of the best drinks I've had in NY! The server also made some great recommendations and explained the food choices perfectly!\n\nUpdate: This is definitely our number 1 regular place to eat in all of NYC. For our last visit Panos, our server, was wonderful and made excellent recommendations! Will continue to return!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNUlQUEhREAE",
            "text": "A delicious take on Greek dining. The food was crafted with perfection. I finished every bite of my ‘Greek Burger’ and french fries. The feta sauce and cucumber gave it such a unique flavor. The salmon was cooked amazingly as well i highly recommended it. The setting is very romantic and we enjoyed every minute of it. Come check out Amylos Taverna for a romantic night on the town."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cWJMOFFREAE",
            "text": "I ordered the lamb shank and absolutely loved it! The atmosphere was amazing, with a live DJ and was offered a free shot after paying the bill. Will definitely go back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdk5xUFhnEAE",
            "text": "It was such a lovely dinner experience on an early Sunday night. Our waitress Claudia was very welcoming and helpful. She tailored our entrees based on our preference and worked out the side dish with us. The scallops were seared to perfect golden color and texture. The is chicken is also well roasted with a bit charcoal flavor. I also enjoyed the citrusy from the wild mushrooms. Oh… the warm pita bread is definitely a great complimentary starter;) Although we didn’t get a chance to try the cocktails and desserts, Claudia bought us two shots of Psychics Mastiha. Good to have something sweet to finish up the meal;) Will definitely come back;) Both the outdoor sitting and interior decor are full of thoughts!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicHZpQWdBRRAB",
            "text": "Our waiter Panos was simply the BEST. From his recommendations to conversation’s, he went above and beyond to take care of us! The food was fantastic and the wine he recommended paired even better! Will definitley be back soon!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1eHJ5UmRBEAE",
            "text": "Went here for the first time after walking by countless times. First had a drink at the bar while I was waiting for my friend. The male host was so lovely and said he would hold a table for me when my friend arrived. The bartender made a wonderful spritz. We sat at a beautiful table by the window and our server Matt was super accommodating but also left us alone to have girl talk. Food was INCREDIBLE. I highly recommend the grilled Octopus. Can’t wait to come back."
        }
    ],
    "reviews_count": 81
}