{
    "name": "Sotto la Luna",
    "place_id": "ChIJBTuSXqhfwokRpjEVqzy1U6U",
    "grid": "QN1",
    "address": "34-39 31st St, Astoria, NY 11106, USA",
    "rating": 4.5,
    "user_ratings_total": 795,
    "phone_number": "(631) 380-3569",
    "reviews": [
        {
            "date": "1시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bWVYZEdWM1phTm1WZmVEbFpTRGN3ZVVobVNtYxAB",
            "text": "Food was good!"
        },
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cWFLT1h3EAE",
            "text": "I really hate writing bad reviews but when it comes to my son, unfortunately I will let you know exactly how I feel. I made my son and his girlfriend a dinner reservation here. Apparently, the man that sat them was very rude. The kids felt very uncomfortable. First off not friendly and when they went to place an order the waiter as nasty to my son when my son told him that he had a nut allergy. Very very disappointed in the customer service there. Apparently the owner sat next to my son whom I know by face and eating there when they first opened.  Told my son he should have told him how rude the waiter was to him about his nut allergy. This is a very serious nut allergy and any waiter should take it seriously. We unfortunately will not be back. Fix your attitude."
        },
        {
            "date": "4일 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOT2VtUTFjVUl6YjBNMlEydFRWRVoxT0d0UFJtYxAB",
            "text": "Maravilhoso\nSempre como o nhoque e pizza"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5eWVuWldZbkZxWTB3eWFtSlBYMFIyYVU4MWRYYxAB",
            "text": "I chose this place to have my bday lunch because they offered the cheese bowl pasta performance. Haha. Have always wanted to see it and try it. Getting here by google maps was easy taking the train. This was located in Astoria, NY. If driving, you can find parking but I would not drive in NY.\n\nThis was a nice quaint spot for locals. Very beautiful inside with lots of green plants and big windows to see through. I saw there is outdoor seating if it’s possibly crowded inside. I can tell it would be more busy with locals in the evening. It’s a nice spot to have a date or have a group dinner. We made reservations for our family of 6 but it was not crowded on a Friday late lunch. The staff were very welcoming and attentive.\n\nEveryone chose a different dish to try out. I had a Peach Moscow Mule cocktail to start. It was good and strong.\n\nChoose:\nCasio e Pepe (****) - spaghetti with pecorino cheese and black pepper. The cheese bowl soaked in pure cheese and probably a little pasta water. They gave a lot and my daughter and I both got this. We should have shared.\nMargherita pizza (***) needed more cheese. Haha\nCalamarata pasta (****) - ring pasta with small bites of salmon. Would have been good if it had bigger pcs of salmon.\nGnocchi (***) - gnoochi with cherry tomatoes and raw shrimp and cheese. I just didn’t like the raw shrimp but that was me.\nRagu (***) - fettuccine with fillet mignon.  The meat was more than the pasta and needed cheese.\n\nThey had other dishes I wanted to try. I love pasta and cheese! They also gave us a round of shots but not sure what it was but it was delish. All in all, the service was good, location and restaurant were nice, prices were decent for an Italian restaurant, and some of the dishes I would get again. I would recommend it here."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbVExZzBlWEE1ZVMxdlpDMTFNMnMyTTI5eE5GRRAB",
            "text": "Excellent pasta"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTVJHcEJjRVYzVWxwaFR6Vndka05TVDFwUGIwRRAB",
            "text": "Sotto la Luna is an exquisite dining destination that brings the authentic flavors of Italy to every guest, offering a perfect blend of traditional recipes, fresh ingredients, and a warm, inviting atmosphere. Known for its dedication to quality and culinary excellence, Sotto la Luna provides a dining experience that celebrates the art of Italian cuisine, making it a favorite for both locals and visitors alike.\n\nThe restaurant’s menu features a wide variety of Italian classics, from handmade pastas and wood-fired pizzas to savory risottos and fresh seafood dishes. Each item is thoughtfully prepared using high-quality ingredients, ensuring every bite delivers the rich flavors and comforting taste that Italian cuisine is renowned for. Seasonal specials and chef’s recommendations add a touch of creativity and innovation, allowing guests to explore new flavors while enjoying familiar favorites.\n\nSotto la Luna offers an ambiance that perfectly complements its cuisine. The elegant yet cozy setting, soft lighting, and tasteful décor create an intimate environment ideal for romantic dinners, family gatherings, or special celebrations. Guests can enjoy attentive and personalized service, enhancing the overall dining experience and ensuring that every visit feels special.\n\nFor those who appreciate fine beverages, Sotto la Luna provides an extensive wine list featuring both Italian and international selections, expertly paired with menu offerings to enhance the flavors of each dish. The restaurant also offers desserts made in-house, allowing diners to end their meal on a sweet and memorable note.\n\nWhether celebrating a special occasion, enjoying a casual night out, or exploring authentic Italian flavors, Sotto la Luna delivers a dining experience that is both memorable and satisfying. Its combination of exceptional cuisine, inviting atmosphere, and attentive service makes it a standout choice for anyone seeking a genuine taste of Italy."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTVFubFZlaTFYVVdVNE4zQTFja0V0YXpaRGRXYxAB",
            "text": "Very cool place with friendly staff great service and food was really good."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twR1NGaFdUVlZwZFRaMmFqTTVRM0V3ZVVKV2JrRRAB",
            "text": "Incredible experience! I had been here once a long time ago for a quick dinner, but last night we were celebrating my sister’s birthday and it far exceeded my expectations. The food was delicious, the mocktail was amazing, and the service…"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOS1pFVXRTV1ZZTVVaM1V6RndiWGR5WVVSb1FYYxAB",
            "text": "I cannot speak more highly of this place. I hosted a dinner for a large group of family and friends and everyone could not stop speaking about how lovely it was! It was about 42 people and we chose a family style prefix dinner. Everything was amazing and seamless! The team at Sotto La Luna were very responsive when planning and preparing, they allowed me to decorate and helped cut the many cakes brought. When it came to the food, the food would not stop coming! It was a plethora of food and everything tasted immaculate. 10/10"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZdFQzTjVjR3h6UmxScU9XRlNWbWhxUzJZNFNYYxAB",
            "text": "Beautiful place, very complete menu, with a lot of variety. The drinks and desserts were ok but for the price and location it’s worth going. Yes, I recommend it and I’ll be back!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sU1JHSkdUVVJwTTNFeFdWWmlWMmN4V1haUmJHYxAB",
            "text": "Very elegant"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTWJtNURTVkpGYWxkeE1qWmhSVGRhTUVwcldtYxAB",
            "text": "Great food! Parking is very hard in the area but definitely will be coming back! Pasta was fresh!"
        },
        {
            "date": "1달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSGJuY3phVkJFWTNCNmR6TXpabkpTY0cxcVduYxAB",
            "text": "Heerlijke cacio et Pepe. Lekkere wijn. Heel vriendelijke bediening. Echte aanrader"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRmRWVlNhMlZUV0ZOamJ6WkZSVmM0UVdWWlpVRRAB",
            "text": "Great food and service. Can't wait to go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGellVVTVWVFE0Tm1GNFpHUnpWM1Y0YlZJeGFGRRAB",
            "text": "The ravioli ossobuco and pasta pomodoro were fantastic. Pizza also very good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MmNUWmxia013YzJONWNIcG9hRGMxU1hSWVRHYxAB",
            "text": "Amazing experience I got there today at 10:05 knowing they close at 11 and never felt rushed they still serve me with smiles and hospitality. It’s was my friends bday and they send us a tiramisu in the house it’s not about the free stuff it’s about the action and gesture. Big thumps up to my server Simon (parce todo usted es una chimba). We got the beet salad with goat cheese and was phenomenal follow by the rib eye nice portion and perfect medium rare she got lasagna which was perfect and delicious. Definitely coming back !! Cocktails are blah drink wine !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xneFl6RjBaM0JaYVU1NFRqQllMVGx3YUdWcWVtYxAB",
            "text": "Unreal food, amazing customer service.\nMarco is a genius in the kitchen"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Zd01qSmtiMUJXZFVwVlowMDVTVXRHZWpWZlRFRRAB",
            "text": "Dinner at Sotto La Luna last night was nothing short of spectacular. From start to finish, every dish showcased true Italian craftsmanship and passion. We began with the arancini, perfectly crisp on the outside and bursting with rich, comforting flavor inside. Then came the Mortazza pizza—a masterpiece topped with freshly sliced mortadella, creamy burrata, and crunchy pistachios. Crafted by Pizzaiolo Alan, it was authentic, balanced, and one of the best pizzas I’ve had in New York.\n\nThe Carbonara Tartufatta, prepared by Chef Marco, instantly transported me back to Rome. The silky pasta, rich truffle aroma, and impeccable seasoning reflected the authenticity of true Italian cooking. To finish, we indulged in a velvety panna cotta and a beautifully presented caprese dessert, both the perfect sweet finale.\n\nAll of this was perfectly paired with a glass of Nebbiolo, which elevated the entire experience. Between the skill of the chefs and the warm ambiance, and the attentive service of our waiter Boris; Sotto La Luna is a gem in Queens and a must-visit for anyone seeking an authentic Italian dining experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbWREY3dOaTE1VVVsek5HOVBOWHB3TlVoeVRFRRAB",
            "text": "Came here with my girlfriend and the waiter was so horrible we get up from the seat and leave."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNVMzcFVjMWhoYkhOdVJGQXdWSFpMU1RNdGVHYxAB",
            "text": "Everything is super delicious, the dishes are a little small but for the cost very good. The very good service and the dessert the best"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbHBYNEhREAE",
            "text": "Very nice spot for dinner. The pizza was good, I just wish the slices were cut a bit smaller. I had the best panna cotta here, I highly recommend getting it!! The food is more expensive than a regular pizza joint, but the restaurant is more upscale. We paid around $80 for two people.\n\nThe service was quick and efficient. It’s a little loud, so it was a bit hard to hear my partner sitting across from me.\n\nThe tables are also very close together, so you will be squeezing to get to your seat, but everyone was nice and patient."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJdFNYZHNTVWRvT1dscVNtSmZUM1YyUkRoV1JrRRAB",
            "text": "Sotto la Luna is an Italian restaurant with both a regular bar, pasta bar (if you want to see how it's made), and regular sitting. I have the gnocchi, which was good, almost refreshing. I would check it out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbFEyOHlPUzB4VDJ4bVpqZHNRVGhYWmpSUE1rRRAB",
            "text": "I came here for dinner with my husband and sister unfortunately on a 95 degree day. The restaurant had no air conditioning.  If we would have known that we would have went someplace else and dined here on a different day.  We started out with the arancini which was AMAZING!  The rice inside was so creamy!  We also had the insalata cici for an appetizer.  It sounded good, but it was too dry to eat.  It needed way more dressing than it had.  We all had homemade pasta dishes fettuccine with filet mignon, granchio, and cacio e Pepe.  The were all very good, but the cacio e Pepe was by far the BEST!  It was one of the best cacio e Pepe pasta dishes I ever had!  We didn’t stay for dessert because it was way too hot!  I recommend Sotto La Luna in Astoria!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOak1WSkZkRkEwTWtkSFN6WkxjVXREUkhKM2NuYxAB",
            "text": "I really enjoyed the lasagna at this restaurant, although it did not agree with me ultimately.  I'd give it another try though and the atmosphere was quite welcoming."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOelZIaHlkVjlYZEhodVJtVmFMVVZMTlUxUWFFRRAB",
            "text": "Today was one of the hardest days for me. My mother was admitted to the hospital with cancer, so I decided to go to an Italian restaurant one block from my house. I can tell you it was a very good experience. The food was authentic Italian. I had the pizza Capricciosa, house wine, panna cotta, and dessert wine. I felt like I was in Italy—and I actually was there three weeks ago. They also had a cute band, which was nice. If you want to experience a great vibe with good food and go solo, I really recommend this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUmVESkpXR055TjFoZk4zQk1TRlJzVURVMlNXYxAB",
            "text": "Love this place! Great happy hour, great food, great service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMlZHSXdSR1V3TFc1WlVXNDVTMkZ0UVVaQlFXYxAB",
            "text": "With just 8 hour in NYC during a layover, we knew we needed great Italian food and we found it at Sotto La Luna! All of our food was amazing! When in Astoria, eat here!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSFJVeHBTbmhGT0RCR2VFdEthalJNZUZOeFluYxAB",
            "text": "Fantastic place for lunch! We had Casio e Pepe, Magherita Pizza, Carbonara and wine. Couldn’t have asked for better service - huge smiles, incredibly accommodating and can’t wait to go again! Thank you gents for the beautiful experience!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dE0zcG9WSGh2UkVaWWJHTkpNbDlMV0ZWclVHYxAB",
            "text": "Get $25 off your bill using the link on my profile!\n\nA nice neighborhood restaurant with plenty of seating. If you order cacio e pepe they plate it at your table, which the kids seemed to enjoy. The pasta wasn’t as hot as I would’ve liked it and a little hard texture-wise; but the croquettes were tasty. A $11 glass of wine tasted pretty good too.\n\nOne thing to note is that there’s a daily menu that changes. We went planning to get risotto based on previous menus but it wasn’t there on the day we went."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWFMzcGtkSGhWTlhkTFpIWXhaWGRuU1ROSVpuYxAB",
            "text": "Loved that everyone was speaking Italian, from servers to customers. Very authentic! It was as hot inside as outside. I'm sure it's more comfortable when the temps are not triple digits!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUFdUVm9XWEZNYmpGNE5qVk1kRFI0U0dwSFZWRRAB",
            "text": "The atomsphere was nice when walking in, pizza was good but the carbonara tasted like pure egg ( wasnt good)...service wasn't great, they were slow to take your order but quick to try to get you out once eating."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcFVqaHRkRTlsU1ZNeU4yUlhibnB4V1hBelZWRRAB",
            "text": "Great Italian place!! The cacio e pepe, which they prepare in a cheese wheel in front of you, is both fun and delicious. We made a reservation in advance because the place gets quite busy, but definitely worth it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVWFFOU5iMnRKVlMxTVlXVnNja1IwUzNkbmRYYxAB",
            "text": "Great hosts, ambiance, food. Had a great time and will surely be coming back with friends."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWFNWVjRYMjlpVTJWUGRHMVViamRtWnkxek1uYxAB",
            "text": "Authentic Italian Experience in the Heart of Astoria\nWe had an amazing time at Sotto la Luna with our friends — everything was simply perfect! The staff was incredibly friendly and welcoming, and the food was absolutely delicious — just like in Italy.\nThe restaurant has a beautiful setting, with an open kitchen where you can watch the chefs preparing your meal with care and passion. It adds a special touch to the whole dining experience.\nDuring our 3-day stay in New York, we loved it so much that we came back for a second dinner. That says it all!\nCongratulations to the entire team — you made our visit to Astoria truly memorable!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWldVZGFRVnBrVVRneWFGTnNiWHBTWXpSelFWRRAB",
            "text": "the food was great but the service was awful.  impossible to get someone to take our order, get a water refill or pay the check.  and there didnt seem to be any air conditioning in the middle of summer.   it was nicer outside in the 85 degree weather than inside.  overall a very unpleasant experience.  it was obvious the servers were busy and doing their best but they seemed very understaffed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsS1N6aEhXVXRZTUZCR2NtSjVSVWxLUkMwNFdYYxAB",
            "text": "I dined at Sotto la Luna tonight after a friend recommended it. Having worked with Italian cuisine for some time, I was curious to give it a try.\n\nUnfortunately, the experience fell short of expectations. The server was quite serious and seemed disengaged, almost as if she didn’t want to be working.\n\nI ordered a glass of wine and the Carbonara Tartufo, which, based on the online photos and the menu description, appeared to be served with shaved truffles. When the dish arrived, there were no truffles on the pasta. I asked the server about it, and she explained that it was made with truffle oil instead. However, it neither tasted nor smelled of truffle, and the pasta itself was overcooked.\n\nI barely ate any of it and requested the check. The server didn’t ask if everything was okay, despite the fact that most of my dish was left untouched.\n\nIt’s possible I came on an off night, but overall, the experience was disappointing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNU5Xb3diMWhGVlRJeFJtTTRkV0pmTmpoTlNVRRAB",
            "text": "Sotto La Luna in Astoria is a great neighborhood Italian spot. The fried calamari was crispy and fresh, not greasy at all, and the pasta menu had a nice variety—everything from creamy sauces to seafood options. You can tell the pasta is made with care, and the portions were just right. Cozy vibe, friendly service, and definitely a solid pick if you're craving Italian in Queens."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eWNUUTNXWEJ2UmxsWlNXcGhOalpYVFZNeFQxRRAB",
            "text": "I was craving some steak.\nThe ribeye was outstanding.\nMarco & Valerio the owners are just great!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNE5WTTVhVWROVmxWTGR6ZzNTMjVWVUVKc1lsRRAB",
            "text": "My mom and I just had cold subs from this restaurant! We ordered a turkey and an Italian! The owner was so accommodating with the order. They were the best cold subs I’ve had in upper township! Will definitely be going back!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaE1sVlVVbVJuUjNKSmFWbFlUM1pJYTAxcmNsRRAB",
            "text": "Me he dado a la tarea de visitar varios restaurantes en Astoria y este es muy recomendable 👌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWFZsUnROVTl1ZWtOdmJrNW9iSGhqVlRreVJYYxAB",
            "text": "Lasagna was delicious, tiramisu amazing!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvckxETmR3EAE",
            "text": "One of those rainy days when you think, “Going out to eat with my boyfriend sounds like a good idea” and it totally was.\n\nThis place has that pasta they make inside a giant cheese wheel, and wow… it was unreal. We ordered the Diavola pizza too, it was sinfully delicious.\n\nI loved the open kitchen right in the middle, like Netflix, but with carbs. The only thing? The food came out so fast, I felt like I was on a speed date with my plate, Especially on a rainy day, you just want to chill, sip your wine, and enjoy. Don’t rush us out, let the cozy vibes last.\n\nThanks for watch my review and please don’t forget to follow my page for more!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toQ09GZHhTVlpKY0VnMVVVcG5XbFJzWVdFMk9HYxAB",
            "text": "Just discovered Sotto La Luna recently.  I usually avoid eating a lot carbs, but once in a while, I treat myself and this was next-level. The Pizza 4 Formaggi was everything it should be melty, rich, and perfectly balanced. The Burrata e Pomodorini was fresh, creamy with the tomatoes. Every bite tasted heavenly. This spot just became my new go-to for cheat days."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bGMzTTRTV3MyWkdJeFJ6ZHFZMFZuVG1NemJYYxAB",
            "text": "The pizza was really good.\nI hope to see you soon my new friend.\nIt impressed me a place  like this in astoria.\nSee u soon"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUVprOWpUV1U1TUV4UVRrcEpXRTAxTVU4d1MxRRAB",
            "text": "Service and food excellent, bathroom clean, musicians too loud, we will go back...."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCc1YyRlNOMnRaZVdGT1VXUnlVMGxsTlcxWlFXYxAB",
            "text": "Really nice restaurant with great food, service and nice atmosphere.\nMy husband and I had an amazing dinner and we really enjoyed our night out.\nEmployees are really friendly and knowledgeable, a big big thank you to Alessandro for taking care of us and making our night so great and special.\nDefinitely recommended, we’ll be back soon :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMVZIcEhSVXhKVWtWSFRtRkRWRXQ2U21aVmNsRRAB",
            "text": "The place is nice. Has a partially open kitchen. Nice wine selection. However when it came to the main course so much was left to be desired. Plain lasagna. Plain ragu, and a fair tagliatelle with mushrooms.  For the price was not worth it.  Frito misto was good and dessert was good very good cannolis."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKU0dvc3pEemMtNHNnRRAB",
            "text": "We went there 1 pm on a saturday and it was raining they were pretty full. But there is a reason for that, i had mozzarella with truffle, and our group got various kind of pasta. They were all chef’s kiss! Very family friendly place and if you sit at the bar you can watch the chefs cooking. %100 recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdWRWWlpPVGxCYm5aS1dTMXRSa05tZFU1VFdHYxAB",
            "text": "had my birthday dinner here and loved it! some of the best Italian food in Astoria"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJclVqcDJvbTY2ZklnEAE",
            "text": "I look forward to each visit here. Their dishes have standout flavors I recommend. The restaurant is perfectly positioned and cozy inside. About service quality, everyone has been exceptionally helpful. This spot delivers undeniable care."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaanUtTHVnRRAB",
            "text": "비오는날 혼자 런치겸디너"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcWR2Ykt3EAE",
            "text": "For my birthday dinner celebration, we chose this restaurant , and the experience was delightful. We began with focaccia bread and a quinoa salmon salad as appetizers, followed by pasta and a ribeye steak for our main course. Although the initial steak was not cooked to the requested temperature, the chef promptly corrected the issue with a fresh preparation, ensuring it was perfect.\n\nThe food was well-crafted, flavorful, and thoroughly enjoyable. To conclude our meal, we indulged in desserts—Tiramisu and Affogato. The Tiramisu, in particular, stood out as a favorite.\n\nBeyond the cuisine, the ambiance was inviting, and the open kitchen concept added to the overall experience. It is truly a commendable destination for Italian cuisine in Astoria. I look forward to returning to explore more of their offerings."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMUC11TFNubjZIcDRRRRAB",
            "text": "Don't wait for a special occasion, just go (if there is a special occasion, go here anyway). This is a great place to get your fix for Italian comfort dishes.\n\nThe staff are wonderful and helpful if you have any questions or something to pair. It's quite spacious so you wont feel youre too close to another party. As it gets busy, service does slow down a bit; can't blame 'em though.\n\nTheir menus change every few months (not sure how often exactly), so more of a reason to go back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPbVotcVQzcThyUTd3RRAB",
            "text": "Sotto isn't what is was when it first opened. Honestly don't plan to go back anytime soon. Got the Il ragout... It didn't taste right but I didn't want to send it back. Partner got the fettuccine. Pretty good but very very strong flavors almost overwhelming. The high prices just don't seem justified. Dining room maybe 60% full for dinner over memorial day weekend which was strange. Got two drinks - one wine which was $12 and one spritzer.... Wine felt overpriced. The spritzer was good. Two pastas, two drinks... $114. No way I'm paying this again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbDVXM0pREAE",
            "text": "This place is amazing. It reminds me of the pizza I had in Sardinia, Italy. So thin, so fresh, so fluffy. We pairs it with a Tomato/ Mozzarella salad. Amazing. I ll go back to taste the pasta. Real authentic Italien cuisine in LIC. The service is attentive!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaEs2blhBEAE",
            "text": "Everything was delicious and I love that the pastas are homemade! The only critique I have about the pizza is that I wish the crust was crispier, but the flavoring and variety of topping choices were great. The servers were extremely friendly and professional, and the ambiance would’ve been good for either a date or a large group of friends. I would come back to try more of their dishes!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdHJuTUxREAE",
            "text": "For your local Italian spot in Astoria at a reasonable price, this is the spot. Fresh pasta and fresh made pizza in a pizza oven to order; this place is one of the few I will actually eat the crust. The pizza was flavorful and crust a bit soft. The pasta to meat ratio was great with tons of meat, not skimping here! Cute spot with a date night vibes, but nothing too fancy. The tiramisu was also pretty good!\n\nClean bathroom friendly staff. Will come back to try the other pasta/pizza!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MmRxSzlnRRAB",
            "text": "The service and atmosphere here are phenomenal. The food is generally pretty great - the more kinky pizzas with toppings are the way to go as the regular margherita is honestly just not that flavorful.. like everything is under-salted. At the same time sometimes the pizzas will toppings can we overwhelming in flavor.\n\nThe Fettuccine with porcini mushrooms is to die for - highly recommended. The Amatriciana pasta has way too much guanciale for my taste, it just makes the dish so salty. The pasta itself is always amazing.\n\nThe Cacio e Pepe and paccheri cozze are delicious but serving on a room temperature plate causes the cheese to coagulate fairly quickly.\n\nJust a few little thoughts, but the place really is good, and most people will certainly enjoy many items on the menu."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNF9QOUZBEAE",
            "text": "Absolutely the best to go for the most delicious food, great friendly service, and ambiance in the neighborhood. You'll never have a disappointment bad meal. Always great specials and signature taste dishes! Feel special and at home when I’m here. I enjoyed the Truffle pizza, Cacio e pepe, Tiramisu, and coffee. Highly recommend going."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINXZqaG5BRRAB",
            "text": "Very good experience. Came here for my birthday dinner and everything was really good. The pizza in my opinion was the best dish of all. The pastas were good and the sauces were done well. If i had to rank best homemade pastas in the city im not sure this would make the list but would definitely get an honorable mention. The kitchen is open and you can watch them make your pasta. It was very busy when we went and the staff handled it well. Would recommend this place for a date night, special occasion or just a night out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdTd6SnpBRRAB",
            "text": "Sotto la Luna is a hidden Italian gem in Astoria. Definitely check it out if you're in the area. Open space and cute decor. The food is authentic and delicious. My favorite dish was the seafood couscous risotto, and I was told that they sometimes make it with rice. I'm definitely coming back to try the pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibkpmYXp3RRAB",
            "text": "We have been sleeping on this place in Astoria. I have wanted to try it for a while but wasn’t certain they had vegan and gluten free options. But after taking another look at their menu, I have been proven wrong! I went with pizza marinara with gluten free crust and vegan mozzarella and I kid you not, it was the best gluten free pizza I’ve ever had. The crust was “doughy” and chewy and soft. Three qualities that I rarely put in the same sentence with gluten free.\n\nLovely atmosphere. Open kitchen. Good vibes. Do try this place! I already want to come back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOU3A3Nm0zcFl1VTNnRRAB",
            "text": "Great italian food in Astoria. The light at sunset time is very pretty. Of course, food also won't disappoint you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPaUp4dUg1bk9MQ3R3RRAB",
            "text": "Service is very slow at this place. The italian sausage pizza\nis very blend and the miriana pizza does not have cheese on it"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcDZhVEVBEAE",
            "text": "Was a lovely spot for lunch. We’ve been meaning to hit up the restaurants along this complex and we were quite happy with the food and service. Would recommend the Angel and devil pizza and the lasagna."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMajVYVVd3EAE",
            "text": "Took a ride to Astoria to see my friend decided to go for a bite.\nI was blown away...\nThe decor atmosphere perfect fit for a relaxed and delicious food.\nOrder a few things of the menu perfectly delicious.\nSteak tartare and carbonara with black truffle is a must!\nMost impressive for me was watching the chef and his sous chefs glide through the open concept kitchen and do an amazing job at preparing and plating the food. Service on point!\nDefinitely will stop by next time I'm around Astoria to try more delicious food from their vast menu!\nExcellent experience with excellent food and service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MDRyN3B3RRAB",
            "text": "Sotto la Luna is definitely worth checking out if you're in the area. Open space and rustic decor. The food is delicious, the pizza was fantastic & ribeye was well seasoned. Guava Margherita was good as well. The only knock is that the service can be slow, but the food is worth the wait."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNHBmRXVBRRAB",
            "text": "We've lived in Astoria for three years, and this is our first time visiting this restaurant. The atmosphere is excellent, with plenty of space between the tables, and the music volume is just right. Of course, the food is delicious! We ordered a Sotto La Luna Pizza, fritto misto all'italiana, and paccheri cozze e pecorino. The portions are generous, and the service was quick. Highly recommended restaurant!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPeWR2TldOaWNISHlBRRAB",
            "text": "I’m writing to share a disappointing experience I had at your restaurant on the evening of June 1st, 2025.\n\nBefore arriving, I called to ask if a reservation was necessary. The woman I spoke with assured me it wasn’t and said we could come in and be seated. So, my wife, our 3-year-old, and I arrived expecting a smooth experience.\n\nHowever, upon arrival, the manager greeted us with noticeable indifference and immediately asked if we had a reservation. I explained that we were told one wasn't needed, and he began to walk us to a table. But mid-way, he abandoned us—standing in the middle of the dining area—to greet another party of three who had just walked in. He then prioritized them, rearranged tables for them, and only afterward turned his attention back to us.\n\nAs someone who dines out frequently and spends between $300–$550 on weekend dinners—often tipping 40%—this treatment was both surprising and disappointing. I’m also in the restaurant business myself and know how important it is to treat every guest with professionalism and courtesy, regardless of appearances.\n\nThis experience left a poor impression, and I sincerely hope this is not reflective of your overall service standards. If the person we encountered is not the owner, I urge you to address this. If he is, I would encourage a reconsideration of how guests are valued and prioritized."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINHZ6QVhBEAE",
            "text": "Craving Cacio e Pepe tonight, I decided to drop by Sotto La Luna for takeout. Upon arrival, I was warmly greeted by Francesca, one of the owners, who was incredibly sweet and welcoming. She suggested that I dine in at the bar, and I’m so glad I took her advice.\n\nSitting by the bar gave me a front-row seat to the culinary magic happening in the kitchen. Watching the chefs expertly prepare their pasta dishes was a delightful experience, and the ambiance of the restaurant only enhanced the experience. The decor is tasteful, creating a cozy yet elegant atmosphere.\n\nAs for the food, my Cacio e Pepe was served directly from a cheese wheel—an indulgent touch that made the dish all the more delicious. The flavors were spot on, and the pasta was perfectly cooked. Every bite was a testament to the quality and care that goes into the food here.\n\nThe service was top-notch, with attentive staff ensuring I had everything I needed. I’ll definitely be returning with friends to explore more of the menu. Sotto La Luna is a fantastic addition to the neighborhood, offering exceptional food and a wonderful dining experience. Highly recommended!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdE1iRlhREAE",
            "text": "We had a fantastic experience at this beautiful restaurant, full of warm and welcoming people.\n\nFrom the moment we walked in, we were seated quickly, and our waiter immediately informed us about the specials of the day, offering a few spot-on recommendations. We decided to try the bucatini amatriciana, ribeye, and carpaccio—all of which were outstanding.\n\nThe service was top-notch, with attentive staff who made sure we were well taken care of and were very knowledgeable about the entire menu. Our meals arrived promptly and were absolutely delicious.\n\nThis place is a true gem, and we’ll definitely be coming back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaXZQN2dRRRAB",
            "text": "Yummy! Super friendly and accommodating staff here with a very chill atmosphere in the little patio area.\n\nThe lasagne was good. The pasta is made fresh and it shows. This is rich, comfort food which is great but the dish needed a little brightening to knock it out of the park.\n\nThe kids ordered margherita pizza and gobbled down 2 pies. The crust is just a tad tangy and salty. That's probably going to be a bit polarizing but I loved it.\n\nThe lamb ragout was the true star of the show. The pasta was crafted perfectly and the ragout was balanced just right. Sotto la Luna was generous with the lamb itself and I left very satisfied."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyblo2cTB3RRAB",
            "text": "Another sign Working from home is beneficial to the neighbor community. This place used to be dollar store and now packed with various cuisine restaurants. Place is packed with neighbors and other boroughs folks with seating ranging from 2 to 8 and mostly for 4s. We had to get a reservation for a Saturday night because it was packed.\n\nThe service is great. They wipe down your table after every course like a Michelin restaurant does. I am usually messy with crumbs everywhere on the table.\n\nFood wise is okie but can be improved. Starting with the bread, It is free but I think they can do better. They tasted a bit dry but goes well with lots of olive oil. The sangria has like no alcohol in it as we ordered a pitcher. No one felt any tipsy as if we just ordered an expensive fruit juice.\n\nPizza are a little under cooked and wet. They look good but I honestly had much better at the same price range. I wonder want flour they use and please don't be King Arthur.  That's about all the bad stuff. The good thing is great company with my friends and the ambiance is lively with live show from the chefs.\n\nI love the appetizer. Tuna tartar is fresh but missing a little bit like spice? I wish I can get a wow factor but definitely missing.\n\nDefinitely worth a try but I won't say you will to go home Amazed."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaODZfaXNnRRAB",
            "text": "Good and fresh food! I enjoyed the appetizers; we decided to order calamari, arugula salad, diavola (pizza), burrata, among other appetizers. Service was really good, the waiters were always ready even before you asked. Desserts were good, I had the panna cotta; I would recommend to go easy on the sauce and perhaps a raspberry sauce will work better with the panna cotta.\n\nAs for parking, leave early to find one because it can be very hectic but it’s worth it. I will return to try other things in the menu"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMU4yTHpnRRAB",
            "text": "Probably the most underrated Italian restaurant in all of NYC, it feels like you're stepping into Italy with classic dishes with fresh pasta such as Bucatini All'Amatriciana and more. 5 stars! The food is so fresh and incredible at fair prices, it's worth the trip and is truly a destination. Their pizza is also out of this world and holds up against some of the best in the area and beyond, this feels like a gem that has yet to be fully discovered!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoM05hcC1RRRAB",
            "text": "Genuinely delicious - the wine was fantastic, the appetizers were everything you could want, and the black truffle was key. They scrape black truffle onto your pasta and that’s how you know it’s good. The service was prompt and we had a…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKd2ZXOEtnEAE",
            "text": "Definitely worth checking out! Lot of hype surrounding this restaurant and it didn’t disappoint! Food was great! Had the beef tartare (didn’t get the pic of the egg on top though), DELICIOUS! I can go on and on, but I won’t, just go if you can, ambience is great as well!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOTZYdUtREAE",
            "text": "OMG! This restaurant being honest, is AMAZING! One of my favorites places here in New York, is my first time in the city and when I was walking Astoria I saw it and GOD!! The experience and the food 1000% all the people who where working on the kitchen were faboluos (Jairo was making a pasta a literally was ART) and Sofia the server was INCREDIBLE she recommended as everything and was super nice! PEOPLE if you are reading this, please GO to this place!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNHQ3RjRnRRAB",
            "text": "I’m already looking forward to visiting again and already know that I want to try their pizza, other pasta, and tiramisu. I have high standards for calzone because I usually don’t like it, and both my partner and I absolutely loved it here. So far my favorite was the one from Lucali but now Sotto’s calzone has my heart too. I don’t like any other. As for pasta we tried the bucatini with duck that was on the special menu and it was so food. I felt like if my grandma was Italian and making something special for me it would taste like that. Absolutely enjoyed the sanguinello spritz (if you like aperol spritz you’ll love this, otherwise you won’t), and the special dessert of the day was pastiera, which is like a cheesecake but less sweet and it has some orange and vanilla essence to it. I enjoyed it very much and I’m just so glad the neighborhood has a restaurant like this. We were so lucky to walk-in and get a spot at the kitchen bar. The place was definitely packed right after. Everyone was very nice and caring about the experience too. Grazie :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0c0pYTjdRRRAB",
            "text": "This is one of the best Italian restaurants I've tried in Astoria. Whether it's pasta, pizza, or appetizers, everything is delicious. The pasta and pizza dough have the perfect texture, providing a delightful chewiness, and the amount of toppings and seasonings is just right. The waitstaff is exceptionally friendly and proactive. The menu is regularly updated, making it a great spot to visit frequently."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX1l5YmFBEAE",
            "text": "We hadn't made an appointment and we arrived when there was a rush.  once we were seated, we had excellent service. The food was incredible. The pasta is homemade and cooked perfectly Al dente. Even certain items that sound particularly risky (For example, the filet mignon tartar) were incredibly well executed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcGJINGlBRRAB",
            "text": "Truffle pizza was my favorite of the bunch, we got the choice of 4. Starts to get busy around 7. Servers were nice and attentive but did start to rush us towards the end of our meal."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIa1lhNjhBRRAB",
            "text": "Amo este lugar, la comida es increíblemente deliciosa y fresca, la atención es excelente, puedes ver como los chefs preparan la comida. Pedimos el Tartare Di Filetto, luego fetuccine porcini e tartufo (para mi la mejor de todas) y para terminar una Pizza Angel and Devil con Primavera. Super recomendadas las sangrías."
        }
    ],
    "reviews_count": 83
}