{
    "name": "Nisi Estiatorio",
    "place_id": "ChIJtSFIicJfwokR_45-KqmFMQA",
    "grid": "QN1",
    "address": "32-07 30th Ave., Astoria, NY 11102, USA",
    "rating": 4.5,
    "user_ratings_total": 277,
    "phone_number": "(718) 440-9295",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WZk5HZGpkMHRDUlhoWmIyTm9aMFJsTVRJNWVtYxAB",
            "text": "Great place. Great service and delicious food"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xakxXdFdNelpmY1ZkalJHZDJjRXhwZUVwS2JHYxAB",
            "text": "What a delightful dining experience at this Authentic Greek Restaurant, probably one of the best Greek restaurants in Astoria . Definitely the best food we had since we were in Greece . Freshly prepared Greek specialities  with high quality the freshest ingredients."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbGZDZUZBEAE",
            "text": "First and foremost,  we had a great waiter. She was friendly, polite and accommodating.  Ambiance is a  Cute little place with live DJ. I thought appetizer and drink was good, but the reason for 2 star deduction is because of my lobster with linguini and the server that stepped on my toes with little to no reaction when cleaning up the table. Back to the lobster, Just look at the picture, there was no lobster there. Granted linguini is good. But is pasta, its always good. Rib eye steak was good but please refrain from ordering lobster, you are literally just getting the shell. Just look at my picture, looks like i have eaten it but no this is prior to even digging my food. Just look at the sad parmesan. Yea so all in all, i give it a 3.5/5. Probably wont come back, just disappointed with my lobster order."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTlVVZHJkWFF5TFdZNWRFeEJNVzFKVjB4TVdIYxAB",
            "text": "Sometimes you have to remember one word\n\nKISS… Greek food is comfort food nothing “fancy”\n\nAlso keep track of your bill\nThe menu says 20-% for parties  six people or more.. we were 5 and they tried adding 20% gratuity"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUGFGQlpTMkUzV21kU1ozWldkbVZFUW5aVU1IYxAB",
            "text": "We visited the restaurant during Restaurant Week. Our fish was perfectly cooked with an original recipe. Our seafood platter only had fresh ingredients and cooked to the right point. Awamazing wine selection and well-done deserts. We are definitely coming back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMGRuWnZWa3g2VjJSc1NrZExNMnR2ZERWUmFIYxAB",
            "text": "Loved this place for date nights, friends, and fun dinners. Unfortunately found a roach at my drink while at the bar. These situations are disappointing but more disappointing was the staff did not recognize how to handle it appropriately. I know incidents like these happen but I would have appreciated effort to make sure we would want to return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcFNHMVJSbXRyTVU5TVdWbENPVEpFY3pJMWJHYxAB",
            "text": "They told us they get fresh fish flown over all the way from the Mediterranean daily. -_-\n\nWe got the branzino grill and it wasn't so bad and we thought it was reasonably priced....but fresh fish flown in every day from Greece?"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MFlscEROMnAxWjJsMk5EVkNUMXBRYTJWd1RFRRAB",
            "text": "Great food . We loved the lavraki for 2 and it paired amazing with the wine , fresh daily fish .Thank you for the great hospitality and recommendation Kosta , a truly professional restaurant service 👏"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWGRGSklaVFZFY0ZCRFRUVk5kMVZWYzBaNlowRRAB",
            "text": "Over the top in every way:  the way for an experience to be a restaurant, a festival of hospitality and warmth and welcoming aromas, sights, friendliness and ultimate hospitality.  Arrives then the food and drink, not just what you think you may receive, but an incredibly delicious awakening of your palate and senses.  Your smile returns, your glance to your companions awakens their excitement. You smile. You laugh. You become released and you are relieved.  Yes, may I share my multiple layers of amicable delectable bites of the way you can come to love Nisi. Just don’t take our seat!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twS2NtTk1ZVk00VTE5T2JHUnFWVU5PY2tVNWIzYxAB",
            "text": "We came for a late lunch / early dinner. We made it early enough to order from the lunch special. I went with a friend and we ordered different things to try a little bit of everything. The salad was soo good and Spanakopita was delicious. The serving was big enough where we still had a bit left over.  We also had the fish special and the chicken skewers. Unfortunately, I didn't take any picture because I was starving. But I would def recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ad04wbHlkelZXYmtwV1ZUSkRkelp0ZERCRFFYYxAB",
            "text": "Celebrated a birthday here with friends. We had great food, great service, and the staff was very friendly. Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SVRIRndOMHA2WjFSa1JXZHhVVEZsTXkxUlYwRRAB",
            "text": "Service was great, Julian the bartender got us all what we needed to drink before we went to our table.  Everyone enjoyed what they ordered and we ordered quite a bit of the menu between the 7 of us.  The octopus was cooked perfectly, the stuffed mushroom was better than expected, we would definitely return."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIaGFMajJnRRAB",
            "text": "The food and service was outstanding! The restaurant itself is nice, bright and really gave the feeling of being in Greece. It was so warm inside the day that I visited. They were using floor fans to circulate the air which was uncomfortable while trying to enjoy a meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sU09GRkhRVk16WHpSalYxRnBOMkpIYVVKWWNuYxAB",
            "text": "Maria and Pedro were great!! Service and food are amazing! The halloumi and fried calamari were great!! Must have the deserts!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0LXM3UE53EAE",
            "text": "2025 Update:\n\nStill love it here. Do yourself a favor by going for a restaurant week lunch. Fish of the day was absolutely delicious, and dessert was very cute too (some sort of chocolate cookie over some strawberry sauce). I love that they also have pretty healthy options, and I felt like I could have a high protein low carb meal. They offered complimentary bread, which along with dessert is enough carbs for me 😁 As for drinks, I barely ever drink alcohol anymore, but the NA Peroni did the job, especially on a hot Summer day. If I had alcohol, I would totally go for their happy hour 4pm-7pm.\n\nThe only time I haven’t had a great experience here was on Valentine’s like 2 years ago, but I rarely ever love my Valentine’s dinners anyway, especially when there’s a set menu. Other than that, service is usually great, and this is still one of my faves in the area.\n\nOriginal Review:\n\nThis is my new favorite Greek restaurant and hopefully continues to be. It not only is cute looking, but the food, drinks, and service are wonderful. Both times my partner and I visited, we have brought different guests from out of town and they loved it. We recently went for restaurant week with his parents and it was totally worth it.\n\nFrom the time we entered, we loved how warm it was in such a cold day (they had extra heaters inside), and then the music gave it such an ambiance that I felt like we were in some Greek island. This, along with a delicious Nisi Mule cocktail was the perfect start. Our server Dimitra was very nice and welcoming, and so was the manager.\n\nDinner started with some complementary bread that was warm, and olive oil/balsamic on the side.\n\nTzatziki & Tirokafteri spreads - super good! 😋 - my favorite tzatziki is usually the one from BZ Grill, so I’m used to good stuff, and this one did not disappoint, but I was more in love with the tirokafteri (spicy feta dip)\n\nNisi Salad - delicious! We all shared this, even though we knew we probably ordered more food than we needed but no regrets there. The figs in the salad are such a great touch.\n\nSpanakopita - I never had it the way they serve it before (with yogurt) but I usually get this at a bakery. It was sooo good this way! Just try it.\n\nSaganaki - I’m pretty sure we also got this the first time. Everyone liked it just like everything else.\n\nFish of the day - opted for branzino, and honestly, I have never had a bad one anywhere (it’s kind of hard to mess up), but I will say that my partner who had ordered the lamb chops was jealous of my dish lol I didn’t want to eat too heavy and that was perfect\n\nPaidakia (lamb chops) - very tasty, ordered it medium, really well prepared, but I’m a fish person. My partner is a steak person and was still more in love with the fish.\n\nAstakomakaronada (lobster linguini) - surprisingly generous portion, tasty, and made for a perfect lunch when I reheated the leftovers next day (somebody else in our party ordered but I got to enjoy the leftovers and I didn’t have to take a flight)\n\nMosharisia Mprizola (rib-eye) - perfectly cooked, nice grilled flavor, would totally havr this again when craving steak\n\nDessert - we all got baklava to go and even though it was softer than what I’m used to, it was one of the most delicious I have had around, and it made me want to go back next day just for dessert\n\nIt was Monday night when we dined in, so I’m not sure if this is the usual experience, but already have reservations for a popular time and will see how it goes. Yum!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OM05HbE9aMEV6Wm1SeFN6WjBPVlZVWTBKSmNHYxAB",
            "text": "Fish is fresh"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGT1JEWk1iMUU1YkZSWFdEbG1lRGxrVm1sbExWRRAB",
            "text": "Great destination for Happy Hour on a summer afternoon. Some menu items are listed, as well as wine and beers. They also participate in NYC Restaurant Week/Month during July and August."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQ2VpMTNkRTU2TWpkbFpWQkZSMVF6ZDI1blQyYxAB",
            "text": "Loved everything about my experience at NISI.  The host, server and chef who came out were so kind and helpful when it came to pointing us in the right direction.  The octopus was outstanding and the half off wines on Wednesday by the bottle will have me returning soon.  The restaurant was also pet accomodating, which was another delight.  The stuffed mushrooms were my favorite bite of the night and the Nisi salad was the perfect salad for a hot summer night."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTVJsZENOek5vV0RCR2FsTkphRXRCUkc5WmVHYxAB",
            "text": "Greek Food with a twist!  Everything was delicious and fresh!  Service was excellent as well!  Can’t wait to return"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rdFRsTlNjekl4VmpWWFJGQnFaa3QyUVdad1dtYxAB",
            "text": "Absolutely phenomenal - Beautiful ambiance, kind and attentive staff, fantastic curated menu. Extremely talented chefs, from presentation to quality and taste. Big shout out to Maria for creating an unforgettable dining experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTmJraE1TV2QxYzBOalYwWkRkVU5UYURWS04yYxAB",
            "text": "Very tasty food, well thought out menu, great environment. 5 stars all around. The seafood risotto and the stuffed calamari were soooo good. Indoor seating area is very spacious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNFNsZFVTRUZyWlZwVFRXWnFlRGhyU1dsV2MyYxAB",
            "text": "First time here with a few friends for dinner and drinks, the food was excellent everything was on point, the chef came out an introduced himself to us and explained to us all about the way the cooking is done. I  highly recommend this place to anyone that wants to have a delicious Greek meal and don’t forget their desserts which were so tasty."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTFpqUkxPVGQ0Y21WbWNrOW1UREJZWW5kek0xRRAB",
            "text": "Nisi is my go-to Greek restaurant in Astoria. The prasini salad is always fresh and crisp, with a little something extra that makes it truly stand out. If you’re craving a traditional moussaka, theirs is a must-try—the béchamel is rich, creamy, and perfectly done. I always enjoy my meals here, but I do wish they kept the air conditioning on during warmer days. A cooler atmosphere would make the dining experience even better."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQeWw3ZF8xajdyXzhRRRAB",
            "text": "Very cozy place. Atmosphere is filled with lots of daylight yet quaint, thanks to the uniquely triangular layout of the building. Excellent food. Had the octopus app and the dorado special for the main. Lemon potatoes glazed in a brown mustard butter were amazing. Desert, not too heavy, not overpowering sweet. Service was top notch. Music was nicely paired with the Greek theme, upbeat, jazzy, contemporary - not too loud. Very kid friendly. Highly recommended place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeVNsVmhlV3A2YlVodlN6TkJXbEpzT0d4UWFYYxAB",
            "text": "Wonderful food 😋😋 and Service,"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQk1rTmZZVGt5WlVWRmJYTjBVbTFLZGxSRVpGRRAB",
            "text": "We went for dinner without having reservations. We were greeted by a very pleasant host. We were seated at an elevated table next to a window. Greek music was playing and the interior decor would remind one of being in Greece. Our waiter was the most pleasant and jovial waiter we have had in a very long time. It was a pleasure listening to his wine suggestions to go with our individual dinner choices. The service was five stars until the music changed to Pop. This was very disappointing and absolutely ruined the ambiance of the evening. One can hear Pop music at any time but in my opinion, it should not be played in a Greek or Mediterranean restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMQ0x1OEszc002RFRBEAE",
            "text": "Great atmosphere, very friendly owner and good food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJbmp2cGoxcTR1RFRBEAE",
            "text": "Restaurant was adequate\nI’ve had much better food at other Greek restaurants.  Don’t waste a good Saturday night"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNQzFoWlc2eXEtdndBRRAB",
            "text": "Amazing food and friendly service! Kostas was super attentive and had great recommendations. Chef Matheus has a gift and all the dishes were made with super fresh ingredients."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKeWsxcXFDcy1lWkR3EAE",
            "text": "Food is amazing!! Best Greek spot in Astoria!\nMateus &  Kostas are super nice and talent of what they do! 😊"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdWpuSkNUZ2NycVdREAE",
            "text": "I love to come here and sit at the bar, the branzino is unreal and the bartender helped me pair it with an amazing glass of wine. My favorite spot in the neighborhood!"
        },
        {
            "date": "5달 전",
            "language": "el",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPWEQ3TTdtNGYzeXRBRRAB",
            "text": "Excellent food chef Ματθαίος amazing!!! try before you die!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMWFZfWVdEdWYyczJ3RRAB",
            "text": "Stopped by Nisi Estiatorio yesterday to celebrate Mother’s Day with a friend, such a great spot! The food was on point, wine was solid, and the place itself is super cute. Definitely a good vibe for a chill but special night out."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMN2V4UGJVdmFhVGlRRRAB",
            "text": "The atmosphere and food was great. It reminded me like being back in Crete; Greece. My complaint is that one of the waitors was sarcastic and did not warn us not to touch the saganaki plate. When our father touched it, it burned him, and when we told him about the situation, he said in a sarcastic tone, \"I would burn myself as well if I touched it.\" This is unacceptable customer service, and it's not an excuse to be so rude and sarcastic just because we are in NYC. Also, the other make waitkrs were inpatient and rude to us even though a remake waitress was polite and helped us a lot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLanU2OWkxbGJPSzVnRRAB",
            "text": "Cool looking restaurant but there are so many better Greek restaurants in Astoria. Food is ok, not great, not terrible. Service is inattentive and at times borderline rude."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKZllpZWFseU9PNW5RRRAB",
            "text": "The food is always good.The service so and so.It is expensive but you know the food is excellent"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMGVUcDhBRRAB",
            "text": "I’ve been living in Astoria for so long, and I honestly can’t believe I hadn’t discovered this place sooner. It truly feels like a hidden gem to me. Konstantinos took such great care of us, and the whole staff was incredibly friendly and welcoming. Every dish I tried was outstanding—so well-balanced and absolutely delicious. The whole vibe was relaxed and chill. Complimentary galaktabouruko was better than everything Thank you for such a wonderful experience!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMFl6dnJRRRAB",
            "text": "Fantastic atmosphere with authentic Greek music, delicious food, and exceptional service — a truly memorable experience!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcm96QlNnEAE",
            "text": "Best Bronzino , Octopus  and lemon potatoes  in Astoria."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdU11WUl3EAE",
            "text": "Food is out of this world.\nKudos to the chef!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc2FmSXNBRRAB",
            "text": "Stood at the bar. Great drinks are highly recommended."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNTRyUDhnRRAB",
            "text": "i like it"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc3JQeVNREAE",
            "text": "Amazing Greek upscale restaurant! I definitely recommend!! Chef Matheos is the best! He made us an excellent fish platter and terrific desert platter!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LWVQUEd3EAE",
            "text": "Nice meal; appetizers were especially tasty and nicely presented."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURROGNPVG1BRRAB",
            "text": "Great place espresso martinis are great"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRenVqYl9BRRAB",
            "text": "I really enjoyed this place. We had grilled calamari that were delicious, beet salad very good, bread really good, lamb chops with lemon potatoes very tasty, French rose wine excellent as well. The service was great too. I would definitely go back and try other dishes."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNExXczFBRRAB",
            "text": "This place is a life saver. I recently started taking a new medication and felt dizzy and had to sit down. In the blink of an eye, Clare, a staff member who was/is a doctor, attended to me and stayed with me until I got better. Both Clare and the owner are from Greece and the restaurant as a whole feels very home-y. So other than that, how was the play Mrs. Lincoln? Fantastic. The octopus was great, I can’t recommend getting the hummus medley enough, it could feed 6, and the pasta with lobster was great. Overall I’d say the authentic experience, friendly staff and fantastic food are all to die for."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRb05xRndBRRAB",
            "text": "Great food and service. Went to this place for the first time for dinner and the food was outstanding. The food was rich in flavor.  The staff was very attentive and the managers were very professional.  I will definitely come back for the delicious sea food and enjoyable experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnejdHMEJREAE",
            "text": "Swordfish was a little dry. Large portions. Best thing was zucchini appetizer."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbVpXb2dBRRAB",
            "text": "My first time in a Greek place and I can’t stop thinking in this amazing food… I felt in love with the salad, the meat, the drinks… Everything was prefect, even the prices, the place was clean and beautiful for a date. Just one thing, the waiter wasn’t nice, we asked him for a recommendation for dessert and he didn’t show interest in gave us one, no polite but we didn’t take personal. I’ll be back hopefully soon tho :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsM3BLa19RRRAB",
            "text": "Stumbled across this hidden gem in Astoria. It was nice, cozy and beautiful inside. The staff were attentive and welcoming. I enjoyed the service here as they changed plates and met with care.\nThe food was delicious! We had calamari for appetizers. They were a big portion and included some squid pieces. For entree, we had lamb chops. They were cooked very well and seasoned to perfection! Very happy with the food, and the cocktail was made lovely."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsa09uRmNREAE",
            "text": "Came for dinner and had a pleasant experience. The food really stands out, what I would call more high-end than the family-style Greek restaurant common to the Astoria neighborhood.\n\nWe ordered dips and octopus for appetizers - all of them incredible and delicious. Pork chop main was so tender and flavorful, I almost started to gnaw at the bone. Sea bass was cooked well, but did not come with any sides. Side of sautéed spinach was obviously fresh but could have used a bit more flavor.\n\nDessert was delicious I ate the whole thing. Extensive list of Greek wines (try them all!). Recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOHB6RDF3RRAB",
            "text": "Was in Astoria looking for another restaurant that happened to be closed so we decided to give this place a try.  Turned out to be a great decision.   The food here was fantastic.   The service was great and the atmosphere was so nice.   Easy to forget that we were still in the concrete jungle.   Back to the food. It was all so very amazing. The oysters and salmon crudo were super fresh and the octopus was so very tender.   The shrimp was very good. The meatballs, burgers, and sausage were well seasoned and very tasty.  The dessert was very refreshing after a great meal. Everything was super flavorful and delicious.   Great dining experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMWZUeVRnEAE",
            "text": "This was a new Greek restaurant and I felt excited to give it a try! I feel that a new restaurant in the neighborhood should attempt their best to make the customer experience the focus on building their following.  I made a reservation and the hostess had to ask for my name 3x - she wasn’t pleasant at all but just indifferent. The next day, I received a notification from open table that I missed my reservation — which I had to correct. The table she took us to was in front of the bar and not in the main dining room although the restaurant was nearly empty. I was pleased with the service and the food was actually great. As we were having dinner, the bartender was also eating dinner during dinner meal service. Can’t that happen behind the scenes or after hours? Where is Management to figure this out? If the focus is going to be on the customer, the staff needs to be on point and present themselves professionally, especially with their pricing levels. Finally, I thought as a new restaurant, they’d offer a sample of dessert or something different on the house to entice us.  Most restaurants do that regardless. The ambiance was great and I do wish them success but feel they have lots of work to do to improve their service/authenticity. I will definitely give them another try because their food was great. Also, pricing should be competitive with other Greek restaurants if they want to improve their reach and maintain a stronger following.  I think if they improve their management, they will definitely succeed. On my way out, they were cordial and pleasant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5bUpYWXpRRRAB",
            "text": "Service was incredible. The drinks very tasty. However it felt very short when it came to the food other than the branzino.  The The cheese was colds not melty and the crust wasn't flaky at all it felt like something that was pre-made in the freezer. Octopus the large one was okay for the smaller one was very slimy.  The salad was okay no complaints.  Being in Astoria for 10 years and trying lots of different Greek places. It's a nice ambience great place for a date but I'm not sure it would be the place to get the best Greek seafood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OXJUbWNREAE",
            "text": "Very nice place. Very good food. Service was warm and inviting. First time here and definitely will be back. One of the better grilled octopus we’ve had, especially in Astoria. Tomahawk Pork Chop was on point and my wife’s Ribeye perfect. Well done."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM1BxRW9BRRAB",
            "text": "Had an early reservation for Valentines Day, and it was wonderful. Great service, wonderful menu for the holiday, and cozy location. Will definitely be back here again soon. Thank you!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndHJ1am5RRRAB",
            "text": "Went out with my friends for a girls night cocktails were refreshing their Lemon Chicken soup was amazing , and their warm Bread was a great addition. Definitely recommend. They also have a Dj plays all types of genres . Staff was super friendly and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIaExYZ1BREAE",
            "text": "10/10 recommend this place! Everything is so tasty and always cooked to perfection! The grilled octopus is so amazing every single time and the ekmek for dessert is to die for!! This spot never disappoints and the service is always on point! One of my new favorite restaurants for sure!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbnEtR21RRRAB",
            "text": "I had seen Nisi on instagram as a new place to try in NYC and when I saw Greek food, I had gotten excited! I invited my family here for a birthday dinner to celebrate me. The service was amazing! The gentleman assisting us was so friendly, and made sure we were having a good time, even joked with Yiayia. We were a bit upset that some of the options on the menu were not available (we were excited to try to jumbo shrimp with orzo and the gemista) so we had to order other options. At our table, we ordered Saganaki (pictured), Calamari (not pictured), the thinly sliced veggies (pictured), branzino fish (pictured), lamb chops(pictured), ribeye steak(pictured), and chicken (pictured). Overall, all of the food is great however, the two of us that ordered the steak were disappointed by how seriously overcooked the steaks were. The lamb chops were a HUGE hit and everyone loved the flavor on them! All of the food aside from the steak was great! No complaints!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bDZHRllREAE",
            "text": "Had a lovely dinner with a friend here recently. One, the server (Britney) was fantastic. Two and three, ambiance was great, and the food was delicious.\n\nWe ordered one of their shrimp specials as well as the white fish ceviche for appetizer. I enjoyed the pork tomahawk (which was juicy / not dry!) for my entree with a glass of recommended wine. I was informed that the pork would take a bit of time at the time of my order which I appreciated so I wasn't surprised at the time it took. I recommend getting something else if you don't want to wait. Again, service was great - staff was attentive but we didn’t feel rushed.\n\nPricing is not by any means on the lower end of things so keep that in mind if you're price concious but I think the food, atmosphere, and service was worth it and hoping to dine here again soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eWZPdHlnRRAB",
            "text": "This may be my favorite restaurant in Astoria! Food is delicious, creative and exquisitely plated. High kudos to the chef, and also the owner for his attention to detail and training of his staff. The service is impeccable, friendly and attentive. Our water glasses were kept filled. And, Maria, our server, was superbly polished and professional. She treated us like honored guests and set the tone for a perfect dining experience. We can’t wait to return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MVBLMF9nRRAB",
            "text": "Nisi's atmosphere is immaculate--all white interior and the sounds of beautiful Greek music. The service was great too and they were helpful to tell us that the lemon potatoes are vegan! Menu clearly marked to show vegetarian options. The horiatiki salad and the fresh galaktoboureko were my personal favorites. Food on the pricier end, but then again, it's a whole lot cheaper than a flight to Greece..."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOHR5T013EAE",
            "text": "This is a new Greek tavern literally opened a few days ago (February 7th, 2023) in Astoria, at the corner of 30th Avenue and 32nd Street. The location by itself hasn't been so successful for many other renters in the past history, which is weird considering the position of the venue (the prime location in Astoria on 30th Avenue), just a few steps from the train station with the same name.\nOther occupants of the space have included Calexico, Burnside Biscuits, Salt and Bone Smokehouse and Athens Café.\nNISI Estiatorio is a typical Greek tavern with a rich selection of traditional Mediterranean appetizers and main courses (both from the land and the sea).\nI had their grilled octopus as an appetizer. Above all, the food presentation was great, the octopus was served on the bed of fava beans spread, with red onions and roasted peppers (a cute acidic kick). A bit overcooked, but tasty, tender (and not gummy) in general.\nNice execution, chef 👨‍🍳\nFor the main course i selected their mousaka, which was surpisingly served as deconstructed (eggplants and potatoes were grilled, plated and filled with the ground beef, tomato and herbs mixture in the middle). The mousaka was served on the warm plate (👍 for that). That was a nice twist, I personally prefer the classic approach (layered mousaka), but this is just my opinion.\nAlso, eggplants should be less grilled (I guess they have to adapt to a new grill station, since the tavern is newly opened).\nIn addition, they should put an olive oil on the each table (my suggestion).\nThe ambient is warm, gentle, a lot of white color is involved in decoration, the bar is vivid and has a great potential.\nThe tavern still has to be adjusted and needs some final touch, but with a right hospitality approach, hard work and fresh food it has an amazing potential. Smiling goes without saying, it is one of the most important ingredients for the Hospitality Business.\nThe bar can be seen from the street, it is in the middle of the main room, next to the kichen entrance. The main dining room is next door and it is quite spacious (good for bigger parties).\nGuest toilets are way downstairs, well maintened and old school.\nThey have a hostess at the entrance, a lot of staff, the manager is always around, service is attentive and responsive to different questions regarding the food and wines.\nBtw, the wines are almost all Greek, they have only some German mosel in offer, along with Italian prosecco and French champaign.\nThe sellection of beers is more diverse.\nPrices are decent and moderate for this location.\nThey do not serve coffees fyi.\nMy server was Konstantinos and he did a very good job.\nOh, almost to forgot: for the dessert I had their homemade baklava (server's recommendation). Generous serving, freshly made and not too sweet. Frankly, I was nicley surprised.\nOverall, my first impression is excellent. Looking forward to come back and try something different (fish, meat).\nSee you soon, NISI!\nP.S. I gave them 5* in order to support newly open restaurant in my neighborhood, but there is a lot of work in front of them to deserve (and maintain) that level of excellency."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSMkxpSVVBEAE",
            "text": "My very first impression when I walked  into Nisi was 'wow it is indeed like a traditional greek island tavern' with a modern twist in terms of decoration - I really liked the Santorini island minimal black ink hand painting on the wall. Also the fact that it had different levels made it look even cosier. As for the food? I loved  it! All authentic greek recipes and fresh ingredients. My friend Amalia and I tried for starters the 'kolokythokeftedes' (zucchini fritters), calamari and the 'dakos' greek salad, and for main course we got the super delicious tender lamb chops and the pork 'kontosouvli' which was mind-blowing. Of course we had greek wine from the wide selection and at the end, we tasted the traditional 'galaktoboureko' dessert which was great. We were at least for 2 hours and half at Nisi, the ambience was so nice, so welcoming and the staff so friendly. The music on the background was greek and in the perfect sound level so that you can enjoy it and carry a conversation with your friend.  Highly recommended place. In the heart of Astoria and very close to the train station."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWeS1tWkh3EAE",
            "text": "Had a wonderful time there. The staff and management were welcoming and made us really comfortable. The food we order was delicious and drinks were generous. Overall, if you are around this place, this place is something to consider."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcUt1N25BRRAB",
            "text": "Wanted to try the new place with a friend so we came here... (cont)\n\nOverall, a pretty good experience. Service was great. Environment was good, too. It was a gorgeous summer evening and this place is very pretty. They even offered me a mocktail (sober here), which was delicious — I got two!\n\nThe food was probably the only let down here. We got spanakopita and dolmades as starters. The dolmades were okay and the spanakopita was great! Then we ordered chicken and lamb for entrees. (I forgot to get a pic — oops). The lamb was delicious, but the chicken was very dry. Lastly, we got the orange zest cake and ekmek for dessert. I had to send the ekmek back, wasn't the biggest fan if it, but then ordered another orange zest cake and was more than satisfied.\n\nDefinitely expect to spend $50+ per person. Happy eating!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROOGEyc1F3EAE",
            "text": "Appetizers were beyond delish! Octopus and tuna tartar are just perfect 5 stars!!!!...  salmon avocado toast from brunch menu little bland but shrimp orzotto delicious!!! Drinks were delicious 5 stars!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaWI2ZXpnRRAB",
            "text": "Loved my experience here!  BEAUTIFUL restaurant decorated with bougainvillea, felt like I was dining on a terrace in Greece!  The best salmon I’ve ever had with a lovely complimentary spread of thyme-infused olive oil  and tapenade with fresh, warm bread and a glass of Greek rosé!  Very friendly, warm staff, and quick, attentive service.  I can’t wait to become a regular here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdVBXNWtRRRAB",
            "text": "Came here twice. Food was great both times. Service was great, too and the decor was very sleek. definitely had a Mediterranean look. My one qualm would be that they should salt their protein a little more. The salmon I added to my beet salad (I can’t remember the Greek name) was a little bland, but the beets and everything else was lovely."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bVBiTEdBEAE",
            "text": "One of the most beautiful restaurants in Astoria. Love it for lunch, Happy Hour at the bar with oysters, dinner… doesn’t matter! Always great food and great service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxLXVhQ0NBEAE",
            "text": "I ordered their soup of the day which is $10. It was pretty good, plenty of chicken included and hearty but there was a bit too much oil. They gave me a piece of bread with my to-go bag which was a nice surprise. The staff were very friendly and the wait was not long. I look forward to dining in one day."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNzU3VWtRRRAB",
            "text": "Run! Don't walk to Nisi Estiatorio on 30th Avenue in trendy Astoria. This chic yet casual Greek restaurant will transport you to the islands with extraordinary food, cocktails, and service. I love the white interior and comfy chairs along with elevated Greek cuisine."
        }
    ],
    "reviews_count": 73
}