{
    "name": "The Trestle",
    "place_id": "ChIJRRMBFzpfwokRz_IwKtrMbdw",
    "grid": "QN1",
    "address": "34-02 Broadway, Astoria, NY 11106, USA",
    "rating": 4.5,
    "user_ratings_total": 997,
    "phone_number": "(347) 808-0290",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ka1JXaDVORmxQYVhKbk5rZHhaMWxxZFhsbFZWRRAB",
            "text": "Stop in for Brunch food was above n beyond expectations. The chicken sausage with rosemary was the best... the chef gave us some to go on the house. I love the chicken n waffles. The side of bacon was more than the normal 2/3slices"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5a2IydE1lVTU2TTJRNWF6aFRRbmxaYVhGaU5uYxAB",
            "text": "service was impeccable but food was very \"meh.\" dry jerky-like wings, cold fries. i don't like spending my money on \"meh\" so i won't be back here again. Loved the service though!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSE1FSkdMVE5ZUjA1Tlp6ZzVUekpDVjBocU1XYxAB",
            "text": "Trestle, our beloved brunch spot for years, let us down with their awful dinner service. We waited an hour for our food, and it was cold. To make matters worse, we ordered a Club Sandwich with turkey bacon, only to find both turkey bacon and regular bacon on the plate. When we sent it back, the plate was returned to us within minutes, clearly with the bacon removed and not a new sandwich. We left feeling disrespected and overall disappointed. Probably will not be back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNU1IWlZhV2hTUkdodlVuZzRabFZrZVV4NGEwRRAB",
            "text": "Best brunch ever!!!! Amazing food, fantastic vibes, and the most incredible service in Astoria. Isaiah and Mykee made the experience so fun. Will absolutely be back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWlQyNUlObU5xWkU5WU9YbEZjRXA2TmpkbE4wRRAB",
            "text": "Best brunch in Astoria! Kyler and Isaiah made our experience even better than we could have hoped for. We will be back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eGFrZHliVlJEYldod2F6Rk9PR05NUW5sUmRGRRAB",
            "text": "Great brunch selection, great service and nice refreshing outdoor seating. Love this place."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMVpyWklnEAE",
            "text": "Had the French toast. On the menu they do not indicate the French toast is deep fried. I was eating it and kept noticing how there was liquid oozing out of it in my mouth and then I pressed the bread down. It was drenched in oil haha. Just something to be aware of.\n\nNo vegan option."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWlRWWlZkRGRQTFRCRVpuUkVjRGx6VnpSM2RGRRAB",
            "text": "I came to this restaurant for years , because the establishment is in my area where I live . today we came to celebrate two birthdays , which isn’t mothers and my sisters . The staff and manager weren’t accommodating to our needs, nor to the fact that we were here celebrating two birthdays. We have two vegans that were in our party , one requested to have to order sides ‘ that apparently would be in there “dinner menu” . All they could do was express that they are no longer accommodating the customer needs . I’ve come here for multiple celebrations & this would definitely be the last time I would come to this place . for us to have to move things around at such short notice and to have people who came to the establishment literally sit and not eat , is just ridiculous"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMllrbElVVTgwTUhkYWVXRkJURFpDVDBkNmNGRRAB",
            "text": "Was looking for an opportunity to dine at this place. Only in the weekends is this place open during the day so today on a Saturday I went. The place is LOUD albeit with good taste of retro, 90's music and not the modern trash that floods the radio waves so I can rock with that. Place is sized pretty well with an outside seating area and plenty of tables inside the albeit dimly lit bar/restaurant.\n\nComing into the place I was greeted by a blonde woman who seemed to be a supervisor of the area. She directed me to a comfortable seating area and a server took my order afterwards. The place was relatively busy so the wait for my food was kind of in the long range, about maybe 15 minutes. I ordered Chicken & Waffles with Iced Tea and the food was definitely worth the wait. That chicken was so good, a bit on the crisp side but it's solid in taste. The Waffle had such an awesome texture with the right measure of powdered sugar, decorated with Blueberries and Strawberries, the entrée was plated very well. The Iced Tea, I didn't know it was unsweetened so that threw me off but some sugar kinda fixed that.\n\nService was also 'A' Tier. The place was busy so it was a tad on the slow side but they were very attentive. About 3 different servers tended to me whether it was about my order, how I liked it and paying for the bill when I was finished. That's dedication and I always give props to that. I enjoyed my visit here."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaUlyNWxBRRAB",
            "text": "One of the best bars in Astoria."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNelQyVTJSbTFyWm5wQ09VNUhWRzFmUVZoNlRVRRAB",
            "text": "I went to the trestle last night and I was disappointed with the experience. I ordered fish tacos and french fries - a simple order, and my food was received cold. The wait staff was inattentive, even though the venue was not crowded, and there were roaches in the outdoor seating area. I know they can’t fully control the last part, but it was most certainly the “cherry on top” of this poor dining experience. I would never go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVdFIzaHdXbVF5U3pWRE1sZE5aeTF1U0dwdFQwRRAB",
            "text": "Horrible service, no one followed up for drinks; had to follow up every time and 15-20 minute between refills."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRloyUkljVXBrUjA1Q1luTlZSbEE1WTJKa1lsRRAB",
            "text": "I had a very disappointing experience here on August 8th, 2025 around 3 PM. When my sister and I walked in, there was no host in sight, so we approached the bar where the only staff member visible was the blonde female bartender. She was completely focused on her phone and didn’t acknowledge us at all.\n\nMy sister politely approached her and asked if we could sit anywhere, and without even looking up, the bartender just pointed toward the tables. I approached her and told her that her behavior was rude and unprofessional. Instead of addressing the concern, she raised her voice and began mocking our spanish accent, which was extremely disrespectful, racist, and unacceptable.\n\nWe felt incredibly uncomfortable and left right away. No one should be treated like this. It was an unwelcoming and unprofessional experience from the moment we arrived."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBNUxXWllkMjFRYmxKT1VtSXRSbUZRVEhKeFVsRRAB",
            "text": "My two friends and I went to this restaurant for a Friday brunch and were met with an incredibly disrespectful waitress (blond hair and glasses) and terrible service. When we walked in, we waited to be seated and instead were literally waved off by the waitress--who was on the phone--to go find a table. She then took over 20 minutes to come greet us and provide water, even though we were the only seated table at the time. She eventually took our order with much attitude and ultimately forgot part of our order. We weren't even able to flag her down to come resolve this issue even when eye contact was made, until much later. Finally, we were given the wrong bill multiple times and I had to go find her to resolve this issue because we didn't have 30 extra minutes to wait for her to remember to come to our table. When I approached her to split the bill among my party of 3, she became more irritated and expressed \"I'm not sure why you guys can't just Zelle this\" and that she \"doesn't have time for this.\" Although I understand being short staffed can be frustrating, this type of rude and disrespectful attitude was completely uncalled for from the very beginning. She clearly had no intention of kindness in any part of the service and took her frustrations out on customers. We will not be returning to this restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UlRqRXhRVzF0VVdsdFRITm9iR2xpTTJScU1tYxAB",
            "text": "I had a terrible experience at this place due to the incredibly rude and unprofessional customer service. When we walked in, no one greeted us or offered to help. We stood waiting at the front while the woman working was texting on her phone, completely ignoring us.\n\nI politely approached her and asked if we could sit outside. She didn’t even look at me — just pointed outside while continuing to text. I was taken aback by how dismissive and disrespectful her attitude was. It was clear she had no interest in helping us or doing her job properly.\n\nTo make matters worse, I felt mocked for my Spanish accent. The tone she used and her body language made me feel extremely uncomfortable and unwelcome. When I asked for her name to report the experience, she refused to give it. (it was the blonde lady behind the bar with glasses)\n\nNo customer deserves to be treated like this. It was one of the most unprofessional and disrespectful interactions I’ve had. I won’t be returning, and I don’t recommend this place to anyone who values respectful service!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkU2VtWmlXa3RDT0hoSWNHeHdSMjQyVldSSVgzYxAB",
            "text": "Shockingly bad service from the blonde hostess/server. We were the first ones to arrive on a slow Friday morning and were met with a standoffish attitude which only worsened throughout our meal. She was barely attentive, and when she was she was incredibly rude. Furthermore, part of our order was forgotten and we were given the wrong bill more than THREE times. When we asked for the bill to be calculated and split accurately so we could be on our way, she grew even more frustrated and expressed that she “didn’t have time for us”. While short handed shifts and bad days are understandable, her rude behavior was unacceptable and bordered on racist."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVlR6aHNTbVZEVEZWd09URTFha0pQYW10UWIyYxAB",
            "text": "Absolutely horrible service. The blonde waitress not only made several mistakes, including giving us the wrong receipt, but had a very nasty attitude. She was disrespectful and made several hand gestures that bordered on aggressive. A sunny Friday brunch was soured by someone who clearly couldn’t be bothered to care about representing this establishment in any positive way."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUExUZzJhbVZqV0d4b2RubHRkMkZMWkU5MlltYxAB",
            "text": "I love this place they were kind of slow but it was good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbVF6aHRabTAyUVdoSGVIRjNUeTFQYkRsc1VGRRAB",
            "text": "never again …. my hubby and i move into this area about\n4-5 years ago always saw this place so we’re like ok let’s try it …. took forever to seat us ( the rest was basically empty ) …. all the girls was talking to each other in the back instead of helping us get water or orders ….\nfood taste blah not alot of taste"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKelpFMWtSMnhWYW1KNVowY3dRaTExU1dvMlNuYxAB",
            "text": "The avocado toast and the huevos rancheros were delicious! Good coffee. Great service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waFkzQXlla0o0UjBWelRqUnJTVEJ1ZGpoWmIzYxAB",
            "text": "Drinks were good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210d1ZrWXdYM1p1TjJwalozbE1RVFYxWlhCeWFHYxAB",
            "text": "I had a rude experience with a waitress circa 2023 that has left me unwilling to visit despite the close proximity. I am not sure she's still there but can't help bit wonder why they would've hired such a passive aggressive person who is catty towards a patrons that doesn't drink but is happily accompanying someone who does."
        },
        {
            "date": "4달 전",
            "language": "hu",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOR2NFNVhibXRhWVd0UmNraGhRV2RMWTJneWJHYxAB",
            "text": "AZ Homebase"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMFRISjJkelJOTkcxU1lYQlVaRTVRV0ZsUWNuYxAB",
            "text": "Went to brunch here with my girlfriends and we had the best time. We were looking for a \"quiet\" place which is kind of hard here in Astoria. They have outdoor seating and it was just right. We sat there for hours. We had appetizers, drinks and entrees with no room unfortunately left for dessert. But we will definitely be going back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TlZIbG5PRjlNUVZKaWRYQlhaVTA0TjNaQk5YYxAB",
            "text": "Cool aesthetic. Love the details of the NYC subway theme, such a unique atmosphere. Excellent service from all the workers , and good vibes. How ever, the food and drinks were mid. My partner and I both had “eh” reactions to the food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTGRtcHFjVU51ZFVKbFZUTlZaek5EYWtkNFJYYxAB",
            "text": "Wonderful experience. Even the manager Isaiah went above and beyond for my family which was much appreciated. Will definitely be back. Was even surprised to be able to eat with my family on a Saturday night. Also loved the all day brunch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJN01vNFAxbU1Mcm9nRRAB",
            "text": "We did the Sunday brunch here.   Great music with a DJ. Food was really good and I'm very picky with food. Drinks were all great!! Service was exceptional!! The wait staff were very attentive and friendly!! Will come back!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPaXpxYnItcjV6b2RnEAE",
            "text": "Nice place to chill have drinks and good food.  Nice selection of brunch options.\nFood tastes great"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VLM2c5NGFwX0x3YhAB",
            "text": "I ordered a chicken BLT sandwich from this place, and it was a huge letdown. The tomato and onions were cut into massive, unappetizing chunks, and the amount of chicken was embarrassingly small (see attached photo). Totally unacceptable. This establishment clearly doesn’t care about quality. Avoid at all costs."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveThLcUFREAE",
            "text": "Food is delicious"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvN1pIX29nRRAB",
            "text": "Cool spot. Was told train sounds in bathroom. Apparently not first floor. Otherwise awesome place and staff gave us a free shot to celebrate Easter weekend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNk9IV05BEAE",
            "text": "Mikey was amazing made our day! Food was so good and the drinks were amazing!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRclB1eVp3EAE",
            "text": "We got here before the brunch rush really started. KATIE and the rest of the staff were just great and the food was impeccable. Will deffinitely be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndjVuSmdnRRAB",
            "text": "Cool spot great food can't wait to go again. Get there before 12pm and you're set"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaXZ5NWZ3EAE",
            "text": "My husband and I had Saturday brunch here. The staff was kind and courteous. There was a small wait and we were allowed to spend that 5 minute wait at the bar. The music was awesome. It was all the R&B music my husband and I love. The $25 bottomless mimosas, Bellini’s, bloody Mary’s, screwdrivers, white sangria, and red sangria were perfect and you can switch up between drinks. My husband had the buttermilk fried chicken and waffles. Which he said were wonderful seasoned perfectly And I had the shrimp and grits. The grits had corn and bacon with large tail on shrimp. So juicy and delicious. We will definitely be eating here often."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaXN5SU1BEAE",
            "text": "Great spot! Thanks yall"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMVpMQnJ3RRAB",
            "text": "Went here on a whim with my friend to brunch. The menu looked very promising. We were seated pretty quickly. It took us a long 20+ minutes to get any service. We had contemplated getting up and walking out, until the server finally made it to us (we should have left). We ordered an appetizer and few other items—one of them being the Fried Chicken Sandwich. The food arrived about 35 minutes after, all together though which is weird since appetizers are served before the main entrees. When I got my sandwich I started eating it and realized they had my order wrong. They gave me a grilled chicken club type sandwich, which wasn’t good since the chicken was way overcooked (basically chicken jerky) and had a very burnt taste to it—not charred, but burnt. I ate it either way, I don’t like sending food back and creating waste. The only highlight of the entire meal were the fries. The only good side to all of this was getting the check, it was pretty cheap ($30 a person), the coffee was also pretty decent. I don’t think I’d come back willingly."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcWF6eDB3RRAB",
            "text": "We had a delightful time. Our breakfast was quickly served hot and  tasty. The ambiance was just my stlye. There are make-shift bridge decor, train sounds, and train decor. The servers are very attentive.  I forgot to take pictures.  I'll return and I won't forget!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdHNHYXZnRRAB",
            "text": "Isiah was not the vibe!! Refused to change a chanel when no one was watching a game!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOTVuN1pnEAE",
            "text": "Great service, food, and ambience. The challenge was parking, but I knew it might be challenging to find parking. We eventually did. I would go again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMGZIcTh3RRAB",
            "text": "Great food, value and service. Recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcjh1MkxREAE",
            "text": "Friendly staffs, great happy hour options for wines, fries could be improved, fried calamari is fresh but marinara sauce is too bland"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eTdmTml3RRAB",
            "text": "One of the best brunch spots in Astoria, great drinks, great food and great service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2N043bV9nRRAB",
            "text": "Guys the music is toooooo loud. It’s hard to converse and enjoy your food when the speaker is right overhead and volume is too high. I had to put in my loop ear plugs just to be able to cancel out some of the noise to speak to my family. Please - why does every restaurant do this now with the music? It’s not relaxing at all. Food was good but the persistent bass made the whole experience less enjoyable."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aEtIUC1BRRAB",
            "text": "Ordered chicken and waffles and pancakes for brunch. They were really good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOTdxQXR3RRAB",
            "text": "Market fresh salad with goat cheese and grilled chicken YUM\n3 egg omelet with mushrooms spinach onion and American cheese. Thoroughly enjoyed this meal and the atmosphere.  Music was on point from start to finish.  Walked in on Rob Base and DJ E-Z Rock iykyk\nService was great!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzN1lPVXh3RRAB",
            "text": "We had amazing brunch, there steak and eggs was amazing. They are also pet friendly! Would definitely recommend, excellent customer service!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzLWR2SUF3EAE",
            "text": "Playlist was amazing and service was excellent!! Highly recommend the bottomless brunch!! Everyone is so nice and peach Bellini is delicious!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbVlUWXBRRRAB",
            "text": "I'm an old man who doesn't like having to shout over 6 other tables to get another mimosa. But overall this place is wonderful! The staff are top tier."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOXR1VHpRRRAB",
            "text": "Always a great vibe and Banu is the best Bartender!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVb1BXQ0N3EAE",
            "text": "The hostess in front was super nice. She brought us to our table and gave us water whenever we took a sip! Our waitress Ruth and another waiter helped us with our orders. I asked Ruth for a non alcoholic drink and she recommendeded a…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUa2JhUVhnEAE",
            "text": "They had a few things on the menu that I wanted to try, so instead of wondering what if, I placed a large delivery order for all of the items I wanted. Order cost me $106 w taxes/fees and tip.\n\nOrder consisted of:\n\n- Chicken Pot Pie ($~27)  - THIS CAN BE SKIPPED ENTIRELY. Their rendition of the pot pie Included the puff pastry topper on the side, wrapped in foil. The innards of the pot pie were packaged well in a plastic container. The filling wasn't as great as it could be and was further amplified by the chicken pieces, which were not sauteed, but char-grilled. This unfortunately gave it and the creamy broth a burnt taste that wasn't appropriate for this particular dish. Extremely overpriced for what it was, which was essentially soup and a puff pastry side.\n\n- Loaded Poppers - These were good. You get 4 pieces for ~$15. They were fluffy, cheesy and had bacon inside. The exterior is crisped lightly and when reheated in my air fryer, 're-crisped' nicely.\n\n-Beef & Broccoli (~26) - This was probably the worst dish, texturally and when it came to actual taste. Both the rice and beef were gummy and the sauce on the beef had a bitter bite to it that was unpleasant. We took a few bites to give it a chance, but ultimately tossed it. This was also a wildly overpriced dish given it's taste and lack of complexity.\n\n-Fish & Chips - The fish was generously portioned and the batter had good flavor, but it would have been nice if they also seasoned the cod. You could tell by tasting the batter and cod separately that one had been better spiced and seasoned than the other. The fries arrived soggy between the condensation that’s  occurred enroute to being delivered AND the oil soak-through caused by the fried fish sitting on top. Soggy fries, I can try to revive, although not the best, but I can do nothing with oil laden fries, so that took away from the Fish AND Chips experience, but still not the worst of the dishes involved. I would just ask them to pack separately next time.\n\nI attempted to place another order today (5/15)  to try some new items and it appears that the restaurant is no longer delivering food  through any of their 3rd party delivery apps. The only thing that appears on the menu are desserts and mocktails. I called to inquire and the staff said they only deliver on Grubhub now. They clearly too are unaware of this update because in addition to DoorDash, Grubhub also does not deliver food items."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyX1l6Ylh3EAE",
            "text": "Amazing brunch experience, immediately catered to my party of 8 without the slightest hesitation. Food was on par with some of the best brunch spots I've ever been to. The constant music flowing kept my friends and I entertained, overall great brunch experience 10/10. Also shoutout to Trish the manager for checking in on us, in an industry where your customers are vital, she made us feel ever more special by simply introducing herself to us and offering recommendations after. Thank you, will be back soon\n\n-Gavin"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLamVTclV3EAE",
            "text": "Friendly service and for a busy night they still managed to keep our water cups filled and would always check on how we’re doing. The food and drinks were good! The concrete jungle was delicious and is one of those drinks that creep up on you.\n\nDefinitely coming back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodTdqYVhREAE",
            "text": "Went there for brunch on my birthday a week ago... would definitely go back!\nDecor: cute\nMusic: lively and fun\nFood: SOOO GOOD! I've been thinking about those banana walnut pancakes ever since! Also, my friend let me have some of their steak & eggs... steak was cooked perfectly, and the eggs were nice & fluffy.\nDrinks: Bottomless mimosas for 90 minutes were great 👍🏽 this place also has like 5 different drinks that are included!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNHFqNEZREAE",
            "text": "Great spot for brunch or afterwork. Bottomless brunch drinks offered for $20 for 90 mins. The food was absolutely delicious, and the drinks were great. The frosé there is one of the best ones I've had.\nAlso, they have a live dj on Saturdays and Sundays for brunch, so the atmosphere was lively and the music and vibes were perfect!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNE9URG1RRRAB",
            "text": "First time in a Astoria bar restaurant which was a fun experience. I came around happy hour with a friend and for happy hour you get $2 off appetizers, $2 off well drinks, and $2 off burgers. The drink I had was not part of the happy hour but I enjoyed it. It was too sweet but I love the smoothness of the alcohol. I had the fish and chips and the fried calamari. My friend had a frose and the chicken quesadilla. It was yummy. Def go if you’re around the area and it gets packed during the evening."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcmNUbzRBRRAB",
            "text": "The menu is a QR code so I couldn't take pictures of it but I'll write what I remember!\n\nFor brunch: it's bottomless for $20. They have two options for $5 (Mimosa & Bellini) and three or four options for $7 (I forgot what the drinks were for this but I do know there is a red/white sangria option because that was what I got!) So if you do the math, if you get three $7 drinks, it's already enough to get bottomless for brunch! Another thing for bottomless is their sizes are much bigger for the mimosas and Bellinis (shown in pics) where bottomless gets a regular wine glass and the non bottomless gets a champagne flute. We only know this because the server made a mistake and we didn't get bottomless but gave us a bottomless glass by accident..sneaky sneaky! All in all, drinks were delicious. My favorite was the white sangria!\n\nFood was just ok. I got the Eggs Benedict and the English muffin was a bit thin and the spinach on top was messy. For me, half the taste is in the presentation so they lost points from me there. One egg was overcooked and the other was perfect. The home fries were great! My friend got the steak and eggs which were cooked and seasoned well. Overall, food wasn't amazing but let's be real, who goes to bottomless brunch for the food? :)\n\nService was quick and flowed well. Not too overbearing but checked in enough that if we needed something, we wouldn't have had to wait for long."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdnFyRU9REAE",
            "text": "Went here after work with two friends. Drinks and food were amazing. We skipped dessert because we were full. We'll be going back for sure. Be sure to try the chicken sandwich and fried pickles."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1azUtRXpnRRAB",
            "text": "I think that everyone has a different experience, and the coconut mojito is very good. I fix it, I ordered a steak & eggs. that for me the steak stole my attention it was super tasty, everything was delicious but my stomach is not that big. Oh last but not least if you are Latin they have good dir is and good music"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5OUxpQlhREAE",
            "text": "Nice place and good menu. My wife and I went for lunch. My burger was pretty good. My wife’s steak not so much. We got the cookies n ice cream for dessert and they were burnt at the bottom."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbnFmcHlnRRAB",
            "text": "This is not 5-star dining but the experience in combo with menu were 5-star. I came for brunch and I ordered the bottomless drinks, stuffed French toast and eggs. The vibe was calm and nice, yet lively with a dj playing all hits.We had no issue and enjoyed our dining experience and got super drunk! Toast!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPa3JyejhnRRAB",
            "text": "Trestle has the best looking outdoor seating with giant plants, modern style and the best music. It is a perfect spot for brunch, drinks and dinner. It’s one of the best restaurants in Astoria Queens because they know their audience. They have themed froze for different seasons, the NYC metro sound playing in the bathroom and amazing live music like a talented electronic violinist. It’s just a really cool trendy spot. The staff is the best they always make you feel welcome and the drinks are low cost. On top of that they have great specials like Netflix and chill."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxa3QzQ3lBRRAB",
            "text": "This place is super cute, the music is my kind of vibe, the food was pretty good and the bottomless drinks was awesome, I definitely enjoyed myself, be mindful if your doing a bottomless brunch you have a 90 min max at your table. The waitresses were very attentive, tho ours was a bit busy with all the tables she had, another waitress came by to check on us and made sure we were okay and constantly checked if we needed more drinks. I enjoy the fact you can switch up your bottomless drinks with either sangria-white or red, screw drivers etc. The restroom was pretty clean tho I was definitely loosing my mind with the sound of the subway in the restroom playing lol but that was cute and different, below I posted some pictures enjoy !!!\nPs: get there early parking is pretty tight."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHc0wydU53EAE",
            "text": "I came to this restaurant to check it out, … I really didn’t expect the food to be that good!\nIt really surprised me  from that kind of more like BAR LOOK…\n\nThe Onion soup was one of the best I’VE EVER HAD,and the steak was soooo tender and flavorful.\nGrilled at the perfect point!\nAnd the LOADED baked potato…\nIt was DARN good!! With tons of bacon and cheddar.\n\nNOT to mention the GOOD PRICE!!!\nVery Fair!\n\nPLEASE KEEP The CHEF you guys had on the weekend!( I was there on a saturday night!)\nAnd maybe RAISE his salary! He deserves it!!\n\nI will come back for sure! And hopefully the speakers  won’t be so loud!\nAMAZING FOOD!\nHORRIBLE LOUD MUSIC!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPd01fellnEAE",
            "text": "Was looking for a late night restaurant to eat at after watching a movie nearby at Kaufman, and found this place. Had my mind set on the burger before we arrived, but the waitress said the steak sandwich was better, so went with that. Also ordered the Fish tacos and truffle fries cuz we fancy, and washed it down with an Allagash white. They had alot of beers on tap and several large TVs to watch the game. Everything was great and definitely hit the spot!  Check it out if you're in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0eE9McWNnEAE",
            "text": "Went for brunch today. We were sat quickly and approached by server. Food cake out quickly. Food was hot and tasty ! I’m not a toast person but this toast was amazing lol no complaints."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROZ09YckNBEAE",
            "text": "Excellent choice for brunch. I sat at the bar so I had wonderful service opting the bottomless brunch. I ordered the chicken and waffles (without whipped cream) and my date ordered the burger. I remember this dish being better last year when I came, but it wasn’t terrible just a bit underwhelming in terms of the quality and crispness of the chicken. The portion size here is always a plus and the price is reasonable. I didn’t enjoy the sangria (sweet like juice) but the mimosa tasted fairly good and the bartender even refilled our glasses with just champagne during one of our refills which I loved. They play the game in the TV on Sundays which is why we came here and it’s just an all around good staple brunch place. The steak and eggs was great the last time we visited."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMDlHWGdnRRAB",
            "text": "The Trestle is a hidden gem in Astoria, Queens, NY...a new iconic eatery. The atmosphere was energetic with music & sports (on tv), food was varied & well presented with good selection of drinks too. The Brussels sprouts were good but salty, my salad was a LITTLE heavy on the Balsamic dressing, yet I enjoyed my meal plus wine & cheesecake for dessert. The veggie burger & fried Oreos were also very satisfying (we are a sharing family, what?). Our server, Fiorella was the BEST: friendly, efficient & attentive. The occasion was a graduation celebration, where many of the staff AND diners wished me well...how heartfelt! 😍\nThe BIGGEST downside is finding parking in that area but with that aside,  we'd revisit."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpdmJtWUVBEAE",
            "text": "Service and drinks were amazing. The food was not. Burgers on a English muffin, why? Ordered a chicken sandwich that comes on a chibatta that was gross. Doesn't go together at all and Not appetizing. And it was 20 bucks. What a waste. I like their selection of beers though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabHR6Yjd3RRAB",
            "text": "I love the vibes at trestle. One of the best spots in Astoria in my opinion. Always a good time with a hip crowd. They play amazing music inside and the food and service is great too. I highly recommend stopping by."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aWNfLTNnRRAB",
            "text": "We had such a good brunch here! Bottomless beverages with multiple options, including beer for  $25 and 90 min. The music and vibes were awesome. The food was also great. I ordered the huevos rancheros and it came with plenty of sour cream…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbU5fUFRnEAE",
            "text": "Ordered a chicken sandwich, and had the same bad experience with a previous occasion with their chicken n waffles. Not sure why but their chicken is very chew. Expected a nice crunchy chicken breast but instead received chewy fried parts. Even the color is off"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbk03Z0N3EAE",
            "text": "Came here for their shepherd pie and /or their chicken pot pie which I saw on Yelp, come to find out they no longer serve them. So yelps pics are outdated! But we did order whatever else was available, Good all American eats. It was alright…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbXBHdDNBRRAB",
            "text": "Solid brunch menu, I especially liked the shrimp and grits before it was very flavorful. The service was friendly and quick. Nice pub atmosphere, slightly on the louder side."
        }
    ],
    "reviews_count": 75
}