{
    "name": "Snowdonia",
    "place_id": "ChIJ-_hEzDFfwokRCUYJXmi_6g8",
    "grid": "QN1",
    "address": "32-01 35th Ave, Queens, NY 11106, USA",
    "rating": 4.3,
    "user_ratings_total": 351,
    "phone_number": "(347) 730-5783",
    "reviews": [
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvM01UTkdhVTlRVlRGd01XVklPRzlhTFdsNFJVRRAB",
            "text": "Great Burger, great vibe, great beer loved it all. A lot of heart goes into this place and it comes through and so should you."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psQ1pUSXphbVk0YlhWaWVTMHdRVzVUVmtSVGRrRRAB",
            "text": "People flood this spot throughout the day. You can taste the quality in every bite. We were impressed by the affordable prices. Workers combine speed with authentic kindness. I would visit again and suggest others try it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMlpsbzVWbVV5YTFKbFFubEZWMnN3VFZobFJuYxAB",
            "text": "Came at 6.30 and it seemed closed? Door wouldn’t open but chairs were outside with an open sign on the window. I came from wales for this!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OU2JtRkNhMTl4U0RCbmNETjZaWGh0V0cxTVNGRRAB",
            "text": "Snowdonia appears to be open online, but I’ve tried to go there twice (in the heat!) and it was closed both times! Once on a Wednesday and once on a Tuesday after 530. Closed. Ugh so frustrating. The shades are down and the chairs outside are put away. I peeked through the window and it doesn’t look closed you can see tables w plates on them but door is locked.  I will not try to go there a third time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWGIzZzBiRXRaY1ZaNU1XMDNURk5JU2xSblpWRRAB",
            "text": "Wonderful place to hang out and vibe! The owners are super cool, and the atmosphere is super pleasant!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKU0ozN0dzb3JpZHJ3RRAB",
            "text": "First time….\n\nIf you are looking for a beautiful corner spot in Astoria you have to come here.\n\nOne of my favorite things is the view and atmosphere. See trains pass and cars pass by while enjoying your time here.\n\nI met the owners and found them to be very hospitable and I felt welcomed although I had never been there before.\n\nI’ve lived in this neighborhood for about 4 years and I can’t believe it took me this long to try this place.\n\nI will be back for fish and chips again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNX0puSUxrbTZIekJnEAE",
            "text": "Walking into the bar, I could already tell it wasn’t really my vibe. I’m more of a hole-in-the-wall kind of guy—the kind of place with peanut shells all over the floor. But then I saw the owner had two of their dogs there, and that made me want to stick around.\n\nThey had a good selection of beer on tap, and the food was actually really solid—maybe a little overpriced, but hey, it’s Astoria, rent’s not cheap. What I appreciated most was the atmosphere. It wasn’t too loud or crowded, and I could actually have a conversation with my cousin without yelling over music.\n\nThe whole place had a warm, cozy feel. The decor was thoughtful, and even the bathroom had character—it looked like a tiny library. I’ll definitely be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcHBPb0x3EAE",
            "text": "Lovely couple that owns this place. Rarebit was out of this world with excellent toppings, great craft beer selection"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvczRYV2pBRRAB",
            "text": "This is the best bar in the city."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNXIza21BRRAB",
            "text": "I was told the Rarebit Dogs were a “flavor bomb” and “unlike anything I’ve had before.”  Well…they were right! Highly recommend! Loved the Welsh Whiskey too 👍👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdTdDcWNBEAE",
            "text": "This is a review of the 'Pop-up' brunch by Trestoria at Snowdonia.\nI had the Prix Fixe 60 minute bottomless brunch cocktail, starter and main for $42, yes $42, incredible value for money, top notch service, friendly atmosphere and great location.\nHighly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuczl1M3pRRRAB",
            "text": "Great bar, lots of fun events. Fish and chips is a must. New brunch with Trestoria is really yummy, avocado toast and endless mimosas!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeUtIdUhnEAE",
            "text": "Found this little spot, looking for a place to grab an after work cocktail. My initial impression was that it was a dive bar as it gave that feeling. However upon entering, I immediately saw that it was more. Boating some very unique live music and some delightfully displayed finger food. The drinks were a bit under-made, but were not all bad. All in all this little spot is worth a visit if you are ever in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6c3V6aUVBEAE",
            "text": "Waitress was great but the food is seriously sub par. So easy to get bangers and mash right but the yorkshires were just not on point, gravy was a grey sludge and sausages were not sausages but some kind of strange semi-inedible mush.\n\nMusic? If you like ska, you’ll love this place. I wanted Tom Jones, stereophonics and lost phrophets, instead I got a trumpet infested butchering of come on Eileen.\n\nLove wales, this place does not do it justice xoxo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUX3FLd1hREAE",
            "text": "Now that the rest of the bars in the neighborhood are turning into overpriced spaceships, this place is a welcome respite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdXYzTzNnRRAB",
            "text": "Terrific food. They made mushy peas into something edible, which takes some doing. Leek potato soup is to die for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNzlMaVlBEAE",
            "text": "Always happy! I will continue to suggest going there whenever my wife & I think about dining out. (Fish & Chips, WOW)!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlOHR1SXd3RRAB",
            "text": "Love this place. Great mood and always an interesting movie playing. LOVE the food- every burger is delicious, the fried pickles are my fav side, and the mac and cheese is my husband’s usual. I go there for a quick beer, open mic comedy on Tuesdays, and I’ve even rented out the place for a special event (where my guests loved all the small bites on their app menu). Bonus points for a super quirky bathroom which is like a little study/library."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MDcycmNBEAE",
            "text": "Snowdonia is so cool! It's become my local for great food and friendly staff. Others who are there are quite welcoming and I enjoy the atmosphere overall. They recently posted a $10 food and beer weekday happy hour menu which I'm excited about. Check it out you won't be disappointed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNONjR5VGx3RRAB",
            "text": "Tried to order twice for delivery\nBoth times the order never arrived."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaHNfTzl3RRAB",
            "text": "The kitchen is a bit slow for how crowded the place was. The fish and chips were not fresh I'm sorry to tell you. We got horrible diarrhea after this meal. Cool place maybe just for drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGOF9PbkJnEAE",
            "text": "Been here before and really solid food and service. That was about 2 years ago though. Went tonight and service was subpar to say nicely. Took about an hour to get our food which was fish and chips,  with dragon wings and poutine. Majority of it being fried food and not even close to full bar. Gentleman bartender was asked about the dragon wings(different name they gave for chicken wings) and he was a bit condescending stating it wasnt a mystery meat just their name for it. Drinks took a minute to come to us and I was only brought a refill without asking but not my wife. Really hoping this was a one off tonight. Will go back to retry though. The first time was a great experience but this last trip was very disappointing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadmNXaHJnRRAB",
            "text": "As good as it gets in Astoria. Service is solid and the food is interesting. Read a book or two in the bathroom 🫡"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaFAtbVRREAE",
            "text": "Ask for Maggie. She’s the hostess w the mostesssssss!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeHBHOGZ3EAE",
            "text": "Just the best. From the vegetarian bangers and mash to the awesome movies on the screen, this is a real neighborhood gem."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcDZ2aUtBEAE",
            "text": "Snowdonia is our go-to date night dinner spot in Astoria. The food is incredible, the service is friendly and fast, the drinks are delicious, and the atmosphere is welcoming and relaxed. The vegetarian shepherds pie is so warm and filling, but our fav is definitely the mac n cheese! Try everything on the menu if you can!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtOXF2MUtBEAE",
            "text": "One of my favorite local bars.... unfortunately not within walking distance of my house but well worth the effort. They have what you want, whether it's a seasonal draft or a seasonal cocktail or their famous burger! Not super pricey (but not cheap) and they have really really good food. Though its a \"bar menu\", it certainly is cooked with care and as good quality as any of the neighboring restaurants; which, as an Astorian, is certainly saying a lot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcS12dzBnRRAB",
            "text": "I ordered my burger medium well and received it still with a pulse… I was too disgusted to eat this however my boyfriend ate his burger and spent the whole day sick. Stay away from this place. It’s a health risk."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtaTdLZGpRRRAB",
            "text": "Got food poisoning. Burgers are undercooked"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURleUlQNWp3RRAB",
            "text": "The oktoberfest menu is top notch"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1b195TFl3EAE",
            "text": "I just love this place, amazingly friendly and attentive staff, great food, good drinks, they do everything right here, highly recommend it. And if they have the wings absolutely get them."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbWM2NEtREAE",
            "text": "Great drinks and decent enough fries. The bartender/waitress were amazing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPejZMWHd3RRAB",
            "text": "great drinks, open mic comedy was so fun. love this spot!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMjVxb1J3EAE",
            "text": "A true gem in the neighborhood. The specials are always worth a look, but you can never go wrong with menu mainstays like Snodonia Chicken, Shepards Pie, or the Bangers and Mash. The owners and staff are also terrific."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPanNmRkhBEAE",
            "text": "A truly delicious and wonderful experience. I love unique and independent businesses, where you can see the love from the owners and staff.\nThe food is always amazing, try the welsh sampler, it will make you happy. And make you want to go to Wales:)\nAnd for about 15 years my husband trued to convince me that Fish and chips was Awesome! From ireland to San Francisco to maine, nope, ick, not for me.\nUntil Snowdonia, in my own neighborhood! Its soooooo good! You can hear the breading snap when you cut into it! So so good. I get it now.\nVegetarian options are pretty stellar as well, I love the lentil mushroom shepards pie. Wow.\nSuch a gem"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXN2QyU0h3EAE",
            "text": "Loved the Snowdonia Chicken, suggested with a side of horseradish mashed potatoes. Very cool setting, felt like a neighborhood place that is also super welcoming. Our food \"shaman\" as he called himself did a great job of suggesting our meals. Interesting movies playing in the background, fun characters at the bar. Will.come again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXb1B5MTN3RRAB",
            "text": "I feel so lucky that I stumbled upon this gem 4+ years ago. It's my go-to for casual drinks, for date nights, for celebrations, for good days and bad days and for everything else in between. The food is incredible, the vibes are just right,…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNGNpWHdnRRAB",
            "text": "Wonderful service. Wonderful food and drink."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtcW9mQUJ3EAE",
            "text": "Very unique. I can't think of anywhere else to get Welsh food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNTRlVUpBEAE",
            "text": "The best shepherd pie in I have ever had, including one I had in the United Kingdom.  Also excellent service and pleasant atmosphere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdHBLX2FBEAE",
            "text": "This is an awesome little gem! They have a cool happy hour where you get a beer, fries, and amazing signature hotdog with amazing fixins on it for $10.  They were playing Happy Gilmore on the TV and everyone in there was laughing and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbHBUM2dBRRAB",
            "text": "Since when this place is black-owned and women-owned? I used to come here a few years back when I worked in the area and this was not the case. I hope you guys not lying to get people to come to the store. I did have a good experience anytime I went, service was always nice and friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbkw3d2lnRRAB",
            "text": "Fabulous food and service"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2cWNIZFFREAE",
            "text": "I loved the comedy show"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeHNpMVBREAE",
            "text": "The appetizer sampler platter, chilli, were all absolutely delicious. Our server was super kind and friendly. Came on a Saturday at around 2 and it was empty. But it was so so worth it and I’d definitely love to come back. Would definitely."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvajdYdkhnEAE",
            "text": "This Welsh gastropub is definitely one of a kind in NYC. The beer selection is all unique, nothing boring as the most common beer they had was Bell's. None of the basic bud or Miller on tap here, only the good stuff! Only my second time here and I'm hooked.\n\nMark and Jhon (jay-hon?) the bartenders are very attentive and quite fun to talk to, and very insightful about the entire menu!\n\nFood was great, especially the steak frites, those Excalibur fries are fried so well! Tots were an absolute joy to eat, being covered in every Welsh goodie known to man. And I'm not sure what the other things I ordered were, they were like Welsh mozzarella sticks, but they were awesome with the Snowdonia sauce!\n\nBe sure to bring cash, they are cash only, but that's the type of establishment I wanna be at and you should be."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnX2YyMERBEAE",
            "text": "Cute spot for lunch or dinner. The chicken is amazing, paired with a great selection of craft beers. Super friendly and knowledgeable staff!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBaThmTC1nRRAB",
            "text": "Rather than reviewing this place as a bar (that I love), I wanted to leave a review for anyone who is considering hosting an event at Snowdonia. In short - it is an amazing experience. Go for it. We went there with 40 friends and family after our wedding at Astoria Park and all our guests left that day raving about the food, the service, and the comfortable, neighborhood atmosphere.\n\n1) The per person rate for food and drinks is very affordable. They will work with you to meet all your needs - we wanted to switch up beers for the open bar option and that was no problem.\n\n2) The food is delicious, made fresh even for a group of 42, and the kitchen was constantly working to meet the demands. We had fish and chips and each serving came out hot and crispy depending on how fast the platters were moving. The staff is very intuitive.\n\n3) The portions are filling - the avocado salad with side of grilled chicken has enough avocado and chicken for it to be a proper entree. The charcuterie board itself has so many options - loads of different cheeses and meats - it's not your regular-sized appetizer. The rarebits with the different toppings were a big hit and so were the Glamorgans (again, fresh off the oven - no sitting around and getting soggy). The food was truly top-notch and we had a big feast.\n\n4) They are very accommodating about music/videos/movies in the background. Once you go over your AV requirements with them, they will do anything to help make it work. The same goes for seating. It is a small space but they will move around their tables/benches to make your number work.\n\n5) Overall, the kitchen and the staff at Snowdonia do an unbelievable job when hosting for an event. Their service is incomparable because it is sincere. We took the same group to Sugarfreak on 30th Ave for dinner the night before and while the food was alright, it was clear that we were just another big group that they wanted to serve and get out the door. You will never feel that way at Snowdonia."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeE51a1dBEAE",
            "text": "The food is amazing, wonderful drinks and great staff. I'd like to give a special shout out to Andra and Dominique for being absolutely amazing whenever I stop by. 5/5 would recommend."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbWF2X2JREAE",
            "text": "What a wonderful place and service! Food was outstanding. Me and my wife are definitely becoming regulars."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURneF91R2VnEAE",
            "text": "INCREDIBLE FOOD...the Mac and Cheese Burger and Steak Fries Dish....I have no words....just melted in your mouth.....super friendly service, great vibe, and worth every penny!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvbUxtZnRRRRAB",
            "text": "Stopped by for my sons birthday and had a very nice dinner. There were five of us and on server Andres was quite entertaining. The food was very good. We started with the  Welsh sampler and the cockle fritters and we all enjoyed it. I had a…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MExQb3p3RRAB",
            "text": "This is the absolute best bar I’ve ever visited in Astoria. The customer service is over and above. They have a great burger special during happy hour times. Any of the food I’ve ever had has been excellent. The owners are in the kitchen…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNna2Z6TlpBEAE",
            "text": "This is one of my favorite local restaurants. The manager is great super friendly. The food menu changes about twice a year but always remains great. I recommend the fries, tots, rarebit hotdogs, and a good beer. The burgers are great too, many to choose from. As a bonus, the bathroom is filled with take/ leave a book."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbnJ2R3JRRRAB",
            "text": "Our brunch experience started off perfectly as we were greeted by the friendly staff and read through a very enticing menu.  However things slipped when we ended up waiting quite a long time for our order (it was only three of us!).  People who arrived way after us got their food before us which was pretty frustrating.  We weren't given an explanation either but the other waitress did apologize and was very nice.\n\nLuckily once the food arrived, it helped to make up for it.  The welsh cakes were incredible, the french toast with bourbon butter is a must-try, and my friend said the burger was super-delicious.\n\nI am hoping the restaurant irons out the kinks regarding wait time so it can reach a 5 star mark from me.  As a side note, I came here for the bar once and it was a very good experience with a friendly sociable bartender.  Love the ski decor."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVemVpektnEAE",
            "text": "Service is off the charts! They have a Keto friendly menu which is really good. Everything is made from scratch and they use organic ingredients. They also have a burger + beer special for $10 during the week which is a pretty good deal. Andres is the man!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJNHItV1lREAE",
            "text": "I live down the block and really should be going here more often.  Everytime I leave here I'm drunk, full and happy.  Andres is an amazing bartender and he'll make sure you're taken care of.  Beer is great and ice cold from the tap.  Food…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMmJpMGtBRRAB",
            "text": "Welsh food! Who would have known? Such a hidden gem, the food is great for dinner or brunch. Always a great rotating beers on tap. They have a quirky movie on usually. Such a great vibe in this place and the staff is super friendly."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eExDZ3ZRRRAB",
            "text": "Outstanding fish and chips! Fresh cod fish with a light beer batter. An ample portion served with some curious little side sauces and tasty French fries. Not to mention the Beef & Bean chili appetizer with some very interesting bread.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNcjZlN05REAE",
            "text": "I love this small bar/ restaurant for the ambiance and great burgers. Pro tip: get the pickled red onion rings with your burger. I like the rotation of craft beers on tap They always have movies playing behind the bar. It is a great neighborhood spot to drop in for a bite or a drink.\n\nCASH ONLY, but they have an atm in the corner."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRbEl1bm5RRRAB",
            "text": "5/5 for the food and service here! The bartender Andreas was so nice and awesome. He brought the food out quickly, introduced us to the 6 different mustards they have! The atmosphere here is pretty chill. It's clean and looks like a nice bar - I was surprised at their full menu! Love coming here with friends and hanging out. 👻…"
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3MDgtRElREAE",
            "text": "This is my all time favorite neighborhood bar/restaurant. The staff are so nice and makes you feel like home whenever I'm there. They have a wide beer selection the drinks are really good as well. Each night there is a special and same with…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeE9uUzdRRRAB",
            "text": "I love this bar. Great bartenders and good events. But they recently changed their menu (a few months ago) and managed to take off my favorite items, so I have been visiting less. Still, good cocktails and good vibe."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBeE03U2h3RRAB",
            "text": "Possibly the best Burgers in Astoria. It's a bit out of the way, but super chill vibe, great food. Good beer selection and pretty good cocktails. They had a short rib special last time I went that was amazing, coffee and chocolate dry rub, so cooked, melted in the mouth. Wish it was a little closer to my house."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3MFBidkdREAE",
            "text": "Small neighborhood place. A bit dark with a good menu. The burgers are great. It's a custom fresh ground blend with plenty of fat (that's where the flavor is). Good beer selection at very reasonable prices."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZNHZfb0pBEAE",
            "text": "My favorite neighborhood place! Everyone who works here is lovely, and instantly made me feel at home when I moved to Astoria. The food is delicious, the rotating beer is always great, the music is awesome, and the staff is unbelievably kind. I love to bring all of my out of town visitors here."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBMktXV3d3RRAB",
            "text": "A Welsh pub in Astoria with a damn fine selection of pub foods a beer, relaxed environment, really hope to get back here soon."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndXFqaGdRRRAB",
            "text": "Horrible experience! First time ordering from here and I'll never be back.\n\nBurger is over cooked. Fries are cold. Coleslaw is warm. Just totally nasty. AND it took an hour and a half to be delivered.\n\nThere beef blend is also pretty bad. In a place with bareburger and burger club as your competition, you need to really step it up... Especially, for the $16 price point. And for $16 you could  at least do some quality fries, not this processed frozen crap."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcGRYMTFnRRAB",
            "text": "I've been going here off and on since it opened after the Kickstarter campaign.  Always a chill place with good food on the menu.  Beer selection isn't always the best, but there's usually something for every taste.  FYI - they're cash only now."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzdXZUOEl3EAE",
            "text": "So If you like great made from scratch ,made to order food, I mean they smoke there own chicken make there own brisket and sauces. Everything!!. I digress, If you like great food made from scratch to order, Nice people and a friendly…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3aXZ2YjhRRRAB",
            "text": "Great burgers. Great bartenders. I never write negative stuff, but I had a negative experience with their \"Proprietor\" whom I disagreed with on a fairly innocuous subject that was taken way too far for someone who supposedly is an owner. Kind of a shame really. Likely won't be back."
        }
    ],
    "reviews_count": 71
}