{
    "name": "Mimoza Restaurant & Lounge",
    "place_id": "ChIJe5kMylJfwokRy-n5te7zDd8",
    "grid": "QN1",
    "address": "36-05 30th Ave., Astoria, NY 11103, USA",
    "rating": 4.9,
    "user_ratings_total": 366,
    "phone_number": "(718) 673-6360",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOclRWUk1iRlU0U0U1RWR6TjNTMnBzTmxaUFZVRRAB",
            "text": "Nice ,friendly atmosphere , excellent food and service. Our waitress Jelena did exceptional job."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOb1ptMW5lRTUxVUZoQ2RHMHhhVFpGWm1waGNVRRAB",
            "text": "Everything was wonderful"
        },
        {
            "date": "2주 전",
            "language": "hr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNGEyUlFabE5HU0VneU5sOTVSRnBaTVU1a1NGRRAB",
            "text": "Kao kod kuce"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MmJtNWZZeTE1Y3pSaFIzaGlNbEZyYkhkMVprRRAB",
            "text": "Always great time at Mimoza. Excellent food and great staff. Jelena 🔝🔝🔝"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTVNHaDNUMGhXVVRGWVVHazFSVU4wTlc0emRGRRAB",
            "text": "Amazing place, with great traditional balkan food, especially their Goulash was 5 star. Our waitress was Jelena, great personality,  and great food suggestions."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsd1JIaFRSbkZuYWxkcFluVTRURVEyVUZkVU1sRRAB",
            "text": "Food was amazing, and Jelena provided great service throughout the night."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUFh6Vm5SVmgxVldOdmRrMXRORk56ZFhKSldGRRAB",
            "text": "Just had brunch and had the best server, Marijaha. The food was amazing and the service even better! Looking forward to coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nM1ZIcDZZa3R4VFZoNlpFaHNUbUptUlVkaFpIYxAB",
            "text": "This was my second time at Mimoza and once again the food was excellent. We ordered ćevapi  (being from the Balkans, we really miss food from back home) and these did not disappoint. The servers were very friendly and attentive, and the restaurant itself is kid-friendly, which made the whole experience even better since our kids enjoyed the food too. Overall, a great place for traditional ex-YU dishes and a really nice atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSblJURk9VbDloZFRVdE5VWjRYemxEUVhGWFRIYxAB",
            "text": "Decided to try this place after seeing it for years and never going in. Everything was absolutely amazing. Food - crazy good. Atmosphere - fun. Marianna, our server - so sweet! Can’t wait to bring my family back and try more of the menu!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUFIzUkNjMjVXZURGa09VcEdSMVJ6VDFaUlluYxAB",
            "text": "Mariana is the best! And the food is so authentic and delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toM1NUZ3hSVGRHUzI5VU5FaG5OMkpJWjFkQ1dYYxAB",
            "text": "I had lunch here on Saturday and Jelena was the server and never stopped smiling with everyone even though it was very busy she tried to please everyone"
        },
        {
            "date": "1달 전",
            "language": "bs",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM2RucHZUelpGV1hscVdrMTBPRFl3YTNreFZVRRAB",
            "text": "Hrana je odlična! Sve preporuke, kao kod kuće! I sve pohvale za Jelenu, predivna je i kuva najlepšu domacu kafu 😃"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVE1IRjFNRlF3Um5CU1ZHaDJhMDlUVUdkMFRFRRAB",
            "text": "The food was delicious and the atmosphere very welcoming, but what truly made the experience special was our server, Marjana. She was extremely attentive, kind, and professional, always checking in to make sure we had everything we needed. Her warm personality and excellent service made us feel very comfortable and well taken care of."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwYVMyNVFOeTFyUkRSUFFrZE9lVzFKTms1U1luYxAB",
            "text": "Cool place and good food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWb09XMVdhMUpXVnkxQlJHeFpjSGRFYVZCS2RVRRAB",
            "text": "Best place to go and be with friends or family, the food was so delicious....recommend on a 100%"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUWFrOHhTblZ4YkdGbE4zSXlTaTFyUkZZdGNFRRAB",
            "text": "What a great spot! We came to New York for a day from Boston. Wanted some Balkan food and one of the best I ever had I loved it. Marijana was our server and she was absolutely amazing. I will definitely go back to Mimoza."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRVFrdHlWbU5tTVRSRlJtaEhhbHBaVFc5VGJFRRAB",
            "text": "We had an amazing experience celebrating a surprise bridal shower here. The service was really good and fast, thanks to our wonderful server, Marijana. Jelena was also very helpful.\nMarijana helped a lot in keeping the surprise a secret and made sure our reveal went off perfectly.\nThe food I'd recommend includes the homemade Burek, which was a must-have, and the bread, which was freshly made. All the grilled meats (the lamb chops and New York steak) were cooked just right and served hot. The space is nice for private events, and we're so glad we chose to celebrate here!\nAnd a big thank you to Mike for being so accommodating. He let us use the party area for the surprise party and I was able to communicate with him easily even though he was out of the country."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCZ2NtLXFBRRAB",
            "text": "Still is everything beyond about the food and service…just keep it like that and I will always be your customer 👍🏻"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMFkyNUxiRlZyYVcwMWVFdHJTV052VVRSRWRYYxAB",
            "text": "Jelena was amazing! Thank you"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWVlVbDVhazR3ZFdkSFlsazVOWEJ4WkZoWE9HYxAB",
            "text": "I came here with friends a couple of nights ago and had the best experience, our server Marijana was amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SaGNYRTVaVk5pWDFsQ1ExSk1SbmxHWWt4ZlJsRRAB",
            "text": "Great food, love the mix of Balkan and Italian food. Our server Jelena was amazing. She went above and beyond to take care of us and make sure we had a wonderful experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMFJFaFJVRWxLU204dE1USklVMGMzUlRoNVMwRRAB",
            "text": "Visiting from Boston, had a great time with Jelena our server,exceptional service, great attitude,very sweet, very knowledgeable about food!!Always ready to take 📸 and make us feel welcome!!\nWill be visiting again end of November!\nMimoza is a must visit for amazing atmosphere and great tasting balkan food 😋 👌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SGNEWkhXSFZsV205dlNWSmFOVXRsWVhrM1RGRRAB",
            "text": "Amazing place!! Great food, atmosphere and service. Both waitresses were amazing ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTVpHZHNlRTVzYmpreU4xUmhhMk5mTUVvd1IzYxAB",
            "text": "We loved the food here ıt was delicious...the service was outstanding..specially we enjoyed  the turkish coffe"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acWMxSmZNMDFHZGt0ck1tNXphMVk0YjJwc2QxRRAB",
            "text": "The best . The food was soo good I got kevapi my family got burger and burek it was so delicious. Our server was Mariana she was great and sweet"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTWVWWnBjbWgyUld4eWExVmtlVlo0TFZGV1kwRRAB",
            "text": "The best restaurant with the best food. All the food is very tasty and tastes very fresh. Our server mariana was very sweet and the best server definitely recommend this place!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWmEwbHlhR1JIZGpOQmFFMXZjVFF4WjAwNFZYYxAB",
            "text": "Marianna was an amazing waitress ! Very nice and great service !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OR05FUkRjRWRRVFRSeE1IbFRNbXd4V21GMFZWRRAB",
            "text": "The server Marianna was very sweet and super friendly. We enjoyed our lunch, the food was delicious and tasty. This is our second visit to Memosa restaurant, and we love the place.\nThank you!\nLuiza."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSFNUTllUV1oyYzFCVGJqTlhZVTluYlZFNVdHYxAB",
            "text": "I can’t say enough good things about Mimoza Restaurant! I find myself here almost every day, and each visit just gets better and better. The food is absolutely amazing – every dish is bursting with flavor and made with the freshest ingredients. Whether I’m in the mood for something hearty or a light bite, they always have something delicious to offer.\n\nBut what truly sets Mimoza apart is the incredible service. The staff are not only friendly and attentive, but they also create a warm and welcoming atmosphere that makes you feel right at home. It’s clear that they genuinely care about their customers and take pride in what they do.\n\nIf you’re looking for a great place to enjoy fantastic food and exceptional service, look no further than Mimoza Restaurant. It’s truly a delightful experience every time I visit, and I can’t recommend it highly enough!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUFV6QkplalJYTkdGVVJrTmpTMll5ZHpWdFRVRRAB",
            "text": "Food was amazing, Jelena did a great job!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTE16WlVXRlo1ZFdaSU1WZE1jVUl6VFhsVFNVRRAB",
            "text": "Love Mimoza- food was excellent and our server Jelena was super friendly .  Definitely will return ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kM2RYUmxUV3h6ZEhoaVNrcGZVM3B4TTA1QlowRRAB",
            "text": "My husband and I had a Groupon for Mimoza and it was such a treat. I’ve never tried food from\nMontenegro before, but it was so unique and delicious. We tried a traditional salad with feta and a tomatoes and cucumber that was so refreshing. We got another dish similar to a Greek Spanikopeta (mine was spinach and my husband had beef), but it came as a whole phyllo pie. It was amazing. My husband got a dish more familiar, penne all vodka, and the sauce was so creamy and flavorful.\n\nNow for the service, I could not speak highly enough. Jarlena was so attentive to us throughout the meal, and made recommendations to teach us about the menu. She was very friendly and eager to please. I’m looking forward for bringing friends and family from out of town to try this restaurant with us!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twek0wSTJhMjlyVEVoaGIyRnpPRmxyVUhGTlRtYxAB",
            "text": "Amazing food , amazing service Senad , Helena , Alex great team and amazing atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3dE9EQlJSRUV3YTJSSFUwWXdjbXRLU21WVWIxRRAB",
            "text": "Nice place great service but food even better."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwc1IwaHBhMFJtUkV0Vlp6SnVOWGxRYVhWdVVuYxAB",
            "text": "Azra was great !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUlZUVjVlWGhuWTFaaFYwTlpiM1J5V1hGTVdtYxAB",
            "text": "The food was amazing I'm definitely coming back here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UFVIUlpjMEpxWDBoalNGUk9aMWR6UTJsQ1EzYxAB",
            "text": "Excellent experience! Excellent variety of Balkan & American food. Excellent service.\n\nThank you Azra 😊"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUGQxWjVVMTlLVkhST1VXcFJka1pMWDNKNFEyYxAB",
            "text": "The food was good but the waitress was bad. The first time we went, we had the best waiter on Saturday night. We came on Sunday, and the waitress got our order wrong, forgot stuff and she added different things that we didnt order, and on top of it had an attitude. It is up for debate if we return."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNVlqVnVPR2QwT0hKRFJHdEVMVWxHT0dkUmFYYxAB",
            "text": "Very nice place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxU05UQlRUa05JY2tabVVHSXRTMGQ2YUhsWU4xRRAB",
            "text": "Great drinks great music, love the aesthetic. Great options of food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWWNucFNaMlIxYVU1eFowTTBaRTl1UlVSRlRGRRAB",
            "text": "Azra is a great waitress and the service was great"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOWFU3S0xTaUpPbkdREAE",
            "text": "A hidden gem in Astoria!\nMimoza is a Mediterranean dream come true — from the moment you walk in, you’re greeted with warm hospitality and the inviting aroma of freshly prepared dishes. Every bite feels like a trip to the sun-kissed coastlines of the Mediterranean.\n\nThe ingredients are fresh, the flavors are rich and authentic, and the presentation is simply beautiful. Whether you’re craving grilled seafood, vibrant salads, or homemade specialties, Mimoza delivers with heart and soul.\n\nHighly recommended for anyone who loves quality food, cozy atmosphere, and a touch of elegance in every dish. A new favorite in the neighborhood!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYkZqTTJSMzZmMkxREAE",
            "text": "Best place to enjoy nice Mediterranean and Balkan food and music. Staff is great, and food and service are amazing. I traveled to more than 50 countries around the world and especially Mediterranean islands, and I can say that this place brings the real vibe of that part of the world. Burek and ćevapi are especially good, and you have a feeling like you are in the middle of Bosnia or Montenegro or some Greek island. Always when my travels bring me to NYC I come to Mimoza to get that feeling of home so you wont regret if you go visit them. 10 out of 10."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQbWwtX0hsbW83QzhRRRAB",
            "text": "I went there on Saturday with two friends to watch a game. We were originally seated at a table, but the staff invited us to move to the bar for a better view of the TV. As we’re sitting, the older server named Senad came yelling at us rudely to not sit down because people behind us were complaining.\n\nWe didn’t argue we just tried to return to our table with our drinks still full in our hands just to see that they had already given our table to other customers so were left standing awkwardly in the middle of the restaurant with nowhere to sit and no help from the staff.\n\nWe had to ask for the check and to make things worse, they charged us in full for the drinks we had just ordered and barely touched.\n\nUsed to go there sometimes for the Balkan food but definitely never going back again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQaUVsTEN5bXFXeE93EAE",
            "text": "Food was delicious, reminded me of my trip to Belgrade 💕"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNMjBqNlNidnZENllBEAE",
            "text": "Came for the first time a while ago for a family and mother's day dinner and was automatically introduce to a great atmosphere from the server Jelena. Jokes were told, the service was above and beyond and the food was delicious. Definitely recommend to anyone who loves Balkan cuisine or wants to try something new in the area."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZmJ4dEhiMWJHZ0FnEAE",
            "text": "Food was excellent and service was even better.  Jelena went above and beyond expectations.  I recommend this restaurant for everyone.   Thanks 😊"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLX2l3LTY4MGNIY0V3EAE",
            "text": "Long overdue review. Stopped by this place by accident and I was more than pleasantly surprised. Food is amazing and staff is super helpful and very knowledgeable. If you are not sure what to order, ask Jelena :-)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKbm1rcmFIeF9LOW5RRRAB",
            "text": "Mimoza isn't just the best place to get authentic Balkan food but food and fun in general. The minute you arrive you’re treated as VIP. Outstanding service regardless of who you are. Thanks to Mike and his exceptional leadership!! The food is fresh and flavorful and vibe is always positive. Great ownership.. great team! You won’t be disappointed!! 👍🏼👍🏼"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPUFVxcjNxNlkyNDlRRRAB",
            "text": "Azra (waitress) was \"Sensational\"!!!! her charisma & charm is so beautiful, such a nice dinning experience I had with my mom's home attended, I wanted to take her out as a thank you for taking care of my mom that passed away 2 years ago. I highly recommend!! The food was so delicious..I had the flat meatballs and my friend had crepes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOTdYeXFBRRAB",
            "text": "Loveeeed the restaurant! Food was really amazing...tasted like home. Lamb chops were so tender.  Service was top! Jelena was always there making sure we have everything and even made us real Turkish coffee. We will definitely be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM091cUdBEAE",
            "text": "First time trying Mimoza and it was wonderful! The server, Arza, was extremely friendly and attentive to us. All the servers and workers at the restaurant provided excellent service, which made our visit a very pleasant and enjoyable experience. Food was tasty, atmosphere was cozy, and the service was amazing. Highly recommend, also try out the octopus when you come here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bDdUbXNnRRAB",
            "text": "My wife and I had a great experience here. We came in for lunch and throughly enjoyed our cabbage sarma appetizer. The bread here is outstanding! For our mains, we each enjoyed the mixed grill and ali pasha schnitzel. Service was excellent, waiter was very nice, attentive and thoughtful. Great place!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURud1B2NHZBRRAB",
            "text": "Don’t sleep on this Astoria gem. I’ve been craving cabbage rolls ever since I had them in Poland and Mimoza has the most delicious cabbage rolls . Served with a creamy mashed potato and swimming in tomato sauce, this was my favorite dish. The tuna tartare was good too, very generous serving on top a bed of avocado. The lambchops were a bit bland with salt and pepper and served with grilled vegetables and mashed potatoes. I got the chicken schnitzel which was served with an amazing cabbage salad. Service was perfect and the restaurant itself was beautiful. Will be back for the cabbage rolls.\n\nDecember 29,2024\n\nOne of those places you tend to gatekeep… this Balkan restaurant in Astoria is easily overlooked by their humble exterior. Inside, I always order European cabbage rolls with mashed potatoes that taste like the ones a grandma made for me in Poland. Their rib eye steak is so tender I almost cried the first time I had it and their mixed grill was easily top 5 best kebab/bbq meat I’ve had ever.Prices are onpar with other restaurants on the block and with the amount of food you’re getting with the mixed grill it’s easy shared with 2."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXFMOTNRRRAB",
            "text": "Absolutely DELICIOUS food, great drinks, and phenomenal service. Azra was was so attentive and kind during our whole dinner. Will be back here all summer long! Thank you team mimoza for an amazing dining experience"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMWGMtY2FqaU1QSmNREAE",
            "text": "Five Stars All Around!\n\nWe had the most wonderful experience at this restaurant! The atmosphere is warm and welcoming, the food was absolutely delicious, and every detail felt thoughtfully curated. The [insert favorite dish] was a standout—so flavorful and beautifully presented.\n\nA huge thank you to Azra, our amazing server, who was incredibly kind and attentive throughout the evening. And to the owner, thank you for being so sweet and thoughtful—it truly made the night even more special.\n\nYou can really feel the love and care put into every part of this place. We’ll absolutely be back soon!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQR0hxTVc0dC1EOGVnEAE",
            "text": "I love Mimoza restaurant . Starting from food, service to atmosfere, place is unbelivable . Our server Azra was absolutely amazing. She is very kind and super funny. Want to have grest experience, ask for her. I give 5 stars!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdjZDdnVBRRAB",
            "text": "Wow what an awesome place.  The most amazing family run restaurant in the area.  The food is mostly Balkan but they have several American favorites.  The pulpo is fantastic and bread is homemade.  We loved it so much we went back a second day for brunch.  And true to its name it has the best mimosas.  A MUST try!!!"
        },
        {
            "date": "5달 전",
            "language": "hr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOck85OV85d2Nya3RBRRAB",
            "text": "Odlična usluga.  Uslužila nas je Jelena koja je bila izuzetno ljubazna. Teleća čorba i rafaelo kolač su nam favoriti a jeli smo i mešano meso. Doći ćemo opet sigurno😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcHU3VHJRRRAB",
            "text": "One of the best Balkan restaurants I’ve ever been to. Authentic Balkan food, very tasty. The staff is very friendly and welcoming. I highly recommend this place to anyone looking for a new place to try or anyone who wants to try Balkan cuisine! Amazing!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYkVtLWFmb2NfRFBnEAE",
            "text": "I absolutely love this place! I’ve been couple times and had amazing experience each time. The atmosphere was warm and inviting. Our server Jelena was exceptional: attentive without hovering, genuinely knowledgeable about the menu, and enthusiastic about sharing recommendations. It felt like we were being hosted by a friend who just happens to love great food. The food is absolutely Delicious 10/10 for each dish I had tried so far. Definitely recommend this place and will be coming back soon. Thank you Jelena 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYM2J6V2ZnEAE",
            "text": "EVERY SINGLE THING on that table was fabulous! I mean, there's always something that's better and something a bit less good when you order out. I swear, I was like a kid in a candy store! I didn't know what to eat more, first, last...it was amazing. In front of me is lamb, and there are also lamb chops above my plate. They bring it to the table in those skillets, and it basically cooks in front of you. I mean, I've seen food being served on skillets, but it was more to keep it warm than anything else. This was cooking right in front of us on those skillets. My friend had a ribeye, and it looked great, but I didn't try it. My potatoes were delicious, and the mash was just like we make it at home. The mushrooms were soooo good! Even the veggies were great! I'm not a fan of calamari ever since I got food poisoning in California, but these were excellent! Crispy and the sauce was delicious. But the bread....oh. my. god. It was soft on the inside and crunchy on the outside...pure perfection.  I took it all home to eat today. I worked in a 5-star restaurant on sea and I had some delicious food all over the world. But this dinner...probably the best one I ever had. On top of all that, they treated us like royalty. It was an exquisite experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyemVlYjdBRRAB",
            "text": "We love this place. Everything is always fresh and delicious. The menu offers a variety of options so you will always find something you would like to eat. Owner is very nice and staff is very professional and welcoming. We’ve been going there so much we cannot get enough of it. Highly recommended!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPbVA3WTJpMFpySDFRRRAB",
            "text": "We stopped by Mimoza Restaurant for dinner last night. We ordered two drinks and tried the ćevapi and meatballs. Both dishes were quite successful. The ajvar that came with the meals was very delicious. We really liked their warm bread. The waitresses were very friendly and helpful. Overall, it was a good experience, aside from a few issues.\n\nI don't want to skip mentioning the problems. The cigar smoke from people sitting at a table outside gave me a headache. When I got home, the smell had clung to my clothes. The second issue was that the waitress didn’t bring us any water. Service should have started with water, but we only received the drinks we ordered. Another, and in my opinion more important, issue was that the waitress didn’t speak English. Yes, we live in New York and there are thousands of people who don’t speak English, but if you’re working in a restaurant, you should at least know enough English to understand what “rice” means.\n\nOther than these problems, everything was fine. I will definitely visit again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbDd2OTBBRRAB",
            "text": "If you're craving authentic and delicious Balkan food, this restaurant is an absolute gem! Every dish bursts with traditional flavors that immediately transport you back to the heart of the Balkans. The ćevapi were perfectly grilled and juicy, the ajvar tasted homemade, and the fresh bread was warm and soft—just like back home.\n\nThe atmosphere is cozy and welcoming, and the service was friendly, attentive, and fast. You can tell they take pride in both the food and the experience they provide. It’s rare to find a place that gets everything right, but this one truly does. Whether you're Balkan or just someone who loves great food, this spot is a must-visit. Five stars without a doubt!"
        },
        {
            "date": "7달 전",
            "language": "hr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aGRuYkxBEAE",
            "text": "Vrhunska hrana, usluga, atmosfera, sve! Ćevapi bolji nego doma 😍 burek savršen! Svaka čast 🙌🏻🤍"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNy03WF9nRRAB",
            "text": "We had an amazing experience! The food was delicious and the service was absolutely fantastic. Our server Jelena was incredibly kind, attentive, and made us feel very welcome. Everything was perfect — thank you, Jelena!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQT20wOTdObGRUbFN3EAE",
            "text": "Had the most amazing dinner with the family at Mimoza’s. The food was amazing, the grill for two steak was made to perfection, cevapi always a winner, the best surprise was the roasted pepper, what amazing sauce. But the experience was made only better by our gracious host Azra, who was so lovely and had the best recommendations."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc09tOE1REAE",
            "text": "This place deserved more than 5 starts. The food is freshly made and delicious. The owner is always present and takes pride in the quality of food and service.\n\nIf you’d like some home made food that’s fresh and delicious you found the right place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtM3JIbWpnRRAB",
            "text": "Came in for the first time during a snowstorm. They do not have a liquor license yet but the location is very pretty and the food is delicious.\n\nI had the Sarma with mashed potatoes and fresh made bread. Not the best photo of the food because I was hungry and dove right in.\n\nJazz was my waiter and taught me all about the cuisine.\n\nMy first time having Eastern European/Balkan but will be back for sure."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbjZyUFlREAE",
            "text": "Delicious food! Staff was very friendly. Owner is a wonderful man. Don’t be shy, say hi to him! Great space for a brunch/dinner or if you are planning a party. Enjoy!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyd2R1YVB3EAE",
            "text": "This place has literally the most delicious and authentic Balkan food in NYC. I’ve been to many restaurants that serve similar food but this place just has the right recipe and it feels just like home. I stopped randomly when they first…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaLWRUcW9BRRAB",
            "text": "We had the spinach and the feta bureks and the cevapi.  All so delicious.  Freshly made, piping hot out of the oven.  The fresh bread for the table was so very good as well.  We will return for sure to try other menu items too."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZak9iSEdREAE",
            "text": "My sister booked the private event area in the back of the restaurant for her small wedding celebration and it was the best decision she made! Everything about the restaurant was great - the communication with the owner Mike prior to the event - the help he provided made the process so smooth. On the day of the event, they had the tables in the back set up in the way we wanted them to be for the event and we got to decorating. It's nice because there's also a small outdoor area too which is a plus. We had a mix of appetizers, mixed grills and drinks. The appetizers were so delicious (cabbage salad highly recommend!). The mixed grill was good too. Can't say much about the portion size for an individual since we had enough for our group of 35 but 100% shareable.\nThe two people that also made the event run as smoothly as possible were Senad and Jelena- they made sure each one of the 35 guests were taken care of and all their requests were attended to! Their happy and welcoming spirits made the entire experience better.\n\nI've been back at Mimoza for a light dinner or just for drinks as well and always had a good time. I'd definitely check it out - especially if you're looking for some great balkan food :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMHRMbURREAE",
            "text": "There is nothing much to be said for this place.\nEverything is more than it should be.\n\nFirst of all, people who work at this place are really COMMITED to their job and they welcome you like you are at home.\n\nFood is really delicious and it brings you a wonderful feeling for every sence.\n\n(I don't eat ajvar and cabbage, but with cevapi you get those on the plate, I removed them) The plate looks more rich with those! 😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobzlIM3N3RRAB",
            "text": "Mimoza Restaurant and Lounge has superior Mediterranean and Balkan dishes all made fresh in a welcoming, modern space. Must haves are the homemade Burek bread stuffed with cheese or spinach, tuna tartare, and juicy lamb chops alla Mimoza!…"
        }
    ],
    "reviews_count": 76
}