{
    "name": "Le Petit Pêcheur",
    "place_id": "ChIJAz89JjRfwokR1OhDY_AWoj0",
    "grid": "QN1",
    "address": "40-17 30th Ave., Astoria, NY 11103, USA",
    "rating": 4.9,
    "user_ratings_total": 186,
    "phone_number": "(347) 808-0124",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcVRFODVhRlJRWTBoSVZVMXJSMGxOV1VWTldtYxAB",
            "text": "Excellent seafood. Would go back no questions"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUFVUVTVOR2hyVEd0eGFuSktjMDlaVkRSdGEyYxAB",
            "text": "First of all, it's a great restaurant that doesn't serve alcohol. The small but very clean atmosphere allows me to see and choose my seafood, and I can even customize the cooking method, which is satisfying. The food tastes two thumbs up. It's not greasy at all, and the light flavors are balanced with a variety of seasonings to create a fantastic flavor. The garlic butter mussels and sautéed swordfish is phenomenon. Grilled calamari, clams linguine pasta, grilled asparagus, and lemon potatoes were all excellent. Staff is friendly and attentive. I'd love to visit again, and I'd recommend this place."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMVkyNDNVVkpPYjBWa2FsUm1kRVJTZDJsMU0xRRAB",
            "text": "You pick your seafood by the pound and then choose how you want it cooked: grilled, seared, or fried. Food was tasty. Prices reasonable."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNFlWcHZOalJtWVhkSVRraGlNRVpzVEhOeU5FRRAB",
            "text": "Fresh from the sea to your plate—you pick it, they cook it"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5d2MwbEthbkJEVFdkc2JURjZNSHB0TUhKU04xRRAB",
            "text": "Le Petit Pêcheur – A Hidden Gem in Astoria Worth the Voyage\n\nWhat an absolute treasure this Algerian family-owned restaurant is! From the moment you walk in, you can feel the warmth of genuine hospitality and the pride they take in every dish.\n\nWe feasted like royalty on a whole grilled snapper—beautifully seasoned, perfectly charred, and large enough to feed four of us comfortably. The broiled swordfish was equally outstanding—succulent, flaky, and kissed with just the right amount of smoke.\n\nThe linguini with shrimp and clams in a red sauce was fantastic—rich, aromatic, and bursting with flavor. And the Calamari Provençale? Hands down the best calamari we’ve ever eaten—tender, flavorful, and absolutely addictive. Even the octopus, often tricky to master, was melt-in-your-mouth tender and grilled to perfection.\n\nBeyond the incredible food, the service was as lovely as the meal itself—warm, attentive, and effortlessly gracious.\n\nLe Petit Pêcheur offers extraordinary quality and value in a relaxed, easygoing atmosphere. A true culinary gem where Mediterranean soul meets New York charm.\n\nThis is the kind of restaurant you want to tell everyone about—and also selfishly keep to yourself."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQ1pqRXhWVlpKZEdGWmNVTjFlVkl6WjBSbFlrRRAB",
            "text": "Grilled fish and scallops 👍👍👍"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ablJtVkNTV2xpVUZsVlMxZHlSM0pCZGtjNFlXYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nLe Petit Pêcheur is a hidden gem in Astoria! The seafood is incredibly fresh from the grilled branzino great side to share everything is perfectly cooked and full of flavor. The atmosphere is cozy and welcoming, and the staff was really nice and friendly. It feels upscale but still relaxed  the kind of place you’ll keep coming back to. Highly recommend! 🐟✨"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCb1QwWXRjV1I0ZGtSR1NHSm9abkZIUzBKd1pYYxAB",
            "text": "The fish was so fresh and cooked perfectly, I would just say they go very light on the seasoning here. The service could also use some improvement, nobody came to take our order for drinks or sides until I had to get up and ask. Overall very good quality seafood and tasty!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS1JrUlVka3hIWkdoQk1rVnZMVjgzTXkweGRVRRAB",
            "text": "fab from start to finish.  lovely passionate staff, delicious seafood made to order.  do NOT miss the fried sardines, or grilled scallops. beautifully prepared and we had shrimp, sea breen and oysters. soooo fresh.\nspicy feta dip was incredible. yes, there is no alcohol; we had a martini on the way; and enjoyed pellegrino plus algerian sodas. can’t wait to go back. still thinking about the fried sardines."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOR1JWOVRUamxRVGkxcmFFeDBlakZGV0hGR1pGRRAB",
            "text": "The food here is incredible, it’s fresh, great array and uniqueness of spices (but never too much), not oily and when you leave you feel so energized (best tell tale). Best of all, the staff is just top notch, including the owner Matin, who is just a pleasure. Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBelRFWTBTRzFmTlRNMk1VWkNXWE50VEdwcGEyYxAB",
            "text": "The staff were great, and the seafood looked super fresh, but the execution on the cooking just didn’t deliver. I’m also not sure what makes it “Algerian” since most of the menu feels more Greek. The Belgian fries were basically thin hand-cut fries with some oregano, salt, and pepper, they weren’t crispy at all like traditional Belgian fries. The shrimp were cooked perfectly but lacked flavor, and the fried calamari wasn’t crispy at all. On the flip side, the Branzino was excellent—cooked perfectly, deboned for you, and honestly better than anything I’ve had at the seafood places in Astoria. The Branzino definitely stole the show. I will give this spot a 2nd chance."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWGNXVjVSRTFaZG1NNGVGbFdTbEkxWVU1NmJXYxAB",
            "text": "Love the food service is excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMlRVTnlPWEE1ZG5ZeWNtUk5UVVV5Y1RRd09WRRAB",
            "text": "The food in this place is simple delicious!!\nVery nice environment for families!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psQ2VsSmhZbGhQWDJrMVZGRllRMHhZZG04ME0wRRAB",
            "text": "The best seafood in Astoria (high bar, there are many spots!) and one of the best in the city!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MVdGQldkSGxLYTA1a1IwRXhNRVZaZVdZeFZHYxAB",
            "text": "Excellent. Fish was fresh, service perfect, food was delicious and healthy 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOblUxOUdiRkpmV0dsMWIwSjNOMGd0ZDIxWFJGRRAB",
            "text": "Great food and great service! Prices are pretty good too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcFRFSTNaRmsxTldGbVpFY3hOVVUyTVdsSE0xRRAB",
            "text": "The man at the front very kindly explained how to order at this restaurant.\n\nThe calamari, mashed potatoes, hammis (with garlic bread on the house) and the sautéed monkfish were all amazing and the flavors were balanced expertly.\n\nWould come back!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psc09UUlFORTV0Wlc1bWRXRlBNVTQ0WVRsT1duYxAB",
            "text": "5/5 experience! I’ve been here twice and ordered the Ecuadorian shrimp, branzino, whiting, seafood pasta, sardines and marlin. Every dish comes out perfectly seasoned and not fishy tasting (some fish can be too fishy even for the seafood eater)! There’s also a $20 lunch special during the weekday which comes with your choice of seafood fillet/shrimp, side and soda. There’s also sides to choose from and salads to buy.\n\nThe service also includes bread on the side (no charge) and the service here is attentive. I didn’t even have to say to make sure to bring all the food out at the same time - it happened automatically! I highly recommend this local seafood restaurant and for sure will return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJME5DMTBWMDV1UkRZMFFqUTNVakp0VG1OM09GRRAB",
            "text": "Le Petit Pêcheur – A Mediterranean Jewel in Astoria\n\nTucked away in Astoria, Le Petit Pêcheur has quickly built a strong reputation since opening a couple of years ago. Known for its fresh fish and Mediterranean flavors, it combines a market-style approach to seafood with the warm hospitality of a family-run restaurant.\n\nAtmosphere & Setting\nThe restaurant captures the essence of the Mediterranean with its blue-and-white décor, reminiscent of seaside towns in Greece, Algeria, or Sidi Bou Saïd in Tunisia. The space is cozy, often buzzing with energy even at off-hours. On our visit for a late lunch around 2:30 pm, we were surprised to find the restaurant almost full, a clear sign of its popularity with locals and regulars alike.\n\nHow It Works\nThe experience begins at the fish counter, where guests choose from a selection of fresh seafood and fish on display. The staff then asks how you’d like it prepared, grilled, fried, or sautéed, before you return to your table to explore the menu of side dishes, salads, and drinks (including Algerian famous Hamoud Boualem). This interactive element sets the tone: simple, fresh, and personal.\n\nFood & Flavors\nThe menu isn’t extensive, which is often a positive sign, it focuses on doing a few things exceptionally well. It features a mix of Mediterranean staples and Algerian specialties that highlight fresh ingredients and straightforward cooking.\n\nSeafood Selection: We tried jumbo shrimp grilled, whiting fried, flounder sautéed, and a small portion of Portuguese sardines marinated in-house. Every dish was cooked with care. The shrimp were perfectly tender yet slightly crisp, the sardines packed with flavor, the flounder delicate and well-seasoned, and the whiting golden and satisfying.\n\nSides & Appetizers: To complement the seafood, we ordered \"Hmiss\", a classic North African dish of roasted green peppers, tomatoes, and garlic served warm with a drizzle of olive oil, a simple but deeply flavorful starter. The grilled asparagus added freshness and balance, while the garlic bread (likely complimentary) was a welcome touch.\n\nService Flow: The dishes arrived quickly, perhaps a little too quickly for such a spread. Next time, we’d request staggered service to savor each fish one at a time. Also, tables for two can feel tight if you order several dishes, but staff remain attentive, checking in frequently to make sure everything is to your liking. Even the owner stopped by with a smile to ensure our meal was going well, a gesture much appreciated.\n\nService & Hospitality\nFrom start to finish, the service was warm, professional, and efficient. The man at the counter explained everything clearly, and the servers maintained a friendly balance of attentiveness without hovering, hospitality is one of the restaurant’s strongest assets.\n\nOverall Impression\nLe Petit Pêcheur is a rare find: a place where the food is fresh, authentic, and consistently well-prepared, and where the atmosphere evokes the Mediterranean coast without pretense. Between the vibrant décor, the interactive seafood counter, and the outstanding dishes, the restaurant offers a dining experience that feels both unique and welcoming.\n\nWe left more than satisfied, already planning to return. This is a spot to recommend to friends, family, or anyone looking for a taste of the Mediterranean in Queens.\n\nVerdict: Highly recommended, especially for seafood lovers who appreciate simple preparation and authentic flavors."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prM2VHeDJTMDVDZVhZMmVFbFRSVlY1ZDFGRFRHYxAB",
            "text": "Amazing food and amazing service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVFJETXpNMmhIZFU1NGREVTNXbGhxT1hCUlprRRAB",
            "text": "This was my second visit to Le Petit Pecheur, and once again, they truly exceeded my expectations with their incredible food options, delightful flavors, and wonderful customer service. The Salmon, lobsters, and shrimp were grilled to perfection, and the hummus dip with pita bread was simply out of this world. My best friend and I were fortunate to be served by Douglas, who is genuinely one of the kindest and most attentive servers we've ever encountered. Thank you, Douglas, for making our birthday dinner date not just enjoyable, but truly special. We're already looking forward to returning and creating more lovely memories soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSlJFdDFiemhSWkdGaFZucERWV0UyYkVNek4yYxAB",
            "text": "Not bad I don’t taste really good food the fish like broiled"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U2VVRnNWM2hqWkhRMFRrbFZWbE5pWXkxS1MzYxAB",
            "text": "The food is exceptional! Everything we had was delicious and seasoned perfectly . Roasted eggplant dip, lemon potatoes , grilled branzino, baked clams, fried calamari, sautéed shrimp. Even the garlic bread is delicious and great to wipe up all the delicious sauce ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWZldYaEtXVUpuTm1sNFRtaHpVWGhzWWs1VVVIYxAB",
            "text": "This place handles details well. Restaurant personnel display sincere warmth. This place gets everything right: price, quantity, quality, and service. People here don't put on airs. This place has distinctive qualities!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UVMxRk5RbVl6WDA1TVQwRTNVV2RwZFZWWlJYYxAB",
            "text": "Amazing seafood option, the squid is our favorite."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaGRWQnhObk5OWjJZd1NuSndSV05PVDFwM1JrRRAB",
            "text": "The service and food were superb and the staff was very friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxR2FGWXpUblkwZDA4eWRtMVhkRk0xVlRoZmRsRRAB",
            "text": "SO GOOD! I come once a month since my discovery and I swear this place has the most inexpensive and delicious seafood I’ve ever had! The complimentary garlic bread is just chefs kiss with all the sauce from any entrees. Highly highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRdGRHaHNabXBKVG5WcmNVdEJhbWRUUkMxU1gxRRAB",
            "text": "Lovely staff, cute place, reasonable prices. This is a casual place- no alcohol of any kind, plastic bowls, order mains at the counter. Service was efficient, nice variety of fish served grilled or fried (including 2 kinds of sardines). We had a good time and left full and happy. (Views of a gas station, it would be nice to have curtains)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxV1duQnlOSEpUU0Vac1NscDNlR2wzWmxsWFgyYxAB",
            "text": "Fantastic and great prices. You can feel the love in the food. Super fresh seafood and healthy sides. Feels like you are in the Mediterranean."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRlJqWnBiblpNUnpkbE5GZHRSemRHVmtOc09VRRAB",
            "text": "The atmosphere and food were just perfect, I highly recommend this restaurant which has reasonable prices and perfect quality of service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeVV6ZGpORU5MWjFsTVJ6TndXRnBYT1hOVGEyYxAB",
            "text": "Amazing restaurant. Loved everything"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SelJUZzJRM2hDUVU0eVEwYzFiRVJvWVU1ek5sRRAB",
            "text": "Excellent service and hospitality, fresh seafood and very reasonably priced. I would definitely recommend this place. Can’t wait to go back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SWJUVTBVMlZDTVVaMmIwZHNOMEZJVnpGdWEwRRAB",
            "text": "Went here for dinner with my family for my daughter's birthday. Service and food were impeccable!!! Everyone enjoyed their meal. Fresh and tasty."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preE1GQllUblJEY1VSUE9VeHNTRTlPTVRObU5rRRAB",
            "text": "It was one of the best sea food restaurant I have been in nyc. Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R1lWQnVjMjB6U0VrNE56VjRMVWROZFhreFVFRRAB",
            "text": "What an amazing new spot. The snapper was great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSM2FETm9OVkJDY25WZmVXSnpSemwyYkZwYWNIYxAB",
            "text": "Casual dining joint. Fish was fresh and delicious and the servers were very knowledgeable. Had the monkfish sautéed and it was delicious. The rice and vegetable side was simple but delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdmR6QlBZMlpvU2t0TWNrSjJNbkI0YUhaUVRsRRAB",
            "text": "If you are looking for fresh delicious seafood I highly recommend this place. I’ve had the salmon and calamari. Both were excellent. I suggest the asparagus and lemon potatoes as sides. Employees are very sweet, friendly and appreciative of your business. This part of Astoria needs this kind of restaurant and I hope they continue to thrive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cb2NrTjZiMmhmVUhKcVYyODFZbkJVY0ZSd1FrRRAB",
            "text": "One the the best seafood places I’ve ever tried, great service and clean space\nFresh fish, amazing appetizers, Hamis was like the original one, bread forget about it, delicious\nMy son doesn’t like outside food, guess what, he ate 3 pieces of whitening fish, the bourek was so filling and the shrimp was cooked just well, this is gonna be my favorite place for seefood, we drove over an hour to eat there and it was worth it , highly recommend it, ps prices so affordable"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeVJHOTNZa0YzV2pSUlpGQkxaamRvTTBkSFlYYxAB",
            "text": "Jeff, Stacy and Hunter are here last night and LOVED 🥰 it!  Mateen and wife, Nina, took GREAT care of us!  We will be back Tuesday!  Our new favorite place!\n\nWent back AGAIN and was every bit as delicious as last week!  👍👏"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKclNGaFpkeTFxTnpkQlgxbElUM0V6V0hKa01IYxAB",
            "text": "Quite possibly one of the best seafood spots in NYC. We got the grilled red snapper, mussels, fried calamari, asparagus, lemon potatoes. Everything was PERFECTION. The red snapper was so juicy and flavorful. The mussels with their white sauce is a must have. I will be seeing those mussels in my dreams."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sa1VqbFFMVm94ZFcxVWNtMUdNRzVQYVcxUlNHYxAB",
            "text": "Food was delicious! Love the personal Algerian twist to the seafood! Everything they brought out felt like it was cooked with the highest quality and products. We enjoyed every single bite and can’t wait to return to continue trying everything else out on the menu.\n\nNot seafood but would definitely recommend the roasted eggplant! Trust me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OYVUwaFpTVkpJZWs5c1YwNUtNRXRJVlVWWmFWRRAB",
            "text": "Everything here is so delicious! A little different flavors than we had before…great seasoning, very fresh all their seafood"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcldqSklkVlpoVWxGUVJXNVpXV0Y0WTFOamEzYxAB",
            "text": "Ordered a bunch of grilled fish. Cooked perfectly! The seafood soup was fresh and a great value."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aS2JsQk9OalpxTWt4d04xZGpibHA2VnpGc1NWRRAB",
            "text": "I was completely impressed with their professionalism and customer service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wc01sOXZTV1Z0YkVwVk9YVnBWVFl5TnpaUWNHYxAB",
            "text": "Food was excellent, delish!  Owner was helpful in explaining where the different seafood is from.\nSo fresh!  So good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSS1gwUXljelEzV0dwU2MwbGthbWd5YVRod01sRRAB",
            "text": "Amazing food, full of flavors! Will come back soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ad05qaFVTbGxmUkVWeGVUUlhkWFZPY25kSFQzYxAB",
            "text": "Not only was the food amazing, but their mint lemonade was so good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWVprdzNaVkJWYVZrNVRVdHFSbmRRWTBKTWJsRRAB",
            "text": "My new favorite place!\nLove the food, all very fresh.\nFriendly environment.\nPrices are reasonable."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFdFRFNXlabHBFVms1eVZFMTZaa0oxVEdKNVgzYxAB",
            "text": "It was OK! 🙁 I really wanted to love this place and it does have its merits. I can tell it’s a mom and pop spot and there’s love. Food was tasty overall but there were details that were enough not to come back. Hamido is definitely a better option. Here’s why 👇\n\n$7 for one potato cut in four pieces 😤\nRubbery tough lobster tail 😭\nChairs that are falling apart? 😕\nFlies hovering constantly 🪰\n\nSpent $100 or so for an OK dinner for two."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RVMwMVhVSG8zTWxOUWVHMW9TMWhDVUd0QmNuYxAB",
            "text": "You pick out the exact piece of  fresh fish you want and then you tell them how you want it cooked\n.  Then you order your sides and what not at the table.  It's great tasting fish and food and excellent service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMk9VWm5UM0JsZVVKNmVXMUpabXQyZGpsdk5rRRAB",
            "text": "We had dinner two times in this place and is amazing!\nThe seafood is delicious as well as super fresh!\nWe recommend the grilled octopus, the grilled and fried calamari but also the shrimps!\nThe restaurant has a beautiful environment, we love the service and it’s a must try if you are in Astoria!\nWe will come back there tonight!\nAmazing the owners!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSeFFsTlhkakZyVVZKM1QzcEJjWFZ3TVY5U2VGRRAB",
            "text": "Fresh - that's what you can expect from their seafood selection. The atmosphere and thr vibe of this place makes you feel relax. Great staff with top notch service. Though I wish they have alcoholic cocktails 😉. Definitely a must try place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNEwzTVRBEAE",
            "text": "The food was fresh, perfectly cooked and the selection was phenomenal!\nService was outstanding\n\nFried calamari was cooked to a golden crisp, tasted very savory with perfect seasoning\nThere was another way they cooked the calamari but it was just as good!\nGrilled shrimp, AMAZING!\nthe bread was a meal in itself and very delicious.\nClams are outrageous and the lemon potatoes, my goodness!!\nDon't forget the sautéed spinach!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTlVVdEVTamxzVG5aV1RucHhSbEUzWVhKT2RFRRAB",
            "text": "Disappointed for the following reasons:\n1. No lobster and limited selection of seafood. Mind boggling at a “seafood” place\n2. Too many flies\n3. Waiter got our order wrong, forgot items, charged us for said forgotten items and took too long to get us our bill.\n4. Shrimp definitely overcooked. Rubbery.\n5. Way to pricey for having above issues."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcktlY2hBRRAB",
            "text": "If you love fresh seafood, this place is an absolute must-visit! The quality of the fish is out of this world—you get to pick your own, and they cook it exactly how you like it: grilled, sautéed, or fried. Every bite was packed with flavor, and you can truly taste the freshness. On top of that, the service is exceptional—friendly, attentive, and knowledgeable. Whether you're a seafood lover or just looking for an unforgettable meal, you will not be disappointed. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbzh2WVR3EAE",
            "text": "This place is a wonderful addition to the neighborhood and Astoria! The fish is great and the sides are perfect! Went in for brunch with my parents and we were lucky enough to grab their catch of the day, which was a 4 Pound bass! It was as tasty as it was massive! Friendly staff, clean environment and great seafood! Will be coming back very soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueklldkdREAE",
            "text": "Let’s start with the inside of the restaurant because it feels like you traveled to the Mediterranean for a meal. I placed my order which was a Bronzini, Scallops, and Basil Garlic Mashed Potatoes. The service was efficient and I didn’t wait long for my food. The flavors of the fish, how it was seasoned, and the freshness were all top tier. I was very impressed for a new restaurant to deliver like that and I look forward to visiting it again very soon. It’s my go-to seafood restaurant now."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdHViMUVBEAE",
            "text": "This place is a must visit in Astoria. The value for the money is unbeatable. I ordered the branzino and it far surpassed some of my favorite spots in Astoria. The level of flavor they achieved for such a delicate fish was unmatched. The swordfish my boyfriend ordered was also seasoned well and cooked perfectly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuem9PaDFnRRAB",
            "text": "New place new experience. Great Mediterranean restaurant with fresh fish (purchased by lb), salads and side dishes are incredibly tasty and full of flavor! I felt like back home on the balcony, next to Mediterranean Sea. It’s new place they need better organizing mgr/staff to greet and welcome people at the front but that’s all.\nLooking forward to dine again!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ME0yeF9BRRAB",
            "text": "Surprisingly fresh fish and seafood are exceptionally well cooked. Everything was delicious and served perfectly.\nFast and friendly service.\nThey do not serve alcohol."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odU1VVnBWMWhzUkhOWVlVNXNkbXcxTW1WaWVsRRAB",
            "text": "Ordered the lunch special and fried calamari to go. Fish was delicious (a sautéed flounder and lemon potatoes) and fried calamari was perfectly cooked."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueHJDNVB3EAE",
            "text": "Le Petit Pêcheur is a gem for seafood lovers. From the moment I walked in, the warm and inviting coastal décor made me feel like I was right by the ocean. The menu offers an impressive selection of fresh seafood, and the quality is top-notch.\n\nThe service was also impeccable. The staff was knowledgeable about the dishes and made great recommendations. The portion sizes were generous, and despite being busy, the atmosphere remained relaxed.\n\nPrices are on the better side, and the quality of the food and service makes it worth it. I’d recommend Le Petit Pêcheur for a special occasion or a memorable night out. I’ll definitely be returning!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNVZqTkNjRkZTWTNvME5YUjJkVlozU0dndGIwRRAB",
            "text": "The best best best ever , it's my first time satisfied 💯 . The stuff are very very nice and friendly ❤️❤️ the food was so delicious 😋  the guy who served us was so so so nice . I will back and come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaTUyMVNBEAE",
            "text": "I had an amazing meal at ~ Le PeTiTe Pêcheur ~ The bronzino fish was perfectly grilled—crispy skin and tender, flavorful meat. Paired with the garlic mashed potatoes, it was a match made in heaven. The potatoes were creamy and full of rich garlic flavor, complementing the fish beautifully. The service was excellent, and the cozy atmosphere made it an even more enjoyable experience. Highly recommend this spot for seafood lovers!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbzhUaDRnRRAB",
            "text": "Food and prices were fantastic, I got a fish entree and an appetizer for under $20. I got a monkfish which was sautéed to perfection. Scallops were juicy, calamari had that nice grilled toasty taste to them. Lemon potatoes were excellent and very lemony, soup of the day (shrimp bisque) really hit the spot as did the eggplant appetizer. Would definitely go again and bring friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuXzduSVVBEAE",
            "text": "While there are many great seafood restaurants in Astoria, I would say this one offers both quality and affordable prices. Additionally, it has a spacious dining area. I'm glad to have such a restaurant in our neighborhood."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSUlluVk1URTVsVmpSSU5tazFXa2R1Y0V0NlQzYxAB",
            "text": "One of the best seafood restaurants in NYC. Everything was so fresh, juicy, perfectly cooked, and the prices are very reasonable (especially compared to the overpriced low quality seafood you get in Manhattan). The staff here are also lovely and very attentive. Definitely coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wd1RWZzNkRjl3WjJSU2MyTjRUa3QwTURCTmRWRRAB",
            "text": "AMAZING!! This is perhaps one of the best restaurants I've been to in 2025. Every single dish - fron the Greek salad, to the grilled Dorado, scallops, shrimp and even the French fries - were of the highest quality and tasted SO FRESH!\n\nI took my family here for lunch. One of my family members has a few dietary restrictions (no dairy), and they were able to accommodate.\n\nThe service was excellent. This is a husband and wife labor of love restaurant, and it shows! There's such a great team spirit here, which made our entire experience wonderful.\n\nThe trek to this Astoria gem is worth it. We can't wait to go back!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ajkzcGpBRRAB",
            "text": "A Seafood Gem in Astoria\n\nLe Petit Pêcheur serves up fresh, flavorful seafood. The calamari was tender, the mussels perfectly cooked in a delicious broth, and the shrimp was grilled to perfection. Great food, great service.\nDefinitely worth a visit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psV2NYQXlhRlV0TVhSaFpqZ3lhM1pFZGt0cWVuYxAB",
            "text": "Let's start with the fact that I am extremely picky with my food.  I don't easily get impressed with anything I eat.  But my husband and I were really impressed with the quality of dishes,  service,  atmosphere.  Everything was so fresh and delicious.  The place with great food and friendly service.  We will definitely come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OeFVGaFNhVVZ0VlVaaVZXaGtTMWhPVUhWVmFtYxAB",
            "text": "Had an amazing dinner here! The fish was super fresh and delicious, especially the Algerian-style sardines—absolutely incredible. The vibe was cozy and relaxed, and the host was so kind and welcoming. Can’t wait to go back! Highly recommended"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aXYtRnV3RRAB",
            "text": "Very nice atmosphere the food is very delicious and unique you can tell there’s a French touch  a French cuisine please keep it this way"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOdjRnZkQ5dEpQb1V3EAE",
            "text": "Nice place, clean and bright with a good selection of fresh seafood but not as much variety as the other fresh counter spots in the neighborhood. The calamari, sea bass and Greek salad were excellent. The tiger prawns were not as sweet as those I’ve had at other fresh counter places. The lemon potatoes and sardines were ok. Despite other reviews saying this place was BYOB they neither serve alcohol NOR allow you to bring your own! We were told we could not open a bottle of wine we had brought. For that reason it’s definitely not a celebratory type spot but nice for lunch perhaps."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMDhiSjBRRRAB",
            "text": "Food was fresh and delicious. Servers were so attentive and quick to bring out everything. Definitely recommend and a must try!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacVdXaFlRbUZVWDBWSWVGWjRiMk42UVdKTFdVRRAB",
            "text": "Delicious fresh fish and very reasonably priced. We had the calamari provencal, the eggplant dip, peasant salad, sauteed scallops, and grilled red snapper. All were delicious, but the calamari provencal was really a standout."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3enJfN2F3EAE",
            "text": "Delicious fresh fish cooked to your wishes. Excellent service and cute corner meditation place in Astoria. Def come for the relaxing vibes and excellent food."
        }
    ],
    "reviews_count": 76
}