{
    "name": "Avenue Restobar",
    "place_id": "ChIJ815OVz9fwokRUan6lN66yz4",
    "grid": "QN1",
    "address": "35-27 30th Ave., Astoria, NY 11103, USA",
    "rating": 4.3,
    "user_ratings_total": 739,
    "phone_number": "(718) 433-9298",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eFJsbExXak5PTkdOdlpVUkhZakJ3YkUxa1JXYxAB",
            "text": "They nail both aspects of the restaurant experience. The taste is memorable. Avenue Restobar reveals notable expertise. The design makes sense and everything shines with cleanliness. I'll definitely visit again!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KSlVVbEdiWGt6T0cxNmRVWTNla3hGUW5WeGJtYxAB",
            "text": "We enjoyed our brunch, the food was good nice portions, service was good , it was soo quiet which was great"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KT1QycFRUbW8zVlZWNVZVZzBiRzFTU0Zka05YYxAB",
            "text": "Called with specific allergy requirements was told they would accommodate order came with all the stuff I am allergic too called the restaurant back was gaslit yelled at  by some guy telling me I never told them about said allergy restrictions when I know exactly what I said they just weren't paying attention"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRGRGZzRXVjl4T0dadU1YcDBXVGxhVlRGNlZVRRAB",
            "text": "Nice mixture of drinks and food. Service was great. What more do you need!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ac1ZHaHllbmczYVZJeldFcExTVFJCZUdaUlRFRRAB",
            "text": "Great service great food great atmosphere"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa2NXRm9NRzFmTUZnNWEyRktiVkY2TlVoWVpWRRAB",
            "text": "The coffee took very long to come out and the roast for the espresso was not bright and tasted very burnt. The coffee also was bitter like it was over-extracted. The menu has incorrect information related to dietary restrictions on it. It's also heavily overpriced."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRU1rTXplbE10TW5sSk4ydDZNMEpsTm1GMVpVRRAB",
            "text": "Best food in NYC!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCR2FuZHJSRXRSVTBoQ09XbHBZa2t0VWxwWU1uYxAB",
            "text": "I stopped by just to grab some food while I waited for my meeting to start. I ordered the chicken souvlaki from the appetizer section. I was surprised by how big the platter was, it was more like an entree! It came with pita as well. It was absolutely delicious, the chicken was soft and tender and full of flavor. The pita was toasted and crispy with seasoning as well. I also ordered an espresso martini (my fave) with reposado, they make it with real espresso!!! A lot of places just use cold brew, so I was delighted that they had actual espresso. Laura the bartender (I sat at the bar) was so welcoming and friendly. The place itself is nicely decorated and has a good ambiance. I recommend this place and will definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdFlsSnFlbTFuWTFaMk5pMHpUMVJVYjNaM2QyYxAB",
            "text": "The food was delicious, the decor of the restaurant was fabulous, and the waitress was kind, polite, well-informed, and delightful to interact with. We will be back!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kT2N6bDZlRUpEZUU1bVREaHFRVmQyTXpOTWVtYxAB",
            "text": "Great experience at this restaurant! Tiana gave us amazing service and really took care of us. The food was delicious,\nwe can’t wait to come back for brunch!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodTl6ajBBRRAB",
            "text": "Nice place to visit and chill out.\nStuff are very polite and kind,service is always without any issues.\nFood is ok, nothing special\nWhen I have time I’m always here with my friends"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMldGQnFPVFZVWlU0MExVZzNTSGxGUldaTGNXYxAB",
            "text": "Una esquina maravillosa con una terraza super linda"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SFF5MXBRMGxHZVc1aUxXNDRRa0Y0WVdvMk5VRRAB",
            "text": "I’ve been coming to this restaurant with my family for over 19 years, and we always receive wonderful service and enjoy delicious food. We want to sincerely thank Avenue Café and our wonderful waitress, Nadine.\n\nNadine is such a sweet person. She kindly listened to our request to move to an outdoor table because the music inside was a bit loud. Her service was caring, respectful, and professional throughout our visit.\n\nMy family and I had a beautiful time at Avenue Café, and we believe Nadine deserves to be recognized for her hard work and dedication to excellent service. As always, Thank you Avenue cafe and staff. See ya next time for our next family reunion."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Q1VVaHhXbHBxV0RobFJVdzJiRVZ2VUhoclJuYxAB",
            "text": "Food was good, was on time… drinks came when we finish the food, they didn’t know what spirits they got in the bar, drinks came wrong three times… server was nice to us but service was terrible, they charged us twice, they let us waiting like 15 minutes for our bill and then it was wrong… manager didn’t take care of nothing, prices are midtown prices but service ??? Worst experience ever"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GT1YwbGpOM2d6V21STGJ6bGlVRkUxUjBsbmEwRRAB",
            "text": "Great vibe, solid music, and an even better bartender — Zach is the real MVP here. Personable, attentive, and knows how to pour a drink just right. Whether you're flying solo or with friends, he makes you feel welcome and keeps the energy…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTFpGVm9PRVJvY21aR01EVlhYM3BRZFd0VlluYxAB",
            "text": "Great place for a drink with friends or casual meet up.\nOne of my all time favorite paces in queens"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwdGFUVmtSRjlaTXpCRlpraFdZbTluVldWdFFrRRAB",
            "text": "Un lugar parque no puedes dejar de visitar , con un ambiente espectacular   , y la comida deliciosa"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNmNpMUtaVWd4UkVONmQwTlpiVjkwTUVjdFowRRAB",
            "text": "This will be my first and last time muy husband and I will ever go to this restaurant, we went for couples night out so one our friends recommended this restaurant but after this experience I won't recommend it to nobody, we ordered some nachos and guacamole and fried calamari the fried calamari were delicious but I won't recommend the nachos they didn't taste good, but the part the we really didn't like at all were the drinks. I ordered a drink ( tropical cooler) and omg literally I paid for a cup of ice we all did same my friends ordered mojitos  and all our drinks were full of ice we talk to the waitress and her excuse was that drinks are pre pouch before they serve them 🙄 Going out in New York is already expensive but please at least be conscious of what you serve and not make me waist my money just for ice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNX1N4cjNEcl9uUllREAE",
            "text": "My favorite spot!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKV0pxNU9MenNmbEx3EAE",
            "text": "Food and drinks were delicious. We loved the mediterranean spreads and spinach dips the best; mains were good as well. They also had great selection of Greek wines. Service was excellent and space was nicely decorated. We went there to celebrate my friends birthday and had a wonderful experience. Thank you !"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZThfdHE3dWZ2NDNnRRAB",
            "text": "Un lugar súper bonito, la atención estuvo increíble al igual que la comida!! Súper amigables, de verdad que bonito es ir a un lugar donde la atención siempre te haga sentir cómodo y en casa!! Volvería sin duda y un lugar que recomendaría!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQQzFqX3VxN1oyWXF3RRAB",
            "text": "I have been there a couple of times. The food is delicious. Sit outside or inside. Prices are reasonable. Child friendly. You can make a reservation."
        },
        {
            "date": "6달 전",
            "language": "hr",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNvajVVZRAB",
            "text": "Jednostavno odlicno"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbV9QdUZREAE",
            "text": "Great vibe. Great powder room"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMWFtT2lnRRAB",
            "text": "Amazing servers so nice and friendly. Shrimp tacos so delicious. Nice interior and open space,good drinks. Definitely coming back here"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bm9IUk9nEAE",
            "text": "I had the open face quesadilla. The food was good. Something happened that caused us to wait an hour for our food,\nBut they gave us free dessert for the wait.  Other than that we had a good time and enjoyed the food, drinks and service. Its a cute spot in Queens with a nice aesthetic."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NTZlbEJnEAE",
            "text": "It's 1:30 pm and they're out of brisket, salmon, and pork loin, which kills half of the brunch  entrees. Ever try thinking and planning ahead? Guess not. I settled on an omelet, which was watery and tasteless. Music is extremely loud. I'm done with this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cUtQX2pBRRAB",
            "text": "I used to come here a few years back and had great experiences. Today, I brought my mom and kids here to celebrate a birthday and had to walk out. After being seated, we waited abnormally long without a server acknowledging us or asking us if we wanted beverages. I had my kid begging me for water because she was thirsty. After letting the host know we were ready to order, still no one came by but we saw them assisting the tables surrounding us. I don’t ever plan on returning . We waited patiently as long as we could and felt really unwelcome…."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dVlhTXFBRRAB",
            "text": "Had a double cheeseburger don’t waste your time or money on it. The bacon was horrible. My girl had the grilled chicken it was just ok. Two large cappuccino’s serve lukewarm warm. Neither here nor there. I’m sure the place a good bar/club. The food is another story."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc292QkN3EAE",
            "text": "The food here is fantastic—I wasn’t disappointed with any of the dishes. The vibes are great too. I would’ve given 5 stars if the server hadn’t reminded us so many times about the place turning into a private event at 10. We understood the first time, so hearing it 4-5 times was unnecessary."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMl95cmRBEAE",
            "text": "Nice place for breakfast"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBaWZPQmNnEAE",
            "text": "Love this place .... the food is amazing The atmosphere is a lot.Great and service is ❤️.... a must go"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOGR1WlNnEAE",
            "text": "I like ❤️  nice place I love it"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMXJySFl3EAE",
            "text": "If you can’t take loud music while u eat, do not go here, it’s a techno vibes, loud music thing at this restaurant but the food is good and I love food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aC15djl3RRAB",
            "text": "Stop trying to be a club in a residential area. Staff is rude as well."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aTVpbVl3EAE",
            "text": "Horrible. Not attentive service just care care about $. The tzatziki was just sour cream ans yogurt and  had no flavor!!! Fry fry meat  cooked to not what you like, not going here again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NWJ5cFd3EAE",
            "text": "This place is home. The food & decor is always to die for. The workers here are so wonderfully amazing. Thank you guys for always going above and beyond, making each visit more memorable than the last! Try the new “Passion Fruit Cheesecake”—it’s Heaven on a dish!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MExfa2dnRRAB",
            "text": "Enjoyed a delightful lunch with my best friend. Love the Hip music. Food was delicious and the service was tip top. The staff was extremely agreeable, professional, attentive and fast. The prices are very reasonable for the neighborhood and the crowd was very pleasant for Lunch. The seating is super comfortable. The decor was very thoughtful. Will return for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbkxucWdnRRAB",
            "text": "Steak and eggs are highly recommended, the drinks are amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3XzVuc3BnRRAB",
            "text": "I recently visited Avenue restobar and had an outstanding experience. The atmosphere is vibrant and welcoming, making it the perfect spot for a night out or a relaxed evening. The menu offers a wide variety of delicious drinks and dishes.\n\nWhat really stood out, though, was the exceptional service. The manager goes above and beyond to ensure every guest feels welcomed and taken care of. The bartender is incredibly skilled and crafted some of the best cocktails I’ve ever had. Their attention to detail and friendly demeanor truly made the night special.\n\nIf you’re looking for a place with great food, amazing drinks, and top-notch service, Avenue Restobar is the place to be. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bmJHZjdBRRAB",
            "text": "Decided to visit Avenue and have a bite to eat anyway food was actually very good and the service was amazing due to the attentive service from the manager Anna who guided us what to order and created a very nice atmosphere thank you Anna !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cU0zcEtBEAE",
            "text": "This is a cool spot in Astoria.  Very hip vibe and excellent service.  Our bartender Zach was exceptional.  We tried 2 small plate snacks that were great and the spicy Margherita was top notch.  We will be going back, in fact we did later the same night."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbXRIZ0xnEAE",
            "text": "4 stars I’m going back for the food\nFood: 5! The food was amazing, big portions, they are generous with the fruit, I think one of the best French toast that I ever ate! Everything was so tasty I just love the food\n\nService 3: it was good but the server was running she take half of the order and then we goes. I have to call her again so I can finish my order. But for the rest good service\n\nEnvironment 4: I sit outside, the table was a little uncomfortable but it was ok\n\nNoise 5: it wasn’t  super loud\n\nPrices 4: the prices for the food was more than perfect they aren’t cheap but they give you good portions, but for the drinks it was really expensive they were good tho"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhNE1xZHFnRRAB",
            "text": "This place is amazing. Great decor, great service. Lots of comfortable outside seating. Cecilia the hostess was extremely welcoming and made us feel at home. Our server, Mariana, was great. Prompt, friendly and great service all around. The steak, mussels, salad, octopus, chicken skewers and hummus were top notch. Highly recommend. The coffee and dessert was also amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaGNxay1BRRAB",
            "text": "That was a lovely experience.  I was there with family, the space and the food was amazing. I enjoyed sitting near the window and morning sun was blissful. I highly recommend this, hospitality is top notch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiZ0pDTERBEAE",
            "text": "First time stoping by this spot and I have to say I’ll become a regular for sure. The treatment was amazing and everyone was very attentive the entire time I was the there. The manager Anna came around to check on us and see how our experience was. Our server vlesa was great gave us time to decide what we wanted to eat without rushing us. Was attentive to our drinks that were spot on. My boy literally said the best old fashion he ever had was at this spot “Lorena” the bartender she’s usually there on Saturday and Sunday you won’t regret it. We had the margarita pizza with the Caesar salad the food was delicious. The atmosphere was great family oriented but also great for couple or anyone who’s wants to go there. Friendly welcoming place will definitely go back ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWc0x5Vk5BEAE",
            "text": "2nd time having brunch here and has not disappointed me at all. My friends and my nieces also enjoyed the food they ordered . Def will be back to try their other dishes . Def good to make a reservation on weekends. Food is reasonably priced and a good amount of serving Drinks are good but a little pricey"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MDVIbnJRRRAB",
            "text": "Really nice spot for coffee and a quick bite specially during the summer time! Has their Freddo cappuccino and it was delicious. Chicken Souvlaki was under cooked so couldn’t really eat it, Greek fries and tzatziki sauce were ok. Also tried their Mediterranean sandwich I thought it was very tasty but maybe needed to be a tad more crunchy and less saggy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidUxMaWV3EAE",
            "text": "Great greek restaurant with awesome food.  The atmosphere is amazing.  I was there Friday night, and they had a dj.  Very friendly staff and manager. Definitely recommended.  Thanks again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMmRIUHpRRRAB",
            "text": "Eddy is the best host that Avenue Restobar can have, we arrived at Avenue for a bachelorette party, without a reservation, Eddy was able to accommodate 16 women in a couple of minutes, he took the time to decorated the table with balloons, sprinkles and fans for us all in a matter of seconds, it exceeded all our expectations, it was a very good experience, we are very grateful to Avenue, for allowing us to celebrate my friend's bachelorette party at the last moment. I recommend this place 100%, the staff is incredibly friendly, the atmosphere is fun, the music, the dj, the bartenders. Please make a stop at Avenue and you will have a very good time. ;)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyLTZTSWlnRRAB",
            "text": "I don't know how many times I've come to this place, more than 6 times of course. (Sometimes is my office) It is my fav spot in Astoria. The food is absolutely delicious. They are so kind, attentive, and helpful which made for a great dining experience. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREam9pTTVnRRAB",
            "text": "Stopped in to this neighborhood resto-bar on a Monday. Surprised how busy and diverse the crowd. Food and drink was great. I had shrimp tacos and a tasty salad. Pop in and enjoy!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMXFPVlhREAE",
            "text": "Easygoing, busy and chill place with good food and coffee. Sometimes the service is a bit slow. Brunch options are good. Didn’t love my chicken waffle but that’s just a matter of seasoning that I didn’t enjoy, it doesn’t mean it’s not good in general. Dessert waffles were great. The place has a good vibe to it and diverse guests."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOMWRTNlhREAE",
            "text": "For a local Astoria restaurant this is a great place. I've been going there for more than 15 years. The way they changed things around made the atmosphere very cozy. There is a huge bar-island in the middle where you can sit as well and it's super cute.\nThe food was good. We had a quinoa bowl and Salmon as an entry. The service was quick and the waiter was polite. The menu has varieties from Brussels sprouts to quesadillas. I would definitely go back again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwMFpDSENnEAE",
            "text": "I heard this place reopened recently, visited it on a Sunday evening (came around 7.30pm and sat outside).\n\nFirst, we didn't get our drinks order taken for about 20 min after being seated. I saw other tables leaving for the same exact reason. The female waiter had no idea what a 'hot toddy' drink was, I had to write it down on her notepad so she could ask the bartender if he could make one. 10 min went by and our table was approached by a different male server, who took our order once again and did not apologize for any delay. At that point I suggested that our drinks should be on the house and we'd like to speak with a manager. We finally were presented with the drinks by the waiter and he mentioned they were in fact on the house. We then ordered a Greek salad and a pizza. The salad was rather a lettuce salad than a Greek, with barely any cucumbers or tomatoes. The pizza was okay but since the crust and layer of dough was thick it didn't cook through in the middle.\n\nIt took us another 30-40 min to receive the check (I asked the waitress twice, she reappeared again) while the table was full with dirty plates that weren't cleaned up.\n\nOverall, inattentive and slacking service, so-so food and not very strong drinks. I wouldn't come back here. 3"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4N2VIcmdnRRAB",
            "text": "We had an amazing experience.  We had a reservation for 20 people to celebrate my son’s graduation.  Everyone enjoyed the food, drinks and attention.  Eddy was very accommodating and attentive.  I was impressed by our experience.  We will continue to return and celebrate our special occasions.  Thank You Avenue Restobar 🥰.                                                          I would recommend it to anyone."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbU5QTElBEAE",
            "text": "Came for appetizers ! Not my first time here but first time reviewing it. I love the wine list specially the selection of Greek Wines and the Rosé Jean Luc Colombo. The appetizers were hummus and tzatziki from the happy hour special and the oysters. Service was ok."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1d0k3ajRRRRAB",
            "text": "The food was absolutely awe-inspiring! 😋 We started with the calamari for appetizers, which was divine, and then indulged in the Avenue Burger as our main course, which was a flavor explosion! 🍔🦑 The atmosphere was stunning, and every interior architectural feature was impressive! 🤩\n\nThe only minor downside was a bit of a wait, but it was understandable given how crowded the place was. 🕒👥 Overall, a fantastic dining experience! 🌟🍽️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaZ2NXcjZRRRAB",
            "text": "This place is great! One of the few places that has a bottomless brunch that doesn’t end at 4 pm, here it ends at 8 pm (though the brunch food menu does end at a certain time) It’s my go to spot if I have a late start to my day. Excellent service! I enjoyed the sangria so much that I did not change it throughout the 90 minutes (though one batch was a little sweet). Usually brunch sangria is watery but not here. It was excellent. Food was great! I ordered the chicken souvlaki, I’m all about well seasoned and prepared food, the chicken souvlaki was well seasoned and juicy. I typically never order fries with any toppings because they can get soggy, but that was not the case. The Greek fries were flavorful and stayed crispy throughout the entire meal. Even the toasted pita bread tasted great. My partner ordered the margarita pizza which was tasty as well. I don’t typically like pizza that isn’t thin crust, but the sauce was very flavorful. 10/10, this is second time here and I’ll be back.\nAmbiance was great! The DJ played a mix of music for everyone to enjoy. From reggaeton to pop to old school reggae. It was great, people were dancing a bit, singing along a lot and just enjoying the vibe.\nI have noticed other reviews complaining about the credit card fee. They do mention it on their website, but not in person nor on the menu. This is my second time here, so I expected it. Didn’t come out to much though, a little less than 4 dollars for a 102 dollar tab."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyM0lEazJRRRAB",
            "text": "Came to this place with my brother and sister and all I can say is that this place is amazing!!! Not only is the food really good but the energy of the staff is the gold standard for any one in the service industry! The hostess was friendly…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4OFlTejJ3RRAB",
            "text": "This was my second time here and It quickly turned out my favorite restaurant, the service was great although they were really busy but the food and drinks were sooo good I have no complaints, outdoor seating is well organized had a great time definitely recommend it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUN3RfNC1BRRAB",
            "text": "Walked around Astoria and wanted to try new spots and came across Avenue Restobar. Lovely spot. Music was chill. Loved the vibe. The chicken Alfredo was delicious and so was the express martini."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaVpTcFJBEAE",
            "text": "We tried this place for the first time, few days ago and I was pleased. The food was yummy and presentable, the drinks were pretty good too, the location is very nice, employees super attentive and on top of things! We will return! 👏🏻…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnOHYzYmdRRRAB",
            "text": "This place is just ok. My friend lives in Astoria so after work we often go for early dinner and drinks and we go to Astoria. She chose the place.  I had been here twice before with her it was just ok nothing too great.\n\nWe ordered a few appetizers to share between the 3 of us. One was calamari. It was well seasoned,  crispy, not oily and a huge portion. The second was a plate of several things haloumi  (I forgot the correct spelling) grilled cheese,  grilled ham,  greek sausage, chicken skewers, grilled pita, tzatziki. Everything on this plate was cooked on the grill. It was good.  We also ordered spinach/artichoke dip. That was pretty tasty but they didn't serve enough chips for the amount of dip and we had to ask for more.   My friend and I ordered watermelon margaritas. They weren't really that good.  I only had one because of that. The waiter kept coming and trying to take our plates while we were still working on our food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNTdTWm1RRRAB",
            "text": "This is my one my favorite places in Astoria. The food is great, fresh. The atmosphere is phenomenal. Drinks are very good. Service is amazing. I highly recommend this place.\nP.S: my favorite is the Avenue burger!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaXJmaHBBRRAB",
            "text": "*** THEY CHARGE EXTRA WITH CREDIT CARD\n\nFood was decent.  I think $20 is a lot though for an omelette.  I was put off by the fact that they charged me an extra 78 cents because I used Apple Pay\n\nAlso, they don’t have the device to pay at your table with credit so I had to go to the bar, unlock my Apple Pay, then hand my phone to the server while she used a device behind the bar."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdXZuNkpnEAE",
            "text": "Great Place, Great Drinks, Great Food!! The menu has definitely changed in the last few years, and unfortunately crepes are no longer available :( But their sandwiches and drinks are still amazing as they always have been!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eF95RU5REAE",
            "text": "This place was jumping! I loved it! Great staff, great music, great food etc.  Everything was just amazing."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpdk1ITktREAE",
            "text": "the food and the venue is nice. i like the aura of the restaurant. modern/upscale but chill...the food is a good selection of choices. the staff is nice and the prices are decent. the drinks are good too...the sangria was very flavorful"
        }
    ],
    "reviews_count": 69
}