{
    "name": "The Bonnie",
    "place_id": "ChIJIXxptEJfwokRRzu3bQietPo",
    "grid": "QN1",
    "address": "29-12 23rd Ave, Astoria, NY 11105, USA",
    "rating": 4.5,
    "user_ratings_total": 1628,
    "phone_number": "(718) 274-2105",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWVIweDJNMlJvWDJwWFVUbExUSFZ0YmtKdmVYYxAB",
            "text": "The Bonnie is the perfect spot for brunch in Astoria! The food is super yummy, the drinks are delicious, and the service is superb!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UVQyRnRWWE40VWxob1RYZFlVbGhtZUMxaldHYxAB",
            "text": "Nice spacious bar. Great drinks and cool outdoor back area beer garden."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210a1h6SkZVR0l3Wm1keGJHeFdiMVJSYzJ4VmVuYxAB",
            "text": "Food is fine, but the atmosphere is very cool, especially the backyard."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waVIwWlVaa1JJTFVKNk1FOVVaV28wYkc5ZmRIYxAB",
            "text": "A staple of Astoria. Really sums up the neighborhood with great cocktails, large space, great back garden and a records bar right next door. Truly a must see when living or visiting Astoria"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abFVHTktVVFpZTTBsT2NVUm5ObTVmVjE5UFMwRRAB",
            "text": "Great food! The Crispy Salmon brunch app is amazing! Good drinks, good service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOU2RXMVphVVZhYjA4eVFubEpiVzFCTm1SRU9HYxAB",
            "text": "The Bonnie is tried and true. Great cocktails crafted by an experienced bartender that gave us just the right amount of attention. We were catching up after a long time not seeing each other. Thankfully we had a lot of time to converse and nibble on bar bites that were all bomb. Smoked olives, fried pickles, and coconut shrimp are all very recommended. My friend had a Negroni she loved and my margarita was outstanding. The Bonnie wins."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMVpGRjRXSFpqVlRaclNVdFlSak5HV2tkQ1lYYxAB",
            "text": "Excellent place to take a date. Loved the drinks and the Keylime pie."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nelltSmFTWFJsVUdobWIwRnZja0pqTFZSNVdtYxAB",
            "text": "I really can’t be mad at this place. They have an amazing patio, trivia, and a pickle martini on happy hour. And the cheese fries are really good."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOc1ZGOTRVVGRtVGsxWGJsTlhkelppUlhoTFRuYxAB",
            "text": "Great outdoor area, fast service, super nice staff. Highly recommended spot in Astoria"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwd2QwczJRVFZ3TlhVeVp6WkJWWHBVZDJWTFJXYxAB",
            "text": "We could not ask for a better spot for a Saturday brunch. Great food and cocktails. Really like the diversity in the menus. The Vegan Ruben sandwich was amazing. Great vibe and beautiful outdoor space."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVGJuVXhhRWRWV2xsSWVXUXlTeTFIUzJSTmRWRRAB",
            "text": "Nice bar with outdoor seating and activities (like trivia games). Excellent for casual drinks and snacks if you’re in the area. The service is good. When I’ll be in Astoria for a night out with friends I’ll remember to stop by at The Bonnie."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGallUTTRjRk5TYm5Ca1FtOXdXVXRqYlZreU0zYxAB",
            "text": "Fun drinks, great staff, trivia nights"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUVVXUlJRbWhxWXpreGVURjNRblYwT1ZFMmEwRRAB",
            "text": "If you’re not in your 20s, skip this place. Loud, looong waits for drinks, food in small portions, staff that are too cool for school. You get the idea."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2NDVuZGRBEAE",
            "text": "Great eatery, with a good selection of tasty cocktails to go with the excellent food. Attentive staff, generous portions. Definitely worth a visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wR04wbERUR1IwWkhoWFl6aDViVXRNVEdWdkxWRRAB",
            "text": "Amazing experience we went here for brunch and had great service. Annie our waitress checked up on us at all times and really made our first time here at the Bonnie great, we will be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sd2MySklNRFI1Y0U1RGFGODJSV3hCZFhKZldIYxAB",
            "text": "They have good food and good atmosphere but they need to practice more about their customer service that is very slow"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3d1RWQmxVek5zY2xkbGJsVkZlSFpOUjB0alZFRRAB",
            "text": "Food was hit or miss. Brussels are great! Burgers ok. Chicken sandwich a miss."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWk5saDBjSEJLVVRCblNtdFVaMHhRZHpSdmMzYxAB",
            "text": "One of my favorite bars in the area. Good place to hang with back garden. Steak was good.\n\nThe kale Caesar was pretty good as was the smoked olives and fish tacos. The rib tips were too sweet for my taste and wouldn’t get it again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OV09IUlZaMnR6YURBMGRWVndhMTlLTkVwdFRYYxAB",
            "text": "Loved the patio! Best dirty pickle martini ever!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMmFUTXpVV2RCZG1obVlUVkNNRFl3UjNNMFdtYxAB",
            "text": "Such a great neighborhood spot! Great drinks and food!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoajRyUW5BRRAB",
            "text": "Feb 2023 I had the smashburger . Very delicious.  The fries were good. The avocado toast was great as t.  2025\nAug 2025"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twck1tMXhSVEZXU0RaWllWZElZbE5xVEVvME5rRRAB",
            "text": "Always a lovely time at The Bonnie! Cocktails are well prepared especially by Olivia. If you’re looking for a chill spot in Astoria with good vibes this is a must visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT2Rra3RjVnBpUjIxb1NsZ3hOVzFEVWxaVk9FRRAB",
            "text": "Christmas 🎄 in July was fun. Smash burger and IPA were yummy.…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eFRrOU5jbEJTYjNKMkxVSXpNVlZ1ZGxWaldrRRAB",
            "text": "Its a great experience and time to have with friends and family"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreWNFWktWRkZyUTI1ck1EUnBlRzlrU2xGYVRVRRAB",
            "text": "My favorite gastro pub in NYC. Food, drinks and service are great in a cute are of Astoria. We go there every trip to NYC"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQmExaDNiMGhNYjBsamFqZDJhakUxV2t3NVFsRRAB",
            "text": "Ambience is so lively, with some chill music to eat to.\n\nEverything from the Burgers to the fries to the drinks was amazing!!  Paloma Roma was bomb.\n\nHighly recommend stopping by for lunch or dinner."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSFZXZHBkRWswUzI5cGRGUjZXRTF5VFUxT1puYxAB",
            "text": "We had a great dinner here last night- our first time here! Cocktails are small for the price but were delicious. We had the bass ceviche, strawberry goat cheese salad, steak frites, and spicy chicken sandwich. The ceviche with tostones was our favorite. Definitely recommend this place for friends, girl dinner, or a date night."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MmMyWlNiMnhoZDFCWE4yRnhVVWgyUVhscGJsRRAB",
            "text": "Such a cool bar - easily top 3 in Astoria. The vibes are 10/10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSV05GTmZRbWxoTWpJMGEyMW9lVE5RTXpGdmRtYxAB",
            "text": "We hosted our baby shower at The Bonnie and couldn’t have been happier with the venue. We booked the outdoor half garden, and the space was gorgeous—lush greenery, ample seating, and a great vibe that made the whole afternoon feel special. The staff were incredibly attentive from setup to cleanup, and they went out of their way to provide excellent accommodations for our gluten-free guest. The entire experience was smooth, welcoming, and memorable. Highly recommend The Bonnie for any celebration!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMVpqQnJibDlJWjNKa2Vta3dOSEl4TVdoeGMzYxAB",
            "text": "I was so lucky to have my bridal shower at The Bonnie and we had an amazing time! An abundance of food, fantastic cocktails (and mocktails) and organizing the event was a breeze thanks to Tali. Absolutely recommend!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNmNyOG9nRRAB",
            "text": "The Bonnie's back garden space is our FAVE place to go for brunch. This was our third time, this time without the kids and for a date with my wonderful husband. Always wonderful cocktails and that hot honey chicken biscuit was delicious (my first time to try). My husband ordered and loved the brunch burger and tater tots. So grateful such a great place is in our own home neighborhood!\n\n(Update —pics are from Fathers Day 2025 brunch for our family of four)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSlUyOVVkbGMyVFZkSFgwaHJOVmN0ZEVab2RrRRAB",
            "text": "That fish tacos was not friendly around 6pm on a Sunday. I had to expell it. Bartender was great and drink I had. Can't speak for the rest of the food menu. First time here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRlRYTnFiekp4TTFKcmFYQlFVVzgyUlZSWmMxRRAB",
            "text": "The drinks here are excellent, and the shots are top-notch too. It's the perfect relaxed atmosphere for good conversation and a fun time with friends"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWk1IWjZMWEJqWW05TVRuWkNkRVkzUWxSYVFrRRAB",
            "text": "The Bonnie always gives a great experience, making it a personal long-time favorite for brunch, drinks, and burgers. I recently held a larger scale event there in the Oak Room and Garden, and it showed just how good they are. Tali, the event planner, and her team did an amazing job. Their meticulous attention to detail, from the impeccable food preparation and efficient bar service to their adaptability in adjusting the music on the fly, was truly remarkable. The Bonnie's ability to seamlessly cater to any event, be it an intimate after-work drink or a grand gathering, is truly commendable. Will be back soon!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQbVJ6SjdBa1p6TE1nEAE",
            "text": "Paid an arm and a leg to wait 40 mins for a mediocre burger"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYnNpT2ZteHRuNG1RRRAB",
            "text": "The Bonnie is one of my favorite spots in Astoria. Ambience 10/10. Drinks & Menu 10/10. Service is always great, last weekend my friends were served by Kat, who’s very attentive and sooo funny !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPQ0wtOW15NmVEeDdBRRAB",
            "text": "A monthly date spot for my wife and I. We’ve been visiting forever. Some of the best cocktails in Astoria. Atmosphere is wonderful with 2 bars and an outside area. All the food is fantastic; menu is 1 page and curated in the best way."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKRzR3TGlHOExMZy1nRRAB",
            "text": "Such a good vibe! I sat in the back with outdoor seating when I worked on my laptop, had some beer and a burger, food was great, staff was super friendly and attentive, and gave me a good spot to sit and work! The vibe in the back was super chill. Bathroom was spotless clean. Not sure about the indoor areas since I wasn’t sitting there but judging by the times I walked pass it also seemed very well managed, cleaned and decorated. Would definitely go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbjE4dlRnaTRxUDF3RRAB",
            "text": "Love coming here for both brunch and dinner. Good smash burgers, love the chicken sandwich. Good service as well. Wife and daughter seem to like their drinks."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKU0YxWUczNDVHOU5BEAE",
            "text": "Service was great. Definitely will come back for the seasonal sangria!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYjgwOFhYanFxV1B3EAE",
            "text": "If you are one that experiences egg sandwiches being not much different than the the other .. come hither and do yourself a favor with the BEC deluxe addition of avocado 👌.   Now don't miss out on the strawberry French toast sticks for a fantastical brunch excursion ✨️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQX1l1TWk2MGJ2VzFRRRAB",
            "text": "I had my daughter’s bridal shower at the Bonnie and could not have been happier! They have a space in the back that is absolutely beautiful. It has an enormous slide down window overlooking a lovely garden courtyard. The food and service was outstanding! The staff assisted us in setting up in any way we needed and the catering manager was responsive and worked with us to create and event even better than I had expected! I highly recommend The Bonnie! The price was higher than I originally wanted to spend, but the service, food, and ambiance were well worth it!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURROGEtLWF3EAE",
            "text": "The Bonnie was great! They helped me host my love's 65th birthday celebration/ brunch. Tali Longo,  the event manager was a supreme professional! She worked with me the whole way through. Helped make the food suggestions and had the bar create a signature drink for the birthday girl. The server assigned to us was on point!! The food was a hit! The party/brunch could not have turned out better!! GO TO THE BONNIE! THEY'LL TAKE GOOD CARE OF YOU!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcUt1X2U0NnFyWkRREAE",
            "text": "Super great place for brunch !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPX1gtSnYzMWZyYTJnRRAB",
            "text": "Good Food and Drinks , enjoyed the environment!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLNzV3b2l3LU1YaXlRRRAB",
            "text": "Great vibe!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeGZicW1RRRAB",
            "text": "The atmosphere here is definitely the best part. Their outdoor area in the back is such a nice spot for a warm day, it could also be covered for rain. It’s spacious for big groups/parties and they’ve got TVs to watch the game. The food is good, we just got drinks and appetizers. The garden sangria is so refreshing!! I was skeptical about the pickled carrots but turned out to be a great snack!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaE9DdzV3RRAB",
            "text": "Excellent Sunday brunch spot. Great food and delicious coffee. They have outdoor covered seating which is perfect when you want to be outside but still possible if it's raining or too hot. They also have a really cool indoor seating with a full bar. I would definitely come back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzamFxWjNRRRAB",
            "text": "I had my baby shower at The Bonnie in September and couldn't have asked for a better experience. I went with this location because Tali was sooo responsive and thorough! She made the experience stress free and I loved the little picture she drew for us. The outdoor space was perfect and the staff that served our party were amazing and prompt with all requests. All my guests enjoyed the food and especially the drinks. Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdXY2ZXVBRRAB",
            "text": "We had lunch here on a sunny Sunday afternoon. It was very busy because of the weather. We only had to wait a moment for our table and our waiter was as attentive as he could be with the amount of customers there were. We got our drinks…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMODlPVGtRRRAB",
            "text": "I visited on a early Friday afternoon,Earlier I had a light lunch elsewhere but I was dying for a cocktail and a light little snack..I had a dirty pickle martini , and fried pickle to snack on. The dirty pickle martini was delicious..the pickle flavor that I adore with a great kick to it. The fried pickles were phenomenal. I love that they are coated with a cornmeal batter...they were really crispy!\nThe vibe was very laid back, nice crowd including a family with children . I always thought of it as just a  bar, But they have some fantastic food offerings as well. Service was very good. Bartender definitely was pleasant and made a great cocktail. Look forward to trying the brunch menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiX19uTFlBEAE",
            "text": "Rented out Charlie’s Bar to host my 30th birthday for 40 people and it was SUCH the perfect choice! Great staff, great location (by the train), I was able to decorate a bit and had full control over the music. There is a small outdoor area for people to get fresh air or for the smokers to enjoy. I had so many people tell me they wish they did something like this for their birthday! Would do it again!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNVpEZEl3EAE",
            "text": "Good ambiance and the hot honey fried chicken sandwich was really good. They forgot my orange juice tho haha but they offer refills for coffee so I guess partially compensated. Other than that the place is great just that when it’s crowded may be hard to get them to come to the table, but overall nice place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdGRIUnJBRRAB",
            "text": "Our waiter was amazing. Got bottomless brunch on a Saturday morning & had no wait time (I think we timed it perfectly). Food came out quickly and was delicious! Music was great, restaurant and bathrooms were clean. Overall a great experience, I’ll be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIODdHRVR3EAE",
            "text": "Excellent food, fast service, good atmosphere. We had the peach maple French toast, avocado toast, eggs, cheese, and bacon for brunch. Everything was delicious. Highly recommend \"the spa\" mocktail."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NmM3a0xBEAE",
            "text": "Well appointed and vibes to match, The Bonnie brings cozy to the contemporary purview. Speaking to brunch, the Chicken Biscuit and Eggs Benedict surprised with elevated finish and perfect portioning. Don’t miss a visit to this place!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbl9hYTV3RRAB",
            "text": "1. Cherry Blossom are beautiful, food are Yummy. 2. We looked for the happy hours beer menu, the two beers we chose were not available, so we got other kinds but not our favorite. 3. We can’t find our waiter when we want to order more drink, due to more customers coming they are getting busy. Later we left and went to other bar."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMmE2bFp3EAE",
            "text": "We ordered the burger, the coconut shrimp, the mac n cheese, and buffalo brussel sprouts. The burger was dry, the mac n cheese was bland, the buffalo brussel sprouts were pretty good but had some bitter bits, and the shrimp was okay too. The service was pretty slow and there are no free refills. The ambiance was nice, though."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOUlPUUd3EAE",
            "text": "Incredible Gastro pub to just relax, enjoy great cocktails and great food. Come one come all to enjoy the electric atmosphere and impeccable service. I strongly recommend The Bonnie."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsZzRlQk9BEAE",
            "text": "This is a charming bar, perfect for a date! I went there last night with my wife for drinks. It was pretty good. I got the banana Old Fashioned, which was tasty, more on the sweet side, and then I tried the Tooley Bird, a very interesting flavor. If you like smokey drinks, you will like this one.\nI want to come back for dinner next time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSXzZxZE1nEAE",
            "text": "Boring, one note food with zero freshness, diversity and flavor. Everything is just overwhelmingly salty with no sides or veggies to go with. A huge lack of selection and poor value for food with no sides. Outside of okay mixed drinks this…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbk92eFZBEAE",
            "text": "The service is awesome. They hired amazing waitstaff who intros specials, recommends cocktails, advises of ingredients, etc. Tried the weekend brunch. Food wise, the Benedict is good. Steak and eggs, the steak was not cooked properly (burnt…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPX1BPYjhRRRAB",
            "text": "What an amazing experience. Flew up from Florida for my daughters graduation from veterinary school. Kate and Sam and the whole crew put on a great show outside. The food is fabulous, the drinks were amazing and the atmosphere was…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5elliUGd3RRAB",
            "text": "SEARCH NO MORE for your next intimate & fun party venue! CHARLIE'S, The Bonnie's sister bar right next door was everything I dreamed of and more for my 30th Birthday party. Let me set the scene for ya'll... 35 of my closest friends, Game of Thrones themed decor & fits, cocktails that made everyone say \"I drink and I know things\" and the most fire food in the neighborhood... the party was a SLAY. Tali, the company's event coordinator, is the sweetest, most hard-working, and detail-oriented, especially when it comes to your event. She even went above and beyond to surprise me with a GOT themed menu by naming my cocktails after details of life. For example, she named the spicy margarita after my dog, \"Kevyn the Kingslayer.\" COME ON! How amazing is that?!\nSpeaking of cocktails... the incredible bartender, Olivia, bartended Red Witch magic with the amazing cocktails she made for everyone. She even dressed along with the theme, with her sword, serving vibes that was giving Night's Watch combined with Red Keep of the Bar. Everyone kept raving about every cocktail she made with style and care.\nWhen it comes to the food, The Bonnie always delivers, so of course my hopes were high for Charlie's. AND MY HOPES WERE MET! The ham and cheese toastie platter was delicious. The franks in a blanket were some of the best I've ever had. The beef sliders were a HUGE hit. And there were veggie options so we had the veggie quesadilla and the mac and cheese bites which were a crowd favorite.\nOverall, this party at Charlie's made me feel like Daenerys Targaryen on top of her Throne, like the Queen that was promised. Thank you to the Bonnie's manager Gerard for popping in to see if everything was going smoothly as well! That was so sweet. To The Bonnie/Charlie's staff - Tali, Olivia, Gerard, barbacks - Marvin & Pascual, and the talented chefs/kitchen staff, thank you so much! Your hospitality is EPIC!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJc1lIMmlBRRAB",
            "text": "What can I say about the Bonnie Team, other than they were AMAZING!!! (see photos of set up)\nI decided to do my cousin's Engagement Party there and  . . .\nThe set up indoors was eye catching and the personnel service was ASTOUNDING!!!  The details were very well done.\nThe service From the bar tender to the manager to the servers, with the kindness and care to all the guests from the kids to the grandparents was Really Nice.\n. . . Great Team - Good Food - and they made this event a Fun Time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdS1mSVhnEAE",
            "text": "I planned a Corporate Holiday Dinner party at the Bonnie private Oak Room and had such an amazing time! Everyone from my office could not stop talking how great the party was. The venue was so beautiful, the food delicious, the drinks strong and delicious and the staff were attentive, thorough and kind. I could not have asked for anything better. Our evening went as planned, with no hiccups. We had such a great rapport from start to finish. The organizer, Tali, was thorough and made sure we had all the information we needed and more. To anyone who wants to have a great time, I recommend going to the Bonnie; this team has your back. Thank you @The Bonnie for the great party; you have made our 2022 holidays go out with a bang!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcThqQV9RRRAB",
            "text": "Really like this place though I looked for a 4.5... Great atmosphere and a menu that pushes in the area of gastropub unlike others. Enough smash burgers for me, I had 'pickeled' carrots, good carrots just not pickled with a stash of vinegar and fish tacos... Which are quite good with pickled red onions funny enough. Nice cocktails included my beloved margarita. 🥳\n\nI enjoyed alone but a good place for a Tete a Tete with friends."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOTVEVS1nRRAB",
            "text": "Visited this place for a brunch on Sunday. Got a reservation for 12:15pm, which is highly recommended since the place gets busy around this time. Bottomless drinks for $25. Got a bottomless coffee for $4 (reason to be giving a 4 stars… it’s…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxX2RMejh3RRAB",
            "text": "The Bonnie is such a positive influence to the Astoria gastropub scene.\nThe inside is so cozy and inviting.\nThe menu although simple is always consistent when you order .\nThe beer list is curated perfect with many selections.\nThe fact that Allagash is always on rotation is one of the reason I prefer eating here for brunch or dinner.\nThe staff here is always friendly - no matter how busy it is .\n*** start with the loaded tater tots for brunch - crunchy and delicious ***"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcU4zbV9nRRAB",
            "text": "Hosted my sister's baby shower brunch at The Bonnie and everyone had a great time! Their patio space had plenty of seating for our large group and the team that worked our event was very attentive! The only feedback I received from guests was that I should have ordered more of the frittata and less of the bacon, egg, & cheese sandwiches for the buffet. Other than that everyone left loving their food, drinks, and the establishment. Thank you to Tali and the team at The Bonnie!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlX2ZqZkRnEAE",
            "text": "We live in Astoria and visit The Bonnie for brunch regularly - when we were planning our baby shower, we thought it would be a great fit! Tali and her team did such a great job setting up the space for the shower in the patio area (we…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c3QteGt3RRAB",
            "text": "Visited again with friends 7/22/23 this is the place to go visit it never disappoints you. Great service, food, music, drinks and ambience. A big thank you to Marie and Jonathan for making our evening FUNtastic  one. Love this place. Gloria from Astoria was awesome.\n5/13/23\nHad not visited for 3 years and yesterday was incredible. From time  we arrived until we left. Everything was perfect! Our server Eliott was outstanding and his smile has his special glow. We totally loved him and also has family that was visiting. I would like to commend Danielle for her amazing service. Is people like you that make this world a better place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdS1EbU1REAE",
            "text": "My fiancé and I chose to host our engagement party at Charlie's (The Bonnie) and are so so happy that we did! It's a new & beautiful, intimate space - all of our guests loved it! When our time was up, we were welcomed with open arms next door at The Bonnie to continue our celebrations. Tali was absolutely amazing from start to finish in helping us organize our event - we had such a wonderful experience with her and so appreciate all of her hard work, dedication, and attention to detail! Shout out to our bartender, Melissa, as well - she was lovely and her service was outstanding! We would 10/10 recommend Charlie's for any event without hesitation!! Thank you so much to Tali, Melissa, and all of the other staff members who made our event truly unforgettable! Paul & Taylor"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHdXBuRmpBRRAB",
            "text": "The Bonnie is an interesting experience; it feels like family. I’ve been here twice and both times I’ve never felt like a customer, I felt like a friend of the waiter’s. I really enjoyed my experience here. The food was great. I visited for…"
        }
    ],
    "reviews_count": 74
}