{
    "name": "Maiella",
    "place_id": "ChIJd00MRyJZwokRU-lmTi8kC2I",
    "grid": "QN1",
    "address": "46-10 Center Blvd, Long Island City, NY 11109, USA",
    "rating": 4.4,
    "user_ratings_total": 1839,
    "phone_number": "(718) 606-1770",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GclZtVk1UR00xVldwQ1FsZHVlVTlGVEZnNE5uYxAB",
            "text": "Me and my wife had our anniversary dinner here and let me tell you, the inside ambiance and the view of the city is beautiful. Our dinner and the server was great, maiella is a definite must go to again."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odk1EWmFUbk5EUlU4eGJHcGFiVmxGVW5ONlIwRRAB",
            "text": "Maiella is one of my favorite spots in Long Island City. The vibe is relaxed but still feels special — perfect for a date night or dinner with friends. The food is always on point. The pasta tastes fresh and full of flavor, and the branzino was cooked perfectly.\n\nThe staff is super friendly and attentive without being overbearing, and the cocktails are great too. If you can, grab a table outside or near the windows — the view of the Manhattan skyline at sunset is incredible.\n\nOverall, great food, great atmosphere, and one of the best views in Queens. Definitely worth a visit."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTlJuWXlWbkI2Ym1Od1YzZzVhM1kyTFZkWVNXYxAB",
            "text": "There are meals you eat and forget, and then there are nights that simply stay with you. Maiella keeps giving those kinds of experiences, night after night.\n\nFrom the moment you walk in, everything feels right. The view of the city skyline across the East River blends with the warm glow of the dining room and a team that knows exactly what they’re doing. The tone is set from the start, the calm, confident, genuine that only true gourmands can understand.\n\nEvery dish feels crafted, not plated. The burrata melts into the tomatoes like slow-melting butter. The pappardelle tastes like it’s been simmering for days. it is rich, aromatic, and full of depth. And the branzino is nothing short of perfection. Crisp skin, tender inside, cooked with the kind of care not even your nonna could top. A tiramisu and espresso for dessert sealed the deal, and exactly what the night needed.\n\nBut make no mistake: what makes Maiella special isn’t just the food. It’s the integrity of the people behind it, the ones in the kitchen, and the ones who serve it with quiet pride. That’s why people keep coming back. If you’re looking for a place that reminds you why we gather around a table to experience connection, warmth, then Maiella is your spot. If you don’t get that, then go somewhere else.\n\nNow, time to mix another glass of Negroni, you know, the special one they make for the regulars. :)"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WQ1RTMUVNR2hNWmt0YVRsbzVWVUZZUjNsVlZXYxAB",
            "text": "Update 10/26/25 - we ate here last night.  Again, the food was very good and business was thriving.  With all the incoming revenue, do you think you can update the bathrooms, because between those closed because they aren't working at all and those that are filthy with broken toilet seats and a non-working soap dispenser that was sitting there with the pump off to the side and I had to pour the open bottle of soap into my hands, I think you can afford to fix the bathrooms because they are nothing short of disgusting and it makes this restaurant  look like cleanliness doesn't matter.  Not Good!\n\nMaiella has some delicious dishes. We love the Eggplant Stack, Caesar Salad and...the Cacio e pepe is off the charts good.  If anything, I suggest they explore more California Chardonnay options. Especially by the glass.  Sometimes we just want to sit at the bar to have a light meal and a glass of wine and their by the class options are simply horrible (sorry, but it's true)."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MFRUUnRZWEpCWm5OTWNqbHhPREEyYjBveVNtYxAB",
            "text": "Love it"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScmNIUmFhbk5aZDFjelMzbEpPREp5TWxkd2FWRRAB",
            "text": "Great looking place and delicious food👌"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNFp6SjZSUzE0V0U1SlEwTmhUMUV0VTJSUWIwRRAB",
            "text": "The food here is DELICIOUS. My family and I have eaten here often and have always had great service. We especially enjoy sitting outside in the warm weather. I highly recommend."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VdGVWSTVZM2wzVkROUWJIaG1VRmd4Y0RSb1MxRRAB",
            "text": "It was our anniversary and everthing was excellent 😊👍"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4aVJGQktXazFGU1ZaUU9YWkNVbWgzTlZoUVJVRRAB",
            "text": "Great service, great atmosphere, fair prices and hands down the BEST food in LIC. Very glad that I gave them a try. Been back many times now."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRd01qaHBiVGhhVW04M1RXRlJVbXhKVG0xM04xRRAB",
            "text": "Amazing experience 10/10. Cocktails, amazing! Appetizers, Amazing! I highly recommend the Branzino- it was perfectly seasoned- skin crispy, meaty and juicy!!! The short rib was delicious as well! Amazing atmosphere and service!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMGFqRkRaSFpvU1c1d1REUk1ZMHR6YXkxbFVIYxAB",
            "text": "Great food  with an amazing atmosphere, they make feel great with delicious food, drinks, deserts and a fabulous experience.\nFamily friendly. Highly recommended"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsYU5qQnhTa0ZXTkV4U0xXUlJkR2xuUzJWaGVsRRAB",
            "text": "This is a tasty, nicely-decorated restaurant in the neighborhood. Because it gets busy on the weekends (which speaks to its quality), consider coming during a weeknight."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nd1kwVkJlVXhRZGxkQ0xYbzVTMlpRVWkwMVIwRRAB",
            "text": "Great food and service! In a good location, too. Definitely recommend for a date night."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NeUxYcGtRVTVhTFZGcGQwTllObFZ1YWxKSlozYxAB",
            "text": "As a local business owner Maiella has provided incredible food and service both for personal and business dinners and events. The food is always great and the service is exceptional. Highly recommend!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5b1RVeE5iVjlaWkZRelpsRjVMVFZKZHpoVU9VRRAB",
            "text": "We live directly across the river in Manhattan but hop the ferry  to Maiella often because it has become a favorite restaurant.  So much so that when we decided to finally get married, knowing we wanted it to be a GREAT party in a beautiful location, anchored by GREAT food and service, Maiella immediately came to mind.   Once we knew they could accommodate the 'small' [116 people] size the decision was a layup.  And it was a GREAT decision!  Two years later, so many friends and family STILL talk about the great time, raving about the food the service, and the venue itself.  It is really cool being on the river, right behind the iconic Pepsi sign, but none of that is good if the food and service are lacking.  But it was NOT lacking!  And every time we visit since, we are still treated like royalty - because that is how they always treat their clientele.  A hidden in plain sight treasure!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNFVFSlhNa3RJWTBaUVQyNTViaTFHWW1SRE9YYxAB",
            "text": "One of our favorite LIC spots! We’ve been multiple times and always get the chicken parm. Great atmosphere as well as views right bt the water. Service could be better especially when its crowded things tend to get slow but everything else is 5/5."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbE9HRldRa3BGZEVOV1ZXd3pXbG94TjBSRGQxRRAB",
            "text": "Went for a group dinner last month, and everyone was raving about every dish we ordered. The service was impeccable, and the atmosphere at Maielle is absolutely beautiful. We also love that it’s so easy to get there by NYC Ferry—it makes the whole experience even more special. The food is on par with La Pecora Bianca and other top spots in the city. Can’t wait to go back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21salYzVkhibG8yTWpZd05IZFRZbnBsWWpWTmJsRRAB",
            "text": "Dinner excellent, eggplant parm, pasta."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VlNHWnhTSFJNTVRrMFZrRnRUa1ZZTlhKalMwRRAB",
            "text": "Super cute place. Very friendly."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213eWNIRXlWbXhNWm1WSVptdEhjWEV6Wm5WRFJtYxAB",
            "text": "Went for my anniversary with my wife. Had a great time food and service are excellent."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxanV2bnVnRRAB",
            "text": "Always enjoy the vibe and food!!! Great service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWYU9UWlpkRGgxYzBsbGJGWm5WVTVaZWxrNVRuYxAB",
            "text": "I had my wedding dinner at Maiella and it was such a great experience. Tyler, who I was in constant communication with, was always so responsive, patient, and helpful. We had been to Maiella before and loved the food & service we received. Our wedding dinner was no different. Thank you so much for allowing us to have our special day at your restaurant. Everything turned out perfect & we will definitely be returning for anniversaries in the future. This will always be a special place to us!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UWRVTnlVRU53TkRWQmRWUkdNMkZaWjFaamJVRRAB",
            "text": "It was wedding anniversary. I picked this place randomly to surprise my wife. She love it, and the food was amazing. She talks about it all the time. Thank you for making my occasion such a wonderful experience."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ObU5ITnBSRzF1Ym1GbU1HVnZPR0pyVDNCQ1NVRRAB",
            "text": "We hosted a special dinner for my stepdaughters 16th birthday in the private area here and it was great! The staff we were accommodating, the food and drinks were good and our guests enjoyed themselves. They allowed me to bring in decor which added a special touch to the tablescape and space. If you’re looking for a semi private space or place for a night out (we came prior to booking for date night), I would recommend Maiella"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dGJsVk5kRTlzZUhWM2VrVXdhazlMVEZWVFEzYxAB",
            "text": "Whenever I’m craving exquisite Italian cuisine, Maiella is always the restaurant that I turn to! Food is incredible, the vibes are top tier and service is impeccable. 10/10 from start to finish, thank you team!"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25acU56VkZiSGxSU2tReGNsaENiMHhMUkV4RmIzYxAB",
            "text": "We loveddddd it.  Definitely coming back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bFFXRkpZVlpoWDJRNVgyOW5NQzEyVEZZMFYwRRAB",
            "text": "The food is to die for. The service is fantastic. The view is impeccable. Would definitely recommend!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sS1RYWTBlRkZXYzBsaWRHUmtUREpqU0MxVFMxRRAB",
            "text": "Ha, a large event and go here often for dinner. Always great!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVVJuWllWMnBoUTNCYWJXdHlVRTl4VVRKQlEzYxAB",
            "text": "Our go-to spot. Always fantastic!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNE1tVjFPR0pYZWxwSGNuWm9RMGQwVGxaMU9FRRAB",
            "text": "We had our son's Wedding Rehearsal Dinner at Maiella and the event was a huge success. The food, wine, service and ambience were outstanding. We received so many positive comments about the entire evening from relatives and friends who came from all over the world. I would highly recommend Maiella for an intimate dinner or dinner party for 40!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210R2R5MTBURXRHZEMxSFdIbEdUVVZ3ZVc5S2VYYxAB",
            "text": "Local fave! Amazing chicken parm!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTkxWVnBka0ptVFRWS2F5MTVUSFJ4VG5kSmExRRAB",
            "text": "Always Excllent. Maiella is our neighborhood favorite."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kb1NGTXdNa1JWTTBGRVMwbFlUR2xwY0dab1ZuYxAB",
            "text": "We have adored Maiella since the first day we stepped in for a drink in 2021 after the July 4th fireworks. We have since moved into the neighborhood and it's our regular Italian fave. The service is wonderful, attentive, personable. Feels like coming home. The food is fresh, the pasta is made in-house, and the atmosphere is upscale cozy. We highly recommend on any night of the week."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQ2VtaDJaVWhmZG5OdUxYaDZWRlJ6YkVFdGJtYxAB",
            "text": "I had my daughter’s bridal shower at Maiellas and it was fabulous. Everyone loved the food, service and  the drinks.Also my family had Thanksgiving day dinner and the food was delicious. Love the pasta and eggplant. Always a good choice!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NdGFYWXRVMWh6Ulhwd2NuQXlhV3RGY25sa1dHYxAB",
            "text": "Outstanding food presentation, taste and service!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNU16bFNUalEyTm10RFEweEdRV3RJUTJOT1YxRRAB",
            "text": "My daughter and I had dinner for Mother’s Day! It was fabulous. We loved the food, service and atmosphere. We sat outside .., it was a beautiful day.."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORVRtMU5URGQxUkhJelh6TnhSalZ5UTBKbldFRRAB",
            "text": "We had the pleasure of eating at Maiella after my now-husband proposed in the summer of 2016, while visiting NYC from Ohio. It was delicious and we always wanted to go back. In 2025, we finally made our way back! They sadly no longer had the delicious cannolis from 9 years ago (best i’ve ever had to this day) and the outdoor patio was under construction, but our meal was still fantastic and the staff were lovely. We will always make time for Maiella whenever we are lucky enough to find ourselves in NYC."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25saE9IbEVUWEZUY2xwRFMwdHFkbnBWZG5KcFYzYxAB",
            "text": "One of my favorite places in LIC. The food is fresh and handmade staff is friendly and inviting. Atmosphere is romantic and lively. Grateful to have such a great spot so close to home."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMFZVTlJYME5hWDNvMlRVTnlZM0o2YUc1S1ZYYxAB",
            "text": "From the moment we walked in, the staff was friendly and attentive. As we waited for the rest of our party to arrive we were offered a glass of wine. The food was great, the restaurant was busy but not too noisy."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbGJGWk9VVGRvYjBSUFlVaHVaVjl5VW5CNVEzYxAB",
            "text": "Never had a bad meal or item here! The bolognese and the truffle tagliatelle are amazing. A go-to when my parents are in town- my mom always raves about the pasta."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTmNVZEtWRGd6YWtFMlJHOTFXVkZOVmxKTldtYxAB",
            "text": "Excellent experience"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odk0yOTZRMTl3V1c4eWVVVkZZVTkzV2poRE5rRRAB",
            "text": "My first visit to this restaurant. Service was excellent, they have ample staff. Food was good, fair prices. I received an email coupon and the waiter looked at it, no problem. Other restaurants, the wait staff have no clue on promotions. Will definitely return."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRll5MHRSMmh1VEZCUGN6ZDFiRVZ6TXpkS2NGRRAB",
            "text": "If this is what they think Wagyu tastes like, someone needs to take a field trip to Japan—or at least Peter Luger. The “steak” tasted like absolute garbage, maybe some kind of frozen Chinese Wagyu knockoff. Whatever it was, it sure wasn’t real Wagyu.\n\nThen there’s the pricing: rip-off city. They’re charging Scarpetta-level prices while serving child-sized portions of Cacio E Pepe. News flash: you’re not Scarpetta. Not even close.\n\nTop it off with a rude front desk—and you’ve got the full Maella “experience.”"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMHBQbG1RRRAB",
            "text": "I visited this restaurant with 4 friends on a Saturday evening. We had a reservation made two days in advance and we were seated at a small table right next to the restroom even though the restaurant was empty and many larger tables were open. When I politely asked to be moved, the staff (hostesses and a manager) looked down on me and my friends and completely ignored the request.\nThe service was cold, dismissive and very disrespectful. I felt like we were being treated differently and unwanted.\nAbove all, the food was tasteless especially their pasta.\nIt is no surprise this place stays empty during prime time. When you treat guests this way and can’t even compensate with the quality of the food you serve, people come once and never come back."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQ1MwNTZUMVpYVjBjMGNEbGpNM1pPVHpWS1JVRRAB",
            "text": "Maiella is a beautiful restaurant, along the water, with great service and delicious Italian food. The eggplant appetizer (pictured) is a must. Have been here several times and never had a bad meal. Their pastas and pizzas are all amazing, hard to pick a favorite. Will definitely be back soon."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwOGJxdWV3EAE",
            "text": "UPDATE: returned in 2020 and it became a favorite of ours until we left LIC in 2023. The meatballs, chicken Marsala, salads and service kept us coming back. Those views and atmosphere also helped keep us excited about a nice dinner out. Recommend to highly recommend\n\nBeautiful place with an upbeat atmosphere, pretty setting and appealing menu however the food, especially for its price, was not on par with other top Italian restaurants. Certainly worth a try and enjoyable but not a staple in my lineup."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMlRIcFlTeTAyTXpoWlVUTlpTWGx2TFRWVFlXYxAB",
            "text": "Maiella is a very nice venue at Hunters Point. Although chairs are not so comfortable and tables are wabbling too much (and our was also super tiny).\nSome appetizers are really executed well, such as beets salad and fried eggplant carrozza in tomato sauce.\nHomemade pastas are worth mentioning. One of the best Spaghetti Caccio e Pepe I tried in the last few years, no kidding. They have a presentation in front of you how do they make it. The pasta was perfectly cooked al dente and it had the right amount of black pepper and pecorino cheese.\nPork cutlet with a baby broccoli rabe was a bit overcooked, but the flavor was there.\nNo desserts this time.\nWe drank Gavi white wine.\nPrices are moderate, no ripping off.\nOverall, they are doing a good job, will come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUVMwZEphMkZKWkhkMFFscDRZblJ2VnpBM1lWRRAB",
            "text": "\"The so-called manager is rude, and the hostess has a childish attitude. This restaurant is overrated; the drinks and food are very basic, similar to what you would find in any restaurant. Here you just pay more."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podWQwMUVSRWgwVjNVNWJVVlVTVVkzTlhSMVJGRRAB",
            "text": "I felt very taken care of. Great attention to detail. A lovely dining experience from start to finish. So flavorful and filling."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oV1pGQmpSV2RXVnpCVGVFZDNaREE0TkY5ZlRGRRAB",
            "text": "Deliciosa comida italiana. Exquisitos cocteles. One of my favorites restaurants when I go to New York and surrounding areas."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbHRIeXp3RRAB",
            "text": "조용한 식사를 원하신다면 비추.\n하지만 즐겁고 화려한 식사를 원하시면 강추\n음식은 모두 맛있어요~~~$"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNamZ6SUd3EAE",
            "text": "분이기 좋습니다..사진찍기 이쁘고 음식도이쁘며  맛잇어요..고급지고.."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJbzVlSkVREAE",
            "text": "웨딩으로 다녀온 곳인데 서비스가 매우 훌륭하고 음식도 매우 맛있었다."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSlMybEhSbTVwUTNSTmJreGhYMk5XVUZZd1FVRRAB",
            "text": "What a great place to sit, eat and have a great view of manhattan!  The food was spot on, it was not pricey, and we got a show because I ordered the caccio de Pepe   It was really good.   And because we arrived there before our reservations, we were able to walk down next to the east river and get a special view of the city."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdVBTWndRRRAB",
            "text": "Maiella has become a family favorite of ours. Always warm service, always delicious food. From fresh, homemade pasta to rich, house-made sauces (my favorite is the pomodoro), and if you're not a pasta guy, the Branzino is also delicious. The tableside pasta is a great experience--not the gimmick it is at most places--as it's not so much made tableside but rather assembled with a flourish in a fire-melting, tangy Parmigiano Reggiano cheese wheel. This way, you get the benefit of the pasta being prepared perfectly in the kitchen, along with the glamour of seeing it finished with the romance and flavor of a real Parmigiano Reggiano cheese wheel and fresh, hand-shaved truffle.\n\nNot necessarily a budget-oriented experience, but still a strong value and a great place for delicious food--whether it's a special occasion or just an excuse to dine out.\n\nOh, and the view of Midtown Manhattan makes Maiella basically the place to go on warm summer nights, with a ferry that runs to and from Midtown (and other destinations) multiple times an hour.\n\nOur only downside in our most recent visit was that we felt our server could have been more attentive to our table. Since we were a larger party, we weren't placed in the prime seating of their dining room where service is constantly flowing, but rather in a different area that wasn't quite as trafficked. We feel this could have been a fluke as every other one of our visits we have been very well tended to.\n\nHighly recommended."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcnFqM2Z3EAE",
            "text": "An absolutely unforgettable experience.\n\nCame here in late March and had an exceptional time. Sat in the bar to start with some drinks, and a shrimp cocktail.\n\nWas seated promptly at the reservation time. Got lucky and was seated near the window.\n\nThe ambiance is upscale romantic. The staff professional. They didn’t skip a beat. Some of the best service I have had and I dine out, a lot.\n\nOrdered a beet salad and the Cacio e Pepe, table side, with some delicious wine.  The beet salad was sweet and delicious, while the Cacio e Pepe was absolute heaven. Sinful really. The fresh pasta and melted parmesan was an experience I’ll never forget. I am still kinda shocked about it.\n\nNo dessert due to the luxurious Cacio. Left the restaurant and meandered around the boardwalk. What an incredible sight!\n\nA highly memorable experience and recommended visit. You will, not, be disappointed!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxM1gxOW1iMlZUYmtOZlNsUkhhekJ1TFhSVVRIYxAB",
            "text": "Surprise 65th birthday gathering for my sister and it went very well. Beautiful ambiance and the food was very good. We were nickel and dimed for everything though. Just saying..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ME0xQlpaRlZ1WjFGSmJHeGhVbkZqWDBSbGJuYxAB",
            "text": "Had the pleasure of celebrating my line sister’s engagement at this beautiful establishment! All of the staff was very accommodating and everything went smoothly. Out of all of our appetizers, the meatballs were to die for. And they made what was probably the best French 75 I’ve ever tasted. Very blessed girls."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxR01uTTRWSEJxV0U5T04zWjBUMjFUZFdOeGNsRRAB",
            "text": "Really nice restaurant. Great ambiance, attentive and kind servers and really good food. They offer a pre fixe 3 course menu which looks pretty good. My only remark was it took a little too long than expected for our food to come out. Not sure if it was because the restaurant seemed pretty full at the time we arrived (8:30pm on a Tue) or smth else.  Anyways the meals we chose were delicious, we had a good evening out and enjoyed our experience at Maiella."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbHNMYV93RRAB",
            "text": "We had a fantastic dining experience at Maiella on a Thursday evening. The cozy and festive ambiance was perfect for a night out with friends. Our party of four was well taken care of by the friendly and attentive staff. We ordered the salmon and branzino as our main courses, and both were cooked to perfection and delicious. The tiramisu for dessert was also a highlight - creamy and well-made. Overall, we were very impressed with Maiella and would definitely return. The atmosphere felt like a holiday treat, and we appreciated the warm and inviting vibe."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN01fU0RREAE",
            "text": "I visited Maiella during their restaurant week. They are very welcoming for families, and the staff are very hospitable. They ensured that my toddler had an enjoyable experience as well.\n\nWe ordered the alavodka pasta, which was exquisite. As part of the restaurant week, we also ordered the baked mushrooms, pizza, and spaghetti! Every dish was delightful. The mushrooms were outstanding and were my personal favorite.\n\nFor dessert, we indulged in a delicious chocolate cake and tiramisu, with the chocolate cake being my favorite.\n\nThis venue ranks among my favorite spots in Long Island City."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cE1qaDZRRRAB",
            "text": "Their roasted potatoes are SOO good!! My boyfriend and I went there and the food and atmosphere were amazing, the waiters were very attentive and refilled our waters whenever it was low. Absolutely amazing place and their natural lighting through their glass windows made everything in their restaurant look beautiful! Their interior design was also very nice and fancy!! I loved it here and will definitely come back to eat here!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NWYzdGp3RRAB",
            "text": "I was excited for this place but there is some seriously lacking on attention to detail. When we sat down one of the wine glasses has lipstick stain on it. We then ordered oysters and there was a bug on it.. the short rib was tender but very dry, I thought it was supposed to come in a red wine sauce but there was little to none. The ambiance is nice & the service is incredible but there were some missing elements if they’re trying to be an upscale place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcGZxWjFnRRAB",
            "text": "My wife and I had our wedding here recently and have nothing but appreciation and gratitude for Maiella and their staff. The general manager Eduardo was a huge reason why we wanted to book this place. He made us feel well taken care of from the start of the wedding process all the way to the end. The dishes and cocktails were absolutely delicious and the lighting in the restaurant and decor looked better than we had hoped for. If you’re planning an intimate wedding or special event, we would highly recommend Maiella. Thanks so much for making our special day a truly memorable one!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMGNsOUZiRlJ2VjIwd1ZHZGhMWEJITmtORFoxRRAB",
            "text": "Food was amazing.  From the appetizers of shrimp oreganata and the Marguerite pizza to the main course of pasta bolognese, salmon and the CHICKEN PARM was a hit. Everything was fresh and tasted homemade.  Dessert was good but portion was so small.  Cheesecake was the size of a quarter.  3 stars for atmosphere because it was freezing inside of restaurant.  Would definitely return!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3clpxNnlnRRAB",
            "text": "I have come to Maiella many times over the years and love the food, location, and overall aesthetic and atmosphere of the restaurant. We were initially thinking about booking an engagement party at Maiella but after looking at several wedding venues in the area we thought, why not buy out Maiella for our wedding instead? The restaurant is already beautifully decorated and was more our vibe than the other venues we saw. The things that were very important to us for our wedding, besides the music, was the food and we knew at Maiella it would be phenomenal. We booked our wedding at Maiella for October 2024. We worked closely with Eduardo and then with Tyler, both of whom were readily available for walk-throughs, mapping out the venue for our event, and any questions we had to ensure our wedding day was perfect. Maiella is in Long Island City right in front of the Pepsi Cola sign and the location was ideal for us as it is close to Astoria and the city. The view of Manhattan was perfect and we took all of our wedding pictures right on the pier before cocktail hour in the backyard area of Maiella. Our wedding had a total of 120 guests and we set up three long tables in the main area, two smaller tables in the curtained room, with the dance floor off to the side. By the bar there was plenty of room where we set up a mirror photobooth [@ MemoryMeBooth], dessert table [@ CreationsbyChastity], and seating chart. Our guests still talk about how amazing the food was and how amazing the vibe of the wedding was all night. I would highly recommend anyone looking for a wedding venue in this area to book with them, you will not be disappointed!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKS1REZ3RWRlIwUTNNM1UwcE9VVTVqT0Y5dFRWRRAB",
            "text": "First of all, the food was not of a good quality.\nI got Taliategli alle vongole and the dish was smelling like fish oil (I am not an executive chief but I know that sea food needs olive oil, some butter, garlic, parsley, lemon and white wine).\nSecond, all the portions were half. My husband got the branzino and we were expecting the whole branzino, like they offer in all restaurants we've been, but we were so surprized when just the half of the branzino appeared in our table. Also my vongole plate was half a portion. I mean, if I am paying the price you want, please be considerate and give me the portion I deserve. I calamari fritti where so dry to the extend that when you were eating your could have listen the sound of a dry wood in your mouth...\nSecond, the service was so-so. I asked a few times to different servers to be brought some mayonese and after none of them appeared on my table with a mayo and when my food was cold they just told me \"we don't have mayonese\"... I mean, give me a break: a restaurant does not have mayonese?! And how much time do you need to realize whether your have or not mayonese?!\nThe only thing I would give 5 stars is the Architect or whatever they call the guy who had decorated the place.\nLong story short, we paid almost $400 for half portion dishes, dry food and fish smelly pasta...\nA big applause to the owners for the quality they offer..."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbGNUeG1RRRAB",
            "text": "The food and service were amazing. The pasta was fresh and the tiramisu was perfect. This place is perfect for a quiet date night, the only issue in this area is parking, but it's worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQ1NXZGlZbXhOY1c1YVNXNXlSRkZXY2tOd2EwRRAB",
            "text": "This restaurant is phenomenal, I’d recommend anyone to get the table side pasta for the experience. It’s not just an experience though, the flavors lifted off the plate.\n\nThe staff are friendly and catering. This restaurant wants to make sure every guest feels welcome and comfortable, will definitely come back again!\n\nDon’t think just come and enjoy your evening here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaDZfMTRBRRAB",
            "text": "The staff were so patient and accommodating. We celebrated my father's birthday here with 16 guests and were sat in a lovely table off on its own side. We all were given special individual attention and the food was spectacular. I highly recommend this as a special experience.\nThe kid menu food is so delicious for the little ones!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUeVlHQkl3EAE",
            "text": "In an attempt to make me like NY, my fiancée took me to Gantry and we ended up staying so late there that it was dinner time, and voila! We ended up grabbing dinner here ☺️\nWhat an elegant, gem of a place! The relaxed ambience in there is great for a date or family night. The interior is stunning - especially all the spectacular flower decor!! Gave me inspiration for our wedding!\nFinding an authentic Italian restaurant is a pure delight when you’re a pasta lover 🍝😋.\nFood was absolutely delicious and portion size was just right for us. I didn’t get to take pics of all the food we enjoyed here but I will share the few I did take.\nA must try! I can’t wait to go back 🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cTRETmhBRRAB",
            "text": "I was excited to try the restaurant and visited it with my partner for dinner and we had a nice time. some of the dishes were confusing, the combination of flavors just didn’t go well together. But some dishes were great, I would go back for the Margarita pizza and the tiramisu.\nI would like to go back and try the other dishes."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcE4yTmxnRRAB",
            "text": "Salmon with orange chili vinaigrette was good but chili flavor was lacking. Tiramisu was good but not great. The service was impeccable. Nice views and atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVlIxRnphemxTWkhSTllYVmpRMWxoWDNveWNIYxAB",
            "text": "While the location of the restaurant is fantastic—right next to Gantry Park—our experience was unfortunately quite disappointing. The ambiance was a significant issue; even next to the window, there was no outside view, and the noise level inside, combined with the narrow seating, made it impossible to have a simple conversation.\nWe were truly hoping for a great meal, but the food did not meet our expectations. Out of the five dishes and three cakes we ordered, only the tiramisu was enjoyable. The rest of the food tasted like cheap deli-level fare, and the basic spaghetti was surprisingly sour. While I appreciate the lovely location, the overall experience left us feeling that the restaurant is definitely overrated"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcS1USld3EAE",
            "text": "The only bad thing was the weather. Other than that? Everything was perfect.\nThe staffs really took good care of our needs, the foods were great, and the music..... I love it!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMWRtcGhUMmcxT1VOTVdHaFFOazFvTTE5a2RXYxAB",
            "text": "I had made reservations at 4:45pm for 6adults and I brought my 2 toddler. I walked in the restaurant was empty with the exception of 3 tables occupied at that time.There were two tables set up for large party however they insisted on squeezing 6 adults in a small round table. I asked to get a larger table. The manager acted as the restaurant was fully packed with a line outside. He said I have to see we are completely booked. They set up a table right in the area where people walked in and out. In the middle of the walk way. I was completely uncomfortable and felt as if they intentionally found the worst place to sit us. After a two hour dinner, I noticed that the table that was set up for the large party  was being split into individual tables of two. This table was never filled and they made the choice to  deny us the table. They were very unapologetic for their lack of hospitality. It was my 11th wedding anniversary which was supposed to be with a nice dinner with a view and warm atmosphere. But I ended up feeling like a pest that was an inconvenience. With all this we paid for a $600 meal. Which the food was not worth that. I have gone to places where the food is definitely work it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaTlIZlFREAE",
            "text": "We had good experience before and this time we came back with a couple friends for dinner.\nGood service, delicious food and nice ambience. Delicious Beef Meatballs, and the Pan Seared Duck Breast was flavorful. The Rigatoni with sausage was  good but a bit salty.\nWe enjoy our dinner and will sure be back again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcHUtMk9REAE",
            "text": "I think Maiella is a great Italian spot in LIC, you get a warm and cozy atmosphere with lots of space to enjoy the excellent music selection.\n\nThe caico e pepe was really good and I would order it plenty of times again. The beet salad was perfect to share with three people and refreshing, the goat cheese was really tasty.\n\nThe only feedback I would provide for the dishes are that the meatballs were a little tough, not your homemade crumbly style one’s. But dense and little saucy, in general lacked a little salt too.\n\nThe chicken parm was a great size and cooked well, however as well, I felt the salt was a little low; I will say I like that they keep the pasta separate and serve it so the chicken doesn’t get soggy.\n\nThe sauce on the pasta seemed different than what was on the chicken, and I think if they used the same sauce on the pasta as on the chicken it would elevate the dish a bunch.\n\nA great place for drinks too, the cocktails were made well and are curated."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weWFqRkhUVXRZUkc5NFFubHdOV1JYTTJGNVNFRRAB",
            "text": "Dined here for Fourth of July, some of the best Italian food in Queens.\n\nTheir chicken parm is delicious, Cacio Pepe prepared live on a cheese wheel in front of you and tastes amazing too.\n\nMake sure to try their cappuccino after your meal 😶‍🌫️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVWFVc3hObTFvVEZoSFV6QktjVzF2U2tOMlkyYxAB",
            "text": "We had reservations so we were seated right away. Our server was ready as soon as we sat down! He was very friendly, quick and even read my daughter’s lips when she sneakily mouthed that it was my birthday and he turned around quickly and got a candle for my delicious affogato! The appetizers, Caesar salad and meals were all delicious! The Ambience was beautiful! I definitely want to go back and highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOWNHa2N3EAE",
            "text": "The first time I came here it was a few minutes too late and we got turned back around. Anthony was very sorry, asked if we can come back & said he’d take care of us. Well, I came back a few days later and let’s just say Anthony was a man of his word!(thanks for the round of drinks)\n\nThis place is incredible. Everything was a HIT! I brought my clients here during this visit and we had a blast. The ambiance, the drinks, the food and the staff were EXCELLENT. Every bite was delicious & I absolutely loved the pasta show!\n\nI may have to travel back here monthly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdl92QTBnRRAB",
            "text": "Food was delicious. Cocktail drinks were very strong. so if you like to get your monies worth order any cocktail you won’t be disappointed. I had oysters for my appetizer and it was my favorite. Tagliatelle Al tartufo was so delicious. Cacio E Pepe was a bit salty but it’s the cheese that made it extra salty but still delicious. Cheese cake and chocolate cake is a must try. Service was a ten. All staff was very attentive. Manager was very nice and made sure we were satisfied. I would definitely recommend eating here."
        }
    ],
    "reviews_count": 82
}