{
    "name": "Loukoumi Taverna",
    "place_id": "ChIJ11iMTW5fwokRYr9z-BtZDr0",
    "grid": "QN1",
    "address": "45-07 Ditmars Blvd, Queens, NY 11105, USA",
    "rating": 4.7,
    "user_ratings_total": 1118,
    "phone_number": "(718) 626-3200",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GM09FVXRhUzFHYUVwUGRXNXVUbkp2UVZGeWFGRRAB",
            "text": "Exelente volveré a visitar. 10 de 10"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wak9UTk5OMlJVUkhWT2NIVlNRblp3WjFkRGMzYxAB",
            "text": "Clean, friendly, and a flavor explosion from the meatballs, to the sausage, to the orange cake, to the tzatziki and humus. Flavorful explosive, flavor explosion."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4algyaHlSbWg1YlVaalRURmhiMlZoZG5CeFFrRRAB",
            "text": "Jeannie was our server and took very good care of us. Friendly, knowledgeable and professional. The food is always delicious!! That’s why we’ve been coming to Loukoumi for 10 years!!!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNdFlYYzBNRVp2Wm5CWlVFRnBUMlptYm5STWEwRRAB",
            "text": "Our first time here and everything from the ambiance, food, and customer service was top notch! huge shoutout to JEANNIE!! She checked up on us, made sure we were comfortable and enjoying the food! Thank you for an amazing experience, OPAAA!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5c04xRk5YMHhqVm5aTFpXcHNhV0pJVldGMmFrRRAB",
            "text": "If you’re a local in the neighborhood, you HAVE to come here to get some authentic Greek. Ask for Jeannie—she will take care of you!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KelYxVlpjWEZMZFdWaE5EVlBWRE5xUkdaeVMzYxAB",
            "text": "The service was excellent, and the food even better! Branzino was so good with the lemon potatoes. Will be back!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTmMyOXhiakIzVjNaaGFXNUdibVZ2YnpkdVIwRRAB",
            "text": "I had such a great time at this establishment. The food was delicious, prices were great for the quality, the service exquisite, and atmosphere was jovial and personable. Shout out to Jeannie, our server - consummate professional. I highly recommend a night out at Loukoumi Taverna. And pro tip - order the house red wine. Pairs deliciously with any dish!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUE9WTnhOVmM1UkVGQlJGQlhiV2hTTW5veVRFRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ Absolutely Wonderful Greek Experience!\nLoukoumi is truly a gem in Astoria — a restaurant that captures the warmth, authenticity, and generosity of real Greek hospitality. The food is phenomenal: every dish feels homemade, prepared with care and flavor that instantly takes you to a seaside taverna in Greece. The grilled octopus was tender and smoky, the moussaka perfectly layered and comforting, and the loukoumades… simply divine!\n\nWhat makes Loukoumi stand out even more is the service. The staff are genuinely welcoming, attentive without being intrusive, and always eager to make sure you have everything you need. You can feel that they take pride in what they do — not just serving food, but creating a memorable experience.\n\nWhether you come for a quiet dinner, a family gathering, or just a glass of wine and some meze, Loukoumi delivers every single time. Authentic food, friendly faces, and a cozy, inviting atmosphere — this is Greek hospitality at its best.\n\nHighly recommended — 5 stars all the way! 🇬🇷✨"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcmJWb3laRk5DZUhwQmJrMVdRMWg1UzBweU1YYxAB",
            "text": "A perfect example of refined dining."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTWJteEVZMk5EWmtSWmFuTnhjWEI0VlY5eUxVRRAB",
            "text": "If I could give Loukoumi Taverna 10 stars, I would. I just left and I’m still smiling. From the moment I walked in, it felt like I was being welcomed by family—not a customer number. Every plate that hit the table was a knockout (truly, not a single miss), but what made the night unforgettable was our server, Chrisa. She’s a gem, sweet, warm, and effortlessly attentive. She felt like home! Chrisa anticipated what we needed before we even asked, checked in at the perfect moments, and had spot-on menu guidance. Water and wine never dipped low, pacing was perfect, napkins magically appeared when we needed them, and she made us feel like we were the only table in the room. 😊\n\nLoukoumi nails that rare combo of heart + flavor. Consider me a regular. Run, don’t walk, and when you go, ask for Chrisa. She’s the standard."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGek1uRjVRVEptWDNCQ2RYTjBiMHA2VFhSVmIzYxAB",
            "text": "Had the pork souvlaki. It was amazing. The appetizers was enough to share and we all enjoyed it."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVVRHOWFYemxTWWt4c00xOTBVMW94ZURNdGVXYxAB",
            "text": "We had a great dinner at lookoumi restaurant!\nJeannie treated us so well!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gd1JrVTFabnBpTjBabFdqSkJUMUpXZUc5cFFWRRAB",
            "text": "Jeannie was our waitress and she was amazing! Service and food was awesome! I definitely recommend this place!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUmNtSmlVRVYwYUc5S1NYRjRkekp0Y20xRWJtYxAB",
            "text": "We love coming to Loukoumi! Jeannie recommended the salmon biftekia and it was delicious."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUVZEY3pVME5rUlZGUFluUnBWMVpDUTFCRlpFRRAB",
            "text": "I celebrate my bday at this restaurant the food is awesome and Jeannie served me. Exceptional, Exceptional, Exceptional!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swelQzaFpMVkZaYjNKVFprbENkVEJGVkhsbVZIYxAB",
            "text": "Service was amazing, the food was really good. Great atmosphere here even on a late Sunday night. We came for a birthday and were treated so well. Wilson was the best server and really cares! Would highly recommend"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMU9ETk9WalJXTFROemQxbGtRVFJJVW1OVU1XYxAB",
            "text": "Ernest was awesome. Great dancer"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjdGNHOVNYMkpRTkRGa09HRnZTVGhPZWtJelFuYxAB",
            "text": "Thanks Jeannie!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUWEybHdZMng0ZEZkUGNFUmtPR2swV2tKSVNsRRAB",
            "text": "Very nice stuff and welcoming atmosphere. Food is delicious! I recommend"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsZmJFOTBRVms1UmpORVVEWm9VbEIzUmxOd1QxRRAB",
            "text": "Loved the food and service and atmosphere were amazing. I'm definitely coming back to taste more of the menu"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adFducHhVMmROVEdKeFpUVlVVbk40VjBoVU5uYxAB",
            "text": "Family oriented style service with excellent food options and great old school atmosphere"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORlJYWjJjVVkyTmkxT2RYazNPRFpoVTJONGExRRAB",
            "text": "Really great food. Everything on the menu is a hit. You can’t go wrong with anything"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SZmFrVkRNazlTUXkxVE4yVm1WM3BtVjFOVlIyYxAB",
            "text": "Amazing food. Impeccable service. Our server Ernest went above and beyond making sure we were taken care of. Lovely for a family night out or date night."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOM2IxZDRORTkxVm14dFRVOVRNRnAxY2xKWFVYYxAB",
            "text": "The food was 5-Star delicious !  The service was impeccable. Look forward to going again and again. Highly recommended."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMFNsODRRamRZWHpoNVpWOHRRM2g1ZDNBeGVVRRAB",
            "text": "The food is great and everyone is so nice!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUGJHazVZVmxCZUdoMWRsaEhValp0Ulc1S01VRRAB",
            "text": "We went for dinner. Ernest was a fantastic waiter. Great food. Great service. All around good time."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRFdYZHZkR2xWWWxsMFdtRlFjME0zVlRKS1dHYxAB",
            "text": "Great food good home style"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veGJGOWtZM1JwUWxFMGVITk5kalJXWW1FM1NGRRAB",
            "text": "Best food in Astoria"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUkxXMXpja3BJZVhOUmRISlZhbGxHVkVnMU9XYxAB",
            "text": "We celebrated a birthday with family. The service was excellent and warm as always. The food was plentiful and perfect. Thank you to the Loukoumi staff for always treating us as part of the family."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMGNHY3RXWGQyUjI1Uk4xaFRiMkZ0TWkxdFdWRRAB",
            "text": "Ernest was awesome. Very friendly and super attentive. First time here. Great experience. Highly recommend"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sM09YZHNOMlJHUVcxVFlVODNRbVpMVTNreWFFRRAB",
            "text": "Top Tier Greek spots in all of Astoria / Queens / NYC\n\nApps: tzatziki, saganaki, grilled calamari, greek salad\nMains: shrimp skordates, snapper, chicken souvlaki\nDessert: Orange cake & espresso\n\nStaff went above and beyond. Will be back very soon."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcmFqUjVkbUZuV1ZvM2NpMXlRVlZmZEdnMFdtYxAB",
            "text": "beautiful service & people! Ernest and staff were absolutely fab.\n\nThe food was delicious, flavorful and authentic.\n\nYou feel like you’re at your grandmothers house eating dinner. So so friendly and kind!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MlpFSnRSWGd0ZW05cFVqZE1aMkZIZEU1T2NVRRAB",
            "text": "Great food and cozy atmosphere. The octopus and shrimp were delicious, but the highlight of the meal was the eggplant spread.\n\nAsk for Ernesto! He was great!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZME1FVTNNalJqY1VWUloxcERZM05qYTJkR2FuYxAB",
            "text": "Great place ! We will come back !"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNE1HTmtjMVJ1VG1kS1lqazJhbmM1UW1oVFZHYxAB",
            "text": "Cervicio excelente uuuu la comida ni digamos deliciosa, una experiencia unica en gastronomía variedad de sabores y al detalle de cada platillo.\nEl cervicio excelente personal amable y de ambiente que da gusto volver, impecable."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTVNUQm5jVWRWVjJGdk5VeDFORUU0TWxBd2VsRRAB",
            "text": "My husband and I ventured out from Manhattan to try this spot and are so glad we did. The food was amazing. The cypress salad with chicken added was my entree. The olives and cheese in it were perfection. Service was attentive and helpful. Well worth the train ride to get there."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cck9IaHRkRUoyTjNnMmJYZDJRWGRmT0hGUE1HYxAB",
            "text": "Great restaurant. Good food and wine,  fabulous and friendly service, the staff always ready to help and the owner, present and involved as well. One the greatest thing is that you can eat, talk, enjoy family and friends and no one ever, ever it's going to tell you to leave because they need the table for some one else. It's a great plus"
        },
        {
            "date": "3주 전",
            "language": "el",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMVNHbzJOa0paU0V0M2IwSk1TbXRJZVdGV2IxRRAB",
            "text": "👏👏👏👏"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaWIyTklkRkl4YUc0ek5GTk9OMUF0Tm5CbGJXYxAB",
            "text": "Nice food,friendly atmosphere!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM09UWkdURFZMTjJkWmJGYzVlVEJaVlhwS1lsRRAB",
            "text": "Delicious!! Reasonable prices.\nExcellent service 👏🏻 👍🏻 👌🏻"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNWJWQkxTR1JDTVVNeVVHNXhkazF2VkZadFNtYxAB",
            "text": "The staff were attentive without being intrusive, and you could tell they genuinely cared about making every guest feel welcome.\n\nThe food was exceptional. Every dish was beautifully presented and full of flavor — clearly made with fresh, high-quality ingredients. My personal favorite was the grilled seafood platter which was perfectly cooked and seasoned. The drinks were also top-notch paired perfectly with the meal.\n\nOverall, this restaurant exceeded expectations in every way — food, service, and ambiance. Whether you’re looking for a cozy dinner for two or a place to celebrate with friends, this is the spot. I’ll definitely be coming back soon and asked for Ernest"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTFNXbHFSRlp1WW1WdGVIZHpUaTF4UWxwVGNGRRAB",
            "text": "Had lunch recently and everything we had was exceptional.  Closest to cuisine from Greece that we've ever experienced. Sevice was fantastic.  Jeannie was extremely knowledgeable and attentive. Worth going off the path to visit."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scFpqZFpXbEV5WTBaemNqbGZSRWxuU21oVE9YYxAB",
            "text": "Loukomi is awesome. Every time I come there I am treated with friendliness and respect. They always suggest very good wines to pair with the food and the food is delicious. Ernest and the greek lady whose name I forget, eith the blond hair always take care of me. The food id delicious and the service is phenomenal. I love the lamb chops and any of the grilled fish are phenomenal. The gigantes beans are ones of my favorites and I always have my main dishes with the scordalia (dandelions) or lemon potatoes which are awesome. This is one of my favorite restaurants in New York and it is better than many restaurants in Greece, I was these for 15 days two weeks ago and I promised to leave a review mentioning this here. I would recommend Loukomi to anyone who wants to have a great time, great greek food and drinks. I will keep on coming back for years to come. Thanks everyone! … the name is the waitress is Crista, just found out tonight as I passed by for some grilled octopus!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbFRtSnZNWGRqVTBoNlpqSnVZVWt3UVZOTE1tYxAB",
            "text": "Hospitality was excellent. Couldn’t ask for anything better. Lamb chops were fine."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMFFqTTJObGRvVERGblYyUnNVRzlwVW1wbVJXYxAB",
            "text": "Wilson welcomed us with open arms and provided excellent service! The food was amazing. Will definitely come back :)"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWVVXNUxRWFpxZWxJNFNHSkhVV2RzWTNaVWNsRRAB",
            "text": "Delicious food, friendly service, and lovely calm atmosphere"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMVVtaDJXVTh4VldWcVpXMHphalU0Y2pSQ1EyYxAB",
            "text": "The food was great! Jeannie was wonderful and made the experience welcoming. Good drinks, and the the food was delicious. Will be coming back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWU4ySmFRVTlpUlRKbFEwcExUbll4YkZnemJVRRAB",
            "text": "Loukoumi is a wonderful neighborhood restaurant. Service is always amazing and food is always delicious. Tonight Jeannie recommended the Pink Snapper. So glad we trusted her recommendation!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVVEzbFBaamQzZDFBNVZERm5SR0ZhYW1Kb1RHYxAB",
            "text": "Ernest was a great server who made us feel so welcome!! Food was delicious especially the Cyprus salad! First time customer, we will be back!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReWNrY3RjVTl4Y2xNNFJHVjJhVVIzZVhSaWVGRRAB",
            "text": "Ernest was welcoming for our first time. He was friendly and helpful in picking out recommendations on the menu. Couldn’t ask for better service. Food was great and atmosphere was amazing. Would definitely come again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdFR6QnJRVTFHWmxkRlFscHpiV2x1ZFdKNVIwRRAB",
            "text": "Fantastic Greek food! Service was A++ (Jeannie and everyone else were all  awesome) and  food was super delicious! AND super reasonable price!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscVIyeDNUbGR3V1hseVFtMUxlalY2Y0V3MVMzYxAB",
            "text": "Jeannie was great!! Felt incredibly welcomed and the food was fantastic!!! The octopus was everything and more!!! Thank you to the staff for a wonderful time :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sd2FuTldkMmRuYm04MVNHSklibGRKUmtOMWQzYxAB",
            "text": "Came here randomly at 9pm and gotta say very quaint, tucked away in a more residential area, nice and quiet ambience with excellent customer services! We ordered kolokithokeftedes, shrimp saganaki, krasomeze (with side of lemon potatoes) and melitzana skordostoumbi, all very tasty and authentic. The star of the night is probably the melitzana skordostoumbi to me, tangy, packed in flavor and I just love eggplants and feta. The krasomeze and kolokithokeftedes were good but little underwhelming in flavors. Our server was really sweet, we ordered tsipouro to try without knowing and he brought a cup of ice to dilute it just in case, the alcohol was still too strong for me but I appreciate the thought!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psR1ZERTNibk0wVkZob2NGTkVSMVJhTVZVMFQzYxAB",
            "text": "Wow! I am so happy I came across this taverna. The food was deliciously made and the service top notch. There was not a thing I didn’t like. Thank you Wilson for your service and the rest of the Loukoumi team."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLU5pSU9YOE1XcnV3RRAB",
            "text": "Chrissa was a joy to talk to. We came for a lunch and had melitzanosalata, saganaki, and chicken souvlaki platters, including a delicious salad. This reminded me of the beautiful taverna meals I had last summer in Greece— including the music and atmosphere. We drove in from Coney Island and will be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGMWR6WkdiVEp4VFVsNFdYWlpWWEF6TUdwelpHYxAB",
            "text": "The best swordfish I ever had . Great greek food, great service. Don't forget to taste greek deserts before you leave."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poR1JHTm9OWFZUYVRSRllYaEtiamswYlUxTU5IYxAB",
            "text": "We have eaten here many times. Food and service are always excellent. Tonight was no exception. Our server, Jeannie, really took care of us. She recommended a dessert, the orange sponge cake. It was delicious! Jeannie is a gem!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNVEzZGlTbDlsUmtZdFpuSnNTREV6UldoM2RWRRAB",
            "text": "Jeannie was incredible!\nAn absolute professional!\nTerrific guidance through ordering.\nPerfect anticipation of everything I needed.\nExcellent pairing recommendations.\nThe food was terrific so for sure I’ll be back.\nI’m hoping my friends and dinner guests have the opportunity to join me here at a table in Jeannie’s section!\nThanks again from your neighbor and fanboy!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oaWRITlNZa1kxUXpWV1VEVnhObVJOYUVscFVsRRAB",
            "text": "The food was very fresh and delicious but it was the service that did it for me. Wilson was a fantastic host and made us feel right at home."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNVpGQmxSV1IzU1U1UWJGSlBiRmd3VkZwbk5GRRAB",
            "text": "After eating at Loukoumi several times, I knew it would be the perfect place to celebrate my 40th birthday with 20 guests. Peter made menu and event planning so easy and was very responsive over email - answering all of my questions even on the day of the dinner. We had the entire (newly renovated) back room to ourselves with a beautiful table set up. Wilson made sure food and wine was constantly flowing and never missed a beat. I left so very fully and happy and can't wait to be back for the next dinner or event. I can't recommend this gem of a restaurant enough. Thank you for making all of my nostalgic Queens birthday dinner dreams come true!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNllsRnlMVUZoTUhOUk4zcG1ZVmQ1U0MxYWVXYxAB",
            "text": "We had a big tour group in the rear dining room and shared many plates. The staff was very polite, warm, and professional. The food was on point, I especially loved the tuna (?) roe dip with the warm fresh bread!! The ouzo, the olive oil, everything was flavorful and delivered to our table with kindness. Local street parking was also surprisingly easy. Would return again soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTVIyUjZkRTlLUVdaV05HbDZXRXhsWWxGUFIyYxAB",
            "text": "Jeannie was such a pleasant and accommodating host. The food was spectacular and the drinks were delicious. Everyone was friendly and the atmosphere was relaxing and great for dinner. We will 100% come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cEpHUXp3RRAB",
            "text": "In my opinion, not the best taverna on the Ditmars strip. The interior is the nice & the service was good, but the food was just okay.\n\nThe chicken souvlaki was a bit dry, the octopus was decent, Greek salad was standard, and the lemon potatoes were a bit sad."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSlEzRk5WSEpYVEMxNVZrMUlVV1l0Vlc5VldWRRAB",
            "text": "Jeannie is one of the few service people I have met that is very personable and provides excellent service.  Will definitely be back and ask for Jeannie.   The food was amazing.  I am a frequent flyer at loukoumi and I hope Jeannie is here to stay."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wc2JEZHNTRVZaUkdNNWRqbHVRemt3YzNwck5FRRAB",
            "text": "Jeannie was fantastic. I told her that I was waiting for my wife to come. I wanted to surprise her for her birthday. It's next week, but I  wanted an intimate moment with my wife.\nThe food was delicious and authentic Greek cuisine.\nI was a night she will never forget. We asked for the check. Then everyone including the dinners started singing happy birthday to my wife. My wife was very impressed. As the guest left the restaurant they all personally said happy birthday to my dear wife. Thank you very much."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRFh6aFVTelU0WmxwU1MwTjNUVFp4Y0dkNmVuYxAB",
            "text": "Always a memorable and delicious time at Loukoumi. Ernest treats us like family."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTlZVMUxRVWs0VkRSa1dreHdYMnhJYXpaRloxRRAB",
            "text": "I’ve eaten many places and I will tell you this is one of the greatest Greek restaurants I’ve ever been to - you must try it. The staff is attentive. The owners are gracious and the food is phenomenal ….."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNUtiOE9BEAE",
            "text": "Top rate Greek Taverna! Good food, pleasant, clean atmosphere and friendly, helpful service! What more do you want? It was my first time there and we let the waitress know. First thing she told us was not to worry, all the food is good, and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aElXR3JnRRAB",
            "text": "Drove in from Smithtown to try this amazing restaurant!  Highly recommended, and it didn’t disappoint. We started with calamari, octopus and spreads. One more delicious then the other!  I had the swordfish and beets…both were amazing!  Looking forward to going back!!!! Worth the wait."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGa2VVdFJjMlJuU0V4TlpqZ3pSMWM1TW5sNk5tYxAB",
            "text": "Our dinner was wonderful! 10/10. Jeannie is an excellent server! Everything came out fast and the food was fantastic! Would highly highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNlRXbEpjWEo1TWpsMmJFeE1aM2x5UzI5TFFYYxAB",
            "text": "Maria a great person to deal with and the food and the atmosphere is excellent, this place has delicious food and lots of drinks to choose from.\nI highly recommend this place!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeE1uSTNiRXRPYWs1UFRGTTFaa3gyUWtsVlRHYxAB",
            "text": "Loukoumi Taverna is lovely, the food is first rate and our server, Jeannie, was very gracious and accommodating.\nWe highly recommend this Astoria restaurant for a casual meal or a special occasion.\nPenny and Michael"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acFEwUXdTVXRPZG1oaU9FUjFPRWxHYjJkclEzYxAB",
            "text": "Jeannie was amazing and attentive! When you pair that kind of service to some really good food you get an awesome and wholesome experience! Will come back anytime I can."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVNWF2clZBEAE",
            "text": "This is a delicious Greek restaurant in the heart of Astoria. The restaurant is very spacious, with a great selection of dishes, wines and desserts. It even has an outdoor party room. The service here is equally amazing. Noise level is low and the ambient music is at perfect volume. Great restaurant for any occasion."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUGRFbDZkVUZNWDNOeFJtWjFlamRzT0hSNmRsRRAB",
            "text": "Fantastic staff (Ernest/Chrisa..) and having the honor of one of them servicing my son and myself over the past 12 years. We have dinner here each time after being at the U.S. Open in Queens. I highly recommend you visit here for delicious Greek food !!!  You will not be disappointed  !!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MzVTRWFREAE",
            "text": "⭐️⭐️⭐️Absolutely our favorite Greek restaurant around the neighborhood. The staff and service is 10++++ better than anywhere else! The food is always amazing and fresh, omg the spread is the best of the best!!!!⭐️⭐️⭐️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMkxWUlVORXBTUTFCNVVDMDJWakE0VG5JMlowRRAB",
            "text": "We totally enjoyed this restaurant from the quality to the service and ambience. The food was very tasty and quantity was enough, the waiter was very attentive and even the owner who was very friendly was there to greet the guests. Really recommend this restaurant and will surely return. Not so difficult to find parking in the area 👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWWFtaFJZM0Z5VVhKWWFYTlZiakF6U1hjNFdYYxAB",
            "text": "The food was delicious, everything was balanced and light, ate literally everything off each plate. Tried the Cyprus salad (10/10), hummus (8/10), melitzanosalata (100/10) stuffed halloumi (9/10) and chicken souvlaki(10/10). Will definitely come back to try some other dishes! Our waitress was Jeannie and she was also wonderful, kind and very attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYM0tEUXZBRRAB",
            "text": "Coming here with my bf. We order greek salad, Methismeness and Chicken Souvlaki.\n\nI can't comment on the Salad. Not really a fan of salad. But I'd say the Methismeness are brilliant. First time trying it, and its superb. Love it. Love love. Comes with rice or potatoes. I chose potatoes.\n\nThen Chicken Souvlaki. Its Meh, too bland. Nothing special, not even close to okay. Just literally meh.\n\nToo bad tonight there were no dessert can be ordered, a lil bit sad.\n\nI love the place. Very nice and comfy yet homy. I love it. Price lil bit pricey, but well, its not like Im gonna eat out everyday, so its okay."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVFJsVmlUR3RmTVhCeFF6ZzRkVlZHUkhSdlFtYxAB",
            "text": "We were a party of 6 people. Mostly shared appetizers which were excellent and more than enough for the group. Food was excellent, and the staff were professional and friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWM1RsSkVMV2xqTURoTWVubFBNMDlXTlVKSFpWRRAB",
            "text": "Thank You so much; we loved Jeanie she makes amazing drinks! And she’s an amazing waitress ❤️❤️❤️❤️❤️🥗 our families been coming here forever!! Always amazing food and service !!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SZlQzRllWVUZHYUdWT1dsVllka0p5TkMxQmNsRRAB",
            "text": "Excellent meal and service! Our server, Jeannie was so kind and attentive. She checked in often and was so caring. Thank you for a great night!!!"
        }
    ],
    "reviews_count": 82
}