{
    "name": "Madera",
    "place_id": "ChIJm9ALcyRZwokRiv6uOzTcE0Y",
    "grid": "QN1",
    "address": "47-29 Vernon Blvd, Long Island City, NY 11101, USA",
    "rating": 4.3,
    "user_ratings_total": 776,
    "phone_number": "(718) 606-1236",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201d1NIRmpZMjlUTnpscVRHcEtSMWhIUXpCZlFYYxAB",
            "text": "Unfortunately, after coming here for so long they really messed up. We waited practically an hour for hour food and the waiter never updated us! They were busier with the deliveries. We were so insulted by that. We decided to leave and they didn’t even blink about it and still charged us for 2 drinks. That was the icing on the cake! No apologies and/or respect! Too bad for them. They didn’t know who we were. Very bad business."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nNU0wTlRSVVJSVTFoYVlqZHdha2QyVlVKSVlrRRAB",
            "text": "I ordered Lomo Saltado and it was really bad. Quality of meat was terrible: every single piece of meat had fat on it and it was hard.\nThe white sangria was bad too.\nOverall, avoid this restaurant."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taU01XNXliMFJmYm5KUlkzSndVWGhFUlV4RlZYYxAB",
            "text": "Second time here for a birthday dinner and the service, food and ambience is phenomenal"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcFlWRjFXbGRKU0hVMGVFZHROQzFFUVZwUk9XYxAB",
            "text": "The staff were so accommodating and kind. Some of the kindest service I’ve had."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaVNHUjNYemRMZVdaNFpYWXdhR2hDUm5wM1JFRRAB",
            "text": "The food was real."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadVdFOWFVMGxTZDA5eVoxOWFabWxxZGtkWWMwRRAB",
            "text": "The food was excellent 👌👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMmNqaDVSa0pWVEZCSWRVNDFVbUZUV1d0SlMwRRAB",
            "text": "Skirt steak was good, however the Paella was very salty. Also regarding the Paella, very stingy on the seafood. for $42, it's WAY OVERPRICED. It was 90% salty rice, 10% seafood. We are not stupid. Also with the sides they could be a little more generous, especially when you are charging over $40 for entrees. QUEENS location, MANHATTAN prices, Owners can do better with value, Shoutout to the server, he was all alone, bartending and serving customers, get some help...."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pod1pHRmxTak01VTBRNFowaHFlV2QyVDNnMlpHYxAB",
            "text": "Keep in mind this is where you’re going to eat."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMWQzVnJVa2hYTkV0T1ltMUNTakJxWm1saFdYYxAB",
            "text": "Great good, service and atmosphere!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ST056Sm1SUzFzUms1ZlNGRmhVQzA1U1ZWeFpXYxAB",
            "text": "Really good Latin cuisine. I will go again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsYVdtOUlRMlJLWTFVNE5VaHFYMUZoY1dRNVVrRRAB",
            "text": "Great Cuban food"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rM1NVSklVM1JCUjBWbllUQjRPR2szUjI5UGMyYxAB",
            "text": "Excelente servicio y comida, pero la atención lo hace un lugar único. Sin dudas volvería!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OV2NFRk9WVEJGZFdkdk1ITkxVemQwWWpkcGNHYxAB",
            "text": "First time dining here and we’re happy we did! Josue was great!! Drinks were really good. Our meal was delicious…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQUFd1dDdCN3BuY1FREAE",
            "text": "The food was excellent, the restaurant was very clean, and the staff were incredibly attentive.  Parking, however, was a bit of a challenge."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPRzYydnJKMGN5SkVREAE",
            "text": "El mesero se sobro con el servicio la comida 100 de 10 super recomendado"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOS0JxUFh2OHFLbkdBEAE",
            "text": "Even though the flan looks great on the photo it tasted bad for $10, it felt I was eating plastic. The service was off, staff should not be client facing.\nThe location has potential."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYkxrb1hSbDhlM1NBEAE",
            "text": "A can't miss. Service is on point. Live band, stellar. It's a nice change of mood after a hard day of work."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd2J2R2VBEAE",
            "text": "Came here for dinner on a weekday. There was no wait to get a table when we came; only 1 other group when we arrived. Service was slow even though the restaurant wasn’t packed. We tried a few appetizers and for entree, we each got the Skirt Steak. Originally wanted a different steak but they said they didn’t have it that day. The appetizers were good, portions could have been bigger. My skirt steak was a bit tough."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveklhZWNnEAE",
            "text": "Used to have fun here, but my group was too loud on a Friday night at the bar, bothering older couples sat in the back of the restaurant. No one asked us to keep it down or please lower our voices, even the bartender was loving us. But the next week we arrived, we were informed by the bartender that we are banned because we're too loud...at a bar....on Friday night."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5ZzV1OEhBEAE",
            "text": "A True LIC Gem - 10+ Years of Incredible Food, Service, and Heart\n\nI've been coming to Madera in Long Island City for over a decade, and it's hands-down the best in the neighborhood--if not the city. Through the years, the food and service have never wavered in quality. Every dish is consistently delicious, fresh, and made with care. Whether I'm dining solo, with family, or hosting friends, I always know the experience will be top-notch.\n\nWhat makes this place truly special is the people. From the moment you walk in, you're greeted like family. The staff, the management, even the owner--everyone here pours love and pride into what they do. It's not just a business, it's a family serving the community with warmth and heart. And needless to say, the ambiance is so chill that I've seen celebrities come and enjoy like everyone else, just relishing time with friends, family, and great food!\n\nI've brought friends and family from out of state and even from overseas, and without fail, they fall in love with this place just like I did. Many of them have become lifelong fans and make it a point to visit every time they're in New York.\n\nIn a world where places come and go, this restaurant has stood the test of time--for good reason. If you haven't been, you're missing out on a true LIC treasure."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMi1mSGNREAE",
            "text": "If i could rate it zero, I would. The incompetence at this place and primarily by Andres is unreal."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnc3BENXJRRRAB",
            "text": "We got there 10 min early and it took longer to get seated. People behind us were sat first. And when we were seated our table wasn’t set and no one paid attention to us. We didn’t get a waiter to bring us water and menus for over 30 min.…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM0lQb2RBEAE",
            "text": "Bland food, horrible service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdV8yWnBBRRAB",
            "text": "Excellent all the way around. Try them for yourself you won't be disappointed.."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMjdIWWVBEAE",
            "text": "Food is fantastic and the everyone on the staff is top notch!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPajdQMThnRRAB",
            "text": "Love this place. Very cozy, clean, affordable and tasty food. Friendly staff and owner.\n\nMy 2nd visit here and it didn't disappoint. Recommended if you love Cuban food and don't want to dine in Manhattan :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzc2JxT2JREAE",
            "text": "My boyfriend and I have been coming here for a few years now, and the experience never disappoints! The food is always delicious and the staff is so friendly. Huge shout out to Kizzie, Andres, and the rest of the staff for always treating us like family !"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVOVp6c0R3EAE",
            "text": "Previous rating of 2 stars was incorrect. The place is beautiful services wonderful food absolutely delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdXRIVmFnEAE",
            "text": "the lack of respect, poor service and management\nI seriously doubt I would ever return!!! I only gave one star because it's the minimum in order to be able to post this review."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaXNTRXp3RRAB",
            "text": "Food and drinks were great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINnE2ZkV3EAE",
            "text": "A festive atmosphere with great brunch and dinner options.  The staff is accommodating if you have dietary restrictions.  The paella is a must have experience!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIZ3ZmdGxBRRAB",
            "text": "One of the best Cuban restaurants I’ve ever been to in NYC 🇨🇺 I highly recommend this establishment ie you’re ever in the Long Island city"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNId1BYYlFREAE",
            "text": "I really liked this restaurant. Sadly they closed. No info is available about it at the restaurant. I just went to order food today, a Friday afternoon 2:30 pm and they’re closed. There’s no sign to explain anything."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d1pHVDVnRRAB",
            "text": "Es muy buena la comida la atencion espetacular y ni hablar de la musica en vivo le doy un excelente sitio gracias"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cU9tRW5nRRAB",
            "text": "it's a great place, i like their appetizers and seafood dishes.The service is very welcoming. but above all (in my personal opinion), they make the best sangria cocktails in town."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d05qNWxBRRAB",
            "text": "My wife and I have been coming here for years! Best brunch in LIC. Great outdoor space, service and atmosphere. Huevos Rancheros, egg white omelette, French toast, iced coffee and espresso martinis are amazing! Do yourself a favor and bring friends, family or a date. Good for all three!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbU4yV1JnEAE",
            "text": "Update (Aug 2024): I came back to this place and ordered the empanada and ropa vieja again. Unfortunately the quality went down, the ground beef empanada was too dry, the salsa verde lost its flavor and was spicier than before, and the ropa vieja meat was not marinated at all, I’m disappointed 😔\n\n—\n\nI tried the ground beef empanada, what a delightful experience! The mixed flavor of the empanada veggies, the ground beef and most importantly the spicy sauce was so good, I honestly wanted a 2nd one but I was afraid I’d not have enough hunger for the entree.\n\nI came here for the ropa vieja with white rice and beans, the shredded beef was served in a cup made out of fried yucca and it was properly marinated although I felt a ketchup like flavor as I was finishing it, the sweet bananas were mashed and under the cup, first time I’m having it this way, overall it was great too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOXVYWDFnRRAB",
            "text": "Is always a pleasure to eat, drink, and chill with the bartenders."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyd1pLREF3EAE",
            "text": "😘👌🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdVl2QlBBEAE",
            "text": "Delicious salad"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMd3ZLYllREAE",
            "text": "Staff is very friendly and nice, although service did seem kind of slow. Food was very good - we aren’t experts in Cuban food though so can’t comment on authenticity, but paella and grilled snapper were great and so was the empanada. Prices are reasonable for this area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOU0yM0hnEAE",
            "text": "I was very disappointed with the Cuban style food they served us. Salty, small portions for the price too high. In my opinion that Chef has no idea of what Cuban cuisine is about. I would not recommend it. After our dissatisfaction there, we went to eat pizza nearby."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MW9McW13RRAB",
            "text": "Ate here and service was quick and food was super good! Get the Cuban sandwich and fries and empanadas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdnE3OGd3RRAB",
            "text": "Service was terrible, worst experience ever. Never go back to this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUOWNITGNREAE",
            "text": "Great restaurant. Delicious and fresh food . The waiters are super nice and the owner is a sweetheart. I recommend this place 100% they have everything good. Seafood, chicken, pork, steaks, drinks and delicious desserts. The price is decent . You also must try the “Brunch” is amazing and their coffee is to die for. 😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN042V1lnEAE",
            "text": "Great experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqZ0xtYUxREAE",
            "text": "One of my favorite restaurants and I go out often. Been coming here for over 12 years at least once a month.  It’s perfect for me and my hubby.  He is a steak lover and I am a fish lover and Madera never disappoints.   From their appetizers to their desserts, yummy.  My favorite dish is their corn fritters to start, bronzino, and fried ice cream. My husbands is their pork chunks, steak, and tostones. However I have had almost everything on the menu and it is all great.  The owners and staff are so welcoming.  Highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqN2V5dlN3EAE",
            "text": "This place is overpriced and the food isn't great. Some things were ok like tostones taste like they should, but for example my vaca frita wasn't actually good. The meat was too dry, and I didn't even eat the fried yuca that held the meat. I had vaca frita at another cuban restaurant, and it was much better even the moro was better at the other place I went (and cheaper. Our bill was $50 less than Madera and we even got dessert, which we didn'tget at Madera).\n\nDefinitely have higher expectations for their prices. Other than that, the service and atmosphere were fine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURELThIVV9nRRAB",
            "text": "Waited 15 minutes and no one came to the table to greet my daughter and I ir give us a menue. I left after 15 minutes l."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaXBDRm5BRRAB",
            "text": "Delicious steak and yuka fries!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwME5xRElBEAE",
            "text": "Very nice restaurant with a very nice group of staff. Food is really well prepared and has a charm about it. Madera chicken was really good, a touch salty but good nevertheless. Yuka fries were nice as well. Definitely recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScjZySmtBRRAB",
            "text": "Fantastic restaurant. Well decorated, clean with a very cozy ambiance. Food was amazing and drinks were perfect. The service was very attentive. I will definitely be back again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLMXRqdFdBEAE",
            "text": "Very good food. Tasted authentic and natural. I’ll recommend the empanadas sampler highly, my favorite was the spinach and cheese one in the middle. Drinks were good, I requested the Bloody Mary spicy and was satisfied. Steak and eggs was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaeEozUnBnRRAB",
            "text": "Came on a Friday night and it was a calm and welcoming atmosphere. I love the interior of the place. I appreciate greatly that it wasn’t too crowded. Our waiter was attentive and got us everything we needed right on time, thank you again if you get to read this for your hospitality! The food here is good… if you’re going to go for anything just go and get the food please. My 7 year old ate every single shrimp that was on her plate, guys. Thankfully the pier is close by because after eating all that delicious food you’re definitely going to need a walk!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNU55Um1RRRAB",
            "text": "An amazing place for a date night, very specious with a nice decor. Delicious food, drinks and atmosphere. Prices are on the high end  but adequate to the quality of service and food. The SKIRT STEAK with chimichurri was delicious as well as the whole Red Snapper with mango and black beans. Of course mojitos are a must at this Cuban restaurant!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNneUlPa1lREAE",
            "text": "Great place to hang out ..order some appetizers and drinks. The drinks are delish. The food is very good. The wait staff was friendly, attentive and courteous.\nI will definitely visit again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleGRIZU1BEAE",
            "text": "All around a great place that I’d love to come back to and try out other options. The waiting staff is very friendly and helped out with a few food choices! The madera chicken is great and if recommended a few empanadas to try out as well.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdXRmTFp3EAE",
            "text": "Small restaurant with lots of potential but miss to deliver good. I’ll start by saying that the food is over price. I mean over price. Portion sizes are small and expensive. Not only that, Cuban food is flavorful and they not close to flavorful. The ropa vieja does not have that authentic Cuban feel to, tasting more like a bland beef stew with a lot of tomato paste. The croquettes were dry like card board. And the calamari that was the only thing with a bit of flavor; the portion it’s very small.\n\nThe drinks were here and there, the mojitos were very good, while the margaritas where thumbs down. The bartender got the whole glass wet then got it to the salt causing it to look like an avalanche before pouring the margarita into the cup.\n\nThe bartender didn’t wear gloves to grab the oranges or cherries to make the drinks while 10 seconds ago he was picking up trash then wiping the table then proceeds to go make a drink instead of washing his hands.\n\nFlies were around the bottles around the bar area, that’s not a good sign. Makes me wonder about the kitchen.\n\nWon’t go back for a second try."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTdy1mY01REAE",
            "text": "Great service, great price and the food was really good. We had an original and passion fruit Mojito they were good too. Ropa vieja very tender juicy and well seasoned. The cuban sandwich and yuca fries were good. And most importantly, we…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbkluME53EAE",
            "text": "I have been dining at Madera since the beginning when they first opened in L.I.C .\nFood , drinks and service always top notch .…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtb1oyVV93RRAB",
            "text": "Ordered take out and it was really disappointing. The yuca fries were flavorless and chewy either overcooked or stale. The citrus marinated hearts of palm salad for $14 was a complete joke- just lettuce and some hearts of palm tossed haphazardly in- what marination? Cuban sandwich was decent but nothing special. Overall a waste of $45 on Seamless. Maybe this spot is better dine in?"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXOHZtMUhREAE",
            "text": "Lively space, good for casual friends dinners or dates. Though basic, the steak type foods are surprisingly good options. Madera chicken is also a recommend.\n\nA bit on the expensive side, so plan about $65/person for an entree and a drink ($14 for cocktails)."
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZNGNYeXBRRRAB",
            "text": "Las empanadas de Espinaca ufff!!! Muy buena calidad de comida. En general los platos fueron sabrosos, frescos y abundantes! Sin dudas regreso. Para quien busque sabores caribeños éste lugar es muy recomendable!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSamE2RV9BRRAB",
            "text": "The food was delicious, and the service was exceptional. The ambiance was romantic and quaint. Also, the waiter was very attentive. We definitely recommend it to others."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdExtWjVBRRAB",
            "text": "I went here for my birthday dinner. I made a reservation online and noted, because the question was asked whether it was an occasion that it was my birthday. The greeting was very unenthusiastic. The food was delicious. The waiter wasn't particularly \"friendly\" he wasn't rude either. So I guess that's good. Anyhow, if you want good food with a cold shoulder give it a try. The Madera Steak and stuffed Salmon were good entree options. The appetizer, not pictured was tasty but a very meager amount for what it is. Plaintains are so cheap, yet they give you about what equals 1/4 of a plantain with ground beef, and some salsa and a very tasty garlic olive oil. Again the food was good, just not a welcoming feeling to go along with it. The restaurant was not crowded and I guess I really didnt need a reservation. Went on a Sunday."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURheXFiTG9BRRAB",
            "text": "Tried this place couple months ago. Very disappointed. We were told that we could only sit outside because they had a party reservation. Outdoor dinning table was not steady and chairs not comfortable. AND!!!!! we didn't see no party arrived even when we finished eating outdoor...So what was the point that they HAD TO SIT US OUTSIDE?! My sister and I ordered two entrées. The food was not bad but DEFINITELY NOT WORTH THE $$$$$$$. ((Look at the portion and only one side dish))With only these two entrées we paid $144!!!!! I mean seriously?!?! I know LIC is an expensive neighborhood and I do expect the price will be higher...BUT!!!! look what we got and how much we paid!! Unforgettable experience! Guess I should have just head to Costco LIC to buy USDA prime steak and cook it myself!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NW82NWNnEAE",
            "text": "The most amazing paella de mariscos I’ve had in a long long time!! The bistec acebollado was very well seasoned too! Great ambiance inside with great A/C and cute patio."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcXM3U3JRRRAB",
            "text": "A tad bit pricey, but the quality/taste of food and drinks are really good! So far, I've had arroz con pollo, bacalitos, guac with plantain chips & empanadas. Everything was delicious. Their sangria and mojito as well!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHMVlqSUp3EAE",
            "text": "Madera in Long Island City is a true gem. The moment I stepped in, I felt like I was transported to Havana. The cozy ambiance, the rich aromas, and the lively music create an irresistible atmosphere. The food – oh, the food! It's like a symphony of flavors that dance on your taste buds. Every dish feels crafted with love and care. From the classic Cuban sandwiches to the mouthwatering plantains, Madera nailed it. It's become my go-to spot for a little slice of Cuba in the city. Five stars, hands down!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpaGQ3QmlnRRAB",
            "text": "I had high hopes but was sadly disappointed by the service. We ordered to go and it took longer than the 10-15 min the waiter had told us to fry up yucca fries and three empanadas (more like 30 min). And we ordered 3 spinach and cheese…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyOEphajZ3RRAB",
            "text": "I went to Madeza on a Friday night. This cuban restaurant is pretty busy and the vibe was great: from family celebrating a birthday party to professionals/couple just hanging out at the bar. The music was good and someone played the Guitar which gave an additional “cuban style” vibe to it.\n\nMadeza is on the pricey side, I ordered the steak onions with rice and beans, a cocktail, as well as the Tres Leches desert.\nThe Tres Leches was a very good surprise, the 3 types of milk really sink into your mouth and really hits your sense, would recommend to all my sweet tooth peers.\nThe steak onions however was pretty disappointing, I tried the skirt steak before and liked it way more. Unfortunately, the portions are not that big so if you like size-able portions this might not be the restaurant for you.\nThe waiters were exceptional and the barista went above and beyond to make me a mocktail which I really liked.\nAll in all 4 stars because it’s a solid choice in terms of vibe and service but the food was good but nothing transcendant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPN2ZpX3BnRRAB",
            "text": "Came here this past Saturday (first time and definitely not the last) and i loved this place!!!!! It was a friend suggestion and I came all the way from sunset park Brooklyn and let me tell you it was so worth the trip and after dinner took a walk down by the water.  Everyone was so nice and I just loved the look of the place!!! I am definitely coming back"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbjlTV0JREAE",
            "text": "This restaurant have really good Cuban food. The lunch special is a pretty good deal. I've been here a few times and have had their steak and chicken. Both times they were really good. The decor of v the restaurant is nice though. Very themselves thematic. And also good service. Definitely recommended."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJMWNHa3N3RRAB",
            "text": "The lunch special menu has a good variety of dishes. The skirt steak was cooked to perfection (medium rare) and salmon was flavorful. Portion size is not big so if you are really hungry, I'd suggest that you get appertizer(s). Overall, food was delicious and price was reasonable for lunch. Parking was hard to find around lunch time."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNOS1QVDFRRRAB",
            "text": "Classic Cuban steakhouse. Friendly price. Fast and good service. Love the classic mojitos here. Not too sugary. The Mexican lady behind the bar is super nice. They have  a nice selection of rum from different countries. Trinidad, Panama,…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOGREX1hREAE",
            "text": "It's a decent place . The steak was too \"big\"  for one person ."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcF9Db3ZRRRAB",
            "text": "I've been here several times with big parties and for small dinners. It will not disappoint. The happy hour mojitos and red/white sangria at the bar are phenomenal and a great deal. The bartenders and waitstaff were always friendly and…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxblAzWmRnEAE",
            "text": "Grilled branzino , mahi mahi, plantanes and Moro. Never a bad meal and definitely one in top three favorite restaurants. Whenever there is stuffed seafood in the specials menu that is the go to. And the guava bread pudding!!!! Great staff,…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMHNxNEVREAE",
            "text": "DISAPPOINTED!!!\n\nWent for the 2nd time tonight. Complete 180 degree experience from the 1st time. I guess mainly because the owner wasn't there tonight. Everything was going well for awhile until the last few members of a six-top came in. They were extremely loud to the point where I needed to ask the waitress (Yessica) to ask them to lower their voices. She winced at the request while looking over her shoulder towards the party of six and responded, \"The back room is closed\". I then said to her, \"I didn't ask about the back room. I asked you to ask that table to lower their voices a bit please.\" All she did then was shrug and and walk towards the kitchen.\n\nA few minutes later, another staffer who introduced himself as the manager Jonathan, came over and said, \"I was told that you and your  wife wanted to be seated in the back, but unfortunately it's closed right now.\" Once again I responded, \"I never said anything of the sort. I was asking your waitress ask that table over there to lower their voices a little. We are sitting five tables away and can't hear each other because they're too loud.\" Jonathan responded, \"In the past when we tried that it created too much drama.\"\n\nMy wife and I were shocked by such an unprofessional response. Let's look at that statement. Was he saying that this has happened before and he couldn't handle it as a manager? Or, were these same people asked in the past to lower their voices and they refused? The fact that he refused to do ANYTHING showed that he is either incompetent as a manager, afraid of confronting a group (3 women, 3 men), or doesn't care about every customer's experience regardless of the number in the party. Considering the fact that at the time only 15 customers were in the restaurant, I would think that every single patronage would be valued  As I always say, \"This is New York. There is no reason EVER to beg someone to take your money for food. There are WAY too many places one can go to spend their dollars.\"\n\nNow onto the food...as someone who has prepared (butchered and cooked) literally tons of steaks, I was extremely disappointed at the amount of fat that was left on my T-bone steak (see 1st picture). Without exaggeration, there was at least 8 oz. of fat that I cut off my steak. Secondly, this steak had absolutely NO sear on it whatsoever!!! Same goes for the filet mignon my wife ordered. At least my cut was cooked to temperature (medium rare). Unfortunately, my wife's steak was undercooked. She ordered medium and got medium rare.\n\nThe entire meal ran me $186.13 including tip. Mainly because of the lack of respect, poor service and kitchen issues, I seriously doubt I would ever return!!! I only gave one star because it's the minimum in order to be able to post this review."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDMExIQ3pBRRAB",
            "text": "On Fri 8/7/20 at around 630 PM, we decided to dine at Madera. Due to COVID with outdoor seating, since the tables were not six feet apart, my partner and I asked to sit in the corner, which also happened to be under an umbrella, just in case it rained since it has been cloudy all day. We were told that because we are two people we cannot sit in a four person table, despite that part of the outdoor seating area being empty. We ordered two mojitos and shortly after they were brought to the table, we ordered two skirt steaks with beans and a side salad. We noticed two other couples that arrived after us request to sit in the four person table and they were accommodated without any pushback. We paid it no mind and continued to sip on our drinks. The skirt steaks arrive, and had to ask the waiter about the beans because they forgot to bring them not. As we begin to cut the skirt steaks it begins to rain. We ask the waiter if we could please move to the four person table that was vacant to eat our steaks and leave right after. The waiter goes to the owner, “Danny Madera” because he states he needs to check, we could hear Danny from afar shout at the waiter that those tables are only for parties of four. The waiter never comes back to us, I signal Danny, since he seems to be the authority and decision maker and he does not come to our table. We stand under the awning next to the business next door and no one attends us or even cares to look our way. A few minutes later, under the rain, my partner goes over to Danny to ask if we can please move to another table and he shouted out that those tables are only for four guests and that we cannot move! This is clearly upsetting, how does he expect us to eat a skirt steak with a bowl of beans and side salad under the rain?! We tell him that we are leaving and to bring us the bill for the drinks since that is what we consumed. He shouts that we ate and don’t want to pay, which is clearly not the case (photo attached that shows the skirt steaks cut and not consumed) and begins shouting and threatening us that he will call the police. We walk back under the awning and tell him that we will wait until he calls the police. Moments later he comes back and continues his shouting and that he is doing us a favor because he has people waiting. (No one was waiting for a table, it was raining) We again tell him that the issue is not with paying, we only needed a good 10-15 minutes to eat our skirt steaks and would have left without any issues had he allowed us to move to another table. And we even insisted in paying for the two drinks that we consumed. He continued to shout and told us to leave and that it was on him as he created a scene in front of everyone for no reason. The guests around us looked in awe as no one could believe this craziness. Being a local business, with the pandemic and Danny’s disgusting customer service skills, best of luck staying in business!"
        }
    ],
    "reviews_count": 80
}