{
    "name": "Christos Steak House",
    "place_id": "ChIJz2taOGlfwokRk4xoDPMRWbQ",
    "grid": "QN1",
    "address": "41-08 23rd Ave, Astoria, NY 11105, USA",
    "rating": 4.6,
    "user_ratings_total": 991,
    "phone_number": "(718) 777-8400",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbVZFdFFUVjlDWjB3d1VVbGFYMGhtUVZBeGFYYxAB",
            "text": "Food is always amazing.   Manager and  Owner herded us in one small area - 4 tables of clients - one table so loud - you could not enjoy a nice conversation or enjoy your meal.  When I asked why did you put  everyone so close when the restaurant was basically empty - their reply was concerned about diners who had not yet arrived - instead of us - actual diners in the Restaurant.   Make sure in your reservation you  State where you want to sit.   I will think twice before we return.   Atmosphere and cooperation were ZERO STARS."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SmMxZE1NMmsyWVVaeVlWRjVlbHBGWVVWcU9GRRAB",
            "text": "Social media created so much hype…this restaurant fell flat for me.  Zero flavor.  The best thing on the menu was the porterhouse which was grilled to medium perfection but some help was needed with added salt.  The service was good and the atmosphere was descent.  The 3 sauces accompanying the steak were just a waste of ingredients-bland for 2 and sweet for 1.  The crab cake was mostly flavorless breading with some shreds of crab meat.  I did not recognize the equally flavorless sauces.  Lobster mash served as a messy slop in the lobster shell but had no strong taste of the lobster even though there was minuscule and minimal bits of the lobster."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eE9XSkVkVEpUUjJRNWRIaEtTVVEwY1VKU1IzYxAB",
            "text": "Great experience! we came here for a birthday dinner with 11 people and the service was WONDERFUL. The staff was very attentive. The food was beyond good, temperatures cooked very good. Luiz was wonderful and took great care of us. 1st time here and we will definetly be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaVlsRmthRGhPUTBoNlNETjZOVTQzTlhWTGFuYxAB",
            "text": "So good! I know it’s a steak house but the branzino and the side of spinach with feta is so flavorful!! I crave it!! Stellar martinis/cocktails also!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNE4yUlRSVmwwWmxkcFNFNXhUR2g1VFVNNE1rRRAB",
            "text": "Came here for my birthday a few days ago and had the most amazing experience. The ambience was great. The service was impeccable and the food was delicious. I got a filet mignon, garlic mashed potatoes and the brussels sprouts. Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNFVuRm9lVkp4ZFdndFNUUnZlRTFCYm5oVGVuYxAB",
            "text": "Excelente"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TFYzWmliMFI2VmkxYWIwUldRbEZOVnprM1lWRRAB",
            "text": "came here for a dinner and was blown away by how refreshing the arugula salad was and how the octopus was cooked. the salmon paired amazingly with the cream of spinach and the shrimps were soo flavorful. the rigatoni was out of this world and easily the best i’ve had! always have to leave room for dessert if there’s a chocolate lava cake with ice cream!! i definitely recommend for a fancy night out or even a casual meal!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VdFp6bG1la1pZU0daMFVYcGFSV2wzUlRaUVZYYxAB",
            "text": "Good service and good food but a bit pricey."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWmVsYzFRM2d5TFRCSmFITnBhMjlXYzFwblpHYxAB",
            "text": "The one star is because they won’t let me leave a review on OpenTable where I would have shared this privately. Highway robbery at this spot. They highlighted a special of lobster mashed potatoes without mentioning a price tag of $60. When a dish is literally 4x the price of a normal side at the restaurant you have to let the customer know or else you upset people. They don’t let you do lamb chops by the bone even though we had already ordered their $185 porterhouse and 5 appetizers, it wasn’t like we were trying to be cheap. There were 5 of us and wanted a 4 piece lamb chop since once person wasn’t a lamb chop guy. Get with the program where Wolfgang’s, Keens and Lugers would have all accommodated this. $800 after tax and tip for 5 people with no alcohol. I was dining on an expense account and still wouldn’t go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VME5IRTVSbU5HUkdGNmQwWjBhalZHUWpoa1NFRRAB",
            "text": "I love this place! A great steak house with a Greek twist! Classic surf and turf is amazing!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNFJWTTFlVzB4UTB4d1EwUmxNbWhqTTB0aE1VRRAB",
            "text": "Went there for my anniversary and the service was soo welcoming. The staff was very attentive and the food was amazing. Highly recommend! Get the porterhouse!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRVpGbG5UMnhVV0VVdGRTMTFla2N0ZGtSUVFuYxAB",
            "text": "Amazing location! Every employee here approaches diners warmly. The dishes delight while the service enhances. You'll appreciate the tidy venue and affordable menu. I'm content with the experience here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCd1FYSTBjblpzTlZWVk1VUkZkVWRxV2tWc2FWRRAB",
            "text": "Tucked away on a quiet corner in Astoria, Queens, Christos Steakhouse is a standout gem that elevates the classic American steakhouse with a subtle Mediterranean flair. This beloved spot delivers an upscale dining experience that rivals Manhattan’s finest, making it the top choice for steak lovers in the borough.\nThe ambiance at Christos strikes a perfect balance—sophisticated yet approachable, with dark wood paneling, white-clothed tables, and a cozy bar area that invites lingering over cocktails. The warm, attentive service, exemplified by staff like Emily and Angela, ensures every guest feels welcomed and cared for. From the moment you’re greeted (often with valet parking for convenience), the experience feels polished and professional.\nThe menu shines with USDA Prime cuts, dry-aged for 21 days in-house to achieve peak flavor and tenderness, then charbroiled at 1,200 degrees and finished with sea salt and mountain oregano. The Christos Signature Porterhouse for two (or three) is a showstopper—tender, flavorful, and perfectly cooked with a crispy, charred crust that many claim outshines even Peter Luger’s. The 10-ounce filet mignon is another crowd-pleaser, melting in the mouth with a buttery texture. For non-steak options, the branzino and seafood selections are fresh and well-executed, though the steaks are undeniably the star.\nChristos’ Greek heritage shines through in its appetizers and sides. The saganaki, pan-fried Vlahotiri cheese, and lamb cigars with roasted pepper yogurt sauce are delightful starters that add a unique twist. Sides like the lobster mashed potatoes and creamed spinach with feta are rich and indulgent, though some note the lobster mash can be light on actual lobster. The bacon blue mashed potatoes and charred broccoli also earn high praise for their bold flavors.\nThe wine list is solid, with reasonably priced options, and the dirty martini is a fan favorite for its classic execution. Desserts, like the complimentary cheesecake offered for special occasions, add a sweet touch to the meal. While prices are on the higher side (expect $50-$80 per person for entrees), the quality, portion sizes, and overall experience justify the cost for a special night out.\nSome reviews mention occasional inconsistencies, like overly charred or underseasoned steaks, but these seem rare and often tied to busy nights like holidays. The consensus is that Christos delivers a consistently high-quality experience, with many locals and visitors calling it the best steakhouse in Queens, if not all of NYC. Its accessibility, with valet parking and a short walk from the N/Q trains, makes it a convenient yet luxurious choice.\nRating: 4.5/5 Stars Perfect for: Date nights, celebrations, steakhouse enthusiasts Pro Tip: Reserve a table for quieter weekday evenings to enjoy attentive service, and don’t miss the porterhouse or saganaki for a true Christos experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTGVGaHhWM2xwZG1kSFgyUjBTbU5pZVhNMU1FRRAB",
            "text": "Luis was our server and he rocked our night!\n\nThe porterhouse for 2 was sooo much food; im glad we have food to take home!\n\nThe sauces were incredible, especially the house sauce.\n\nAsparagus was solid, nothing particularly fancy.\nBacon Mac n Cheese was a Killer!\nThe BACON WAS SUBLIME - OOOOMG\nGarlic Mash was so creamy and a great base for the night\n\nPrice was super reasonable and can’t wait to come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMlYyZzVlbkp4VlVoeVpVMVpVVWRVVWpnMWVrRRAB",
            "text": "The food is delicious and the service staff are amazing. 10/10, highly recommend to everyone."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOR0ktSTMweGUzQVJBEAE",
            "text": "Had an incredible dinner at this Greek steakhouse. The place is upscale but still feels warm and inviting. The steak was cooked perfectly and full of flavor, and the Greek-inspired sides and appetizers were just as good — especially the grilled octopus and cheese. Service was on point, and the whole experience felt special without being stuffy. Definitely a spot worth coming back to."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQR2w0dEcxcXEtdXBnRRAB",
            "text": "I went to this place about 12 years ago for the first time. My friend (now wife loves this place. So we went again for our anniversary. I actually didn't think it was that great. It took forever to get our food, as I watched people walk in after us getting their meals first. I'm not referring to an appetizer either. My steak was okay. If it where not for the dressings, which I normally don't would have been less taste . My dessert was dry. The best dish was the Mac and cheese.. My biggest compliant was the lack of service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLT0ZtLW5GMkxqcVB3EAE",
            "text": "I’ve been visiting this restaurant to celebrate special occasions for the past two decades since relocating to New York City. I’ve had the pleasure of dining at every major steakhouse in the city, as well as most of the other upscale restaurants whenever I have the opportunity. However, this place consistently stands out as a favorite. The staff is incredibly friendly, and the food is simply exceptional."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOGN5LU5nEAE",
            "text": "Hands down one of the best steakhouses in the world from the service to the food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHFIRS1nRRAB",
            "text": "Good food terrible service. Waited 30 minutes for bread and 2 cocktails. Then waited 20 minutes for the waiter just to bring the check."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa3RlaTVBRRAB",
            "text": "Impressed with the quality of the steak. No need to go to Brooklyn, when there’s a nice steakhouse in queens!"
        },
        {
            "date": "6달 전",
            "language": "el",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvX19LV09nEAE",
            "text": "Ότι φάγαμε ( κυριολεκτικά ότι) ήταν άριστο. Οχι απλά καλό. Μοναδική εμπειρία. ( να είσαι απ την Λαμία κ να τρως το καλύτερο ψητό αρνί αρκεί νομίζω)."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNzZ6Qk1BEAE",
            "text": "We ordered two stakes  mid-well, they both came well done\nI ordered the fish special,.chilian sea bass .what I got was two silver dollar sized thin discs of chililia sea bass.you look at dish and you wonder what the heck  is the shef thinking and saying ,thats it !three small disc size potatoes, greens on top and the fish discs on top of that.\nI never ever had such a small dish as that .sea bass usually is a lot larger We waisted our money$$$$$$.had much better dishes else where .extremely dissapointed,extremly expensive for a Astoria restaurant .Not impressed at all!!\nShame on the them thinking  by haveing such an expensive menu that they are as good as a 5starrestaurant in Manhattan.\nIt feels like a slapin the face thinking that they got over on us .shame shane!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvalpfWVFREAE",
            "text": "better than peter luger"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJejQtYTN3RRAB",
            "text": "Best steakhouse in NYC. Authentic and local feel."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbm9xUVB3EAE",
            "text": "Great atmosphere and quiet. My wife and I went during a slower time. We split some fried calamari that was fantastic. I got a porterhouse and she got the chicken.  The steak was great and perfectly cooked. The chicken was good flavor but super dry. Overall I think we would go back again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcnJieEVREAE",
            "text": "Not a kink in the armor...try the bacon"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3N3Z6RFJREAE",
            "text": "Food good yummy yes eat"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURud2J2ZHRnRRAB",
            "text": "Food was phenomenal. We had the porterhouse for 2. Cooked at a perfect medium-rare. Was extremely tender, both sides and the taste was on point. The octopus was good, just wish it was grilled without the vinaigrette. The cigars were great. The bacon and blue cheese mashed potatoes were delicious. I was worried the chocolate in the Creme brûlée was going to over power it, but it was reallllly good. My only complaint is that it was my boyfriend’s birthday, I had requested good seating before hand but when we got there, we were put in the corner of a crowded room. It was a Tuesday night and saw the other room wasn’t as crowded. I wish they gave us a quieter table in the other room. But overall was great and I would return. For 2 people, 2 apps, 4 alcoholic drinks, 1 dessert and the porterhouse for 2 it was $430 including tip, just to give you an idea on price."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3c2ZLNUN3EAE",
            "text": "Christos Steak House is top-notch! The steaks were cooked to perfection — juicy, tender, and bursting with flavor. The sides and cocktails were equally impressive, and the service was impeccable. An absolute must for any steak lover!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3N3M2Y0JBEAE",
            "text": "Great steak!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRazd5djd3RRAB",
            "text": "Food was good and great customer service"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcEkzbjNnRRAB",
            "text": "Honestly pretty good quality. Compares to any of the places in Manhattan.\n\nWould come here if I was craving steaks in queens."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneGFpdWRREAE",
            "text": "Excellent service and food!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnc18zUHFnRRAB",
            "text": "A superbly and wonderful steak emporium full of exceptional choices of the best meats and fine accompaniments. My date and I started with a dozen of oysters. They were fresh, plump, and buttery smooth. This was followed by grilled octopus. To say it was delicious would be an understatement. Then our top gastronomic flair, the king of meats, porterhouse for two (2). It was served steaming hot and perfectly seared at medium rare temperature. In all, better than 5 stars was experienced at this delicious and unpretentious restaurant. It’s sure feels great to consume a splendid flair at this steakhouse."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneVluR0xBEAE",
            "text": "When\n\nWhen you put butter on a steak while it’s cooking, it turns into a greasy, soggy mess. The butter overwhelms the natural flavors of the meat, making it taste more like a fatty, oily slab than a well-cooked steak. The surface loses its crispness and instead becomes a slimy, limp layer that only adds to the unpleasant heaviness of the dish."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndHFTSXpnRRAB",
            "text": "It's a very nice place to have dinner and Ruben makes us feel special. He was very kind and professional. Thank you Ruben, we'll come back !!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncXVlTGZREAE",
            "text": "My boyfriend game for the first time and loved it! The food was delicious and service was great. The servers were all attentive despite it being Valentine’s Day weekend. I didn’t get our servers name, but she had blonde hair and was super friendly. We’ll definitely be coming back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnc3U2RnRBRRAB",
            "text": "We went for Valentine’s Day and everything was fantastic. We ordered the surf and turf with sides of broccoli rabe and risotto. Everything was cooked to perfection. We got the filet medium rare and it was a perfect pink in the center with a gorgeously charred outer layer. Our waiter was attentive and friendly and kept us informed about the status of our food and drinks. We will definitely be back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbktyOTdRRRAB",
            "text": "Asked for medium cooked steak and it was served rare. Nice atmosphere but for the cost you would expect a chef not a Applebees cook."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncUpiSFhnEAE",
            "text": "My frost time Christos steakhouse. It was really good, but little bit expensive."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBam9TWk1REAE",
            "text": "Yummy food.\nExcellent service.\nGood atmosphere and vibes\nDefinitely will go back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBaXNuMThnRRAB",
            "text": "Christo’s Steakhouse definitely had some high praise wherever we looked. The food was alright and honestly the steak could have been better for the price. The diet coke being 6 dollars was mind blowing and being such a small bottle at that! I will say the calamari was great though! The lobster mash isn’t on the menu but the server informed us it was there and we ordered it and to our surprise it was such a small amount of mash potatoes and lobster for a hefty price. The service and atmosphere was great but if you’re looking for a good steak restaurant with reasonable prices maybe this isn’t for you."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBZ0tIOGpRRRAB",
            "text": "Loved the porterhouse. Thanks to our waitress for teaching us how to French serve."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdnZEaE1BEAE",
            "text": "Haven't been here in a few years but it's just as good as I remember it. Wife and I shared the lamb cigars which we thought were really tasty and the yogurt pepper sauce that came with it was just the right amount of heat, neither of us like spicy food. I had the steak sandwich and she had the burger, not the best way to judge a steak house but both were excellent. The mashed potatoes that she got were very creamy and well seasoned. We were in a little bit of a rush so no dessert this time around but we will definitely be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMElPOWp3RRAB",
            "text": "solid"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmd0l5dU5REAE",
            "text": "Awesome place. We had our company’s Christmas dinner here. I didn’t know this area of Astoria but this was definitely an amazing Steakhouse. The appetizers amazing. My wife had the best fried calamari of all her life here. The porterhouse steak was cooked to perfection. And the drinks were very  well crafted."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cnNIVUV3EAE",
            "text": "Christos Steak House in Astoria is a gem! The steaks were perfectly cooked and bursting with flavor, and the sides were equally delicious. The staff was attentive and welcoming, and the manager’s hospitality truly stood out. Exceptional food, excellent service—can’t wait to return!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2Z3BIZVVREAE",
            "text": "Another Great meal at this place. Nice to get fantastic porterhouse and some Greek style sides. A nice change from standard steakhouse offerings.\nGood service and very accommodating!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MU1Ybm1BRRAB",
            "text": "After craving a good steak I ventured to Astoria and went to Christos . It was a wonderful pre Christmas dinner . Food was amazing especially the Greek inspired dishes like saganaki, greek dips and the steak was delicious. Service was great, especially with a packed house.\nIt was a wonderful dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYek92RWN3EAE",
            "text": "I was slightly disappointed with my experience here. Firstly, it was very loud in the restaurant and I think it may be because the ceiling is so low. As more diners came in, it became difficult to have a conversation with the people at my table. Then you have our server who didn’t smile the entire time. My sister was horribly annoyed by this and thought he was nasty, but I don’t think he was. I just don’t think he smiles. In this instance, a smile can go a long way. Or maybe they didn’t care since the 18% gratuity was already going to be added.\nLet’s start with the appetizers, we ordered the calamari, baked clams, and crabcakes. The best of the three was the crabcakes, but at $27, I would expect them to be great. The calamari was slightly chewy and could’ve been a little crispier. The baked clams were good, but nothing to write home about.\nThen we ordered two porterhouses for three. (There was six of us) We ordered one medium rare, and the other one medium. The medium rare one came out a little closer to rare which I was fine with since that’s what I prefer But had to go with the majority. The medium porterhouse was cooked really unevenly. There were parts that were overcooked and parts that were undercooked. Somebody ate it, so there was no point in complaining about it. Unfortunately, the meat itself did not have much flavor. The steak couldn’t carry itself without all those sauces and the fat cap could’ve been rendered better. The steaks came out with the House steak sauce, Bernaise, and shallot borderlaise sauce, but I missed that on the menu. We ordered the blue cheese and au poivre sauces which we may or may not have ordered how do we known we were getting all three sauces already included. Anyways, out of all the sauces I thought the house steak sauce tasted best. The red wine sauce was a close second, but it needed a little more seasoning.\nWe also ordered a side of creamed spinach and brussel sprouts. The brussel sprouts were delicious, but the creamed spinach was too salty. This was unfortunate since creamed spinach is always my go-to side dish for steak.\nOverall, a not so great experience after spending 600+ dollars. The most pleasant thing all night was that they notified the valet when we got the check so our car was ready for us when we went outside. (and the valet driver was really friendly)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyX2NIalBREAE",
            "text": "We had the t-bone porterhouse and the portion was adequate, nice presentation but The steak should’ve been marinated a bit more for my tastebuds. It was lackluster of flavor. However, the service was great. The server recommended great sides (Mushroom risotto) and provided good service. We were even able to meet the owner!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDbElLUS1RRRAB",
            "text": "This place is always amazing. Their steaks are better then the palm, Peter Luger, etc in my opinion. The service was great and they had outdoor dining during covid which was welcome.\n\nMy friend and I had their porterhouse steak and it was simply divine, each side different tasting and unique but still so tender. The sauces they give just added to the amazing taste.\n\nTheir garlic mashed potatoes were the PERFECT consistency, creamy without being too thin.\n\nThe fried calamari were large rings that had just enough fried batter on them to add a different, salty texture but not too much, making them just dough. They were also nice and tender, allowing me to eat the big pieces without chewing for an hour.\n\nThe side of garlic broccoli was also the perfect taste and consistency. Perfect compliment to the steak.\n\nWas nice that they knew it was my birthday just from the reservation and gave a complimentary desert for us to share."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MXB1WWt3RRAB",
            "text": "A little too salty overall for me. They use regular salt which tastes not up to par. I like sea salt only.\nKing crab meat is my favorite. Bronzino is too dry.\nHave to remind them to use olive oil and sea salt for me, no butter.\nGood service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyanM3aU53EAE",
            "text": "Came here on an early Wednesday evening. It was two of us, and we still made reservations, I was told we would be seated right away upon arrival, which we were.\nKept it light as my other guests unfortunately had to cancel. So no steak for two 😞. Had the steak sandwich, white sangria, & shrimp scampi. Olive spread was served with the bread which was pretty delicious. The steak sandwich can’t be ordered rare, it’s served at medium, and it was still good."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRMDRPQ3FBRRAB",
            "text": "Great food in a great setting.  It's a steakhouse but definitely not uptight and stuffy.  The service is great and all the waitstaff is very friendly.  Food came out fast but we were  never rushed.  Staff is attentive but not intrusive. We…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbFBlV1hBEAE",
            "text": "Love the surf and turf! We really enjoy the steak and the seafood menu. They cook it in the best way.. Greek style. The choices for appetizers are abundant as well. We usually order the trio for $16 and we can choose 3 appetizers. Our favorites are lamb cigars, goat milk fritters and seared scallops. They are nice!\n\nMy kids live the fries calamari and I love the dry age meat as well. We never get the dessert are we are super full :).\n\nThe place is spacious but better make a reservation, especially for dinner. Parking can be a bit problematic but they do have valet parking.\n\nSurely the best food but sometimes we have to wait for quite some times for the food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHN3FTbnZRRRAB",
            "text": "Been meaning to come here for YEARS and finally made the decision to do so last night and I will CERTAINLY be back time and time again. Honestly I'm upset I didn't make this decision sooner. 😂\n\nEverything from the food to the service was absolutely great. It seems their prices have gone up just a bit, but overall it's worth it for a nice night out.\n\nIronically, as great as the steaks were, the assorted Greek spreads were our favorite. All 3 were beyond delicious! Some of the best bacon I've gotten at a steak house, and the barrel aged bourbon sauce was fantastic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkcXNmYWVREAE",
            "text": "Went here for Valentine’s Day Dinner with my boyfriend. First time here. The dining room is so beautiful and they had nice roses placed on all the tables. The food was delicious. The only thing that rubbed me the wrong way was the service. I asked the server a few questions and he seemed to be annoyed/made me feel like I was dumb. I work in the service industry so I really wasn’t trying to be annoying cause I know how it gets when you’re busy. We also had to ask him for another round of drinks when our food came out, and ask him to bring the correct sauce for our steak. But I would still come back cause the food was so good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUenM3QUZnEAE",
            "text": "The food and service was amazing. I never thought bacon as an appetizer would be so good. We also had the delicious octopus salad. I can't wait to return."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2bjh6RF9RRRAB",
            "text": "This was the perfect dining experience for a birthday dinner and I hope to visit here again.\n\nThe service was great. The ambiance was nice.\nThe food was thoughtfully prepared and tasty. The quality of everything was immaculate.\n\nArugula salad- large portion, delicious combination of flavors, could be improved with less dousing in balsamic vinaigrette and more fig. ($12)\nCalamari- tasted fresh and also came with mini fried octopus ($15)\nShrimp- juicy and lemon flavored ($31)\nRibeye Steak- prepared perfectly as requested, juicy and flavorful ($80)\nCreme brulee- crisp caramel top with delicious chocolate on the bottom ($9)\n\nThey were kind to include the pre-requested birthday dessert as complimentary."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaHZYTGZREAE",
            "text": "I made reservations for my boyfriends birthday and it went superb! I honestly had nothing to complain about! My group and I had such a great time! The servers and the host were very accommodating! I was able to bring in my own cake & not be charged for it! The food was definitely something to brag about as well! One of the best fried calamari I’ve ever had, porterhouse was top tier & their truffle fries with parmesan cheese was sooooo tasty!! I also had tried one of my friends oysters, Risotto, & fried cheese and they were all really freaking good! I would definitely come back here and order different dishes. Also the bill wasn’t bad at all and I also liked that their gratuity was included because they definitely deserved it. I can definitely see why Google has this restaurant as one of their top steakhouses in Queens."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN0s3SjhnRRAB",
            "text": "The steak and sides were amazing, the Shirley temples were good as well. My only let down was the lava cake that was bad the ice cream was good tho and the cheese cake was delicious."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhcGMzTDJRRRAB",
            "text": "The best steak house in all of Queens!Ordered a 24 oz. Ribeye medium/well, the way my wife likes it. (I like medium rare.) The waiter suggested it was good for two people even. But me being me I also wanted to try their burger subbed with sweet potato fries. We also order a classic creamy mash, and broccoli with roasted garlic on the side.\nFor appetizer we had the fried calamari.\n\nLet me tell you it was one of the best meals I’ve had. The staff was on the ball the whole time. And our waiter was so awesome and caught onto my birthday gesture I hinted at for my wife. Surprised her with a strawberry cheesecake on the house and sang happy birthday. 😂 The desert was creamy and smooth with crumbled graham crust and strawberry syrup drizzled around.\n\nAll the food was the finest dining quality. It was intimate due to the late time frame and it was nice. The whole experience there was a good vibe. Would recommend to everyone over some overrated place like Peter Luger’s.\n\nSo much food was left over we had two doggy bags. And the funniest part is when we sat down, my wife saw the price and freaked out. She’s from a third world country and knows nothing about quality steak. So I had to really explain it to her. Plus I paid so why does it even matter. On the drive home, guess who said this is the best meal she has ever had in her life? Birthday Dinner Date was a success. 🙌🏾🙏🏽"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibXJYQWJnEAE",
            "text": "This is my/our local special place to go. We go here for celebrations, birthdays, anniversaries, and just because. The service here is on par with top tier NYC. The food is as well, and it’s the best we have in Astoria. We have been tended to by Babu a few times, and others as well. They have ALWAYS made our visit memorable in some way. On one celebratory visit, I got a spot of red wine on my dress. I didn’t even ask and the waitress came back with club soda and suggested how to remove the stain and guess what, it worked right then!! Tonight it was our 9 year wedding anniversary and while Babu was on point as usual, he kindly brought us a dessert to celebrate on the house. It was really kind. I love having this place nearby. It’s our home away from home."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1azQzNVd3EAE",
            "text": "The food is done right here. We loved the octopus appetizer. The pasta was delicious and so was tge broccoli. We don't recommend the cream of spinach. The steak was cooked perfectly. Staff was polite but we could tell after our steak they wanted us to go. They weren't rude but you can feel the rush when a restaurant needs the table."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHeV8ydXZnRRAB",
            "text": "For sure its gonna be the best steak you gonna have in your life, but its a expensive restaurant! But you dont need to come here every week if you’re not rich! lol…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2ODRtSkZnEAE",
            "text": "My wife surprised me for my birthday and reserved 10/9 for dinner. This was the first time dining at this establishment and we were very pleased!\nWe started off with a bottle of sparkling Pelligrino and my wife had a Kentucky honey cocktail which she enjoyed.\nI asked for 2 beers on the menu but they came back  twice to inform out of stock of both. The remaining beers were Heineken and Corona which are very mainstream and I do not enjoy so asked for Bullitt Bourbon on the rocks, can't go wrong with this.\nThey brought out fresh bread with an olive spread that was delicous.\nFor starters we ordered the charred octopus with red wine dressing, arugula, roasted peppers and capers. It was so good and charred, we wanted to reorder.\nNext, we ordered the steak tartare which was a first for me as I was feeling adventurous. It was incredible and would order again!!\nIt is dry aged sirloin, a Dijon mustard and scallion oil with szechuan pepper and a tiny quail egg for richness.\nWe also ordered a 1/2 dozen of east coast oysters and it was also incredible. Came with the typical cocktail sauce, horseradish, Worcestershire and lemon wedges.\nThe main course was the porterhouse for 2 which we ordered medium. From experience in other steakhouses, you order medium and it comes medium rare which was the case here but no complaints. Quality of beef outstanding!\nWe ordered the truffle fries and asparagus to accompany the steak and enjoyed tremendously!\nBesides the 2 selections of beer I really wanted not being stocked, it's a 5 star establishment."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNGVfMGxRRRAB",
            "text": "My girlfriend treated me to a wonderful evening at Christo’s Steak House last night for my birthday. She is a vegetarian, so this was a real treat for me. To our surprise, there were some really great vegetarian options for her. I can’t…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxcVBySjdRRRAB",
            "text": "This was my first experience at Christos steakhouse. First let me say the person whom took my reservation for me and my family was very polite and friendly which I did appreciate. The first thing I noticed when we arrived there was the green mildew on the Christos steakhouse signage outside. The google picture looked much better than what I saw. The indoor atmosphere was nice but the table we got was in a corner. After we were seated, the waiter pushed the table in and it sealed off a way for my sister to get out, almost like it trapped her in the corner, another waiter came and pulled the table back out and apologized. Then I saw a dead insect on the table but was to embarrassed to point it out so I asked for a napkin to cover it. Then there were small insects flying around my son’s head too.😩. Now for the meal review. The fried calamari was rubbery, the baked clams tasted raw, the chicken my mom had tasted bland, the two ribeye steaks tasted like they were only seasoned with oregano. The lobster potatoes were ok. My bill was $459 which I paid $500 instead because I knew I was never going back there ever again. I believe in proper etiquette despite poor service or poor food. My advice to the restaurant owners would be to look into these matters Ive mentioned and make improvements where you can. I had high hopes for this experience and had talked it up with my coworkers prior to going based on the reviews Ive read. Reviews should be true to the experience. This was my experience."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobmR2VGp3RRAB",
            "text": "The steak was very good. Very good service.  Beware of all Ala Carte goodies adding up. Dinner for 2 is $300. A good steak is hard to come by."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdUxLdFNREAE",
            "text": "Came here to celebrate my sister's birthday on a Wednesday. I did call in to make reservations, but the night we went there were definitely tables available it could be different senario on a weekends. To start the waiter was super helpful in helping us decide if we wanted our Lobster Steamed or Broiled, he recommended steamed and we were happy with the choice because he said sometime broil could dry out the lobster meat. I will say they had ran out of the 2 and 3 pound lobsters so we had to pay an $19 for the surcharge for the larger Lobster. We started with drinks I really did enjoy the Pomegranate Martini perfect if you do not want a super sweet cocktail. Next we got the 1/2 dozen clams which came with 4 different sauces. 1st Cocktail sauce, 2nd Horse raddish, 3rd butter, and another 4th vinegarette sauce that was not bad. By this time we were feeling nice as they provided bread and an olive spread that I've never had anything like it before Sooooo good, but we were ready for the main course...we got the Surf and Turf for 2 for $155 n the Lobster was HUGEeeeee and for the 2 sides we got the Mac n cheese with bacon which was yummy and the truffle fries which I highly recommend. Before the night was over they brought out a dessert cheesecake with a candle and overall we enjoyed our night. You are definitely going to spend money here, but it was worth it and I was supporting a local business. I would for sure come back and recommend to people I know."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOUt5WDNRRRAB",
            "text": "This place has amazing food the different food combinations were different and not traditional but these ideas are all great. For 220 I got the 14oz fillet and everything else was sides because I wanted to try a little of everything. And with the right glass of wine it just all goes together amazingly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCOUxmQ1hBEAE",
            "text": "I've gone to this restaurant many times and had a great experience. I did a pick up order for the first time and ordered a Caesar salad. While eating I bit into something hard like a chunk of sand. I looked at the romaine lettuce and was disgusted to see that it hadn't been washed at all. DIRT stuck to the lettuce. I was throwing it out but decided to take a picture before I threw it all away.  I'm adding a picture. I never write reviews but this was just gross. I would've never notice. Do better. Clean your damn lettuce."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4ajZIZTJRRRAB",
            "text": "The owner and staff were very attentive, the food was superb! Their suggestions made it all that much better. Recommend Christos Steak House Highly! Many patrons on deck. Holla!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMmQ2Um9nRRAB",
            "text": "The steaks were cooked perfectly. The service was excellent. Cannot go wrong with any menu item. Will definitely be coming back."
        }
    ],
    "reviews_count": 76
}