{
    "name": "John Brown BBQ",
    "place_id": "ChIJfSp0FS1fwokR8PYGmnV6vYs",
    "grid": "QN1",
    "address": "27-20 40th Ave, Astoria, NY 11101, USA",
    "rating": 4.5,
    "user_ratings_total": 3079,
    "phone_number": "(347) 617-1120",
    "reviews": [
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SGFFTnFaalV3VVZRME4yNTZSbUpOUWpaTE9WRRAB",
            "text": "This is the most tasteless bbq place i've ever tried and i've tried quite a bit throughout the city. The only redeeming thing at the menu that is sellable is the burnt ends and the cornbread both of which i've had better elsewhere. I expected a lot going into this place and was very disappointed granted i did go near closing but i expected a lot better. Brisket was chewy and tasteless, chicken had no flavor, mac and cheese was made by a 5 year old who sprinkled some parsley in the end, and the pork ribs tasted frozen."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVVdWZFRjMHBGYVU5eVVGOXhWRWcwVldsbVJIYxAB",
            "text": "Says they are open until 10pm...came in at 9:36 and was turned away"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORVJGVk1OSFZYWTE5V1RuaDJjSGN4WnpCd1ZuYxAB",
            "text": "the best bbq in queens!  👌👌👌"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbFdYQnNiMUV3U1ZSU2VWbzFSVEJXVjFCb1QzYxAB",
            "text": "The best bbq (probably in the country)! Hands down they have the best beans and Mac&cheese. After eating here and knowing bbq can be this delicious I became SUPER picky about bbq.\n\nTrust me you will come back again and again!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUE1EWnZkbmRqYlU1c1J6VlZibWRoVWpOeU5tYxAB",
            "text": "Best burnt ends ever. The meat was super tender and melted in my mouth. Delicious!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSlZrNUNWazlYUkdGMGRVNXdibWwzV2s5SVZFRRAB",
            "text": "As someone from KC, a few thoughts:\n\n1. Burnt Ends were delish! A MUST have. Staple. Absolutely banger. If you’re ordering only 1 thing, get this\n2. Cornbread is a bit too moist. It’s basically corncake. Could be up to your taste, but i think cornbread should be a hit structured and have a solid crust\n3. Pit beans, i appreciate the burnt ends in the beans, but something felt off about the texture.  Other pictures show a better version of the pit beans, so I’ll have to come back and try again and update\n4. Huge on the white bread side. Very very Kansas City.\n5. MAC AND CHEESE - primo. Beautiful. Must get.\n\nOtherwise - staff were nice. Prices for portions were all reasonable.  sauces were solid.\n\nDefinitely will come back"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKc1lLQ05nEAE",
            "text": "Came here for my 30th birthday with my boyfriend, we both love BBQ and this was such a lovely place to spend the evening of my birthday :) we sat outside, drank whiskey and ate amazing meat - 10/10 recommend\n\nUPDATE\nCame here for my wedding meal last week, with my now husband 💚 Just as delicious and wonderful food and atmosphere as always!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMFJETk5ZV05OTWpoM1ZHbEZkV2xKVTJSelpIYxAB",
            "text": "Amazing spot. I’m originally from the Midwest and this place doesn't disappoint. The burnt ends and spicy barbecue sauce in particular are incredible. Also the service!\nCan’t recommend this place highly enough."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMU1IRjJlbGxpVkd4M1pIRllha2czZUdZeGRVRRAB",
            "text": "Way to live up to your name!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMExWZEZPR1pqTmtOTGVFRmtVVEYxZUVWc01IYxAB",
            "text": "Came here on a Sunday afternoon.   The Chiefs vs Raider’s football 🏈 game was on all the televisions 📺.   Everyone was dressed in KC Jerseys.   It felt like we were in Missouri not Astoria Queens.  Food is good.   Nice staff.  The lady working the outside patio was very friendly.   On the expensive side so bring your Credit Cards 💳.   Give this place a try if you’re in the area.   We will definitely be going back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMWJsZE9OMmxITVdWUGVGUmtaMjVaTlRGbFkzYxAB",
            "text": "I have normally been a prime rib gal, but I think I'm gravitating now towards their pastrami and burn ends! Great time to go on the weekends right before it right at 5P, fresh cuts and slow crowd. Wonderful service by \"Ma\" and the team. Always feels like home when coming here."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSmRHTjFWVUprYjE5MU9XNTJlR05yTUdsUVFVRRAB",
            "text": "Just fantastic!  We love it here"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poS1dsUnpkMmx3UzBsV1Z6TkdlRkJWUjJadlVtYxAB",
            "text": "Stopped by here for some dinner. Had pulled pork and some collards. Husband had spicy pork sandwich. He thoroughly enjoys spicy food and he said this definitely brought the heat. Both were flavorful and quelled our hunger."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNFRuQjVSekpDYlhWMGREaFBhako0VDI5QlQzYxAB",
            "text": "I came here with friends for dinner. The venue is a huge Kansas City Chiefs fan. With banners indoors and outdoors of the championships that they've won. Counter service is a little bit different since everything in serves by the pound.\n\nI highly recommend the pastrami, pulled pork, brisket, burnt ends, so much more!\n\nThe drinks are right on point. Not too strong. Not too weak. Just a good pairing with whatever it is that you're ordering."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNFRWVmZZelJ4UzA1NFNXbFBYMmc0V1VzemNrRRAB",
            "text": "very atmosferic and such taste meat. service very good"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNFdVMDJVVGgxYVZkUlJtZFpiM1pRTUhOWUxXYxAB",
            "text": "Ample street parking. Beautiful view. Food was extremely moist and outrageously delicious. Must get there before 6:30 before food starts to run out!! Great atmosphere! And the service was phenomenal! You seriously have to come and taste for yourself to truly understand how GREAT it is!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSWJtRmtVbU5qUldodU1rTlpXbE50Y1RNMlZsRRAB",
            "text": "Cool little counter-serve BBQ joint with reasonable prices and generous portions.  The Mac & cheese and cornbread were both delicious as was the Reuben sandwich I had."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odmR5MW1UbGM1TUhwdVMxSTRPRW8xVFdOSVZsRRAB",
            "text": "Best Kansas City barbecue I've had outside of Kansas City"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsT1luWnZkbXB6VUc1c1VUazRTM1YzVVdwNVowRRAB",
            "text": "The good: Ribs, burnt ends and collard greens. Also the place has really nice outdoor seating.\nThe bad: brisket (it was dry), bread and beans.\nThe ugly: Cornbread - steer clear if you don’t like the taste of canned/cream corn. Otherwise very moist (almost soggy though)."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nd05tTjVhVXBQUkVrdFpsVnNZa0ozVlZwcU1uYxAB",
            "text": "I try to pop in about once a week."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wZlJWWkhiR3BuUzB4NU9VaHlhbWcyVFc1cllsRRAB",
            "text": "Had a family lunch with 9 people. The Ribs were excellent, so were the Mac & cheese. Service was very friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KT1lXTnFUVXRKZFd0SWRFSm9kMjFHUVcxMWRVRRAB",
            "text": "We love this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMmRYaFRhMUZwYURFMFgxQkdkMUo2YkMxb2IzYxAB",
            "text": "Great outdoor seating. I could have stayed for hours. Staff very helpful with answering questions. BBQ sauces underwhelming and no spicy option. Ribs and burnt ends (their bestsellers) too dry and little flavor especially the ends. For the price not what you want when you eat BBQ"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taR1NrNU5VVk14TjJwa2RIZEtTREl5U0VwQlgwRRAB",
            "text": "Awesomeness"
        },
        {
            "date": "1달 전",
            "language": "nl",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GclRuUkpVSGQzVmpsamF6bFFlVzB6UW5aeFVFRRAB",
            "text": "Prima restaurant maar niks bijzonders.  Binnen en buiten zitplaatsen. Broodje met vlees was lauw water niet zo hoorde."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkR1YwMVNRV2RXWW5KU2EzcFBjbEpmWmxkWk9YYxAB",
            "text": "Awesome"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWmVGQjBWR2RMZG5GV2VVeDRRM0F4ZG1VdFdIYxAB",
            "text": "Great BBQ spot with live sports and a really nice outdoor area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMGIxUmtkVWN6Y1hSelozaFlkRjkwTm1FMmJtYxAB",
            "text": "Delicious 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT2FuRmhhRmwxUW1wT1kzQXplbkpqTVdkV1EyYxAB",
            "text": "Ribs were not fall off the bone. Ghost pepper hot sauce was good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT1VXbHZSVTVNV1hKWFVtY3hVVVZMYVVsR2VYYxAB",
            "text": "Speaking as a texan this isn’t anywhere near close to southern bbq, the sides neither. Price just isn’t worth it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GdU4xTndVUzFFZFV3MVJXMVNVM2xaVTFwd1YzYxAB",
            "text": "This place was bomb. Spacious inside and a super cute outdoor area in the back. The service was so friendly and helpful. Food was pretty legit too. The cornbread was a surprising star of our meal. The burnt ends were a bit too fatty but everything else slapped."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrNFgybDRUV1UwZWt3NVNFTXhTV2N4VFZwTFIwRRAB",
            "text": "I’ve eaten at John Brown’s several times. I’ve always really enjoyed their food. Food tastes great, big portions, tasty sides and their Mac and Cheese is amazing. Nice ice cold beers as well.  You’ll love this little gem of a place."
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOekxXUkVUalp3WjNsVFFsSTBlSEUzUW5SaVRVRRAB",
            "text": "Bonne viande et personnel très sympa\nExcellent rapport qualité prix"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKM1VVUTVRVVYxVVdsMVREVXpTbkY2ZWpFM1RFRRAB",
            "text": "I only went here one time so perhaps it was an off day for them."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNVpUbFJkM2hUUTB4SE5sTnNTRUYwUmxCUldGRRAB",
            "text": "Great spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRloyZ3lha1pxTnpWaVNETkxRa3hTUW1zNGVVRRAB",
            "text": "Kansas City-style BBQ in Queens."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oc04yVkxkV2RwZWtsMmEyMWxZazFTVkVoWGRrRRAB",
            "text": "Great food and prices"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sweFYxaEljVkZrV1ZSUVlWSmpRVzR4WlRKVmExRRAB",
            "text": "Good spot for some draft beer and bbq. We waited to pick up our food before moving to the outdoors seating area, but looking around it turns out they also bring you the food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNk5tVlJkWGhRTWxSSVJGaFBTMnhtZURadWRrRRAB",
            "text": "Dry brisket, no flavor, dry slice of sandwich bread. Just awful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNWRtMDBjVkZFTVVZNVNqWnhNRGhPZVdGdE5HYxAB",
            "text": "I love the roast chicken here, the staff are amazing and I love the western vibe of the restaurant ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWVpsaG5hWEZWZG10WE0zSXlOSFYxZUZobFVVRRAB",
            "text": "My family always go every 2 weeks to eat yesterday we were surprised at the food is not so hot lately the taste is not the same the sauce BQ👎Mac cheese very bad i don't know if it is the same owner or the chef think not to return…"
        },
        {
            "date": "3달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aVVqUkpWREZXVEVGeVJtZFFXR2xYVEVaV1FuYxAB",
            "text": "Das Essen war super, würden hier immer wieder hin gehen. Das Personal war super nett und gut gelaunt.\nDas Ambiente ist schlicht aber authentisch.\nHaben uns direkt verliebt."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JeFJVVTFNV2RTYlZsSE0yVmhVVjlOUzBjMVJuYxAB",
            "text": "I’m a regular, usually in once every three weeks or so. Lately, there’s been a drop in quality of the food and it’s making me wonder if there was a change in ownership or something? The meats are as great as they’ve always been. The Mac and cheese has been spotty, today being thin, the Reuben came without cole slaw and with different, flimsier bread. It couldn’t hold up to being picked up. It was never mentioned there were items missing. Could have said something and I could have ordered something else. We still have great experiences there and still want to go back and likely will, but I dunno what’s up and hope they get it sorted."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MWRHdHdNRWhIUmpoVVNVbFBNRlZWYm10SE0xRRAB",
            "text": "Placed my order over the phone for pickup. When I showed up, the food hasn't even been worked on. Not only that but my food was wrong, cold, and tasteless. My house salad was missing chicken and tasted like straight vinegar. The burnt ends I ordered was not burnt ends but actually cold, tough brisket. And the mac and cheese was know alright. I'm honestly not sure why this place has high reviews because the food was straight garbage and expensive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Bd05uSk9SbVUzWTBaV1lrSk5XbGxPWlRsd05HYxAB",
            "text": "We were so excited to try this restaurant as we heard so many great things about it, but sadly our experience was horrible and we will not be returning. We ordered a house salad, Mac and cheese, and burnt ends over the phone. When we arrived at the time they told us, our food hadn’t even been started yet, so we had to wait around for them to make it. When we got our food home, we discovered that our $13.50 salad had no chicken (it was literally just mixed greens with some corn, pickles, and sliced red onion) with a “house vinaigrette” that was basically just straight apple cider vinegar. The “burnt ends” were cold, tough, and extremely dry and looked more like chopped brisket than burnt ends (a quick note, when adding the photo below the AI automatically called it brisket!). The only saving grace was the Mac and cheese, which was half-decent but did not make up for the rest of the meal. We did call the restaurant to complain, and they did offer us a refund, however if that refund comes remains to be seen."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSa05EVmtVblI0TW1GM1pXODFVa0kxWm5WcE0xRRAB",
            "text": "Muy buena parrilla, excelente servicio y bastante tranquilo, todo un acierto."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVUxVSmtURmhLV25OVVptZGlWVzlYUjBKNGRrRRAB",
            "text": "Atmosphere is always crowded so had to give 4 star. The Hispanic guy out there is a gentleman . So calm and kind. He treats all his customer very well"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRmQzUlFhMmx4ZGxVMk5sZG5kWFZ4YjA1RlVXYxAB",
            "text": "Mac and cheese, burnt ends, and pulled pork were delicious.\n\nCollard greens and pastrami were good but too dry for me.\n\nI would go back and order more, we wanted to try the chicken but it was sold out."
        },
        {
            "date": "3달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neE1VdDBXbWh1VG1WelRUSjZkVUZxTFhsWFRGRRAB",
            "text": "Als Quartierrestaurant entdeckt und voll begeistert. Super Fleischqualität und tolles Ambiente. Von aussen kaum wahrnehmbar aber innen Top. Können es zu 100% empfehlen. Super Spare Ribs👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSGQyODRNamw0V0Y5TE5HNTBSWFZvTm5SVlQwRRAB",
            "text": "Called 10-15 min down the road and asked if open and accepting customers. I was told by the woman they were open and had plenty of room at the hour of 845pm. Upon arrival at 9pm less than 15 min later I was greeted with locked doors and I called to inquire when the same woman informed me that the restaurant had ran out of food. When I explained that shes the same person who informed me to come 15 minutes prior she said “sorry for the mistake” this was our arrival to NYC dinner and we wasted time when we could have gone to another restaurant had then been honest and/or educated on their kitchen status."
        },
        {
            "date": "8달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNnBYV2NREAE",
            "text": "아스토리아 바베큐 맛도리집….이런 곳이 동네에 있는줄은 상상도 못함… 코울슬로랑 같이 먹는거 추천… 피처 맥주는 한국을 그립ㄱㅔ 만든다…. 맥주 종류별로 생맥있어서 넘 좋음…!!!"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZaWUyMEVBEAE",
            "text": "today special로 립/소새지/식빵/코울슬로 를 시켜는데 립은 맛있는데 소세지가 너무 짬. 그리고 전반적으로 기름지니까 유의. 식사가 아니고 맥주안주로 시켜서 나눠먹눈다면 괜찮을듯"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeU5EQ1NREAE",
            "text": "굉장히 맛있는 고기와 매콤한소스, 콜라드그린,코울슬로 하지만 온도와 빵이 아쉬웠다"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNDVPLWpBRRAB",
            "text": "가격대비 맛도좋고 좋은곳으로  기억하겠습니다"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVci1UNHVBRRAB",
            "text": "쉐프가 추천한 맛집."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaXNMbnZBRRAB",
            "text": "대존맛"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvemRuSXlBRRAB",
            "text": "This restaurant offers an authentic Texas BBQ style experience with a great selection of drinks. The atmosphere is cozy and welcoming, with a spacious backyard area that can accommodate large groups. There are TVs available for watching games, making it a perfect spot for gatherings and celebrations. The food is delicious — everything we ordered was excellent. I visited on a Thursday, and the service was outstanding. A lovely Bangladeshi auntie took great care of all the customers, making the experience even more enjoyable. The only downside is that the location is a bit out of the way, so it’s more convenient for those who have a car. Overall, it’s a fantastic place and definitely worth a visit!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSlExbEVTRmhvWTBFd01EWnZVMkpUTldKblkxRRAB",
            "text": "A relaxed Kansas style BBQ spot with backyard dining area. Got a bit of everything to share including ribs, briskets, patrami, burnt ends and a bunch of sides. The choice of sauces pleased different pallates. After ordering, food was brought out relatively quickly. Great experience, waa first time trying American BBQ for one of the party."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXRuZXdnRRAB",
            "text": "What can I say? It‘s just perfect. Perfectly smoked meat, exceptional taste and quality. Everything we had was just perfect and you just feel great and will have the best time there.\n\nAbsolutely stunning how good the service was. All in all? 10/10!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQN3lrOG1XeF9XMWRBEAE",
            "text": "Kansas city is my second home town and it was very exciting to see a restaurant celebrating it. The vibe was very nice, not too busy or too quiet. They even had a live band come perform outside. The meats were delicious, especially the burnt tips and the brisket. If you like Kansas city BBQ this is the place for you."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVlFrWTBkSGxMWDIxdmVua3hYek5OUVhsdmVXYxAB",
            "text": "Some of the best BBQ I had outside the south. For NYC the food is a great quality and decent value. Pastrami, Ribs, and the sides were all very good! Beers are VERY expensive, but I guess thats hard to escape in the city."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbFZtVnJjRXh3VVVreGVYUjRSRzkyZFVsS01HYxAB",
            "text": "I visited John Brown with great expectations. However, I was not aware that they do not provide service. Where they may have someone greet you at the door when you enter everything was self service. They had a lovely garden, absolutely beautiful and a great atmosphere within the garden. We even shared conversation with another table. John Browne BBQ is a picnic style place. I enjoyed the fact that they allowed you to. For instance I tasted the baked beans and decided to pass on them. Also, I tasted the macaroni and cheese and decided to pass on that as well. However, the cornbread was delicious. Would I go back yes because now I have realistic expectations regarding expectations. Therefore, I believe if I had gone to John brown BBQ’s with the right expectations I would’ve possibly scored them higher. I hope those who read this review find it helpful."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbmN1TXZRRRAB",
            "text": "We had a pleasant experience at John Brown. All of the meat we ordered was tender. The sausage was beautifully spiced. Thumps up for the BBQ sauces. The friendliness and attentive nature of their staff members added to our wonderful experience. We were also lucky to secure the outdoor seating on a perfect weather day. Def could see how John Brown holds a popular place among its fans. Will stop by again if we are ever in the area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NGVFOU5OMmxhYm1JeE9UbEJkblpMY3pGTGQxRRAB",
            "text": "A Kansas City Oklahoma restaurant/bar in New York City. The BBQ is absolutely amazing. Great thing is you can take a train here and you are right in the heart of Long Island City."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaWZuUkxBEAE",
            "text": "Came here for lunch and honestly I was suprised at how good the food is and portion size is just 👌 for the price that I paid for I was really happy. This place is wheel chair accessible and the staff Is extremely helpful and kind. I would definetly come back here again.\n\nThe bbq tasted amazing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKemZncG1od3BYXzRRRRAB",
            "text": "If you follow me you k ow I love BBQ. I’m from St. Louis and feel strongly about it. Haha\n\nGreat smoke and love the big use of black pepper. Cornbread was perfect. Baked beans weren’t my fav but still ate them allll. Collards were beautiful.\n\nIt’s not cheap but it’s what it is supposed to be and that’s hard to find in the city."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTFJHVjJaMmRaWVY5NlRVMHpRMkYyUlVsUk5XYxAB",
            "text": "The ribs and brisket were quite good (some pieces were a little dry but still tasty especially with their bbq sauces) but the real star of the show is the cornbread!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaGN1cUNBEAE",
            "text": "Nice and cozy spot to grab food in the neighborhood. PBLT is out of standing! Chicken is extremely juicy and tender. The Ruben sandwich is also good according to my cousin. Wonderful experience, definitely will be my go to place."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfckxhWERnEAE",
            "text": "An BBQ institution that is a must go to in NY. we were greedy and ordered 1/3 pound of brisket, rib tips, burnt ends and sausage for sharing between 2. everything was delicious. I liked the burnt ends the best as it has the best balance of fat and meat. coleslaw gave a sour balance to the rich meat. overall, it's one of the best place for BBQ meat hands down!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0bnZHMndRRRAB",
            "text": "Really good BBQ place, perfect for a group gathering.\nOrdered a bunch of meats and some are definitely better than others. Firstly the pork ribs and ribs tips are the best, brisket is good as well. Ordered pulled pork but got burnt ends which were just okay. Mac and cheese was okay and the coleslaw was very good. The fact is that the BBQ sauce is so good that it will make everything taste great.\nOverall nice place with a good service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbVpUejZ3RRAB",
            "text": "Great spot for a casual BBQ night. The softest bbq meats that I've ever had if you're into that. I'm more of a chewy meat person so that was what was missing for me. But ultimately their meat has less fat and is just so easy to eat!\n\nWe got the pastrami, ribs and brisket and some coleslaw. We liked the pastrami and the ribs the most. Very chill vibes with a cute outdoor garden."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbFpYMXFRRRAB",
            "text": "Okayyyyyy this placeeeee we found staying at a local hotel and the flavors ! EVERYTHING was great the ribs , burnt ends , chicken , mac n cheese , baked beans ,collard greens ! Now I had to just pause for a second because  the cornbread ?! I’ve never had cornbread with corn in it and at first I was skeptical even the texture was different but good ! almost like a  cakey texture . So much we came back again and now we order a small and large 🤭🤣 what can I say ! If your in the area or in the 5 boroughs def get you some John brown for that bbq down south taste ❣️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cE1pcGR3EAE",
            "text": "Oh my God. This off-the-beaten-track restaurant has meat of the highest order. We ate our way through the manageable menu, up and down. One dish was tastier than the other. All in all, certainly not cheap, but definitely worth the money.…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcnR3ZnE1M3NPQ25BRRAB",
            "text": "So good! Staff was friendly, the food came quickly and was perfectly cooked. The cornbread was amazing - cake like texture with corn kernels. We got the burnt ends and we both felt like we got a generous portion. The collared greens weren't soggy and had great flavor. My friend loved the tallow fries. Definitely check this place out."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdmVpMEZREAE",
            "text": "Food was cold and the overall experience was totally disapponting.\nThey were joking about myself coming from abroad, making some stupid italian mimics. I do not suggest to come here, it is the worst place i have ever been in LIC.\nOwners please consider to change something"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbms0dk9idGVLclFnEAE",
            "text": "Super helpful and friendly staff, great tasting food! Some of the best BBQ ive had in the US."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaXJTM0RREAE",
            "text": "I used to love this place years ago in its old location, so I had to visit again when back in NYC. I am so pleased that the food is every bit as good as I remember - flavourful, crispy burnt ends, amazing sauces and a cornbread that threatens to steal the show. Friendly service, too. Hard to imagine a better plate of barbecue anywhere in the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqN3ZTNFdBEAE",
            "text": "I visited this BBQ place and the food was good. It was hot and the meat was tender. I got a Mac and Cheese, 1 lb of beef brisket, pastrami and burnt ends. The service great and the cashier was very kind and patient."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMR05vT1dvd1pEdTlRRRAB",
            "text": "This place was absolutely fantastic and a random fine by my boyfriend! The people were so welcoming the food was amazing and the inside and outdoor seating area. Space is absolutely fabulous. Perfect for families dates or even friends night out. Definitely will be coming back again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xa2VsZHhSbkZUTkhwVVEyZEJSRk5wVjB0cVFuYxAB",
            "text": "My family and I were craving some real Kansas style BBQ and this place hit the spot perfectly. Burnt ends were scrumptious and the brisket was tender and flavorful. The staff is very friendly. Definitely coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dGJETUFREAE",
            "text": "I know it's BBQ and everyone expects good meat, which it is. But the sides are where it's at, and unfortunately they stinged way to hard on sides at this place. 10.50 Mac and cheese for such a small portion is pretty ludicrous. The waiter was really nice and friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobDgzZWp3RRAB",
            "text": "This place has amazing food.\nI've had take out from here a few times but one Saturday evening i physically came here with my family. We sat in and dined.\n\nWhen you walk into the restaurant the registers are to the right. Someone took our order immediately. They have a great range of items on the menu. The restaurant has multiple tables and an outdoor space with a roof. You order your food, pay, take a seat at the table and wait for your name to be called. The person at the register was nice, patient and informative about the menu. Our food came out quick and hot.\n\nThe food is consistent every single time. The meats are ordered by weight, quarter, half, full, etc. Burnt ends are a MUST. I get them everytime. They have an excellent taste and are juicy. The brisket is also a must try. Really tender, great flavor. The ribs are meaty and hold a very smokey flavor, excellent. The corn bread is delicious. Not your typical corn bread. This one is moist, has corn pieces and is sweet. Its also scooped into containers because it is not those dry square kinds. This is outttt of the world amazing and different then what I've had my whole life. The mac and cheese is delicious, creamy,  good flavor and not too cheesy. They put alot of fresh cracked black pepper. The baked beans are really good and also include burnt ends. So it feels like a two for one. The beans are tender, have a great bbq flavor and are cooked to perfection. We tried the french fries and they are fresh, crispy and salty. Very good. The meal typically comes with sliced white bread as well.\n\nDuring this visit my husband ordered himself a beer. I had a Margarita. The Margarita wasn't the best. You can taste the lime flavor mix so its not made with fresh limes.\n\nThere are a few other menu items i have tried here in the past. Chicken sausage was one. It was good, smokey. I have also had the pork belly. It was the perfect amount of meat to fat ratio, loved it. The cole slaw was also good, creamy, seasoned perfectly and the cabbage still had texture which is great.\n\nThe restaurant itself is really clean. All tables were cleaned off immediately by a women who was maintaining the front house. My husband sees her every single time he picks up take out and during our dine in session she was there. She's always ensuring everything is cleaned. She also came by with plates and napkins a few times. I saw her stopping at each table asking everyone if there okay or need anything. She's a true gem, this place is lucky to have her.\n\nThe tables are set up like picnic lunch tables. The decor inside is simple but perfect. Above the registers they have the restaurant name tagged in spray paint, typically NYC art, love that.\n\nThis place is beautiful. The food is amazing and the service is everything you would want. This place isnt cheap BUT its worth it. I will continue to support them. Give this place a try, you wont stop coming."
        }
    ],
    "reviews_count": 82
}