{
    "name": "Ovelia",
    "place_id": "ChIJqUtnVkdfwokRsalMB02tYL4",
    "grid": "QN1",
    "address": "34-01 30th Ave., Astoria, NY 11103, USA",
    "rating": 4.4,
    "user_ratings_total": 894,
    "phone_number": "(718) 721-7217",
    "reviews": [
        {
            "date": "1주 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTVIxbFRaa3BUU1hFd2VISkpXbTVxWld0MWExRRAB",
            "text": "アストリアで出会った美味しいギリシャレストラン。\nエッグのほうれん草キッシュのブランチを堪能。\n味付けは濃い目だが、しょっぱくはなく、美味しくいただいた。\n店員さんの感じもよし。"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMmFYWkdTSGhWYld4elExVk1VMHByVGpoTWVGRRAB",
            "text": "A true staple in Astoria Queens. One of the best spots for lunch, dinner and brunch!!\nThe owners are wonderful and their team is exceptional, specially Kolleen, the manager. She’s the best!!\nPete and Chris have truly outdone themselves with the location and the food.\nBeen here plenty of times, the cocktails are excellent and the food is delicious."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taZk4xbGZaMHRqYzNCemJsVjJPSFpNWDJnelZHYxAB",
            "text": "This place offers exceptional price-quality balance. Fair costs, quality attention, and delicious cooking available. The service team and the food are ideally matched. The rates are customer-friendly and ingredients are quality. The neighborhood appreciates these options."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqanZUZVJnEAE",
            "text": "Fantastic Brunch at Ovelia!\n\nI went to Ovelia for brunch last weekend with two friends, and it was absolutely wonderful from start to finish! The ambiance is warm and lively, the perfect blend of modern and cozy, with that inviting Greek charm that makes you want to stay a little longer.\n\nThe service was outstanding, friendly, attentive, and genuine. Our server made us feel so welcome and checked in often without ever being intrusive.\n\nI ordered the Greek Breakfast, and it was perfection. The halloumi was perfectly grilled, the sausage flavorful, and the eggs cooked just right. Every bite was fresh, authentic, and delicious. My friends loved their dishes too, you can really taste the quality and care that goes into the food here.\n\nIf you’re looking for a spot with amazing food, great energy, and excellent service, Ovelia is a must. Can’t wait to go back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwYU5tVnFUMkZWVEdFdGFVRXdYMDQ0ZWxNMU1XYxAB",
            "text": "Very nice place for a date.  Devin, our server was very nice, kind and friendly with our questions. Definitely coming back!\nNice job guys !!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWWNrYzNhRFJoTm1Kdk5FOWhVRk0zYlRNM1FtYxAB",
            "text": "Go to spot. All the apps are out of this world - feta cubes! The pita and hummus are also a must. Good outdoor seating on a nice day."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVFZrdG9kVVF5U0RoelJEWklMV3BKTUdabE0yYxAB",
            "text": "Outside seating area was nice. But the constant barrage of candy bar street hawkers trying to sell you stuff was annoying. Food was very mid for the price. Service was OK, but overall the whole experience was just not really worth the money. I hate leaving bad reviews, but I just felt like I didn’t have a good experience here for the price I paid. It’s extremely expensive for what you get. I don’t think I’ll go back unfortunately."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scWJGbEtXVGxpWTNaS01XUmlTM0J4TWpSMmFGRRAB",
            "text": "I picked this place to give out of towners the best of both worlds: a taste of Astoria’s Greek scene and brunch. I had the lamb sandwich and the Greek Cab and they were excellent together. Two of the Greek-ified brunch options - the 3 cheese omelette and the chilaquiles - were table favorites. The Greek breakfast was not much to write home about: American mains with some Greek sides. Two not major downsides: the side of fruit was way overpriced (a handful of berries and a few slices of apples and oranges for like $10) and the coffee was very weak."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM1dHVk5aM1E1VlVGek56QjZUR1pEVkhJM2MxRRAB",
            "text": "Deliciosa y fresca comida griega."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNFh6UkthbGQ1Ym1FeFUwNWxVSGRQVW5GS2NWRRAB",
            "text": "Dressed up Greek staples. Apps plus monastiraki is this move"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcmRHcE1iR1Z6V2xSTlVWUkJaV016VTFCbFZXYxAB",
            "text": "Cozy Greek restaurant. Good for groups or for a date. It can get busy so not always the best service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeFUxOTFiek5xYjNoTmFESk1iR0ZDWjJGWllVRRAB",
            "text": "My go to spot every visit to Astoria. Food is always solid. Love their three dip platter, the coffee skirt steak, salads and everything else I’ve tried there. Good drinks and happy hour discounts on many of them half of the week (Mon, Wed, Thurs all day and Friday 5-8)."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReVJYRnBjWGxDV21aNVYycEJXWEpOU0VabFNXYxAB",
            "text": "This is one of my favorite places to dine in the neighborhood. So much so that I always bring my visiting guest here. The food and service are consistently amazing."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNnNfeTV3RRAB",
            "text": "I have been coming here for well over 5 years. While the menu might change here and then the food is always solid and the service is excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVVIzcHpha2QwT1ZwVlZERkhMVlUxVjBsRmIyYxAB",
            "text": "Good brunch spot with Greek twist. Food was good, with reasonable portions. Music a bit loud for my personal liking but fun spot. Does have all you can drink add on for those interested."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUVVubEphRlI0ZGxoUGNIZEdhbVozWmpJelprRRAB",
            "text": "I love this place. Best brunch. I recommend. Lovely environment"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSelYycFNOMVF3UzA1Nk9VYzJMWEpQVTFwTldrRRAB",
            "text": "Ovelia on Astoria’s 30th Avenue is the perfect spot for a memorable meal. Take advantage of the summer weather with their inviting outdoor dining. Whether it’s brunch, lunch, or dinner, Ovelia delivers every time. You’ll immediately feel the team’s genuine passion through their warm and attentive hospitality. Cocktails are bold and flavorful, while the dishes are both authentically Greek and beautifully presented. With vibrant flavors, a cozy atmosphere, and outstanding service, Ovelia is a must visit for anyone craving top notch Greek cuisine in NYC especially in Astoria."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keE5ETjJjakpRYjBOSE5tTkdWMUF4T1dKcFdVRRAB",
            "text": "I went for the first time with my friends and wow, I must admit we had a great time. The service, the food—everything was excellent. It’s definitely a place I would go to again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRmRIbGpXREIxYVZGcVVEUlNVR1pLUTFKeGRHYxAB",
            "text": "Horrible"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcGRIRlVhRVl6YTNFMFVEWTBTemhLU1dwdU1YYxAB",
            "text": "Mediocre food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWlRteHJNRlZNZFdaQlYwWkRTR3RKYms0MGFHYxAB",
            "text": "Great service. Fernanda took care of us and she was an amazing professional! Shout out to the manager as well !!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTmNtWnpabms1V2xKNGEwTndSRzlYVFhGelJrRRAB",
            "text": "Food was good albeit a bit pricey. Enjoyable dining experience"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNWGl2cGFLdk9hRUdREAE",
            "text": "I went here yesterday evening for father's day and it was fantastic. This is the second time I've been to this place and the food has been phenominal both times, staff are nice, the ambiance is great, and good mocktails if you're looking for alcohol-free options. I also appreciated how the waitress seemed to be giving real recommendations and not just upselling things to add to the bill.\n\nThe menu is one page, but there's mostly something for everyone. I'm a vegetarian and got a few small plates as a main, and my dad got the chicken main which he loved. The kafteri dip and greek ice cream also really stood out, the latter was really unique, sort of tasting like pine.\n\nA small thing, but I appreciated that they have cozy lighting, but individual lights on each table so that folks who may have vision problems can turn them on and read the menu. I can't count the number of times I've gone to a restuarant with someone who has vision problems and they've got to break out the blaring cellphone light just to read the menu, which is annoying for them and everyone around them-- so kudos for that great addition.\n\nIf I had one recommendations it might be to have one vegetarian main, but even without that I'd still be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLVk2djI5czUyUTFnRRAB",
            "text": "Such a wonderful spot! The food was absolutely delicious—fresh, flavorful, and beautifully presented. Olivia took care of us and she was incredibly friendly and attentive. The prices were very reasonable for the quality, and we felt truly welcomed. I’ll definitely be coming back again. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcUNrdEd6eV9XSS1RRRAB",
            "text": "Excellent food and service. The lamb tigania was incredible."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOaUI2UERReHJxVE1REAE",
            "text": "Disappointing experience. Server spilt my glass on wine on me and provided nothing more than an extra napkin and a hasty apology. Will not be returning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZnc4dm5uNnNlWWdBRRAB",
            "text": "Love having great restaurants like this in my Neighborhood. Menu is absolutely incredible & it’s just a nice little spot to go to for good brunch or dinner. Our server Sia was great during our visit , too. I strongly recommend this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMN3N2UGJGOGFDV0lREAE",
            "text": "I had a very disappointing experience at this restaurant. The food was overcooked—some of it even burnt—and tasted terrible. On top of that, we had to wait an unreasonably long time for our order. The service was slow and inattentive. Definitely not worth the time or money. I won’t be coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLM3E0TS1RNUtlVTh3RRAB",
            "text": "Great food. Wonderful evening. Just moved to the area and really enjoyed finding this place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNclhvYU9IdVk2OTBnRRAB",
            "text": "The restaurant has a great vibe — the atmosphere is inviting, and the waitress was excellent. However, the hostess left a lot to be desired. She came off as dismissive and unwelcoming, acting as if a reservation was absolutely necessary even when plenty of tables were available. She didn’t smile, wasn’t helpful, and made the entry experience unnecessarily unpleasant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLNkhxWmZ3NVozQmhBRRAB",
            "text": "I usually don't write reviews if I am not completely satisfied with a restaurant since I always like to give places a second try. Sadly, I won't be coming back to Ovelia. With so many options in Astoria, this is not the spot for me. The prices are ridiculously high for the portions provided. The tzatziki was in a tiny round bowl and such a small portion for french fries which were $13 and $14 each... I mean to spend $200 with tips and not be full is a little disappointing. The drinks were actually good... that's the only thing I liked.\nThe steak was good as well but the portion my goodness so small 🙈\nWhen I go to a Greek restaurant I want to eat a lot of food guys lol\nI will stick to my usual Taverna Kyclades, at least I get my monies worth."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJYjd1WUxpajgzSGtnRRAB",
            "text": "Good food but a bit pricey. Confirm all pricing before your order. Seven dollars for a water, french fries for thirteen, an egg sandwich for twenty? Like I said, good food but I thought egg prices went down. Guess not. LOL."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNQ013ZEhlb01hX2hBRRAB",
            "text": "Ovelia is an amazing Greek restaurant nestled in the heart of Astoria. They offer a standout dining experience from start to finish. The space is both beautiful and cozy which is perfect for a casual meal or a special night out. Their exceptional staffs are truly welcoming, attentive, and passionate about what they do. As soon as you’re seated, you’re treated to a complimentary amuse bouche while you barely needing to wait for the food and drinks. With Ovelia’s authentic flavors, warm ambiance, and top-tier hospitality, this is a must visit for anyone craving great Greek cuisine in NYC especially in Astoria."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbkUxNmVudXE3dW9nRRAB",
            "text": "A well executed place with classic Greek food done right. A gem in the neighborhood and worth the trip."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOGFpbkpREAE",
            "text": "Ovelia’s brunch menu blew me away as they made sure to throw their Greek twist on what we think is a typical Sunday brunch. The ambiance is amazing and the staff is beyond friendly. I highly recommend them!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ1p6NDRRRRAB",
            "text": "First time visiting this place!! Cozy Greek restaurant 🍴\nGreat atmosphere, good food & good service too😊\nWe ordered a lot of plates to share amount them the Greek salad, grilled octopus 🐙, Burgers, mussels Meze 🫒(We find out the burger a little bit dry and the mussels should have more “broth”) .\nWe were seating at the table next to the door, I really loved the outdoor sensation even if you’re not seating outside."
        },
        {
            "date": "6달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNTY2ZnVBRRAB",
            "text": "我們點了清爽的甜菜沙拉和很特別的羊肉三明治，味道都相當不錯！不過，最吸引人的還是那個早午餐90 分鐘 bottomless 。\n服務跟裝潢都很好！值得再回來"
        },
        {
            "date": "6달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcmVLZ2l3RRAB",
            "text": "安くて美味しくてボリュームもあって雰囲気も良い。みんなで楽しくワイワイやるには最高の場所。"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNkl6S0NREAE",
            "text": "One of my favorite restaurants in the city!! Impeccable food and service always 🩷"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa19mT3VnRRAB",
            "text": "Good food, nice atmosphere. Excellent hang out place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNU9uc0d3EAE",
            "text": "Date night at a local Greek Institute.\n\nEveryone told me this place was their favorite Greek restaurant around here and I can clearly see why. A mix of modern takes on Greek dishes including some wild fusion delights.\n\nHighly recommend trying a few of the fusion dishes, including the Greek melt, their beautiful lamb in the sandwich form feeling like an American take on Greek classic. And also have to try their Baklava Cinnamon Roll —- totally unique, dessert and something I will have to be back for soon."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNmZPb1JREAE",
            "text": "Ovelia Psistaria Bar, situated at the bustling intersection of 30th Avenue and 34th Street in Astoria, presents a contemporary take on traditional Greek cuisine. The establishment’s modern sensibility is evident in both its menu and ambiance, offering a chic yet approachable dining experience.\n\nThe Monastiraki Bifteki, a kebab crafted from a blend of ground lamb, beef, and pork, is a standout, delivering robust flavors that pay homage to classic Greek street fare. Equally noteworthy are the Baklava Pancakes, a brunch favorite that marries the sweetness of baklava with the comfort of fluffy pancakes, drizzled generously with honey and sprinkled with walnuts.\n\nThe restaurant’s outdoor seating area provides a pleasant setting for both brunch and dinner, allowing patrons to enjoy their meals amidst the vibrant energy of Astoria. Service is attentive, with staff extending warm hospitality that enhances the overall dining experience.\n\nWhile Ovelia excels in many areas, there is room for improvement in certain dishes. For instance, some patrons have noted that the octopus, though flavorful, could benefit from a more tender preparation.\n\nIn conclusion, Ovelia Psistaria Bar successfully blends traditional Greek flavors with modern culinary techniques, making it a noteworthy destination for those seeking a fresh perspective on Hellenic cuisine. Its commitment to quality and innovation earns it a commendable four-star rating."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdWJUam53RRAB",
            "text": "Cozy. Great food. Wonderful, friendly service. Reasonable prices. Adult daughter's birthday, and they made it special by surprising her with a nice Greek dessert (loukamades?) with candles."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnLUtmR25RRRAB",
            "text": "Great service, dope atmosphere, food was amazing!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMnBLZGVREAE",
            "text": "Amazing Greek restaurant in Astoria! The space is beautiful and the food is superb. Our waitress made excellent recommendations from top to bottom. Really wonderful experience! Stop by if you’re in the area!"
        },
        {
            "date": "8달 전",
            "language": "el",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbHU2aWVREAE",
            "text": "chilaquiles greigos\n\nbaklava pancakes\n\nkafteri\n\nhalloumi nuggets"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdF9TS21BRRAB",
            "text": "To Steki mas! Culinary, cultural and social cornerstone in Astoria with authentic elements from Greece in food music and atmosphere relaxed vibe thank you Ovelia a gem in our neighborhood"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOFpfWkhBEAE",
            "text": "Great service, food & atmosphere."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBa2V1TDlRRRAB",
            "text": "I stopped by for a food crawl event. They had their sandwich samples out quickly, and the server explained all of the ingredients before serving.\n\nI personally wasn't a fan of the sandwich, but that's because it isn't something I would normally order.\n\nThank you for the food!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBanBMUTlRRRAB",
            "text": "This restaurant is hands down the best in Astoria! I come here every month, and I’m always so happy with my experience. The food is top-notch—amazing quality, and every dish is always delicious. The waitstaff are so sweet and attentive, which really adds to the overall great vibe of the place. It’s my favorite spot to have dinner with my husband, and we always look forward to our next visit. Highly recommend this gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3X3NQWUlBEAE",
            "text": "My first time at Ovelia was incredible.Sitting outside & enjoying our food was the best way to spend Saturday night. Our server Gaby was such a great person, really attentive. She answered all of our questions and was helpful with recommending the daily specials. We started with fried calamari and halloumi nuggets, both of which were so delicious! Followed by our main Entrees of country style chicken and their special of the night- seafood pasta. My boyfriend was impressed with his espresso which he said might be better than his favorite coffee shop.I would definitely recommend everything we tried!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUODQyWlRnEAE",
            "text": "We arrived without reservations, and we're able to get seated immediately. We were next to the door, but the hostess  moved us as soon as a seat was open. Service was awesome. The server was attentive, knew the menu, and made good suggestions. Drinks, appetizers,  and food were all served quickly but with enough time between to enjoy. My food was good and I enjoyed it. Others in my group were less enthusiastic about some of their choices. I cannot say if the food was bad, I just know they were not as satisfied as I was. The bill was a tad high for what I think we had, but it was not unreasonably high. The atmosphere was comfortable and appealing. Im not sure if I would go back, but I would suggest others give it a try."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmb2JHaVp3EAE",
            "text": "5 stars in all areas! Menu is creative but still offers the Greek staples. Dinner last evening had me subtly humming with yummms throughout our courses. Everything was executed and served perfectly. From the lightly fried sesame crusted feta cubes, creamy lemon chicken soup, the freshest fried calamari,\nand decadent bone marrow, to my perfectly seared and seasoned lamb chops and lemon potatoes. But the star of the show was Chef Giannakas' smoked lamb melt. I mean come on. I will keep coming back just for that - if not for so many of the other items we tried this evening.\nSpecial shout out to our server Sia who was warm, friendly, and attentive and my bartender who made me an excellent Aperol Spritz.\nAmbiance was so cozy! Cheers to next time Ovelia 🫶"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNmNXWDVnRRAB",
            "text": "Love the Greek inspired dishes, cocktails and ambiance. Instantly fell in love with the appetizers so I knew the entrees were goin to be a hit, my prediction was accurate.\n\nSaganaki & Feta Cubes are a no brainer\nLemon potatoes, lamb melt and Saganaki burger and Loukamades were 🤌🏼"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzckx5NHZ3RRAB",
            "text": "I can’t believe I’m always in astoria but  I’ve been sleeping on this spot!\n\nOvelia is a casual Greek Tavern in the heart of Astoria with indoor and outdoor seating serving traditional seafood, lamb and more with a modern twist was blown away by every dish on the menu, thanks to the incredible talent of  chef peter giannakas.\n\nFrom the smoked lamb melt to the Whole Branzino, each dish left me speechless! fa And don't even get me started on the appetizers and desserts-they're all must-tries!\n\nPlus, you can catch happy hour specials on week days, enjoy live music on Thursday evenings, and treat yourself to a delicious weekend brunch!\n\nTaste of 3 spreads - kafteri, tzatziki, hummus\nChar-Grilled Octopus\nSaganaki Flambé\nWhile Branzino\nSmoked Lamb Melt\nGreek Coffee Skirt Steak\nMy My Greek American Pie\nClassic Loukamades"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MUtES1J3EAE",
            "text": "The best place for Greek brunch! Their ambience and entree selections are so great, lots of options that are a modern take on Greek. Would absolutely recommend the halloumi nuggets, sesame crusted feta, chilaquiles and salmon toast! Their fries were also delicious with oregano and herb seasoning. Will definitely be back to try their regular menu sometime. This is a wonderful place for a casual meal with a lot of flavor, highly recommend!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObnVhZ1RREAE",
            "text": "The food was delicious.  I had the lamb sandwich.  My friend had the steak special  and my husband had the chicken sandwich.   All of the food was amazing.   We went for brunch.  Oh, we had the best Buffalo calamari!!!!!   I am definitely going back to try the steak sandwich.\nSecond visit, I had the steak sandwich special.  It was delicious 😋!  We had the a sage drink.   The sage drink is sooo good!  The staff is always great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5aTZEbTFnRRAB",
            "text": "Everything about this place is top notch! Came here for bottomless brunch on a Saturday afternoon in February. I ordered the strapatsada and my friend ordered the burger. We both loved our dishes, I rarely order a dish without meat but it was perfect. I’m also not a fan of home fries, but these were perfect- very crunchy. The service was great and we added the bottomless option. The champagne and sangria was top notch. It’s rare to find bottomless brunch with quality drinks such as these. We sat outside, there wasn’t any wait. The inside is very cozy and modern. The waitress was great- highly recommended brunch place. I look forward to returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxMzdpM2tnRRAB",
            "text": "Ovelia is my go-to spot when in Queens. It brings back so many great memories, and the food is amazing. Chris has done a phenomenal job with the place, and the food on the menu is on point. You will be able to choose from a variety of amazing appetizers, entrees, and drinks. The atmosphere is welcoming yet trendy.  When the weather permits, you are able to sit outside at a table beneath umbrellas or at a bar stool and served by the bartender via a garage door. I can not say enough about this place."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlemZhSGh3RRAB",
            "text": "The brunch and dinner foods were really good, but the portions could be more filling for the price. The brewed coffee I got for brunch was really weak. The staff was friendly and very attentive. I loved the laid back atmosphere, especially the quieter sidewalk seating, which still offered opportunities to watch people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeGRXdWpnRRAB",
            "text": "Literally in my top 3 brunches across NYC! The service is amazing, we had a huge group but they were so nice friendly & attentive. Cannot thank them enough! And the food is freaking delicious. Got yia yias omelet!!!! 🩷love this place!!! Bottomless is amazing the drinks are all so good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCeVlfSTNnRRAB",
            "text": "I liked the restaurants decoration and service but was not impressed by the food. My expectations were way higher for a place with lamb in Greek as it’s name. There are hardly any lamb options and the one brunch sandwich is underwhelming one noted and salty and greasy. Most the food I tried was this way and very fast food like. I did like the spreads and pita as well as my cucumber rush. Thought prices were a bit costly for what was given and that a Smokey presentation for a sandwich is extremely gimmicky. I would put the herbed sauce on the side of the sandwich as well it looses its taste inside. Will have to return for diner as options look better but did look very expensive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMlpYcjhnRRAB",
            "text": "I've always heard good things about the Greek restaurants in Astoria - but somehow, it took us more than 10 years to check one, lol. Glad we finally did it - and glad we made such a great choice by eating at Ovelia. We had the Hummus, the Beet Salata, and the Smoked Lamb Melt sandwich - which was big enough to share. Everything was delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadmNmQVNBEAE",
            "text": "Craving Greek Food so we decided to hit up Ovelia which is situated in Astoria within the hustle and bustle of a busy commercial corridor.\n\nThe decor is decent but the table lighting doesn’t compliment the overall aesthetics.\n\nOrdered the octopus, but the server ordered the most expensive option without consulting us. The menu had a price of around $18 to later find out we were charged close to $40 for two tiny pieces of octopus. This truly influenced our rating and the lack of communication from the server.\n\nThe potatoes didn’t taste like lemon potatoes. The pita fresh was fresh and tasty.\n\nThe food is decent and tasty but doesn’t feel like authentic Greek Food."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNS03Nk5BEAE",
            "text": "This establishment impresses with its excellent customer service and tranquil ambiance, complemented by a menu featuring high-quality cuisine. I particularly enjoyed the Salmon dish, and the Hummus with the delightful addition of smashed olives on top was a truly delicious highlight. 👍👍"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2ajhmcWVBEAE",
            "text": "Great ambiance, delicious food, great drinks, and everything in significant portions. Worth trying!\n\nThe food we got:\n\nFried calamari ( good to share ) :\nTasty, perfectly cooked, and taste good with it without the sauce ( highly recommended ), it also comes with pita bread on the side.\n\nThinly sliced pork chop ( good to share ) :\nPerfectly seasoned and cooked. The fries are fresh and taste good. These two are a perfect combination. ( highly recommended )\n\nHalf grilled chicken ( good to share ) :\nTasty and perfectly cooked. The chicken is tender.\n\nGreek doughnut with honey and cinnamon :\nI would recommend this after eating savory food! Super soft and not too sweet!\n\nWe both got red sangria for our drinks! Super refreshing and affordable!\n\n10/10 ♥️♥️"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLaV96dTN3RRAB",
            "text": "Casual Greek restaurant in Astoria with really nice vibe. I wouldn’t say the design of the restaurant is typical Mediterranean but it does have some elements that capture that feel. We had the brunch and it was delicious. Thumbs up for food and service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdGJuZEN3EAE",
            "text": "Amazing Greek food located in Astoria. The menu isn’t huge but has all the Greek classics. I recommend starting off with a spread. We selected the taste of three and thoroughly enjoyed the kafteri/ tzatziki/ hummus trio. Burgers aren’t the first thing that comes to mind when thinking about Greek food but the Saganaki burger was juicy and packed with flavor. Greeks cook lamb to perfection so no surprise the lamb skewers were delicious and so tender. The highlight of the meal was the pita bread. Warm, seasoned, flaky just perfect. With or without the spreads, the pita was out of this world! The cocktails were beautifully and tasted even better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOVBIa01nEAE",
            "text": "Wonderful outdoor seating friendly staff and exquisite food. The welcome appetizer they offer you once seated is very dainty ! Oh and they have good sangria"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OWFXZEVnEAE",
            "text": "brunch here is delicious! overall, everyone was super satisfied with their dishes. the service was quick and the food was tasty. portions are also generous. definitely recommend the pancakes, couldn’t stop eating them. it’s so refreshing to have a menu with different takes on traditional brunch dishes. will be coming back to try their dinner menu!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtekpLa2V3EAE",
            "text": "Went to Ovelia with my best friend for some girls time and dinner. Was not disappointed in the least bit. The drinks were delicious, especially the Persephone. Beautiful appearance and even better taste! Started with the feta cubes and grilled calamari. Shared the lamb kontosouvli, so we could have room for the drool worthy loukades. Everything was so fresh and delicious and worth every single calorie. The service was very attentive and friendly. Would highly recommend."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGLWVqLVJBEAE",
            "text": "Ovelia is really lovely!! I had brunch here for the first time this weekend and it was a great experience - my girlfriends & I sat on the covered patio and the atmosphere was so nice! Our waitress was amazing; she was so attentive and gave us all the time we needed to catch-up + enjoy our cocktails and meals without making us feel rushed or hurried. The drinks here are awesome - I had The Grexican and it was so refreshing!! The food is so good, too (try the hummus & the fries, the Salmon Toast is great as well). I highly recommend this spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NGF2VF93RRAB",
            "text": "Relaxed place, music not too loud. Food was excellent, but a little pricey. Skirt steak was excellent! Comfortable having dinner sitting at bar."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDcnFqSDVRRRAB",
            "text": "I was super excited to eat here and to be honest, I’m glad I tried it but will likely not be back. The drinks were ok, but took forever to get to our table. I literally sat there looking at my drink for 5 minutes before it made it into my…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPenJqa3ZRRRAB",
            "text": "A solid local establishment in Astoria. I went here with some friends from out of town and they had the best experience ever. Proper service, clientele, and food ...what more can you ask for?\n\nPro-tip: Lemon potatoes and dip. Do it"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwNkt5RXJBRRAB",
            "text": "Everything we ate was great and our server/waitress was all around wonderful. She knew the men well and her suggestions were in point. Looks like they have a great selection for brunch and we'll go for that next time."
        }
    ],
    "reviews_count": 76
}