{
    "name": "Sac's Place",
    "place_id": "ChIJ9yi_ITdfwokR-NlVT6D9tMw",
    "grid": "QN1",
    "address": "35-11 35th Ave, Astoria, NY 11106, USA",
    "rating": 4.6,
    "user_ratings_total": 579,
    "phone_number": "(718) 204-5002",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSemJVZHJXRmQ0VG1kM00yZDJPVkV6TTJaQ1JGRRAB",
            "text": "The food was delicious. The location is downstairs and i am not sure if they have an elevator. We had cocktails with our food. I had a French raspberry martini. I will be going back next time to try the pizza."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMFZYUkxVbXByUzNrMFlsVlhTM28yT1MxR1ZsRRAB",
            "text": "This was the warm Italian hug I was wanting on our recent trip to NY. We were at the MOMI down the street, and had made reservations for dinner at Sac's. We had tired, hungry tummies, and were a good hour from our original reservation time. The good people over at Sac's accommodated my family immediately, and with pleasure! The atmosphere was welcoming, comfortable, inviting, and straight up authentic..this coming from a Sicilian girl with olive oil in her veins. My family ordered a variety of dishes, each one spectacular! 2 different pizza's, fried zucchini, sausage, and the BEST shrimp scampi I have ever eaten! The staff treated us like family, and were super attentive, anticipating our needs, and not missing a beat. At the end of our meal, Domenico Sacramone, one of the owners came by our table to chat, it was lovely and greatly appreciated! That's the extra touch of love, and attention someone who really cares about their business, and their customers puts out! It was genuine, and made the experience that much better! If we were locals, this would be our weekly dinner spot! Thank you to all over at Sac's Place for a wonderful meal, and a fantastic dining experience! We will most definitely be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SGNHOTFNRGxLT1hWR1lqWnVlVXBIWm1kdFYzYxAB",
            "text": "Great food and great staff"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKb09FRmllRFk1VWtZM1VVaHpOamxQVFVKVVZIYxAB",
            "text": "My wife and I have been coming to Sac’s place for a few years and love it every time, so it was only natural that when I had a big work gathering to hold it there. Sac’s went above and beyond to accommodate our group of 20 with incredible hospitality, unbelievably great food. And just a wonderful atmosphere filled with culture and history. Domenico and crew are true stewards of authentic Italian cooking “like his mom taught him”. That says it all. Every single one of our guests we brought that night went away full and completely in awe of the amazing food and hospitality. I can say enough great things about this place. It’s truly the absolute best Italian restaurant food in all of NYC. The quality of the meal and the value for the money can’t be matched anywhere. This group will be back!  Thanks Domenico and family!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabmNIYzVZbXRwYWtreFEzTkdjMjVDZEU0M1owRRAB",
            "text": "The Caesar salad was watery and gross. The pasta meat sauce had dry meat and tasted like canned pasta dishes.\n\nThe service was horrible and decided to automatically charge us 20% when we asked if we could have our food that was supposedly packed to go. We only asked after a table next to us got theirs despite asking after us. At $50 a person, this place a huge let down."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cVdETlZWMlp2VWtac01DMVlaSGRrT1dwR2FYYxAB",
            "text": "Super friendly. Super local. Super pizza."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taalpuSlhUamt5U25WRWVEQkVOMnhpZEVwUk9WRRAB",
            "text": "Excellent Pizza option and may be Italian options in Sac’s place\nWe tried the classic Pizza with chicken ,basil ,peppers and onion and it was delicious\nThe crust was perfect with the right amount of cheese\nThere were abundance of toppings and good for three people\nDefinitely a must go if you are in Queens/\nAstoria/Manhattan area\nThe service was great too"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTVZrVnRkblJSYlRCM2FtOW9SM2hITURkRVNVRRAB",
            "text": "We happened upon this place by accident and we were thrilled. Gorgeous inside, very friendly service, and most importantly spectacular food. Definitely will return wh n in NYC"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOd1EwNWliMDFDZERaUVV6TllURXhYV0ROUlNuYxAB",
            "text": "The food was so so good and the service was even better! The vibes are insane with live music around the end of the week i would definitely recommend you try this place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BNVVWcDFhRlpKYm1VdFRrMTFSVGh6UTJ0aU4zYxAB",
            "text": "I dont normally write reviews like this, but this is an issue that has become unbearable every weekend. This restaurant is in a central point of many residential buildings in Astoria. Every Thursday- Saturday night, this restaurant plays live music in their outdoor area at an OBNOXIOUS level starting from 7pm-11p. Frankly they're playing this music so loud for barely any customers. How customers can even sit near this while enjoying their meal, I do not know. We've called 311 multiple times and the restaurant to tone it down at the very least and we've had little to no movement on this. I shouldn't be able to hear a song at crystal clear volume in my bedroom. I understand that outdoor dining is popular in the summer and it attracts more people and thats fine and not the problem. All I ask is to play at a volume where it does not disturb the entire neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMGEzUk5OMUpoVTFaaWFIRmtaRzlxWm1oT1NYYxAB",
            "text": "The service was fantastic but I was disappointed that they seemed to use bagged frozen broccoli on the pizza. It was small and that shade of green that only comes from the bag and it had zero flavor. Loved the white pie and the prosciutto so next time I’ll skip the broccoli!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdVJWcFFWWGh5WHpsWlVubEtSRXczZUVGNU5VRRAB",
            "text": "Very calm atmosphere, excellent service, and wonderful comfort food. I got the chicken napoletana and it did not disappoint. I got a Ceasar salad as a side and the dressing was exceptional. Prices aren't cheap, but the quality and portion size make up for it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SWVraE1RMkUwTUhsZlgxUlJiVXBVZUVJM1UxRRAB",
            "text": "I found a cockroach in my pasta while a mediocre band blared in the background. Terrible."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRmRVOXNMWGxDUWtOWmVHNW1lVGRUUVZGemJXYxAB",
            "text": "Fantastic all around. Best Italian food around, by a landslide. Owners come around to make sure all is good. They have their own farm...their tomato salad is out this world. One of the few we know who can make broccoli rabe the right way. Pizza, pastas, entrees all exceptional."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSGEyMVpTVTFGZERWdlFVSjBVM0UyVm1walNXYxAB",
            "text": "Everything was tasty and fresh the vegetables come from the owners farm and taste delicious they are attentive and helpful with everything we asked for 5 stars"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMFEwWXlabDlJVldOZldtVnlRVXhEVTFBellYYxAB",
            "text": "Sac's place is an excellent family owned and run italian restaurant in Astoria queens. The service is top notch and professional on all fronts.\nI can't recommend going here for lunch, dinner also family gatherings."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Zd09WRmZNMlJyWW5WYVJVNWtWRGQwY2xoTU4wRRAB",
            "text": "just insanely bad food compared to the pricing. overcooked chicken added was 9 and soupy sauce that tasted like milk was $28. if you're charging $37 for a basic pasta at least use heavy cream. even the cocktail was terrible. can't believe this"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RFNtSllZVEJIV25KVU5WOVdOa1ZuWjE5MmIzYxAB",
            "text": "We recently went to dinner at Sac's for the first time after having walked past many times and wanting to try it. We could not be more pleased.\n\nIf you are looking for a classic, old school Italian eatery with good food, excellent service and great atmosphere where the owner sits and chats a bit, look no further.\n\nThe prices are a bit high, but what you get in exchange is a fantastic dining experience.\n\nWe had the chicken parm, baked clams, potato raviolis with honey & rosemary, and linguini with clams. All were fantastic."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNVVXTmtTVzFwWTA1U1NEQkNYMk5vUmpWbGFVRRAB",
            "text": "Italian tradition served with heart and flavor\nThis place had me from the very first bite.\nWe enjoyed crab and a smoked lobster ravioli  that were absolutely finger-licking good. The grilled artichoke and the eggplant parmigiana were on another level — and that sauce… just spectacular.\nYou can truly taste the care in every dish; these are family recipes passed down and protected like treasures.\nWe topped it all off with some perfectly chilled Aperol Spritz, the ideal summer drink.\nA soulful spot where tradition meets bold flavor. Highly recommend — and trust me, come hungry. 🇮🇹🦞🍷🍆"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRVpFaEVZa0p0VkRBelIyUndiVnB5TUVwUlEzYxAB",
            "text": "First time here ordered a steak and cheese with mushrooms and onions. Absolutely delicious bread was awesome. Could be a little cooler inside to eat. Not gonna knock them it is scorching outside and it’s a pizza joint lol"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtbzhQRFlnEAE",
            "text": "I oder a large Sicilian and garlic knots but\n. Were burn and old.,,also the garlic was MIA..it will be nice if you make it when customers place the order..there we go again 12/15/24 I order a Sicilian pizza and it was an old pizza. What they doing are just reheating it ..that's why the bottom is burn and it takes old.  It's a waste of 44 dollars..YOUR FOOD LOCKS ON FLAVOR ..PATHETIC FLAVOR.."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poV1JEaENPV3BrZUVwdFQyNUxNWGxvYVMxdWVXYxAB",
            "text": "If you're looking for better pizza, it's a fool's errand because it's here. The outdoor pizza garden in the summer is incredible. The menu extends far beyond pizza with the freshest ingredients available. This is a can't miss spot in Astoria."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVFJHUk1SM2Q1UlRONU9ITllkMjVDVUdWUGIwRRAB",
            "text": "Sacs Place has a long history in Queens, and to me, makes the best pizza in the world. Most restaurants fail to retain flavors and textures in their pizza when switching from a brick oven to an industrial oven. Somehow, Sacs got better. They cook real italian food, and will never give you a reason not to finish your plate. The service is never short of amazing, and the food is never short of perfect. The atmosphere is authentic, it’s italian, and it’s New York. Always amazing music playing, and always a happy family eating. I grew up eating Sacs and now bring my lover here anytime I can. Greatest italian in New York, and best pizza in the WORLD"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twalRsWTVTV052Y0hsVlZXMU1OblphYTBkTlJVRRAB",
            "text": "My first time sitting in a restaurant with actual cinematic history, the recipes are over 200 years old, passed down like precious family gossip from grandma to mom to sons and you can taste every generation.\n🎬 This spot once fed Rudolph Valentino, Gloria Swanson, and the Marx Brothers and decades later, even the writers of The Sopranos couldn’t resist. They were so hooked, they named a character Johnny Sack as a tribute. Iconic!\n\nThe food started strong with the complimentary bread they really set the stage for the meal. The homemade ravioli, pizza, and baked clams were a total flavor party that definitely deserves its own Oscar, lol.\n\nThanks for watch my review and please don’t forget to follow my page for more!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNGEwTlNaamM0TmpVNE9EaGZORUpVUVdKaE5GRRAB",
            "text": "Lunch here was yummy! We had the chicken parm and chicken marsala. Good portion size, and the bread was nice and fluffy. Great service as well, attentive and friendly. It was a little tricky to find, but lovely once you are inside. Go check it out!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONU5USjBWazFKTUV0bmVtMXhXUzB0WjFGUFZtYxAB",
            "text": "Love this place! Have had events here for my organization, and have had dinner here seperately with my family. Food and service is always fantastic!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQS2R1N20yc2E3N2dnRRAB",
            "text": "Sacs place is my go to spot whenever I’m in Astoria and need a good drink and good Italian food! Bartender makes really good drinks!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa3VpbGJBEAE",
            "text": "Literally the best Italian food in Astoria."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb05UVnRRRRAB",
            "text": "Incredible food.  Pizza is great and the chicken Marsala is the best i have had.  They have their own farm which makes the ingredients even better.  It's a great family feel and their are about 4 servers and wait staff that are their to serve you."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc2NlUk9BEAE",
            "text": "Thanks for the 🔥"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveE9TaVNnEAE",
            "text": "Quaint old Italian place with cool pics from the 1920’s of clientele from the nearby film studio. Terrific attentive service. Tomato pie was very good.\nUnfortunately we found the rest of the food rather bland. We ordered mussels in white wine sauce. Seafood pasta special. Lobster raviolis. Shells with sausage and broccoli rabe. One of the salad specials."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbjVQTmpBRRAB",
            "text": "Delicious Italian restaurant in the heart of Astoria! We knew this is a legendary place so had to give it a try. Overall experience was good.\n\nService and atmosphere were great. We went on a Friday night with a reservation and there were plenty of tables available. Service was attentive and prompt.\n\nFood was pretty good but did leave something to be desired. We got:\n- Caesar salad (delicious)\n- Sicilian pizza (the best of our meal)\n- Gnocchi pasta (good but kinda bland)\n- Linguine pasta w/ clams (kinda bland)\n\nThe pizza was the standout. It was delicious during the meal and even so delicious reheated. The small size was still big so we had plenty of leftovers.\n\nThe pastas are OK. Nothing wrong with them but both could have been seasoned better. It mostly tasted like straight carbs with some splash of light sauce. The linguine only had some extra taste from the natural flavor of the clams. We had to add some peppers to it to make it interesting.\n\nWould go back and try other options on their menu! Their specials menu looked really good but since it was our first time there we selected our usual favorites to set a good baseline. Will come back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbU1iTHdnRRAB",
            "text": "Great food. Extremely friendly service. Great location"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aklpVnF3RRAB",
            "text": "Had a fantastic experience at Sac's Place, food was fresh and delicious, and the service was genuine but not overbearing. Will definitely go back in the summer and sit outside."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cUxuWGFBEAE",
            "text": "Delicious pizzas and great service/ambience"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMWRidnFBRRAB",
            "text": "Best Italian restaurant in Astoria by a landslide. The family is so sweet and the food is consistently amazing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReF9DeWxRRRAB",
            "text": "If you're looking for a true taste of Italy in Astoria, Sac’s Place is the spot. This family-owned gem has been serving up homemade dishes for over 30 years, and you can truly taste the care in every bite. Their pasta is either made in-house or imported straight from Italy, ensuring an authentic experience.\n\nThe setting is what makes this place extra special. Housed in what was once the cafeteria of a movie studio, Sac’s Place now boasts a cozy, underground dining room that transports you to an Italian speakeasy. For larger groups, there's a private room adorned with photos of films shot in the studio and the family that has lovingly run the restaurant for decades.\n\nThe service is warm, welcoming, and prompt—something that’s becoming rare in New York these days. The owner himself was present during our visit, personally checking in on each table, which added a personal touch you don’t often find anymore.\nIf you’re craving a homemade meal in a one-of-a-kind setting, Sac’s Place is a must-visit. Highly recommended!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNnBTV1RnEAE",
            "text": "What an incredible restaurant. We went here after a visit to the museum next door and it was just lovely. Warm and inviting, attentive staff, and divine pasta. They have a delectable dish with red pepper cream sauce (my favorite) which I can never find anywhere in my home state. We met the owner too who was very kind and friendly. Seriously, you can't go wrong. I only wish we had more time during our stay because we would have gone here for more meals!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfclk2c2tnRRAB",
            "text": "This place is so amazing.  The food is delicious, the ambiance is classy, yet cozy and the service is first class all the way. Everytime, my group dines here we ask for the server Freddie.  He is kind, knowledable, professional and is really funny."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfM3BLczR3RRAB",
            "text": "Nice"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOHFiRTRRRRAB",
            "text": "**Sac's Place - A Hidden Gem for Amazing Pizza and Family Vibes**\n\nIf you're looking for an unforgettable pizza experience in NYC, Sac's Place is the spot to visit. From the moment you walk in, you're greeted with a warm, family-oriented vibe that instantly makes you feel like you're part of something special. This place is more than a restaurant – it’s a home away from home, where the love for food and community is on full display. ❤️\n\nLet’s start with the food. We had *Mama’s Old Fashioned Pizza,* and let me tell you, the flavor was absolutely out of this world – you can taste the authenticity in every bite. The Sicilian pizza was also a standout; hands down, this may truly be the best pizza in NYC. Bold claim? Maybe, but it’s well-deserved. Perfectly balanced crust, fresh, high-quality ingredients, and a sauce that feels like it’s been simmering for hours in a traditional Italian kitchen – just wow. 🤩\n\nThe prices are reasonable, which makes the experience even sweeter. It’s rare to find such exceptional pizza in NYC without breaking the bank. Add the cozy, warm décor and you’ve got a place that feels like the perfect balance between homey and special.\n\nWhat truly sets Sac's Place apart is the incredible staff and service. Super attentive, friendly, and genuinely eager to make your time there memorable – they really go above and beyond to add to the experience.\n\nWhether it’s a casual dinner with loved ones, a family event, or a birthday party, this gem is perfect for every occasion. Sac's Place is more than just a restaurant; it’s a celebration of great food, community, and togetherness.\n\nDon’t sleep on this treasure – stop by Sac's Place and prepare to fall in love. I know I’ll be back, again and again! 😊"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNHB6UzdBRRAB",
            "text": "Our favorite pizza in Queens. Absolutely devastated they don't deliver to Hunters Point South anymore 😭"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeTR6c013EAE",
            "text": "Everyone has their to go to best pizza ever spot, well this is mine. Any pizza i try anywhere it is always but in scale of how good is it compared to sacs. Been eating this pizza since i was 3 back in 1989 so my opinion could be biased but sacs definitely has the best pizza"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNXNYSkxBEAE",
            "text": "Nice"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeXU2eDBnRRAB",
            "text": "My fiancé and I love Sac’s place.\n\nWe found it looking for a place to host our engagement party and worked closed with Domenico who was super supportive, respectful and a huge help in the planning. Sac’s place food is delicious and the staff is amazing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmN09DUlBnEAE",
            "text": "Great experience, we held a special event there so the entire spot was occupied by my company, but everything was awesome"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQOXV6SkpnEAE",
            "text": "Food was meh. Not memorable and not really worth the trip to Astoria, pizza was good and best part of the meal, pastas are okay but taste like you can make it at home, lacking some flavor overall."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzc2N5X2dBRRAB",
            "text": "My wife and I sat down in search of some good Italian food and loved every course. First off, the decor and lighting is so nice and makes you feel at home, while romantic at the same time.\n\nThe calamari here is absolutely memorable. I love the way it's cooked. So tender and very lightly breaded. Fried perfectly. Our entrees were the shrimp and eggplant parmigiana, both nice portions and great balanced sauce. You won't want to miss this place if you're looking for great Italian food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOTkybTZnRRAB",
            "text": "We never had a bad meal or a bad time\nThe family works together to prepare and serve their mom’s ancient recipes brought back from Italy many years ago.\nThe food is always fresh and full of flavor 😋😋"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycmM3dE1BEAE",
            "text": "Best Pizza in NYC 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIOXQtWTV3RRAB",
            "text": "Just to be clear, we ate at the outside seating part. The Kaufman studios had a free day to look through movie set stuff.\nService was friendly. Family owned joint.\nSeating area was nice. We just wanted 2 slices to go and they said you can eat at the bar if you like. The pizza was so delicious. Best I've had in a while. This might be my go to pizza spot when I want pizza around the area. I wanna come back and actually have a meal here one day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bWNxNzdBRRAB",
            "text": "Today we had the pleasure of eating at Sac's Place at Kaufman Movie studios.\n\nBaked stuffed clams, basil pizza and handmade gnocchi... everything we ate was fantastic. Drinks were great too.\n\nService was awesome, super attentive and cordial. The owner was there, and came over to talk to us, super friendly guy... gave us the background info that many of  the recipes on menu are his grandmother's and go back over 100 years. This place is a gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0ZzR5YVNBEAE",
            "text": "Absolutely gorgeous food, and most welcoming owners & staff.\nWe happened upon this restaurant after my partner played a gig at Museum of Moving Image and are so glad we did. Dominic(o?) the owner shared old photos of his family & made room for my partner's instruments out of the way so they would not get damaged.\nThe salad w strawberries was gorgeous and the port was delicious - a generous portion, not a thimble-full like many places.\nDefo a place to return to!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMnRmZElnEAE",
            "text": "GREAT EXPERIENCE! I cannot say enough good things about the fantastic food, great service and beautiful design of Sac's place. If you are looking for a classy event space in Astoria or just a night out for dinner, we highly recommend Sacs. We recently held a private dinner event there for a baptism.\nAnthony, the owner, was a pleasure to work with. He made the whole process for planning the event so easy and was super helpful. We had a group of around 40 people including some babies, everyone had a blast and were raving about the delicious food/attentive service. I had mentioned to Anthony that a few of our guest had some dietary restrictions and he personally updated each dish on our menu to be friendly for those guests AND personally took their orders. My friends said they have never felt so accommodated at a private event, and appreciated how attentive the service was. We all had a fantastic time. We will definitely be using Sacs for future events. They also have an option for valet parking which was a great perk.\n\nSacs Place would be a great choice for any party - rehearsal dinner, baptism, anniversary, baby shower... I especially like that the decor is beautiful so you really don't have to worry about putting up much for decorations (we used balloons and photos for the table). The tile work when you first walk in is beautiful and the bathrooms are granite with a stylish floral wallpaper (bathroom includes a tastefully placed changing table if you're looking for a party that is kid friendly, if you aren't then you won't even notice the changing table).\n\nLastly, the dessert is DELICIOUS."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKLXVfRFNBEAE",
            "text": "The owners/ managers have been there a long time and will tell you stories about the place when it was a studio restaurant. Very cool building with original flare. The shrimp Parmesan was excellent. The pasta fugal was not so good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOFlDV253RRAB",
            "text": "Sitting outside right at dusk with a nice breeze, the rainbow lights on the telephone booths, a coke and an amazing slice from Sacs is a must do for anyone hanging out in Astoria. The pizza is perfect crispy yet soft, tangy sauce and a good stretchy amount of mozz! The bars great, staff is friendly and its such a perfect date spot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPd291cmpnRRAB",
            "text": "Great location at Kaufman Astoria Studio. Unique setting outdoors open air bar and seating. Pizza ovens right there. Pizza is terrific. Other Italian favorites also available. Perfect for a late afternoon bite and glass of wine. Some limited selection on liquors outside bar, but overwise it fine."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIOXJ2YXJBRRAB",
            "text": "Great sicilian slice! The cheese is so thick. Each chew I bite through a chunk of oven warmed mozzarella. A little bit oily, fingers are covered but its ok. The crust was hard on the outside and soft on the inside. Tastey!\nWe sat at the bar, watched both the Jets and Giants game and enjoyed our pizza. Amen.\n\nThink this will be the neighborhood spot."
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMU03Y1p3EAE",
            "text": "Good Italian restaurant. The pizza is quite unique - thin crust with outstanding cheese and sauce. I don't think I've ever had another slice of pizza quite like Sac's. Must Try! Sacs also has a full menu for lunch and dinner. During the summer they feature fresh produce from their country garden."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSME9iVjhBRRAB",
            "text": "Best pizza, those Sicilian slices are delicious. The espresso martini was amazing as well! The staff is so kind and courteous."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPd2FuSHZBRRAB",
            "text": "Walked up at 9pm and ordered 3 slices of pizza: cheese, pepperoni, and mozzarella with basil. They were heated up while we waited.\n\nMy first time eating New York pizza. It absolutely did not disappoint. The crust was thin and crisp but not crunchy. The flavor was amazing. I liked the plain cheese best. In fact, we ordered a second piece of the cheese.\n\nWhile I was waiting for my second slice, the owner came over and we chatted about pizza. He was so nice and welcoming.\n\nVery glad we came here."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnd3NmMUhnEAE",
            "text": "The manager Louis is the man! He takes care of each person that comes in. We love him and he makes this place the best. The pizza is one of the best around hands down! The pasta and bread and other items on the menu are always good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX2V1b29RRRAB",
            "text": "Been there couple times and the service quality is consistent. The food is delicious and authentic.\nHaven’t tried but there are outside seating as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0bUlmZ1pnEAE",
            "text": "My family and I absolutely love this restaurant. It’s warm and welcoming. The staff are so friendly and the owners truly make you feel like family. The food is always delicious, especially the chicken parm and pizza. The staff are so attentive and accommodating. We’ve even booked their private room to host several family events. I included a picture of our most recent set up. All our guests left extremely happy from all the good food and drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNXJQR3NnRRAB",
            "text": "Great place for traditional Italian food!  The eggplant rollatini and salad with grilled salmon were great!  Thursday karaoke night is fun!  Nicely decorated for Christmas!  Great for family gatherings."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURac3UyTEpnEAE",
            "text": "Classic, authentic Italian meal in Queens. Anthony, Freddy, and the whole staff went above and beyond with the best recommendations, the freshest tomato salad, the best ravioli, and phenomenal chicken parm. So glad we were finally able to stop in. Looking forward to coming back. Go Giants!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbHVhaDdnRRAB",
            "text": "Located at the cellar corner of Kaufman theater, this local Italian restaurant offers plentiful portions and a bit leisurely service. Meatball's a bit oversided and lacks seasoning on the inside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWc3ZfMXdnRRAB",
            "text": "Sac’s Place is a family-run Italian restaurant with classic cuisine from mamma’s recipes. The homemade pasta and pizza are great!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHcnVlRFV3EAE",
            "text": "Used to LOVE this place when I lived in Queens,  back then they were on 29th st and B'way. The pizza is the standout here, above average NY Neapolitan style crust will all that great chew and crust meets fresh sauce and fresh mozzarella…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dV9YMklnEAE",
            "text": "The food was kind of mediocre, especially considering that it was just pasta and pizza. However, the service was great and the building’s history was so cool."
        }
    ],
    "reviews_count": 70
}