{
    "name": "Sanfords",
    "place_id": "ChIJK6yDNjdfwokR_I3wR_rkS8s",
    "grid": "QN1",
    "address": "30-13 Broadway, Astoria, NY 11106, USA",
    "rating": 4.4,
    "user_ratings_total": 2497,
    "phone_number": "(718) 932-9569",
    "reviews": [
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxOWZtcU5BEAE",
            "text": "I’d like to update my opinion about this restaurant. After the great first impression I had four years ago, I’ve been back several times, but each visit has been a bit more disappointing than the last — until last night, which will be my final one.\n\nWe asked for the dessert menu and ordered two: the lava cake and the mango-coconut mousse. I also ordered an espresso martini. They brought the lava cake, which has absolutely nothing “lava” about it — it’s just a chocolate cake with ice cream on top. Very disappointing, because if you offer a lava cake, that’s what customers expect, not something else.\n\nThe other dessert never arrived; the server forgot about it. When I mentioned that what they brought wasn’t a lava cake, he just said “I’m sorry” and walked away, as if it were a service issue — but the real problem is that they’re offering something that’s not what they actually serve. He later apologized for forgetting the other dessert, admitting that part was his fault.\n\nThe espresso martini was okay, nothing special.\nI won’t be coming back."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoelNTMDBWbHB0ZVVscE9VWkliMHhrV0Vwd1JVRRAB",
            "text": "The beef is only 5scoop of fork and and I’m still hungry it’s all mushroom and the service people was so rude don’t go here for food if u wanna satisfied ur tummy"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUFNrNXBNbXB1YkdSVFJsTmxUSFl0Y1VGb00zYxAB",
            "text": "The quality of the ingredients was noticeable."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pob1NHMTNia05HUjBNM1l6TnNUVkpNVjNsUk9XYxAB",
            "text": "Like it"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMVluSk1TRzluV1ZoTFlrRnhMVXh3V1MxQlMyYxAB",
            "text": "Heard they had some delicious filet mignon springs rolls here and had to give them a try and they were really good! The sauce they give on the side was great nice kick to it and I had the skirt steak sandwich very tender steak my buddy had a burger and it was good as well definitely a nice local spot to get some nice meat dishes"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUGJGUTFjVUpMVEhOek9IbE9ha2hET1d4eFVIYxAB",
            "text": "The establishment offers exceptional customer service and a diverse menu of delicious food. While parking availability in the vicinity, including paid options, presents a challenge, the location's proximity to the subway station provides convenient access. I confidently recommend this establishment."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MGIwUm5XRlUwZVVKQ1FtZEpTV0ZPYzFwd1MxRRAB",
            "text": "We went to Sanford’s for a quick lunch on Sunday — very unfortunate experience. The staff seemed more interested in chatting and laughing with each other than paying attention to the customers.\nWe both ordered the skirt steak, but instead received bowls of chopped steak leftovers with zero flavor. It was so unattractive and tasteless that we returned it less than a minute after it was served. This wasn’t just a case of not matching the menu description — it didn’t even qualify as food.\nThere was no manager on the floor to speak with, and the two people behind the bar didn’t seem to care about customer service or hospitality. Instead, they were gossiping about patrons in a language they assumed no one understood — openly, in front of customers sitting at the bar.\nNo one asked questions, and nothing was removed from the check. No one answers the phone when you try to call and ask why you were charged for something you couldn’t eat — even as a regular customer of over 15 years.\nExtremely poor management. What was once an Astoria institution is now just a bar with open inventory, sub-par service, and a shrinking menu (quality-wise).\nI rarely leave reviews, but after too many disappointing experiences and wasted efforts to give this place another chance, I’ve had enough.\nStay away. There are far better options in Astoria.\nThe only thing that has kept up with the times here is the price — and that’s not compliment."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTVZEWmhTVUpHUmtWSGJYaG5lWE5HWlU1UlpFRRAB",
            "text": "Best Airport Pizza! 🍕\nWaheed served us, was 10/10, very friendly and he didn't stop, very attentive!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S2QxcFNhV3RCTVhoUGEzQkVVbEJEWm5rdGVrRRAB",
            "text": "Perfect for brunch. Food is always delicious and the service is excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wek0zbGZNMWRsVUhVeFRFRm1OM1JZUzJKVVNuYxAB",
            "text": "I have been to Sanford's at least half a dozen times, and have yet to be disappointed. The food is always good, the service is great, and the overall atmosphere and decor takes you from brunch to dinner and late night seamlessly. My only critique would be that they did away with the half dozen oysters with a half bottle of Veuve Clicquot Brut brunch special; but since I still come back clearly not a deal breaker.\n\nDefinitely an Astoria gem. Come see for yourself."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNE5qbDRNWE5ZUW1GYVgxTkVjV0Z1VVRodFNYYxAB",
            "text": "Best oysters i’ve had anywher"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVFdTMUxWVkpVYmtnMFJXVmxVM1ZQWjJ0elJFRRAB",
            "text": "The atmosphere makes you feel at home immediately. Their menu items satisfy cravings. Workers were reliably helpful. The kitchen creates good food, servers are prompt, and everyone is pleasant. My time here was remarkably enjoyable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kc1VWbzNSRmQxZERkQlpsSjNOVmhqVUVWMWEyYxAB",
            "text": "Went for brunch today. We both ordered the big boy breakfast. Scrambled eggs were cold as was the potatoes and the waffle. The butter did not even melt when put on the waffle.  We walked out.\nThis is second time I had a bad experience with them. Last time my hamburger was raw."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMk1USk9aekZWZWxRM01rMDVjMGxFVGxaNE1FRRAB",
            "text": "Best cozy spot in Astoria!\nDrinks, food specials & happy hour 🤩"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TWVFMVRjMXBqT0ZGWlJuVjJRV0pMWVRWSlVrRRAB",
            "text": "Great food amazing service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WVdHTnNWSFpYTm5sVGJHTnpVSEJWUjBjd1YyYxAB",
            "text": "Delicious food & the sweetest servers. Must try if in Astoria"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RE0zUm9ha2t3U0U4dFVXVTVUbFZQZUc1Q1NGRRAB",
            "text": "Definitely do not get anything delivered as that was my experience and never ate the food inside dining. So please take this review as a complete opinion of my takeout order. Ok I ordered the pulled pork sandwich (award winning?!), sweet potato fries, and french onion soup. First the app will not track delivery person. So, figured I would call and kindly ask the driver to call prior to arrival in order to not inconvenience the delivery person. They seemed to be annoyed by my call although polite and said the driver will call when downstairs. Sure enough the drivers call was marked as spam and went straight to VM. Luckily I noticed within a minute or so and immediately called back and let him know I would be right down. He was nice but seemed annoyed as well. It quite possibly might have been the same person that took my call earlier. I immediately went upstairs to finally dig into my much needed food order. Well, the picture below was my first piece of garbage I removed from the delivery bag. For those that cannot see it is supposed to be a pulled pork sandwich. It was unfortunately a squashed and deflated bun on top with a soaked and soggy lower bun?!  The middle filling was a hunk of average at best pulled pork and a heaping side of red tortilla chips. The French onion soup was missing so much. There wasn’t much complexity to it to be honest and it was once again average at best. The sweet potato fries unfortunately were wet and soggy.  There isn’t much you can do to have bad tasting sweet potato fries. Taste wise they were fine. But there are ways to send fried foods without them dying too much. Or you can deconstruct the menu item to keep the food from dying in transit. Most people have the ability to revive the temperature if the food wasn’t hot but the crisp was still there and things weren’t soggy. So, overall I had a bad experience but this isn’t an in person dining experience. So please do not take my review too seriously."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOU1JqbDZXbVpHYmxWNE4ycDNRVVpzUjFkcVEwRRAB",
            "text": "Great breakfast options, quality is consistent, and the option are plentiful!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNVdqWmpja2R2WmtaNllXSTVXbmhNV1hZMU1HYxAB",
            "text": "Came here because my husband said the food was good. Sad it say it wasn’t. The drinks on the other hand was really really good. The cranberry salad tasted old. The chicken served with the salad tasted stale. It literally tasted like they cooked it in the morning and served it to us at 5pm when we had dinner. The fish tocos was unseasoned but fresh. I say just come here for the drinks and the oysters. That was the best part of the meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJNFpGSkdVV1JIVkd3M1pUWjFhVU5mWHpKaU1WRRAB",
            "text": "Large restaurant with a few spaces. We got a booth- love the booth!  I have to say the food here is really good.  Huge servings of calamari, butternut squash ravioli and chicken Caesar salad. You will not be disappointed here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcVNtUkNSRzFZYzA5TFh6UnlTVUpNWWxkU09XYxAB",
            "text": "Love the food ! Also my kids love it ! The service was great and fast ! , im definitely coming back !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxd1dqTmZOa2xFV1RWM1ZGUXdTbGh3TTBsdGIwRRAB",
            "text": "All began well as they had my reservation and then put our table together. We met our server whom took our drink order and then came back to take our food order.  Before our food came she refilled our coffees , I then asked for half and half.  Which I she must if forgotten ( which happens) .  The bus boys immediately got me half and half after I asked them.  They were on top of everything , helping customers and cleaning. The food was brought out by the runners .  The food was very good and all was cooked as requested. The chef did a fine job. I did need several things like more butter , and syrup but was unable to get my waitress to come over again , additionally she never came back to our table until we sought her out to pay our check . The two bus boys were incredible and did save the day by helping us. We were a party of 5 and when I received the bill a 22 percent gratuity was added to the bill ? Their own web site says a gratuity will be added for parties of 6 or more. I always tip well and usually extremely well. I would not go back as I feel the service was not up to par. I was disappointed as I brought a family member there for her birthday .  The whiskey bar looked amazing and was very well stocked I’m not commenting on that part of this establishment as I didn’t partake in any sampling or consumption."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMWRETnFaMlpWUjBzMlFqQlZibXN5ZURkSlRIYxAB",
            "text": "Decor features wood, stone, and Alaskan photography"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WFJGZHdVelZuT1c5V01YYzFaRmh3UkVnMVpWRRAB",
            "text": "Sanford’s never disappoints. I’ve been coming here for years, and the food is always fresh, flavorful, and generously portioned."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVFMxZE5PRUoyVUdkWmVEaGtSamRYWlcxdFNtYxAB",
            "text": "Sanford's continues to be a favorite for those in the neighborhood and beyond. In the 20+ years of being a customer, Sanford's has delivered excellent food, service and atmosphere every time I'm there. The menu is great anytime of day, but the brunch especially is top-notch! Try the scrumptious crab cakes Benedict, the burger, the make-your-own omelette and the steak skillet....then keeping coming back to try the rest of the menu! The bar is also filled with amazing choices, including a fabulous wine selection. Go there now!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSlMxQm5Oa3M1TkVkblRtVnlPRXRoYm5WZllYYxAB",
            "text": "Food is not tasty and overpriced."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwaFdEaHhiV1pmU3pGSldXcHZVM05YUzNWVWNXYxAB",
            "text": "The service was great but don’t get the crab Benedict unless you like a lot of breading. The chicken quesadillas and the filet mignon spring rolls were a 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMGExcGhSMjl2UjNZMFNsSjZXRUYwZVZodVNGRRAB",
            "text": "Service is great! The bar Treated me well every time.  And even the Host down to the bus boys! Love them.\nRecommend 100%"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaFRITm1lVE5RVFhJdGFIUkNaVjloWVZFNFZYYxAB",
            "text": "I got the Chicken Milanese and the Onion rings, the onion rings were okay but the Chicken Milanese was extremely bland. I would have given one star, but the service was good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cd1QzVXdSMlZrYlZKR1MzUlpabk5pZUV0WFZtYxAB",
            "text": "Son invited for Brunch and our meals were unique, flavorful and even my burger was amazing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWFVtaGxNWGxuUkhKM2RHcGxZMUF4TUV0TVpXYxAB",
            "text": "Good food and professional service. Had breakfast which was good but not a real test of culinary skill. That said, I'd definitely give them a try for dinner. Great spot for getting away from the hustle and bustle of the street."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neVJWWlFSbGxTV2tSamRUbFpUVUZaTkZOTFZIYxAB",
            "text": "I love that they have organic options at decent prices.  My favorite is mushroom ravioli and organic chicken sandwich."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cU5uQlRaVkF5Tm5aNGNrYzJlWE50VmxoelYxRRAB",
            "text": "Very good food and service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twaGJHTk5hbTFOYjJzMFRXRmhaVVZGUlhOa1RWRRAB",
            "text": "Atmosphere was gorgeous and service was great. Unfortunately, they lost me with the food. We ordered the breakfast quesadilla and the breakfast burrito and neither had any flavor at all. It tasted like they didn’t put salt and pepper. The portions were big! We’ll try to come again for dinner in hopes that the food will be better!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNmVrWnJWMjlyY0U1d1VGVjVlalptU25sU2VHYxAB",
            "text": "Sanford’s in Astoria is one of those spots that hasn’t changed over the years—and that’s part of its charm. The atmosphere is still cozy, the service friendly, and the food consistently delicious.\n\nWe had the tuna wrap, tacos, blueberry pancakes, chicken wrap, and avocado rolls. Everything was great—especially the wraps and pancakes, which were packed with flavor and super satisfying. The avocado rolls were just okay, but still a decent start to the meal.\n\nIf you’re looking for a reliable brunch spot with a solid menu and welcoming vibe, Sanford’s is still one of Astoria’s go-tos."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcFZYUktPRU16WWtoaUxXeDZlbmxoY25sdFJIYxAB",
            "text": "The French toast was fabulous. The black coffee also tastes delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUlJIUnZTRzB4TWtRMFdIQm5MV1pzTVhWT1RHYxAB",
            "text": "A little disappointed in the seating arrangements but the food was excellent quality. I made a reservation for 5pm for my family of 5 to celebrate my son’s graduation. We arrived early at 4pm thinking parking would be hard to find in the area but fortunately we found parking around the corner from Sanfords. I went in and asked if it’s possible to be seated early and the hostess said yes and showed me where was available for seating. To the left of the restaurant was very noisy so I opted to sit on the right side of the restaurant at a booth. At the time, I thought the booth I selected would be fine for the five of us. I went to inform my family we would be seated early and when we returned I saw they had added an extra side table and chairs to the booth. It felt very awkward sitting in the isle like an outsider. I asked for another table where myself and my family could sit together to celebrate and another hostess said there’s nothing else and there’s only seating at the booths for persons of 4, not 5. This was the only hurdle of the evening and my back hurt from sitting on that side chair having being turned to view my family the entire time. It was uncomfortable. The food and server were excellent. The servers were very courteous and hard working. Every one of my family members enjoyed the food. Every dish was excellent. Calamari, chicken quesadillas, Skirt  and hanger steak ( a little dry and overdone but still ok), mashed potatoes, creamed spinach, asparagus, chicken teriyaki dish and lobster ravioli ( this was the best dish according to my mom)🥰. The food made up for how the seating was so I gave 4 stars."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cVJDMUpOMVZxVlZsaVdqQlZPWFZ2T0VWM2VVRRAB",
            "text": "I made a reservation for my sons graduation, sat down and waiting for 15 mins for someone to take our order. A waitor came over after we went looking for someone, they took the order. 45 mins later no one came with code or and apologized for taking such a long time know we came in with the kids.\nWe ended up leaving with no food.. my husband tried to explain why we are leaving to the waitor and the waiter act like it was the least of his concern.\n\nHospitality is important and this place had none."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Nlp6WkhkRlJJZVY4d1RFRndObkpaVUdKQ1lYYxAB",
            "text": "Fantastic food (portions & quality were very good) and good service. Great place for weekend brunch in Astoria !!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKQ1MweERTelpEYjJKcVVtTTJPVWcxVGtsUVkyYxAB",
            "text": "I ordered the chicken teriyaki dish and received an old avacado. Not a big deal but for 28$ it should be immaculate."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNN1J5c2Zmd3JUWTRRRRAB",
            "text": "Sanford's is a fantastic spot whether you're meeting friends for brunch or enjoying a dinner date.\n\nFor brunch, the steak and eggs is always a reliable choice, but I highly recommend trying the sweet chorizo hash, served in a mini skillet--it's absolutely delicious.\n\nFor dinner, the raw oysters are incredibly fresh, and the lobster mac and cheese is simply unforgettable. Their burgers and PEI Mussels are always a solid option."
        },
        {
            "date": "5달 전",
            "language": "fi",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJV3F4OGY3bVptLUdBEAE",
            "text": "Ruoka oli erinomaista ja palvelu ystävällistä."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQT1J6dWZ6OGFhUXRBRRAB",
            "text": "One of my favorite places for whiskey and oysters"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYS11N2F5dE1UOHZRRRAB",
            "text": "Great service and delicious food! Must try Chilaquiles !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLWG52cmZoNjZIdnBRRRAB",
            "text": "Love the variety of whisky they have, so with that said getting and old fashion should not be a problem"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOV2JwYk94cWFYWGZBEAE",
            "text": "I’ve been going to Sanford‘s for over 20 years and I’ve never had a disappointing meal there. Tonight was no exception. My husband and I shared an order of the mussels, he had a bistro burger and I had the hanger steak with bernaise sauce and cream spinach on the side. This steak was better than most of the steak I’ve had in steakhouses. I go to sanford’s very often to meet people for lunch and for weekend brunches too. The food is always great- very fresh and well-prepared. The waitstaff is also super nice and professional. You really can’t go wrong going here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZVU4Y09pclltNUJnEAE",
            "text": "My first time in New York and I’m from Georgia. This little place was so cute and quaint with a welcoming atmosphere and staff. Great for a date or a single brunch for yourself. I loved it here!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcU9pbTJBRRAB",
            "text": "The host and servers were very amicable. It was easy to find a reservation time a day before. I loved the atmosphere and cute date vibes the place gave."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJV2o4LUQzcXVPUS1nRRAB",
            "text": "Food & drinks are overpriced for the portions. The Brunch menu is very limited. Drinks were average at best. Chelsea, our server was very sweet, with no complaints there.$150 for a chicken quesadilla 2 short rib tacos a chicken club n pancakes 1 aperal spritz 1 sangria 1 vodka soda n a spirit. I left, still hungry. Had Burger King an hour later."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQX2JzWVRUc2ZEcXNBRRAB",
            "text": "Been coming here for almost 2 decades, always an amazing meal. Was blown away recently by their Salted Caramel Old Fashioned, and I don't even have a sweet tooth. It's a must try, probably if not the best OldFASHIONED variation I've ever had. Yummy steaks and amazing bourbon collection. Can't wait to return, seriously."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlanZiLW9BRRAB",
            "text": "음식을 3가지를 오더 했는데 다 맛이 있었습니다.\n그런데 숩이 약간 짰습니다."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMmVLaUlREAE",
            "text": "This restaurant usually does a good job. I live near by so I've had food from here no less than 30 times in person and pickup order. It is amazing that the food is listed as explicitly organic!\n\nMy one complaint if I were forced to give it would be that there is not the ability to pay for your food at the front of the restaurant, the hostess has to take your card walk all the way to the back and then bring it to you. A portable payment system or even one up front will be far more efficient as you can end up waiting long depending on the time of the pick up.\n\nStill I love this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYam9fczdnRRAB",
            "text": "Our visit to Sanfords Restaurant was nothing short of amazing! From the moment we stepped inside, we were struck by the inviting ambiance that set the perfect tone for a memorable night. The restaurant has a warm, stylish vibe, and the music selection was spot on—just the right mix to enhance the atmosphere without being overwhelming. The volume was ideal, allowing us to enjoy the tunes while still holding easy conversations, no shouting necessary.\n\nThe food was absolutely delicious! Every dish was crafted with care and bursting with flavor. Whether you’re coming for dinner with family, having a date night with your spouse, or meeting up with coworkers for a laid-back hangout, Sanfords delivers on every front. It’s the kind of place that feels both special and accessible, with prices that make it an affordable gem in Astoria.\n\nThe service was excellent—attentive without being intrusive—and added to the overall relaxed, enjoyable experience. We truly felt welcomed and well taken care of.\n\nIf you’re looking for a spot in Astoria that checks all the boxes—great food, perfect ambiance, excellent service, and good vibes—Sanfords is the place to be. A solid 10/10 experience that we can’t wait to enjoy again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldlByZ0d3EAE",
            "text": "Attended this restaurant with several colleagues for brunch. There is only off street metered parking in the area. The interior decor of the restaurant is chestnut wood finishings. The ambience of the restaurant is mellow and relaxing. The staff are friendly and attentive. The food was freshly prepared and drinks were good according to my colleagues. The food was really good and well presented. I will definitely visit again soon to experience other great items on the menu, especially for dinner time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MDQ2RENREAE",
            "text": "I had lunch at this restaurant today and it was amazing. The service , food and atmosphere was quite nice. Be back for sure ."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbnV5Y29RRRAB",
            "text": "The service was quick, and they catered well to our dietary requirements. The food was simple but delicious, and the friendly waiter made us feel right at home. A great spot for an enjoyable, hassle-free meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaVlqLWRnEAE",
            "text": "The space was super cool with a modern industrial glam look. Love the uniforms on servers. The place was spacious too. The drink were really delicious and strong. Try the lavender limeade! Really good! The food lacked flavor so a lot of salt and pepper was needed, even some hot sauce but it makes sense given the area. Not many can handle powerful flavors. The space was clean, professional, bright, spacious, stylish. I'd givr other items on the menu a try down the road."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQM2YzbHZnRRAB",
            "text": "I met up with friends I hadn't seen in months for brunch.  Great food.  My dish was delicious however the duck on my plate of duck confit and waffles was small and not a proper confit. It was just two drumsticks that were more like fried chicken (it was hard to decipher whether it was duck or chicken as it was cooked very well done). I was expecting shredded meat and a more generous portion. I'd be fine with a higher price point for duck and more on the plate to balance out the waffle and plantains. Just a note as someone who's been industry for years.\n\nOtherwise, my cocktail was great and I was happy with my slice of cheesecake for dessert. My friends enjoyed their food as well.   I'll definitely be back again to give it another chance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMWNxNzJRRRAB",
            "text": "Great spot near the N W train. Feels fancy. But good breakfast, lunch and dinner. The pork rib tacos were great, ahi tuna appetizer. Not a cheap place but the food was all very good. The wait staff take your dishes away a little too quick. But that’s a small thing. Still a great place, coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYd3R1STN3RRAB",
            "text": "I had a beautiful brunch experience in Sanfords. The food was amazing, the burger I had was juicy, and full of flavor. The portion was more than I could ask for. The sanfords wrap were great as advertised with fresh feel to all the ingredients. I definitely recommend anyone who is looking for an easy experience with their loved ones and delicious foods."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NGF2Zl93RRAB",
            "text": "Great service and incredible food. The tomato soup and fried calamari are some of the best I've ever had, and the duck burger is an innovative dish that fascinated me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJX0x2VWZREAE",
            "text": "Was here for lunch. Great HH oysters.  I also had the chipotle burger (burger was a 4), nothing special.\n\nSophisticated decor, good music, Attentive staff\n\nI’ll be back to try other items on the menu."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDaW9ETVBnEAE",
            "text": "Really good food and service! I love the menu and want to go back to try more! The avocado spring rolls are delicious! I had the seared tuna salad and it was the perfect entree sized salad! The skirt steak was fantastic too. The cocktails are great - try the limeade with lavender."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOXZXU0lREAE",
            "text": "Met up with my whiskey sister at this bar. She has been telling me about a place not in Manhattan that has a great selection of whiskey and offer flights.  The bartender SAM was great in her selections and the food was good too. Definitely going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5XzlmdmJREAE",
            "text": "We visited this place with a good friend on a Friday night. It was busy so the hostess asked us to wait for a couple of minutes so she could accommodate us. We ended up sitting in one of the couches on the right side as you enter the restaurant. Great choice. We handed over the menu right away. We chose a calamari plate as a starter and 2 main plates, chicken for my friend and pasta with meatballs for me. We also did a few drinks.\nThe service was exceptional. Very attentive. My pasta was overcooked. It wasn’t al dente at all and I am a pasta lover. Meatballs were good. This is the only reason I’m giving 4 stars. Good place, good vibe overall. Good job guys :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkamViSGpRRRAB",
            "text": "Went for brunch to celebrate friends birthday. Nice restaurant with bar. Pretty big. The food was amazing and so was the service. Would definitely go again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdXZQS1p3EAE",
            "text": "I went to Sanfords for the first time and wondered why I hadn't been there sooner. The menu has a nice variety of options ranging from pasta dishes to tacos. I ordered the mussels and was pleasantly surprised by the portion size and the delicious broth. My friend ordered the steak sandwich and loved it. We shared the cheesecake dessert and it was a nice way to end our meal, sweet but not heavy. The real star of our night was Allie, she was our server and bartender and offered a flawless experience (answering questions about the menu, making recs, checking in etc.).\n\nWhile my friend an I enjoyed our meals, it wasn't until we got to chatting with Allie that we said to one another, \"we've got to come back!\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsN3ZMWFBBEAE",
            "text": "Sanford's had a great modern industrial vibe. While still being warm and cozy, and the food is simply delicious. My honorable mention is the Lavender Limeade, the best cocktail I have had in a long time. Their menu had a great variety of options, and the service was great. Overall, my family had a fantastic experience at Sanford's, and I would definitely visit again."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMmVXRlNBEAE",
            "text": "Sanford's has a great date night vibe, whisky drinking crowd or happy hour specials. For those seeking a nicer but still casual place to have dinner with friends, this is the place to be. The menu is filled with a variety of seafood, vegetables and meat options. Something for everyone. Specials daily, full bar, Happy Hour on drinks and oysters. It's dining room is dimly lit and often busy. Reservations suggested."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXN3BIMUx3EAE",
            "text": "Lovely Brunch Spot. There menu looks appetizing for all 3 meals of the day. Very strong drinks.\nOnly con I have with this place is..the waiter should've known to give a plastic cup for kids."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSZ0tEM2l3RRAB",
            "text": "Came for brunch with a reservation on a weekend, we were sat right away and service was attentive. Had the rigatoni vodka with chicken and the Eggs Benedict. Also had the burrata - all the food was really good. Wasn’t crazy about the Bloody Mary, but overall enjoyed everything and would definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMa05iNWhnRRAB",
            "text": "I enjoyed the vegetable paella which can be made vegan upon request. The warm blend of vegetables provided a good contrast and a variety of flavors. I would recommend complementing the dish with a side of sweet potato fries. Note for vegans: the sweet potato fries is cooked in the same oil as nonvegan foods."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBc2IyT0R3EAE",
            "text": "The food is great! Drinks are delicious. Staff is courteous and friendly. The atmosphere is very lively."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTeUlydk5REAE",
            "text": "Sanfords Astoria is so popular that the wait is always bad, especially on weekends. We highly recommend to visit earlier to beat the crowd. Their indoor decoration was one of their signature features but we had our brunch gathering outdoor.\n\nThe options on the menu were various and we were lucky to share different dishes with a group of five. We had Pulled Pork Eggs Benedict, Corned Beef Hash Skillet, Prime Skirt Steak Skillet, 16oz Prime Skirt Steak & Egg and Breakfast Burrito.\n\nWe were not impressed with the taste but satisfied with the look of eggs on top of each dish. They cooked all different types of egg perfectly and lovely. It’s a compliment since plating is definitely one of the most important elements for brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5c2RQN0dBEAE",
            "text": "I came for breakfast giving the staff every reason not to serve us well. I brought my 9 month old daughter and 3 year old nephew to enjoy a nice breakfast.\n\nThis is some of the most incredible staff I have ever seen. I don’t believe I could have had better service if I were royalty. Thank you Miguel and Cheanne.\n\nThe food was great, the atmosphere was very enjoyable, but the attentiveness and service of the staff made this one of the best dining experiences I have ever had. The owner of this establishment should be extremely proud.\n\nI do not hesitate in saying this is one of the nicest casual restaurants in all of queens, possibly all of New York."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxb2V5cnhRRRAB",
            "text": "Dollar oysters happy hour between 4pm-6pm daily. Solid deal. Had the Gouda stuffed duck burger which was tasty. Friend had the lobster tacos which I  thought were not impressive. Still a great spot to come for brunch or a drink at the bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROb2Nma2RBEAE",
            "text": "I had their brunch, service was great, as was atmosphere, decor and music. Fully stocked bar and a few screens. It wasn't crowded but kept a steady flow of people coming and going.  Portions weren't that great neither was presentation, but taste was delightful.  I would come back.  Restroom was clean."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MllxellnEAE",
            "text": "I always love coming here! I love the interior design, especially at the bar. The food is always good and they have a good menu for brunch, lunch and dinner. The food is always good and the portions are generous. It’s a good place to go for a special occasion, business meeting or a date night option. My favorite for lunch/dinner is the yellow fin tuna sliced in salad!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCNi1iSG13RRAB",
            "text": "We went there for Saturday brunch. We ordered Crab egg Benedict, steak and spring rolls. The mimosas and spring rolls were good. The foods were not tasty and it was hard. My english muffin was really hard to cut and chew. We wanted medium rare steak but we got well done. The server came and without asking he was about to take my plate then I had to tell him I am not done eating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseXVYbTN3RRAB",
            "text": "Came in for brunch. Food was great! Loved the ambiance. The lighting made the setting romantic and the music matched the atmosphere very well.\n\nWe ordered the Steak Skillet along with the Chorizo Skillet.\n\nThe steak was well cooked and seasoned. It was served with hash, vegetables, and two eggs with the amount of steak outnumbering the other ingredients.\n\nThe Chorizo was complimented with two well done eggs, an avocado spread, and a side salad.\n\nOverall it was a good meal for brunch and I recommend coming here."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2cU11anlBRRAB",
            "text": "Loved the extra upscale ambience here!\n\nThis resturant provides a great brunch menu and specially a good variation of Mexican brunch.\n\nThe only concern I had was- taste was up to expectations for Fish Tacos and Hollandaise sauce on Egg Benedict.\n\nI recommend this place if you are limited by high travel times to NY Manhattan."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cE1QYkJnEAE",
            "text": "Best happy hour spot in Astoria.\n\nFresh oysters at an unbeatable price, fantastic  wine selection, friendly…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbnQtLTR3RRAB",
            "text": "Sanfords was not bad! Came here for brunch on a Wednesday and had a fairly decent meal. We started off with the calamari and truffle mac and cheese. Both were GREAT! I have no complaints. Everything was on point. I'm typically not a fan of loose mac and cheese but the flavors made up for it.\n\nUnfortunately, the actual brunch meal was sub par. I've had my share of Eggs Benedict and the one at Sanford's was just \"ok\". The hollandaise sauce was lacking alot. It looked great but the taste was almost watery and bland. The french toast was basic with a overwhelming amount of berry and pecan syrup.\n\nDespite the breakfast items, Sanfords is alright with me."
        }
    ],
    "reviews_count": 83
}