{
    "name": "Beija Flor",
    "place_id": "ChIJA9zY7SxfwokR2Sh2eXYcRd8",
    "grid": "QN1",
    "address": "38-02 29th St, Long Island City, NY 11101, USA",
    "rating": 4.4,
    "user_ratings_total": 1053,
    "phone_number": "(718) 606-2468",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMWNuVlZhR3B2U21oTFRqZGhPVm90VlVGblgwRRAB",
            "text": "I’ve been living in New York  for 7 months and since I arrived here I’m staying in Queens as a Brazilian international student. I’d been looking for Brazilian food ever since, and I finally found this place 😍 It’s an out of words spot!  I was treated really well, and the drinks were simply fantastic!  Gabriel, who took care of me and my friends did a great job. that Caipirinha he made tasted just like the traditional ones I had back home at a place called. Great place to feel like Brazil ☀️😍"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSGFHSjNkMFZTT0ZSdmVYQllkVnBYWm5KaVZXYxAB",
            "text": "Siempre la pasamos genial, buena música, buen baile, buena atención y buena comida. La última vez nos atendió Loren y fue excelente! Gracias por todo, seguro volvemos pronto!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSk4wNDBNblpOZVdVeVIwSnNVVGQ0ZFZZNVoyYxAB",
            "text": "Beija Flor was discovered through my online research. Their employees deliver consistently good service. The dishes here clearly meet highest standards. This place has found its special angle. This restaurant has gained a regular customer."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMGNFaDBNVmRPWnpKRWFHMXZha2RJTnpkSE4xRRAB",
            "text": "This little gem in LIC has the perfect balance.  Food, Ambiance and service.\nFood is exquisite and service is perfect\nYou can’t go wrong with this place."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQ1J6VnpRa3RTTm5aS1lWVklkRTF5V2pZMFJGRRAB",
            "text": "We had great time in this restaurant. It was our last night in New york and it was close to our hotel. Very recomend"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWlpITTJObEkyYjNCNVgxbFpkbmRzVkZOWVNrRRAB",
            "text": "Be careful this restaurant include %20 tip for a $35 dollar tap, this happened to me in a lunch special on a weekday which doesn't make any sense"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKR1JraERNbEpRUjJReWFYSktTbkJoZDJwVVdXYxAB",
            "text": "Great experience. Ate here twice. Food and service was great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWmNUaHJUWGRWVG5SakxXeGljMEpGVUZWUUxXYxAB",
            "text": "My Brazilian friend invited me here and I was amazed with both service, drinks, and food. Servers were pleasant and spoke Portuguese and English. I felt comfortable and loved the live music in the evenings. You must try their chopped fried chicken and pan de Queso."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMVdVTlhSRll3YTJoU1lVeHRaSFE1VDNJd2RFRRAB",
            "text": "Horrible!!! The place is full, you can barely walk inside of where they're playing pagode. They have a bunch of Brazilian people with the same glass of drink occupying tables (typical Brazilian to do so) I've waited hours and gave up. Left and I will never go back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWU9FOUpWa1JPTW5wSk9FOW5OekF5TTNjMlgzYxAB",
            "text": "Great night last night with sertanejo + endless caipirinhas, Yanka singer killed  it, food on point great Brazilian spirits and btw, shoutout to Gabe that bartender from Rio best energy ever with the whole crew!!"
        },
        {
            "date": "1달 전",
            "language": "nl",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQ1lrMU9UemxDTmxwR2VXNUJaV3hrYzAwNVQwRRAB",
            "text": "Braziliaans restaurant in Long Island City. Gezellige sfeer en vriendelijke bediening. Er wordt regelmatig livemuziek gespeeld. Zitplaatsen ook buiten. Het eten was heerlijk. De drankjes waren ze vergeten, die kwamen pas na het voorgerecht. De prijzen liggen behoorlijk hoog."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acmRXZHROVVZYYmxKd2FXbEVZVFZYWVVkNFpXYxAB",
            "text": "Super good Brazilian food\nFriendly staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMFEyRmhZbWxhYkVwTGVUUjRielZUZGpOdmFrRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nI had an amazing experience at this Brazilian restaurant! The atmosphere is warm and inviting, with a lively vibe that makes you feel like you’re in Brazil. The food was absolutely delicious—perfectly seasoned meats, fresh sides, and incredible flavors in every bite. The pão de queijo (cheese bread) was a standout starter, and the feijoada was rich and authentic.\n\nThe staff were friendly, attentive, and happy to explain the menu, which made the whole trip experience even better. Portions were generous and the caipirinhas were spot-on.\n\nHighly recommend this place whether you’re craving authentic Brazilian cuisine or just looking for a fun night out. I can’t wait to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaE1tUjRTRTgxVkVNM1dtdEZORGMwTXkxWk1rRRAB",
            "text": "We were staying in Long Island and called here to\nAsk for a table. They were very kind and helpful and gave us a space. When we arrived personnel was very kind and professional and service\nWas A plus. Food is amazing and very flavorful. I really liked this place and my wife too. One of thr best, if not the best Picaña i have ever tried. Thanks for a wonderful time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TU4xTlphMDA0WlVaVFdXZHZNRWhXTUhoaGRXYxAB",
            "text": "Came here for drinks and they were amazing! Must try! The waiter was friendly"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMVdVSnVNbFpIYjNSZlZqSk5TRFl4VVRsd2JVRRAB",
            "text": "Beija Flor is my new favorite spot in Queens the picanha is super tender and tastes amazing and the Brazilian empanadas and coxinhas are seriously good the vibe here is super chill and the service is always on point\nI gotta say they have the best caipirinha in New York hands down bartender Gabriel makes them perfect every time and he’s super cool and friendly makes the whole experience even better"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFFWZERiRlp5T0hwS2JrRTJiM1Y0VkMwdFFrRRAB",
            "text": "This Brazilian bar/restaurant was amazing! The food was delicious, full of authentic flavor, and the atmosphere was unforgettable. The live pagode and samba music brought so much energy, joy, and fun to the night. The staff was friendly and attentive, making the whole experience even better. A perfect spot to enjoy great music, tasty food, and the warm spirit of Brazilian culture. Highly recommend and I’ll definitely be coming back! 🎶🇧🇷🍻"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadFRERXpVMHN0VG5sSFdVNVlUWGxLUWtSa1prRRAB",
            "text": "Great food 🍲"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RM1ltVk9PVjlVTkhsZk1FNVZNSFZ6VVZwbk5rRRAB",
            "text": "I checked out Beija Flor bar and restaurant yesterday, looking for a little taste of Brazil.\nI drove all the way from Islip, Long Island to Queens for some good Brazilian food and a caipirinha.\nThey had live music playing such a great group\nBartender Gabriel made an amazing caipirinha, just like you get on the beaches in Brazil.\nThe vibe was awesome, the team super friendly, Gabriel great man and very attentive , and the picanha was delicious.\nHonestly, it felt like I was back in Brazil for a moment."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kV2QyUk1OelpmVW00ME1EUTNWSFY1ZFZWSU1YYxAB",
            "text": "Food was pretty good but the service was very slow, like beyond slow. They mention on the menu to be patient but I assumed that meant with the time it took for the food. Mind you, it’s a Sunday and the place is ~25% at capacity. We waited 30 minutes for the server to tell us she was out of Diet Coke (no big deal) and then another 30 minutes to get a different canned drink. She also got our appetizers wrong, to which we didn’t complain as it took a long time to arrive anyway. From when our order was placed, it took 1 hour and 20 minutes to make our food (picanha and a burger). The burger was cold, but otherwise good. The waitress was sweet and offered us brigadeiro at the end, we said yes. I have mixed reviews about this place because of how lacking the service is, but the food was great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocFZUQTBOWFJQUzB4TFZYWXpkRWMxZFVoUVpYYxAB",
            "text": "Nice"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMk5IY3pTRjl1YkhaVFdGcHlTRWhPVjJSeFRGRRAB",
            "text": "Great staff and food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRlEyUTFUbEJYY0ROa1ZFVmxZWEZKY0dSaFdsRRAB",
            "text": "Good food at a cool Brazilian restaurant. The interior was decorated in a vibey way, adding to the atmosphere. It was fun trying dishes I’d never had before; the feijoada was particularly tasty."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oU1ZITkJWVTFtZVdKVmQwSnlZbFV5WWpOSVVVRRAB",
            "text": "this place is amazing! brought my baiano namorado and my mom here. we had a wonderful time. getting a reservation was easy and maybe wasn’t even needed though it was busy. patio is nice and super dog friendly. inside decor is super cool. service is fast and very friendly. capirinhas were delicious and so strong for the price. food was awesome. pao de queijo always goes hard. loved the beef stroganoff the server recommended. bacalhau and feijoada was also fantastic. can’t recommend enough!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSVRrbDRVbEphVFRsdmJrczJXVlpTYTAxUVptYxAB",
            "text": "I love this place for dance, the food is amazing.\nThank you!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdVIzbG9hVXBTTXpsNWNYRldWV2MxUmxwSk1VRRAB",
            "text": "I came for lunch and had the feijoada. It tasted a bit old and clearly was a bit dated. They were nice enough to reheat it for me because the bits of meat were cold since it had not been reheated properly. I was really excited to taste this dish as I have had it before and it would have been nice for it to have been fresh. Everything was a bit salty as well. I understand that I came for the lunch special but i feel the quality of the dish was subpar. Friendly wait staff but overall food experience was poor, the dish left an unsavory tasty in my mouth and gave me a stomach ache so I will not be returning."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gc2FWOHRRMnd0WVhwaWFYcGpSRGc0Y0Y5TlQzYxAB",
            "text": "It was fun! Brazilian music and food!🎉🙌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KZlRqRkplV2xLTm5sTE9XUXpTR1pZTm5kNGVIYxAB",
            "text": "Wow! Feijoada brought me back to Rio! And Caipirinha made by Benjamin sat me back on Leblon, and Copacabana beaches! A must if in LIC!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZdFgyZHVPRk5aWTBkRU9TMUlja0p5ZUVabGFHYxAB",
            "text": "Pro tip: don’t miss the weekend live music! Be ready for some real taste of Brazil! Of course, try the caipirinha - cashew or lime! For the food, the best in my opinion are the “coxinha” and the “pastel” - for mains, the picanha.\n\nHope they add to the menu some “Dadinho de tapioca” - and maybe improve a bit the yuca fries but trust me on the live music vibe and regarding the caipirinhas, coxinhas and the pastel."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxek4xQmZWVUZyU0dSV05VSldXbUpoU1hjeU9FRRAB",
            "text": "Loved everything!!! Amazing food and super caring staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVVpqZGZNemhwZUU0d1ZuZERaemhSVkVWVlIxRRAB",
            "text": "Excellent food and great service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMS0k3LVAtbkt1T053EAE",
            "text": "Came for dinner on a Saturday night because I called ahead of time and they said they would have live Samba starting at 8 PM. I got there at 8:30 PM and they told me it would start at 10 PM. I asked for a table and they sat me at the bar bc there were not available the food was great and the bar tender Fernando was amazing. The band started playing at 10:15 PM my food had just arrived as I ordered a few apps they told me they needed to take my seat and I needed to stand and eat if I wanted to or put my food in a to go container. I didn’t want to ruin my evening só after spending $160 I packed up my own food, paid, and walked out. i explained to the person who asked me to move from the bar several times that’s this is where they sat me to have my dinner and it was extremely evident that I was in the middle of eating they did not care at all. Fernando attempted to remete the situation but I was already standing and leaving. Worst dining experience ever!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYm1zWldEX3RfZDF3RRAB",
            "text": "Super cool place, delicious food & drinks"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQejN2NTdLMUxia1VBEAE",
            "text": "Beija Flor is a hidden gem in Astoria that I honestly can’t stop recommending. Every time I come here, it feels like I’m getting a mini vacation to Brazil without leaving Queens. The picanha was cooked to perfection — super tender with that rich, buttery flavor that only real picanha has. The sausage? Full of flavor, juicy, with just the right amount of seasoning. And don’t even get me started on the cheese breads — fresh, warm, and absolutely addictive. The batida has to be the best cocktail with milk ever made! Is truly incredible I can’t stop having them!\nWhat makes it even better is the vibe — super cozy, great energy, and the staff always makes you feel at home. This isn’t just a restaurant, it’s an experience. If you’re looking for real Brazilian food done right, Beija Flor is where you need to be. Easily one of the best spots in Astoria right now. 🔥🇧🇷"
        },
        {
            "date": "4달 전",
            "language": "pt",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdmFHaFljVTFxWDFkT05YTXlXamwzYTFsMWVuYxAB",
            "text": "Experiência positiva pela proximidade do hotel que estava"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSmRFcDNUVVZ0Vkc5Sk1HVjFUbGcxTURsR2VVRRAB",
            "text": "Beija Flor – A Mixed Experience\n\nAfter reading several reviews, I decided to give Beija Flor a try. Based on previous feedback, I chose to stick with appetizers and the well-known caipirinha. I ordered the pão de queijo and a sampler of salgadinhos, which included coxinha, pastel de carne, and pastel de queijo.\n\nThe caipirinha, unfortunately, didn’t live up to the hype—underwhelming and not worth the price, in my opinion. As for the appetizers, the pastel de carne was overly salty, which took away from the experience. The pastel de queijo was better, but the standout was definitely the coxinha—perfectly sized and packed with great flavor.\n\nI skipped a second caipirinha and opted for a Brazilian beer instead—Brahma, which was a solid choice. The pão de queijo arrived last and was by far the highlight. The aroma and slightly burnt cheese crust instantly reminded me of my mother’s cooking—nostalgic and comforting.\n\nService was friendly but a bit disconnected—they never asked if I had enjoyed my food. Pricing felt steep for what was offered. For context, I went solo and spent about $63 for two drinks and two appetizers—no entrée included. That’s a lot considering I didn’t have a main.\n\nOne thing I found puzzling: the “Beija Burger” comes with American cheese, which felt totally out of place for a Brazilian menu. Especially when there’s other Brazilian restaurants that offer\nx-Brazilian burger, that are on a whole different level.\n\nOverall, my experience was mixed. While I wasn’t completely disappointed, the food and pricing didn’t fully justify the visit. The atmosphere is chill with nice outdoor seating. Parking can be tricky, but it might be worth checking out at least once—"
        },
        {
            "date": "5달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VObkV6SkNadVBpVzBBRRAB",
            "text": "Tive uma experiência excelente os drinks são incríveis o atendimento espetacular fui atendida pelo Lucas e amei tudo .. tudo maravilhoso!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKVFMzYnU4eDdfcnhRRRAB",
            "text": "Beija Flor: Where the Only Surprise is on Your Credit Card\nI came for a friend’s birthday party and ordered a drink, plate, and dessert, none of it good anyway. It seems like Beija flor can’t get anything right, especially when it comes to service.\n\nIn a group of 15 people, i was one of the first people to leave. I had paid my bill fully, some cash some card, or so I thought. A couple of days later, I noticed an unauthorized charge of an additional $50 on my card!!!\n\nI had proof of the bill and so I didn’t worry too much because mistakes happen and I was sure there would be an explanation and solution.\n\nI went to the restaurant to try to get it resolved but the manager wasn’t there so they took my information and told me the manager would get in touch with me that same day. I got no response so I decided to give them a call the next day.\n\nI ended up talking to the owner herself. I explained the situation to her and she had an unapologetic tone. She refunded me the money but gave no apologies, no explanation as to why I was being charged an extra $50.\n\nTherefore, come at your own risk. If you want to be charged for things you didn’t order, eat food that your mom can probably make better, and have drinks that leave much to be desired, come to Beija Flor"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS1NvWmItZ3U2dWlnRRAB",
            "text": "Great place!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJSG04Sm5Ea3RiNk1REAE",
            "text": "Food very expensive for what they offer.\nThe Music and atmosphere is great"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLaUtndVcwcDhHQ1RnEAE",
            "text": "Loved this restaurant! 🌹💃🏼 I have never tried authentic Brazilian cuisine & this restaurant offered me a wholesome, classy & engaging experience. We ordered the Pao de Queijo & the shrimp first, which I certainly recommend with the different wine selections available. Followed by the appetizer, I ordered the risotto shiitake with steak ~ the meat was tasteful, soft, and well-prepared for my taste. The live music, the traditional dessert options, the cozy & aesthetically pleasing atmosphere coupled with the warm client-service attention completed the perfect dining experience at Beija Flor ✨🍷 looking forward to the next dinner date here!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZXNxUFB5NTZQU0lnEAE",
            "text": "Love ittttt. Very good energy and good vibes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLMnN3dS1xcXVtTnhnRRAB",
            "text": "This spot was amazing. The food was next level. I ordered the skirt steak and mushroom risotto. I wanted to clean the sauce off the plate with my face, but I got shy about it, and instead ate a great flan.  What a meal! Great job!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLX0sxSnJtdDhQbW5BRRAB",
            "text": "First time at Beija-Flor and really enjoyed it. The food was super tasty and you can tell it’s made with care. Shoutout to our server Lucas, he was welcoming, attentive, and really elevated the whole experience. Would definitely go back"
        },
        {
            "date": "5달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLR0I5SXZwaU15dVJREAE",
            "text": "Melhor restaurante brasileiro de new York!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMFlMcndBRRAB",
            "text": "Worst steak I have ever eaten. It feels like I am eating a rubber not steak. Don’t know how they have 4.4 stars ratings. I didn’t even eat the food after having 2 bites of steak I just left the restaurant paying full price for the food. And this was a birthday lunch out with my family. Everyone felt the same because everyone’s steak was really bad. Never coming back to this restaurant a waist of more than $200 for 4 people. Then we just went to another restaurant John’s brown BBQ, 2 blocks down and enjoyed your lunch."
        },
        {
            "date": "6달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNS02SXJnRRAB",
            "text": "Comida brasileira de qualidade."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveWJtTDVnRRAB",
            "text": "Delicious restaurant and have gone back a few times! Their cheese breads are so good. Their mains are filling and reliable. We love the nights when they have live music too. It’s a pricey meal but if you’re craving it, it’s worth the experience.\n\nSome people comment about the portion sizes- it’s not the best value meal if you’re going that route. For the portion sizes it does feel a little expensive. For two people: an app, 1 drink per, and 1 main per the total was ~$130. I’d also say it’s on the saltier side (as someone who usually eats blander).\n\nWe’ve noticed this place fills up during the later hours (like after 8pm), so we’ve never had an issue getting a seat eating around 6:30/7pm weekends or weekdays. They have happy hour too!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMWUtVHlBRRAB",
            "text": "Loved the place! Vibe and atmosphere was great. They had live music playing which were amazing. Food and drinks were on point. Can’t say anything but good stuff from this place! Will definitely be back again and again!"
        },
        {
            "date": "7달 전",
            "language": "pt",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNHVHODBBRRAB",
            "text": "Comida boa, mas demora muito, muito, muito! No atendimento"
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBb1pqSV9nRRAB",
            "text": "오늘의 수프 사골맛이났어...\n\n고향생각에 눈물날뻔"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUamFuSHZRRRAB",
            "text": "Appetizer was definitely better than entrees. Skirt steak was a bit salty but tasty. Fish stew was decent. Service was okay. Casual, laidback vibe. It was okay to try once but given the service, food, and price, I wouldn’t go back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNTh1Y0J3EAE",
            "text": "I really wanted to like this place and gave it multiple chances, but unfortunately, it’s a no-go for me. The quality of the food is good, but the portion sizes are ridiculously small for the price. I’ve ordered from here three times, trying different dishes, and each time, the quantity has been disappointing.\n\nMy favorite Brazilian dish is chicken stroganoff, so I was excited to order it—only to receive the smallest portion I’ve ever seen in a takeout container. On top of that, I called ahead to ask about the soup of the day and was told it was chicken. I ordered two soups, only to receive what was basically water with a few pieces of sausage. Very confusing and frustrating.\n\nI’m not one to complain, but at this point, I can’t justify ordering from here again. If they improved their portions and communication, it could be a great spot, but as it stands, it’s just not worth it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoemM3UWZnEAE",
            "text": "We went for a big  birthday party on a Saturday, we had so much fun. Place is big, clean and exotic. Service is amazing, it was fast, always aware about our need. Food was good, cocktail are the best. Live Brazilian music did start around 9pm, band was good. Lot of space to dance, lot of good Brazilian dancers there (lot of Brazilians too🇧🇷). All ages. It's restaurant/lounge/club/social place all at the same time. I liked the diversity, amazing atmosphere and very welcoming people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6N0p1amlBRRAB",
            "text": "Really cool Brazilian place with great food and drinks. The coffee machine was down at the time but they do have one. Specials were great and they have a good happy hour. The food was decent and the drinks were very good. Service was kind of slow but we were not in a rush. There’s a very nice ambiance to the place. The goulash was great but portions are a little on the small side. I would not recommend the feijoala. Not particularly well seasoned. Should have trusted myself and ordered the picanha."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabXJHUFhREAE",
            "text": "Very low key but a very nice place! The food was amazing!  Especially traditional bread cheese balls.  Everything we have ordered was served with care and simple delicious. I am not sure how often they have it, but while we were there on Sunday,  they had live bands, and the singer"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNmRQUi1RRRAB",
            "text": "Amazing place!came once, then brought my family for a second time.  food was delicious, and server was very attentive and welcoming, came with my family, would deff recommend for a date night, brunch, or even lunch . Service was great A++ I have nothing bad to say about this restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MklEMWJnEAE",
            "text": "Stopped by around 9pm on a weeknight. The ambiance was quiet compared to other nights when they have live music, but overall beautiful and colorful inside. The staff were friendly, and spoke to us in Portuguese. It was fun ordering like that!\nThe food was absolutely delicious, nicely presented, and mouth watering. The steak I had was so juicy, tender yet the perfect bite, leaving you wanting more. Ugh, the yucca purée was also such a delicious add on. The burger and its fries were god sent. I loved my whole experience here. Everything was tasty, from the drinks to the dessert. I need to come back, hats off to the chefs. Y'all did that!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4N2RUUkdBEAE",
            "text": "Great staff! We were able to sit inside with kids even though I was a little bit skeptical about it since the place is mostly made for adults! Great music and service! Food and drinks were delicious! A must go place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bU9haWJREAE",
            "text": "I was really looking forward to dinning at Beija Flor, but I was pretty disappointed. They had a dancing class which was cool and the music was nice.\nThe chicken soup was probably the best chx soup I ever had in a restaurant and cheese bread was nice.\nThe risotto and steak were ok. The presentation was nice.\nThe worst was service where we couldn’t get a check for 20min, no one even came to clean our table or check on us. Few times we also tried to call the waitress but she didn’t even look at us or heard"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cmNlbElBEAE",
            "text": "Food was phenomenal and staff was very friendly and attentive! I forgot to take a picture of the appetizer but the Pão de queijo was amazing as well as the lentil and sausage soup. All the food was fresh and very tasty. My drink was also very good. We will definitely be coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc0lfajRRRRAB",
            "text": "I love everything about this restaurant!\nWe’re a party of 4, just flew from Vegas, and it was very late to find a restaurant for dinner. The receptionist from our hotel (Home2 Suites) recommended Baija to us, and a friend of mine who worked in Brazil for years, loved everything about Brazil. So I thought, why not try it? It turned out a really good surprise!\n\nThe food was so delicious and the atmosphere was so familiar and warm and make people happy. This restaurant makes me wanting to travel to Brazil right away.\n\nBack then we were a bit hungry, when I thought about taking some photos, we have already eaten half of the stuff. So here’s something just to give you an idea.\nBut the taste really feels like heaven, one of the best I have ever had in United States.\n\nPS: For the past two decades, I’ve travelled a lot in Europe and in United States. Next might be South America :-)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2bDdtLTN3RRAB",
            "text": "Wow! What a great place. Everything, from the appetizers to the desserts was amazing! Our server, Maria, was always super attentive and friendly. The pictures I took don't do justice to how great the dishes were. Give this place a try and you will make it one of your frequently visited places. P.S. Get the sangria! It is dangerously good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdWN6OS1RRRAB",
            "text": "Great steak 🤤🤤🤤 their cheese bread was delicious. Amazing service. My friend loved their hot sauce. I’d love to come back to try their cocktails and this shrimp appetizer. Their flan was out of this world. Their beans were a bit over salted."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLb2Z5dDNnRRAB",
            "text": "It was my first time eating at a Brazilian restaurant & having their cocktail drinks. I liked the environment & food. I would eat here again and drinks were really good. Their cheese bread are amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdk9fMzFRRRAB",
            "text": "The burger was pretty average for the price, nothing spectacular. They forgot the appetizer I ordered, but my husband’s dish was really good. We’ll give it another try."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlXzVPZE1BEAE",
            "text": "Had a good time at Beija Flor, food and drinks were delicious. Waiter was attentive and the atmosphere was nice and different. However, I do think this spot is a little pricey compare to other Brazilian food restaurants and franchise options. If you don’t care about price then this spot is for you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUeGVlY25BRRAB",
            "text": "How well they treated us, excellent service from both the waitress Yuliam and the manager, Mrs. Lucía and her son, thank you very much for the good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbzZYemdBRRAB",
            "text": "We discovered this restaurant 2 years after living in this neighborhood. We’ve been back multiple times since. The menu is slightly limited but all the options are fantastic. The live music is absolutely amazing! Would def recommend"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnekxtVFJBEAE",
            "text": "First time at this place and I loooved it. Even though I’m Brazilian, I always avoid going to Brazilian restaurants, but I was craving feijoada so bad that I decided to try this restaurant. Lucia greeted us and was very friendly and helpful, the waitress was very nice also and the food was outstanding. We are definitely coming back."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnczZUbk1BEAE",
            "text": "Beija Flor, Brazil brought to you in Astoria ”LIC” was pretty good except for a few things. The service was exceptional. Our server was polite and friendly. He also engaged in conversation making suggestions and telling us what he thought was good from the menu. The service was the best thing about the restaurant. Every order takes a long time to be brought out even if the restaurant is empty. In my case the restaurant was almost empty and still the drinks and the food took about 40 minutes to be served. The quality of the food was amazing that I would say. I cannot attest if it was Brazilian but I can certainly say that the food was exquisite. The interior design was unique and refreshing. Overall I can say that I had a good experience. Beija should really focus in bringing a very important crowd. The brunch crowd which is missing because of the lack of a brunch menu. The restaurant could benefit from having a brunch menu because almost every restaurant in LIC/Astoria have a brunch menu. The prices were not really bad but they could be better. Parking was not really a problem. There’s meter parking and the N train is a few blocks away. I would recommend this restaurant but I would also really love to see the restaurant moving in a new direction."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRME51Z3NRRRAB",
            "text": "This is one of my favorite Brazilian restaurants in NY. I love the options, the place, the food. Their drinks are fantastic too. Just make sure you have plenty of time when you go there, because food takes a while to get at your table. They have great shows during the night shift, weekends. It is totally worth a try."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMU1hUElBEAE",
            "text": "Everything about Beija Flor is fantastic, from the food to the service to the atmosphere. Whenever I want to feel like I’ve been teleported from New York to Brazil, I head to this lovely restaurant in Astoria. Their pão de queijo, picanha, and moqueca are my favorites. I highly recommend visiting on a Sunday afternoon or evening to enjoy the live band and incredible Brazilian singer."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bllQQnBBRRAB",
            "text": "Dreamy! A gem! Loved the live music and the ambiance! Made us miss Brazil. Drinks were expensive but it was a great place to groove. Pao de qiejo was yummy! Will definitely be back. Brasil pohaaa🇧🇷"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNaTRtM29nRRAB",
            "text": "My husband and I had a wonderful lunch at this new found favorite. The decor was cozy and had an awesome vibe.  Everything was absolutely mouthwatering and deliciously paired with a bottle of Malbec. Our server was attentive, helpful with the menu, and was pleasant.\n\nWe had the grilled Brazilian sausage served sizzling, toast bread, red onions vinagrette; Grilled picanhasteak served sizzling with rice, beans, roasted yucca flour and vinaigrette; Feijoada - Pork and black beans stew, collard greens, pork rind, roasted yucca flour, oranges and white rice; classic Brazilian cheese bread; and coconut cream candy with passion fruit sauce.\n\nWe will definitely be coming back to try the rest of the menu!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDZ3VHbkZBEAE",
            "text": "Outdoor dining was very cute. We were a group of 6. Food & drinks were amazing, great atmosphere with live music covering modern songs and possibly original Brazilian music. It felt like we stepped out of NY and into Brazil for a moment.…"
        }
    ],
    "reviews_count": 76
}