{
    "name": "Astoria Seafood",
    "place_id": "ChIJ-ecLnC5fwokRTsOuoOsTC6U",
    "grid": "QN1",
    "address": "37-10 33rd St, Long Island City, NY 11101, USA",
    "rating": 4.3,
    "user_ratings_total": 1639,
    "phone_number": "(718) 392-2680",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bGFXTXdPWFp0YTBGbk5scDRORmM0UlRCRlNFRRAB",
            "text": "I love the food from this place, but\nSUNDAY CLOSED…this is so ridiculous!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saVkxRnJjamR2UmpKb2RHdE9OVk00UkV0d1gwRRAB",
            "text": "I don’t eat shellfish, so I just got the sea bass. The whole fish, grilled with tons of lemon and garlic, side of garlic bread and Diet Coke came out to $31 (very reasonable). The place has a very warm family energy, the atmosphere is loud with Greek music lighting the place up. The service was incredible and attentive, make sure to bring cash for the waiters. Will come back here again."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRFJYbHpUaTF4UjBWS2EwUTVkemcwUzBGa1NHYxAB",
            "text": "Can’t beat being able to pick out your own raw seafood and getting to choose how you want it cooked! Visiting from out of town and had a feast with my family. Prices are reasonable and the food was expertly prepared. Such a fun experience!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeFNFVkxjRkZJY1RsSVUxWlliSGxMZWs5MUxWRRAB",
            "text": "Best Seafood in the City HANDS DOWN!!! A bit of a wait-time but well worth it!! Always fresh fish straight off the ice!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMFYwTnFUbk5SVTJ0eGFFMXJhMDFzV2todE0zYxAB",
            "text": "The best seafood restaurant in town!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWFNHODFNa3gzY0V0RE5UbG1OamwwUzJWclJIYxAB",
            "text": "Food was alright, a little pricey honestly. Would have gave a higher review however my friends and I were chased outside by the server begging for a tip. Come on man, you don’t do that."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Wk1qWTFjV05rTW10MFpuWlVNVXBYUzB3eFMxRRAB",
            "text": "An experience for sure. Expensive but we probably over did it."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUlRXOTNNMVJIWkdzelVYTnlaMHhqYTNwcVpFRRAB",
            "text": "So good!! First time there and it was packed, we didn’t know how the system worked but everyone helped us (cashiers & server) and was very friendly. Not sure why reviews are complaining about the atmosphere- it’s clearly packed bc it’s so good! So happy to have found this spot."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMlZrWXdlSE5IV25veGVGOWlXR3g1VlV0UFluYxAB",
            "text": "Horrible experience from a point of view. Even the food was good, acceptable, at the end after we paid and went out from the place, a waiter run after us and didn't let us go forcing us to pay tips, in a very threatening way. After we put…"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdGVsSmpkVVJQYzB4cllVZDZabTQ0Y1hKaFpXYxAB",
            "text": "Yum"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UVVWQnBjRGRyTjFaUlFsbExjRVJHTFhaU1kwRRAB",
            "text": "This place is so real with the fresh seafood quality. Pretty packed and loud place but amazing place to have seafood and hang out with friends. It could be better to organise the line and queue, but overall experience was fine. We had a lot of shrimps, different kind of fish. They all were so good!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwd1oxRnJjMDlKWWxaV1gxOHdlVFpaYVY4MWRFRRAB",
            "text": "Astoria Seafood is one of the most authentic spots in New York! You pick your seafood, they cook it perfectly, and everything tastes incredibly fresh. It’s always lively, a bit chaotic in the best way, and full of great energy. Definitely one of my favorite places to enjoy seafood!”"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdFVYWnJPR2hGTW1GR0xVdDBXRWxrZEdWb1FYYxAB",
            "text": "Been there many times over many years. One of our favorite spots, it didn't change much. Excellent hearty food, very friendly staff and decent bill."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbFpIWllNbFl5VG1JeGRuQktWRE53U0dad1ZuYxAB",
            "text": "Super long to get food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OV2FXVnRjR1pyTWtWaFoxSkVNR0l5VVROU2RuYxAB",
            "text": "Extremely horrible service. Been a long time customer but today was the last straw. Go the Ditmars!"
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkelFXOWZVMkp2ZVZObE1VeFdUblpTTTBOcFFsRRAB",
            "text": "Gutes Essen,  frischer Fisch,  drinnen leider sehr laut und hektisch, lange Wartezeit beim Warten auf einen Tisch. Trotzdem war die Bedienung immer höflich."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ab2RtWlpka0ZMVHpSSFIwY3pRV3BLWmt4WE5IYxAB",
            "text": "Incredibly fresh fish and seafood served in a unique setting.  Was a highlight of my trip - thanks to nick especially!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kS1JWOVNiR1JLUVhOcWJUQnRUekpTWlc5TVFXYxAB",
            "text": "I used to really enjoy Astoria Seafood, but something seems to have changed recently.\n\nI dined with my family last night, and sadly, the experience was disappointing. The orata fish we picked had a strong fishy smell, and the seafood overall did not taste fresh.\n\nAnd the bathroom was very very dirty 😥 that made us imagine what the kitchen is like.\n\nWe specifically asked for no spice since we were sharing with kids, but that request was not followed.\n\nThe staff seemed stressed and not very kind, the bathroom was unacceptably dirty, and the Greek salad was soggy — almost like it had been left from another table.\n\nI hope this was just an off night, but it didn’t feel like the warm and bustling Astoria Seafood I used to love. Really hope the quality and service improve again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMk1raHdOREZsTUdaTFZrTlBlR2hMYUVaclpuYxAB",
            "text": "April 26, 2025. Food was good and we paid at the counter and then sat down at a table outside to eat. We shared the meal so it was about $90 for both of us. When we got up to leave, a man chased us down the block and said he needs a tip, so I gave him a $20 bill as we didn’t have a chance to write a tip at the counter. So glad I had cash on me that day as I was going to take my folks out to a mom and pop that was cash only later that evening. Then he says no you can’t leave. I need more. I said why because that was more than 20%. He said “my friends work here too and you need to tip more”. So I gave him another $20. I tipped $40 on a $90 bill. He didn’t seem happy still and looked like he wanted more..but I told him I’m gong to continue on my way now and said “you have $40 on a $90 total bill”. He remained sour and tsk’d and left.\n\nMe, and friends from different industries have been visiting this place for birthday parties and get togethers and have never encountered this before. I usually don’t mind tipping as I wasn’t able to at the counter. I’ve never been hustled for 50%+ like that and I’ve over-accommodated for the bad behavior. I’ve frequented the establishment for years but no longer as it was appalling for my friend who was visiting from out of town to see that and I had to relay my apologies to him after."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneE5XUjFZeloyUTJ3emRIbG5VRXg1T1hoa1JVRRAB",
            "text": "Had to file a report because the cashier didn’t return my card and instantly tried to put over 5k$ on it. Place is very chaotic and the food is sub par. Very sketchy place, beware."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMVlucDNNMmxQUVVkMmRUSlZkME5JU1dFdGVFRRAB",
            "text": "The octopus was good. The rice was cold and reminded me of a slightly better version of Mexican style rice and bean bowl MRE."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUVVWUXlXVUpYWjFoVGRreHlibGhHTVhwTllsRRAB",
            "text": "Astoria Seafood is simply chaotic. When we arrived, no guidance was given about how the restaurant works. We don’t know if we should order first or get a table first. After we finally ordered, no one told us there was a line for customers to be waited for an outdoor table. We eventually waited for an hour for the food to come. The food was cold. When we decided to leave after we were done with the food, one of the servers told us to stay for a second. We told the server we were done with our food, and the server asked us how much we would like to tip and give a card to him. The food was decent, but definitely not worth the hype. The service is just horrible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TmRHb3daa1F6Y2tWSlJYWkpUVTl4TmtGcmRHYxAB",
            "text": "We waited over an hour for our food, only for it to arrive cold. What a disappointment. The place was absolute chaos, staff running around with no coordination, and clearly their system is completely broken. It’s a shame, because the food might have been decent if it had actually been served properly. But under these conditions, it’s hard to enjoy anything. Definitely not worth the wait or the stress."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taM1FtUm5RM1JZWmpOTGNEUmFUVTg0YTNOME0wRRAB",
            "text": "Not worth price and waiting. Missing items and they lost my order. Place is a mess . 90minutes waiting for food and all of it was way overcooked"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdVVsWjZTMVJmVkc5WFZFRm1aekU0Y25kdlNHYxAB",
            "text": "Seafood market turned restaurant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21od09VUm9TbU5ZTVVZM1QzbG9ibkJ0VDBwSFJHYxAB",
            "text": "The rice was hard and bland, the grill colossal shrimp had no taste and the grill squid was the same .. the lemon potatoes are okay . We ordered 18 oysters and not one of them was shucked correctly but They did taste good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paa05WY3lVM05XWkhsWFRHeGpVRmRHWkhWeVpsRRAB",
            "text": "Best taste ever"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMFJtRXlWWEpoV0ZwdGNTMUtXVVpqVVZSb2RuYxAB",
            "text": "Awesome spot right near my home. I spend way too much money here lol!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SGNIVjRaMlpPTkdFMU1sUTBjWGczYWtoRGVuYxAB",
            "text": "Traditional fresh seafood market where you pick your fish and they cook for you in 20-40 minutes or more. It’s worth the wait. Must try all the different types of shrimps GRILLED!"
        },
        {
            "date": "3달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRVYwNHdWMlUxT0Y4eFNXTlZjbFIzVVZWUlIzYxAB",
            "text": "🙏🙏🙏💐💐💐"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UGEwbGZaMkpzYWxZNFRVMVZNRWhFV2xkWGEzYxAB",
            "text": "This place is ridiculously over hyped. First of all the experience of picking your seafood and waiting in a line while a bunch of waitors shove you is not one i cared to have. Second of all after we paid we had to tell like 4 different people that they forgot items from our order and everything came out separately and took forever. The shrimp had such a horrible fishy taste that we couldn't finish it. The last straw was when the so called waitors ran after us outside about tips. We were a big party and everyone contributed to the tip but apparently people don't split the tips like they should. They came out begging my husband to tip them more. 100% will never be going there again or recommending."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSemRtaEJkbFZ2WW5OaFkxaDZWRVYxUzFaNU1uYxAB",
            "text": "The Good: Decent prices and unique ordering experience\n\nThe Ugly: Long waits. Disorganized seating arrangement. Plastic utensils.…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weU1qUlJUVlpLU25CRlRWVkdiR05oTWpSbU0zYxAB",
            "text": "One of the best places ever to enjoy seafood! Top-quality dishes, excellent prices, and a fantastic atmosphere: it truly feels like being on vacation. I’ll definitely be coming back soon. Can’t wait!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGc1lXVk1RMHhSVHkxUU4ydFdhemQ2TlRkWFZWRRAB",
            "text": "This place has the worst customer service I have ever experienced in New York City. The staff is very rude and always seems peeved to talk to you, probably because they are being overworked and don't have an efficient order tracking system. Every time I have come here, I wait at least 1.75 hours for the food to come out. They also tend to forget at least one thing I've ordered each time. It is also a situation where you pay upfront, so if you suddenly decide that you don't want to wait anymore, you would be giving up what you'd paid for. I understand that they are understaffed, but if that is the case, they need to be more open about whether or not they can seat you and give a time approximation if so."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeFJTMTViMDlKWjFjMlVtSnNPRzFrUzFCdWVFRRAB",
            "text": "I come here all the time. The food and service is always great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbGQyd3pVRVEzUkZWcGVEUkJUMkkxZGxoS1MyYxAB",
            "text": "The best seafood l have ever eaten. My friends and l visits this place as often as we can"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbWEydEJZVzV2ZUcxUFlXaE9SVmsxU2pCR1NGRRAB",
            "text": "It’s really disingenuous and crooked of the owners to put a big sign that says “your smile is voluntary just like your tips” but then having their servers chase down customers and demanding a 20% tip.\n\nThe food was awesome. But either build the tip into the prices, or make the expectations clear. Having a pick your own (sometimes live) seafood, then putting up “no tip” signs and not putting a tip line on the credit card receipts…..all these things that seem to imply that 0 tip is expected or even requested.\n\nI’m all for paying servers a living wage but this is not the way to do it. Just build it into your prices and call it a day.\n\nThis is not even touching the fact that the severs kept messing up (which they did). This goes for even when the servers are good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsZlpWZEJhbFZoTUdzMWN6SlViMDlqUTJ0S1VHYxAB",
            "text": "This place is magical a true experience with quality food. The service is great, they are kind and organized. At weekends it’s busy but the line is fast!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200Mk4xVlJUbkUzYmxaTWRGWlFWVkpQWVZNNVExRRAB",
            "text": "The rice is chewy and the Calamari are good; the grilled fish is not very good, and the processing methods of fried or grilled are not as good as other cuisine; the shop is doing a booming business, but the waiting time for the meal is too long and not worth it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWFEwNUtVRUpaV21aMGIyVlNNRkZTYjBwc1UwRRAB",
            "text": "Great place with amazing options… you choose your fish, raw, fresh and then tell them how you’d like it prepared. We got a porgy fish, shrimps and clams. The sides were delicious as well we ordered the beet salad, cheese pie, asparagus and Greek salad. The Greek salad was good up until we bit into the cucumbers. They were bitter and we had to spit them out. It was probably a bad cucumber but this was very unpleasant. Also unfortunate considering I recommend this place a lot and it was my boyfriend’s first time trying it. Anyhow, the fish was perfectly cooked and very tasty, we got everything grilled/ steamed with olive oil, lemon, garlic.\n\nThe service seemed a bit unorganized as we started getting our food but we were still waiting for our soft drinks."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OeVRsbHJYMkozVjJKS1RVMXJRbEZhZWtSeGJFRRAB",
            "text": "Omg! This place was everything!! 1st off, it’s like eating with family & there was only 2 other African Americans in the whole establishment. We drove from DC &  it was worth every toll we paid! My friends and I had shrimp, scallops, crab legs, cuddle fish(A must have, the VIP of squid), lobster, seafood cheesy potatoe, rice, corn & mussels. Everything was cooked to perfect. There was a small wait, but go get a drink from the corner, by time your back, your food will be ready! I’ll be back every 6 weeks for sure!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeFRXaDBVWEp5UXpCblJEQnRhMms1TkhSU0xVRRAB",
            "text": "I would (and do) drive 4 hours from Maryland just to get their grilled cuttlefish"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNWVIYzBOVnBzUW5KRVVFdDNlWGRyTlRjemJrRRAB",
            "text": "The system and service was poor. They serve table by table so the food was very slow. We ordered after the big table so the food took forever. The server didn't follow the food for us and have us kept waiting for an hour. All tables that came after us got the food and left. We were really disappointed because we heard the place is good but never again after this system and service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMlZuQnlNR05YYVRkSlYxaEdNMnhZUmpoNGFVRRAB",
            "text": "Pick your fresh seafood from the selections. Stand in line to place your order of food and type of cooking (grilled or fried). After your order is placed with your name then wait in line outside for a table in or out."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeFQxcE9TMDFaYTJ4Q1pXdzVkV2hQZEVKQlNWRRAB",
            "text": "Great food, excellent service, and just a brilliant night. Shout out to Vinny who made the night so much more fun! Such a lovely attitude and banter, will definitely be back!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3MUtPVG9RRRAB",
            "text": "The food is always great 👍🏼"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VVdrNXdja1UyVTJjM1JXdDNWbTQ1ZVZCRWVYYxAB",
            "text": "experience this marvel"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aelJFeG9ja2xwVjJ3MmRrbzVhMmhwYW5CUFMxRRAB",
            "text": "The seafood is the freshest, and it is a good enough reason to go here. But, the atmosphere is outrageous. Once the kitchen closes at 9pm, the chaos starts. You share tables with strangers and the frivolity is intoxicating."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYkh6b0NOaTczY1B3EAE",
            "text": "Fresh, high quality seafood without the fancy markup! The highlight? Choosing your own fish from the counter.\n\nHow it works:\n\n1. Order at the counter first (no numbers), then grab a seat inside or outside. The servers keep track of you, but…\n\n2. Stay a little alert, they do sometimes mix up orders, so if your food’s taking a while, don’t be shy to ask.\n\n3. Bread isn’t automatic, but when they bring it, it’s great (especially with their olive oil).\n\nCash tips are preferred (and appreciated)."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcV90S3ZuaW91WUpBEAE",
            "text": "Amazing food. After walking by Astoria seafood for a while, I finally decided to walk in and check it out. The food was absolutely phenomenal — cooked to perfection. This is the place if you want amazing and reasonably priced seafood/fish!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKTC05NlRlNzd5a0RREAE",
            "text": "An incredibly busy spot for fresh seafood. You go inside first, pick your seafood and then pay. Then you wait for a spot to clear up to sit down and eat (if you're staying). Otherwise, you can also get to-go, which was around a 10 mins wait for me at around 5:15PM on a busy Saturday. The grilled scallops were good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aTdXTzRnRRAB",
            "text": "If you like seafood, skipping here is a huge loss. Cannot recommend this place enough—friendly staff and truly wonderful food! We’ve been here twice now and can see ourselves coming back often. The seafood is reasonably priced and perfectly cooked. I’ve liked every single thing we’ve gotten. For sides I especially love the lemony potatoes.\n\nI will say that if possible, plan to come on a weekday. There can be long wait times for seating on weekends and the place gets very crowded. I would definitely recommend eating in, though, because you can’t beat freshly cooked seafood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MHRUdXJnRRAB",
            "text": "Fish was very fresh and delicious, the starter salad was very good as well. Was our first time here so we were a little lost and had to figure things out ourselves. So, when walking in one has to by pass the line and head to the rear and pick out your fish/seafood and put in a plastic bag. Then head to the back of the line where your first 20/30 minute wait until getting to the register where your seafood is weighed and asked how you want it cook. We chose our snapper fried and the rest grilled in garlic/olive oil. Then head outside and wait another line to be seated for another 20/30 minutes. When seated from start to finish the food takes another 20/30 minutes to come out but it comes out a plate at a time. First was the salad, then fries..followed by the fried snapper. Another few minutes the grilled shrimp and scallops. The lobster took another 20 minutes. All in all the whole experience took 2 hrs. Hence, why not the full five stars. I will say the wait is due to its popularity and large crowd. The place is not big inside as well. I will definitely come back again, the food is that good. I will, however, be prepared to wait."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURud2JfVWxRRRAB",
            "text": "Obsessed. This seafood is awesome, the quality is unreal. Everything I’ve had is delicious. The cuddle Fish, the calamari, the salmon, the shrimp and the flounder Was out of this world. On top of that the prices are absolutely phenomenal. Please try the Greek salad. It’s the best I’ve ever had and it’s enough for three people. I love the BYOB option. I will never stop coming here. Also, the service is great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbHBuaElBEAE",
            "text": "the way you order is super unlike any other place i’ve gone to but i like how you can choose basically anything you want in whatever quantity. got shrimp cheesy potatoes, broccoli rabe, and salad as appetizers and grilled scallops, salmon fillet, and lobster tail for entrees. SUPER reasonably priced as we left so full and so satisfied. the grilled scallops were so juicy 😋 however it’s super busy past 6 and we had some miscommunications with the cashiers and waiters because it was so loud.\nwill come back earlier to try the whole fish options next time!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSEd4WXJGak9uemVREAE",
            "text": "Extremely fantastic, all the seafood is super fresh and very tasty. Definitely get the oysters, grilled calamari, and garlic bread."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNE55d2hRRRAB",
            "text": "I was choosing in between 4 or 5 but 4 eventually. Still worth to visit to experience the seafood market vibes!\nSome notes:\n1️⃣Dine-in is definitely better than delivery. I don’t think their seafood products are like fresh fresh but enough. It’s cook-to-order at restaurants while they have precooked dishes which might be the reason why I didn’t think my delivery experience was good. (Food got soggy after time.)\n2️⃣Visit outside the rush hour. Restaurant was only 1/3 full when we visited at 5ish pm. And got super crowded around 6:30 pm.\n3. The way to order: You grab items u want with plastic bag at the back, line up and pay at cashier, tell your table number.\n\nGrilled seafood: Overall was delicious. They mainly used olive oil and serve you lemon and some sauce at table.\n\n✨🥗Greek salad: a classic but worth order. A lot of toppings and refreshing.\n\n💛Baklava: My little vip to finish the meal!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOTdQR0ZBEAE",
            "text": "Food was incredible!!! Restaurant was very busy even it was at around 4pm. Didn’t know what to do at the beginning but staff explained to us on how things work. Grab some clear bags, grab your own seafood like the fish market. Bring them to the counter, weight them and you can choose between fried, grilled or steamed. Pay at the counter, leave your name to the staff. Then go find a table, staff will call or come find you when your food is ready. Don’t forget to get their salad and garlic bread combo. Extremely yummy bread!! Seafood was fresh, well prepared and flavorful. Nothing was overcooked, it’s just perfect!! Staffs were friendly. We had 5 dishes with sides for two people. Total was only $71. If you want really good seafood, don’t mind having fish market ambient. Here is the place. Highly recommended!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyLTZuSWFnEAE",
            "text": "This is my second time here. Ordered the same thing. First time crab legs were better this time it was a bit burned on the edges. I had to ask for my broccoli to be heated as it was cold. You can BYOB. Great for lunch with friends.  I recommend going earlier as it would be less crowded and you can get a seat inside. Total was around $60."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbmR2NEdnEAE",
            "text": "• Bronzino 🐟 (Fried)\n• Mussles (Baked with white sauce)\n• Scallops (Grilled with butter and garlic)\n• Oyster 🦪 (Grilled) they put their own seasoning\n• Large Greek Salad\n\nMy first time going here. Thank god we went before the rush hour. After we got seated a whole bunch of people came in.\n\nYou have to go pick out the seafood items you want, then bring it to the cashier and tell them how you want it cooked. Then you can also order sides. I ordered a large greek salad. Then you wait for one of the servers to seat you. I wish I got the servers name but he gave us a table and took care of us. He's bald and blue eyes. I saw some people who was seated before us and they still didn't get some of the food while we got everything. It was weird and we got bread but after when we were almost done with the food. Better late than never lol.\n\nWe spent about $77 for all of this seafood, large salads and two drinks.\n\nThey are closed on Sunday & Monday.\nAlso you can bring your own bottle."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6eXB1V05REAE",
            "text": "If you're reading this, I hope it helps navigate the chaos of this place. There's no one to guide you, so it can be quite disorganized. If you're with a group, leave someone in line outside while the rest of you go inside, pick everything you want, and pay at the counter. Then, return outside to wait for a table where your food will eventually be brought to you.\n\nNow, onto the review. This isn't a traditional restaurant—it's a fish market that cooks your seafood, offering grilled, fried, and perhaps a few other options. You pick your seafood yourself using plastic bags they provide, and when you're ready, they weigh it and take your name.\n\nWe tried several dishes: the salad with feta cheese was excellent, the fried squid was just okay but tasted like old oil, the large shrimp were decent, and the grilled scallops were amazing. I wasn't a big fan of the octopus, but the baked clams were pretty good. The smaller clams in white sauce were okay. We also ordered a red snapper, which they forgot to bring out until we reminded them, so we ended up taking it home.\n\nA few things bothered me. Raw fish was placed near the salad bar, raising concerns about cross-contamination. One worker was cleaning lint out of his phone speaker with a toothpick right by the food, which was off-putting.\n\nWould I come back? Maybe, but it wouldn't be my first choice."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdjVTbGhRRRAB",
            "text": "It's interesting reading the reviews - I think if you stumbled on this place on a busy weekend, sure, you're going to be confused and annoyed. But if you're aware where you're going then it's fun, unique and awesome!!\n\nFood is great, prices are reasonable given amount you get, the seating is all over but there's sort of an organized chaos, I'd recommend avoiding weekend evenings, and coming if you're in a rush - it's a great experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREZ05mcmlnRRAB",
            "text": "Amazing restaurant, easily one of my favorite places to eat! The service and hospitality were great from when we first entered the restaurant to when we left. Staff is attentive and very friendly. It was never hard to get ahold of an employee.\n\nThe food was incredibly fresh and deliciously prepared. You get to pick from a large variety of seafood right in the store, weigh it, and then choose how you would want it prepared - fried, grilled, sauces (white or red). I LOVED all the seafood ordered to the table - fried stripped bass, fried calamari, grilled shrimp, and grilled scallops. Everything was cooked perfectly. For example, the calamari had just the right amount of breading. There’s also so many sides to pick. We chose lemon potatoes, which were my favorite side and the right amount of tarty from the lemons, roasted potatoes, greek salad, and roasted corn.\n\nThe place is BYOB!! Definitely bring drinks for an even better time. Restaurant only does walk ins and could get very busy for dinners and weekends, but so worth the wait. You can also buy the seafood fresh and cook it at home, which is awesome! Not the fanciest of restaurants but the vibes are amazing nonetheless. Also, complementary bread!! Great food, service, vibes, and BYOB what more could you ask for!"
        },
        {
            "date": "1년 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkbU1HOGNBEAE",
            "text": "真的很好吃又新鮮，而且價格實惠，服務很貼心全面，讓我心干情願開心的付小費。\n-------------------------\n點餐方式與順序:\n-先到櫃台前拿塑膠袋\n-拿著塑膠袋到後面去選食材跟魚。對，完全沒有人會理你，自己拿自己抓，也沒有夾子\n-到櫃台排隊先結帳，然後跟他們說要怎麼煮，然後他會在帳單上寫你的名字\n-如果人很多沒有位子的話，先到外面等他們叫名字入座"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabWZEc29nRRAB",
            "text": "This place is a good experience.  You pick out the seafood you want and they'll prepare it how you want.  The choices are fried, grilled or steamed.  There are sides to choose from and complimentary Garlic Bread and there are also some prepared foods.  It's B.Y.O.B. but they do have sodas and bottled water.  The young man taking the orders was very helpful.  We were celebrating my mom's birthday and he put a complimentary piece of Baklava with our order.  There were 3 of us and one of us ordered a Salad and he made sure that it was enough for three.  The place is comfortable with outdoor seating also available.  My grilled Porgy was amazing.  I tried a piece of the Fried Calamari and it was a bit tough.  My mom enjoyed the fried Trout and our friend enjoyed her fried Porgy.  The Salad was good.  The prices are amazing.  It's worth the trip to Astoria to try it out at least once."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibXR6WUN3EAE",
            "text": "Best Seafood in all of the burrows of NYC hands down. I take clients, visiting family and friends.\n\nWalk in only you grab you fish in a plastic bag from the many fresh options there. Wait in line and tell them how you want it cooked, pay and sit. A waiter will come, tip them after.\n\nFresh, delicious and authentic this place is old school there are huge friendly neighborhood vibes here. Best Calamari in the world."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeXVITUtREAE",
            "text": "Nice seafood restaurant I recommend going on days other than the weekend. The food is really fresh and delicious. This is my second experience in this place. Finally, if you go when the place is busy, you will not get good service."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMDhqZlFBEAE",
            "text": "I had a great experience with the food.  I lucked out with the service as well.  This could have easily been a favorite spot EXCEPT for 2 things—you don’t get an itemized bill or any bill for that matter.   They add and calculate manually—really?…I still CANNOT understand why on different visits I paid close to the same price as I did for way less expensive items than other times. Also if you are with a group it’s hard to keep  track of your orders.  If they are more transparent with my money and consistent with their service  then this would have been a 5 star on a no frills hidden gem."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtM0k3SHZnRRAB",
            "text": "Great authentic experience. If you like fancy settings or pretentious food, this is definitely not for you! Everything is super fresh and i did not wait at all for my food (i went 6 pm on a Thursday). Indoor seating is limited ( about 6-8) tables, but they have great outdoor seating as well (preferable if you don't like loud music and neon lights). Outdoor seating area is not well heated nor insulated though, so you have to keep your jacket on in the winter.\nWe got a 1 lb branzino, 1.5 lb snapper, 0.8 lb mussels, 0.5 lbs calamari with seafood rice for 50 dollars (good amount of food for 2).\nTips for a better experience:\n1-Bring CASH for tipping, please.\n2-Big fish take longer to cook, you can either avoid ordering it, have it butterflied for less cook time, or order salads and appetizers so you're busy for 30-45 min.\n3- They have grilled octopus, must order at the counter.\n\nWill definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiZ0xLSFBnEAE",
            "text": "A must-visit for seafood lovers. The experience is unique: you select your seafood from the fresh market display, and the staff cooks it to perfection. You can also bring your own alcohol, which adds to the appeal. The food is an absolute 10/10 🤤. However, be prepared for a bit of a wait, as the service can be slow, especially during peak hours. If you’re not in a hurry, the delicious meal is well worth it. I gave the food five stars but only three stars for service due to the delays. Overall, it’s a fantastic spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M1ozZ0xBEAE",
            "text": "Not a fancy place but the price and the food is good. Food is freshly made, You pick your own seafood choices in plastic bags and at the counter tell them how you’d like to be made.\nThe food is really good. We had branzino , grilled octopus, grilled calamaris and shrimps. Greek salad and garlic bread.\nThe store is a bit messy but outdoor seating is ok.\nThere was no wait time, everything was made pretty quickly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwek1xUmNnEAE",
            "text": "It was so amazing that you got to choose which seafood you want to get while it’s very fresh and ready to get cooked. You get to choose which one do you want to make (grilled, steamed, fried…). I would recommend bring your own drinks beforehand coming into here. All seafood were delicious, and fresh. Would like to come back again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXOXZYbHVRRRAB",
            "text": "If I can give them 10 stars I would!\nI’ve had Astoria Seafood bookmarked for the longest longest time and finally came here for lunch. I’m glad I listened to the reviews and came here for lunch when they opened. As soon as we received our order, the line was out the door.\nNot only was the food delicious and fresh, the workers there were SUPER friendly. They made sure we received our orders, brought out the complimentary(?) garlic bread, and you can tell they love and value their customers.\nThe prices are reasonable considering how fresh the food is and how they cook it to the way you like it- whether it is grilled, fried, boiled, steamed, etc.\nWe chose fried calamari (highly recommend!!!!!), scallops, lobster tail, branzino, grilled octopus, baked clams, and salmon. I really recommend coming here. I’m already thinking about my next trek here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNHBUTllREAE",
            "text": "WOW! Came highly recommended and I get why. This isn't a fancy spot, so come prepared to 'fight' your way to your seafood selections and then be ready to stand by and snatch a table while you wait for your food to be prepared! LOVE IT! The workers were all so lovely and fun, making sure you are enjoying your food and your time there. Kareem was our waiter and he made my bday special!! Such a community feeling of all types of people and oh, it's BYOB and they have ice buckets for bottles that need to stay cold. For 2 people, we ate for $50!!!\n**get the calamari, sea bass and the Greek salad**"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMHJtNWxBRRAB",
            "text": "Food is excellent it's a bit chaotic but be patient the food is worth it. go straight to the back pick out your food and let them weigh it. Tell them how you want it grilled or fried. Definitely get grilled 😋 Get salad and potatoes delicious! They're a byob walk with plenty of booze!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQb196WEFnEAE",
            "text": "Food was good, but not great for the price. They force 20% (cash) tip for the table when leaving. They counted them right away and asked “is this really 20%?”\nNever seen something like this.\n(Fyi: It’s not that type of restaurant; you pick up your fish first and bring them to the casher and pay for the food there. You’re not even getting water or sth on your table.)\nNot really sure if 20% forced tip can be justified when we don’t really get any “service”.. There’s no designated server nor anyone cared about our table lol"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdXJEal9nRRAB",
            "text": "This place was so much fun! We entered and immediately were hit with a large crowd of friendly locals having a blast. Very loud but very fun. We got to select exactly how much and what we wanted from a wide selection of seafood. Then, when we were sat, it was busy enough that the only section available was not heated (go early!) but our waiter immediately switched us inside when a table was available. Our waiter (Mr. Vinny) was so polite and was very fun to talk to, especially with suggesting what other local places to try. The food tasted AMAZING and is so worth it. Highly recommend for people traveling who want to see a local restaurant the tourists don’t really know about. Very authentic experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbk5MN0N3EAE",
            "text": "Worst experience! The resto is super noisy, chaotic and unorganized. My order got messed up and I ended up waiting for an hour to get the food. Would literally walk out if I hadn’t already paid upfront. I went to similar seafood in Astoria and they are at least more organized.\n\nWon’t recommend for those who prefer a peaceful and professional dining experience"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaC1fcldREAE",
            "text": "Really enjoyed the greek style seafood. It felt incredibly fresh. And the staff was super friendly and accommodating. Crab stuffed clams we're the best, fried mackerel were great, and grilled red snapper was melt in your mouth tender.\n\nHole in the wall atmosphere. Only downside was a lot of the food felt a bit too greasy, but that might just be my preference issue/what we ordered, definitely great unique taste and worth a try at least once or twice."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZLW9MdGVBEAE",
            "text": "This place is different in a good way!\n\nYou pick out the seafood you want. There are loads of options. We chose the swordfish and snapper. You pay by the pound. Then you get to tell them how you want it cooked.\n\nThe swordfish was our favorite. The fresh Greek salad is a must I would say.\n\nIt’s a daily loud/busy spot with all of the seafood coming in and out. So keep that in mind.\n\nDefinitely on the casual side. But overall it’s a great meal for what you pay for. Nothing like freshly cooked seafood in Astoria! Places like this make Astoria a great place to live!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbjVIRFJ3EAE",
            "text": "Delicious! I was nervous because the reviews are a bit mixed, especially when it comes to cleanliness. I will admit it’s not the tidiest place, but the food is SO FRESH and SO GOOD, so who cares. This place reminded us of being in a fresh fish market in Essouria. The service is friendly and attentive despite how slammed they are. We had scallops, octopus, the fish, and some veggies. Everything was great, especially the octopus. I can’t wait to be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYb3VubWdnRRAB",
            "text": "This is my new favorite sea food spot. Why go fishing when they have it already caught. It is a pick your own fish, bring it to the counter to cook place. Sea Bass is in season so I went with that. Someone say fresh calamari! Gotta have it.\nShrimp...grilled? Yes please. Bae wanted a lobster tail so bae gets what she wants. Add a greek salad to the meal and we are set. We brought it all to the counter. Everything grilled...to perfection I might add, except the calamari which was fried.\nSeating inside was crowded but it is what it is. Place is very busy which proves it is the right place to be in Astoria for seafood.\nI would even come back for lunch and have some grilled shrimp and fried calamari."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeHRIZTlBRRAB",
            "text": "This place is a \"RIP-OFF\" place. BE VERY CAREFUL EVERYONE! I purchased 1 octopus, broccoli rabe (old smell and ending up have to throw it away), salad, and 12 jumbo shrimps. I only got 6 shrimps when I dine in. When I confronted the waitress. She said to me I have to go talk to the cook. I AM A CUSTOMER, WHY DO I HAVE TO CONFRONT THE COOK??? At the end, I got my 12 shrimps. The food is not good as it sounds. Shrimps were over cooked! I asked for no feta cheese on my salad, there were feta cheese on it and there were fish scales in my salad. The place is dirty. They don't sweep the floors, trash can were full. Also, it took them 1hr and half for them to bring my food! I don't think I would go back there again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtZ2RqMjZ3RRAB",
            "text": "This was such a cool experience - you pick out your fish by hand and bring it to the counter and tell them to cook it however you want. They also have a bunch of sides that you can choose from, and everything was absolutely delicious! The waitstaff were also very nice and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNONHNiTUJ3EAE",
            "text": "Astoria Seafood is definitely one of the more unorthodox restaurants I’ve dined in before but in the best possible ways. This was my second time here and I was still as confused as my first time with their unique system/order of operations. We came here on a Friday night around 8 and the place was packed but do not let a full house fool you as you may still order your food and wait for a table. To order, or better yet, to eat here. Go in and walk straight to the back, grab plastic bags and pick out whatever seafood it is that you are craving or seeking to try. The beauty of it is that you can pick as much or as little as you please. Once you have your desired seafood, bring it to the counter where they’ll weigh and price it before adding any additional items like sides or drinks to the order and then pay the bill. Then you wait for a table to clear and once you’ve ordered and paid, the staff will get you a table. It’s not like your usual restaurants but it works. The food here is fantastic. We started with the Greek salad alongside a complimentary side of garlic bread which might’ve been the softest bread I’ve ever had. Both were great but the seafood was even better. We got our calamari deep fried with the rest cooked with garlic butter. Ask for tartar sauce and lemons, you won’t regret it! The calamari was fried perfectly, light on breading. We also got clams, shrimp, scallops, and two octopus legs all grilled. All were cooked perfectly and paired with lemon and salt, it’s honestly some of the best your money can get you. Service was superb, super attentive staff who ensured we got our seats before anyone who came in after us. You can’t beat that. We spent around 70 dollars total which is quite good considering both the quality of the food and service. Highly recommend!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbE5MX19BRRAB",
            "text": "This place is a staple of the neighborhood. It's an authentic and chaotic experience in a great way. It feels like it's always so lively and it's a unique feeling. There are lots of options of different types of fresh seafood and ways to prep the food. Everything was delicious and relatively affordable compared to other seafood spots. Amazing experience!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5a2Nta1JBEAE",
            "text": "One word, chaotic! Went on a Friday afternoon and it was busy, servers were going back and forth trying to get the orders out correctly. Some people were attended to right away and received their beverages/salad in the beginning. We had to keep checking and asking the waiters for what we ordered. Overall the fried calamari was the best, never received any marinara sauce. Fried shrimp were okay, and the bake clams still had some sand on them. We dined outside because the noise inside the restaurant was madness. I guess if you don’t mind that atmosphere, then this is the place for you."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnX3Vld2pnRRAB",
            "text": "Great experience.  Had fun in picking your own seafood to have the store cook the food.  I would go back again.\nFor the first timer, you need to pick up your seafood, pay for it and decide on how you like to be prepared (Mostly grill or deep fry).  Then ask the waiters for  a table stating you paid and the name when you pay.  If you are looking for a regular restaurant service and fast serving, you need to go somewhere else."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjLTRMNk9BEAE",
            "text": "This was definitely a first for me. A fish market that's also a restaurant? You can buy the fish to take home and cook or eat there. But that's not even it.. take home or eat in, the price for the fish is purely market price. We ordered probably 7 or 8 large seafood and side dishes and the cost came out to about $120 for both us..\n\nHow it works: You go in, grab a few plastic baggies from the counter and pick your own seafood. Wait in line and pay for it at the register and tell them how you want it cooked. If you're into grilled octopus, make sure you order that at the register too. For side dishes, make sure you order the greek salad (the best I've ever had, it's super fresh) and the lemon potatoes. After you pay, they'll assign you a table if you decide to eat in.\n\nThey don't serve alcohol here but it is BYOB. So if you're feeling fancy, bring a bottle and some cups to enjoy the evening!\n\nThis place has a very homey neighborhood vibe. It's not in any way fancy and can get quite loud. But aren't those always the great hidden gems? I visited back in January and cannot wait to go back after this quarantine is over..\n\nOH! and one IMPORTANT thing.. Since they sell their fish at market price, the servers are basically working off of tips. So please don't forget the lovely servers! leave a cash tip at the end of your meal!"
        }
    ],
    "reviews_count": 89
}