{
    "name": "Kakes NYC",
    "place_id": "ChIJ3ymk_i1ZwokRCmOt8q7NUqw",
    "grid": "QN1",
    "address": "10-43 44th Dr, Long Island City, NY 11101, USA",
    "rating": 4.7,
    "user_ratings_total": 725,
    "phone_number": "(870) 525-3769",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMGEycHVOMkZsZG05WGRVb3daa1ZZVTJ4NmRrRRAB",
            "text": "Cake and other treats were amazing"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ST1JFUm5VVjlDZVVObVMzVmxaemR4VkhWb2MwRRAB",
            "text": "good food great vibes will definitely go again"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdFIxQnVWVUpZZW5vdFFrVmtkbWM1Vm05bWNrRRAB",
            "text": "Great cakes"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTE5GVjNVMVJUUVc1T09EVlNaRGRzWnpoSFNsRRAB",
            "text": "Nice vibe to chill eat and smoke."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMmQzTmlZbk4zVFRsMUxXWkVha0ZQUTJGcVYwRRAB",
            "text": "Loud music that carries a block away past midnight shows a lack of consideration for the neighborhood. Businesses in LIC should respect their community and maintain reasonable noise levels so everyone can rest peacefully."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdlZEbEZTWFp2UWtsSFRrcFFla3hsV25ocE1YYxAB",
            "text": "Very nice experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeWIxZHFXbEU0VG5RM04wWTJXSGgxTkd3MVIyYxAB",
            "text": "Kakes NYC delivers beyond expectations. Straightforward dishes with clear flavors appeal to me. Their kitchen delivers reliably. The staff performed wonderfully as well. I enthusiastically recommend this place!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMmFHczVXbGRLVTJwM2IwMXRla0ZDWmtnNGNsRRAB",
            "text": "I had an incredible time at Kakes! Juju, my server, was incredibly friendly and provided exceptional service. The entire staff was phenomenal. The food was delicious, and the chefs were incredibly fast. I’m definitely going here again!\nThey provide rolling and ashtrays and allow you to partake in and outdoors as well ;)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVVJETk9aMkZIYURaVldGVTJibTVEVXpOalVuYxAB",
            "text": "My Favorite place and not because I got Engaged here on My Birthday lol it's the because the food & drinks truly never misses. I come for Birthdays Anniversary  just cuz Dates & will continue going its just that dope here. Mama's Kakes Empanadas and the Wings must be added to every meal every trip because they are just that delicious!! Okayyy\nThe Sangria and sunset haze are my favorites. The vibe is always there soon as u walk in. Every Dish on this Menu is Amazing & The Kakes staff treats you like family this spot is a 10 outta 10. YOU SHOULD BE BOOKING YOUR EXPERIENCE RIGHT NOW ACTUALLY!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeU9HRmpUWE4yTXpCdU9YRjVkMk5vY1dJeGFGRRAB",
            "text": "This place was definitely a vibe! The ambiance was fun, chill, and welcoming…perfect for a night out with friends or a low-key date.\n\nAs for the food, it was just okay! I went with a simple hamburger and truffle fries (non-infused), and honestly, they were pretty average. Nothing bad, but nothing memorable either.\n\nWe did try the infused sangria, and while it tasted refreshing, it didn’t give the effect I was expecting. Now, the infused brownie slice….That was the real MVP. Delicious and powerful…let’s just say I was floating on cloud nine afterward! I only had a small fraction of the brownie.\n\nOverall, come for the vibes and the edibles, but don’t expect to be wowed by the regular food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdmNrdEdiV3hFUTBoUWQwVlJYeTFXVWs1YVpXYxAB",
            "text": "Girlfriend's birthday celebration we had a blast"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKYVFVbDRkalp6WmxkRFp6bHZOMDVLWjJWM1drRRAB",
            "text": "Took my boyfriend here for a Father’s Day event everything was excellent 10/10 food was amazing Drinks was good atmosphere was great & I love the interaction with the host"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWd0w3YUd3EAE",
            "text": "Had an Amazing nite was 🔥..Puff Smoke Sip with Karaoke ... Birthday vibez.."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VVJtOHlXV2g0VXpOSWEzVkJNVmt6YzFreGRXYxAB",
            "text": "I came to Kakes on 12/6/25 and they're supposed to open at 4pm but they don't and I waited for more than 10 minutes for them to open and they never did and I had to leave."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVFVWbFJYMlEyZDNCRlZIRjFUMk54UlhkMFIyYxAB",
            "text": "I went to KAKES for a birthday celebration and we had AMAZING service from Kevin. They were short staffed that day Kevin was the bartender but stepped in and took care of us. Even with him being the only one on the floor we still got a complete tour of the restaurant, he reviewed the menu fully with us and even found a way to accommodate us for the outside seating. This man answered every question, gave suggestions, promoted the new restaurant that was opening, and made our time there so much fun. Now, I’ve been to Kakes plenty of time but I NEVER received the customer service that Kevin provided. Someone over at KAKES give Kevin a promotion and raise he ABSOLUTELY deserves it!!!!!!!!!! #I’mjustthebartender!!!! A time was had that day thanks to Kev!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPanY0dGVfX09IejlRRRAB",
            "text": "It was a really great experience, We will be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VObUNxUDJtLWI3ZndnRRAB",
            "text": "Awesome vibe, good food and great service! Will be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYndwWnZ2bS0zWG1RRRAB",
            "text": "I went there for my birthday and I had a blast. Im a born and raised NY from Long Island, I had an amazing time. The vibe, food,music and owner made the night. The owner/MC combined with the well oiled machine called Kakes was an amazing experience. Thank you so much!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXZISTB3RRAB",
            "text": "I went here for my birthday and let me tell you it was one of the best experiences I’ve had at a restaurant!!! My server was Kiyon and he was very attentive informing us on menu items as well as suggesting some things we might like making us feel really welcomed and tended to !!! Very down to earth atmosphere everyone was friendly.. almost felt as if you were home relaxing with yur joint in hand and eating all while being catered too… Food was A1 drinks were A1 I went home and had the best sleep I’ve had in a while…Please keep doing what yall doing!!!! 💖"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaHBtMXVnRRAB",
            "text": "I would give 10 stars if I could! I became a member at the beginning of the year and they make every visit a special one 💕"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOTV1b1ZBEAE",
            "text": "HIGHLY RECOMMENDED VIBE HAVEN!\nFrom the moment I made the reservation to the last bite of infused deliciousness—KAKES NYC understood the assignment.\n\nLet’s talk service:\nEvery single staff member, from the check-in crew to the back-of-house boys, the DJ with the vibes, the servers with the smiles, the bouncers who lowkey double as hype men—everyone was attentive, friendly, and made you feel like you belonged there. It was giving hospitality meets homie energy, and I was absolutely here for it.\n\nPuff and Paint with a sing-along was Great Vibes. We laughed, we sang, we puffed, we painted—pure magic.\n\nNow let’s get into the menu—because baby, the options are plentiful. Whether you're there for finger foods, appetizers, full-on entrees, or sweet treats—infused or non-infused—they got you. Same goes for the drinks.\n\nCherry on top? You can BYOS (Bring Your Own Supplies). Perfect for birthdays, 4/20 celebrations (like mine!), or a random day just because you can. Entry is $25 for a day pass, which is already a steal, but if you're a local cannabis connoisseur—get the membership. (Certainly on my bucketlist)\n\nBathrooms? Spotless. Aesthetics? Chef's kiss. Outdoor seating? A literal dreamscape. I went at night and it was stunning—can only imagine how beautiful it is during the day. Indoor vibes are equally on point, from the decor to the food presentation. And yes—selfie moments are absolutely everywhere, from the front entrance to your seat. Content creators, take note!\n\nThis is not a one-and-done. This is a “run it back,” “tell your friends,” and “maybe even get a membership” kind of place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJX1lqOVlnEAE",
            "text": "Food was amazingggg ! Drinks were amazing !! Only thing I can say they could improve is the music . It was too loud to have any real or long conversations with the group I was with, kind of like a bar type loud but besides that really good place ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJXzZ6YnRBRRAB",
            "text": "I have come to this location a few times and always leave satisfied with my selection and feeling of elevation. The music is always good and employees make sure sense informed and enjoy the experience. Employees like Josh, Kevin, and Kiyon who go above and beyond to make sure everything is situated and comfortable for my party and others as well."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbklQMG53RRAB",
            "text": "I really enjoyed coming in and getting a tour of the facility it was all good and I really enjoyed our waitress, she was attentive at first. I went to guy in the back that sells his product and it was all of quality. The atmosphere was really good and I really enjoyed the music it was almost perfect honestly… then the issues came. When they started getting a little busy they weren’t as attentive and I waiting with my gf for a while for our food in between courses especially for the dessert. We had a pre-fixed menu and it was all delicious don’t get me wrong but it’s hard to enjoy your food because the tables outdoors are so low you have to break your back to eat your food on a table. I just felt like I paid almost $500 for a whole experience that didn’t feel like $500 it’s a good environment for those who are 420 friendly but definitely needs a long way to go before I would say I would spend that much money there again. If it was cheaper I would say it was 5 stars but for the value of the service does not equate to the value that I’ve spent. I had to call the manager over several times because we were waiting so long to get our entree and even longer to just ORDER our dessert."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbnNQWUh3EAE",
            "text": "I definitely will be back!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaWYtSkZBEAE",
            "text": "Add one more server & one more person in the kitchen for brunch & will be amazing.."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbmVuZkd3EAE",
            "text": "Me and my besty came to Kakes what an awesome infused place to come eat good food and dessert infused drinks . Our helper tonight was so welcoming especially knowing we were from Florida ! Thank you Kiyon for being great to us !"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndk5IV1VBEAE",
            "text": "The food was great. The music was so loud we had to yell to talk with each other. Also, my waiter and the hostess were openly arguing while bringing in plates, which was a bit awkward. Still, we had a fun time overall"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM0lEMVRREAE",
            "text": "Incredible place top teir"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOF9HVHZBRRAB",
            "text": "Never go there!!!! $25 to get in, so it was $50 for my date and I.  $40 joints, cool.  I normally pay $100 for an ounce....they wouldn't give me a light if I didn't pay $5 and it had to be upfront.  I'm not a big weed smoker, but could u imagine going to a cigar lounge that charges u to cut and light your stogie?"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOThHYUt3EAE",
            "text": "I had a great time celebrating my brothers bday. Kakes NYC staff was informative and engaging. My infused rib was soooo good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeFBHTHdBRRAB",
            "text": "Great Food, Vibes, Decor and Customer Service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdU5HS1lREAE",
            "text": "Ambiance was excellent. Service was informative, friendly and swift. Playlist was amazing! Food was also great. Had a great time. Highly recommend. They check id and make u sign a waiver for entry, which i 100% understand. They also have infused and non infused options also. No alcohol, only infused beverages. Go and enjoy and have a time !"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNzlxVjJ3RRAB",
            "text": "I have nothing but great things to say about this establishment. Everyone is very nice , knowledgeable, and attentive.  The food was incredible. Although we purchased infused  entrees , I appreciated the fact that the flavor of the food wasn’t lost. Our waiter Josh was vibrant and welcoming . Definitely coming back !"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcXZ1SWlnRRAB",
            "text": "Best Place I only go to from Connecticut so it's definitely worth the drive"
        },
        {
            "date": "10달 전",
            "language": "el",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcXVmd2dBRRAB",
            "text": "OG Kakes Margarita🥰🥰🥰"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NjVEY213RRAB",
            "text": "10/10 great food/ staff &\nVibes super pricey but worth the experience fr"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQcHRyT1RnEAE",
            "text": "Beautiful interior. Great vast menu. Their drinks and food are delish. The waiters and management give great service. I came here for the painting event was a bit disappointed. The colors we were given were random, it started one hour late for some while others got their items on time so my friend was disappointed that she couldn’t partake in the contest. They played old school r&b I do not like it what so ever but the crowd did so the MC is great and receptive to the crowd."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzemRYaE5REAE",
            "text": "Food was OK....had the shortrib. Good flavor, bit overcooked. Kitchen and bar was slow but friendly. Cool amatuer hiphop showcase featuring Papoose"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcE9YSC1BRRAB",
            "text": "It's definitely a vibe with good food and drinks"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYM3N1MDNRRRAB",
            "text": "Unique experience, great vibe, great service, great food, great weed, need more of these in america. I dont like alcohol and dont drink so I dont go to bars which makes it a little more complicated finding social venues. More of these around would be perfect for stoners everywhere"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzODRXQkZBEAE",
            "text": "Great experience... Awesome service.  I'll be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdS1tVkpBEAE",
            "text": "Went to Kakes for the first time 10/20 as a close out celebration to Libraries season. Thank you Lisa for suggesting this spot! The atmosphere is definitely a vibe, the DJ keepa the hits going, and the food is amazing!\nKiyon was my server and he was attentive and knowledgeable, our drinks and food came out fast! I had the shrimp po-boy w/ truffle fries. The sandwich was EVERYTHING! Wish the fries were crinkle cut (they're shoe string). Overall 8.5/10. I'll definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaTdTZGNBEAE",
            "text": "Amazing spot to smoke, eat and have a good vibe, thank you for the kind service yall provide anytime I come! 🙏🏽💜…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYM3A2cG9RRRAB",
            "text": "our waiter kevin was amazing fr‼️ super inviting and listened to us nicely. one of the only waiters i’ve seen that looks like he likes to be there rofl :D"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbnR6OGRREAE",
            "text": "This is the best place for food, and GREAT times!\nNelson takes care of you.\nIf you love the California sober way this is your place!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbE1XU2lRRRAB",
            "text": "Run the other way. Me and my wife got food poisoning from this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuLWJTenh3RRAB",
            "text": "Everything was amazing the food the atmosphere and the staff made it feel like home I truly appreciate everything Kiyon you & Josh did ya thing 🙏🏾💜🙏🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOUxuTXl3RRAB",
            "text": "The food was so delicious I forgot it was infused lol the mac & cheese with a short rib wow wow wow 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudExTSFZnEAE",
            "text": "This place is an experience!  Food DJ on point. Put this on your bucket list. I totally would recommend this place. I can just chill all day there. ❤️.\nThanks guys"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOXVxQWR3EAE",
            "text": "Always a dope experience! I came here for dinner & then brunch 2 weeks later! The Beauty & the Beast mocktail packs a punch & one of my favorites. The French toast for brunch was divine. The calamari & burger for dinner is delicious! Highly recommended to come here for good vibes, food, & to have a great time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMEtQNUVREAE",
            "text": "The ambiance was impeccable. The atmosphere was so warm & welcoming. Nelson was especially attentive. He ensured we received quality service. Leiry was thorough and efficient with tending to us. Genuinely enjoyed my time. I had non-infused food and my companion had infused food. We enjoyed!!!! Definitely going back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cGItaGNBEAE",
            "text": "My beautiful daughter decided she wanted to take her parents to celebrate her dad's birthday, parents' anniversary and my birthday. I am not going to write too much of a review because I only have one word: magical!. Decorations were amazing with their logo on all print art on the wall. Let's talk about the food, the kitchen is the star. Everything we had, drinks non-alcoholic ,starters, main course, and dessert all infused. Left the location just laughing, what better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaa3M3bUx3EAE",
            "text": "Went to Kakes on a Saturday night for my best friend's birthday and let me tell you, this place was definitely a vibe! The food was amazing, I mean everything we tried (lobster rolls are a MUST have)! The taste, the display, the fast service; it was awesome! Their drinks were super tasty too. The effects will creep up on you, so tread lightly... will most definitely be going back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcUt2V1RnEAE",
            "text": "✅Vibes ✅✅service, Kiyon our server was very helpful in giving me gluten free options on the menu. He was paitent at with me by the end of my delicious infused meal. The staff was great too! When our water was low it was filled, plates finished, they were cleared. Oh and the 🌲was fire!! 100% RECOMEND!!  Coming back for some of their events for sure! ❤️🙏🏼"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeE5mSmFBEAE",
            "text": "This place was ICONIC! The food was all so so soooo good! You need to get the Brunch Burger and the French toast with brown sugar caramelized bananas! Also the Beauty and a Beast drink is a MUST! So much fun we need more places like this!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1OTVIZkxnEAE",
            "text": "I was out done! The food was great. The atmosphere was easy going. The options were just what we needed. Retractable roofing for that indoor outdoor feel. They have non infused options"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3aC0zVkpREAE",
            "text": "10/10 !  The service from the second you step up to the entrance door is impeccable. The staff is friendly, efficient and heads always on a swivel to see what every table needs.\n\nThe food ?? 20/10. I had the jerk chicken my date had the pineapple chicken fried rice.\n\nMy jerk chicken tasted incredible. Chicken fell off the bone. Jerk sauce was out of this world. Coco rice and peas !? DIVINE.\n\nThe drinks were out of this world. Well crafted and executed. The appetizers and desserts were incredible. Decadent, and fantastic sized portions. We had plenty left over to take home.\n\nNow the experience was next to nothing. As a smoker I have always wanted to enjoy an establishment where I don’t  have to have alcohol and where I can enjoy a good smoke and music. The owner has taken time, and I mean years put into this. It shows. Every thing is so meticulously planned and thought out. The menu, the ambiance the design.\n\nI’m ready to go back tomorrow already 🤣"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaZ09faWpnRRAB",
            "text": "Went here to celebrate my son 21st and when I say we got the best service, it was fantastic!  The manager took care of everything. You can get everything infused or not. All that i ate was delicious.  The drinks are non alcohol but can be infused and they were. If you want you can bring your own but they also have it if you need it.  I hope they can open up shop in the DMV."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0LXBLQkpREAE",
            "text": "What an amazing experience with Alanis. I had one of the most memorable birthdays. Very fun and relaxed atmosphere. I got to enjoy 3 of my favorite things food music and cannabis. I'm definitely coming back again and can't wait for the next opening and future openings. Come to Connecticut please lol.😉"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMXYtYU93EAE",
            "text": "My boyfriend took me here for Valentine's Day/ birthday and I had a great time. My waitress was juju and she was real cute and gave good recommendations. The inside is giving lounge vibes it was a dope set up. You can smoke inside and they walk around selling weed and pre rolls. The beef short rib was fire and a must have . It was so tender and rich in flavor. I really enjoyed it. Definitely recommended coming for a date night or even chill vibes."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNHZHMlNREAE",
            "text": "I visited on 4/20, and while the staff was fantastic and attentive despite the 25-30 minute delay on reservations, the overall experience was disappointing. The level of infusion in the food and drinks did not justify the price, leaving me feeling sober and underwhelmed. For those with higher tolerances, it’s not worth it, and there are no accommodations for this.\n\nThe atmosphere was confusing; while everyone was clearly high, the presence of a hype man and the overall vibe seemed more suited for an alcohol-based event rather than a chill, relaxed environment. It would be great to either adjust the ambiance or consider introducing alcohol to better match the energy of the crowd."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbXFyZEJREAE",
            "text": "First time and it was amazing!! It's pricey but it's definitely worth the experience and vibes. Music was fire!! Atmosphere was very friendly and chill. All the staff members were attentive and very nice and educating 💯 You have to put this place on your bucket list and bring friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGOTQtMTJ3RRAB",
            "text": "I initially came here for hubby and our friends. I don't partake in any herbal essences, so I had no intention upon trying anything, however, Kayla (server) put my mind at ease and explained that they can control the level of intensity.\n\nI asked for the lightest drink I could get and it was perfect. None of my food was infused, but I did try hubby's truffle fries. They were good. Their wings and short rib mac were great apps to try.\n\nWe went on a very quiet night and I definitely want to go back and try the again, preferable on a weekend night. The music was amazing and the decor is very chill. I'm sure it's lit when it's busy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidklTT1RBEAE",
            "text": "Celebrated my birthday here. !\nGreat atmosphere with a nice vibe.\nOur server Kiyon kept us well fed and hydrated.\nGreat experience.\nWill definitely come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaEpla2pnRRAB",
            "text": "Went for my birthday brunch and it was a great atmosphere from the beginning… AMAZING food and drinks for an amazing deal! If you’re a cannabis connoisseur you would love this place and if you’re not they have a non infused option. Brunch options were an 55 or 65 which included a drink a cheese biscuit  And an entree…the 65 included a cookie.. honestly the best bang for your buck!!! Our waiter kiyon was attentive and service was fast!!! I def must come back again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwektfdVh3EAE",
            "text": "Went for my birthday and I absolutely loved it. The vibe was great and the food was bussin! I almost forgot my leftovers and they even called me to remind me. My only downside was that there wasn’t really an assigned barista so the wait for drinks was kinda long but 10/10 would recommend and I WILL be back again for that mac and cheese!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtaWR6TjVBRRAB",
            "text": "Starting off with Nelson was the best way to start off. So charming and personable. The food was absolutely top notch! Bone slid right out of the short rib. Super relaxed great environment. Everyone was so friendly and the drinks were a delight!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKejQyMUV3EAE",
            "text": "Kakes NY recently became one of my favorite canna-friendly spots in NY! My homegirl and I were visiting NY from the DC area and weren't planning a trip to Kakes, but glad we could pull up. We were greeted by the manager Nelson, who explained in great detail how everything worked. Nelson was super attentive, took great pics of me and my homie, and continued to check on us throughout our time. The website also explains everything in detail, so reading thoroughly beforehand is good. I love that you can bring your flower to enjoy, the food and drinks can be infused or not, and they have a beautiful display of goodies and dope merch. The overall vibe of the staff and the guests was welcoming, just as you would expect for a spot like this. The bartender is SUPER talented. Non-alcoholic drinks can be infused, and the drink I ordered did what I needed it to do. There are vegan-friendly food options for us plant-based eaters, and the service was proper. It was a great first-time experience with dope vibes, and I look forward to pulling up again soon so I can enjoy the garden seating area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0M0oydkxBEAE",
            "text": "I appreciate leiry’s service so much she was so very attentive to detail and just making sure we had everything we needed . The food was absolutely amazing I wasn’t dissatisfied anywhere . The music was a vibe I’m def satisfied with my experience and with what I paid overall . Definitely coming back ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOFppYzBnRRAB",
            "text": "Food and drink tasted amazing and I was feeling gooood. They sell pre-rolls+cigars+eighths there and they are FAT so good for sharing. There is a $25 additional day pass fee if you are not a member. They don't put mg on the menu, but I was told appetizers/drinks were 5-10 and entrees 15-20 (if I remember correctly). Music was vibey and everyone was so nice. My only complaint was the seating, even tho it was very comfy the tables are an awkward height to eat at."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMWNfb1ZREAE",
            "text": "Came in to celebrate my mom’s birthday and the service was excellent! Kiyon was very professional and alway a vibe. The food and drinks were both beautiful and delicious, it was a great way to spend a Sunday brunch. My mom literally can’t wait to come back 😊😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkeFBIWEJnEAE",
            "text": "Went to Kakes NYC for my birthday and I had a great experience. Food was A1, had a nice buzz from the gas they provided the infused watermelon lemonade was fire. Not to mention our waitress for the night Juju was BAD!!!!😍"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMGIyZ3VnRRAB",
            "text": "This dog-friendly weed café and lounge is an excellent addition to the LIC neighborhood. I really loved the interior design (very modern and tasteful) and was given a little tour of the new space by the owner, Rico, who was awesome with really positive vibes. They serves cakes, coffee (only during the day though - tried getting a latte around 7 but couldn’t get one 😕), food, and weed-infused mocktails and there’s an outdoor space out back with a retractable roof covering with a small stage where they plan on holding events. I had the Dragon Kake Mojito mocktail which tasted pretty good and had a decent and not overwhelming buzz. Admission from now through the end of June is free but was told that from July going forward it will be $25 for a day pass or $150 for annual membership just to get in. I think the day pass is a bit pricey but the annual membership makes sense if you live in the neighborhood or just plan on visiting somewhat frequently.\nI’m looking forward to sipping on mocktails in the backyard while watching a comedy show in the near future!\nWelcome to the neighborhood Kakes! 🥳🍹🎂💨"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNUl2eFNBEAE",
            "text": "I took my boyfriend here for his birthday. We had the whole place to ourselves. Reservations highly recommended. From the minute we arrived all the way till we left we were treated with superb customer service. From security to our waitress and especially the bartender Kevin, he was amazing. He made me and my boyfriends experience worthwhile. The food beyond 10/10. Everything we tried was delicious. The DRINKS!!!!! Whew Chile. Highly recommend the Beauty and the Beast. You won't regret it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMXYtUEZ3EAE",
            "text": "Came here with my girlfriend for our anniversary and had a great experience.  The staff was super attentive and made us feel a priority.  Special recognition to Josh & Mariah for their top notch service.  As members of Kakes we left knowing our money was well spent and will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOWVUd3RBRRAB",
            "text": "Excellent experience!! Will definitely be coming back and purchasing a couple memberships. I recommend to all TRUE tree lovers and the easy going folk. Be prepared to spend$$ I promise it's worth every penny"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteXJfNjVRRRAB",
            "text": "This place is awesome! The staff is really attentive and super friendly. Prices are crazy. They also have their own blunt roller table set guy there, which I thought was cool. The food was ok. I had the short rib, which one of the most expensive items on the menu and not going to lie. It was a little disappointing. It just had no flavor whatso ever. I ate most of it but wish they had put some kind of sauce on this dish because it really had no flavor to it. My partners dish on the other hand was really good. It was like a rice kimchi. Which was packed with flavor but super disappointed on the short rib 🙁"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlOXJ6UzhBRRAB",
            "text": "I loved it from start to finish. The owner came to greet us and seat us which I thought was beautiful. Explained many things in such a relaxed manner. Not too fast, not too much but everything u needed to know. He was such a treat. Then the server was just very patient and sweet and I really appreciated that because it was completely new to me. Thennnn the food comes right out as if they knew I was starving or something. I’ve never experienced such fast service at a restaurant. The food wasn’t bad I just wish they fried the wings a lil harder but the star of the night was the empanadas! My goodness they were fantastic! Must have. And the gem of the place is there is NO ALCOHOL! So you can rest assure you will have a super dope night and finally a place to eat and smoke and drink freely without feeling pressured on alcohol.  The place does not smell like smoke either. Which is amazing. Overall pricey but it’s a vibe and lots of love and kindness there which I gotta say should not be overlooked! Would return!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSb0pxd0h3EAE",
            "text": "The food was excellent, service was good, and the vibe was early 2000's R&B! The shrimp po boy was delicious, the cheese dip with the pretzel was so creamy, the empanadas were small but home made and delicious. The drinks were strong and being able to smoke up during dinner was the best! We had a blast and definitely plan another trip back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbWNtdzlBRRAB",
            "text": "Drove up from Baltimore with my girl to eat at Kakes. Customer service has been on a decline at a number of places, but this was not the case with Kakes. It’s a welcoming atmosphere as soon as you meet with the doorman. The owner greets you personally and gives you all of the info you need about the restaurant, menu, and what you can expect. Our waiter was great, and the food was phenomenal. There was never a point where we weren’t attended to and provided some of the best customer service in my recent memory.\n\nThe food didn’t have a heavy “weed” taste common with a lot of edibles. The high experience was great. I would definitely recommend and plan to come back in the future, especially any time I’m in New York."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtX056bFJREAE",
            "text": "BEWARE: we went there last night and The food was pricey but AMAZING! Be careful because although they say there's only a few grams in the food depending on your tolerance it could be too much. It's been 20 hours and I still haven't come down from the effects. Highly recommend to those with a higher tolerance. I loved the food but next time I won't get it infused never want to feel like this again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbVltMWF3EAE",
            "text": "I’m going back.  I loved everything about KAKES! This is a must have experience. The owner greets you as you come in. He is beyond friendly.  He diligently explains all the ins and outs.  It’s clean. The vibe is there! The music hits!  The…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cF9EVVRnEAE",
            "text": "Nice environment and Good vibes. A place to go for a night out with close ones. The food was delicious and fulfilling. Looking forward to trying other options on the menu. If we lived close by we would have definitely got the membership!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdDZEcXF3RRAB",
            "text": "I was beyond happy with my experience here at Kakes. The food, environment and staff were all amazing. Our waiter Vix was super helpful as well as Carlos! The owners were even on the floor making sure everything was running smoothly. This is definitely a spot you want to come to feel good, eat good and have a great time overall. Great for parties, dates or even a solo meal! I’m for sure getting a membership."
        }
    ],
    "reviews_count": 85
}