{
    "name": "VITE vinosteria",
    "place_id": "ChIJu_ZPCDlfwokRNS7856uUxDk",
    "grid": "QN1",
    "address": "31-05 34th St, Astoria, NY 11106, USA",
    "rating": 4.6,
    "user_ratings_total": 735,
    "phone_number": "(718) 278-8483",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RGRWUklVbmN4YjFScGIxSTJabVJyZEZBdGJXYxAB",
            "text": "One of the best places to eat pasta in the tri-state area…\nWith excellent service, staff, and atmosphere.\nI highly recommend the dirty martini…\nAnd their limoncello digestive.\nDiego is an excellent server."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMVl6SkxWVkZmUjFWQ1pucElUMVJoZUROa1ZrRRAB",
            "text": "The best Italian food in Astoria,\nTwo thumbs up.\nDiego the best server."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSE5IQklkbUp2VW1zeWNFRkZZelJEYW5GU1RVRRAB",
            "text": "My food came, and I realized I had no fork. I grabbed one from a table nearby, as no waiter was around. The owner came charging from across the room, and instead of apologizing for the poor service, yelled at me for taking the fork. Regardless, the food was mediocre: we had the garlic shrimp, which was rather flavorless, and the lamb shank, which was tough. All in all, a disappointing meal."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxclQyVnNaWEJwVDNwa2IzSklPRkZNWjBGZmQyYxAB",
            "text": "We went here for my sister’s birthday, and we all loved it!  Not only was the food delicious the service and hospitality was EXCELLENT!  We had the arancini, panzanella salad, & the Insalata dello Chef and all were delicious!  I have to say the panzanella salad topped with burrata was one of the best panzanella salad’s I ever had! For entrees we had the linguini with clams, pappardelle bolognese, and rigatoni alla Norma and all were delicious!  The portions were very generous too!  The rigatoni alla norma could have used some more eggplant, but the eggplant it did have tasted excellent!  For desserts we ordered two flourless chocolate cakes and one Nutella tiramisu.  The desserts were very good too!  In general I don’t like tiramisu, but the tiramisu here was delicious!  The coffee flavor wasn’t over powering, and mascarpone was light and creamy.  I highly recommend Vita Vinosteria in Astoria!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOa1JrZFNjSGxyVHpKUldrTmlibWR2YURWeFVtYxAB",
            "text": "Delicious food, lovely vibe and good customer service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxT01XRTRRV1ZqWDFKeVNqTnRVVXBhVVhkYWJrRRAB",
            "text": "Amazing Italian food! Rosalia (bartender) was so friendly and attentive at all times!! Tried their tartufata pizza and their cavatelli and it was mad good. Doe was delicious and cheese they used for their pizza was so good I would highly recommend!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbFdVVkRhRkptZFhNek56a3pVMmhWY0Y5RFkzYxAB",
            "text": "Post wedding family dinner. Incredibly accomodating for a group of 15 and everyone adored the outstanding food and drink. Wonderful ambiance and staff as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNFRTMVhiR3MyUm1VM1ZIWXpkRUpWYVRNNU1FRRAB",
            "text": "The food and staff were excellent. Cozy place with a great vibe. We had a large group so we had to wait 10 minutes for a table."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeU5EQXlSMWhMUkd4WmQzVklSVFJ4WVd4ZlJFRRAB",
            "text": "Such a great spot for brunch/ dinner, has a great ambiance and fantastic cuisine. The steak was spectacular and the pancakes were phenomenal. The salad we got was very tasty and the service was great. Would definitely come back, I can’t recommend this spot enough"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyc3U2V0lREAE",
            "text": "Okay so… if want authentic Italian with an Italian host who makes you feel at home and like part of the famiglia, Vite is the place. Chef Rizzo is a genius. Took my Sicilian aunt here and she loved it. Pino and her talked like old friends from the old country. Authentic Italian dishes with that Old Country feel in the heart of Astoria!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSc2JtMXVTMlp4WTJRMmNFUnVjekZoVDBaaVJuYxAB",
            "text": "Wanted to like this place. Came here with my wife for her birthday since it had strong reviews and seemed promising. We were seated outside, but the waiter never told us about the daily specials. I later saw him walking around with the specials board for other guests, which was disappointing.\n\nThe food itself was decent. My wife had the seafood pasta and enjoyed it. I ordered a pizza, which was just okay — the crust was thicker than expected, and the cheese was overly salty. Some ground pepper would have balanced it out nicely, but the only thing on the table was chili oil, and our waiter never came by to check on us or offer anything.\n\nOverall, the service was lacking, which really took away from the experience. With better attention to detail, this could have been a great spot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa1NWTkxVa3hPTURkWGVUTTNXVXBwVG1vdFQyYxAB",
            "text": "Very very good food. My favorite was the bolognese pasta and the truffle pasta/pizza. Our server was also very nice and knowledgeable about the menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZd1gyMUhibVo2V21aNlVWTktVM0V0Y0RGbUxYYxAB",
            "text": "Slow, uncomfortable slanted outdoor seating, food was unremarkable"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsa2RYazNhM2xpT0dJeVZFNVlZbTVPWm5GYVgxRRAB",
            "text": "I cannot empathize enough how fresh, authentic and delicious the food is here.  Also, you will be so pleasantly surprised by the quick and very kind service!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMFFrVnJUV1kwZEhrMldHRkROekp3TVRkUE0yYxAB",
            "text": "Me sentí como en casa.\nExtraño Italia y este lugar me hizo sentir hogareño.🎉"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobFZuTlRXazgxUzFwdVprTlBkalI0ZFV3NVJIYxAB",
            "text": "Great service! Wait staff was incredibly friendly and attentive to our needs.\nOur table (interior against the windows) was too small to accomodate our modest spread of drinks and entrees. The waiter tried to reposition our food and drink like he was playing a tedious game of tetris. Again the service was outstanding. Most of the tables appeared to be full sized so steer clear of the windows. Sadly I must ding their mussels in marinara... The portion was HUGE, there must have been 50+, however they were fishy and I could smell them as soon as they were placed at the table. Tasted very strong and off.  I mustered through eating maybe 8 of the them and only two were palatable. We didnt say anything, asked to take them to go and we tossed them after we left (Dont ask.. I know.. We're awkward). Our entrees, saved the day. A delicious linguini w/ Bolognese and also a ravioli pasta stuffed with a lemon ricotta. Our drinks were also to taste and served quickly. All in all I would absolutely come back, but I will not order the mussels again."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psb2QwdE1RMkpLV0Y5VVlXbE5RMlZ5VW01VE1tYxAB",
            "text": "El lugar es muy bonito y la comida es muy rica, el servicio deja mucho que desear, no tienen conocimiento en atención al cliente o protocolo, adicional confundieron a mi sobrino con una niña y lo hicieron pasar un mal rato, y entre meseros no están coordinados, falta mejorar ese aspecto que es muy importante ya que son los que están de cara al cliente."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMVEwSnBZbE5NZWt0clUySkNZbkJxTWw5UWNHYxAB",
            "text": "Ask for new silverware and server attempted to place the silverware on raw table no lil plate to place it on.  Straight raw table. Food came out very late . 1 hour after I order.  Not an authentic Italian spot"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjNVpsQmtUSHB0U25SdmIwTXdUalZhY201RFgyYxAB",
            "text": "Pedimos la tabla de quesos y charcuterie que estuvo exquisita. Mauricio nos brindó una atención excelente y acogedora. El lugar es muy tranquilo y aceptan mascotas en el espacio que tienen afuera.\nVolveremos a probar el menú de brunch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wa2R6ZFlMVU53VldjMlZHcExVbkJMWXpsRFZGRRAB",
            "text": "BUYER BE AWARE! PRICE SCAM\nYesterday, my wife and I had dinner at Vite. We have been going there for years. We really enjoyed the food and the ambience. We ordered the Skirt steak special with mashed potatoes, that was listed on the specials chalkboard for $38.95. We actually discussed the price of the steak out loud to decide what to order. The steak was small, even for $38.95. The main \"surprise\" came later, when we received the bill. We were charged $45.95 for the small steak! When we alerted the waiter of the discrepancy, they basically were deceptive and gaslighted us.  They showed us the specials chalkboard with fresh chalk showing the price to be $45.95.  I've never seen a meal price change mid-meal!  This was quite frustrating.  It's more the deception than the $7!\nPLEASE BE CAREFUL AND CHECK THEIR PRICES, especially for the Specials!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ZldVcFJSemd4ZDNoSlVXTjZOVmc1ZEU5M1NtYxAB",
            "text": "I've been looking to come to try this resto for like a month and it didn't disappoint. From the beginning to the last moment the service was incredible. The food was delicious also. We order the chicken  and the stuffed pasta and every bite was glorious, the perfect balance in all the ingredients; I think the stuffed pasta should have more or at least one small side with it or maybe take it as and appetizer instead of as a entre as I think is a little bit small to be an entre. I am very happy with the food and experience in general and looking forward to come back and try other dishes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTVpHZEdWVzA0TnpSd1ZtMDJWVGd6TjBaZk0zYxAB",
            "text": "Had the eggs benedict for brunch and it was amazing ! I want to come back and try more 🙂"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SlowOVNaeTFoTm1sU1VIZzBXbGM0WjBSQ05VRRAB",
            "text": "10/10. Really great service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWlpWSlJlVmRYVnkwM05IRTBjVEpXV0hOaUxYYxAB",
            "text": "Amazing and authentic Italian experience. All the pasta dishes are really good !!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cWRVSjBaMXBCVWsxWGR6RlJSemhPUzJZeWFHYxAB",
            "text": "Good restaurant but it’s overpriced"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWE9VOWlUWEJqVlRFME4xSlRMVk5SVm1GbVgwRRAB",
            "text": "The food here was decent. However, I was disappointed by the misleading happy hour signs posted outside. They advertised some happy hour specials on the board at the outdoor seating area. But I was told I had to move inside to the bar to actually get them. That detail wasn’t mentioned anywhere on the signs. It felt like a bit of a bait-and-switch, and honestly took away from the overall experience. Just be more transparent with the specials and where they apply, and it would’ve made a big difference. I asked can I order the happy hour at the bar and drink it outside at my table and I was told no. Not a great business practice for customers who come to spend money to enjoy eating outside but cannot reap the benefit of the happy hour specials."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNZmJtZldRMFpfZy13RRAB",
            "text": "Very disappointing experience. We placed orders at 7, at 7:45 our server apologized for the delay and said it would be another 10 minutes for our food. At 8, we moved inside because it had gotten cold outside, and asked about the status of our food - our server apologized again and asked if we wanted more wine.\n\nFinally our food came at 8:15, and they brought me the wrong dish. I’m vegetarian, they brought a beef dish and at first claimed that’s what I’d ordered while I argued there’s no way I would ever order this. So we waited another 5 minutes - my boyfriend graciously waited with a full plate of food in front of him even though he was famished. Finally my order came - it was good but a small portion, and I was still hungry at the end.\n\nThe table next to us also experienced the ridiculous delay and eventually asked for their food to go - the manager came out to apologize to them, and we overheard that some of their bill got comped. Meanwhile, though we waited 80 minutes for our meals, and the server kept offering wine alongside his apologies, none of the bill was comped. We spent $150+ on this bad experience…$38 of that was on 2 glasses of wine we would not have ordered had it not been for the wait and the Implication they were being comped. We won’t be returning here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMWERqT092X3V6c1BREAE",
            "text": "Incredible food, service, and vibe!! The Insalata dello Chef is always so fresh and good and the Linguine alle Vongole is insanely deep and satisfying. It’s a bit pricey for Astoria, but definitely one of our favorites."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMT0g5S3kydWQ2TlpREAE",
            "text": "Absolutely amazing experience at Vite. Even though I’m vegan, Mauricio went above and beyond to make sure I had options and felt completely taken care of. He was kind, patient, and genuinely interested in making our meal special. It’s rare to find someone so accommodating and warm he made the experience feel personal and memorable. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa2IzYndBRRAB",
            "text": "Vite Vinosteria is my favorite place in the neighborhood! Good vibe! Cool people! Great service and of course amazing food 🤩 Salute to Pino and Carmelo"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcnUtNDRRRRAB",
            "text": "Great authentic Italian cuisine and feels like a family run restaurant."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJLVpmZUxREAE",
            "text": "Loved the appetizers we had chorizo and mussels in a spicy tomato sauce delicious we also had prosciutto and arugula pizza it was light and delicious"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNThfUGhRRRAB",
            "text": "After a while, I returned to this restaurant; I believe it had been 5 years since I last ate here. The first time was love at first sight—the food was fantastic.\n\nI noticed that the menu had changed, which makes sense as everything evolves. I was delighted to find that their pizza was as delicious as I remembered. Five stars for the pizza—it was amazing! However, the other dishes were not what I expected.\n\nThe service was impeccable; they were attentive and took care of everything with kindness. The atmosphere was cozy and friendly, allowing you to disconnect from the outside world and enjoy a good meal.\n\nLet’s start with the salad: Burrata e panzanella. The burrata was really good, but the salad itself was too sour. The mix of cucumber, red onions, tomatoes, and the dressing was okay, but the burrata didn’t work for me on that particular combination. I give it 3 stars.\n\nNext was the Melanzane alla Parmigiana. It was exquisite! Five stars!\n\nAs for the Pollo Marinato, the chicken itself was good, but the arugula was too sour and plain. You really need to order a side of potatoes, spinach, or beans. The price didn’t match the dish, which is my only complaint. I give it 3 stars.\n\nThe Linguine alle Vongole was good: 3.5 stars.\n\nWe decided to try some desserts. I was curious about the Nutella Tiramisu; it was okay, but my favorite was the Tortino all Cioccolato, which was good. I give it 4.5 stars.\n\nI may return to enjoy the pizza, Tortino al Cioccolato, and Melanzane alla Parmigiana."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRZ3ZYekp3EAE",
            "text": "Great food, service and atmosphere"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbkpXVUFnEAE",
            "text": "Little piece of heaven and I loved the wines by the glass!! Beautiful restaurant in a quiet neighborhood. Romantic and unique with friendly staff."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncDl5Z1Z3EAE",
            "text": "Pizza is 5/5 . Would definitely have it again ."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnM3FLUGhRRRAB",
            "text": "Be careful with food allergies here because they just might serve you what you should not eat.... Otherwise, it is a decent place...."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbnUzdTNRRRAB",
            "text": "The seafood are great and fresh, I am looking forward to try other options. Great service and fair prices, I would highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMF8yX3BnRRAB",
            "text": "I really didn’t want to write a bad review, but after the experience I had, I feel like it’s justified.Owner is racist. Over priced food.It was so uncomfortable, and honestly, I’ve never been treated so poorly before. They clearly had no interest in being helpful or polite, and I felt judged the entire time. By the end, they even gave me a fake smile and sarcastically told me to \"have a nice day\" after treating us like we didn’t matter at all."
        },
        {
            "date": "10달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaV9MZm1nRRAB",
            "text": "Super consigliato , Maurizio e Santiago ci han messo subito a nostro agio e ci hanno aiutato molto con l’italiano … La pasta poi buona buona … consigliatissimo"
        },
        {
            "date": "10달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcGJEOXRnRRAB",
            "text": "È stata una serata molto bella con buon cibo e vino"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMGRLbU9BEAE",
            "text": "This is my second visit here, and the food didn’t disappoint at all. The restaurant has a vintage vibe and is super cozy. Our server, Bruno, was extremely sweet and provided very friendly service. Come here for the mussels—they are amazing!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MTVxVEpnEAE",
            "text": "Comida deliciosa, muy buena variedad de aperitivos, vinos y cocteles. Servicio amable, el lugar muy limpio y organizado."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OU5PMlJ3EAE",
            "text": "What a fantastic Italian dining experience! VITE vinosteria serves up absolutely delicious cuisine that transports you straight to Italy. The pizzas are a standout – with dough so perfect it's practically an art form. The burrata appetizer was incredibly creamy and flavorful, and the gnocchi was simply outstanding.\n\nThis intimate restaurant is ideal for date nights or smaller groups looking for nice dining experience. Whether you're a pizza lover, pasta enthusiast, or just looking for a memorable meal, VITE vinosteria delivers on all fronts."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNk1Yd0tBEAE",
            "text": "This was my 3rd time here and I won’t be back. There was a mistake with the wine we ordered (they charged us for a more expensive bottle when we ordered the cheaper one) and the owner didn’t try to make it right. Besides that, the food has gone way downhill. The pastas are bland and we’ve never had luck with the specials. There are much better spots in Astoria."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQOGVucUx3EAE",
            "text": "Thank you to Pino and the team for helping me with a DELICIOUS last minute catering order for friends who recently lost their mother. Food is comforting and the meal from Vite Vinosteria was the perfect accompaniment for their Sunday family gathering."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcjc2WmJnEAE",
            "text": "Staff, food, service was great. Double Tito’s was 32 dollars though"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXa2ZXbEdREAE",
            "text": "5 stars aren't enough. The only thing better than the fantastic service is the incredible food. Delicious, interesting and beyond fresh."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcmV5YS1RRRAB",
            "text": "Just had a surprise birthday party at Vite and I can't say enough good things about the food and the service. Carmelo was a great host, he kept checking in on us to make sure we were happy and well fed. The severs were great, quick and courteous. The food was so delicious, from the bacala appetizer to the focaccia to the main courses and everything in between. The salmon was delicious but the chicken, that was outstanding!!!!. Our guests truly enjoyed the food and the drinks, I just had a beer but they seemed to really enjoyed the cocktails. By the end of the meal we were all stuffed and very happy.  We all thought the price was very reasonable especially for the quality and quantity of food we had. Thank you guys for a great meal, can't wait to come back"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRa01qem9BRRAB",
            "text": "Very nice place with good pizza. It's a little cosy, so just something to bear in mind if you're going on a busy night, but a great atmosphere with a good selection of food and drinks."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzOWV6dEp3EAE",
            "text": "All the sea food are awesome, and the chocolate cake dessert is a must try!\nSolid chocolate without any flour, quite cool.\n\nStaff were friendly and attentive. The only things that might not be that good is the space quite tight, but overall was pretty good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaE1mRjd3RRAB",
            "text": "I came here with my family to celebrate my mother's birthday, and the staff was very friendly and accommodating. We sat outside with our dog and they even brought her a water bowl which I thought was sweet. The food was delicious and portions were generous. I was also able to bring my own cake and the staff lit a candle and sang to my mother. I really appreciated that the staff was so attentive and kind. It was an overall lovely experience and I definitely recommend this spot for both casual and special occasions."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbS02X1p3EAE",
            "text": "Hands down my favorite restaurant in Astoria… actually NYC! The owners were trained in fine dining and have taken that experience and attention to quality to create a relaxed local neighborhood restaurant with phenomenal food and attentive service. This is a comfortable spot to take a date, group of friends or just yourself to sit up at the bar with the many regulars. You can’t go wrong with any of the items on their frequently changing specials board, which if your lucky include at least one of my three favorites… the Berkshire pork chop, smoked duck or porchetta dish. Frequent enough and it feels like family, even getting yelled at by Pino for trying to order a cappuccino in the evening!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdkl6NklBEAE",
            "text": "A few weeks ago, I had dinner at this nice place. The food here is absolutely delicious! Every dish we tried was full of flavor and cooked to perfection. I recommend the grilled octopus and the fies with a drink and burrata cheese to start. Be sure to try the daily specials. This time, it was Duck, and believe me, each bite was a wonderful sensation of flavors.\n\nThe service was impeccable from start to finish. The staff is friendly, attentive and goes out of their way to ensure a memorable dining experience. Congratulations to the whole team! Thank you very much, Santiago, for your attention.\n\nThe atmosphere is cozy, and the soft lighting and elegant decoration create the perfect place for any occasion.\n\nI'm already looking forward to my next visit. I highly recommend it!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MjltRFZBEAE",
            "text": "❤️ Overview:\nCame here with my friend for a late lunch, early dinner…linner…hahaha we sat outside since the weather was nice! The pasta dishes we got were super yummy. If I remember correctly, they said they updated the menu! Yes, the prices are little pricey for Italian, but they give you such a big portion of pasta to make up for that!\n\n❤️What was ordered:\nFOOD: Agnolotti with ricotta and lemon and Cavatelli di Grano Integrale\n\nDRINKS: elderflower gimlet with gin\n\n❤️Stand outs:\nAgnolotti with ricotta and lemon and the cavatelli di grano integrale\n\n❤️Would I come back/recommend:\nYes - I would come back\nYes - I would recommend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdGQ2M0ZBEAE",
            "text": "Nice location..lively area..parking is not so hard (Sunday).\nThe restaurant was nice and cozy/romantic not amazing but above average. Clean and welcoming. Staff is wonderful and friendly and the service too.\nFood we ordered was delicious but a little pricier than normal. It tasted really good. We had cocktails which was Uuuugghhhhh!\nSkip the cocktails.\nOverall a pleasant experience. We had two dishes 28.95 and 31.95 and two cocktails 14.95 each + gratuity =$115.00 (pricey for two people)\n..no sides were served just bread.\n\nMy average dinner bill would be around 70$."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbGFTMXJnRRAB",
            "text": "Dinner and wine was phenomenal!! Salmon was cooked perfectly and was delicious. The pizza is amazing. Service was great and so was the wine recommendations. Will absolutely return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N1BhTnV3RRAB",
            "text": "We came to VITE vinosteria  for my daughter-in-law's birthday and it did not disappoint. Everybody treated us like royalty and the food was absolutely spectacular! The flavors were spot on and the dishes looked beautiful.  I'd like to clear this restaurant and neighborhood gem!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNOFlQSUpnEAE",
            "text": "Really nice and cozy Italian place. If you go there you would understand why they don’t take reservations. The food was amazing. They have some good Italian and german beers on the menu with a great wine selection. They have a full bar with…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2N2ZLX2VnEAE",
            "text": "This place is a great Italian spot in Astoria!\n\nOur group enjoyed a variety of the food-steak,salmon, pasta, salad, and more! We would recommend it all here as each item came out delish!\n\nService was great\n\nIt has a great outdoor ambiance\n\nDefinitely grab a dinner here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5b2RURVdREAE",
            "text": "Overall Food was really delicious! I really enjoyed with my parents in laws.\nStaffs are friendly.\nI was very surprised that I found nice Italian restaurant in my neighbor! I will definitely come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MTlHOFBnEAE",
            "text": "Visited VITE for first time celebrating anniversary with my husband. Pino is an amazing host and the food here proves it! The Pulpo was hands down the best I’ve ever had in NYC, The Smoked Duck was to die for, and the Branzino over Brussels sprouts was absolutely amazing. If you have not been to Vite yet I strongly advise dining here. This will definitely be a new “go to” for me and my husband going forward! Happy Dining!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaHFlSDR3RRAB",
            "text": "This place was delicious! Highly recommend. From their basic bread for the table and dipping oil, to the cocktails and the pasta *chef’s kiss* can’t wait to go back again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdElucjFRRRAB",
            "text": "Wow yes. Please go here. Boyfriend and I were looking for a neighborhood Italian place in Astoria and decided on Vite. It was so delicious and the ambiance was perfect. Went here on a Wednesday night - no wait. The Mussels special!!!!!!!!!! Must get must get. So good. We will be back for those. Huge portion for the mussels with lots of sauce (the best part). We also got the burratta and prosciutto for an appetizer. For mains we got the Linguine Alle Vongole which was our least favorite. We put the sauce from the mussels on that pasta and it was better. We also got the Tartufata pizza which was so good. It took a while between our apps and mains but we were happily sipping on some cocktails. Definitely would recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOFp6d09nEAE",
            "text": "The food was amazing we had the spicy mussels for appetizers which was on the special of the day menu. They actually waited until my friend and I finished our appetizers to bring out the food. They didn’t try to overcrowd the table with all the items which I thought was very thoughtful of them as a restaurant. The bolognese was amazingly delicious. The raspberry mule was refreshing and well balanced. I’ll definitely be coming back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCakl2akd3EAE",
            "text": "Not impressed! The ambience is cute, though. Took almost 10 minutes to someone brings us the menu (and the restaurant was empty). I ordered Tortelloni di Zucca and it tasted a little bit sweet. I had also ordered the cocktail Raspberry Mule that never came. Got the tiramisu for dessert, but it has a lot of mascarpone cream. Overall it’s a little bit overpriced."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRb3NTQXJRRRAB",
            "text": "Im not a huge fan of italian food, but my family is. We all enjoyed a wonderful time here. It was a late Sunday afternoon so the place was not packed but the brunch menu was still available.\nThe pasta were truly delicious, and the bread basket was great. We had the tiramisu and a strudel wich were a delicious accompaniment to their coffee choices.\n\nAll in all, I would recommend the place for their professional staff, ambience and good food!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBZ29iTXp3RRAB",
            "text": "This place is pretty popular, but you can wait at the bar with some limoncello or wines while waiting for your table. Good has great flavor, especially the octopus. Amazing prosciutto. Great pastas. We also tried the more unconventional duck ravioli. Definitely worth a try sur to the uniqueness, though a bit sweet for my taste.\n\nWould come here again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVNzRxVUd3EAE",
            "text": "I love this place, one of my favorite Italian restaurants in queens, I go there at least once a week, love their food specials, their pasta is always good, any pasta you will get from the menu you will definitely like, good sea food as well, and you must try their Bufala  pizza. Sometimes they might exaggerate with the prices with certain special dishes like they charged $30 for 4 pieces of ravioli, but there are many items in the menu that go for reasonable prices. Very friendly owner who welcomes you and make you feel at home, good service and good selection of Italian and French wine, good atmosphere not too loud not too quiet, good for dates, there is inside and outside seating, outside is preferable by customers in summer time. Highly recommend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtODhMTDh3RRAB",
            "text": "Came here during Restaurant week on a Thursday evening.\n\nI really enjoyed the burrata appetizer, it was delicious, so was the bread pudding! Rigatoni al pesto was not my favorite, just a bit too oily and al dente to my taste. My friend ordered salmon tarte and branzino filet, both were good.\n\nThe restaurant was extremely busy, all tables were occupied and it felt too cramped inside. Although the service was okay, I was surprised to see that on top of 20% service fee that was already charged as part of the restaurant week, there was another note asking for a cash tip, a surgare for a credit card payment, and a receipt with extra tip option. What initially was supposed to be an affordable meal ended up being a regular priced dinner in NYC.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWemFUejdRRRAB",
            "text": "My family and I celebrated my birthday at Vite. This was our second visit. The atmosphere is warm and friendly. The food is fresh and delicious. The drinks are made with love. We enjoyed every bit. We started with the burrata. We had the mussels from the specials. We got the Conrtofiletto and Tortelloni Di Zucca. We completed our meal with the delicious flourless chocolate cake."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MFp2UVF3EAE",
            "text": "One of my favorite spots for authentic Italian food. Servers and owner are incredibly personable and attentive. Been coming here for years always a consistently positive experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxa01TR3pBRRAB",
            "text": "Food and service were great. I’ve been here twice and will come back soon. I definitely recommend this restaurant. The pasta was so delicious and the lemon pancakes were very tasty. You must try the marocchino."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtd2VEbUFREAE",
            "text": "My friend and I wanted to grab italian food but a location that wasn’t deemed too romantic.\nWe came across VITE Vinosteria in Astoria, Queens.\n\nWhat an absolute delight. Service extremely attentive. Decor is beautiful besides being tightly squeezed with nosy patrons who often pierced their eyes on our food or attempted to listen to our conversation.\nThe food is delicious. The food is served in a small frying pan which is absolutely clean and free of markings and stains of any kind.\nThe drinks are good. Quality drinks\n\nIf you don’t speak italian; well not a problem, just go to the bathroom for some lessons. The bathrooms is equipped with audio that teaches you italian words or sayings. Depends how long you’re in the bathroom you can learn a few words. Lol. Please be cognizant that there is only one bathroom to this location.\n\nPricing was fair and comfortable for dinner for two. Highly recommend to check out this lovely italian eatery in Astoria."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDbDRQOGFnEAE",
            "text": "Vite is amazing. The food is phenomenal and inexpensive compared to most Italian restaurants in the city. Your surrounded by plants and vegetables growing all around adding to the ambiance. The prosciutto arugula pizza and gnocchi are two of the most popular dishes seen below. The food, wine and relaxing mood made for a perfect night!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyb1B6VGFREAE",
            "text": "Delicious Italian food and great service. The owner sits you as you come in since they don't take reservations. He is very warm and even in a busy Friday night you don't have to wait more than the time it takes you to have a drink at the…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzamJySGh3RRAB",
            "text": "Vite Vinosteria is an amazing and authentic Italian restaurant in Astoria, probably the best.\nI had a chance to spend some time with Pino, one of the owners, that is a…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNNjQtNUZREAE",
            "text": "Authentic italian food with a great and knowledgeable staff. Loved the flavor and the Price was very good for the area.The chef made a few recommendeations which was great. hIt was not crowded when I visited, i don't about the weekends. The manager welcomed us at the door. Will def comeback."
        }
    ],
    "reviews_count": 78
}