{
    "name": "DK PubLIC",
    "place_id": "ChIJ94mJveFfwokRDjxQ-8fT0yw",
    "grid": "QN1",
    "address": "38-40 29th St, Long Island City, NY 11101, USA",
    "rating": 4.5,
    "user_ratings_total": 346,
    "phone_number": "(718) 433-9316",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wM1gxQm5UazkyYVVOd2RXVnhZV3d5VWxWTE1VRRAB",
            "text": "Great selection of beers, attentive and nine bartender."
        },
        {
            "date": "6일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ga1QxbHpPSEF6ZFRRdGNsSlhlbFY0VTBKMmJHYxAB",
            "text": "Recomendado! El servicio y la cómida excelente"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sblN6bFlZM0puUkdSa01FUlFTbGh0T0hkM1QyYxAB",
            "text": "The food is terribly greasy and stale, with no vegetables. The service is abysmal—they're lingering, rude, and surly, yet they demand large tips. They don't use polite greetings or goodbyes. The atmosphere is oppressive, putting people in a sad mood and damaging their attitude toward the world and life."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUlV6QTBZVmhLVDAxeWFUSnRkbGRtUzBWRFUzYxAB",
            "text": "Service is very unfriendly"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWemMzTk1aQzA0YzBGTldWVkdiSGhxVkZReE5rRRAB",
            "text": "Excelente servicio muy rico todo"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcWIxWk5RMjVoTFZOR1owUnZjVmxNYTJOak1sRRAB",
            "text": "On October 24th at 9:20 PM, my boyfriend and I had two mules. We paid $21.78. We have the receipt. However, the bar charged us $21.78 twice. We also contacted our bank. There are two different authorization numbers: Authorization 1 no: 425997 and Authorization 2 no: 426035. We want a refund of the overcharged $21.78. We tried to reach the Bar Manager, Antonio, but he didn't respond. We're staying at the Nesva Hotel and came to the neighborhood bar because we trust him. You shouldn't victimize us like this."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVGMyTnRlVzg0TFRkeUxVMW9kVFJPY0hndE5YYxAB",
            "text": "These guys have excellent food and great service!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSUFpuVk1aRzh5ZGtWcGFVNXFPVEpJVUc4M2JYYxAB",
            "text": "Mixed experience. Good pub atmosphere but service was ambiguous, they forgot or misunderstood our order of apetizers. Which turned out good for us since both fish and chips and hamburger were huge. Still. The main issue was the fried fish which was undercooked, probably frozen, smelly and the texture dry and chewy."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWc1dWRmhWRTFDUnpObFV5MVdiREZvZEZGc1RWRRAB",
            "text": "Excellent"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRlZUUm9XbUpDUlRaTE5VSnNhbVIwYkZWeFJuYxAB",
            "text": "Muy delicioso me encanto el servicio y personal 110/10"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdFgzbGFZa1pQVTB4RVduTk5ORTF2VGpKRmFXYxAB",
            "text": "Great for excellent customer service. Awesome venue!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMlNVZEtPVFEyVFVSVGNuRkpZbFp4ZFhJNU0zYxAB",
            "text": "Passed by for late brunch (3P) on a Sunday afternoon....we were the only ones there, and it was spotless! Super cute neighborhood bar that serves food. Friendly server, and of course since no one else was there our food was fast and delicious. We went for the DK Brunch Burger with side of sweet potato fries plus side of ranch and the Chicken Sandwich with Old Bay Fries. Both WTH emerges and sandwich were on really soft buns, not too filling, and delicious! The burger was cooked to my preference of medium and the chicken had a yummy flavor and crunch to it. Mimosa was nice to start after a busy afternoon and after that food coma, had some ice coffee. Love the old tiles, flowers and vibes here."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMFRESkJWbGRPWVdSSE9EaDNMVWhpZUd4MVNIYxAB",
            "text": "Dropped by here after wanting to check out a bar in the area. Grabbed a cocktail and watched the Yankees game.. my drink was flavorful and pretty on point. The server we had was attentive and friendly. I’d definitely check this place out again if we’re ever in Queens."
        },
        {
            "date": "1달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZdE5Fc3dVVWxwVkc5ak1pMHRUVGhSUkU1dFQyYxAB",
            "text": "Een gezellig eetcafé in de wijk Dutch Kills in Long Island City. Vriendelijke bediening, goede prijzen, lekkere cocktails en lekker eten. Onze vaste stek tijdens ons verblijf in het Nesva hotel. Rustige omgeving."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVFJqVnFXRTlRWmtkS2VFRjJhRXh5ZGpaU01WRRAB",
            "text": "Nice pub with a great selection of beers and good burgers."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vdFZEQkVVamxLU3pjMFkzSTFkelZQV0VST1UwRRAB",
            "text": "They advertise a rib eye steak/fritz for $42:00.  It's really a menu marked prime sirloin which is no way a prime cut steak, grisol and mealy. Not worth the $42 bucks. Their pino  grigo wine  brand was excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcE9HSndlbU0wUkVwSVJEVjRkak16YTFkbWFrRRAB",
            "text": "The kind of bar you wish you had down the block. Pop in for a drink when you're in the area"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOZlltUnpkbTVGYkhOT09Ya3dSak5vWjB0VVJsRRAB",
            "text": "Have been here number of time but after last visit on Wednesday September 3rd will never be back. Watch out for your credit card bill overcharge. Once you pay they will adjust credit card receipt to overcharge you $100."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcmR6RlZORzF0Y1VsdWNscFdNbkpEYTBWRFJFRRAB",
            "text": "The bloody Mary here is tops"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRGNsVnVlSEpUWmxoQ2JXWTFPVFZoUmxSMmFGRRAB",
            "text": "Decent pub, great lunch spot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wV1VUSmhTVkkyU21SVGFHUTRaVEYyZUdFNFlWRRAB",
            "text": "Interesting designer cocktails. Excellent burgers. Felt like a step back in time inside an old pub. And that’s a good thing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbmVFcE5UazVrZDFoWVpFSnVOVnBRY1ZZeldGRRAB",
            "text": "Very friendly place...service was excellent"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJV0l4WVdIc2Z6RVZBEAE",
            "text": "Amazing place, amazing staff, you should get the Brussels without doubt!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NFFtUTFhRlZ3YlZkamREUnVTbFJ2V25KWFpVRRAB",
            "text": "Great food, good beer and lovely staff…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKamRIZHhVelZJTW1oNVltSXRZWEpUTkVsekxWRRAB",
            "text": "This place was awful. I asked for a coke today with absolutely  no one in the restaurant and the server didn’t bring after 20 minutes I just said never mind and he still proceeded to try and charge us and pull a fast one. They didn’t have Bavarian Pretzels or a handful of alcoholic drinks. Awful service and really inexcusable with no one in there on a Saturday before peak lunch time. Maybe there was a reason for that…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObWNXMW5WM1pHV2toWk9WWlhkbmxDT1VJMFRWRRAB",
            "text": "The Bartenders are very good at their craft."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Bd04xRnpRbFJEWWxkelkwOVFXVUZNVkZWemNrRRAB",
            "text": "Everything was good but since is an open window typo bar it was a bit hot for the open windows.. other than that its a nice place"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMF9PTE9nEAE",
            "text": "There's nothing like sitting outside on a beautiful summer's day eating tasty food and drinking a well blended cocktail!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVVkydFRUemhoUmpkTFIyaFRUbXRxWkVaQk4zYxAB",
            "text": "Went to DK PubLIC today for brunch with an old friend and had a great time. Our server, B, was quirky, funny, and super kind — made the whole experience even better.\n\nI had the chicken sandwich, which was enormous and seriously juicy. Totally hit the spot. My friend got the fish and chips and couldn't stop talking about how good it was.\n\nGreat vibes, awesome food, and even better service. Would definitely go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRVNFRlRkRkk0VldOSldVTnpZMWxpY0dKR1lrRRAB",
            "text": "Good selection of beers. My favorite of course Guinness and delicious food and of course happy hours 😀"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdlpWUlNZM0YwTVRrNWRHdFRlWHBJWjFKS2JWRRAB",
            "text": "Brunch food was good, although it was small portions for the price (see photos, those dishes were nearly $20). The food by itself was fine, but...the  service was atrocious.\n\nThere seemed to be one server for the entire restaurant for Saturday brunch hours. While I wanted to sympathize, there were very few diners - my friends and I were one of 3 small tables. My friends and I also noticed a very overt attitude. Any time a guest made a request, we observed her roll her eyes/make a face.\n\nOne of my friends asked for a coffee, and she said, \"are you sure, it will take a long time.\"  My friend thought about it for a second and was about to say never mind, but then asked, \"how long do you think it will take?\" to which the server replied, \"5 minutes.\n\nIt seemed like she wanted to make up an excuse to avoid making a coffee, which was strange. (It turned out to take more than 20 minutes).\n\nI would not recommend based on the experience my friends and I had today."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eVV5MVdiV2h0ZUV0d1ZFUnFiVmx4ZVUxMmMyYxAB",
            "text": "Love it here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNUxYaEVUVlE1TW1OMlkzZDRPWE10Um5Vek5WRRAB",
            "text": "I basically had to ask for a menu, for a 2nd drink, appetizer and main came at the same time ???  I had to ask for ck. After 20 mins of being  done.   And had to flag someone to pay for my order which was about 65.00. I have  given this place many opportunities but as a neighborhood bar not sure I would come back. It’s a shame !!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMExYQnZOVlpvZFVWVk1XWlhNRVZQU205Sk4wRRAB",
            "text": "Fantastic food in a nice area, almost nothing bad to say about this place. I highly highly recommend the Mango Habanero Wings. Came two days in a row on vacation for those wings 🤤"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeFIzTkZaRlZwTFc5SU0xcGpTV0ptWnpGbE5YYxAB",
            "text": "Passing by"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214d1JWUklORUZhUm5kNGVqSjZRM2sxVjNwdldsRRAB",
            "text": "They served me rotten mussels. Chef could’ve easily made an extra and tasted it before they sent the dish out. The bartender and food runner were very apologetic but when I spoke with the manager/owner, he acted like he didn’t care one bit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200d01VVktlV1F0UVdWQ2NtOVRiVGhLZFZaSldVRRAB",
            "text": "Always amazed when visiting LIC and all the changes it's gone through. Great neighborhood, nice small bar. Within walking distance from hotel, train and coffee shop. Ordered teaser salad and a hurricane. Friends order burgers and fries, wine and old fashions. No complaints. Have seen each other in years. Kids are grown. Good times"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toelRIb3RObkl5ZEdGa04zWnZWVkZYTTFaSU1YYxAB",
            "text": "Muy rica IPA y una muy buena hamburguesa. La atención de los meseros de 10."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUFNVSmhhRXRtTWpObFFWVkNiakJtTVRKeFVrRRAB",
            "text": "Very friendly service and a very good pint of Guiness!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQdnEySktGNGJ5ZkxREAE",
            "text": "Didn’t mention a charge for additional flavors to margaritas. They also charge for using card which is not mentioned when you get the bill. Service was incredibly slow despite being slow at the time of service. The food was delicious. The drinks were fine. But the additional charges for using a credit card and the nature of getting drinks was truly abysmal. Atmosphere was spot on but they need training and need to understand their product."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMajI1OUhJcjVuYkxREAE",
            "text": "Good food + good tvs - one complaint: slightly annoyed that I got hit with two extra sauce charges w/o notice (one for bbq & one for a side of hotter buffalo sauce suggested by the waitress). Literally $2 extra on a $225+ tab that sullied the experience from 5 to 4 stars"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPaUtfTkhKdWF6SGp3RRAB",
            "text": "Went with coworkers. We had a great time. We watched the boxing match. Great tacos!! The cocktails were great!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYWxzdUduODZfWF9nRRAB",
            "text": "The food and drinks were great and it was so nice to sit outside!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQckJ6WW04LXR2WENnEAE",
            "text": "Good but not so special"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeUlDREJ3EAE",
            "text": "Very attentive service, food is normal bar fare prepared nicely. The value here is a quiet neighborhood atmosphere and easy, relaxing experience."
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMS1tcVpBEAE",
            "text": "En visite à New-York en famille, nous y sommes allés le jeudi 24 avril en soirée. Très belle découverte, lieu très sympathique, tout comme le personnel. Nous y avons dîné en terrasse, excellent repas. Nous y retournerons avant de partir. À recommander. À ce soir.\nCordialement"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcmNtLWN3EAE",
            "text": "yummy bean burger for vegetarians and very friendly waitstaff. one star off because not many vegetarian options. i think just two non-meat burgers."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvazgtTnh3RRAB",
            "text": "Great place and the food is delicious!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveHNtcHBRRRAB",
            "text": "Sooo good !\nKalina is so nice !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveHVYWU5nEAE",
            "text": "Just totality what you expect for a good American bar. The food is great , the service Amazing.\nBeautiful warm place"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMTliMHRnRRAB",
            "text": "안주도 맛있었고 직원들도 엄청 친절했어요! 분위기도 좋아서 친구들이랑 가거나 데이트하기에 다 좋아보여요!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbWF2dWdnRRAB",
            "text": "We did walk-in on a Monday (holiday) evening and it was not too busy. The service was decently fast and the food was really delicious! Everything we had was great. I highly recommend the beet salad. Also, the “public nuisance” sauce for the chicken wings really is quite spicy, so try if you’re looking for a burn!\n\nThis is a great neighbourhood spot that we will definitely be coming back to often!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqM3Z6RDVnRRAB",
            "text": "Amazing burger, one of the best in nyc. It’s juicy and fresh.  Loved the shoestring fries that comes with the burger.  Waiters and bartenders are friendly and attentive. Also DK is super dog friendly which really added to the ambience. Highly recommend for a burger and local beer in Long Island City."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfb3VfVi13RRAB",
            "text": "We have been here the 25th of December, in the afternoon. It has been our quiet spot after a day visiting NY and before going to the airport. There was nobody but us and a couple of others. The waiter has been very kind and welcoming. I took a Guinness and my wife a cocktail. Both very good. The forniture is very peculiar and totally in line with the mood of the pub. A great place that will stay in our memories and hearts ♥️. Thanks"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURld3VIeS1BRRAB",
            "text": "Finally made my way here and was not disappointed. Great service, delicious food, and lots of beer options on draft. Fish and chips were delicious. Fish was very airy, crunchy, and moist. The Asian style wings were killer. They use flats so you get a hefty portion. Also had the DK burger and it was very satisfying. Didn't fall apart on me so the bun and patty portions were just right. That apple wood smoked bacon was a tasty crunch. Going back again for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aUtpeUtREAE",
            "text": "Much needed addition to our neighborhood. Family owned establishment serving a variety of beers on tap plus whatever delicious meal fills you up till your hearts content. I enjoy the burgers and chicken sandwiches. The fries are thin-n-crispy. Stopping by for lunch when you forget to bring a meal to work is ideal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6My1hUmRnEAE",
            "text": "Now, let's start with how difficult it can be to find a delicious salad 🥗 in an area where you can find yourself outstanding pizza 🍕,  bagels 🥯 and more. Their Apple 🍎 Walnut Salad was amazing and if salad isn't on the menu for you their Fish N Chips was great too."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOGIyQTR3RRAB",
            "text": "Thiago, Fernando, Manuela, David are absolutely outstanding. I love coming here weekly. The atmosphere and food are amazing, the drinks are too! Tony is also fun to have around."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbHV2c2NBEAE",
            "text": "The first time I was there, a barmen overpriced my beer and charged me the wrong amount. The second time - I realized that their \"jumbo wings\" order is only 6 wings 🤷‍♀️ Maybe it's a norm experience for NY, but NOT for the rest of the US. I don't recommend."
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdF95RE1nEAE",
            "text": "Fantastico. Non ci sono altre parole per descrivere il miglior burger mangiato a New York in 8 giorni. Servizo ottimo e gentilezza fanno da contorno a cibo ottimo e birra Guinness buonissima. Se ci passate, non andate oltre, fermatevi per una colazione, un pranzo o cena e non viene pentirete.\nAppena fuori Manhattan un Pub veramente Eccezionale !!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNGZQeVpREAE",
            "text": "DK offers an exceptional burger, arguably one of the finest in NYC. It's fresh and succulent. The accompanying shoestring fries were delightful. The staff, including both waiters and bartenders, are friendly and attentive. Additionally, DK is incredibly dog-friendly, which enhances the overall atmosphere. I highly recommend visiting for a burger and local beer in Long Island City."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNzhlVThRRRAB",
            "text": "DK PubLIC is a true hidden gem in Long Island City. The cozy, welcoming atmosphere makes it the perfect spot to unwind, whether you’re grabbing a drink with or without alcohol. My usual is a Heineken 0 in a tall Collins glass’s\nThe staff is genuinely friendly and attentive, making you feel like a regular from the moment you walk in.\nTheir black bean burger is outrageous —flavorful, hearty, and perfectly balanced. They make everything in house - all delicious, and the menu has plenty of great options for vegetarians.\nWith its rich history and warm energy, DK PubLIC is a spot I keep coming back to—highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3emFhOGpRRRAB",
            "text": "We came here with our dog and enjoyed the outdoor seating. The area had a few pedestrians but was overall pretty quiet. While the service was a bit slow at the beginning the food came out quickly and was very tasty! This is a great place to order a bunch of apps and share.\n\nAlso you MUST get the old bay fries!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbm8zVVpREAE",
            "text": "Looks like your pretty standard bar, with a fairly standard bar menu. However, the food was incredible. Had the black bean burger, and was very satisfied. Also, probably some of the best shoestring fries I've had in awhile.\n\nThe drink menu was also wonderful, the elderflower Bessy drink was delicious (and potent)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtcWUydEdnEAE",
            "text": "DK Public, a local hangout, has been open for a few months, since around Oct.  Formerly in this location was another well-known bar, Dutch Kills Centraal, which closed during the middle of the pandemic.  The new owners made some cosmetic changes in the interior, but the space basically looks the same.  Inside is a gorgeous, kind of old school but upscale vibe.  You’ll find the original mosaic tile floors, pendant light fixtures, hand painted murals and lots of wood furniture.  The indoor space is large, and they also have some outdoor seating.\n\nAs for the menu, it’s limited right now.  They have some lunch offerings and pastries throughout the day.  When I visited last week, the owner told me they just got their liquor license and hope to be offering dinner menu soon. After chatting with him, I ended up just getting a cup of Americano and a muffin.  The coffee was great; strong and dark.  Not sure if they bake the muffin in-house but it sure hit the spot.  It was nice and moist and filling.  I’ll have to plan another visit to try out their food.\n\nThis under-radar hangout is ideal for those looking for a nice quiet place to work, grab drinks and meet locals."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGX1puem9nRRAB",
            "text": "Good food and decent prices, we’ll be coming back here. I had the no cluck chicken sandwich which is vegetarian and made with buttermilk battered oyster mushrooms it was delicious. My husband had a perfectly cooked medium burger and the fries were excellent."
        },
        {
            "date": "11달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzX1phYzZnRRAB",
            "text": "Ambiance pub vraiment sympa\nPersonnel très accueillant et prévenant.\nLes aliments sont très biens préparés et de bonnes qualité. Mentions spéciales pour les frites qui sont incroyables"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCbU9lWmVBEAE",
            "text": "Sweet little hangout by our hotel. Offered indoor and outdoor seating but at the moment (winter) there was no cover for the outdoor seating. Food was delish with an average price of around $18. I got the chicken sandwich with sweet potato fries and all of it was worth it. Chicken had a crispy shell with a juicy center. My friend got the chicken tenders and once again, breaded and cooked perfectly.\nWe didn't get any drinks but they have a full bar.\nServer/bartender was very nice and took great care of us!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveHVtaHNBRRAB",
            "text": "I’m French and that’s exactly what I need when I expect a real American soul pub/restaurant\nSo I highly recommend to try their special Burger with pint of beer for a perfect price.\n\nThank you for your hospitality"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbEs3WmR3EAE",
            "text": "Cozy atmosphere, great food and a good beer selection! Would definitely recommend. We had the chicken sandwich, and Mac & cheese and they did not disappoint! The staff was friendly and attentive! All around great place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNia1p5RnBBRRAB",
            "text": "Nice little neighborhood pub (next to our hotel) with friendly down to 🌎 staff. Enjoyed a couple of drinks - the Bessy was excellent. Low traffic, so outdoor seating is a good option. Cheers!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOHVmU0FnEAE",
            "text": "My grandfather owned this place  back in the 70’s….”Bay City” was the name.\nThe floor, bar & built in behind the bar was all from his place so I wanted to come check it out!  I came here for lunch with a friend. The server/bartender Elias was excellent! Very friendly & attentive.  We had buffalo wings as an appetizer… they are EXCELLENT!. My friend had the  breakfast burger & loved it. I have the apple walnut salad w/chicken and it was wonderful. I definitely will be back!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlakwzM3dRRRAB",
            "text": "Beautiful old bar. You great to experience old New York with this bar from its penny tile floors to its old large mahogany bar. Always decorated for the holidays this place really has that cozy feeling. Great place to stop for a drink or a meal."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneG95RXFRRRAB",
            "text": "Overall, a very good experience. The atmosphere of the bar effectively mixes old-school and modern and the dark wood sets a nice tone.\n\nWe had a whole crew with us for this dinner and some of what we had was excellent, pretty much everything was at least “very good”. The buffalo chicken wings were an excellent appetizer (big, juicy, flavorful wings) and the fried calamari was also very much on point.\n\nThe salmon burger was definitely good, if bit spectacular, but what was spectacular were the fries. Skinny fries fried just right, couldn’t stop eating them.\n\nA couple of minor glitches with the service, one person’s entree arrived late but, overall, friendly and solid. Nice, pretty low-key place to check out if you are in the LIC area."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHc2FmbVN3EAE",
            "text": "A great new coffee shop that just opened in the neighborhood! I got a delicious chai latte with oat milk and a vegan pumpkin spice muffin, which was tasty as well. The space is very large and the atmosphere was quiet; good for doing work in (wifi was strong and easy to connect)."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOGN2MmtnRRAB",
            "text": "This is the best bar in Long Island city to be honest. It’s so calm. The bar tenders are the nicest. The best IPA. The best food. If your looking for a clam and chill time please come here. Will always come back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHeTZQV3V3RRAB",
            "text": "Cute new coffee cafe place. Got the vegan pumpkin spice muffin and mixed blueberry being unable to decide from the two! They have a nice outdoor seating area and inside as well. Super friendly"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cW9PRk9nEAE",
            "text": "Went to DK tonight.  It was St.Patrick’s Day evening.  I am a local resident and went over for dinner myself alone.  I know the owner Richard Madrid for a very long time.  As an Irish American, I found myself alone this St. Paddy’s day.   So I decided to walk around the corner to Richard’s place.  I generally do not feel comfortable eating  alone, but did this evening.. the Corned Beef & Irish whiskey were superb.  And best of all I was introduced to 2 new fellows to our neighborhood.  What a lovely evening!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENDZDcEdREAE",
            "text": "This is a great place for brunch!  It is near local train and nearby hotels. The food is delicious. Their choice of mocktails are delicious. I recommend the Elderberry Fizz!"
        }
    ],
    "reviews_count": 79
}