{
    "name": "Truth Restaurant Astoria",
    "place_id": "ChIJx9TFWhBfwokRjqfzfLhojJo",
    "grid": "QN1",
    "address": "27-35 21st St, Astoria, NY 11102, USA",
    "rating": 4.5,
    "user_ratings_total": 223,
    "phone_number": "(347) 527-2199",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMU9HOWZPSEpXZURkU01DMURNa1EwYTBGbWJsRRAB",
            "text": "Our waitress was really nice and attentive"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZemNrcEdWRjlpTVUwdGVuTldkblJCWlVOWWVVRRAB",
            "text": "I had such a great experience thanks to our server, Inaara! Our drinks were always full, food came out perfectly timed, and the service felt effortless. I would definitely come back!!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5blMyWmhkR2xQT0RORE5VOWxia2R1U2tORWRWRRAB",
            "text": "Excellent service! Our server Inara gave me the best service I ever received! The food was great, but I genuinely can’t get over the service she was so sweet and made sure we picked great plates and drinks!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUGNXVkVXakkxWHpVNFRrTjFXV2hsVUVad1NWRRAB",
            "text": "Steak and drinks are good"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaVNuVk9OVVpITkRRMU5rbERXWEJwUldVeFoxRRAB",
            "text": "I visited for lunch today. Unfortunately the 'toasts' were very hard and flavorless, the service was slow and the music was way too loud. On top of the bad experience they included an obligatory 20% gratuity. One of the worst restaurants I ate at in the city."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkelZuZHZNRUpmUVVJMFZWVXliM2hoYmxSR1UyYxAB",
            "text": "The food was really good and the ambiance was great! I really enjoyed it and will definitely be coming back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMFdITlJVVVkxWVhaTVdrSmhVMlp2VG5ScVJsRRAB",
            "text": "Chris C. ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSa1MxUXdSWFF5YjI0d2RqSm5RMWgxZUhOU1ltYxAB",
            "text": "The truth is they didn't remember a single plate at our table and at the end they tried to make our table of 10 pay in thirds. Weird. The food was good but everything else was not."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRVZYWk1YMHN6ZEdkdE4wSkJkMk5IV1VKalJrRRAB",
            "text": "I just enjoyed some happy hour food and drink here and it was truly lovely. Everything that I ate was delicious. The service was attentive without being overbearing. It was fantastic. My only tiny reservation about this spot is that it seems very loud. I am a geriatric millennial and the dance club-style music was a tiny bit too loud for me on a Monday night at 6:30 PM.  Other than that, the ambience is lovely. The decor is a little bit gaudy, but cute, clean, and comfortable. I really liked my experience here."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUVpHeG5WeloxVFZaQ1JYcFZkVlZVYzJGMlUyYxAB",
            "text": "The food here is absolutely delicious! Every dish we tried was bursting with flavor and cooked to perfection. Highly recommend The music was Great & staff was super attentive ."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSE56UndlVUp2Ukd3M1lVNXBiRzh4TFZrdFRuYxAB",
            "text": "Amazing food and ambiance. I'd recommend the Steak Frites! The sauce they use is absolutely amazing. The drinks were so refreshing amd hydrating, you wouldn't even know there was alcohol in them, but there is, so drank responsibly and…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swM1RESjNjazlWWDNwblpYZFhSelpxY1d0WVgzYxAB",
            "text": "I recently celebrated my birthday here (09/27). It was a party of 11 and the food was served family style. The food was good especially the Rock Shrimp, Orange Chicken and the Salmon. The service was immaculate. The hookah was cute. I appreciated the decor and atmosphere. The music was house and dance music. The only downside was the  time limit and it was strictly enforced. We bought a bottle of champagne and shots and wanted to buy another hookah but we were warned about our time coming to an end.I was made aware of the tables having time limits.However, I think large parties should have more time."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JeFVuZEpkWEJPUVU5ZlpWcHJZMFJTU0VaaldVRRAB",
            "text": "Excelente lugar y comida"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TlNHeHVTbTExVWpCd2NHbHZZWFkxUlVKcGIzYxAB",
            "text": "Went on a Tuesday to have a few drinks for my birthday, VirgoSzn♍, they were ok. The food was delish. Will go back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocGNIbDBNSEY1ZUMxV1RGRlJORE5UY0VkNmMxRRAB",
            "text": "Saturday September 20, 2025 i’ve had my eye on this place for  some time now. I have been intrigued by its name and the reviews which were very good. And  finally visited for dinner with my best friend. And just as the same goes “If you see something say something “ and I’m saying this  place is awesome. The owner  ambience  food music  were very good. I must commend Franklin the owner for being on top of things he was wonderful . The is staff for being so professional. They make sure that you have a good time  the food is good and drinks excellent I must recommend and of course return. Mattie"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMGEyUkdaRkZsUVV0bVIwRXpkamhKYlU5b2FXYxAB",
            "text": "Ambiente espectacular, solo que si deseas seguir disfrutando del ambiente ellos te dicen que no que la mesa es solo por hora y media o 2, aun estando el restaurante hábil para mas reservaciones, que pena que halla manejado de tan lejos para disfrutar del buen ambiente pero que ellos mismos no te lo permitan, de cientos de restaurantes y lounge que he visitado este es el primero que se abstiene a que tu le gastes tu dinero, todo lo bueno que tiene el lugar lo tiran a la basura con ese trato."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWFVFczFaRWN3YzFORGMwcFdMVFJ2VkU5UVkxRRAB",
            "text": "I tried this restaurant for the first time because the reviews were great. Needless to say it lived up to their reputation.  Between the waitstaff, the food, the atmosphere,  and management,  everything was amazing. I would recommend this restaurant to everyone.  I'll definitely be returning again and again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOT1oxZHZOemd4WTBOWGMzWlRSMlJuVldGNGIzYxAB",
            "text": "Edamame was a good appetizer start off with. I ended up getting a skewer which was finger licking good. For entre chicken fried rice with salmon medium well and it was bombing. I forgot the name of the drink i had but it was good. I definitely would go back here. FYI they have hooka here (i dont smoke but just heads up)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MVNFcG5Ua053VUhwNVJrOUdSVXA0VXkxUmQyYxAB",
            "text": "Amazing food, beautiful aesthetic, amazing service and server (Inaara💕)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WmNISjROamcxWHpKTlVEVm9ZbGh6Y2tkV1puYxAB",
            "text": "The food was great for a good price. We got the Steak Frites and the sizzling pepper steak. I loved everything and the staff is very accommodating. Would come again. Be wary that the music is SUPER loud but that’s just the vibe of the restaurant. The aesthetic of the restaurant itself is beautiful with lots of decor. Great for pictures!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeFRYWnBlVlY2VVdNMFEyOHpiMnh3VDBsdVlsRRAB",
            "text": "Such a great experience going to truth for the first time, Steph our waitress was amazing, very pleasant and great service. Perfect Ambiance. The food, drinks, and hookah was 10/10."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbk0xaFNTbGt5U21kaFVGbzVXVmQwVjNnMU1YYxAB",
            "text": "While I found the restaurant visually appealing with a lovely ambience, I was unfortunately dissatisfied with the service during my visit this past week. Upon entering on a Tuesday evening, my party and I experienced a considerable wait before being acknowledged. We were informed that the dining area was full, but there were some seats available at the bar, which we accepted. We communicated with the bartender our desire to be seated at a table as soon as one became available.\n\nAfter ordering drinks, we noticed that several tables opened up due to a large party leaving, yet we continued to wait for a table while sipping our drinks. We decided to go ahead and order food despite still being at the bar. I felt there was a lack of attentiveness from the staff, particularly the hostess, regarding our request to move to a table.\n\nI should mention that it was my birthday; however, I didn’t feel it necessary to inform the staff, as I believe celebrations should be acknowledged regardless. Ultimately, my party and I enjoyed the drinks and delicious food, but we opted to finish our meal at the bar and take the remainder to go, as we were eager to move on and enjoy the rest of the evening elsewhere."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sd1VFNVlWMGxvTkdWWVJVVm1OMHBoVkU1U1VrRRAB",
            "text": "Una experiencia inolvidable, el sitio es súper agradable para disfrutar de un ambiente con amigos o pareja. Sin duda uno de los mejores sitios de NY"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeFJtRlFZbEpLWTAxM05FRXlMV2hhVEVveU9VRRAB",
            "text": "Ive been a few times, the service, food and hookah is always good but the music is a Debbie downer. The beat is the same beat that kills my upbeat mood at some point. Other than that nice calm spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSmFGcDJUMGhJYTNkTVNVWkJWa1l0UW5seE1rRRAB",
            "text": "The atmosphere was very aesthetic and clean. there is a good happy hour deal for oysters, but I prefer it to be more on the colder side. I’ve had better. Also, the pork bao buns were probably  the star of the show. They were delicious. I definitely recommend as well as the cocktails .The tuna tartare could’ve been better, wasn’t a bang for my buck, the peppered steak was mid they didn’t have any other options and you’d have  to ask for a side of rice which I couldn’t get because the server kept ignoring me and attending to other tables as I tried to call her over she only came back after my entree was done as it was a small portion. As for tipping gratitude  is included which is 20% and I gave cash but the server on the receipt it says Stephanie L she never brang the change back and it was about $40 roughly missing I’m not sure why but she wasn’t as attentive as I would’ve expected because we were the first table to be seated. As somebody who’s who works in the food industry, she could’ve done better seemed like she didn’t want to be there. This was my birthday dinner so I was disappointed with the service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNVpWVnRORFpwY2tRNVdGVXpUVXBpV0ZFeGFrRRAB",
            "text": "Everything about the restaurant blew me away. The food, the ambiance, the service, 10 out of 10. Stephanie was our waitress and she took very good care of us and made sure my friend felt special on her birthday. I will definitely be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCM2FIWTRhV2QwVUVSeFpHTmpZVTV4TjFKV1pYYxAB",
            "text": "Paola gave great service! Food was delicious.We will definitely come back."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNVoyWXpVREZIVXpWS1ZWaGtSM0pPTWxST2JGRRAB",
            "text": "La comida estuvo deliciosa. Todo lo que pedimos estaba bueno. El arroz trufado es muy especial, el ceviche vale mucho la pena. El único detalle es que el ruido es mucho y por lo tanto cuesta trabajo platicar."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMlZraGlRa2d4V1dWRlZFZDVXVGhvY1dNMFdFRRAB",
            "text": "Got there at almost 1 AM and thank God they were still open and had an available table. The food was amazing. Very different menu but very delicious. The oysters were delicious. Everything was delicious. I will add some photos. The drinks were very, very good as well and the customer service was A1.  100% vibes beautiful people beautiful staff great music. We were having a night where we didn’t know where we were going to go thank God this place was open and available for late food! I will definitely be coming here again and now that I trust you, I will recommend you everywhere!!! Thanks so much for the good time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dFZHbEtkbkJ1V1ZOMlN5MDFVa1JPY1VoVGJYYxAB",
            "text": "Food and drinks were AMAZING! Got the rib eye wagyu and paper crane 🔥Carlos was such a vibe amazing hospitality. Really made my night. Highly recommend! It’s hard to come by a place that matches ambiance PLUS good quality and this place does it effortlessly!❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRlIwMXpWR1Y1UTNCcGNXZElOa2xEVEVKalRuYxAB",
            "text": "I was excited about the menu when I looked at this place online. However the experience was not it for me. Loud music and hookah surround you, so get ready for a club vibe, not a restaurant. If that’s what you’re into, cool. But not for me.\n\nThe staff were cold and unfriendly, food was mediocre and overpriced, and to top it all off the tip was included in the bill. I honestly didn’t want to give a 20% tip because of how cold & unwelcoming the waitresses were. I won’t be going back here.\n\nBest part was the interior design."
        },
        {
            "date": "2달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRlpGbDJiMFZDU2s1SlRuTkdSREJYZUVGM05FRRAB",
            "text": "Excelente"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTVdrUnFWakV0ZDFSRE9IRmpiRXhGWkhjd2IzYxAB",
            "text": "Damn, Daniel — back at it again The hospitality guru, the connoisseur of comfort, the menu mind-reader, the table whisperer, the sommelier of vibes. GM = Grand Magician: he sees your “We’re good” and still appears with the extra napkins you were about to ask for. He calibrates lighting like a cinematographer, playlists like a DJ, seating like a chess grandmaster. He can spot hangry at 30 feet, manifest appetizers on command, and reroute allergies like air traffic control. Fork emergency? Already replaced. Water low? Refilled before you blink. First-date jitters? Candle, corner seating, perfect pacing. Birthday? He times the chorus on the downbeat and somehow gets the whole room smiling without the awkward clap. Danny turns “we’re slammed” into “right this way,” translates chaos into calm, and makes every guest feel like a regular even on their first visit. A hospitality psychic with a POS, a reservation alchemist, a maestro conducting service so tight the silverware wants his autograph. If hospitality had a Hall of Fame, he’s first-ballot. Chef’s kiss, service savage, five stars before the appetizer hits the table. Keep going, legend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdVducEhSMWRhZEV0SVJ6ZzVkM1paVEd4dGMzYxAB",
            "text": "Chris was our server he was very nice and attentive food and drinks were good loved the ambience we will be back soon"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQk5taHdWM1pvUTJoamIyVnFOVlowY0VOMmJsRRAB",
            "text": "everytime I come here food, drinks & service is 10/10! great amabiance"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWFZTMWhNRmhLVW5sRlJtWnFOMFp6VVRsWGRXYxAB",
            "text": "Amazing. Everything. The service **Carlos**\nThe food omg."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRVoxSkVkRTlXWjAwMVN6aG1XREZST1c5dFUyYxAB",
            "text": "What a terrific place. Loved the menu and the sharing concept. Our server was tremendous. She paced our meal perfectly. And the vibe of the place is really fun."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjeFdrazRURXRYY1VaVk5XNU9jbGhDTkVaVE5HYxAB",
            "text": "Beautiful place. The food & drinks is amazing."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMGJHSXROVlJpVUY4d1oxVndVRlkxVlUxblYyYxAB",
            "text": "La atención no es buena y fue demasiado lenta con el restaurante vacío, las bebidas son buenas pero costosas, no estaban disponibles los platos principales y no puedes sentarte donde quieras debes sentarte donde te indiquen!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdGFUUkVWbkpVYVdSaE5EQmZZWFZGYUZoaVowRRAB",
            "text": "We just so happened to stumble across this looking for something to eat after a long night and let me tell you from the very beginning from the entrance we were greeted so amazingly.  Mind you it was so late, we thought they were closing but they didn’t rush us or anything.  The drinks were soooo good and the food was phenomenal!  10/10 recommend.  The place is so chill. We had to bring our kids as we were on vacation, and we had just left an escape room (the escape game) and were so hungry.  My kids (14 & 17) enjoyed themselves as well.  It was so intimate and yet so fun with the music being on point as well.  I never usually do reviews but this was a must.  I wish I would have gotten their names (security and waiter) they were amazing.  I wish I lived closer as I would go regularly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkelkwMHpjMkpsTm1zM1dXdzVjQzFqUVd0TFlsRRAB",
            "text": "Our server inaara was amazing she was knowledgeable about the menu and very accommodating and with quick service definitely will be returning 20,000 stars!!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTGFrUjRNbXB4U1d0SFFXb3haRTFqY1hob1RWRRAB",
            "text": "Had a Group of 7 Amazing food, great great great hookah, amazing  air conditioner.  Drinks are the bomb and their service is fast, had valeria as a waiter and her energy is phenomenal. Music level was perfect with a good DJ.  Will definitely come back over again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVVkxbGtkbk5qUzFCWVZGWkNMVEpHZFhKQ1dGRRAB",
            "text": "Came here for a birthday. Food was great, servers were nice, friendly and professional. Only downside is the bartender, poor attitude, very slow with the drinks. Gives the bill without even looking at us, no smile, no thank you... And a 20%…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVmRFMTZhVGxzYTJ0T1kyZzJaR1l4T1VKWWRIYxAB",
            "text": "Always a vibe, great food and amazing staff. Perfect for any occasion. A must try!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNU5taGxWVjg0Um14MGVYRnVSV3hOWTNoR1ZYYxAB",
            "text": "Best restaurant in Astoria hands down. Atmosphere is incredible, the vibes are so dope in here music was amazing. They have hookah which was nice and fresh. But the star was obviously the food, we had the bao buns, edamame, rock shrimp the cucumbers just to start and everything was so fresh and flavorful. I can honestly eat those cucumbers all day everyday. Mains we had the pepper steak and the lo mein with chicken. It was the most decadent steak I’ve ever had in my life flavors out of this world as a chef I can honestly say this place a 10/10 on all factors. And our server Chris was great as well very accommodating. I will be back multiple times!!! Thank you Truth and all of your employees for making my anniversary dinner one for the books."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNUzZfLWZDcjZHNEdBEAE",
            "text": "Beautiful ambiance and the food is delicious. Please order a lychee martini one of these best I’ve ever had."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dGNrWnVSMHB4VlhaMU1WOVJkbUpMU1hCRVExRRAB",
            "text": "“TRUTH “this establishment is truly remarkable. The ambiance is exceptional, and our server, Valeria, provided exceptional service throughout our evening. Her recommendations for drinks and food were impeccable. We sampled various dishes from the menu, and each one was a culinary delight. 10 out of 10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKX3RvLUc1eGFUWF9BRRAB",
            "text": "The steak is good & the salmon was alright not seasoned a lot just tasted charred. The rice was amazing. Service was okay, the waitress was nice but I ordered hookah towards the end of my meal & that took over 30 mins to come. Assuming she forgot. The drinks are really good I would recommend happy hour only. The music was eh, wish it was more of a vibe but I would return again."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdWRXYUFREAE",
            "text": "I would normally complain about something, but there is nothing to complain about. In this place, the food is amazing. The drinks are delicious, the music. He's awesome staff a 100%... completely perfect.I wish the place was just a little bigger. Otherwise the place is perfect ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPdWYtcmk4aHNYT3RnRRAB",
            "text": "Annara was amazing will be coming back here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OUk3NmFnEAE",
            "text": "TRUTH BE TOLD!!!  Everything here is a can't miss, from the decor, the ambiance, the service, the cocktails, the appetizers and the entrées. Paola was our server and she was very attentive and made some great recommendations. Every aspect of this experience was amazing. The Truth is I would be lying to you if I truly didn't enjoy this place. I will be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPem93WTdDeGIyWURREAE",
            "text": "The food, music, hookah & service was amazing. Ate the salmon and honestly it was the best I ever had, not exaggerating. We got the hookah which nice and smooth. Our waiter, I believe his name was Carlos was on top of everything he was great. I would definitely be back again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMDRPMUdnEAE",
            "text": "Food was delicious, the shrimp bao bun was soo good we wanted more, I had a great  lychee martini and the sweet and sour chicken was really good. Service was a little slow. I liked the overall decor and lighting but didn’t love the music choice. Was a little too loud."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc3JUZnFBRRAB",
            "text": "What a delightful experience! Walking into this restaurant and immediately getting memorized with the beauty of the decor and its ambience! The server was very pleasant and ensure we were taken cared off. We did the bottomless brunch and always had a drink in front of us. Food wise, it was delicious! Absolutely would like to return to try their dinner! This restaurant always serves hookah and it was pretty good! I wish I took more photos! But the overall experience was well worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MHZyMnBRRRAB",
            "text": "Truth in Astoria is a picturesque restaurant that blends traditional Japanese charm with modern floral accents to create a space that is relaxed and intimate, yet vibrant. And as if the setting wasn't inviting enough, the ambience, the delicius food and drinks at ridiculously affordable prices, and the wonderful staff makes the experience even more worthwhile. The food is tasty and flavorful, and served in large shareable portions, and they offer such unique signature cocktails that you will want to try all of them. And the best part is that you absolutely can try them all without breaking the bank. Despite the food already being very affordable, they also offer one of the best happy hour specials I have seen in the city, with all of their specialty cocktails available for only $8 from 4PM to 8PM. Truth Astoria is an absolute gem that you will definitely love and want to visit multiple times."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMVBmUkRnEAE",
            "text": "Great spot, I mean great spot! This place has it all from good music to great food.\n\nFood was amazing, when I tried the food I can tell the amount of love put in it. Everything was well seasoned, prepared to perfection, and nicely plated.\n\nThe drinks were perfect! God selection of cocktails, beers, and hard liquor.\n\nService was very friendly and attentive. All of them were helpful and always smiling.\n\nThe spot was cozy and perfect for a date or to take your better half for dinner.\n\nThe price was just right!\n\nCome check it out, and thank me later 😀😀😀"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaElQd01nEAE",
            "text": "Very disappointed because this place is right by my house and I have to admit I’ve been there twice, once at the bar and now for takeout. Loved the cucumber I had the last time so decided to go in today just to get it to go. I sat at the bar asked for 2 orders to go, the bartender right away gave me the check and to my surprise 20% gratuity was included, mind you he at no time asked if I wanted a drink while I waited (would have wanted cocktail). So why was 20% added? It’s not about the money, just wondering if this lack of service should be charged.\n\nNow about the portion, I swear not worth the price. At least for take out. (The portion was bigger when I dinned in)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYN3VhYVl3EAE",
            "text": "Celebrated a girlfriend’s birthday here . It’s a decent size restaurant, the decor is moody and can appreciate the attention to details. The craft cocktails were tasty.  Oysters were fresh and the accompanying vinaigrette was perfect. We family styled our meals and tried most dishes . Pepper steak was our groups personal favorite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dmVXTTRRRRAB",
            "text": "Was a very cute restaurant with great decor/vibes. The staff were friendly and the food was good/nothing super crazy to rave about but definitely good. The drinks were also good & strong! They are a little pricey overall but have a good happy hour also. I was there for a birthday party so they have a private room that can be booked in advance with family style options & that’s decorated for celebrations! Completely separate from the main restaurant and downstairs through the kitchen which we thought was kinda cool"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyODg3WVNBEAE",
            "text": "Highly recommend the tuna tartare, rock shrimp and pepper steak! They’re all so good! The drinks were great as well. The ambiance is beautiful and upscale. Would love to come back soon!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcGI2Ri1BRRAB",
            "text": "Really nice place to eat. Great vibe and spacious if you don't want to be crowded. Music was nice and the staff were really good. The food was good, especially the rice, lo mein and steak. Food is a bit pricy, but if you dont drink, you'll spend less than 30. Definitely would return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIN0lybGpRRRAB",
            "text": "Absolutely spectacular service. My server Vicky was attentive and gentle. Would recommend this place to anyone for Sunday bottomless brunch. 12-4 you can 49$ bottomless special. Best regards in this business venture."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIaEt6RGtRRRAB",
            "text": "The ambiance is great! You walk in and feel like you have been teleported. The food was delicious, as were the drinks. Our bartender Isabella was very nice and attentive. Answered our questions about the food and tweaked drinks to our liking. I will definitely go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNko2d2x3RRAB",
            "text": "Food is outstanding, the drinks are amazing and the place is a vibe!\nWent to their first brunch and it exceeded my expectations. Best avo toast ever, the service was great as well, very welcoming.\nHighly recommended⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMTRxZE53EAE",
            "text": "The food was delicious and especially the tuna tartare. I had the fried rice, the pepper steak, and shrimp skewer.\nI tasted both desserts on the menu the chocolate sponge cake and tiramisu they were both good. The service was excellent the waitress was attentive. I would have given four stars except the tip was included which I did not realize so when the bill came and it gives you an option for a a tip it's an additional tip. Which is why the options are 3% 5% and 7%. Again I wasn't paying attention so I asked the waitress about this and instead of being honest and transparent and saying it's because the tip is included which many servers in many restaurants have done. Her response was you can add a custom tip here. So I ended up tipping about 40%."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5anJER0NREAE",
            "text": "My friend Mike put me on to this spot. Incredible atmosphere and vibe, its a beautifully designed place. The food was incredible as well, relatively small menu for now but absolutely everything was delicious and high quality. The peppered steak is a must order, so tender and packed full of flavor. We got here right when they opened and the staff was incredibly attentive and helpful. Overall it was an amazing experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMlBhSGZREAE",
            "text": "Beautiful atmosphere as soon as you walk in and once you sit down you felt the nice dark vibes for the night. The food was really good and nice size portions for the prices and the quality was worth it! Would love to come again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkcXNTUWhBRRAB",
            "text": "Astoria just got hotter with this spot!\n\nThis is a brand new Asian Fusion restaurant that just opened up with a beautiful ambiance that will take your breath away 😍 As soon as you walk in, you’ll be immersed into a one of a kind experience filled with so much beauty around.\n\nTheir menu is filled with all variety of Asian fusion dishes that’ll have you drooling before you even place an order😋\n\nI’m obsessed with their Spicy Tuna Tartare because it reminds me of crispy rice tuna & it was made to perfection as well as the Rock Shrimp. The Sweet & Sour Orange Chicken & Peppered Steak are an absolute must!\n\nThere is also hookah available for purchase & they offer a few of unique flavors to choose from. So you get it all here!\n\nThis place is perfect date night, celebrations & a good time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkOVliX2xRRRAB",
            "text": "Truth Astoria is a 1000/10. The food, the service, the atmosphere was amazing. Daniel made our dining experience great, he gave us amazing food recommendations that we weren’t going to try and were so glad we listened and got what he recommended because it was our favorite. The steak was so delicious. The drinks are so yummy as well. Date night or girls night or even to have a drink by the bar truth Astoria is the place to go."
        },
        {
            "date": "7달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3enNxM213RRAB",
            "text": "盐酥鸡 鸡肉不够鲜美 里面比较干 大虾炸的好吃 里面有汁水 甜品好吃下面两层蛋糕加草莓上面抹茶 我很喜欢  调酒好喝 氛围好"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaTlUdkhnEAE",
            "text": "Very nice place  and food was very good.  Waitress  super nice and always served  with a smile.\n\n2 negative things: service  was  very  slow,  you can tell there were understaff(maybe because it was monday)and also they charge 20% mandatory tip,  in my opinion  that's way too much specially  when the service  was too slow.  10 to 15% should be more appropriate  and we decide  if we want to give  something  extra."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeE5TcjRRRRAB",
            "text": "I loved the place. good atmosphere. Our waitress Victoria was always attentive, she gave us the best attention. hooka cocktails on point and good dishes with many flavors. Sofia and I had the best time!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMmVLcTJBRRAB",
            "text": "Dining at Truth was a great experience. The fried rice, karaage, and yellowfin tuna were all standout dishes, and the cocktails were perfectly crafted. The lively music and stylish atmosphere set the tone for a great night out, while the attentive service made everything seamless. Dessert was the perfect sweet ending to an incredible meal. Truth truly delivers—can’t wait to return!"
        }
    ],
    "reviews_count": 73
}