{
    "name": "Blend LIC",
    "place_id": "ChIJEdfcByRZwokRQe04uT7LBNY",
    "grid": "QN1",
    "address": "47-04 Vernon Blvd, Long Island City, NY 11101, USA",
    "rating": 4.5,
    "user_ratings_total": 1813,
    "phone_number": "(718) 729-2800",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRk5XdzRlV1ZQZVdGMmNISkJhWFZrWmkxaFNGRRAB",
            "text": "Barbie: I visit Blend LIC every Sunday for the great service, good food and great atmosphere.\n\nBarbie is a great bartender that pays attention to details and memorize all customer drinks and food choices.\n\nSee you next Sunday"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Q1oyWjJSMGRTZUcweWMyWk1NMkpUWTNGMFFrRRAB",
            "text": "Un amigo me recomendó este lugar y nos fascinó. Pedí la sangría y margaritas ambas muy buenas. Mi mesera, Emily fue muy cordial y eficiente, siempre atenta a lo que necesitaba. La comida estuvo muy rica. Sin duda lo recomiendo y por supuesto volveremos."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tST1RVcGZXRTVPUVhVMlQxZEJSMEpCVVVocFJWRRAB",
            "text": "Emily the waitress was outstanding, very personable, easy to talk to.\n\nThe bartender (he has glasses) was very personable and outstanding. Excellent service 10/10."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa1RFNVFiVVIxWjNaS2NVb3lSRkUxZDAxc2EyYxAB",
            "text": "The food was really good. Every bite tasted fresh and prepared well.\n\nA special shoutout to Emily, our server, who went above and beyond to make the evening perfect. She was attentive without being overbearing, super friendly, and made great recommendations that we ended up loving. Her professionalism and genuine warmth really elevated the entire experience.\n\nI’ll definitely be coming back to this Blend to anyone. I’ve been to the Blends but this location has been my favorite."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbE9XOW1kWEJDWlZWWFduQlNlbGxDVEhOMGRFRRAB",
            "text": "Food was good, always flavorful. The atmosphere inside was lively for a Tuesday night, with a few people at the bar and a few 2-top tables. We asked to sit “outside” on the deck, in hopes to getting closer to the amazing NYC skyline view, but it was underwhelming to say the least. They have covered the outdoor area (last we’d been there was about 5 years ago) the deck felt dark and like a prison, the windows had some kind of mesh that looked like bird fencing on top of plexiglass. It wasn’t inviting and made the view horrible. Not sure why they did that, the previous set up was amazing, there used to be life passing by and fresh air, now it really feels like a cage, ruined the deck experience. On the plus side, the appetizers we ordered were very good. We didn’t stay as the environment was disappointing, but I order food from here a lot for delivery and it’s always delicious, which makes it even more disappointing that they won’t take care of their deck situation, the place would be so much nicer, as the food is already on point. Although I have to say, I wish the menu was larger, the food is good but the choices were impressive. Anyway, maybe I’m a foodie who loves good food and hates seeing a good location go to waste, but the place left a bad taste in my mouth, even while the food is delicious. Something to think about..\n\nOh and they added an 18% gratuity, yuck, so tacky. I would have left 30% gladly as I always tip well, but seeing the gratuity added on a $50 dollar bill, is tacky as hell. Considering their surroundings, they should assume that people are going to take care of service people locally, especially when they’re paying $40000 a month for a 1bedroom. They need new management and a complete overhaul, that place can be a goldmine with that kind of privileged location, but you can taste the lack of motivation there and vibe is awkward for nothing. With good food there should be an issue."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSFJtSmZWWEl3YW5OWVdWZDJSSFIzZWkxdVdFRRAB",
            "text": "Went for my birthday brunch. Everything was soooooooo delish! Camila was the best! All her recommendations were spot on.! Id certainly come back! Oh, and that red Sangria! TOP TIER!!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdFREaERkRVJTU0d0bGJWOVVjWGRIT1hSU04wRRAB",
            "text": "When I walked in I was told I can’t wear my hat but there is no dress code posted anywhere, not even on the website. People are in here wearing shorts, t-shirts etc but I can’t wear my hat. After being seated I asked for a drink menu because none was provided, when I got the menu I waited almost 10min to even order my drink and that was only because I flagged the waitress. My drink was hot and my cup was sticky. I ordered the crispy chicken that came with fried rice, when I got it everyone at my table thought I only ordered chicken because you couldn’t even see the rice, that’s how little rice was served. The rice had chicken in it which is weird because the breast I ordered covered everything. Rice was also not advertised as having additional elements. Why would I need more chicken? The breast had bones attached to it also weird. During the meal I wasn’t asked if everything was ok or if I needed anything. This place is expensive for such trash service and food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMGQwbENUM2hJT1dkWldpMHRlREkwTUV4Vk5sRRAB",
            "text": "Burrito was dry and bland. The sirloin steak came with a tomato sauce that overwhelmed the meat."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdDRPY1dnEAE",
            "text": "Amazing food and service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGalFXbHVWVVo2Y1dORVNHUXpObUppYUd0ZmNGRRAB",
            "text": "I always have a great time here ! Very cozy staff is very attentive.  Atmosphere is calm and relaxing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aFUxSjJRMmRtU0RkelFWUjNTR2R0Ukd4S1UxRRAB",
            "text": "Great tasting food and awesome service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eVVWbDBiakJCYWpGclFYZFdibTlhYTBsNE9FRRAB",
            "text": "I only had the fried chicken (chicharrones de pollo) ($15) and a pina colada smoothie ($5) both of which were GREAT. I’m not even a pina colada fan or have tried many but OMG it was SO GOOD so addicting i’m gonna miss it/dream of it LOL… 😭 staff was nice and the ambiance is nice, is a little noisy though. and kinda warm since the door stays open."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NGNrNXlPRUZrYTFaSlprUlVVelpvZVZKWlUzYxAB",
            "text": "One of the best restaurants I’ve been to in a long time!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MmFrWkVWalZPTFRkVlozTjROa0UxYWxWa1YxRRAB",
            "text": "Horrible customer service.  I am shocked at the attitude and unwillingness of the waitress and don’t ask for a manager because no one is there. Apparently the kitchen makes the decision.   Bad experience and walked out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQ1dITmlXWGxLTXpGcU9FRnlkVE16ZUhodlVWRRAB",
            "text": "Great food and service and it's not over priced"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbGRrd3lSMlJRWWkweE9UbHpWbk4xYWxCdGNHYxAB",
            "text": "I visited this restaurant with high expectations, but my experience was deeply disappointing. The food was decent, nothing extraordinary, and the service was adequate. However, what completely ruined the evening was the shock at payment time. The prices we were charged did not match those listed on the menu. When I asked for clarification, I received vague responses and no clear explanation. This lack of transparency left me feeling deceived and disillusioned. I won’t be returning or recommending this place. It’s a shame that what could have been a pleasant experience was marred by such dishonesty."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNWMzWnVlamhpV2xwZmEyeE5SbnBvWlhCR1duYxAB",
            "text": "If you’re going to any of the Blend locations, expect to eat swell. I got the chicken, rice, beans, and plantains. Left no crumbs, and it’s a pretty decent sized portion for the price/quality of food. This location definitely has good tunes to bop your head to."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keExXaGtSRXN3ZEhWMlVqUTFTbk41UVZCaVZWRRAB",
            "text": "Authentic Latin food with so much flavor . The restaurant is lively and the staff as well . Their take out menu is great also . Quick pickup and the same amount of food they give you in the restaurant they give you for takeout ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNGVuVndSRXhoU0RCV1NFcHVYMUpYZEhOUmNIYxAB",
            "text": "Perfect spot for a celebration dinner."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNWIwbFJhMWhwVm01Q2RHRkdheTB3U1U1UmVXYxAB",
            "text": "The service was good, but the food was seriously lacking.\nThere was no intention behind the flavors — not even the basics like seasoning. It felt like the food was cooked just to get it done, with no thought given to taste.\n\nI ordered the steak ($36), and it literally tasted like nothing. My friend had the fish… we both stared at it and laughed — it didn’t look or taste right.\n\nHonestly, the food had no soul. Disappointing, especially for the price"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZlgzVXljamMwVGtaRlJqbFViRjlaTFVKMlkwRRAB",
            "text": "My partner and I used to make this our go-to dine-in spot in our neighborhood, but that has changed. The last time we went, the service was not up to par. They attempted to get away with a mandatory gratuity fee of 20% on the bill despite that it was only a party size of 3. If one cares to read the size 8 font at the bottom of the menu, this is a new development-- and it's only supposed to be 18% for a party of up to 4 and not 20%. We typically tip 18% anyway, but the lack of transparency and forthrightness left a sour taste and made the meal far less enjoyable.\nThe maître d' was also inattentive, playing on her phone by the door as we attempted to flag someone-- anyone-- down for the check. Eventually, a member of the waitstaff had to get her attention after about 5m-- enough time for my partner to go to the bathroom and come back, only to wait some more. This is the sort of service that comes with mandatory gratuity, I guess.\n\nFood also took longer than usual to arrive and drinks were also slow, despite there were only 3 parties totaling less than 14 guests in the restaurant. As we were winding down conversation, there was a basket of yucca fries with about 3-4 pieces left. I don't know what possessed the waiter to clear that dish from the table, but without even asking if we were done, he just came in and took it away enroute from clearing another table without barely breaking his stride. I couldn't even get a word in.\n\nAll in all, it has fallen quite far from the service and atmosphere since we started frequenting 6 months ago. We have started ferrying to the city or venturing up Astoria for our weekend brunch dates. There are other places that are imposing mandatory fees, but they announce it with large signs and larger font at the top of the menu while still providing good service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeWIyNTBXRWRrUVY5cVRHZFhOSEF3WW5OZmQxRRAB",
            "text": "we were there with our co-workers and we had great time. Foods and drinks were good. we enjoy the time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Jd05GZG5ZWFJqTVhocVJGbEJWMjF4VmtwdlYzYxAB",
            "text": "Food was so flavorful. Had the pernil with rice and beans 5/5.. beef tacos 4/5! Sangrita drink and frozen margaritas 4/5! Def look forward to going back. Great alternative if you don’t want to spend as much or wait for blends on the water. More casual. Great happy hour!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMGJXczJSa2hCYlZSRFFVMTRjVmxpVGw4NVpWRRAB",
            "text": "Food is always great when we go there I only have one problem that I really just don't like ,,I get it I understand that you have to put the tip on the bill but it shouldn't be 20% You should be able to change it to whatever you want.. what if the service wasn't that good or whatever the case might have been it should definitely not be on 20% You should have the option of changing the tip amount or the business should at least put 18% or 15% and the customers give the extra...  and also if I didn't look at the bill I would have never known that the tip was included bc  no one said anything and also  there was a couple of items on the bill that was added on to my bill that I never ordered and had to come off. It's a good thing the girl gave me a printed receipt so I was able to look at it. The food was good but this has to be rectified or unfortunately I may not come back as much as I like the place  thank you very much"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRFkzVlVXa1J0YkUxNlYxQmpXRmxCT1ZSeGNFRRAB",
            "text": "got asked to leave for reserved seating after spending quite a bit on dining and drinks"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVldGaHdNRUp1VjBWYWVUUk5RbWRQWldSaWVHYxAB",
            "text": "An old favorite has fallen from grace. The tuesday, 6/24 evening crew was terrible from bartender to waitress. The restaurant is overwhelmed with one server who asks the bartender to constantly come to the floor to assist her with everything. took me 30 minutes to get a water as I watched my bartender take shots with this usual customers, the only people he tended to. The host tried her best to be apologetic but as someone who was been coming to this location for years - everything as of lately here has been extremely underwhelming and unfortunate"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQX3ZxWlhEeExtb1lREAE",
            "text": "Our meal at this place was delightful! The portions satisfy hunger, the preparation is careful, and flavor is good. Employees here deliver service that truly amazes. This place combines nice surroundings with warm people. Your experience here will satisfy you."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWmJGQkpOWHB6YWtKMFVuaG9TbFpJVlROVlUyYxAB",
            "text": "So here at blend Lic, Miss Juanita, the best server in waitress ever OK best food here. I know the spot you need to come the crispy arepas A1 drinks all around great service must visit"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xa2RFWnVWVk5sU0RndFJFYzROSGhKUzFWRU5IYxAB",
            "text": "Unfortunately, my visit to this restaurant was disappointing. During our meal, the manager interrupted my friend and me to push drinks and a reward program, which felt intrusive. On top of that, an automatic 18% gratuity was added without notice, and we were not given a printed bill to verify the charges. Not the experience I was hoping for 😬"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOeVEwZFhzX3VxS193RRAB",
            "text": "I came to Blend for a business meeting and expected a professional, welcoming environment. We started at the bar and ordered drinks while waiting for our colleague. Once they arrived, we moved to a table, continued our meeting, and ordered additional food and drinks. Altogether, we spent nearly $200 during our visit and were respectful throughout.\n\nAs we were wrapping up our conversation—not being loud or disruptive in any way—the waitress abruptly came over and told us we needed to either move or leave. It was shocking and frankly insulting, especially considering how much we had spent and the fact that we were still finishing our drinks and discussing business.\n\nWe decided not to argue and instead took our money elsewhere. To make matters worse, we later called to speak with a manager about the situation. The person who answered first told us the manager was “on the way,” then a moment later said he had already left for the day. That level of dishonesty and lack of accountability only added to the frustration.\n\nFor a place that presents itself as upscale, the customer service was unprofessional and disappointing. I won’t be returning—and I certainly won’t be recommending it to anyone looking for a place to hold a meeting or spend their money."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKN2trY0tZMDk3T3p3RRAB",
            "text": "Good spot to hang out and to eat."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMU0ya3hVVmhXVjJjekxUSjNXR3hTYVVwdFkxRRAB",
            "text": "Great family feel, and the service was great. The staff was wonderful, accommodating, and friendly. The drinks were pretty good, too. I unfortunately didn't care for the food too much.\nI found it way too salty. It would've also been nice to have crayons or something for the little ones."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMN1kzNmZ4anBPYy1nRRAB",
            "text": "Went solo for dinner at the bar, had the pulled pork and it was delicious. However when it came to the bill they automatically charged me 18% gratuity and only showed me the final bill. Have not seen such shady billing before, I sat alone at the bar yet they automatically charged and even had at the end option to tip more at 3, 5, 7 %. Crazy to think sitting alone at the bar barely serving the customer they try to sneak gratuity on me. I saw the bar tender input quite a bit on their toast card machine before handing it to me, dishonest and felt scammy. Left without adding the extra 3,5,7% avoiding next time."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcTRyUFFREAE",
            "text": "Beautiful service on time and very responsive. sirce is the best !!!!! great person great energy...  service is amazing she's a beauty gotta love her 😊"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQZmNqTFNxaDl2NVBREAE",
            "text": "Really nice place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNajh1NWV3MXNhRFpBEAE",
            "text": "Menu could use some changes, more variety."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPZkpwb1c3enZ5M0hREAE",
            "text": "Food was very bland and tasteless. Slow service. No attention to our tables."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNVpIWXFBRRAB",
            "text": "I had a good time but the price are to much for to little good is not to much variety of appetizers or food they could do better my opinion"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZLWNhVzVnRRAB",
            "text": "Went to Blend LIC on a Thursday evening for their all day $7 martini special. I was pleasantly impressed by the quality of the food and drinks. My burrito was well seasoned and hot and my fries were deliciously crispy. I got a lychee martini on top of it and a passion fruit mojito which were both well made and strong. The service was really great as well, our waitress gave us good recommendations for food and drinks and was attentive and friendly. I’m definitely returning here for my evening meals!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLXFyalBREAE",
            "text": "Camila was amazing! Food was delicious and sangrita was delicious!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZakltSTZnRRAB",
            "text": "The service was great. Food comforting and delish. Camila is delightful and helpful. Will be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaktpb05BEAE",
            "text": "Great service by Camila. Food and drinks are amazing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZak1pQ093EAE",
            "text": "Camila is amazing! Took great care of us. The Mezcal Margarita was great as was the Gaucamole!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaklqanR3RRAB",
            "text": "Food and drinks and amazing and our server Camila was the best !!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOU1mQnVnRRAB",
            "text": "Great food and drinks! Camila was fantastic!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOU1lMnpBRRAB",
            "text": "Camila was amazing, she saved my life"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOUlmVmtRRRAB",
            "text": "Had such a nice experience at blend LIC. The service Camila gave was exceptional. Food was delicious and environment was lively."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOUlmQUt3EAE",
            "text": "Camila was amazing!! Food was great! Will be back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOUpQZmxBRRAB",
            "text": "camila was a great server & great food!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcnNXUkp3EAE",
            "text": "Went for a quick last minute sit down dinner with my friend. Waitress was super attentive and friendly, professional, courteous. I Was accommodated without a reservation and was given no issues. We had the chicken chunks and entrees blend has been my go to since covid always good food and excellent options. 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdUtXODNBRRAB",
            "text": "Cersei was an incredible server. Very happy and attentive. Food was all delicious and an extremely reasonable menu. We have been to all the blends and we loved this place in LIC Vernon blvd"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfM0pQUmVREAE",
            "text": "Blend LIC is one of my favorite spots.\nThe ambiance is always correct    The food is always outstanding.  Thank you yo Jose, the drinks are always on point and Valeria and Joseline just make you feel right.  Many Blend spots but LIC is my number one."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MFl6M3dBRRAB",
            "text": "I ordered to-go from this spot and it was a great lunch spot! We got the Ropa vieja & Cuban sandwich and it was pretty solid! I rarely try Latin food, so I have minimal expectations, but both my friend and I enjoyed the food that we got here. Their ropa vieja cames with plantains that paired well with their meat. And, the Cuban sandwich was packed with roast pork and ham. Would love to dine-in next time!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfc3RMSEVREAE",
            "text": "The store has a clean setting, would be good for nice get togethers. Vegetarian options are plentiful and portions are big! Food tastes fresh and of high quality. Camila was very sweet and worked very efficiently with good energy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaXFPOXJBRRAB",
            "text": "Me encantó!!! Súper atmosphere friendly, good customer service, had a Sirce P taking our orders, very kind and sweet and attentive with all our orders! Love to come back very soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NlluN21BRRAB",
            "text": "**Giving this 3 stars, might change if I ever come back. **\n\nI have came here with my sister and mother to celebrate my graduation. We had a reservation at 6:45pm and they seated us right away even though arrived a couple minutes early. 10-15 minutes pass and a couple walks in and they get seated next to us. 5 minutes later the waitress attends them even though we sat before the couple. And it was like that the whole night. She never came and checked if we needed any or, to ask if the food was done to our liking. She attended all other tables and ignored us. The food was 1000%% delicious. It’s just a shame that the waitress sucked. If it weren’t for the tip being included I would’ve left $5.\n\nFood: 10/10\nAmbiance: 8.5/10\nWaitress: 2/10"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdU03eFJREAE",
            "text": "The mazorca and bistec de pollo were both fantastic. The chicken alone was probably just average but overall the dish was lovely."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBanBUSjdBRRAB",
            "text": "The food is amazing, I got the tapatizer sampler which comes with maduras (sweet plantains), chicken chunks, 2 empanadas, fried calamari and 4 pieces of nice sized shrimp.\nEverything had good flavor and cooked just right.\nA must try if you are in the area!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMnE2bFB3EAE",
            "text": "The food is great and the presentation is incredible, just one thing, they never send me utensils and the last time the pernil had too much skin."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNDQtR193RRAB",
            "text": "Blend on Vernon has great food and a nice ambiance. I recently visited twice in one week and met Valeria, Brian, and Stephani who gave us such a great experience with impeccable customer service and attentive care! I highly recommend for lunch and dinner!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcEtTd2RREAE",
            "text": "It was a fantastic experience. Camila provided exceptional service to my husband and me, always attentive and mindful of every detail to ensure our visit was perfect. Her kindness and professionalism made us feel very welcome. Definitely a place we highly recommend and will return very soon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMHYzcHlRRRAB",
            "text": "Been here a few times and always enjoyed the food and drinks.  Some evening a bit noisier than others.  Brought my mom, aunt and wife.  Most recent was on point for everything we ordered.  Very friendly waitress and staff."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDdklLemVBEAE",
            "text": "Great drinks and tasty food. But they are not really well prepared for brunch. Like pernil was not available and frozen drinks were not really frozen just yet, and it was already 1230 or 1pm when we arrived."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydzQySG1RRRAB",
            "text": "Sirce was the sweetest waitress I’ve ever had. Super cheery and sweet and very helpful . All waitresses should be more like her\nFood was delicious too and the manager kept walking by to check on everyone , so sweet as well. It’s my fav Blend by far"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdXBHdGRREAE",
            "text": "This is my first time here. I have been to the 2 other ones. By the water and the other Astoria one. Portions were good. And prices were good for me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMbW82R1l3EAE",
            "text": "This place was amazing! Service was outstanding! Sirce was an amazing server! She made sure to check on us and met all our needs from margaritas on the rocks because the frozen system was down to making sure we later received our frozen drinks. I would definitely recommend this place!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwcmNLbnNBRRAB",
            "text": "Not a large amount of vegetarian options, but the food is reasonably priced and flavorful. We went during a pretty busy lunch period, but the server was efficient and friendly. We especially enjoyed our appetizers, (empanadas and corn were my favorite). Good atmosphere and diverse clientele for an LIC restaurant."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNHBxTjBBRRAB",
            "text": "Went for their Thursday special - there was 3 tables including ours the whole night.. not sure if this influenced why they charged us full price but apparently a frozen margarita isn’t part of their margarita special…server failed to mention that when we ordered. First time I ever had an issue going to a restaurant for a special where frozen would be full price and not be told when ordering."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcEltS1lREAE",
            "text": "I enjoyed an 08incredible experience at this restaurant, the food was delicious and the dishes were excellently presented. I went with my wife and Camila, the person who served us, gave us very good recommendations. Her service was 10/10."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJb3AtZnFBRRAB",
            "text": "Nice place, food is delicious drink are out of this world especially de Sangrita ...highly recommend"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJeHRIeTJBRRAB",
            "text": "Went for a quick dinner on NYE. The beautiful,  curly black haired server was excellent. The food and drinks we perfect. I especially liked their version of Fried Calamari with Maduros. I also had their paella which was really good too. I will start to become a regular."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNF9fNDFRRRAB",
            "text": "Blend on Vernon is a great local spot in LIC. the vibe is cool and the staff is warm. I really enjoyed the burger and fries! Valeria, Stephani, and Brian were great! I highly recommend coming by if you’re in LIC!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldGYzYktBEAE",
            "text": "This is a great casual Latin-fusion cuisine eatery situated on bustling Vernon Blvd in Hunters Point. Reservations aren’t required and walk-ins are welcome. Came in at 8pm on a Saturday night and only had to wait about 5 minutes for a table. Casual atmosphere with seating inside and outside in a covered area on the street.\nThe food was reasonably priced and the food was pretty good. I had the tilapia, a side of chips and guac, and a Patronjito cocktail (very boozy). For dessert, we ordered the chocolate cake, which was a bit underwhelming to be honest.\nThe service was a bit on the slow side because there was only one waitress for the entire restaurant (for both inside and outside seating) on a Saturday night and she was stretched pretty thin. She had a great attitude and was very nice though. She even both single-handedly presented a birthday cake and sang a Happy Birthday song (in a bright-eyed, very chipper way) for the table next to us.  All I know is: Whatever they’re paying her, it’s not enough.\nOverall, I enjoyed eating here and will definitely be coming back for more casual nights out in the neighborhood.  I just hope that they hire another person to help out with serving on busy weekends."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaGF6TC13RRAB",
            "text": "Nunca había asistido a esta cadena de restaurantes “Blend” pero esta sede estuvo estupenda, tuvimos el PLACER de ser atendidos por Sirce, una chica demasiado amable, atenta, CARISMÁTICA y con una hermosa SONRISA que fue imposible no conectar con ella, la comida estuvo buena, los cócteles deliciosos!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdmFIblJ3EAE",
            "text": "It was such a disappointment. I really loved Blend on the water so came with very high expectations. However to start with, it took more than 45mins to get our dishes when literally there were only two tables in the restaurant. We ordered…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdFAzWElREAE",
            "text": "Great location amd interior/atmosphere of the restaurant. The food was tasty and the dessert was immaculate. The reason I give it a 2 star is because the service from the staff was a disaster. Service is what makes or breaks a resturant.…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeExQZ2NBEAE",
            "text": "I had a wonderful dinner with my fiancée; Camila’s service is very sweet and professional. Now, let’s talk about the food! Absolutely delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cUxXTmdBRRAB",
            "text": "Great service, great food, great portions, and good prices.\n\nOrdered the Arroz Con Pollo and it was highly flavorful. Others at my table ordered Pernil and a steak sandwich, both of which were apparently delicious. The place was lively with music and lots of customers.\n\nWorth visiting if in the area. 10/10"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbDlubGlnRRAB",
            "text": "This place has some of the best Calamari I ever had, the atmospheres real laid back and chill. The decor is very modern and nice. The service was exceptional and the food was cooked to perfection. I also had the chicken salad and that also was to die for. I can’t wait to go back her to eat it was worth every penny."
        }
    ],
    "reviews_count": 79
}