{
    "name": "TRU Astoria",
    "place_id": "ChIJe0HPI2ZfwokR6lph0iPZIyE",
    "grid": "QN1",
    "address": "35-19 Ditmars Blvd, Astoria, NY 11105, USA",
    "rating": 4.3,
    "user_ratings_total": 1147,
    "phone_number": "(646) 878-6000",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeGJUVXdUbXh3YVdoelJHNUhiM0I1Wm1aMlMxRRAB",
            "text": "Lovely IG photo spot and the food was cool also..."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padFFYSlRlRTlJYmtWSlFWTnplREp6TFVkbVYzYxAB",
            "text": "Nice place good music friendly staff"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NVJVOHpTVk14ZFRGSE1GOW5aRkJYVlZka2IyYxAB",
            "text": "Terrible. Everything was dry and tasted bad. Overpriced and awful. Don’t come here."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ob1FXWnlja1EzTVdSNE5WOXhNREZvWDNrMFprRRAB",
            "text": "The food is good, i recommend the ceaser salad."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocmRHUkxUMjg0UWpCQlYzWTFWbEZLZUZkYVJGRRAB",
            "text": "Feels like home"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWmNqaGxMV04yVGxWWmFWbE1kakJYYVRCRVdsRRAB",
            "text": "BELOW ZERO!\nCITIZENS BE AWARE!!\nWe just left from this place.\nThe waitress took our order, she forgot it saying that the kitchen messed up with the order, she came again asking us what did we order, we ordered again, we had 3 plates, she brought 2, she forgot my wife’s.\nShe didn’t bring to us forks and napkins. I went to a nice bartender and he gave me the forks and napkins. Then the waitress mixed up our coffees. I went inside to the nice bartender and he made new coffee for us.\nWhen I asked for the manager she told me that there is no manager in this store and she start screaming to us in front of the customers but the most important in front of our 3 year old daughter.\nI have nothing to say.\nAlso I paid in full."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KYVJIaHRNVVJqWm1ZMGEyWk5TbmxEY1dsaU9FRRAB",
            "text": "The server was very rude and gave my group and I the wrong bill. Took about 45 minutes for the server and owner to come to a resolution."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NGNtcGlkWEYxWkdSNVVGSTVZV2xoT0dGSE9YYxAB",
            "text": "The high ratings across review sites reflect real quality. They ensure quality at the ingredient level. You get good value with their substantial portions. Restaurant workers provided the expected level of good service. My experience was thoroughly enjoyable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSVpVOXdVVVl3WlVwbFduWkdSRWd0UzBwRFZWRRAB",
            "text": "Thanks Patra you were wonderful!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaFprRTJTWGRPVjFReWVVSXhhVlUzTkZWbE9YYxAB",
            "text": "I recently visited this restaurant and had a mixed experience. I ordered the steak and eggs while my girlfriend had the burger with fries. She really enjoyed her burger, and the fries were fresh and well done. The potatoes with my meal were seasoned nicely, and the eggs were fine—pretty standard.\n\nUnfortunately, the steak itself was disappointing. It was bland and not cooked to the temperature I requested, which really took away from the dish. On top of that, I ordered a Coca-Cola that came out completely flat, tasting more like flavored water, and it cost $5, which felt unreasonable for the quality.\n\nOverall, while some parts of the meal were decent, the key items I ordered fell short."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSR2NIcGpWMmROYjNWTE0xcFlVVGx2WTFnNE1uYxAB",
            "text": "The fact that I have to come here to write a comment means I had the worst experience ever. Why did my french fries, taste better than my burger! The girl with the curly blonde hair awful, Super awful. If she’s your waiter. Just ask for someone else. She didn’t come check up on us once we were ignored the whole time, my boyfriend had to go ask the bus Boy For Drinks, Condiments, and the check he basically was our server because she didn’t even come once. My boyfriend had to ask the bus boy for 1 coke and she charged me for 2 didn’t even say anything because I just wanted to leave that’s how bad it was. Maybe she’s racist a little bit, but Definitely ask for another server. Let’s work on our customer service so no one has to feel this way!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbFIwbDFiR1JRZFRaQ01FcHpNMTlSZEVveVptYxAB",
            "text": "I wanted to give this place a second chance but I was disappointed once more in spending my money here. The service staff and the ambience was great, but the food did not meet my expectations. The Branzino I ordered had an overwhelming smoky almost burnt like taste and the side of spinach was over seasoned. The lamb chops were requested to be well done but were a little bit more than well done. I didn’t bother getting any cocktails since I recall them being overly sweet during my first visit. I wanted to like this place and it has much potential, but food was not worth the expense."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKc2VsTnFTVE5SVmw5RFlUaFRTMXBzYlVrelJWRRAB",
            "text": "Great spot and our server Daysi was amazing. Knowledgeable and very sweet."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rdGNqbE9TekZJVVhOTmFHTkJXWFY0Um01UGFtYxAB",
            "text": "Orderne unas lemon potato’s para una fiesta y wow que delicia :)"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRVVFZFpUM0JGUkhWbGFFdzRVM1V4YmxkcE1XYxAB",
            "text": "I had an extremely disappointing experience at TRU Astoria. The staff appeared frantic and disorganized, running back and forth in a way that made the atmosphere feel rushed and chaotic. I had brought a birthday cake for the occasion, but despite multiple polite reminders, it remained in the kitchen for nearly an hour and was never brought out in a timely manner.\nDuring this time, I observed that the all-white table next to us received their food and service promptly, while my table, made up entirely of Black guests, was consistently overlooked. This disparity in treatment was noticeable and deeply disheartening.\nUnfortunately, TRU Astoria reflects a larger pattern I’ve seen with certain “upscale” restaurants that have emerged in the neighborhood following gentrification, establishments that appear to cater to a very specific demographic while making others feel invisible. I cannot recommend dining here, and I would encourage spending your money at one of the many Astoria restaurants that value and serve all patrons equally."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMmFHaFlRVU5pTTJNeFNWTndORXhHTUVOc1VXYxAB",
            "text": "This places sucks what happen to Tru it’s TRULY a disappointment now ,  where are the customers now I felt so lonely on a Thursday night and to make things worst  I asked for oysters they didn’t have , I asked for my favorite drink and it was totally wrong , the server said there’s was a new owner now  and that’s things have changed\n\nI clearly see now why it’s empty  wouldn’t waste my time here again   What a shame been coming here for years"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNM1IxQTJkbVp6WVVsRk1UWXRjREJ6ZG5SdU9IYxAB",
            "text": "I went for girls nights and had the best food ever!!! I would just like to point out that the servers were extremely welcoming and kind. The ambiance was just warm and magnificent!! I had a virgin leech and burger... safe to say I was very satisfied that I even order another 2 leeches. I also had a chocolate dessert and it was sooo good!! Will definitely be coming back!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkblNGSndjMk5yVVZCR2NGVkVSbEZwYzNCWmFGRRAB",
            "text": "Horrible Service.\nWe waited at our table for 25 minutes without being greeted or offered even a glass of water. After giving it an extra couple of minutes, we simply walked out. Completely unacceptable. Please improve your service, no one should be left sitting that long without acknowledgment."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWVNXMWFSRmswT1c4NWRtUTJhWGhCTnpGQlgxRRAB",
            "text": "Cruz makes the best drinks with a passion. Highly recommend to try the rock shrimp and the arroz chaufa. Best experience I've had on a weekend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWWJXaE9TVWswWW5CWllXcHpaRXBtVlhsWU9FRRAB",
            "text": "Came across this place and was blown away. If you’re in the area definitely check it out Cruz is an awesome bartender and has amazing recommendations for delicious cocktails."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOT1RsaERaMmRXUzBaQlFUWk1YMVZLVkRJemVVRRAB",
            "text": "La comida es pasable pero la atencion es mala ademas me hicieron un doble cobro cin mi tarjeta 😠"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcGNqQkdlVUphWkVsb2RubEZOWEY2TkRCeFltYxAB",
            "text": "I visited this restaurant for the first time I have so much fun thanks to Cruz the bartender the best time and the cocktails on point thank u so much …"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWGMycHZUa0l6TTJKcmIyb3pXREpvVkZvd1MwRRAB",
            "text": "See Cruz for the best mojito in Astoria"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSE5rNTRRVmxMVWxOcmJHOHRlRmR1TFZVelJFRRAB",
            "text": "Experiencia muy mala deben de arreglar el sistema por que cuando fuimos a pagar la cuenta el sistema no recibía tarjetas , le intentamos\nCon varias ! Vaya sorpresa no se pueden realizar pagos manuales ! Se logró por fin hacer el pago en el estado de cuenta aparece debitado ! Las meseras que no ellas no le apetecían ! Uno como cliente está pagando ! Deben de mejorar esa parte una experiencia muy mala ! No recomiendo este lugar"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wa2RYUldjbkJETVV4YVIwMXdjRXRrWTJWWU1FRRAB",
            "text": "From the moment I walked in, I was impressed. The ambiance was warm, inviting, and stylish perfect for both a date night or a night out with friends. The staff was attentive without being overbearing, and they truly made me feel like a valued guest.\n\nNow, the food… incredible. Every dish was bursting with flavor, beautifully plated, and cooked to perfection. You can tell they use high-quality, fresh ingredients. The lamb chops were easily one of the best I’ve ever had\n\nDrinks were on point too. The cocktails were creative and well-balanced, and the wine list had great selections across all price points.\n\nI’ll definitely be coming back and bringing people with me next time. Highly recommend this place if you’re looking for top notch food and service in a great atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxYU1WWlNhRjlETnpneFdVWmZibU40WmtOaU5YYxAB",
            "text": "Amazing staff. Great vibes. Food and drinks were excellent. Great spot"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNVRIUm5TRmRpTWpKRWMxZENiRTVFYkd0eWNGRRAB",
            "text": "Went by with a friend to check this place out, but at 3:30 PM the doors were still locked, even though their posted hours say they open at 3. We ended up standing on the sidewalk looking for an alternate plan."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSVVuRkNObFJ5WnpoYVpHVlFTbVkyVXpkbVlWRRAB",
            "text": "Terrible and overpriced. Much more decent restaurants on the same ave"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMlpsZHNRVUk1Ulhrd2IzUkJlWGR6V2paUE1YYxAB",
            "text": "The restaurant has a great atmosphere with good music and a welcoming vibe. The service was attentive, and our server was friendly. I ordered the ceviche, which had a tasty flavor, especially the octopus. However, the fish pieces were massive, feeling overly raw and almost rare inside, not like the smaller, well-cured pieces you expect in ceviche, properly cooked by the juices."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNU0zRTJhV0YzVWtRd1VHSlNhR1ptVTFwSVRFRRAB",
            "text": "Me and my friends went to tru Astoria for brunch today the weather was amazing and so was the service the blond server I think her name was Ashley she was so sweet and fun we had so many laughs she also gave us great recommendations and I have to say the steak and eggs were BOMB! Bottomless is definitely the way to go to 😉Come visit tru astoria and ask for brunch!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMWVubHVORFp6ZFMxT1F6aG9OMHhwZGsxTWEwRRAB",
            "text": "Got brunch on a Saturday, great food, amazing deal on bottomless and incredible service from our server Ashley!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOa05YUm1WRVZyVDJWcWNVc3hiMWRGZVVNelRWRRAB",
            "text": "I love this place ! Best food best service!! I love Evan ! He’s ultimately the best and the lemon drops are to die for 👏🏽👏🏽👏🏽👏🏽"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPNnB1WkRRN28tSFN3EAE",
            "text": "TRU ASTORIA NOT TRUE TO THEIR WORD. Falsely advertise their menu and pricing. poor service and management unwilling to compensate to customers"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcWR6VlVWbGRKYVdkVVNHVlVhbm95UjIweWRFRRAB",
            "text": "Great vibes and music, amazing bottomless mimosas"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWVlVMVhlbU55WVhsZlREbFVjVkJOTFhSeVFXYxAB",
            "text": "Enjoyed the place. Food was good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQeXV0dFB5MTRXRlV3EAE",
            "text": "Our server Ashley was super nice and very accommodating, I appreciate her soo much!\n\nThe menu has a little bit of everything for everyone and the bottomless brunch got us good!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPT3Yzc2VSdllyUEVBEAE",
            "text": "Food and service was great, can’t complain"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOemQ1OWZMMEsyb1hREAE",
            "text": "Came to Tru for Mother’s Day with my mother in law and although it was busy the service was exceptional! The food was delicious and they had a great cocktail selection too! Definitely will be coming back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMQ1VuUExBeUxTRkdBEAE",
            "text": "Visited this restaurant on Mother’s Day with a party of three, and it was a complete letdown. Despite the restaurant being at only 50% capacity, the service was painfully slow. We waited over an hour just to get one appetizer — fried calamari — while each of us had only ordered one item.\n\nWhen we asked how much longer the main dishes would take, the staff assured us the food was “coming out right now.” That was another 10 minutes of waiting with no food in sight. Hungry, we decided to leave. We only paid for two sodas and the calamari, which somehow totaled $33 — not worth it at all.\n\nAs for the food itself, the calamari was mediocre at best — I’d give it a 5/10. Overall, the experience was disappointing and the service was unacceptable. Definitely not recommending this place to anyone."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdm82WkxOMHA2V1BBEAE",
            "text": "Uno de mis lugares favoritos, la comida deliciosa!! Y la atención excelente 🫶🏽 me encantó celebrar el día de las madres aquí"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJem0yTXpBcTVlczl3RRAB",
            "text": "Came to Tru Astoria for Mother’s Day brunch with my mom and aunt. They loved the food and music! Service could’ve been better — I wasn’t too happy with it — but overall, we had a great time and really enjoyed everything else."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLNk4tcUxTaU1uZnJnRRAB",
            "text": "Waited 30 mins for a tequila soda and glass of red sangria, another hour for a breakfast sandwich and a Tru Burger. There’s no reason for an order to go in at 3:45pm and receive food at 5pm. Servers are extremely inattentive and do not even bring water or utensils unless asked for it. The bill tho? They’ll bring that piece of paper in a heartbeat. Zero stars if I could."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJM2ttdG1RalB1dXl3RRAB",
            "text": "We order at 11:30 only got our food 12:30. Which they didn’t even bring everything we order and we ended up canceling everything that was not brought to us. Waiters are lazy and have attitude. Definitely would not recommend this place to anyone!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJeU9ySjZydDVHUnFnRRAB",
            "text": "Greek night with Niko was amazing. An amazing experience and fun atmosphere like I’ve never had before! Drinks and service were fenomenal as well!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOeUlscWJPaVlhWjVBRRAB",
            "text": "Golden find in queens\n\nAmazing food 10/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvei1TQkdnEAE",
            "text": "Came from FL. Ended up coming twice during our trip because it was so good. Great experience. Food and service was amazing. Cool ambiance. Would definitely recommend 🙌🏼"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvODVDcHBBRRAB",
            "text": "I’ve been coming here for a few years now. María especially has been an amazing server. Props to her for making the experience here greater than what it is."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbC0tMnpnRRAB",
            "text": "Ria and her team are amazing and superstars!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMDlLRnBnRRAB",
            "text": "I had such a great experience at Tru in Astoria, and a big part of that was thanks to our amazing server, Mariah. From the moment we sat down, she made us feel genuinely welcome and taken care of. Her energy was super positive, and she struck the perfect balance between being attentive and giving us space to enjoy our meal.\n\nMariah knew the menu well, offered great recommendations, and made sure everything came out just right. You can tell she really cares about creating a great experience for her guests. Her professionalism, warmth, and attention to detail definitely stood out.\n\nIf you’re visiting Tru, I hope you get Mariah as your server—she’s truly a gem and made our night even more enjoyable!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMXVIMEdREAE",
            "text": "My friends and I traveled to Tru Astoria from out of town with a group of 10+ for our friend’s birthday in hopes of having a pleasant experience here at Tru sadly that wasn’t the case. We were at their establishment for over 3 1/2hrs. Service was slow but, we initially understood for the most part due to the number of ppl in our party however, the waitress rolled her eyes constantly whenever she was reminded of drinks not being received after an hour. She never checked in on us only came over when flagged down. Our food (appetizer included) came out well after an hour and half, no one complained we just tried to keep the mood positive for our friend. The food wasn’t bad, the Chef made rounds and was pleasant. However, we brought a cake in and when we requested for it to be brought out it took almost 40mins. The waitress initially said it would be a while, which I only assumed maybe it was being cut but that wasn’t the case. The manager came over as most of our guest had paid and left but 4 of us remained and we told her the cake still hadn’t come out. She went back to checked and a Man from the kitchen came out, pulled my friend aside and told her her cake was tilted upon arrival (which wasn’t true) and my friend annoyed said she’s put it back in the box, I’ll take my cake home. They instead brought sparklers a sign (spelling her name wrong) and her cake dented, slanted, facing us. We told the manager the top of the cake box was see thru and we by no means brought in a dented cake. She inquired w/ her staff and comped the bill for $80. She was straight to point and we appreciate her but there is clearly a disconnect between her the staff. Mistakes happen we understand but the staff lied. When I went to the bathroom, the waitress (lacking awareness) asked the guy in the kitchen what happened to the cake he said he placed it in the refrigerator and he cake got smashed by items!!!! Yet he came out and said we brought it in that way. The lack of accountability and direct lies told me the character of this place isn’t too sound. We didn’t eat the cake, we didn’t know what happened and didn’t want to chance it. Ruined my friend’s birthday!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIN2VEOG5nRRAB",
            "text": "I live in Charleston, but I moved from NY a few years ago, and Astoria was one of my favorite areas. So, I decided to go back there for my good friend’s birthday, like a trip down memory lane. As someone who loves food (I practically eat as a sport) and has pretty high standards! I have to say, this restaurant absolutely crushed it! I came with friends to celebrate, and wow, what a night! The vibes were on point, the music had us grooving, and the food? Chef’s kiss!!  The octopus, ceviche, skirt steak, and fried veggies were insanely delicious. And the dessert? The perfect cherry on top of an already tasty incredible night.\n\n• I’m a bad photographer, so the pictures don’t do the food justice—everything was even more delicious than it looked!\""
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaU1MLWxRRRAB",
            "text": "I used to be a frequent diner at Tru, but over the last year, the restaurant has gone through several ownership changes, which also brought changes to the menu and staff. We stopped by for brunch today, and while the atmosphere was pleasant, the food fell a bit short. The lobster roll was served a bit cold and had an off aftertaste, which was disappointing. On the bright side, our server, Alex, was very friendly and engaging, which made the experience more enjoyable. Overall, I wouldn’t go out of my way to dine here, but if I’m in the area and feeling hungry, I might give them another try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NS1LWXdRRRAB",
            "text": "The food tasted great. The ice chai was the best I'd ever had (from an american/Indian person). The decorations were very leafy, gold and upscale. Great place for a date, girls get together, or business talk. The waiters were very friendly and quick with getting what we needed. It was only hard to get them a couple of times, but nothing too terrible. They had TVs inside, behind their bar. Very clean everywhere, including bathooms. Overall very nice and if you have the money, I would recommend going here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeDlQQ1FnEAE",
            "text": "The restaurant looks very cute, but the worst dining experience in nyc. We waited close to an hour for our food (ordered very basic food such as French toast and omelets) when the restaurant was nearly empty. When the food did finally come out, it was cold, and the quality was terrible. We had to ask to get water refilled. Would definitely not recommend this place to anyone especially in nyc where you can get so many delicious options everywhere. Very disappointed with our experience here."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OTV2LUxREAE",
            "text": "Food and atmosphere were wonderful! It feels like a cafe you’d find in a European city. Chicken and waffles were incredible—especially with the chicken being glazed in syrup (something I’ve never had before with chicken and waffles). Waitstaff was very attentive for the most part. I’ll definitely be coming back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzd2FyMmx3RRAB",
            "text": "Nice place food was great. Service was excellent wasn’t too impressed with the drinks. The lychee martini was not made correctly. Everything else was wonderful nice hangout spot with good vibes and music."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbnNmdzJnRRAB",
            "text": "Came to this restaurant for a brunch on Sunday. We did have a reservation, but there were seats available regardless. The food was ok, but I think it’s way too overpriced for what they’re offering. I got the eggs Benedict (bread was little burned and the salad was too oily). The ambience is alright."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhNTVmSGJREAE",
            "text": "I came here around 11 am on a rainy Saturday right before the big rush of people who come for their their weekend brunch. There was both outdoor and indoor seating. The waitresses there are incredibly sweet and made recommendations for a couple of my friends. They never failed to refill our drinks and were actually pretty funny!\n\nMy friends and I each ordered different brunch items that came with an assortment of eggs, waffles and home fries. It was very inexpensive and the portions were decent sized. Completely worth it for the ambiance as well!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMll6eVJREAE",
            "text": "I came to TRU for a weekend brunch. It was a really nice and open atmosphere, and I was able to get seated right away. I ordered the Nutella pancakes, berry french toast, and home fries. Also ordered an Americano and a mango smoothie. All the food was so delicious!! And the portion sizes were very good for the price. I would highly recommend this spot for anyone looking for a nice Astoria brunch spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNmF6TlV3EAE",
            "text": "They weren't terribly busy when we arrived, but the music was so loud we could barely hear one another at our table. My girls and I all ordered the same thing at the same time. My order came out and was cold. I couldn't get the only waitress' attention - as it had gotten busier while we waited. She came over and asked if the girls' food had arrived (obviously not) and she checked with the kitchen. They didn't notice the leading 3 before the order and just made one. The girls' orders were warm at least. After we finished, it took me over 15 minutes to get the waitress' attention to get the check. The girls had wanted to try this place for the $25 brunch, but if anyone mentioned it, I couldn't hear it over the music. With no alcohol and no refills and no sides, our bill was $98."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSazhEZElREAE",
            "text": "Ambiance (4/5): The inside is bustling with very loud dance/party music! Be prepared to be yelling to converse with your table guests. Very trendy. When the weather gets nicer, they open up the glass walls and the whole establishment is open.\nService (4/5): We had an attentive service during our $20 bottomless brunch but we could have used more refills on our tiny champagne glasses. The food came out pretty quick after ordering.\nFood:\nPulled pork benedict (4/5): The pulled pork was very moist and seasoned well and elevated your standard eggs benedict. I had requested that my French fries be cooked well done but they came just the same as everyone else’s and not crunchy whatsoever! The fries are very bland and are thick cut."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBanJ2V3lnRRAB",
            "text": "This was my first time at Tru, and let me tell you they did not disappoint! From the moment I walked in, Maria made me feel like a VIP seriously! I was beyond impressed, and her recommendations were spot on.\n\nFor the appetizer, we went with the chicken and beef empanadas, and they were absolutely to die for. The beef empanadas weren’t your typical ones they had steak chunks, which I loved! The shredded chicken was perfectly seasoned.\n\nFor my entrée, I had the steak Benedict, which came with a mangu croquette. I had never heard of it before and was a bit skeptical, but let me tell you—it was AMAZING! I wish I had some right now.\n\nMaria also kept the mimosas flowing literally refilling them every minute (I’m not even joking!).\n\nI absolutely loved everything about this place, and Tru will definitely be seeing more of me. I can’t wait to come back for dinner!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDdTRhM2FBEAE",
            "text": "Ordered the crab benedict and it was so delicious ! One of the few places that offer it. My husband ordered the western omelets and switched the ham with turkey and said it was savory. Service and seating was clean and thorough. Definitley a good brunch spot in Astoria"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NjlHRWxRRRAB",
            "text": "The place gives NewYork feels, the lively vibe. One of the finest place in NewYork with street view with a nice music to handout with friends and family. The food is presentable and serving of drinks is good. The restaurant has both indoor and outdoor seating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MDhYSURBEAE",
            "text": "Nice mediterranean Bar/Cafe with a very European vibe.  Not very crowded compared to other places in the neighborhood and we were pleasantly surprised by how good the food was. Good cocktails with a large drink menu,  and a good specials list. The normal menu was surprisingly more American but the specials were all mediterranean."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMGNPdkpREAE",
            "text": "Nice atmosphere. Friendly service. The server was really helpful when we were waiting for a table. The food is great, and the proportions are worth the price. The bottomless really goes a long way. Good for groups."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNnB6WUJnEAE",
            "text": "The food was amazing, the service was okay but very slow, we wait like an hour for the food and almost 30 minutes for dessert but the server was nice and very attentive. Coming back for the brunch!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxeTYzZjhRRRAB",
            "text": "a variety of good things to pick from the Menu .  We had last week the Salmon Burger it's delicious. Also can't go wrong with  the Omelets , My Mom and I  had on this visit the western Omelet . When you order coffee or tea a delicious butter cookie cookie is included.\nA big shout out to Stephanie the best service  👏🏾 ♥ 👍🏽 friendly warm and Inviting.\nAlso thanks to Brian ."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbU1ycnNBRRAB",
            "text": "Was there over the weekend with my friend and as you can tell you everything we had tasted so good\nMust have the the grilled octopus, we also had the tuna tarta and the spicy rigatoni 🔥 the music was perfect it was a vibe we will be back again very soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6d0tDMHhnRRAB",
            "text": "Dropped by here before my flight to grab some brunch and I’m so glad that I did. Dimitri behind the bar was so nice and attentive. He made me the best oat milk white hot chocolate with a shot of espresso. I enjoyed the Nutella French toast, the fruit was so fresh and crisp.\n\nThe menu has everything from salads to sandwiches to pizzas and their breakfast menu is also available until 5pm for my fellow late risers! Their drink menu is extensive ranging from cocktails to every kind of coffee drink any person could dream of. Stop by and get a coffee from Dimitri! You won’t be disappointed! Neo was also such a great manager coming by to check on us!\n\nThe venue/ambiance is so beautiful with large open windows allowing fresh air through, a refreshingly modern aesthetic with the VIBES on the music going. Don’t walk here, run!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjdlpTUXFnRRAB",
            "text": "My wife and I went for some drinks and really enjoyed this place. The drinks we got were great and well put together, service at first was not very attentive but then eventually came around. Great ambience with awesome music. I’d certainly go back to try the food and based on that would update my rating to a 4-5."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHenVDTTVRRRAB",
            "text": "TRU has a wonderful atmosphere along with great waitresses and waitress.  The food is great.   Overall a deserving 5 stars.  Stephanie is awesome.  See how she surprises a person on his birthday.  She also checks outside so we do not get falsh flooded in.\n\nUpdate June 18, 2023: Still great"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNUp2azZ3RRAB",
            "text": "My friend's and I went fir brunch. The service was great. They seated us right away. We were serve promptly. The waitress made sure We got every last drop of our 90 minute bottomless drinks which we're delicious. The food was fine. Our…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRZ3JXUDhBRRAB",
            "text": "Loved this place! Came here for my birthday brunch a few months ago. It was pretty short notice but they were able to accommodate a reservation for 12 with only two days notice. Very fun lovely atmosphere. Happened to go on some sort of…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbjh1ZzV3RRAB",
            "text": "This place is great.\n\n1. I sent a message regarding a last minute reservation and received a response within 5 minutes, great way to start my experience with them.\n2. The food was delicious.\n3. The young lady serving our table was so nice and accommodating and my glass was never empty.\nPerfect first experience here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0a3NDZ1RBEAE",
            "text": "I had brunch with my friends on Sunday and we all loved it. the food was delicious and came out pretty quick, I had the crab Benedict with yuca- best decision!\n\nEven though the place was packed, our server Delilah was amazing, super friendly and kept checking on us to see if everything was good.\n\nDef I’ll be back and will recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeVp5QUxnEAE",
            "text": "Food, Service & Atmosphere at its finest!! I always enjoy going back there for several years now! Jose is the best! Thanks for serving us!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5cTVLYjFnRRAB",
            "text": "we went to celebrate a friend's birthday, a place indicated by Anderson who works there, I ordered a Long Island Ice tea, which was perfect, a zucchini croquette was super fresh and an extremely fresh and crunchy Calamary, the Calamary was…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRN1BqblN3EAE",
            "text": "We had the pleasure of being served by Maria, and she was absolutely fantastic! From the moment we sat down, she was warm, attentive, and incredibly professional. She made sure we had everything we needed, checked in at just the right times, and had such a friendly and positive attitude. Her knowledge of the menu and recommendations were spot on, and she truly went above and beyond to make our dining experience special.\n\nIf you have the chance to be served by Maria, you’re in for a treat! We can’t wait to come back and hope to see her again. Thank you, Maria, for your outstanding service!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLdjhDVlJBEAE",
            "text": "This restaurant has hands down earned a five star review from me.  I have been here a few times to hang out and drink some water and tasty drinks.\n\nToday I ordered the Shrimp Scampi.  First, the staff was over the top great.  They made me feel very welcomed.\n\nAs for the Shrimp Scampi, the shrimp was very tender and cooked to perfection.  Every detail of this dish was to die for.  Down to the bread that was nice and soft.\n\nIt is worth every penny and I will be back.\n\nPrevious Review 1 Star:  $17 for this?  You have to be kidding me.  So upsetting.  It did not taste any different then anything I could cook at home"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOGZlZHh3RRAB",
            "text": "This was our first time dining at TRU Astoria and it was very nice. We celebrated a birthday that night and our waitress Orianna was AMAZING!!!!! She really made it special for the birthday girl. She was upbeat, patient and very kind. The drinks and appetizers were very good, but the entrees were ok. The salmon burger was overdone and the pasta was just average. The brick chicken was great and the fries and calamari were yummy.  I definitely will return for happy hour"
        }
    ],
    "reviews_count": 81
}