{
    "name": "Tootles & French",
    "place_id": "ChIJDxoRVI5fwokRe7CFVS6EWCI",
    "grid": "QN1",
    "address": "36-15 Ditmars Blvd, Astoria, NY 11105, USA",
    "rating": 4.6,
    "user_ratings_total": 322,
    "phone_number": "(347) 642-3012",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMGNWSTNUVGR5V1ZrMVJFbHpWWFJzVWxSTlRuYxAB",
            "text": "Truly my favorite restaurant in the neighborhood. First of all, they have an entire Negroni menu. My favorite drink and I can choose from so many variations or get a flight! The rest of the cocktail menu is amazing too, and they change it often so you can always try something new.\n\nThe food menu is always great. The burrata sandwich and the Mushroom Fettuccini are my favorite. I don’t even really like mushrooms, but they accidentally served me the wrong order (mushroom fettuccini) once and I took a bite before they noticed and replaced it with my correct order. It was so amazing I kept ordering it.\n\nFinally, the service is always fantastic. Friendly and attentive. We eat here 3-4 times/month and will continue to do so because every part of the experience is perfect."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OU1dteEJSMFIzTTFKblRqQnlWRGRZU0cxUk5VRRAB",
            "text": "Came here for a cozy girl’s night and it was perfect! My friend ravvvved about their fried olives which wasn’t something I had even heard of and they were amazing! We also got their squash potato soup and truffle fries and it was all so amazing. Their bubbly wine drinks are so good too!\nStaff is really friendly and the ambiance is\nbeautiful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobVVXbFdZMVZTZHkwd09EUkJXR2MxYldoMVVsRRAB",
            "text": "I really wanted to love this place, but our experience was disappointing. We waited over an hour for our food and the drinks also took a very long time to arrive. A table was seated after us and they got their food way before us. They apologized to the table next to us for their delay and even comped their meal. On top of that, $7 for an untoasted English muffin felt steep."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd1YyRjRRemh6VWtwSmRVcFNPVVZsV0dkd01IYxAB",
            "text": "Terrible service and food lacked flavor. We had reservations and they crammed us into the smallest table. Understandably they were busy, but the way we waited to put in our order for food (didn’t even take drink orders). Food came out wrong, one person in the party didn’t even get their food. The buzz is due to the article but don’t see the hype. My maple chilli oil bacon was just a strip of plain bacon on a Dunkin’ Donuts croissant. Not a fan."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM09HMUtjbVJDYmpNemEyWjNVMDFRVEhaWlNIYxAB",
            "text": "Pretty terrible brunch experience. Made a 1pm reservation and our 4 person table wasn't ready. Our non-alc drinka came 30 min later. Half of us were burning in the sun close to the window because our food didn't come til way over an hour…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KYVNHeEpVMEUyVGxSWmFFRndUVkpFZEdOcGEwRRAB",
            "text": "Good awesome"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWmVYazJUbFpIYURWeFpEVkxTMXBXY25kaVdHYxAB",
            "text": "I had a perfect and fun birthday lunch with my husband at Tootles & French! Exemplary service and unforgettable experience! The owner, Chad, and the manager, Fabio, are gracious, charismatic and meticulous! The joy they have while talking about the local businesses/purveyors they work with and private events they host puts a smile on your face because they have passion for their craft! For our drinks and food we asked Chad what he would recommend ended up ordering the flight of bubbles cranberry, rhubarb and black currant, coq au win wings for appetizer, the crabby patty with house made old bay fries for myself and the chopped cheese sandwich with fries for my husband. EVERYTHING we ate was scrumptious and flavorful! I am still thinking about that crabby patty and my husband was impressed with the chopped cheese sandwich! Props to their culinary team we love the food! The drinks were so refreshing I enjoyed the flight of bubbles so much that I ordered another glass of bubbles and tried the white peach and my husband ordered a glass of their house red! Just as I was telling my husband about ordering dessert, Chad is so sweet and came to our table and said he has dessert coming out and it was the best gelato I ever had! The flavor was fig and red wine gelato! It is house made! It was decadent and perfect to end the meal! If you want a memorable birthday, have a special occasion, going on a date, chilling with friends or family and want to dine and drink at a cozy and elegant restaurant go to Tootles & French! Go experience for yourself why they are the #1 Best New Restaurant in America 2025! Worth it and will definitely be back! Thank you Chad, Fabio and the talented culinary team! Thank you for providing Astoria with this neighborhood gem!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQ1JHbG5ZVzUwWmxOMlpXaENZbUY2TkhSVlMwRRAB",
            "text": "This was my second time at Tootles & French. I have had both brunch and dinner here and both experiences were amazing. The food is outstanding. They do not use any liquor that is made in a factory but instead smaller business and locally sourced or made by the owner which is very very cool. My server was Vanessa and she was fantastic and knew all the history and stuff which was fun to learn. This was my brunch, iced tea and the fried chicken sandwich. It was DELICIOUS and the potatoes were so good, not your typical home fries and I loved them. Will be back again very soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVUxUWnJaM3A1Y3paNlprdzRMVWxRVEMxT04wRRAB",
            "text": "I been wanting to try these place for a while and went there last week. OMG it was definitely worth it, from the beautiful space to the food this place it’s amazing.\nWe were greeted warmly Chad and from there the evening got even better.\nSelection of Spirits is hand picked and the food you can tell there is a seasoned Chef behind it.\n\nThe atmosphere was just right. The space is warm, inviting, and has a charm that makes you feel comfortable right away. It’s the perfect balance of cozy and elegant, making it a great spot for both a casual meal or a special night out.\nWill be coming back here for sure."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNGJURnpOa3A1YmpOa04wNXRUM1pTTkU0MlNHYxAB",
            "text": "We traveled all the way from South Africa and discovered this gem of a restaurant. Amazing food and very impressive wine menu. A must for any wine enthusiasts. Loved it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSlRFaHRURFJhT0V4TU1VMUNObVpJWjNwclZYYxAB",
            "text": "The atmosphere is nine the service is OK but the place comes out in Google as a French place and I don’t think they have done anything to explain the people that the place is in American restaurant with a lot of Italian dishes so I was expecting a French restaurant and I got an American restaurant"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWFQxaDRZazVDWVhSQ1ptZDJTM2hHUkdFelkzYxAB",
            "text": "Had a wonderful dinner there. The food was good and the service was wonderful! We had two 5 year olds with us and they were able to tailor the food for their palate.\n\nSome highlights-\nBurrata\nMarrow\nCrabby Patty\nFrench dip\nChicken bites\n\n5+ stars to the service and front house staff!\n5 stars for ambiance and cleanliness.\nWill definitely go back"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VGFrRkNiR28wVTFBMFZYQndlaTFsZFd0MGNIYxAB",
            "text": "We ordered the eggs with salmon and bagel with salmon and it tasted very fishy. We didn't finish as it was not good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRWFtZE1kMXBhTlRRNVRUaG5lVlZFVjBsdk5XYxAB",
            "text": "Great service and food.  Today was my first time and I came with a group of 8. Vanessa was our server and bartender and she also held down the entire restaurant. She was polite, endearing, and calm. Will definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKT2MwMXViaTFwTFZsRVVIRXpkbGR3WVRaWWRtYxAB",
            "text": "I was there this past Sunday. The food is great, but the live music was irritating— it was a guy playing guitar and singing. If he had just played the guitar, it would’ve been fine, but his voice . . . well, let’s just say it was not exactly mellifluous. And the guy just would not take a break! It was impossible to have a conversation over that damned guy’s irritating voice!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kc2RFTnFNMFV5VjAweGFHaHNOVFJTVjBSaFJrRRAB",
            "text": "This is a fun spot with great drinks (albeit expensive). I visited in a Friday and they had a fun broadway tune sing along in the back. Vanessa is a great bar tender and knows how to make a martini!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweWIyeFVNV1pwYXpoc1ZsQkZVVkJyU25sM1RtYxAB",
            "text": "Craft, passion, and hospitality are built into the DNA of this place. There are no brand name liquors. The menu is thoughtfully curated, and there's always an event going on. I can't believe I waited so long to visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWlZWcFBabXh0TkdoVFpFUnhiMmRWWTA5NVZFRRAB",
            "text": "Stopped in for an incredible high-quality local wine tasting: I love that the dining area was fully accessible and thoughtfully designed, Great place to grab a little food before as well: the Rigatoni Bolognese was filling and delicious and a perfect intro to the tasting. Service was warm and attentive, and the wine tasting was delicious with well paired small bites. Great place to enjoy good wine and even better company; and I'll definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkd2JqazJaVzR0UldobFZuWlJXR3BqT0dSQ1pYYxAB",
            "text": "Ehhh is what comes to mind.  I wouldn’t be back and have not recommended it to anyone."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWFZIbzVOR1JLZWxVNFRtTk1hRjlDYm14QlpWRRAB",
            "text": "Everything was really delicious and their happy hour selection was amazing. Definitely will return!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSFJtOWhZWGRmUkRNeGFtZDJNWFp4U1hsSGNWRRAB",
            "text": "Chad is such a nice person and knows food! Also the cocktails are some of the best I’ve had! Love they are doing events for Pride! I’ll be at brunch!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Zd01rZG9UVTF0YW5jemNrcEtaR2xOU0dKd2MxRRAB",
            "text": "Mostly casual bar with French vibes. Highly recommend their mixed charcuterie board that offers an assortment of nibbles."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLTg5dlA0bUthZzlRRRAB",
            "text": "Good Live Music, Good Brunch Food and a cozy atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWFEzWmtXWGxUZDJaTVZ6VlRaRWhOUmxKUlpHYxAB",
            "text": "The bone marrow and the branzino fillet were delicious.  They have happy hr on Sundays."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNYnVqOHZheHRqbXhBRRAB",
            "text": "Cute little neighborhood place. Food was very good, service was excellent. Wonderful place to dine and catch up with friends!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMVEZsYUs1Ml9PVGZ3EAE",
            "text": "This place is absolutely incredible!!!  If you’re looking for a little bit higher quality drink and a place you can sit and enjoy your experience, this is the place you want to be!  Saturdays and Sundays brunch is unique and delicious, while their dinners provide an amazing atmosphere. I have also attended a number of their special events and have always left feeling fulfilled and like a bit of a family!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMS3VyWjZnLThubFFREAE",
            "text": "Best night out in Queens!\nCame here for apps and drinks and it did not disappoint! Mikhail, our bartender, is amazing! Super knowledgeable and friendly.\nBest bite was the shishito peppers after sipping on the yuzu vesper."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbXhwTUR1cm9POElBEAE",
            "text": "Fantastic spot. Our bartender, mikhail, was not only kind and informative but guided our entire experience. Steered us to things that fit our palate and even had us try some things we weren’t familiar with. Will be coming back!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKTDF6cGJsaGRHZWRBEAE",
            "text": "Great wines by the glass and a fabulous menu. A wonderful experience every time we come!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPWHYxb1dLbWRpSWRBEAE",
            "text": "I sat down and immediately felt like the bartender wasn’t in a good mood by the way he spoke to me. I didn’t see the happy hour menu because of the dim light. Ok fine whatever.\n\nSo I asked for a glass of the house red and he walks a glass over. Didn’t pour it because I’d seen the two glasses sitting on the back bar. He said he’d just poured it.\n\nMaybe but wouldn’t you warn a customer first? Like, let me make that decision if I want someone’s reject wine? I just felt weird being there. Weird vibe. They didn’t want me there. I left.\n\nWe came here when they first opened and had a nice time so this was a drag."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNX3FpckM5dXVhUFFnEAE",
            "text": "Inviting Bistro that hit the mark with the Tuna tartare and charcuterie but totally missed with the Chopped cheese which was very dry and had very little beef. The Moroccan shrimp was a solid entree. We wanted to love this place but it fell a little short"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOem9tb0dWNjRpdmpnRRAB",
            "text": "Mother's Day brunch was AMAZING! The prefix was on point and my mother Loved it all!  Their special events are so unique and always a new experience. We've been here (my wife and I) for a number of occasions and Chad - the owner - is always on the floor and always recognizes us and welcomes us, it's a great feeling. The staff is always so attentive and helpful it makes me want to pass by and say hi every time I pass by the restaurant.  (their Restaurant Week Château Brien Wings were to Die for).  Highly recommended! and the house wines themselves - which changes almost weekly - are almost always quite delicious.  Try their Negroni flight is a great value too!  I'll stop raving now...."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxazg2QmpnRRAB",
            "text": "Unfortunate update:\nTo preface, the FOH including the bartender, busser, our server Chris and the host (I think they said they prefer “Pretty”) were all incredible.\n\nRegarding our actual meal: The lack of communication, and integrity, from the kitchen was disappointing to say the least. The fact that management did not attempt to rectify the situation (2/3 of our food being freezing cold) properly the first time, thus allowing the kitchen to microwave fried chicken and call it “fresh”, causing it to be returned for a 2nd time, without an offer of compensation ( a drink, the food that took 1 hour and 20 mins) was surprising at best.\n\nThis is my third visit and while I understand things happen - the restaurant was half empty and we ordered later/after the first wave of seatings (12 pm) and prior to anyone else walking in. Our tables food did not land until almost 1 pm and mine was finally served hot at 1:20.\n\nThis is a huge discrepancy (at $45 pp + drinks, tax and tip) that ownership needs to handle with both management and BOH.\n\n—————-\n\nFirst time here and I’ll be back! Truffle fries as well as the banana and apricot brandy gelato are incredible. Ownership is kind and welcoming - pleased to come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOelY4cS1heWFtSG5RRRAB",
            "text": "love the vibes here"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdjBrS3FFbE12MVF3EAE",
            "text": "Got mushroom fettuccine (asked for extra mushrooms) and it was INCREDIBLE. If you like mushrooms, this is going to be life changing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZX3NMLTVnRRAB",
            "text": "Cute little restaurant on a busy part of Ditmars Blvd. It's a fine but not great dining experience. We ordered the following:\n- Burrata: was supposed to come with grilled peaches but came with uncooked green apples instead. Fine to change a menu item but they should let customers know beforehand. 4/10\n- French’s Chopped Cheese: pretty good! The jalapeno aioli added a nice kick and the fries were amazing. 8/10\n- Wild Bourguignon: tasted like what a basic home cook could prepare. Entire dish lacked seasoning and the meat needed to be more tender. 3/10\n- Drinks: sunset spritz & smoky negroni, both were solid cocktails!\n\nThe service was also lacking - we had 3 different servers helping us and there was only 1 that seemed to be the most attentive to all the tables. If you eat here, stick to the basics like the sandwiches and drinks. Overall, there are better restaurants in the area."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcHVxc0ZREAE",
            "text": "Every time we’ve come here we’ve had a blast. One of your waiters really hit it off with my sister and made her feel welcome in a new neighborhood, so thank you. Officially one of our favorite go-to spots even though it’s a few subway stops away!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfalBqbzZ3RRAB",
            "text": "I adore this restaurant and bar! Tons of live music and the Musical Theater open mic on Friday nights is a BLAST!!! I will say the buffalo chicken sandwich slaps and is nicely paired with the fries."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbDd2OGVBEAE",
            "text": "Stopping in on a whim last summer, this has become my go to restaurant in Ditmars for delicious food and cocktails. More than that, there really is a neighborhood vibe that is always so wecloming. A must if you're in the area."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvczRUQXpBRRAB",
            "text": "❤️ Overview:\nMy husband and I came here for dinner on a Sunday and it was lovely. All of the staff were super nice and it was super cute inside. I really enjoyed the burrata appetizer and the citrus salad. The pastas were good as well. The right amount of food overall.\n\nOverall, we enjoyed the food and definitely would want to come back to try other things on the menu!\n\n❤️What was ordered:\nFOOD: shishito peppers, burrata, citrus salad, sautéed crab pasta, beef bolognese, crème brûlée\n\n❤️Stand outs:\nThe burrata and the citrus salad\n\n❤️Would I come back/recommend:\nYes - I would come back\nYes - I would recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM1lfbnNBRRAB",
            "text": "Love Tootles & French. I'm pleasantly surprised by the new entrees on the menu as well as their cocktails menu.  Enjoy very much their wine tasting dinners.  Yummy!  Something for everyone depending on any night of the week. Excellent service. Fun atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc2NxemJnEAE",
            "text": "Burata and the crab see food pasta was amazing a love it I well back again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMW9DRVBnEAE",
            "text": "Astoria is known for its restaurants and T&F has been a FABULOUS addition to our neighborhood. I've been going since they've been open and they are always surprising me. Chad and Team are really smart about switching things up in the kitchen, offering just the right amount with portions and they have HANDS DOWN the best Meat & Cheese board in the neighborhood if not the borough. Food is only a part of the Tootles experience. Chad, an expert Sommelier and Aperitif specialist, has created a wine list and cocktail menu that is unrivaled in its creativity and uniqueness. The NY Sour is a year-round staple and the variety of Spritzers is ever evolving. They just know how to keep things so fresh and interesting. Also, the staff are such kind, knowledgeable people. This is a reflection of the Spirit of the owners and the space itself, which always has a warm glow about it, with light sneaking out from behind each fixture. Highly recommend!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOTlIYlFBEAE",
            "text": "I recently had my 40th birthday party at Tootles and French and it was incredible.  The team there were incredibly responsive, accommodating, and more than willing to work with me when it came to the budget and what we had in mind.\n\nThe day of the event, the staff were incredibly friendly and helpful which really made for a perfect event.\n\nThank you Chad and Tony for making the day incredibly for my guests and I.  Will absolutely consider holding future events here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdGNyQzRnRRAB",
            "text": "Great wine and great service\nVanessa was beyond nice"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndnFlTk1BEAE",
            "text": "Charming Astoria neighborhood restaurant   We have been wanting to try this restaurant after all the good reviews and was not disappointed.  The drinks were great.  Interesting selection of original and classic drinks.   We went for brunch.   It was excellent.   They had a singer and the service was really good.  We made reservations already to try dinner.\n\nWe went back today for dinner and we  even liked it better than brunch.  The food was so good  We had the marrow bone and all the pasta was refined and fresh   The staff is friendly and all the drinks and wine unusual\n\nWe don’t usual repeat restaurants but this is the exception. Highly recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJXzQ3QkxREAE",
            "text": "Tootles and French never disappoints.\n\nThe food is consistently exceptional—we had the steak tartare and wild boar entrée this time, both absolutely delicious and perfectly prepared. The red wine pairing was spot on.\n\nChad and Vanessa were as hospitable as ever, making us feel truly welcomed. A beautiful dining experience from start to finish—can’t wait to return!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJblpDN093EAE",
            "text": "Congrats to Chad and Vanessa for continuing to give us a new adventure every time we visit. Today we had shishito peppers as an appetizer, Moroccan Shrimp and Wild Bourguignon for our main courses. The Wild Bourguignon has to be one of the tastiest dishes I have had in a long time. The shrimp were yummy. Thanks to staff for suggesting wine nice pairings. We thoroughly enjoyed chatting with staff and look forward to what new delectables have been added to the menu next time!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdGFMUXdBRRAB",
            "text": "Unique food choices with a backup ensemble of classics makes for a very versatile dining option. The environment is very relaxed despite the craziness outside, and the service is spot on and veteran. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOG92V25RRRAB",
            "text": "Amazing food, great wine selection."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNWVqM0pBEAE",
            "text": "Tootles and French is hands down one of the best dining experiences in Astoria! My partner and I have been here multiple times over the past year, and each visit is nothing short of amazing. From the moment you walk in, the warmth and hospitality of the staff make you feel right at home. The bartenders, servers, and hostesses all go above and beyond to ensure an unforgettable experience.\n\nAnd let’s talk about the food and drinks—absolutely phenomenal!!! Last night, I ordered a cocktail off the menu, and it was, without a doubt, the best version of that drink I’ve ever had. Every bite and sip at Tootles and French is crafted to perfection.\n\nThe owners, Chad and Vanessa, are the nicest humans, and it’s so clear how much heart and hard work they pour into making this place what it is. Their passion shines through in every detail, from the ambiance to the menu to the incredible service.\n\nThis place is a true gem, and if you’re ever searching for a top-notch spot in Astoria, look no further. Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndHEzS1hREAE",
            "text": "It was a fun dining experience motivated by the USA Today’s Best New Restaurant article. I came with a friend for my B’Day. We were mostly interested in the wine tasting, which was phenomenal. They have the best wines from all over Europe! On the other hand, I was a little disappointed in the charcuterie board, it seemed to be short on cheeses and fruits. The shrimp dish was tasty, and my friend loved the burrata pesto pasta. I would come here again for casual dining and a comedy night. The ambiance is spectacular, loved the setting and the music. The service was great as well, the staff was very positive and accommodating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUamZhbmNBEAE",
            "text": "We were looking for a local place for lunch in a Saturday afternoon and found this adorable place. The food is wonderfully presented and tasted as excellent as it looks. Not only is the decor so beautiful with lovely touches as wine coolers built in and carafes, settings, tables, bar but the service was impeccable. They even gave us a selection of Gelato that was scrumptious. Service was top notch with a knowledge of wine just by telling what type of wine we were in the mood for and we love that type of service. Highly recommend and will be back to savour their dinner menu. Thank you."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNF8tMEhnEAE",
            "text": "Tootles & French was so great! I had the roast chicken that came with mashed potatoes and mushroom. It was so good!! The wine selection was really interesting with a lot of diverse selections. Their cocktails are also really good! All around a great place: great food and wine!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNnMtM1NBEAE",
            "text": "I went to a wine tasting last month featuring wine from Campania. The host was incredibly knowledgeable about each wine, sharing in-depth details about how the wine is made and each note. This was an intimate setting and great for friends, couples and even solo! Tootles served yummy light bites that paired perfectly with the wine. I would definitely go back for another wine tasting!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdHJLRVd3EAE",
            "text": "Had the most delicious meal with friends at Tootles & French. Shout out to the chicken parm ravioli and the chopped cheese sandwich. The wine list is also spectacular. Looking forward trying more dishes on my next visit."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MUtfU0xnEAE",
            "text": "We tried this place for the first time and had the steak tartare and bone marrow. Both were amazing, especially paired with some white wine. The price-to-performance ratio is excellent. Charlie took care of us and was very friendly. We really enjoyed everything. We had a wonderful time and will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3Zy11QXlBRRAB",
            "text": "I was looking for a place to eat a nice sandwich and decided to try this new restaurant in the area!\nBeautifully decorated,diverse wine selection, beautiful colonial style tiles, bringing a cozy environmental look and feeling!\nI ordered a Turkey BLT with a salad, both were delicious!  Chabata fresh bread, crispy bacon, fresh tomato, and juicy turkey meat.\nMy husband had pulled pork sandwich with salad and french fries!  All tasting darn good!\n(But in my opinion,would be good to have  salt a pepper shaker on the table for customization.)\nLooking foward to come back and try other plates.\nGreat service, great ambiance,really good food!\nI recommend this place if you’re visiting Astoria."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncmI2M3Z3RRAB",
            "text": "This place is amazing! Food was top notch, service was amazing the drinks were extremely impressive! You have to go here for a date night for sure. The ambiance was perfect!\n\nDrinks:\nWe ordered the foster home! (Jesus lord have mercy!) its was so good! Smooth and delicious. The bartender was impressive and very friendly.\n\nFood:\nWe ordered the pot pie. It was very good! The meat was cooked perfectly. It’s good for sharing. For our dinner we ordered seafood fettuccini, very delicious with a nice kick. And the mushroom fettuccini as well. Everything seasoned perfectly. I would come back for those plates alone. But also come here for the service. Everyone was very kind and attentive.\n\nPlease go here because you’re missing out on a great experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuanBDUzdRRRAB",
            "text": "Tootles & French is such a great place to hang out or have a date night. The service is great and so is the staff!  They’re always ready to recommend a glass of wine perfect to your liking and explain what everything is that you ordered with some insightful information.  Their food and desserts are both delicious!\n\nI also attended a wine and cheese pairing that was so worth the money!  Def recommend checking them out!! ☺️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3a19pOUdnEAE",
            "text": "Absolutely incredible and totally lived up to all the hype! Each course was absolutely perfect, super friendly staff and very pleasant ambiance! Thank you Tootles team! Will be back next week if not sooner! 🙏🏼🙌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaFpiZ0JREAE",
            "text": "Quaint with a Twist: A Charming Urban Eatery\n\nThis cozy restaurant offers a delightful blend of rustic charm and modern sophistication. The intimate atmosphere and warm lighting create a welcoming ambiance. The menu features a creative selection of dishes, expertly prepared with fresh, high-quality ingredients. One of my favorites is the Chopped cheese.Whether you're craving comfort food or something more adventurous, there's something to satisfy every palate. Don't miss out on their signature cocktails, expertly crafted with unique flavor combinations.It's the largest Amaro bar, but if you don't know anything about that, the knowledge staff can teach you. Don't be discouraged. There is a tequila option. Just dont tell them I told you!A must-visit for those seeking a memorable dining experience,a comedy show,or a wine tasting this place has it all!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyd0lDR0J3EAE",
            "text": "Had dinner here on a chilled Tuesday night. We absolutely LOVE this place, such a hidden gem on Ditmars Bld. We started with a happy hour on an high table waiting for our table to be ready, staff was friendly and easy going, we felt immediately amongst friends! We spoke with Chad the owner about coffee and he came spontaneously out with his new creation, a Cappuccino Martini!!! Service, food, cocktails and wine list it was a TOTAL experience. Will be back soon! Vanessa and Chad, grazie!!!\n\nPs don’t miss the gelatooo"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSamRxN19BRRAB",
            "text": "Sat. 4/29/23\nWe were waiting for this restaurant to open…and so happy it did! As you enter you’re greeted and welcomed with a warm smile. The deco is place is so cozy lighting is just right! Chad the Manager is a true professional and makes sure that customers are happy and accommodated. Jackie the waitress is truly amazing. Her service, smile, persona is impeccable. Everything was Perfect! Of course, we I’ll return and must recommend to other.  Thank you Chad and Jackie for making our visit a memorable one!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dDVMV013EAE",
            "text": "I went for the Christmas Eve pre-fix menu.  I highly recommend it. Service was top notch. We got the wine pairing in addition to the pre fix  menu. They put a lot of thought  into pairing the wine with your meal. They did a great job. I think the star of the meal was the Cornish hen. Thank you Tootles and French for making my Christmas Eve dinner with my mom so memorable and joyous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWLUxMYmJnEAE",
            "text": "Tootles and French is just what Astoria needs. World class food in a sophisticated atmosphere, and affordable !! Great wine selection and events. We just had a fabulous Brunch there with live jazz by Larry Luger serenading us. I can’t wait to go back … they’re having an awesome New Year’s Eve dinner as well with live music."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcElLZmRBEAE",
            "text": "My new favorite restaurant! I was surprised we got a table just walking in, given that they were just awarded number one restaurant in the country.\nFood and drinks were outstanding.\nBone marrow!\nUnique tasty cocktails and an extensive wine list.  Flights are a great value.  Definitely get the HER flight and Bubbly flight.\nWe love that they support local food and beverage producers and  female owned wineries around the world.\nEveryone was super warm and welcoming.\nTony, GM, made us feel like VIP.  He is very knowledgeable and welcoming.  Possibly one of the best restaurant managers I have ever met.(And I know a lot).\n\nI don't usually write long reviews. But I had to add more praise for this unique institution.\nJust when I was ready to go home, more than satisfied with the amazing meal, drinks, and service. I walked to the back of the restaurant to check out the open mic....\nMy night started all over again.  We couldn't leave. We couldn't help but get another table and  order more drinks/flights and truffle fries We sang along with talented artists/performers/staff who brought classic Broadway musicals to Astoria!  I felt as if I was back in the theaters on Broadway!\n\nI will definitely be going back for the food, drinks, outstanding staff and the open mics!\n\nThank you Tony, Mikhail, Kyle and all staff at Tootles & French for one of the best nights I've had out in a while."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbzdxMWZnEAE",
            "text": "Tootles and French is an absolute gem of a wine bar!\n\nGreat atmosphere, knowledgable staff, and a wonderful selection of wines by the bottle or glass. The wine-infused specialty cocktails are a must try!\n\nIn addition to the incredible wine and cocktails selection, Tootles and French offers a delicious menu of small plates, charcuterie, entrees and snacks that perfectly complement the wines. Every dish is expertly prepared and beautifully presented. I recommend the truffle popcorn if you're looking a a delicious snack!\n\nThe ambiance at Tootles and French is also worth mentioning, the decor is modern and stylish, perfect spot for date nights or a night out with friends, this wine bar has it all!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzZ0xDd013EAE",
            "text": "Have been delighted to experience both a wonderful meal in their main dining area as well as one of their fine wine experiences and have been blown away every time. The knowledgeable staff and the care for the craft really makes this place shine. It will remain a  spot that I will continue to come back to time and time again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbE1pWE53EAE",
            "text": "Amazing wine bar with some of my favorite gin cocktails! Additionally, every single thing has been perfection. Great vibes, great people (Vanessa is my girl!)… must visit"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNklUelZ3EAE",
            "text": "What a great happening in Astoria! This new wine bar has a fantastic vibe. Outstanding ambiance. Friendly, knowledgeable staff. Delicious tasting of the oysters, guajillo shrimp, steak and porchetta sandwiches. Loved the classic NY Sour…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdG82d0RBEAE",
            "text": "Some of the best wine 🍷 that I’ve had, and everything is exclusive! They have machines that keep the wine fresh like it’s just been opened, and the pour is always perfect! The food selection has got a nice range, and everything I had was super tasty! Price is also super reasonable. This is my new go to spot in Astoria!!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbExiQVpnEAE",
            "text": "I LOVED my first experience at Tootles & French! The staff was so kind, the food was absolutely delicious and the wine selection was to die for. We got the steak frites with truffle fries, the crispy tofu sandwich and the sautéed spinach…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbXMtbzJ3RRAB",
            "text": "The food is so good! So cute and aesthetic inside. Staff is so Nice! I was there for the weekend. It would be my go- to spot if I lived there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z0x1MTV3RRAB",
            "text": "Such an incredible new gem! My friend and I went here for an early dinner and got the cheese plate, bone marrow, beet salad, quail lollipops, and gelato. We also enjoyed the night night cocktail, blueberry kir, culpas mia, and wine pairings…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbmVmam5RRRAB",
            "text": "Perfect for date night. It was our first time here and we loved it. We attended a wine-pairing dinner with wines from a special region from the north of Italy. However I can see us coming back for a laid back night. You can order from a thoughtfully curated wine list while enjoying a nice dinner in a warm and inviting place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aTktbzNBRRAB",
            "text": "I also distrust five star reviews. Let me elaborate: the service was welcoming, personable, efficient, and had great recommendations. Every single dish was a superb example - even dishes you might find elsewhere (beet salad, gelato) and especially unique items (iberico pork and fried cauliflower, the inimitable fluke and polenta) just let their ingredients shine. Everything subtle and served with a light touch, from gelato and cocktails to a palate cleansing citrus-cello - the menu is confident and unique. The decor feels delicious on the eyes - that's not an exaggeration. This place is special and I'm glad I took a chance on it. And the Seta Amaro closes the deal with a brilliantly unique but unifying flavor you'll be thinking about for days."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNnJqNHNRRRAB",
            "text": "Great new spot in one of the best locations in Astoria. Amazing food and drink, and even more knowledgeable staff.  Perfect for a date night (or double date... or triple), or a large party in their private dining area.\n\nDrink\nOur group tried a variety by the glass - the bordeaux, faisao, a rose, and a casamatta rosso - everything was so delicious, and even the red wine drinkers among us were secretly wishing we had more of the Faisao!\n\nFood\nCome for the wine, stay for the food - We started with a few appetizers - the beet salad, Spanish octopus, and the butter board (bread lovers' delight).  Followed by a perfectly cooked steak combo - steak sandwich and steak frites. The other party ordered the spinach ravioli and crispy fluke. Everything was cooked to perfection with surprisingly large portions.\n\nVerdict\nA must-try new spot with beautiful decor, friendly, extremely knowledgeable staff, and delicious food and drink that will keep you coming back. I know we will!"
        }
    ],
    "reviews_count": 78
}