{
    "name": "American Brass",
    "place_id": "ChIJX-RW0-BZwokRCLPgx8QLHKQ",
    "grid": "QN1",
    "address": "2-01 50th Ave, Long Island City, NY 11101, USA",
    "rating": 4.4,
    "user_ratings_total": 920,
    "phone_number": "(718) 806-1106",
    "reviews": [
        {
            "date": "17시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNFZGY3hUMEpMT0dOWlUzbEphM0pPZGpsWk1uYxAB",
            "text": "Cozy anniversary dinner. After a Manhattan-born ferry ride to LIC, and a 5-mintyte walk to the restaurant, we were well received and got an isolated table facing Manhattan view. The meal was great."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVVZXZHpWVXhxU0hvMlNtbHhPV2RMTmtGa1dHYxAB",
            "text": "Delicious food and great service, the view is impeccable!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNVoxbDFUWFpNTjJzdGVUbHJOQzFTT0dwVmVGRRAB",
            "text": "Love this place. Dog friendly, food and service are great."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMFdYcDVZMmxYTTJkd2VGbDNaMUJWYWtVM2VWRRAB",
            "text": "Many years ago there was a place called\nRIVERVIEW there and the food was great, so I wanted to check out what’s in its place. To start with, the atmosphere was great inside, the decor is sophisticated, lots of pillars throughout an open room create a vibe that you’re dining in privacy to some extent, as you’re not having to stare at another table too close to you.\n\nWe chose to sit outside, as the weather and views were stunning. This place is it if you want great waterfront views and decent American fushion food. They said it’s an American menu, but they also had ceviche and some various ethnic touch I suppose they’re not acknowledging, the ceviche was Mexican style and it was truly great with a bed of thin sliced radish and cucumber, topped with shrimp ceviche, onion and a spicy pablano sauce I believe, it was very very good. Had some oysters, the Massachusetts ones were fresher and cleaner and were delicious, more than the Canadian ones, . The fried calamari was delicious too. The mocktails were fantastic.\n\nI recommend this place, the food is good enough and the views were amazing. The waiters were almost too attentive, they should coordinate a bit more, several of them came up to us in a row to check on us and ask if our order was taken. Seemed a bit like they didn’t communicate with each other, but can definitely see they were eager to make sure the service was great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUVJtWkhhRlo1TlRaWUxWQlFSRWh5WjB4U00wRRAB",
            "text": "Great Hospitality!! Was warmly greeted and sat at a table we requested :), Food was excellent as well as our server Cesar!!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGalFXUm1hVFpCZG01ZlQxbzFja1EyV1djeVRHYxAB",
            "text": "Slow service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SZmJGRTRVRE00VDJSV1dYcFJRVlZsU1RRMmFYYxAB",
            "text": "Small breakfast platter, too much butter on the pancakes and in the syrup. Food took 40min."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xseWJFZFdMVlF0VjB4MGRtYzJTbDlQVEc1M05rRRAB",
            "text": "The food was all weird. The philly cheese steak was extremely buttery and the steak didn't taste great. The pancakes were fluffy but undercooked and too bitter. The food took 35 minutes to come out despite being the first one in, and the steak was thinly cut and should not have taken that long to cook. Others received their food before us despite being 10 mins later, the kitchen probably messed up the order as the waitress was very nice.\nOverall would not go back to eat but it is a nice place if the food gets fixed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReFRHVkRWbEJsYm1KR2FVVTRaRmN0VFZCV2NHYxAB",
            "text": "Evelyn was our server. Very attentive and professional\nAlso ordered pancakes and breakfast platter.\nDefinitely recommend it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRkxWaG9hekJ6YVhCNlNEZGpYMkpQUkV0TGNuYxAB",
            "text": "Fine dining"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMlkwcHRVMnRsWXpaWFkwdDNWSEpWTUZWdldsRRAB",
            "text": "Had a couple really good meals up here. Service has always been good and on a nice night, you can't beat the location for outdoor seating."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UmVrMVRhV1Z2VGkxZmFsQjFTRk01ZDJSWWJuYxAB",
            "text": "I had a very disappointing and upsetting experience with the staff, especially the so-called “manager.” The restaurant was clearly open, full of people, and we were already seated at the bar. When I got up to go to the restroom, the manager stopped me and said, “We are closed.” This made no sense — there were no signs that the place was closed, and guests around us were still being served.\n\nWhen I asked for a table, I was rudely dismissed, even though the restaurant was obviously still operating. The way I was singled out felt discriminatory and completely unacceptable. I don’t know why she did it, but it was clearly unprofessional and rude behavior on her part.\n\nI truly hope upper management will review this incident and take the necessary measures, because no guest should ever be treated this way."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jM2RrOXRZVjlpU1hoT1FsUnRZbU5aTm1KaVFrRRAB",
            "text": "American Brass used to be a favorite, but it feels like it’s lost some of its spark. The dining room is often quiet, the bar lacks energy, and the bar stools are in pretty rough shape (see photos)—ripped and peeling for quite a while. Fixing those would really improve the experience.\n\nOn the plus side, the hamburger is excellent. The rest of the menu could use a light refresh. We live nearby and keep giving it another try, hoping to see updates. With a bit of investment and attention, it could be a standout again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVmFUaDFjMW81YjFaQlRUaDRVRUpLUlRSb2JsRRAB",
            "text": "This restaurant is in an amazing location, right in front of a huge park with a river and a stunning view of Manhattan. After a short walk in the park, we decided to stop by, and walk-ins seemed fine.\nThe restaurant itself has a great vibe, and we especially enjoyed sitting outside at the café area. It was the perfect spot to relax with a coffee on a hot day, while still enjoying the beautiful surroundings."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSk5uUndZazF3T0hKVVdVMDFTM2RJYnpsemVHYxAB",
            "text": "We had our wedding dinner/reception at American Brass in June 2025, and I truly can't say enough good things about this place. It was perfect.\nFrom the owner to Tegwyth (their incredible Event Manager extraordinaire) to the wait staff and chefs-everyone was kind, professional, and genuinely cared about making our night special. The service was flawless, and our guests are still talking about how amazing the food was!\nOne moment that really stuck with me: after our cake cutting, my husband and I stepped out for photos, and when I came back, there was a fresh glass of milk with ice waiting for me-exactly what I wanted. That kind of thoughtful detail says everything.\nThe custom food and drink menus were spot-on and better than anything I could've imagined. The vibe was joyful, warm, and full of love, and the team made sure it stayed that way all night long.\nI might already be planning my next event there. That's how good it was.\nThank you, American Brass, for making our wedding night unforgettable 🧡"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWlprWmFSR0l5VG1selowd3RWbWRYVG1KWlpIYxAB",
            "text": "Nice service and atmosphere. Great cocktails, but the food is little expensive for what you get."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MFluQkpTSEZJTTI1a05VczFjMkp5TFdrM2NVRRAB",
            "text": "Loved this spot. Service was good. The atmosphere was nice, love the decor and outdoor space. Drinks were definitely hitting. The food and dessert were great… my only complaint is the oysters were not good. They did not smell fresh at all and I was disappointed because it’s what I mainly came for."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCd1NrVmtNM2hqVTAwekxYaG5VMjFGWkdWYVRuYxAB",
            "text": "American Brass is a fantastic spot to unwind and catch the breeze by the park with a beautiful view of the water. We were seated quickly by a friendly host and enjoyed outdoor seating with a relaxing vibe. The oysters and shrimp cocktails were fresh and hit the spot, paired perfectly with a glass of wine and a cocktail. The service was excellent—attentive, warm, and efficient. A great place to relax, sip, and snack while taking in the scenery. Highly recommend if you're in LIC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRVJFczBjbmRGTkhodVdqaEpVMjF0TVdWRE5sRRAB",
            "text": "Found this place my exploring Long Island City area"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CekxXVk5ORlZ1UjBwUlJ6RldVMVkxTkc0d2VFRRAB",
            "text": "My bf and I decided to finally give this restaurant a try since we live here. Horrible, the restaurant was virtually empty on a Saturday for brunch. We walked in and were given such a confusing message as to why we couldn’t be seated. First the waiter said he was “ committed to their resys and it was virtually empty and then we were told immediately after that “our kitchen isnt functioning and we cant serve food. We arent closed but we will in 1:30 hours and we will reopen at 5”.. there 2 tables that were there sitting outside had food.. and if your kitchen isnt working.. why would you be “ committed” to your resys? I dont get how you’d be able to be committed to your resy… that you wouldnt have a single table available… not sure what this message was to not seat us or if it was racially motivated.. either way.. living down the street, id never return. Given i also work in the area, id make sure i relay that message to the anyone who asks"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdWFqRlZRMUJ2TVdsNlpXcDNWVVpUZGpkQ1IyYxAB",
            "text": "Lovely American Upscale Restaurant In LIC.\nCame Here With A Group Of 10 For A Birthday & It Went Well ! The Service & Staff Were Good.\nThey Have A Nice Selection Of Cocktails 🍸\nThe Appetizers & Entrees Were Delicious! My Group Ordered All The Appetizers On The Menu & EveryThing Was Devoured In Minutes. Kudos !\nBut Nothing Beats The View, Atmosphere & Ambiance That You Get Knowing That Across The Street Is A Beautiful View Of Manhattan 🌃"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paT1duTlZVemhmT1hwUVRGVXhVMFpwTjFObFgyYxAB",
            "text": "If I could give this place negative stars I would.  They are an extremely dishonest establishment.  My wife booked the place for the 4th of July through their web service but then called the place directly.  The person she spoke with told her that we could see the fireworks from there (lie) and my wife expressed that she wanted to come at 8:00 and sit outside and was told “no problem” (also a lie).  When we arrived the arrogant, condescending hostess told us they won’t seat outside after 7:30 and when we explained what happened, she said “I see you called and changed the reservation” but then showed some tiny fine print on the app telling us that it won’t happen.  She then nastily offered us a crappy table inside and basically said take it or leave it.  This place lied to get us to come under two false pretenses and then made no effort to even be civil to us.  We went next door to Brooklyn, without a reservation, and they sat us outside and treated us like humans.\nIf you’ve gone there and had a good meal and good service I assure you it was coincidental, because this business is dishonest, disrespectful and hires the absolute rudest people because clearly there was no authority there or anyone with an ounce of integrity.  DO NOT GO.  All of the places surrounding it are infinitely better and will treat you properly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RNWNXWjJNMEZGVTBONmJqaGpWMmRPUjJveVpGRRAB",
            "text": "I had a Calamari for starters, branzino fish for main course and peach cobblers for desert.. I missed to take photos because I am enjoying the view of the pier and having a good company while dining in this restaurant ends up with amazing night.\nEverything I had is delicious, calamari is melt in the mouth and crunchy. The branzino paired with red wine and spinach is superb. Finish the meal with good peach cobblers and you’re all set to walk around the pier before heading to bed for the evening."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWWNVNVNiRGxNU2t0SVgyRTJXR0ZIYzNSVE1XYxAB",
            "text": "I ordered this through delivery, and  I can't believe how terrible it is.The meat is tasteless, and the fries are discussingly oily."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLMlQxOEhELVptQTh3RRAB",
            "text": "The food was excellent\nThe service was very good as well as their drinks\nI keep coming back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdWRsRmhjR3N4Tm1sRVpXSmZUVGN6VTFZMlRrRRAB",
            "text": "The location and views at American Brass are definitely the highlight—right on the waterfront with beautiful scenery, especially around sunset. The interior is stylish and has a nice vibe.\n\nThat said, the food was a bit hit-or-miss. We were there for Sunday brunch. Some dishes were good, for example, the BLT, but the fries were super soggy. The omelet was average and nothing special. Service was fine.\n\nOverall, it’s a decent spot with a great atmosphere, but the food and service didn’t quite match the setting. Worth a visit if you’re nearby, but I wouldn’t go out of my way."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSE5sbHNObmsxVkc0MloydFdVRUkyT1ZVek4zYxAB",
            "text": "Went with my family and pretty much no one was satisfied with their dishes.  The octopus my uncle and I ordered was overcooked.  The filet mignon my brother in law ordered wasn’t cooked well.  The portions for my father’s seafood order were abysmal. The Mac and Cheese tasted like pasta in a milk sauce lacking seasoning.  I tried to change my order before the waiter left our table and before I could finish asking for what dish I wanted switched in they interrupted me saying it was “too late I already sent the order in”.  The music was way too loud.  When they came to inquire about desert they left one menu for the entire table.  The only redeeming factors were my sisters burger/fries and the mocktails we received but I could get a decent burger for a lower price at a place  that doesn’t  present themselves as higher brow.  I don’t mind paying a higher price for food AT ALL so long as the quality is there but no where in the food or service did the quality match the price point."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRlZGZEZUSFZLZDNsUmRXWXpUbkZXVWpkb09IYxAB",
            "text": "Place too loud.  Food most of it badly prepared.  Not even a steak.  Who goes wrong with a steak?  Too expensive for bad food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSVNsb3dTbGhPYWpRMWVXVnFZa1JYTjA1MlRHYxAB",
            "text": "We held a family reunion here, and it was a great, amazing food, drinks, and service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTFNUaGpaRUZ3ZDNWWk1HTmlNRTkyVjNrM1MzYxAB",
            "text": "Overall Rating: ⭐⭐⭐\nWhile the atmosphere at American Brass is truly something special, our recent visit revealed some areas for improvement.\nAtmosphere: ⭐⭐⭐⭐⭐\nThe restaurant's ambiance is undeniably its strong suit. From the moment you walk in, you're transported to another place. The decor is stunning, the lighting creates a perfect mood, and the overall vibe is incredibly inviting. It's the kind of place where you could easily spend hours just soaking it all in.\nFood: ⭐⭐⭐\nUnfortunately, the food didn't quite live up to the expectations set by the beautiful surroundings. While nothing was inherently bad, many dishes lacked excitement and flavor. It felt like the kitchen was playing it safe, resulting in a somewhat boring culinary experience.\nService: ⭐⭐⭐⭐\nThe service was generally good, with friendly and attentive staff who were eager to please. However, the pace of the meal was quite slow. There were noticeable waits between courses, which detracted slightly from the overall dining experience.\nIn Conclusion:\nAmerican Brass is a great spot if you're looking for a visually impressive and comfortable setting for a night out. The ambiance is top-notch, making it a wonderful place to relax and socialize. However, if you're a true foodie seeking a culinary adventure, you might find the menu a bit underwhelming. While the service is decent, be prepared for a potentially extended dining experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padllsUXdRbFJGUVdWWFZVVkJSakJEYkROek1uYxAB",
            "text": "Food was delicious. I highly recommend the pasta with meatballs and the Carrot cake, which was incredible. Really great cocktails.  They were flexible with modifications. Jeffrey the manager was absolutely lovely—super informative and nice. Lastly, waterfront views of the NYC skyline are beautiful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3elRFSmlXUzFzTjBGUmJsRTNUbTFuU0ZCRVRGRRAB",
            "text": "Great food, staff friendly and helpful."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMk1ERV9nRRAB",
            "text": "We had family in from out of town so a large party.  I have had good experiences here before so I was hoping for a good time with the family. American Brass did not let me down.  The atmosphere, food quality and especially the service was awesome!   Our food was served in a timely manner and all of us served at the same time. Overall an excellent experience. I highly recommend American Brass."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOS21vLWlZd2IzQXNnRRAB",
            "text": "Went here for Father's Day... Sat down at 5:30, didn't get food until 7!! Extremely slow service!!! I had to flag the server down for the check! We didn't stay for desert, and it was a 3 hour ordeal, very very loud and noisy!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMVG04cUxIalpHWEVnEAE",
            "text": "Food is delicious, but the steak was overcooked. Two of us asked for medium rare, but both came out medium to medium well done. Desserts were good in that they are not too sweet. Restaurant is very noisy; hard to have a conversation."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TllqaHBVSE5VWDI4eWEySldla3B5ZFdSV2FrRRAB",
            "text": "Food was ok. Drinks were decent. We sat outside and it was lovely. Bugs ofc, but nothing to crazy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPeS1vN2prOHFQSjFRRRAB",
            "text": "V good food,  all liked their dishes a lot.  V noisy on sat night 730p.  Staff were kind but distracted/ busy.  Frw veggie options,  no vegan.  Enjoyed my 2 sides &salad altered to exclude Cesar (anchovies) dressing, but family was concerned for me getting enough food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLRDhsLXZmZ04zemF3EAE",
            "text": "Some waitress krystel or crystal was so rude to my  toddler"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQemFzNExFOHRyZ25BRRAB",
            "text": "I just walked by and wanted to go in for a drink. All the waiters were very enthusiastic. The delicious seafood made people feel happy and I will come again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPZUd1SV9DNFlxc013EAE",
            "text": "Took an hour and a half for appetizers to come out — restaurant was basically empty. Steak tasted like a grocery store steak I could have made on my own. No flavor extremely chewy"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYUd2S3JtbmJMYjlnRRAB",
            "text": "Great restaurant with a view of the NYC skyline located by the LIC piers. Best to go during the sunset and either get a seat by the window or their outdoor seating. Parking in the area can be tough but so worth the stop"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMWFUwZVNNd3Nqa1F3EAE",
            "text": "Overall a good meal, the appetizers and drinks took a little longer than expected but the main courses came out in a reasonable amount of time. The food was very good and so was the vibe."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNTFR3dmlzX3NfZWRREAE",
            "text": "It is an amazing first-class restaurant in one of the most picturesque spots on earth. But that's not what makes American Brass special. No, it is the staff. From the host to the bartender to our waiter, everyone was kind, gracious, and, above all, professional. They graciously allowed us to use their space for pre-prom pictures. The design and ambiance of the space were cool and swanky and made for some timeless photo opportunities. We had the Calimari appetizer which was flawless, and I had the Atlantic Salmon which exceeded all expectations. A++"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNUEdfb3I3X283c3F3RRAB",
            "text": "I came for brunch on memorial day with some friends because I heard good things about this place. After we got seated down, we waited for a while just to place an order and needed to ask for water. Took us to ask 3 different people just for a cup of ice. Also it didn't make any sense to put brunch menu outside the restaurant when we could only order from \"memorial day lunch\" menu when I saw a post that you served all day menu."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZmtoc0tsbm9HNG53RRAB",
            "text": "Travelled from Canada to NYC and I have been to this place twice... once for brunch and as of recent once for dinner....\n\nThe ambiance, service and food was excellent.\n\nAlong the East river in Long Island City with a great band playing.\n\nI will definitely go back again...."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOand6ZlNXcnV1cVR3EAE",
            "text": "The atmosphere is stylish yet relaxed, with incredible waterfront views of the Manhattan skyline—perfect for a memorable night out.\n\nThe food was excellent. I had the scallops with risotto—beautifully cooked and full of flavor. My partner’s short rib was rich and tender, and the tiramisu for dessert was the perfect finish.\n\nService was friendly and professional, with great drink recommendations to match our meals.\n\nWhether you're out for a date night or celebrating something special, American Brass delivers a five-star experience with top-notch food, service, and views."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPcS02cExFdnZlT25RRRAB",
            "text": "American Brass is one of those spots that feels like a bit of a hidden gem, even though it’s right on the LIC waterfront. The view alone is worth a visit, especially if you can grab a seat outside during golden hour.\n\nThe food is to die for! The scallops were a standout—crispy on the outside, tender inside—and the dry-aged burger lived up to the hype. Rich, flavorful, and clearly made with quality meat; you can tell they take care with the ingredients and execution.\n\nDrinks were creative and delicious, without trying too hard.  The service was friendly as always and very knowledgeable!\n\nDefinitely worth a visit if you’re in the neighborhood—or even if you’re not."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQTDE2NktpdmFHLUp3EAE",
            "text": "Amazing location in LIC on the waterfront. The food is excellent and exceeded expectations. Every staff member I encountered was gracious and friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJX041OXZoeVluMzJBRRAB",
            "text": "If I could leave 100 stars, I totally would! From the moment we walked in, we were greeted with smiles and a warm welcome. I really wanted to try this place because their food looks aesthetically pleasing and I hoped for the taste to be just as good. Boy, was I RIGHT! Don’t leave without trying the octopus. Drinks 10/10 Overall 100/100"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbjRpTnZhbnNmc0RREAE",
            "text": "Favorite restaurant in NY!!! If you’re in the area this place is a must in your to do list.  The burgers will melt through your mouth."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeEp1RlJBEAE",
            "text": "맛집이라고 딸아이랑 사위랑 함께 갓어요..\n입구부터 이뻐서 맘에들엇어요..\n옆에서 웨딩파티땜에 커튼을 쳐나서 좀 답답햇고 바깥뷰 못보고 홀뷰와함께 브런치 함께햇어요\n스테이크도 맛잇고 에그베네딕은..연어때문인지..짯어요..\n가족과 즐거운시간보냇습니다.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOTE1oY1RzNy1iY3l3RRAB",
            "text": "Mother’s Day Brunch Disaster – Never Again\n\nI don’t enjoy writing a negative review for restaurants but this is a must. I hope management will make changes for future Mother’s Day brunch. The experience for today’s brunch was beyond unacceptable.\n\nWe came for the $49 per person prix fixe Mother’s Day brunch, expecting a special experience. What we got was honestly insulting.\n\nFor a party of three, we were given two tiny croissants, one mini muffin, and a small biscuit—yes, that’s to share. We also received two small salads total. That was the entirety of the “starter” course. We felt robbed from the beginning.\n\nThe service is great. The waiter was polite and simply doing his job.\n\nThe main course didn’t redeem anything. The omelette came with no toast or bread. When we politely asked for bread, the waiter refused, saying “everything is pre-made.” Really? A restaurant kitchen can’t manage to serve bread? My mother had to eat her omelette dry while I gave her the bun from my sandwich—an underwhelming chicken sandwich served on what tasted like a store-bought hamburger bun. It was frankly laughable.\n\nWhat makes it more disappointing is that we had previously attended a wedding here that was beautifully done, I had hoped to treat my mother to something special. Instead, I left embarrassed.\n\nWe spent over $200 for three people—20% tip automatically added, of course—and ended up going out afterward for a second brunch just to feel like we had actually eaten.\n\nIt’s such a shame. I had even considered hosting a large dinner party here someday. After this experience? Never again. There were quite a few empty tables for the 11:30 seating and there will be one less next year. We will not return next year and will advise our friends and family to avoid this place at all costs. Save your embarrassment and do not take your mother here for Mother’s Day!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VOX2xsSlhQMk1hWElREAE",
            "text": "We’ve had some truly great meals at American Brass in the past, but unfortunately our Mother’s Day experience was a letdown. We were excited for the prix fixe menu, but the food just didn’t measure up to their usual standards—bland, uninspired, and nowhere near the quality we’ve come to expect. The kids’ menu was especially disappointing: $30 for a meal that wouldn’t stand out in a school cafeteria. We left feeling like the day was treated as a revenue opportunity rather than a chance to deliver something special. Hoping this was a one-off, but definitely not the experience we were hoping for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydDQ3Wi13RRAB",
            "text": "This place surprised me for sure. Everything was so good and well put together. The eggplant that comes with the pork chop was the best tasting eggplant I ever had. I would eat that as a main dish. Service was excellent. Nice decor. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaDY3RTJnRRAB",
            "text": "Such a wonderful find! We sat outside in their spacious outdoor seating area and took in the beauty of the city. The restaurant is clean and beautifully decorated. The menu isn't overwhelming with too many options, and yet there should be an option for everyone. I sampled each item pictured, and none of the items were a disappointment. They were all delicious. There is a ferry stop nearby, so if you are in Manhattan and want to get away for a delightful brunch, head on over to American Brass."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdDc2Y19nRRAB",
            "text": "Lovely place. Good happy hour menu (their oysters. It can be a hit and miss, but it's good overall and I'd come back.) Good accommodation with food allergies. Glad I wasn't served plain fish. I quite enjoyed it. Their price isn't terrible either."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROZ2Jiclp3EAE",
            "text": "I LOVE this place. It’s of course great for brunch or dinner or drinks with the scrumptious food and lovely water view, but we just had our baby shower here and I couldn’t be happier with how I turned out. Working with the restaurant was seamless and SO easy. They have a pastry chef on staff that made THE MOST delicious and beautiful cake and the space they provided us was private, beautiful and they let me take the reins with decor. They even made custom drink and food menus that matched my theme! Additionally, service day-of was impeccable. All this and it was an extremely cost effective option compared to a lot of places in LIC and Astoria. Can’t wait to host another event at American Brass!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbkx2SWNnEAE",
            "text": "My wife took me here for my birthday. She had made reservations in advance. They had a happy birthday sign already on the table. Everyone who stopped by wished me a happy birthday. All the wait staff were friendly and polite (shout out Jose). Food was delicious. We both had the restaurant week prefix. Salmon was cooked perfectly. The carrot cake was also delicious, not too sweet."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ejlidFhnEAE",
            "text": "The food was really good, and their 'Drink with No Name' is a must-try! The flavors were spot on. I personally wish the portion size were a bit bigger to justify the price and to fully satisfy the appetite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUazVyX0xBEAE",
            "text": "We came here specifically for the Milk n’ cookies dessert, and it ended up being the most disappointing part. FYI, go for their happy hour. They have tons of options, and you can’t beat the price. You can’t make reservations for happy hour, but you can walk in. With happy hour, you can still order off of their full menu. We shared the Chips, Salsa, and Guac and the American Brass Sliders. I had the Sweet Heat cocktail. The burgers had a charred taste that was a little too strong, but everything else was good. The hand spun malted vanilla milkshake was the worst part of the Milk n’ cookies dessert. It was basically chilled milk mixed with heavy whipping cream. There was nothing sweet about it, and it didn’t resemble a milkshake or even melted ice cream. This dessert could be a game changer if they got the milkshake right. Overall, I’d go back for the happy hour."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCZ0ltbUpREAE",
            "text": "My wife and I keep coming back, and I wish I could write a review that did justice to the attention to detail, personal touch, incredible food and atmosphere.\n\nFrom the moment we first ate here, the host made us feel like part of the family. They were so friendly and welcoming, and they really seemed to care about making sure we had a great time.\n\nThe food was absolutely incredible. The chef is a true master. The flavors are always thoughtfully put together, the presentation is always beautiful, and its clear that each member of the staff takes a lot of pride in their work.\n\nOverall, I can't recommend American Brass enough. It’s become our go-to whenever we have family and friends in town, or find ourself able to get away for a date night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqd3ZDM25RRRAB",
            "text": "We came here two days consecutively.  We lived in LIC for some months and with our moving out, decided to enjoy restaurants within walking distance before we head off to our next location.   Lovely vibes. Ok bar menu for food, excellent drinks.  Same drink different presentation each time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdXo5cUM2a09PNVV3EAE",
            "text": "It’s really no secret that in LIC, there is no better place ! Food exceptional, friendly service, and incredible views!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aklXSWJnEAE",
            "text": "Firstly, the staff and atmosphere are both nice. However, we are super disappointed with food. It was our second and the last time dining at this place. Their $19 worth avocado toast brunch plate was shocking.. We got two pieces of toasted bread with some drops of cream (?) and cheap guacamole-like thingy.. and couldn't help ourselves but felt like we were robbed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyN3JQeFVREAE",
            "text": "All aspects are above average in my limited experience with this establishment. The flavors of the food were mostly very tasty. I did enjoy the atmosphere. It was somewhat confusing as to which server additional requests were to be made. I think they must take a team approach to serving tables, which I'm not used to."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcmJmQkRREAE",
            "text": "Service was fast and efficient, didn't even have to ask for a straw for our 2 year old, they took it upon themselves to bring out a plastic cup with lid and straw. They also had high chairs or they could make space for a stroller.  Food was also excellent. The oysters were very delicious, and the the calamari was cooked very well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyeWRmaGx3RRAB",
            "text": "Just a casual dinner with my friend. Everything was on top of it. The ambiance, the seating, the service etc etc. The food was amazing & the plating was beautiful. Loved everything we ordered. Grilled octopus was the best. Oysters were very fresh no matter where they came from. Sourdough Focaccia was another hit. The cocktails were pretty much good too. My favorite was up north trip. Tried almost everything from the menu. Bit pricey but worth every penny. Would definitely go back & would like to try the brunch menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbnRuN3B3RRAB",
            "text": "Good food! Loved the grilled octopus and branzino — a must try! Lobster pasta was tasty but it was a bit on the sweeter side; I would skip it next time. Focaccia was unique but I think it’s a bit overhyped. Overall, service was friendly, food was good, and the ambiance was chill. I would definitely go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobUllYURBEAE",
            "text": "We cane here for my wife’s bday brunch and had a blast! The decor is white black and modern. The staff was friendly, great tunes and yummy brunch.\n\nI got the breakfast burger and it was amazing! The burger was medium rare as I asked the quality taste was there and it was juicy, bun crisp and the fried were ok.\n\nFriends and wife all enjoyed their meals. They did a great job cake cutting, provided us a lot candle plates and forks and a Togo bags for the rest. They didn’t charge a fee for this either so we tipped well!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlc3JIanRnRRAB",
            "text": "The food, drinks, and the service have not disappointed once. My wife and I have come here a couple of times. First on my moms birthday, which American Brass does an amazing job to make celebrations feel welcomed and special. We have also visited during lunch and dinner with son. I would recommend this restaurant for special occasions or just after a leisurely walk in LIC."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ajRtYU9BEAE",
            "text": "The cocktails and food were fantastic. While the portions felt a bit small for the price, the quality and flavor were spot on. We tried the calamari, meatballs, burger, and short rib, and every dish was excellent. If the portions were more generous, this would easily be a five-star review."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNm9iYXFnRRAB",
            "text": "Such a lovely place with a pretty view. Had a round of oysters and an avocado toast! My friend had the Eggs Benedict and they loved it. Though I have to say, the avocado toast.. the bread that it came on was incredibly hard to cut through. I was offered a steak knife though which helped! It was also a little hard to eat it in general since the way it was made was beautiful but not very easy. The service was absolutely lovely, they were so attentive! Also a great place for large parties."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMkpqd1NnEAE",
            "text": "This place was amazing. From the minute You walked in, it felt warm and cozy. Then we sat and ate. The food presentation was beyond amazing and the taste... wonderful. We ordered the chicken and the steak. Then came the desert. Made by a…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyd29pWEZnEAE",
            "text": "Re-visited american brass after loving it the first time, and had a rather different experience. Service was slow but we understood given it was a holiday and thankfully the food made up for it. The filet and potatoes dish was magnificent & seasoned to perfection, we also loved the spicy tuna appetizer. Last time we came our waitress angelina was very attentive & accommodating we were hoping to see her today but nonetheless food was still great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1LUlMTVR3EAE",
            "text": "The 5 of us had been here for brunch on an overcast Sunday afternoon without reservations! Bold move that was, but we were lucky to get a perfect outdoor seating including a high chair for our little one.\n\nMichael our server was welcoming and friendly and got us started with some amazing beers that they have on tap which included a pilsner and an IPA. No specials on drinks though and the Bloody Mary's did look pretty good!\n\nI ordered the little gem salad ($16) which was well presented and decently seasoned, a rather overpriced Smoked Salmon Benedict ($21) which was tasty, an interesting yet limited portion size of the Avocado Toast ($17), Fried Chicken Sandwich ($19), and a Vanilla Bean Panna Cotta ($13) which was really good.\n\nService was absolutely excellent, and Mike was attentive and helpful throughout our stay here. Restrooms are clean and overall American Brass has a very inviting vibe to it. Noise level was average and it was easy to have conversations! Pricing was on the higher side though.\n\nOverall a very positive experience, and we might visit again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaE1fRjBBRRAB",
            "text": "I was on a day mission to explore different parts of New York, found myself in Long Island city. A ferry away from Manhattan. I saw the lovely fine dining restaurant: American Brass on my way. I didn’t have a reservation but luckily they had availabilities especially that I was there solo.\n\nThe service is amazing. The atmosphere is nice.  I ordered the Lobster Agnolotti; it was the best lobster pasta I have ever had. I wished if the portion was a bit bigger but all in all it’s worth it.\n\nGive it a try :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkLS1mTXlnRRAB",
            "text": "Best experience!! We had a private event at American Brass in January for about 20 people. Everything was perfect! The restaurant is gorgeous, and the food was delicious! We loved the style and atmosphere of the restaurant. Our menu included a champagne toast, appetizers, their amazing focaccia bread, steak frites, the polenta, passed desserts, and a cake. They were also able to accommodate a vegetarian option. It was all so good!! Everyone really loved their food, as well as drinks at the bar afterwards! The staff are all incredibly friendly and accommodating. Tegwyth, American Brass’s Events Manager, was so thoughtful and instrumental to planning our event! She worked closely with us for months leading up to the party and had great suggestions. Ellen, American Brass’s Executive Pastry Chef, made us the most beautiful and delicious cake. Everyone was raving about the cake! Juan, our server, was also phenomenal and went above and beyond. The restaurant is directly across from the Gantry Park Piers, great for photos. Everything was beautiful and polished. It felt fancy and well put together. Highly recommend American Brass and their team for small weddings and events! Thank you again!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5Z1pYcmZnEAE",
            "text": "This was such a great spot for brunch. Many places have decent fare with passable cocktails. But American Brass is pure Gold!\n\nPossibly the best cocktails I have had at brunch. Excellent food and simply irresistible truffle fries. The service was excellent. The place had small  outdoor insulated glass house structures which accommodated all 7 of us  This allowed for a safe brunch during the pandemic and winter!\n\nFor vegatarian/vegans - they do have an Avocado toast which can be made vegan. As can the truffle fries."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1LWFpWlhBEAE",
            "text": "Nice restaurant in Long Island City. Amazing location with beautiful view. Very classy place with good presentation on dishes. My branzino was just a fish would be nice to have some side with it but I guess presentation of food more important. Servers should be more attentive we never got refill on our water. But in general food taste good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeTdIRGtnRRAB",
            "text": "My husband and I are eternally grateful to Tegwyth, Michael, and the entire team at American Brass for making our wedding last month everything we wanted it to be!\nAfter our last venue left us high & dry just a few months before our wedding day, Michael responded to our inquiry the same day. We immediately fell in love with the subway tiles and gold fixtures.  We had the most amazing pictures taken with the skyline in the background. Truly a stunning restaurant that is so spacious, but somehow still made our wedding feel intimate.\nThe service was amazing and everyone there was so kind and attentive. Tegwyth helped us with any requests we had and supported us completely. She's extremely detail oriented, and we couldn't have asked for a better events coordinator!\nAnd most importantly, the food! If you want your guests to rave about your wedding food, please go here. By far the most difficult thing about having our wedding here was choosing our menu. If possible, we would have had every dish. Everything was prepared beautifully with generous portions.\nWe look forward to having many anniversary dinners here!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2ako3ZXhnRRAB",
            "text": "Very nice and classy place with a great view. The ambiance is nice and clean and you have outdoor options with can't beat view of the city right across East River. You will be able to see Manhattan skyline from midtown to downtown. The food was also very creative and tasty,  we ended up re-ordering their beef tartare as well as couple of other appetizers. Will definitely recommend this place."
        }
    ],
    "reviews_count": 81
}