{
    "name": "Vista Sky Lounge",
    "place_id": "ChIJAemDtCxfwokRrfHv58ZtcxA",
    "grid": "QN1",
    "address": "27-05 39th Ave, Long Island City, NY 11101, USA",
    "rating": 4,
    "user_ratings_total": 1000,
    "phone_number": "(347) 536-3640",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dGRsZFhZV3BrU0VWS1dsUmZPSFUxWmxReU9VRRAB",
            "text": "Beautiful views. We picked this restaurant for the views and where very impressed with the food. Service was excellent too. Highly recommend."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRWJuTkRXbHB1UWxsbVFuUlZhMDQxWVRBdFZsRRAB",
            "text": "Food and service was both great and the view is absolutely magnificent"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNlZXWlNTRFo2Tm1GVmJ6ZFlTSE5CWjFBMWRIYxAB",
            "text": "We went after dark to see the city skyline all lit up. It was a little chilly (we ate in the outdoor section), so we needed to dress appropriately. But the food, service, and view were all wonderful!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbU5HdFNiRzl3Tm1OMWNsVXRSRjlvYjNwM1ZVRRAB",
            "text": "It’s more like a restaurant and the bartender  who wasbon shift the night I went up there wad rude"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psR1FuVkVOazFMTkVwMFoyTnVkRWxZTjJoelQwRRAB",
            "text": "Great views, lovely ambience!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbUxXNXRabVpaVkhaaFRFMTBSRUZvZGtSQ05uYxAB",
            "text": "Amazing views, especially during the sunset. A bit pricey, the drinks really rack up the bill. The lobster Mac and cheese was outstanding. Definitely worth coming here for the view itself. The tables are very close together because it’s on a small rooftop so expect to hear other peoples conversations."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poZlRFRTBkamxJZEU0Mk5FcE9ia2RqUkhGVlNGRRAB",
            "text": "I went here for a friend’s wedding. The hotel itself is not in a great neighborhood but service was good and it has gorgeous views. Food was decent. It’s a good place for a wedding."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVFlWUnVUVzAzTWpOc2VXNDBiM0kxYzBGWU1HYxAB",
            "text": "Venue needs to improve on its touch points."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNME0yRkpXRW95WjJWU2NuZ3RTVE54UlhOWU0wRRAB",
            "text": "I celebrated my birthday with friends at the bar. They did everything to meet our expectations!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWFlUYzBVMHRqYVU1TFpHMDBRbVUyWTBodmJYYxAB",
            "text": "I cannot thank this hotel enough for their kindness and hospitality. My daughter, our small dog, and I had just returned from a long trip in Europe when we faced an unexpected emergency at home. We suddenly needed a room in the middle of…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSE5HaFdSRjlOTkhneGRrSjZOa0pMVEVkNlNrRRAB",
            "text": "Great views of the city"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdE5qRlZVVEZtZWpGVVp6azNlRFZKWVdsME4wRRAB",
            "text": "Great experience, the rooms are clean and the views were amazing. Rami was very helpful and professional and more than willing to accommodate our requests."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdVUwMVJZMDVSWVhGT00yaGFTWGxETVMxdlpuYxAB",
            "text": "Excellent service from Valeria, good vibes. The food is delicious, and her mojitos are undoubtedly spectacular."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeVFqRnVNbTkwZDBwNVMwRTVhR0ZrTkZrek1rRRAB",
            "text": "My wife and I are in love with this place\nAlexa took care of us very well\nThe view is amazing\nWe ordered tagliata New York strip steak which is delicious\nFor us it’s a great experience to dine here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUlltUk9hREpEVlhOb1pFUTBSVEIxTWtsdUxWRRAB",
            "text": "Went here for my girlfriend’s birthday. Beautiful view of the city, music and atmosphere was good. Lobster pasta was good, nothing crazy but good. Carbonara is really a hidden gem tho, probably best I’ve had.\nService was good, white lady with black/blonde hair tho was amazing. She was welcoming, really had a warm inviting presence. She walked around and made sure everyone was okay. She even helped with a last minute birthday request.\nOur main waitress who looked Spanish, (slight tan, all black hair) was okay, didn’t really give off a friendly vibe . She wasn’t rude or mean but just didn’t feel approachable. She was professional tho.\nOverall experience was a 10/10, great place for dinner with a view.\nP.s. Ocean blue drink was delicious! Taste like pina colada 😋 really enjoyed it 🍹"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUExUbGhSWGR0YVhsWVJXOXJibTVaYWxkWk5IYxAB",
            "text": "Great view, amazing entertainment, excellent food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WclFXcGxUR0o1TmpJdFZWQm5UV1pEYzA1NmJVRRAB",
            "text": "Ambiance was amazing, food was great, and great service. Served was super kind. We went during sunset time and stayed until like 10PM. The city looked absolutely beautiful. Just the views themselves are worth it. Recommend to go during sunset-evening times. Food was also better than I expected. I got lamb chops and my boyfriend got steak. It was perfectly medium rare and well seasoned. Overall appetizer, entree, and dessert were great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOYWMwbDRNVzFvZUVocGFXeGFiemhpZDFrdFgzYxAB",
            "text": "This place is my special date place! Amazing people and the view OMG!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMVgwUXhWalJNUlVaVUxXbG9hVlphWkdSalFuYxAB",
            "text": "Great food and drinks excellent staff and the view is spectacular!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xM01rTlFUM0pwV0VSU05FcEpUekYyU1Rsb1VGRRAB",
            "text": "This place had a great view and vibe. Unfortunately the food was more miss than hit and the drinks (2) felt like I drank two cotton candy coca-colas (liquor??) but the people were nice and the manager was great! Will try it again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3dFVuaDZjbkl4Um5sRWIwMVJWM1pCYXpodU5VRRAB",
            "text": "This rooftop bar is incredible! The city skyline views are breathtaking, the cocktails are on point, and the valet parking makes getting in and out effortless. Perfect spot for a night out with friends or a special evening above the city."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORFlVOUJRalY2UVROcU1WRXlUMkp5YW05eFFVRRAB",
            "text": "Food is so delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMk5IVndZM1JsZDJadmVrcFJhVTUzUlhWQlRFRRAB",
            "text": "Service was good, everyone was so kind! Truffle fries were excellent too, will be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGd2JUbFFOSFZ2UlVnNFFXcFpTV280ZWt4UmNWRRAB",
            "text": "Beautiful yet relaxing place, love the service, the food, the staff are even nicer,  and here a few times already, truly one of my favorite Rooftop Bar,Lounge/Restaurants. I can’t describe enough how great my time has been? Every single time I’ve been here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200dFJHczFYekZ4TmtkV1luRm5lRko1TjFCUVVVRRAB",
            "text": "Good option at NYC, all very near"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDOXJDSWNREAE",
            "text": "This is my fourth time here and I must say they changed for the positive. The atmosphere is amazing. Why?? The staff is beyond professional. From the managers to waiters everyone was friendly. My drinks and food arrived fast and tasted amazing. My waitress Martina really was efficient and diligent. Her service was impeccable. Definitely a place you should go check out. Especially in the summer time. Great views"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTE1HRlJRM1E0WjFkRFpFc3labmMzWDNoUVdWRRAB",
            "text": "Unfortunately, all these reviews are true! I should have listened to them before I came here. The service is quite poor, and the food is mediocre at best. I regret coming here and definitely do not recommend it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa05rZ3hRbXcwTVhCZk1UZHVWRGR1VkVNMVluYxAB",
            "text": "Food was really bad and seasoned badly\nOnly thing that was good was the truffle fries\nChicken kabab lacks perfection\nOrdered 2 lemonades which came with ice but somehow felt like I was drinking hot coffee\nI hated it and I had a really important guest that I decided to invite to this restraunt and both of us left disappointed\nThe bathrooms are porta potties with hot sink water\nOnly good thing about this restraunt was the view\nOther then that everything is bad\nDon’t recommend anyone coming here"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wc05FWk5TM1ZHTFZWc1VXMVFWbXRQY2tOZk5sRRAB",
            "text": "Great service and an excellent view. Will not disappoint"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xb1dtd3RUR0ZZT0RCT2QwUlFialp3VmtGVWVYYxAB",
            "text": "my order took 1h20 to arrive, we were celebrating birthday and all the table received the order and missed two that probably forgot and did not want to take the blame when I complained. other people who arrived after us had already dined and we were still waiting and no one gave a solution or answered and still collected the tip"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeFVuRXdkRXRhTXpkaVZuRjVRbEpuYUVSdlkwRRAB",
            "text": "Great sky roof restaurant and bar in LIC. Views of manhattan and boroughs.  Delicious strawberry mojito.  I had taco Tuesday special."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aalgwSm5kMUJLVVZsTlNIcDJUMVkzVFVwM1IzYxAB",
            "text": "The food was ok. We ordered medium well lamb chops and they overcooked them. No bread at all.  They were Over seasoned with salt. Our first beers were hot, not warm.\nThey charge us for the bread.  Then the waitress helped herself to 18% tip that came out to $26. The tip was already included  This is why I don’t believe for the TIPS to be included because everyone is at fault when things like this happen.  They could have at least offered us To pay for the beers and maybe buy dessert . But no, nothing was done and they hammer us with the tip I didn’t say anything to the owner, which I believe he was there because I just wanted to get out\n\nThey lost a customer. By the way, get bigger cushions for the seats in the back so that people don’t break their backs when lounging."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaGFuaEVlRmRpYUVoVU9XTjFhVEpDYzBWRVMxRRAB",
            "text": "Great rooftop spot!\nNice atmosphere with a beautiful view. The food was tasty and fresh, and the cocktails were amazing! Perfect place to relax with friends or enjoy a casual night out. Friendly staff and good vibes all around. I’ll definitely go back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Zd2FIRnlXR3QyTTJoaGNrSktOMnhsTmtSSWNIYxAB",
            "text": "Great time with friends on the Rooftop. A little steamy due to sun but beautiful view. We enjoyed the food and drinks and had a good time together"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaGFETlZPVmRDY2xGblduTk5jbU5KZUVKV1UyYxAB",
            "text": "I went here for 4th of July fireworks. I was not impressed. The package included food and one cocktail drink. The food was decent. Buuuut the fireworks were so far away it made no sense to even take pictures. That was very disappointing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wM01WOXhWalZLYUVaWFFXdzBXa0o1VjJ0eVNVRRAB",
            "text": "it was a wonderful place to celebrate my birthday with a lot of wonderful workers who was very kind and helpful celebrating. Really worth going there. 🤘🏼🎸🥂"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWlRqUlVTMjlxWlhJd2NYWjFUVXB1ZVhOWGEzYxAB",
            "text": "Customer service was exceptional , amazing views of New York City . Waitress Zuleyka was amazing with service"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RdGMwNUVhR1o1V0ZwbE9YWk1aVWhwY1ZkNGQwRRAB",
            "text": "El lugar es hermoso ‘ las atenciones son buenas ‘ sólo una sugerencia ‘ deben poner ventiladores porque ahora hace mucho calor ‘"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWemFtbGZZbWhzWXpWeWExWk9lVkJzV2xCQkxVRRAB",
            "text": "So we walked into Vista Sky Lounge expecting Emily in Paris… and got Survivor: Rooftop Edition.\n\nWe made a reservation a week in advance. A whole 7 days. You’d think they’d roll out the (rooftop) red carpet, right? Nope. We walked in, said, “Hi! We have a reservation!” and they looked at us like we had just asked to host a magic show on the roof. Total confusion. Like the idea that someone would actually show up for a reservation was shocking to them. Groundbreaking.\n\nThe pictures online had us thinking we were about to be clinking glasses under the stars with a skyline behind us. We showed up at 6pm, dressed cute, feeling romantic… and they said, “You can sit outside at 7.” I’m sorry, is the view on a lunch break?\n\nTo hold us over, they tried to seat us at a coffee table outside. A literal coffee table. Like we were about to play Jenga, not eat food. I didn’t know I’d need to stretch before dinner. I was one crouch away from pulling a hamstring.\n\nStill determined to have a good time, we got chips and guac. Big mistake. The guac tasted like it had been left unsupervised. No seasoning. No vibe. Just… avocado in crisis. It was like someone had mashed it with a calculator. Even the chips were like, “We don’t know her.”\n\nThen we got drinks. $18. Each. One sip in and I was like… is this juice? Is this vinegar? Is this a social experiment? It tasted like someone dropped a lime in a glass of confusion and charged me rent for it.\n\nAnd THEN. We ask for the check, and suddenly the waitress turned into a moody film student. She wasn’t rude exactly, just… deeply over our existence. Like she sensed we weren’t going to order the $49 salmon and took it personally.\n\nThe check came out to $50 for guac, two “drinks,” and an existential crisis.\n\nFinal thoughts: if you enjoy mystery flavors, Olympic squatting, and paying premium prices to feel like you’re sitting at IKEA during a blackout — Vista’s got you. Otherwise, save yourself. Buy chips, make guac, stand on a chair, and look out your window. You’ll get the same vibe for $4."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sc1REbHBYM2hQVVc4d1dGTmxTMk42TWpsdlNIYxAB",
            "text": "We had the pleasure of eating here friday night june 13, 2025. service was very nice. the food was EXCELLENT the desserts drinks even water. very pleased."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMlRXWXRZVkJSU25rMlFURlZPSGRJUVROcGFFRRAB",
            "text": "Don’t usually write reviews but I had to because this place was amazing. Great view, great service, friendly atmosphere, food and drinks were both good. Highly recommend and for sure coming back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMSEs3ZEd5dnQ3VVpBEAE",
            "text": "We had an amazing experience at Vista. The food was delicious and the view breathtaking! Our server Maria C. was really nice and we will come back to see her 🩷 she was exceptional"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJckR0dkMxZ3ZiSXhnRRAB",
            "text": "Visited this spot back in March for a friend’s birthday — it was a last-minute choice, and luckily, getting a late-night reservation on a cold winter evening was easy. The place was pretty empty when we arrived, which wasn’t surprising given the weather. I’ve heard it gets much busier during the summer, so keep that in mind if you’re planning to go during peak season.\n\nThe venue itself is cute — definitely the kind of place that works well for casual drinks with friends. But as far as the food goes, I was really disappointed. There were a few of us, so we sampled a range of dishes, and unfortunately, almost everything missed the mark. Even the guacamole tasted store-bought rather than freshly made.\n\nI had higher hopes for this place, but based on the food quality, I wouldn’t go back for a meal. Maybe just drinks next time — if at all."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLTJ1WnlkaDlDUFVnEAE",
            "text": "Great Food and Atmosphere"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOM0ZsN1drZ09HeXRBRRAB",
            "text": "Got there at 7:15, got seated 5 mins after arriving WAITED 30  before even seeing the waiter, then waited 40mins for our drinks and then waited 2hrs and still no food waiter was MIA, no communication no checking on tables we just sat there and watch some of the workers stand around doing nothing, just paid for my drinks and left absolutely ridiculous and it was not just me it was 4 other families as well. Like why take so many reservations when you cant tend to them,  never going back and no one should ever go."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObW1pb19KdzVPTmVBEAE",
            "text": "I loved the view from the rooftop. The sunset was spectacular, and I tried the lychee martini, highly recommended, along with the fried calamari. I’ll be back!"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb3J5SkV3EAE",
            "text": "Magnifique petit joyau dans le queens , et une vue à tomber par terre sur Manhattan. La serveuse a été adorable , a apporté des crayons et papiers pour notre fils sans qu'on ne demande quoi que ce soit .Nos plats étaient délicieux et l'ambiance est super sympa. Si vous y fêtez votre anniversaire , je recommande , elles font une petite célébration spéciale ^^"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeU9qQnNRRRAB",
            "text": "Excellent service and food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMjREQ0F3EAE",
            "text": "My friends and I spent NYE at Vista Sky Lounge to ring in 2025. This place by far had the best pricing that included food and drinks. The restaurant was located at the top of a hotel in LIC. The food was fantastic, we enjoyed a four course meal that included a beet salad, mushroom ravioli, rib eye steak and a chocolate lava cake. Everything I had (and there were other options) was fantastic. Regarding drinks, we did have an open bar experience but I wish they had offered a premium open bar option because the drinks were lacking. The restaurant was crowded so it took a while for our drinks to get to us but they weren’t great and options were limited (no grapefruit juice or tajin for example). The people in my group drinking beer had no issues. The one other thing that was missing was good music, at the very end of the night they began playing great music but otherwise it was generic/techno. After midnight, we were able to see fireworks from the rooftop which was really special."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1NlAzcVBBEAE",
            "text": "I’m so happy with the amazing treat I had today celebrating my birthday. 🥳🎉 Since I got there the smile of the people receiving us. The lady found us the table so quick even after being late on our reservation. She accommodate everything the way I wanted. The tacos were so good. They were so nice by getting us the cake 🍰 with the amazing candle and they put the music we wanted. The waitress and the rest of the team were so much attentive and careful with everything we needed. We were 6 and the total amount was pretty decent. We gave her a good tip for the amazing service and work she did. At the end, all the team of the restaurant, treat us so well and they were really paying attention to every detail so we can feel comfortable and happy. And we did. In a brief review, You will see an amazing view from Long Island city to Manhattan, great food and great service.\nGod bless you and Thank you for making my birthday unforgettable! 🥳🔥💕"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqek9LNVZREAE",
            "text": "Took my wife there for date night. We sat outside on the roof deck. The view was amazing. Service was a bit slow. We are assuming because it was a Monday. Otherwise, the food was okay, and drinks were delicious."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcGYzTE9BEAE",
            "text": "My husband and I got a drink each and the shrimp cocktail to split. The shrimp was just slightly over cooked but the cocktail sauce was good. The drinks weren’t the best but they were pretty creative."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJLV9maERREAE",
            "text": "We had 3 lobster rolls, and deserts for the birthday of my friend. She felt special with the music and candle, thank you very much! The lobster rolls must have!!’"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGaHBLLUZnEAE",
            "text": "Wanting a beautiful view of the NYC skyline, we walked to this rooftop bar as it was close to our hotel in Long Island City. From the moment we walked in, greeted by the staff, to the moment we left, it was an enjoyable and memorable experience! Our waitress was also so friendly and offered suggestions  on the menu. It was a warmer than normal November evening, but come dressed accordingly if you want to sit outside. Spectacular views, and ambiance! We didn’t feel rushed and enjoyed soaking it all in as our last evening in the city. Just come here and enjoy views without paying a premium elsewhere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOX3NINk9BEAE",
            "text": "This place is a great place for taking pictures and getting really good cocktails with a view. Does not matter the time of year. You can go out on the deck that looks over Long Island city and shows Manhattan as well. It is really spacious so it’s great for larger groups. They have food as well. Not the best quality or taste but still ok to go along with drinks."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bXFmMndBRRAB",
            "text": "I visited this place for some cute pictures and a nice lunch, and that’s exactly what I got! The manager was so kind and accommodating. I made a reservation for 1, which was a good idea because this place filled up rather quickly after opening. My res was for 3pm and by 3:30 4-5 parties came in. I had the spinach and cheese rolls for my app and the lobster pasta for my entrée. I just got plain pineapple juice to drink. The app was SO GOOD I saved some for lunch the next day. The pasta was just okay, I expected it to be a little better to be honest. I would have preferred a creamy Parmesan sauce rather than a tomato based sauce.\n🚨Also, a 20% gratuity is added to the bill regardless of the amount of people so just a heads up.🚨 My bill was around $70 due to the tip being included.\nOverall the service was great and the atmosphere was lovely, even on an overcast day"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcmUybFp3EAE",
            "text": "The food was great and it was well catered for a small party or conference. The view was fantastic. You can take great pictures upstairs."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCaXBUU1BREAE",
            "text": "Food was good and the atmosphere was good. Great music selection. The space was very tight, not much space between tables and not much elbow room at the table itself. We were seated by the door that leads to the bathroom which was annoying because every time the door opened and closed, the cold air would come in.\nViews from outside area were beautiful! We may come back once it's warmer out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydnFhV0ZREAE",
            "text": "If you want to spend an exciting and enchanting time with your spouse, husband, or girlfriend, we'll the Vista Sky Hotel is the place to go! All you have to do is take the elevator to the 10th floor. Once you get off the elevator, you will feel like you are a part of New York City. The feeling will engulf you! Take a seat and be ready to enjoy yourself. Around 7:30pm, the sun 🌞 starts to set. By about 8:45, the sun is meeting the horizon, and the sky is a bright orange. I had a fabulous time being outside. The air was perfect, and the food sublime. I order thr chicken kebobs with vegetables and fries with tzatziki sauce. I chose a mango monitor as my drink. The pairing was perfect. If you are ever in Long Island City, why not stop by the Vista Sky Lounge? You will be pleasantly surprise."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYazVTajRBRRAB",
            "text": "Me and my family went here to celebrate my sister in law’s cousin’s birthday and the ambience is just nice. The staff were very friendly and helpful. We enjoyed the food, we had the lobster roll and vista burger and fries. 👌🏼"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaU1TenR3RRAB",
            "text": "We couldn’t be happier with Vista and Bill and his team.  We had our wedding reception in late May and everything came out beautiful and amazing, especially with the city view backdrop! The food was spectacular and our guests enjoyed the venue very much! Thank you Vista for being a part of our memories forever."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMlBUNld3EAE",
            "text": "Vista is a cute rooftop place. It seems very well suited for small groups and party events. Also good size for small business luncheons. The food was good and had a few vegetarian options. Their Greek salad 🥗 (and all salads to be honest) were delicious and their truffle Parmesan fries 🍟 were awesome. They offer to take pics of you and your group but they charge for the picture print out with a cute simple frame for $20 each picture you want. Normally I would not buy it but since we celebrated a milestone birthday, I purchased one. The ambiance was nice and had cute spring flowers decor. I recommend this rooftop."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeFpLbmlRRRAB",
            "text": "I went for my birthday and it was beautiful. The staff were very friendly and keen- checked in us to ensure we are good. The food is heavenly omg…. So delicious, no complaints whatsoever- completely exceeded my expectations. On a cold…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhelplVkd3EAE",
            "text": "The place is beautiful, with one of the best views of the skyline. The drinks are well done, I loved the variety of craft cocktails, my favorite was the Rosa Margarita with watermelon flavors and infusion. Food was ok, it could be hotter, the octopus was delicious, and the seafood pasta was a really good portion. This place is amazing for birthdays, meetings, and dates."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMXV2ZmxRRRAB",
            "text": "We had to wait more than 1 hour, ask the waitress and she said they had lost our order, after 20 more minutes of waiting the food did not arrive. None of the waitresses took responsibility. Bad service and they didn't even apologize. The food was cold, really nothing to enjoy. They brought us the food again but it was the same as before only reheated."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcHNPMjB3RRAB",
            "text": "There’s nothing like a romantic dinner date to set the mood and show that special someone that you care. It’s just something about candlelight,  soft music ,very nice cocktais , fantastic view from 15th floor and delicious food that makes the heart flutter.\nIt’s an irresistible truth that food and romance are inextricably linked in an intimate setting.\n“One cannot think well, love well, and sleep well, if one has not dined well.” A romantic evening fills the senses when you celebrate it with someone special as you savor a lovely meal together.\nI am very happy to hear my friend and I came for my anniversary with my wife at the vista sky lounge bar! I recommend it to you and I am sure either with friends or the person you love you will have a great time !!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1djlhXzJ3RRAB",
            "text": "First off the furniture is very outdated. The tablecloths are black which attracts the heat and makes the rooftop unbearably hot, they have no AC but only 2 fans blowing.  Service is slow. Only accept 2 CCs per table no matter how large the party is and tell you when you're paying. They automatically add a 20% gratuity even on a single drink (SMH)! Lastly, this place serves NO COFFEE! 😮 my Italian friends were very disappointed after dinner. Food was okay. Will probably not go again."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeTZpWnBnRRAB",
            "text": "Came hear for 2 reasons ... 1 to check out a new rooftop I haven't been to before and ... 2. Have a drink ... neither disappointed... it is atop what i presume is a hotel, and  both the views and service were on point ... The staff was super friendly and the bartender who is great at his job I gotta say made me two great drinks but also was very informative about these drinks. 1 drink I was not a fan of just because of its natural bad taste of the drink itself but the second drink a strawberry Mojito, was one of the best I've tasted in a long time... I also must add that my server was super friendly and respectful of the fact that I did not enjoy my first drink in the slightest .... I would strongly suggest checking this place out for both the views and the drinks as well and/or if you are trying impress that certain someone on a datenight ... I did not try the food so I can't speak on that, but I will Def have to go back again in the daytime to check the food ... it is a Lil on the pricier side, but it's not as bad as your average spot in Manhattan, just more expensive than some other spots in queens ... but hey LIC is more expensive period, so you can't be mad at that ... overall I'd give this spot a good 4.5/5!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYd1kzbXVBRRAB",
            "text": "Lamb Chops were just OK. Have had better. The burger was not very flavorful. Was supposed to have some sort of paprika aioli but couldn't taste it. Also supposed to have caramelized onions but had about three tiny strands of onions. Views were cool and the people very nice."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpNXRDREJnEAE",
            "text": "PLEASE GO HERE !!! Beautiful view, the food is AMAZING  !! And the owner is so wonderful ! I enjoyed my birthday and they cut my cake and served it for my guests so neatly and beautifully !"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMTk3N1l3EAE",
            "text": "I had a great experience super nice neat clean service was awesome the food great the only down low will be the waiting to get the drinks . Overall 9 out 10 keep up the great work looking forward to try more from their Manu food was delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuLVBYMGtBRRAB",
            "text": "The view of the city is fantastic and the staff is very friendly while the food is okay but the cocktails are delicious. I recommend to call before go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOF9YRldREAE",
            "text": "The view of the city is amazing, especially at night!🤩 Lobster roll is my favorite! Sooooo good 👍🏻"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bDYzN1ZnEAE",
            "text": "Great location to visit NYC, 20 minutes from LGA.  Wonderful view from the rooftop deck and lounge."
        }
    ],
    "reviews_count": 74
}