{
    "name": "Tournesol",
    "place_id": "ChIJ2zaeXSNZwokRKugqI9AMNjc",
    "grid": "QN1",
    "address": "50-12 Vernon Blvd, Long Island City, NY 11101, USA",
    "rating": 4.4,
    "user_ratings_total": 688,
    "phone_number": "(718) 472-4355",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcmQzQm9hR1ZUUWtnMlVtbDJTR2x6Umt4NGVHYxAB",
            "text": "High mid slap"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVVgyUm9WVWhaYkVGM09FTlJjV05QUWkxQ1psRRAB",
            "text": "You can only pay with cash or american express. Otherwise, they make you go to an ATM"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjek1XcG5UWEIxZDBKd1QyZEJjbHBEVWpWSGNFRRAB",
            "text": "Dinner for one, Friday night.  Price: $87, $15 tip. Had appetizer, entree, dessert, glass of beer, glass of wine, bottle of water.  Let’s break it down!\n\nI was seated a few minutes after walking in, ice old beer came immediately.  Waiters/staff are direct and to the point.  No fluff, no nonsense. (I’m ok with that- they’re European!)\n\nAppetizer: The shrimp/chorizo salad was tasty, but light. I would have preferred more greens, less raw onion and maybe a lemon wedge for the shrimp. Portion could be bigger.\nEntree: Garlic chicken.  Grilled nicely but a tad dry, the sauce saves you.  I was not a fan of the mash…whatever that was.  The chicken already has strong flavor of garlic, I don’t see the need to have more of it in the potatoes.  It needed salt and most DEFINITELY butter.  I was surprised I tasted no butter whatsoever, especially in a French dish.  I recommend another side like a sweet potato or a just adding butter to whatever is being used instead of chucks of garlic.  It was overbearing and heavy. Moderation, please.  Portions for this dish were very generous.\nDessert: no complaints at all. Cleaned the plate.\nWine: ordered the 2023 Pinot noir,  went well with dinner. Inexpensive and easy to drink.\nService: timely, and professional. The waiters don’t hover over you and come over quick when called.  I will return to try to some different dishes. I like the simplicity of the place but I wish Americans became more aware of how obnoxiously loud they are when they’re speaking in such a small, quaint restaurant.  Contain your conversations, Brad.  I can smell your breath from here."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd2VFRk9PRzlFZUMxUVdrbEpOMWx6YVd4MFluYxAB",
            "text": "This French restaurant is a cozy little jewel in LIC.  Service was good and the food was delicious. We took our family for brunch.  I think it could be a great date night place. I will say that there are a few rough looking characters that hang out on that area of Vernon. There’s a police station right around the corner but still be alert. I wouldn’t let that stop me from going there for a date."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWU5tNVZWSGM0T1dkSFIyUnJOa28xVm05YVVVRRAB",
            "text": "Tournesol displayed its values through service and food. Workers showed good manners and I felt absolutely content. I read good things about this place before visiting. Everything feels carefully selected. This place has me excited to come back."
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTlZ5MVpRVWhJTnpSeFJIcHBOVXB6UWtKclJsRRAB",
            "text": "On se sent vraiment chez nous bien que nous soyons au USA .\nUn big up de Montpellier 🇫🇷"
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMk9FbEthVmxVU2xCVFQzVXdXSGx6ZG0xR05FRRAB",
            "text": "Belle expérience dans ce restaurant avec des bons et délicieux plats ;) mention spéciale aux serveurs"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toU1pHVXhTa3RmVG0wMFRtZEhNRnBmVjBwa1pVRRAB",
            "text": "Excelente service, atmosphere and service !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcWIyWmtlbTFVYlV0Wk56Rk9Talp4ZUZBME1YYxAB",
            "text": "I do not recommend this restaurant. Dirty toilet, fries that look like they were soaked in oil, terrible service 😒…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdFYzSmFaVk5zZG1WMWJWOTRVRWsyT0hoVldVRRAB",
            "text": "Not toddler friendly, no high chair available"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RlJEZFVSRFZKYTI1T2RXNTZlVFp1TUcxVExXYxAB",
            "text": "Wonderful authentic French food at moderate prices.  Delightful staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeVJrRnlaMWRvYkdZemJucFFaMEZxUW1ab1dYYxAB",
            "text": "Such a gem! We’ve eaten here a couple of times and absolutely enjoy it. Great food, great prices, and a very typical French experience overall (and amazingly doesn’t suffer from crowds of screaming Americans that try their best ruin your intimate date night…).\n\nThe skate is def worth trying. It has a very tender and mild flavor. And of course the beef bourginon and soupe a l’onion are staples. Service is prompt and caring. Just what you’d expect of a traditional neighborhood resto that’s been around for ages.\n\nThis isn’t for the insta famous crowds. It’s for a local couple who wants a solid meal for a solid price and a consistent experience."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPb0tEaEF3EAE",
            "text": "I have never had better service at any restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVVRXWnROMmwwVW14bGFtSllNREY0VjFCR2JWRRAB",
            "text": "Excellent French food, very authentic!! However only accepts AMEX and CASH. Come prepared."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRd1lYUlhjRGd6YVRKMmJGb3plV2x0TVZGUmMwRRAB",
            "text": "My Wife and I have had many memorable experiences at Tournesol, and for good reason. Everything about Tournesol is Passion❤️🔥❤️🥂\n\np.s. If you plan to bring your young Children to Tournesol, PLEASE be as certain as possible that they are respectful and ready to experience more than “French Fries!”\n\nMerci Team Tournesol… Rich and Denise Co-Owners @ 3x GRAMMY Award Winning MONOLisa Studios in LIC"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQ2EwZGFNMWRXTWpSelNYazBibVJyYkVSdFZFRRAB",
            "text": "Nice spot for a dinner date"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KM05HcFlNRFZNZW5KVFNFMVJhbEIyVkc1S1RIYxAB",
            "text": "Good French cuisine for reasonable prices. Glad to have this option in LIC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMGRFeFpZMEZOVEdGSGFuaG5ZelZTU0RJd2RWRRAB",
            "text": "A long time fan of this spot for brunch. Have gone there more than 10 times , Left with a pure satisfaction every time we went. However the dinner that I attended to celebrate our anniversary was really disappointing.  We were 5 and ordered two mocktails, 2 cocktails. Three appetizers and a soup and four main courses and four desserts.  The cocktails didn’t have any liquor in them maybe a teaspoon, and undistinguished.  The food was bland and flavorless my rare flat steak was tough as rubber and came with some scrappy lettuce while other tables had it with a well placed watercress salad. . The pepper sauce that it came with accentuated the burn flavor of the steak so I had to ask for the Bearnais sauce. The only main that was appreciated were the mussels. Their signature dessert - crème brulle is our all time favorite, unfortunately this time,  it was warm and curdled. One consolation : I have to say the service was attentive but left with some sourness as the only south Asian clients we weren’t offered any complimentary drinks nor the merengues which they offered to all the other whites folk when they asked for the check. I don’t think I will ever go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WU1IxbHJkRk52TjJwRFpWQkVWbVk1V1dzMVVGRRAB",
            "text": "Very disappointing experience.\nWe booked for a group of 8, including children, but it quickly became clear that this place is not kid-friendly at all. The space is extremely cramped, and the overall vibe was unwelcoming from the start.\n\nWhen we arrived, we were actually 10 people. Instead of helping accommodate us, the staff insisted on separating our group into two tables — even though the tables were literally next to each other. It didn’t make sense, especially since we ordered a lot of food as a group.\n\nTo make matters worse, the 3 people at the second table only ordered some French fries and a cocktail (since the rest of the food was shared across the group), and the staff told them they needed to order more or they couldn't stay at the table. That was just ridiculous. We were clearly one group, we were already ordering plenty of food, and yet they still made a big deal out of it.\n\nOn top of all that, the staff was visibly rude and unfriendly — especially toward our kids. If your restaurant isn’t welcoming to families or children, just say so upfront. There’s nothing wrong with having a no-kids policy, but don’t accept family bookings and then treat us poorly or make us feel unwelcome once we arrive.\n\nOverall, the service was rude, the attitude was unprofessional, and the experience was far from enjoyable. We won’t be coming back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWlpuUmlaV1p3VUVKNFZuWndNM28wZVVGUlEyYxAB",
            "text": "Just got back from France, and dining at Tournesol felt like we never left! This authentic French restaurant gave us a truly wonderful experience.\n\nWe were greeted warmly upon arrival, and the owner’s kindness made us feel right at home. Got a nice bottle of wine to start. For appetizers, we had the duck tartine and the crab cake special with lobster gazpacho—absolutely delicious and full of flavor.\n\nFor entrées, we went with the specials: lamb shank and a white fish dish served with polenta. Both were cooked perfectly, rich and comforting just like a true French meal.\n\nTo finish, we shared the chocolate mousse and crème brûlée, which instantly transported us back to Paris.\n\nThe atmosphere is cozy and intimate—not too loud—making it a perfect spot for conversation. We loved everything about this place and will definitely be returning. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZM1VIcHRaRzFmVUhOTFJGVnNXalJoWTBaaVdFRRAB",
            "text": "Wonderful food, impeccably authentic, with a warm familial atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21welVsaE1SREJzTVRGeWMxaFVaWGhMU0d4b1NuYxAB",
            "text": "Just the best, great food, great people."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dmNYSlFZM2N4WVhkcGJuTkVVamRRYkRGRWVsRRAB",
            "text": "I ordered the Trout…Surprisingly, Fresh flavors,  touch of Lime…The vegetables cooked just right Not overcooked. The Duck was Perfect temperature and Such Perfect sauce…Oh, My Salad -crisp & The Dressing a Good Compliment! Finesse!\nOur Servers, a little blunt…But Accurate…What ever We needed.\nThank You, Its been a few Years…only as Good as the Last Visit…This was Delicious…We’ll be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVWNVcFNWalZsV0hnNVRrSkdlVGhLUTBGZlZuYxAB",
            "text": "This was one of the best meals I have ever had. The trout was spectacular. The vibe is also incredible."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUWR6aEJjVlJhU1hSRFYyOVhZVloyY1ZSdVpHYxAB",
            "text": "Food is over cooked and they say, it’s like that."
        },
        {
            "date": "4달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeFpqSnZOVWxpY0hwV1RUbE9abWxtYVVZeVIwRRAB",
            "text": "青口和鴨胸非常美味🤌🏾🤌🏾🤌🏾洋蔥也十分好🫶🏾love it 😗老細也好友善"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbmVGOHlVRkJPTlhwYVJWTkRWRWRVVldsb2VGRRAB",
            "text": "Excellent French bistro.  Strangely, they only accept cash or American Express cards, so just be prepared ahead of time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJR0p2dVB2bm9LdGxnRRAB",
            "text": "Every element works together to create something special. Everything tasted perfect from start to finish. Employees ensure you're not waiting long for your meal. Nothing could be improved. Another experience here is a must."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NE1IVnRZWEl0VmtoRlFYTjVkVXR3WmpOd1ZVRRAB",
            "text": "Love this place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJREZvY1dzNVk2dlFREAE",
            "text": "Iam in the restaurant business!Cash or Amex card !It's an inconvenience they should tell  you ahead of time ⏲️!Beef Bourgugnion and Hanger steak with f/fries both  entries meat extreme tough!......The griled shrimp appetizer, was the only one that stood out the most."
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNT1B2c1MzNjRXM2tnRRAB",
            "text": "Un des rares endroits où j’ai pu manger du magret aux USA. La cuisine est très bonne et le prix est correct.…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJWHZ1N3ZTNjY2TTFBRRAB",
            "text": "Very nice place, always reliable. Just be aware they only take cash or AMEX."
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQcUswT0wwajhxMUFnEAE",
            "text": "Un régal,,une gentillesse incroyable. Bref à ne  surtout pas rater!!MERCI"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOV1luc182cUtMdHlBRRAB",
            "text": "Good food. Good service.  Nice little restaurant in Long Island City next to the subway stop.  Great place to have a casual dinner with friends or family."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZlU0b0dscGFpQnlnRRAB",
            "text": "My boss recommended this place—he’s been a customer for 20 years and still keeps coming back. He suggested I check it out since I live in the area and hadn’t been yet.\n\nI definitely love the vibe! The food is great, and the pricing is amazing. I’ll absolutely be back and plan to bring more friends with me. I’ve already spread the word to my neighbors too let’s support our local businesses!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPUDJfSUtzN3Bqb0x3EAE",
            "text": "Great service, great food, a nice casual spot to meet friends, or bring family for an enjoyable time!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKamY1djdxLW9pQ3d3RRAB",
            "text": "Rude staff, mediocre food, only take Amex and cash. No signs, and no apologies for the inconvenience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPejhvSlBkMThDTURREAE",
            "text": "Small and extremely cute French bistro with a comforting vibe"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd01UQTR3RRAB",
            "text": "I went here for dinner with some friends. It’s such a cute spot. We didn’t have reservations, but luckily arrived just as a table was opening up. It’s a small to medium-sized French restaurant, very reminiscent of what you’d find in Lyon.\n\nThe food and wine were absolutely amazing, and the service was great. Just a heads up if you go, they only accept cash and AMEX. Other than that, if you're looking for a cozy date night spot or somewhere that’s not too crowded, this is it."
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveF9MajJBRRAB",
            "text": "Très bonne expérience pendant notre séjour new yorkais.\nTrès bien accueillis par Patricia🤩🤩🤩…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvek5uR3dBRRAB",
            "text": "We’ve been coming to Tournesol for years and can easily say they are the best restaurant in LIC. Would highly recommend stopping in!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMnRYaHdRRRAB",
            "text": "Laid back friendly atmosphere wonderful service -great food not overpriced."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOC1yWUx3EAE",
            "text": "Had an amazing evening at this lovely French bistro! The space was so romantic and cozy — perfect for a special night out.\n\nWe started with the pâté and the salmon tartare — both were incredibly fresh and flavorful. The tartare especially was so bright and refreshing.\n\nFor mains, the duck was perfectly cooked, and the beef bouillon was rich and comforting with deep, layered flavors.\n\nTo finish, dessert was absolutely delicious — the perfect sweet ending to a fantastic meal.\n\nCan’t wait to return!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNDlta0J3EAE",
            "text": "Great neighborhood French bistro spot. Small cute restaurant with very owners Henry and Patricia and delicious food! Not the biggest menu but they have the classics and staples! The goat cheese beet frisée salad is a delight, the French onion soup is amazing and I don’t rly go for French onion soup! Their fries are somehow perfect. And their coq au vin was prepared wonderfully.. chicken super tender…\nThey have diff daily specials .. I love the cous cous Monday special, love the lamb shank, love the cassoulet\n\nMy dirty martini was perfect, as was my espresso martini\n\nAnd don’t forget about dessert! Bread pudding"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJckxpSWpBRRAB",
            "text": "Excellent food as usual from the folks at Tournesol!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdnNiM21nRRAB",
            "text": "excellent vibe highly recommend\n\nalso quite affordable for the quality\n\nbring a date, you won’t regret it ;)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaUotNGF3EAE",
            "text": "Quaint and little French bistro nested in the heart of LIC, pick any dish and you won’t go wrong, don’t skip desert! Everything is hand crafted by the amazing chef Christophe, heading the kitchen since the opening, 20+ years ago. Great wine selection at reasonable prices, great atmosphere and the comforting feeling of having been invited to dine in at a French household surrounded by friends."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbHFlMWpRRRAB",
            "text": "I’d go back for breakfast, lunch, and dinner! It’s quaint, intimate, and the food is delicious. Was there with a party of seven.  The bartender Cy perfectly balanced taking care of his other guest while simultaneously making our evening beautiful as he attended to our needs. Made wonderful recommendations for the wine as well as every course we experienced — even dessert!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWbnFtLXlnRRAB",
            "text": "Always have a wonderful meal.  The food is really good, fresh and well prepared.  The service is excellent and professional.  The food comes out quickly.  The atmosphere is a little outdated.  The dining room tables are close together.  But the food and service more than make up for it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMHNHNGF3EAE",
            "text": "Great service. Great food with choices for the picky diner. Good coffee. Good mimosas! Quality cafe without pretension. As my nine year old simply said when questioned about it, \"I love it a lot.\""
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJbHV5Xy13RRAB",
            "text": "마라톤 때문에 길이 다 막혀서 우연하게 들어갔는데 파리여행때 먹은 왠만한 레스토랑보다 맛있게 먹었어요"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNVoycEtBEAE",
            "text": "Everything about this quaint little restaurant was perfect. Came here for an intimate family dinner and it was perfect. The space is small so not sure how large of a party they could fit. On certain days of the week they have a pre fixe menu which is what I opted for on a Monday night for $32 chose the soup of the day which was the carrot ginger soup, for my entree i got the mussels which were perfect, and to end I chose the fig tart. The steakfrites were very good as well as the seared skate dish. The service was extremely attentive and allowed us to take our time helped us with recommendations."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaFl1cXFnRRAB",
            "text": "A beautiful intimate space with the perfect light temperature. Food was delicious with pleasantly sized portions. Service was very friendly and our waiter offered great recommendations. Highly recommend the French onion soup and the steak frites"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucV9DVjBBRRAB",
            "text": "My wife and I have been coming here for years. Authentic French experience and food. Owners are french, fun and warm. Restaurant is cozy and elegant with a great vibe. Beef Bourguignon, endive blue cheese salad, all of their soups and omelets are delicious and hearty. Go on a rainy day and feel the romance of Paris."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobjdLTkZ3EAE",
            "text": "Great spot for an intimate dinner date night. We got the Skate which was very delicious. Duck was great too. House wine was as always in a French restaurant excellent.\nAmbience is romantic, cozy, very authentic though Parisian-like.\nThe dessert is also delicious, profiteroles similar to Paris.\nWe had never been to that area before but it’s right off the train stop which is nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadzhxRjRRRRAB",
            "text": "Yeah this is some quality French. I passed by this spot too many times and I’m sorry it took so long. We got the steak & fries & some French onion soup. Food came out quick. The mayo & ketchup tasted like they make it in the back. The steak we got medium but it was a French medium which was a lil rare which is how I like it. Totally going back. Thanks tournesol !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNkxiR2JREAE",
            "text": "Got a dinner here just because we were around. The food was fresh and full of flavor. Absolutely amazing. We tried the duck, beef pasta and salmon tartar. Everything was delicious. Definitely recommend it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeFpha2Z3EAE",
            "text": "Tournesol is a quaint French Bistro located in LIC. Words cannot describe how incredible the experience was this evening.\nGreeting: the waitstaff is incredibly friendly. From the moment we walked in, we knew we were going to be taken care of.\nCocktails: the bar is well stocked and the cocktail menu is petit but packs a punch. You have your standard French cocktails that are reasonably priced.\nMenu: the menu is not that extensive, but embodies the spirit of French cuisine. There are standard menu items as well as daily specials that are drool worthy.\n\nThey start you off with a ramekin of olives and of course French Baguettes and delicious European butter.\n\nWe had Cod Croquettes, Duck Liver Pate, Endive Salad to start.\n\nThe croquettes were surrounded by delicious mangos and cucumber. Light and fresh, not over fried or over battered.\nThe Duck Liver was not too rich and was paired with a fig jam. A perfect blend of savory and sweet.\nThe Endive Salad was perfectly dressed and the roquefort cheese was mild and delicious.\n\nFor entrees we had the Hake served with fresh vegetables. Summer influence is strong- with fresh corn, gazpacho and asparagus.\nThe Duck Breast with honey and celeriac puree was to die for. The breast was perfectly cooked and the accompanying sauce elevated the dish.\n\nI cannot wait to come back and try everything else on this menu."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcC1EdEl3EAE",
            "text": "Stopped in for lunch on Saturday and had a perfect meal. We shared a carafe of Bordeaux, the hanger steak and fries, and a salad nicoise. Everything was so delicious and the salad was the unexpected star. Really great service and ambiance too! Will absolutely be back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNV8yVnB3RRAB",
            "text": "Believe all the other positive reviews. Wonderful food and service. You'll be warmly greeted when you walk in. The Beef Bourguignon was great as was the Skate dish which two of us had and we were pleased at dessert time that they had Floating Islands (ile flottante) on the menu. It's a classic cozy French restaurant. You'll feel like you're in Paris and another plus it's quiet enough to actually talk to one another a wonderful French custom in their restaurants which we always appreciate when we go there. Another thing I'll never forget is two of us ordered martinis and the host actually brought two separate shakers to our table and shook them up in front of us and poured delightfully perfect martinis!! Thank you Tournesol for a great evening! Plus it's literally steps away from the 7 train so it's an easy trip from Manhattan. Please note they only accept cash and Amex."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0aGJfd3l3RRAB",
            "text": "Tournesol is really just the most enjoyable local neighborhood bistro that you can find in the Long Island City area. The staff is super friendly and straightforward in their recommendations, they have excellent service and the chef is happy to help you decide on the best dishes each day. The dishes are refined with well put together mains and accompaniments without being overly fancy and always well executed. The menu is not too big and they do fish and meat really well in addition to all of the side dishes and vegetables. The prices are also super reasonable and the atmosphere is really fun and local. Overall, we always enjoy a date night at Tournesol and I hope it stays as an establishment in this neighborhood for a very long time."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2c0xYdmZnEAE",
            "text": "Wonderful experience of overall. Everyone there made us feel like we were special. Very rare too have that experience in New York City. Plus the food was phenomenal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6bkxDdzhBRRAB",
            "text": "We had a wonderful time last night. The staff was great and the food and drinks were perfect. The cozy atmosphere makes you feel like you’re enjoying a fabulous evening in Paris."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1M3ZURTNBRRAB",
            "text": "The whole experience was absolutely phenomenal. I went for lunch and enjoyed every bite. Great comfort food. Super nice and attentive staff. I can’t wait to return for dinner!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNnNhUjB3RRAB",
            "text": "From the flavours to the presentation, the food here really made me believe I was back in Paris. The desserts in particular were exquisite. Their Monday-Wednesday weeknight prix fixe menu is great value at $32 for an app, a main, and a dessert. Note that they only accept Amex or cash."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSakluVm5BRRAB",
            "text": "Completely enjoyed a Sunday brunch here.\nThe food was great. Very well priced.  The wait staff were very attentive and was not rushed.  Definitely a go back to place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcG9DYVpnEAE",
            "text": "Went for their anniversary dinner and had a good time! Good food, good vibes, good service, very good price!\nGreat to have it in our neighborhood!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTNE9Db1ZREAE",
            "text": "My wife and I stoped here for lunch after a long walk along the East River and we were delighted with the food, wine and service. It was a chilly fall afternoon, but we still sat outside and didn’t regret it. We had the coq au vin and the…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaGI3QWF3EAE",
            "text": "No, definitivamente no regresaría. No sé  si es otra administración, otro chef, o es el  menú de la temporada, pero ya  no es igual  como antes.\n\nEn el pasado tuve oportunidad de visitar este restaurante y su comida era sorprendente mente  deliciosa y con un menú  mucho más amplio.\n\nActualmente,  Tournesol tiene menú muy reducido,  por los tanto no hay muchas opciones y se ha e difícil escoger el plato.\n\nPedimos tres appetizers y dos de ellos muy salados.\nPedimos dos platos fuertes y solamente el Beef  Bourguignon estaba delicioso.\nPedimos dos postres, solamente uno de ellos pasó  la prueba.\n\nLos precios me parecieron  razonables  y la atención de los camareros excelente. ( por esto di tres estrellas)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENlAyaHFRRRAB",
            "text": "This place is an absolute staple. I’ve been here many times but I felt compelled to leave a review after having this lamb shank and garlic chicken. The food has always been on point and the ambience is quaint. Although it’s only steps from the Vernon stop on the 7 train, it never feels overwhelming in terms of noise or foot traffic. Peaceful, savory, and welcoming."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicThmdS1BRRAB",
            "text": "A must try in Long Island City. The food is incredible, the staff are super friendly. As soon as you walk in you feel like you’re at a tavern in Paris. Highly recommend the foie gras."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1cl9tSlFBEAE",
            "text": "Hadn't been here in probably 6 years, and I'm happy to report they haven't lost their touch. Henri is a true restaurateur and host. Not sure if he's the proprietor, but he was definitely in charge of delivering a delightful experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMWJETGdnRRAB",
            "text": "From appetizer, main menu and desserts, every food tasted great in reasonable price. The service was very nice and welcoming. Definitely would like to come again."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxenVIVG13RRAB",
            "text": "A true gem within Long Island city. A restaurant that invokes a romantic Parisian style café in the heart of Long Island city, Tournesol’s employees and owners are absolute wonderful to engage with and make your enjoyment their personal…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDc19PRnl3RRAB",
            "text": "This is the original restaurant in LIC supposedly, finally got around to eating. Surprisingly affordable, solid French food that comforts the heart. Photos are for snails, a croquet monsieur with an egg, and side ratatouille"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bHVLNm93RRAB",
            "text": "The first thing I have to comment on is how friendly the staff is. As soon as I sat down I felt welcomed in their very well maintained outdoor space. We went 100% based on recommendations and we were not disappointed in either the drinks or food items that were suggested to us."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdnBQb3JnRRAB",
            "text": "Terrible customer service, the waiter is quite rude, the food is horrible, my shrimp were burnt, I couldn't even eat them, it seems that they only kindly serve those who are from their country, there was a table with a French couple and the waiter treated them I gave to them was completely different, they do not have a notice that says that they only accept cash or American Express, it is something unreal when we are in a technological era where everywhere they receive all the cards, I had to leave my bag as a guarantee while I went to take out money from an ATM, now I understand why every time I walk by the front of this restaurant it is empty, don't waste your money or time eating here LIC has better restaurants with great food and good customer service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdEl1N1VREAE",
            "text": "COZY. QUAINT. CHIC. Was transported back to Paris for an hour. Great for date nights / intimate meals. Food was delicious — got the skate and chicken. Both dishes were on the heavier side - wish flavors were slightly more balanced (I still devoured it though). Will be back to try more from their menu. Noting that it’s cash and Amex only, but there’s an ATM at the convenient store next door."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNrOC1PQ19BRRAB",
            "text": "Went there with a couple of foodies to sample the local cuisine around Queens.  First stop is a well known local brunch place in LIC.  Just off the 7 train ( Vernon ) is Tournesol. Quaint French bistro with a wide selection of French favorites.  Ordered the Eggs Benedict, lightly hugged by the bacon and Hollandaise sauce.  Taste wise, it is on point, you have to wonder why you would go anywhere else for brunch, especially when this gem is in the local neighborhood.  Hungry for more, ordered the steak frites and this is where the disappointment comes.  Found the steak too tough and dry for my tastes.  Even with black pepper, the flavor wasn't there.  Will come back though and try out more of the brunch items. Strictly a brunch place for me."
        }
    ],
    "reviews_count": 79
}