{
    "name": "Lighthouse Rooftop",
    "place_id": "ChIJnduXzuVfwokRk2VE0PeUdmM",
    "grid": "QN1",
    "address": "45-15 37th St, Long Island City, NY 11101, USA",
    "rating": 4.1,
    "user_ratings_total": 796,
    "phone_number": "(718) 550-6108",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWWNIUjRiRXRFYlZwNmQxaHFhRmRwUkY4NE9XYxAB",
            "text": "This restaurant is fancy but costumer service stinks when you order a meal they bring something totally different from what you order. I order steak when my meal arrived not only did it not taste good, the steak was so tuff I could tow a car wit it. And it was my husband birthday and from the start at the front desk was poor service if you want a view with bad costumer service and over cook food then you go here. I would not recommend this establishment"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4M1QzcFRlUzB0VWxKNVVIZG1la2gzU0dSeVZuYxAB",
            "text": "The food was so good , the drinks were great , the vibes were chill, the atmosphere was nice, service was great (shoutout to Danny our waiter for the evening) but the “security guard” did upset me a lot because of the dress code.He told me to take off my hoodie but it a rude way. Then he told me I wasn’t allowed to have it next to me in a disrespectful way so I had to put my hoodie in my sister’s car. Now I don’t have a problem with the dress code but telling me in a rude and disrespectful way is a problem. It was my first time coming here and we were celebrating my sister’s birthday. Besides the rude “security guard”, Overall it was very nice, definitely a good experience, I recommend it for everyone."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacVUyZG5ZekpXTTFkSmNHdDVWazFGVG10VGVtYxAB",
            "text": "Ayer fui a Lighthouse para celebrar mi cumpleaños y realmente y fue una experiencia muy agradable. El ambiente es increíble: moderno, luminoso y con un toque artístico que lo hace especial. Durante el brunch hubo un show de trapecista que me pareció original y lleno de alegría, algo poco común que realmente eleva la experiencia y le da vida al lugar.\n\nEl servicio fue correcto; la mesera que nos atendió cumplió bien su trabajo —no fue especialmente sonriente, pero fue eficiente y profesional—, así que en ese sentido todo funcionó bien.\n\nLa comida, sin duda, merece una mención aparte. Muy bien presentada, sabrosa y con porciones generosas. Le doy un 4.5 de 5 por sabor y calidad.\n\nEn resumen, Lighthouse es un sitio que vale la pena visitar, especialmente si buscas un brunch diferente, con buena comida, buena energía y un ambiente que te deja con una sonrisa al salir"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMGNsWXpVMU4wVm5WUFZXSmZlRkF0TTNWRlkwRRAB",
            "text": "We came here last night for a birthday dinner with a reservation, and unfortunately, it was a really disappointing experience. The service was shockingly poor from start to finish.\n\nWhile we were still eating our entrées, the server started clearing plates—even after we said we weren’t finished. Our drinks sat empty most of the night, and no one ever asked if we wanted another round, even though we always enjoy wine with dinner. It felt rushed and inattentive.\n\nTo make things worse, the server asked if we wanted dessert while the birthday girl was still eating her steak. The appetizer plates were never cleared before the entrées arrived, making the table cluttered the whole meal.\n\nOur table was also right beside the door to the rooftop patio, so every time it opened we got a cold draft—it was really uncomfortable and made it hard to enjoy the meal.\n\nWhen dessert finally came, they also brought out six shots that we never ordered. They later added them to the bill, discounted them, but it was still very strange. A 20% gratuity was automatically added, which we understand for larger parties, but in this case, the server did not earn it.\n\nWe all work in the industry and know how much better this experience could have been—especially since they missed multiple opportunities to upsell drinks and make our night enjoyable. We did speak to a manager before leaving, but overall it was such a disappointing experience for what was supposed to be a special celebration."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OYWFIUTBhUzFoZHkxTk5rWTFUSGhhZEVSZlpVRRAB",
            "text": "Stefanie was amazing, this is the best service ive ever received."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psamVGcGhPVTVLY1VSMGRGTmxOekE0VG00NVdrRRAB",
            "text": "Overall a much better experience than I expected! Was reluctant to go at first because saw all the extra fees like cake fee being $25 and $20 person is late or no show up but my friend insisted on still going. Food is a lil overpriced but really really good and overall worth it for the experience and exceptional service really made her birthday an eventful one! Our waiter sweet enough to waive the cake fee! 10/10 would recommend this place!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUFkwVmlXVWRvVjFOTWJ6QlVNRFZGYVVSMmJrRRAB",
            "text": "Absolutely loved this new spot in Astoria. The vibes were everything beautiful interior, stunning view, and such a fun energy all around. Loved everything. Our server Adriana was the sweetest and made sure we had the best time. I was celebrating my birthday and honestly couldn’t have picked a better place. The Aphrodite cocktails were bussin, we had a couple rounds because they were just too good. The Branzino she recommended was cooked to perfection and full of flavor. My girlfriends and I laughed, ate, sipped, and had the most amazing night. This place made my birthday feel so special and I’m definitely coming back soon."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kc09HdFdWMDluVkhSM1EwTkNVWFZYU25wSVJIYxAB",
            "text": "Mei was the best she severed all our food according based off what our drinks were\nShe also told me to try the pistachio ice cream and it was amazing"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMFpqQkdTSFEzVkZNeGFUWlRTVzlwYmxvME1sRRAB",
            "text": "Atmosphere makes up for the ok food not alot of food choice. View is beautiful and good music"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ad09HUmtiWHB0UjJsb2VGUnZaWFJVVFZJNVgyYxAB",
            "text": "Went there for dinner and the food was served ICED COLD. Not worth it for the money.\n\nServer with long blonde hair was literally rushing us to pay our bill being that they don’t take Apple Pay, probably scared that we would not. If I was not African American I wondered if the case would be different because I literally felt pressed .\n\n‘Lou’ said next time to ask for him as per better service , that is if I ever go back . Maybe I will try the brunch because dinner was Not it .\n\nTheir drinks were good.\nAtmosphere and views were good also.\n-That’s what you’d be paying for\nNothing else ."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ0xVVldNVWhDUVdGWVgxcERjSEJSUVdrMkxWRRAB",
            "text": "Don’t go here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaNVZESm9SakpXWkZCTmMwRjZTbmhrZFVscVkwRRAB",
            "text": "Daniel was so attentive and informative. He let us know about the lobster Mac & cheese that is not on the menu, it was so good!!! Would not only love to be served by him again but would also taken any other recs he has!! Thank you for being our server, you made my birthday dinner AMAZING!!!👏👏"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GU1ozbDFaazlaU2pRdFp6QjNRUzAwWDFsbGFVRRAB",
            "text": "Some of the best food! I am a repeat customer and always a great time to come here. Especially during sunset hours. Lobster Mac and cheese is the best. Had the server Daniel. He was very kind and attentive. Very helpful when it came to food suggestions and everything he suggested was great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocFZFNXFhMkpPUldOYVFqaEJjVzVpV25nMmEzYxAB",
            "text": "Came in on Tuesday for my boyfriend birthday and it was such a nice experience. The restaurant itself is beautiful. It wasn’t as packed as I expected, We had the Lobster crispy rice  and it was delicious. Our server Stefani was very sweet and recommended the Tomahawk to share and it came with more than enough food. Overall great experience"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOTZPNkVREAE",
            "text": "Came yesterday and had a great experience! Stef gave excellent service, and the food was amazing,  the lamb chops were delicious and the lobster mac & cheese was rich and flavorful. Definitely recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV1VuZEdjMlJGTlVGdE5qaEplWFJaVDIwdGJrRRAB",
            "text": "Went to have dinner at this place and the view is spectacular, but the service was very bad. Our waiter was not attentive to our table and only came to take the drink order and, at the end, just to drop off the check. It was another waiter who actually took our food order, and if we needed something, we had to get up and ask. On top of that, the restaurant wasn’t even full for them to be taking so long. It was very expensive, and the food wasn’t worth it. Since tips are already included, I think that’s why they don’t bother to give good service. I was very excited to visit this place because I had already seen it on social media, and I traveled an hour and a half to celebrate my birthday, but it disappointed me."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVelZEUTNORlZxUW5FMk9HaHBNVzl4U21WclZGRRAB",
            "text": "Loved seeing performer Natalie!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdGNuUlNZVm8zTm5CVlNIZExkRmRuTUZKVFNFRRAB",
            "text": "Horrible. If you plan an event, celebrate a birthday, dont go here. It was so unorganized, staff was rude. Wasted my time going back to each email i sent to their events manager. I had to speak to multiple staff members. My party was…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQ1NHaGxUbFkwTjJSMFZFVm1jSHBWYm1Sb1dFRRAB",
            "text": "My party of eight booked a reservation for a bridal shower celebration and unfortunately, the experience was profoundly disappointing and stressful.\nThe issues began immediately upon arrival. The restaurant's website states guests can arrive 10 minutes early to set up, which I did. However, after I finished decorating the table, our waiter, Daniel, informed me that our 90-minute seating clock had already begun while I was setting up—before the rest of our party was even seated. This illogical policy instantly put a damper on the evening and felt like an unnecessary rush.\nThe evening was then ruined by the weather and the restaurant's inflexibility. When it started to rain, our food quickly became soggy and unenjoyable. We asked Daniel if we could be seated inside, but he told us they were fully booked. Moments later, when the rain became a downpour, everyone seated outside was forced to crowd into the indoor standing area—which suggests the \"fully booked\" claim was inaccurate or that a better solution could have been found.\nFinally, the restaurant was completely unaccommodating regarding our celebration. I had brought a small cake to briefly celebrate the bride. Despite the stressful circumstances and the fact that there were a few empty, unscheduled tables around us, we were told we could not cut the cake, even for just a minute.\nIn summary, the restaurant's policies (the confusing seating time), lack of preparation for weather, and overall unwillingness to be flexible or empathetic made what should have been a joyful bridal shower celebration a complete letdown. We felt rushed, neglected, and unwelcome. I would not recommend this restaurant for any special occasion."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMVZsWmtSbkpwUmpabmNsZDVSMWt4VjJGNU5GRRAB",
            "text": "Plastic Utensils for Dinnerware – The Worst Experience Ever\nI made a reservation and even arrived early while the restaurant was completely empty, yet the hostess had an attitude right from the start. Their seating system is poorly managed, and the overall customer service was one of the worst I’ve ever experienced.\n\nThe food itself was decent, but the experience was ruined when they brought out my daughter’s birthday cake with a black plastic take-out spoon—like we were eating at a fast-food joint. I had to ask for actual silverware, which is completely unacceptable for a sit-down restaurant.\n\nThis was a horrible experience, and I will never return. Just a warning—don’t believe the hype!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSR1oybzBVR0ZzVlZOQmQzVnhORzFwYUdkRVNGRRAB",
            "text": "Horrible I waited 3 hours just for the main course"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcFdUUTVZakZGUkY5Zk5FRjBRMVp0YWt0TFExRRAB",
            "text": "Great for a first or second date...it is pricey, so bring your wallet"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMk5saHZlV3REVkZCQlpHdDNZVzFSYlhKaWFYYxAB",
            "text": "Be honest food was not bad but service was terrible everytime you have to ask them clean fork knife plate also.Photographer comes to you and asks if she can take your picture then after while asks you to buy photos for money. Money isn't an issue but this feels like you're trapped."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVk9IaEVSMGRwTVhrek1VaEZPVFJWVFRKeGVHYxAB",
            "text": "We went for brunch and loved everything.  From the mimosa flight,  the food, and woman on silks. Will definitely return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FdFZXVldRVXMzVUVJeVZqUnhTRUZ4U0ZNdGIzYxAB",
            "text": "Had an amazing time at Lighthouse! Stephanie was so attentive. The service is at 10/10!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVWNFbENRazEyWm1kUFpHcFVNa3N0Y1dneFltYxAB",
            "text": "This is my first 1-star review on here but this place earned it. I usually use Google Maps as a place to give restaurants and the people who make them happen their flowers for all the hard work they do for the community but as they say, feedback is also a gift. Because I want to see people win, I choose to do so.\n\nThis was hands down one of the worst dining experiences of my life. From the moment I checked in with the impolite doorman downstairs the establishment tried giving me a hard time for wearing a hat, sweats, hoodie and athletic wear. The doorman pointed to the sign to make sure I understood I was breaking every dress code rule. Automatically any place that enforces dress code that hard is worried about the wrong clientele and likely not for me. I got upstairs and saw others also in joggers so what was the point?\n\nThere’s also no view for this rooftop from what I can see. What’s the point? Yet another red flag I ignored. Then the hostess tried making me wait until my friend arrived as if the place was overbooked although it was actually mostly empty. Also overheard the her lying at the front desk to someone who was trying to make a reservation that there wasn’t any space available - another flat out lie. The manager had the audacity to later tell me they were “programmed” to give the responses.\n\nThen it took 10 minutes for a server to even come up and bring me a water. The menus were dirty, hard to react and clearly hadn’t been cleaned. Ended up ordering a milk punch cocktail that tasted like actual vomit in a glass.\n\nThe popcorn shrimp were bland at best\nThe other cocktail I ordered was also not good but at least it was strong. My sushi special was well portioned but poor quality. The prices did not warrant the food or experience overall. Bathroom hand dryers were out of order.\n\nLastly they added auto-gratuity of 18% on top of a 3% credit card surcharge which I’ve never seen in my life, especially for a party of 2. Let me decide how much to pay you at least for your piss poor service. If I wasn’t in a rush to get out after waiting so long for the service, I would have refused.\n\nTalked to the manager to give feedback at the end of the meal. She was at least nice and did the right thing by comping a round of drinks but ultimately that didn’t make up for the painful overall experience we just had. 1/10 on a scale if I could 👎🏽"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wc1JEY3RaVTAwTjFCNGVqbERkbU5sZDE5blYyYxAB",
            "text": "As a first-time guest, I’d say my experience was just okay—not bad, but not enough to make me want to come back. I had reserved outdoor seating and arrived early, but was initially offered a table crammed inside by the bar between two other parties. We asked to wait for outdoor seating as planned, and the host agreed, though with the caveat that tables near the patio edge would be over an hour wait. Oddly enough, throughout our entire meal we noticed those “long wait” tables never filled and parties of two were still being sat there.\n\nOn the positive side, our server was warm and attentive, and the drinks were solid. Of the dishes we tried (popcorn shrimp, birria dumplings, fluke ceviche, asparagus, and steak tacos), only the popcorn shrimp really stood out. Everything else was fine but forgettable. Overall, I’d give it about a 6/10 experience."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RWEybE5kblJ4Tmt0QlRsUk1NbnBHWHpST2JIYxAB",
            "text": "Dope rooftop restaurant with stunning views of Manhattan. The decor was beautiful and thoughtfully designed, with both indoor and outdoor seating that created a relaxed yet stylish atmosphere. The vibe was lively and inviting. The staff was attentive and accommodating that made us feel welcome throughout. The bottomless mimosas were flowing nonstop, and the steak and eggs were cooked to perfection. Definitely have to come back around for dinner.\n\nP.S. Went back for dinner. The vibes are just as good maybe even better. The food selection is just as good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdlMxbDZVbTVUVjBGamRVZHNiM2xYWjNGcWNVRRAB",
            "text": "One Rooftop was a nice experience overall. The view is definitely the highlight — it creates a great atmosphere for hanging out with friends or just relaxing. The drinks were good, and the menu had some solid options, though a few items felt a bit overpriced for what they were. Service was friendly, but it could’ve been a little more attentive at times. Still, the vibe and scenery make up for it. I’d definitely come back, but there’s room for improvement, which is why I’m giving it 4 stars instead of 5."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUWNsZFZUVlphUkVkT2VXNXFaakY2VDFRNFkxRRAB",
            "text": "Service was disappointing,  food took forever, and came cold. When promise complimentary dessert, it never came. Was seated in the dark corner, when expressed concerns, nothing was done, overall did not have a good time, would not recommend to friends visiting NYC!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdVNsbzBSWEIxTUd3NE9FVkhla2xIVTBoQk9FRRAB",
            "text": "Service good ! The food great\nNice views, good atmosphere"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNVRsQnhWMFYzY2tOelVuaHZWMEZ4VmpRNVgwRRAB",
            "text": "Vielka is so sweet ! thanks for her service and her good energy, see you soon 💖"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeWVWRnNRWGR1U0hoMVduUkVZblJsZDB0MVFrRRAB",
            "text": "Nope. Strict dress code. Barely made it on the elevator before turning around."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRVUyczRPR05DVm1sZk1HOXNTRGN5YkV3eE1XYxAB",
            "text": "I’ve always enjoyed my time at Lighthouse Rooftop, great ambiance, especially with live entertainment. But this past Sunday was a completely different experience, and I left feeling disrespected and disappointed.\nFrom the moment we sat down, we were surrounded by gnats. The waitress brought lemons for our sparkling water, and from there we were swatting bugs constantly. Still, we tried to overlook it because we hadn’t been out together in over a year and a half and just wanted to enjoy ourselves.\nWhat really stood out, though, was how we were treated compared to other tables. Nearby guests had attentive service with dirty plates cleared regularly, tables wiped down. Meanwhile, our plates sat untouched and piled up. Once we noticed, we waited another 10 minutes before finally flagging down one of the many servers or bussers standing around the bar.\nWhen I asked to speak with a manager, things got even worse. A young woman who clearly is inexperienced rolled her eyes when told to come over, stopped by the bar, then the hostess stand, and only came to our table after being reminded again. When she finally approached, she said, “You asked for a manager?” in a tone that was anything but professional.\nHaving worked in five star customer service for years, I was stunned. No empathy, no accountability, just a cold offer of a discount. But we weren’t asking for a discount. We wanted to be heard, acknowledged, and treated with basic respect.\nWhat happened next made things even worse. After our conversation, the “manager” walked over to our waitress and began talking about our complaint directly in front of our table. The two of them went back and forth, debating whether what we said was even true, which was completely unprofessional and unacceptable.\nI got up and let them know that I saw and heard everything. The “manager” responded by saying, “This is what I’m supposed to do if someone complains about a table.” I understand addressing an issue with staff, but not right in front of the guest. That’s just common sense.\nWhen I told her I didn’t appreciate her attitude, she replied, “I don’t have an attitude. I’m doing my job.” Again, not the response of someone who understands hospitality or how to deescalate a situation.\nTo top it off, she sent over a bartender, laughing, holding a fly swatter, who said, “Someone told me you called for an exterminator.” It felt like a joke to them.\nWhen I asked if she was the highest level manager, she said yes. That’s honestly the most disappointing part. From how she acted, it felt like someone in the owner’s family just playing manager, with no idea how to run a business or handle a customer issue seriously.\nI’ve loved this place in the past, but after this experience, I won’t be returning. It’s clear that customer concerns are not taken seriously here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTVRuUmtTVXRYTUc5UFgwOU9iRmRPZW1abFgzYxAB",
            "text": "The place is nice ❤\nThe drinks are good 👍🏾\nThe brunch was ok\nWant to go there for dinner\nMaybe\nA little pricey $70 for Chicken and Waffles"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aemFEZDVUVlJhZG0wNVZISlNja00wYUc4eVpuYxAB",
            "text": "Ambiance is amazing! Good music and EXCELLENT service! Amaris was the BEST! Attentive, friendly, and most importantly kept the bottomless drinks coming! 10/10 definitely recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSmJuRkdSVzlJWVVGU1MyY3RaMkkyTmxWdWRWRRAB",
            "text": "amaris was an amazing attentive and very sweet server I appreciate her energy she is the reason why resturants like this thrive she is the best and I would recommend her service to everyone....she serves at tye light house rooftop in queens it was a pleasure will be coming back again soon"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeFZrTlBhMUZ6YzFORk9GUjRSRUl0VXpaQmJWRRAB",
            "text": "Cool place for hangout and see sunset."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Uk1HcHFaMlZ1TFV4dVExVnJORkEyVEhNd05tYxAB",
            "text": "Very nice place with soft music. It’s quiet, more for talking and eating than having fun. The food wasn’t good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKM1RDMTZSbWhVUW5GelNUa3Rla1p4TTNGV1JHYxAB",
            "text": "Great Food, Vibes, and Overall Service: We were kindly consistently checked on by our very nice waitress. The views and layout inside are great for a date night, brunch, or anything really. Had the bourbon burger and it was delicious. This place is 10/10, highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ga01sSTRMVk5sZGxaaFIzaGZUMFpEZUVKTlRWRRAB",
            "text": "I’ve been to Lighthouse Rooftop twice so far. Once for my birthday and once for date night and both times were solid experiences.\n\nParking: Street parking is limited, so valet ($20) is the way to go. A tall Caucasian guy usually runs up to assist with it.\n\nEntry & Dress Code: You’ll need to take the elevator up, and be mindful, no hoodies, hats, or sportswear allowed. The host/hostess team isn’t very warm or inviting, which can feel like a rough start. If you arrive during a live performance, they sometimes delay seating, which can be a little frustrating.\n\nAmbience: Once you get past the entry, it definitely improves. The rooftop setting has a nice vibe, though both times I visited it was pretty windy. so keep that in mind if you don’t like breezy nights outdoors.\n\nFood & Drinks: This is where Lighthouse really shines. The drinks hit hard and do not disappoint. I’ve tried their lamb chops, mashed potatoes, popcorn shrimp, branzino, fish tacos, truffle fries, asparagus, and plantains everything was flavorful and well done.\n\nOverall, the food and drinks make it worth the visit, and the ambience is a plus once you’re seated. The only drawbacks are the lackluster host/hostess experience and the wind on certain nights. Still, I’d recommend it for a special occasion or night out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Q2JGRXlaMnRsZFRRMVozazRWVWRaYnpWS1MxRRAB",
            "text": "Attended a party here the food finished and they didn’t even bother to replenish quickly had to wait for over 35 mins when others already ate."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsemFWWjZTSGxXU1VwQmFEaHVYMFU0U0dSUGFIYxAB",
            "text": "Felicity was my server & she was amazinggg!! So polite, and so attentive . We will be coming back !!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeGJVeGFVR1JFVm5OMVEwTnVjR1I0Yld4ZldtYxAB",
            "text": "Stephanie was a treat! I definitely will be back. Lighthouse stays being my fave. The views, the ambience and the people."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRlpFZzRRMUF6Wlc5a1YxTnhMVm8wYkhBeFlXYxAB",
            "text": "Stephanie gave great service. The vibes were immaculate. The food was good and our waitress really made our time. Feel special and amazing. We love the views definitely will come back 10 out of 10 recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVFdVZEhaVk0zUVZGc1pGRTRNamhvY1RCSWIxRRAB",
            "text": "Stephanie was a great waitress good service nice rapport give her a raise"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMlRWQXhNRFZMZUhKRFdHcG5TMEZ3UVRSQ2FIYxAB",
            "text": "First Timer there, went for brunch. Stephanie B was super, helpful, was easy to talk to and asked questions. What made me appreciate her was I spilled a bit of desert on myself and she was truly willing to get me club soda to clean it up. For me its the things that you dont really need to do that you choose to do.\n\nEverything else was okay as well. Fun spot for girl time. Drinks were decent. Food was also decent.\n\nThanks Stephanie 😉"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNVFWUlpSVjlCV1docU5taGZVVTVFTm5Wa1EzYxAB",
            "text": "Went here on a date my boyfriend and the french toast was so bomb!!!!! Our waiter Stefany was so nice and made our experience even better. Definitely going back."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocU4ycDBUMkZUU1dKaVEybzJVSFpUZG1aSlJIYxAB",
            "text": "Los meseros no son amables y no le buscan la forma de ayudar al cliente, estaba haciendo mucho sol y le dije que me pusieran en otra mesa con sombra y me hablaron mal, diciendo que ya estaban reservadas, por más que le dije que solo me desayunaría y me iría dijeron que no."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMFpUazRRWFJOZFV0alpsSldkVmRKZDE5VFYxRRAB",
            "text": "Had a great experience at lighthouse! Our server stefani was amazing so nice and helpful gave us details on everything we asked really patient thank you will definitely be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSVYwRmtZa0ZvY0ZSQmMzZFNSR05NZDJGM2JIYxAB",
            "text": "I went to Lighthouse Rooftop with my family for my birthday, and we really enjoyed it. The place is beautiful, with spectacular city views that make the experience even more special. The food was amazing, the service was excellent, and everything felt well organized since we had a reservation. It was a wonderful celebration, and I highly recommend this rooftop for a memorable night out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMldVNVRlR2d6WWxWT01qVndTV3R4TlU5Vk5XYxAB",
            "text": "There is on street parking. I think there may also be valet parking. I suggest making reservations. A $20 fee is required to hold tge reservation and is forfeited if you cancel.I had a 6:15 pm reservation. The hostess is young and not very warm. We were informed that there is a 90 minutes dining limit and were seated immediately no wait time for our table. Other patrons had to wait until their entire party was present to be seated. You are allowed a 10 minutes grace period. she did switch my seating from indoors to outdoors at my request which subsequently was a good choice because the music was very loud indoors and my party of 3 wanted to converse which would have been difficult with the loud music. The day was beautiful about 79 degrees with a light breeze but when the sun went down around 7 pm the view was spectacular. There were not many choices on the dinner menu nor the dessert menu but our server was happy to assist with the menu. The food was tasty. The bill had a mandatory gratuity added. I won't be returning it was a one time experience. I  prefer to go to restaurants with no time restrictions nor mandatory gratuity. We spent a little less than 300.00. A little less than $100 per person not bad."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0QlZIVnNXazExTjJoME9VdDJWVzFJVUdsTmFFRRAB",
            "text": "Lighthouse Rooftop in LIC puts a contemporary twist on a diverse menu blending Mexican favorites with the bold and umami rich flavors of Japan. The food is delicious, though it might not be the sole reason you’ll remember your visit. Cocktails are well-crafted with a solid and smooth sip. The panoramic Manhattan skyline view is stunning but not entirely unfamiliar to New Yorkers. So what makes Lighthouse Rooftop truly special? The vibe! The music is upbeat and energizing with talented dancers performing a great show and staffs who go above and beyond to make the night memorable. Together, they create a dynamic atmosphere where food, drinks, and scenery all work in harmony. Don’t come here just for dinner. You come for an elevated dining experience that blends flavor, entertainment, and style into one unforgettable night. This isn’t your average dining spot so dress to impress!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMmFYWndWVFI0U2xOblpXdFZhVUpUTTNORk1IYxAB",
            "text": "Beautiful Rooftop! Love the views, we had the pleasure of having Felicity D wait on us! Great service and so attentive all night at any moment. We needed for nothing thanks to her! We ordered the lamb chops, lobster mac and sushi all of it was delicious! Definitely will be back, our first date night was so cute thanks to Lighthouse Rooftop! ❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKV2x2dFQ0b0wySUhREAE",
            "text": "Great location to see the city. Music was loud, which I'm okay with. Tables are close together, barely room to move without hitting the person behind you for indoor seating. Restrooms were small and nasty. My chicken was a little dry, but everything else was delicious."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveUxlT0p3EAE",
            "text": "Went to lighthouse to celebrate my friends birthday and off first arrival our reservation wasn’t ready so we had to wait about 15 mins to be seated. We took photos in the front which was cool, on weekends brunch unlimited drinks stop at 4 just fyi. Regardless we were seated and the music was really great enjoyed it! We ordered the Mimosa tower which fun for pictures and decor but only 3 out of 5 of the drinks were tasty, since it’s brunch we didn’t care we still drank them dranks! We were able to order food which for the most part was good the two who ordered the chicken and waffles didn’t really like the choice of meat that was used, but my friends who ordered the steak and eggs and French toast said it was delicious! I had the vegetarian option and ordered the Taco Dorado which was tasty. The guac small plate was also really good! As for drinks we ordered them from the menu and they were all really delicious! I would say we had a great time and enjoyed it and I feel like when the rooftop is open it’s an amazing view of the city and would be great vibes. Service was cool and we enjoyed ourselves. Will definitely go back and take advantage of the deals cause it was roughly around $100 per person which wasn’t too bad!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aG9TR0xREAE",
            "text": "I visited this restaurant Saturday, March 22 to celebrate my friend’s birthday. The decor ambience  music food and drinks were good. The menu was a little limited as far as appetizers and they didn’t have the pork belly, but that’s OK. Everything else was good.  but the But the service we received from Carlos (the one with the great smile) was spectacular. He is such a charming and beautiful person. We had a great time and he made it all work it!!! Yes! I will return and recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLRERoYWZKa3Fud05REAE",
            "text": "Rooftop Brunch in Queens You Need to Try! 🔥\n\nThis is a stunning rooftop restaurant in Queens offering brunch & dinner with beautiful skyline views & upscale vibes. Perfect for a date, celebration or weekend outing with friends!\n\nThey offer 2 tiers of bottomless Options & a mimosa tower for $50.\n\nEvery entree we got was as good as the next!\n🥞 Chicken & waffles came with fluffy waffles & perfectly seasoned chicken\n🌮 The Hangover Birria was a unique & flavorful twist\n🦞 The lobster Benedict was rich & satisfying\n🍞 And the French toast was so good, we almost ordered seconds\n\nAt 2 PM, the real fun kicks in with live entertainment! An aerialist hands out free champagne while a violinist plays electric violin right from the rooftop. It’s brunch with a dope show! Definitely worth checking out!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKU3VxUFR5MTdtUzh3RRAB",
            "text": "My hostess a short Indian guy with blond dyed hair was very rude to us! And forced me to seat at a  table I didn’t want! .Seats are uncomfortable, tables are very small ,second level seats are only available for groups or activities.\n\nWine menu was very poor, food options are very limited .I ended up just ordering a Tuna Tartar as an entry and sushi as main course I was very mad and just wanted to leave , my waitress was super sweet and kind . Dancers were cool ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMTF81YTdPMnQ3c2ZBEAE",
            "text": "I was looking for a spot to celebrate my partner birthday. I was a little hesitant coming. It looked great on IG but the reviews were mixed. I am soo happy I took a chance! Everything was great!!\nWe went on a Thursday for Jazz and sat inside. The temperature was nice and cool inside. The saxophonist was walking around serenading everyone. The place was live for a Sunday evening at 915pm.\n\nIt took a little while for a server to come but she took our entire order and was gone again. The food came in decent time and the apps were nicely spaced from our entree.\nFor appetizers, we had the popcorn shrimp, guac, and birria dumplings. They all hit the spot. They were good portions for apps but expensive at $20 each but atleast it was good! The pineapple int eh guac gave it nice flavor!\n\nWe both had churrasco entree since the waitress recommended it and boy it did not disappoint! Maybe my best skirt steak! The friend plaitain and peppers don't the side was perfect for me and great flavor! The red Chile sauce and green garlic sauce (chimmichuri?) made it everything! I packed it to go and asked for more sauce to take home!!\n\nDrinks: We weren't drinking but they had a mocktails menu which I appreciated, the drinks were good but very sweet.\n\nDessert: We got motlen cake and tiramisu for dessert. The motlen was not bad, the tiramisu was good even though it looked like a slice of cake.\n\nThey sang happy birthday to my party and the saxophonist played happy birthday for every birthday that nice. What a beautiful touch!! They did charge for the birthday cake, which for their prices, I wish they comped a birthday cake but I won't complain since the food was great!\n\nThe ambiance was nice and Outdoor was great. Great views, seating and energy.\n\nThey have valet but I parked right on the same block myself.\n\nI highly recommend this spot for date nights, girls night and large or small parties!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMUtTN0ZnEAE",
            "text": "Beautiful place for Happy Hour or Dinner.\nIts not a high rise building but the outdoor area has nice views of the Manhattan skyline. Drinks are great! Food tastes good! I highly recommend this spot in Queens."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZTI2Y0xUeWRHbUJnEAE",
            "text": "Latia was absolutely exceptional! I celebrated my sister’s birthday and Latia was sure to make it an enjoyable and unforgettable evening! The food was amazing, drinks were also amazing! 10/10 I would recommend! ASK TO BE SEATED IN TIA’S SECTION!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNk9YLVdREAE",
            "text": "Lighthouse has the vibe, I’ll give them that. Gorgeous views, chic decor, and plenty of space. But that’s where it ends.\n\nI came for a party last night - great music, and the bartenders were nice but service was slow. Then, 30 minutes before the party was even supposed to end, staff started shutting things down and resetting furniture right in people’s faces. Wild!\n\nCame back for brunch today, and the host looked like we ruined their day just by showing up. Our waitress had an attitude when we asked about the chicken in the chicken and waffles, like we offended her by asking a basic question.\n\nDrinks were the only highlight. The Sakura mocktail was quite delicious!\n\nBut the food? Straight up trash. The chicken was solid but the waffles were soggy and sad. The Bourbon Burger tasted like disappointment - dry, overcooked, and somehow smaller than the bun. Truffle fries were soggy too. Everything was cold except for the chicken.\n\nTo top it off, they don’t take Apple or Google Pay and tack on a 3% fee just for using a credit card. A premium price for subpar service and cold food. Aesthetic isn’t enough to carry the experience.\n\nThat said, I might give dinner a try, maybe brunch just isn’t their ministry 🤷🏾‍♀️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eHA3TDlBRRAB",
            "text": "I celebrated a friend's birthday at The Lighthouse in Long Island, and it was amazing! The view, food, and atmosphere were all 5 stars. We enjoyed shrimp tacos, mac & cheese, and a delicious main course with options like salmon and lamb chops. The live music, DJ, and dancers kept the energy high. We also took photos on the rooftop with a breathtaking city view. The birthday girl's name on the menu was a nice touch. Parking on the block is valet-only and costs $20. You can find paid street parking around the corner. Great spot for a party!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMmF5MVZlbkUwTm05bVdEQlNObHAyZGpabmJWRRAB",
            "text": "Came here for drinks with a friend and it wasn’t a pleasant experience to say the least. Waitress seemed uninterested probably because they already know gratuity is included in the bill so ZERO effort to make it hospitable. Beers took 10-15 minutes to arrive every time and they were not very cold Views are great but nothing out of the ordinary. I also showed up wearing a hat on a summer day and they asked me to leave it at the door desk, not even at Michelin stars restaurants or Manhattan rooftops have that mediocre rule.\nPlace is also dirty and staff is rude. I don’t think they will last much longer running this business like this. Food seemed not very appealing so save yourself some money and eat somewhere else and just get a beer enjoy the weather and views."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJakxPUGxnRRAB",
            "text": "The atmosphere was very nice and modern but we had to show our ID at door … not sure if the reason was good one I wouldn’t recommend for families with kids ( my kids  are old enough). I did call ahead to ask if they are a kid friendly restaurant they said they  welcome all ages but our waitress wasn’t even trying to accommodate the kids the cutlery (we asked for disposable ones) was so huge for my kids and they had no cups with lids was a flimsy plastic cup and for the vibe and Decor was very tasteless. All the food was okay but the stake was like rubber didn’t get a picture of that we had sunny side mock-tails very good the salmon as great the Bronzino needed something else to complete taste. It was a cold day yesterday so they were constantly Opening the door, so it was very chilly And they did offer us free desserts, which was very nice and considerate… Hence, the extra star for the thoughtfulness\n****\nThere is 90 min table time so I left rushed and I think the staff was feeling the rush stuff was falling and breaking!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKbmRxZHV4djhyLTNBRRAB",
            "text": "We came by the LightHouse Rooftop last fall and it’s been in our minds since. We came back for Easter and it was no wonder why it’s been top of mind as one of the best places to dine in the city. The staff were wonderful, the food was phenomenal, and the atmosphere was magical. The whole experience was a blessing. I would go back any time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdmZhUFFnEAE",
            "text": "I really wanted to love this place after hearing all the buzz, and I was super pumped to check it out. First off, let’s talk about the vibes: the spot is gorgeous—totally made for Instagram! The architecture and those killer views of the NYC skyline are next level, especially on a nice summer night. But sadly, that’s where the good stuff ends.\n\nSo my husband and I decided to hit up brunch on a Saturday, and that’s when things went downhill fast. This place is notorious for serving the tiniest tacos ever. I mean, seriously, these things were so small they barely fit in my hand! For $17, you get three of these little guys, and they felt practically empty. On the bright side, I guess having less filling saved us from an even worse experience—but that’s where the positives stop.\n\nAfter what we thought would be a fun brunch, we both ended up feeling super sick. At first, we thought it was the sangria since we had a few glasses, but then my husband had a rough time with some serious stomach issues, spending ages in the bathroom. I wasn’t far behind, dealing with nausea, vomiting, and, well, you know the rest. Now, two days later, I’m still feeling the aftereffects!\n\nAll in all, the pretty views just can’t make up for the awful food and the health drama we went through. Seriously, save your cash and your stomach—this brunch was a total flop!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZkk0bzJnNWJhWmZ3EAE",
            "text": "9/10 everything was cute, atmosphere, service, our waiter Tia was absolutely amazing and the entire staff was helpful and respectful. Only reason I didn’t give it a ten because my medium well burger was pan seared too hard. But I would definitely recommend the fried dumplings with the sauce I can’t spell and too lazy to google. My friends loved their food and drinks so I’m sure it’s 10/10 for them! Xoxo highly recommend. And although there was a lot of people it did NOT feel crowded at all. That’s a huge plus if you ask me."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdDdXczNRRRAB",
            "text": "I came here for my birthday and I really loved it. It was a perfect experience. My waiter was extremely nice and friendly and added to the great experience. I came on a Saturday night and got seated quickly. The place was very spacious and the dining room is absolutely gorgeous with lovely chandeliers. A lady was coming around and doing a show with some firey sticks which was very interesting to watch. I literally ate everything on my plates leaving nothing to take home. The only reason I give 4 stars for the food was because the Mac and cheese could’ve had a tinyyy bit more flavor but I did end up eating the whole thing. the chicken yakitori was delicious!!! And was the branzino. The drinks were great too. I would love to come back here and definitely recommend this place for celebrations!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMlQyeFBXbmxKWkVSMFdteFdkRGxJUnpGU2FXYxAB",
            "text": "Must experience an amazing dinner experience. I felt like we got a free show added onto our dinner reservation. The staff engaged with everyone and most importantly the food was tasty. Get the lamb chops.."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bk1LYnNnRRAB",
            "text": "I must say this is a very beautiful rooftop, excellent atmosphere; music, decorations, dancers the vibe here is very energetic & fun perfect to get dressed nicely and have a good time with very bright & beautiful views of the city however, the food offered in my opinion is very bland, their menu is limited with not too many options and portions are on the smaller side.\nWe tried a few things and were not satisfied with the taste and quality of it; food was not bad but was lacking that wow factor I am always looking for, felt very basic & bland, we did not have any drinks this night but they looked good for other tables.\nIt was a Friday night with no reservation and we waited about 30-35 mins to be seated, they were very busy and received good service.\nOne thing I must highlight here is that we felt extremely cold the entire time, it felt like the place had no heat and we did not even want to take our coats off.\nPerhaps I would be back again for a night of drinks, some dancing & music more like a date night than an eating experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RlpFeEpZbTF4Wm5KdmNXTkxMWGROWkVrNVNrRRAB",
            "text": "If you're thinking about going, do it!!! I had the most amazing time here! I went with one of my friends and her 10-month-old baby, and the staff was incredibly accommodating and friendly. We tried a variety of dishes, including crispy rice with lobster, two different kinds of steaks, asparagus, mashed potatoes, and my absolute favorite—the lobster mac and cheese. Every single item was phenomenal! The flavors were incredible, and even the dishes I was hesitant to try ended up being fantastic. This was my second visit, and I can  say that everything on their menu is amazing. We also ordered two alcoholic drinks, and they were some of the best we've ever had. The drinks were strong but perfectly balanced, so the tequila wasn't overpowering, but so so yummy. If you like fruity kinds of drinks, I recommend asking Brandi what her favorites are because that's what we did and we were so happy with the result!\n\nA special shoutout to, Brandi, who is such a sweetheart, and Jean, who made us feel so welcomed. Both of them contributed to creating such a warm and inviting atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNm9xS1BnEAE",
            "text": "Very big; has beautiful decor for both indoor and outdoor. Parking in street may be difficult it can park under subway with meter.\nI had a baby shower there where they gave us half the space upstairs; the other half was shared with customers as the time passed.\nBathroom is only located downstairs on main floor by elevator.\nThe food not only looked amazing but actually tasted great as well; we had bottomless sangria and mimosas as part of the package. I’m usually a red sangria girl but the white here tastes so good that after drinking a glass of both, I went with white rest of the time.\nHowever amazing the food and decor was, the experience was not a fond one; it is VERY understaffed and even with bottomless drinks, I only drank 3 glasses during 2 hours. The staff got a few items confused and I had to ask for the same thing a few times. And it is on the pricey side.\nThe food isn’t so amazing that it offsets price, service, and somewhat difficult parking with no valet."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc2VUSjJBRRAB",
            "text": "Mimosas were so on point I highly recommend. The Entree was ok but was not my favorite and I had Steak and eggs. My truffle fries were the best truffle fries I e had yet. The dessert hands down was sooooo good. I had the chocolate cake and my friend had the passion fruit one and we were so satisfied."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBc2VQMGVnEAE",
            "text": "I came here for a birthday dinner, I was a bit disappointed that the online menu didn’t match the current menu but that’s just a matter of it being adjusted. The service was great, we had a really lovely server and the drinks were not only delicious but aesthetically pleasing. There were live dancers which was nice and entertaining and way to showcase their culture. I would defiantly return again to explore the menu more and perhaps to try their brunch. Great place to celebrate if you’re looking for great food and esthetics."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SVMzcExVbXB0VlVWbWVUZ3dTRGgzUjJOUGQzYxAB",
            "text": "I was here for my birthday dinner. My server was Alyssa. She was very attentive, funny and so outgoing. She made my experience wonderful I will definitely be returning back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNVZsbEVTMmMwUjJrNGFsUjJUbTFZZDFCWGFFRRAB",
            "text": "We came to Lighthouse to celebrate a birthday, and everything was absolutely perfect. Our server, Jim, was outstanding — attentive, friendly, and made sure everything went smoothly.\nThe atmosphere was wonderful, with a beautiful view that made the experience even more special. They even surprised us with a birthday cake, which was such a thoughtful touch! The service overall was top-notch, and the drinks were fantastic.\n\nA truly memorable evening — highly recommend for a celebration or just a great night out!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5a2F6UjJkbUkzZGtWbFYwNDNZVWs0VGtOamJFRRAB",
            "text": "I am so glad I came here for an event, what a wonderful place . Amazing view, yummy food & excellent customer service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMDV6MEVREAE",
            "text": "I had the pleasure of dining at Lighthouse Rooftop! The service was attentive and friendly, making us feel welcome from the moment we arrived Alyssa made us feel welcomed and was super bubbly! She suggested some good options in the menu.\nThe atmosphere is top-tier—vibrant yet relaxed, with a gorgeous rooftop view that set the perfect tone for our meal.\n\nFor brunch, we ordered a variety of dishes: steak with chimichurri, perfectly cooked eggs, crispy potatoes, and fresh greens; a delicious burger with seasoned fries; and a beautifully garnished mocktail that was as flavorful as it was photogenic. Every plate was well-prepared, flavorful, and beautifully presented.\n\nThe combination of good food, stunning presentation, and excellent ambiance made this a standout spot. I highly recommend it, whether you’re planning a casual brunch or a special outing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicHY3MHJRRRAB",
            "text": "For starters, I celebrated my 30th birthday. The doorman was very friendly. They do ask for ID so make sure to have that with you. The moment you enter the rooftop you get greeted by the host which he was very welcoming, went to the bar in the meantime while waiting for the rest of my party. The bartenders were all extremely friendly, Jonathan took very good care of my friends and I. Service was great, music was a vibe, drinks are strong, and the food was amazing. After dinner we stepped outside and the view was breathtaking. My friends and I enjoyed every bit of it and it was all of our first time there. Susy took very good care of us as well. Also, as far parking there is a lot of parking, side parking, under the train they have meters until 10pm, and they do have valet parking as well. We look forward to coming back, to enjoy brunch and celebrate more birthdays here. 🥂"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RlQzUk1hWFJ5TlRSNmFHeExPUzE0VWpodGVXYxAB",
            "text": "Basado en mi experiencia en este lugar, primero la atención no fue muy buena, segundo el menu es muy simple no tiene muchas opciones, estaba un poco bueno que pedi, tercero te dan 90 minutos para que estes afuera y te envian correo apenas pasa ese tiempo, el baño de hombre estaba 🤢🤢 no se que paso ese dia pero muy malo !"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbXVPMzNnRRAB",
            "text": "Of course, here's another review:\n\nI recently had the pleasure of dining at Lighthouse Rooftop, and I must say, it was an absolute delight! The vibe up there is unmatched, so lively and inviting. And don't even get me started on their French toast! It was like a taste of heaven on my plate. If you're looking for a top-notch dining experience, do yourself a favor and head to Lighthouse Rooftop. You won't regret it!"
        }
    ],
    "reviews_count": 83
}