{
    "name": "Cafe Triskell",
    "place_id": "ChIJ0T9xRi5fwokRaIuqYVfm5tU",
    "grid": "QN1",
    "address": "33-04 36th Ave, Long Island City, NY 11106, USA",
    "rating": 4.6,
    "user_ratings_total": 426,
    "phone_number": "(718) 472-0612",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYWVVSXRUVWxQZEVnek5scG1Xa2hqTUVSRFkzYxAB",
            "text": "Amazing place! Everything about it is great , the vibe, the food, everything. Highly recommend!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaFlVTnVWMmR1UTFKbmJWQkhiWEV5TkVoNVYyYxAB",
            "text": "One of the best french toast i ever had!\nDefinitely come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeFptRnFlSFZpTUdaaFMxQndhRGRyUXpKeU5VRRAB",
            "text": "We live in the area and Cafe Triskell is a go to for Brunch. Food is great and the vibe is lovely. Highly recommend if you’re looking for a nice relaxing morning! Thank you!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSa1JEUnJUMnQ1ZEdOemFXOHdVR2N4TVdjeExWRRAB",
            "text": "We were there for brunch it was too loudly. Even  I can’t heard  my friend who is seat next to me. Eggs nordic I ordered for myself,  salmon was  very small piece. My friend ordered escargot was delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTU9XZFdRMFJ4ZEVWWlNFaGxjSGhzTlRWRFgzYxAB",
            "text": "Terrible service. Waiting 25 plus minutes for a seat was said would take 5 minutes. The tables were clear but no one cleaned them. The waiter sat a group that came in after us before us. Then said she would clear our table and didn’t. She removed the dirty plates and never went back to clean the table. Had us waiting an additional 5 minutes till we got fed up and went to the table and cleaned it ourselves with hand wipes. Made us wait an ADDITIONAL 5 minutes to come take our order. After seeing the people next to us and not approaching us.\n\nThe table we were at, the ac kept dripping on us.\n\nI get maybe the waiter was overwhelmed working alone but this is a TINY place. 6-7 tables MAX.\n\nI give the food 5 stars, because it genuinely was delicious. That made us happy. Maybe we will try again when we see the place is empty."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRGRtSjZRMGgyWmxVNVlUQm9SVGhsVlZOaVFrRRAB",
            "text": "Blown away by how good the food was. Loved the escargot. Duck breast was phenomenal!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcU1VdFFUVzgzVUhsamIzcFNOVTlxVkdaV0xYYxAB",
            "text": "Cute little spot exactly like a crêperie in Paris. Food was authentic and delicious both sweet and savory and I love the neighborhood/family vibe!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJX1U4ckh6Mk9fTV9nRRAB",
            "text": "Living in Astoria for a few years , very glad my friends and I found this place. Food,service is great! Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM1NGZGtXR0ZIUzNCa1VESk9WMHhyT0dwTE1WRRAB",
            "text": "Run down beat up hole in the wall. Let's get crepe-y not creepy! Everyone was seated before me. Did not like the server. When I got there there was no one. Food was amazing, authentic and beautifully presented. This place is so small \"you got to outside to change your mind\". \"Can't swing a dead cat in that place\" ... Those are 2 NY sayings for \"ITS SMALL\". You can't book your family reunion here...not even a basketball team...maybe not even a book club. It's a great date place, it's intimate...it's ugly and has bad lighting so it makes everyone look better.... Bring your date here. It's French, the food is delicious and it's cozy.  A refreshing surprise. Eat your food and get out because there aren't many tables and people in Astoria like good food so let's keep it moving people.... go to a cafe or something afterwards!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNemxzTVhaNElTaUxBEAE",
            "text": "Crepes are incredibly tasty - a bit of French in a quiet neighborhood- a true hidden gem\nThank you Chef and staff"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabE5WRm1aVmRqU1RNNFYyTTNPRjlHWTJGU1NHYxAB",
            "text": "Excelente comida y atención 💖"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQMkQ2TDNjaUt2NTJBRRAB",
            "text": "The french onion soup is delicious and all the crepes!! The space gives me Amelie vibes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOXZPNVpBEAE",
            "text": "Nice spot; amazing french toast"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJd1AzV01BEAE",
            "text": "I think it is little bit over priced considering the taste"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRd0lMenR3RRAB",
            "text": "Incredible place! Will definitely come back again! Tiramisu and pancake are an incredible combination! ❤️"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnekpTVmlRRRAB",
            "text": "Best French toast ever. For real tho. Doesn’t even need syrup."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbFpldGFnEAE",
            "text": "We were excited to try this new place mainly for the crepes. We went in this morning in a group of 8 and were understandably seated on 2 separate tables since it’s a small place. The server promptly told us that they won’t be serving crepes today and only items from the brunch menu were available. While we were ordering, other tables were all served with crepes quickly, including a table of 4.\n\nConfused, we asked the server if crepes are available, her response is for a larger group, they cannot serve crepes for everyone. We were okay to wait longer but simply were not given the option.\n\nAlso, $20 for this?"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaFoydDRRRRAB",
            "text": "Amazing little bistro that Astoria is lucky to have. My only peeve is the music, which can  be loud and just… bad (chef’s playlist?)\nI can’t recommend any dish because I fear you’d miss one that was even better. They’re all excellent."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNVBXbFh3EAE",
            "text": "Fantastic crepes. Great Taste"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfd0kzbzdnRRAB",
            "text": "One waitress for the entire establishment who cannot handle the 8 tables. There is often a wait because again, 8 tables. One chef cooks everything so anything you order comes extremely slow. They are often out of more popular orders within an hour or two of opening. Food is good, but not worth the other drawbacks. Would take my business elsewhere."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dmJyejZnRRAB",
            "text": "Everything was actually great until my party of 3 went respectively home and 2 of us became ill. It was the only meal we each had all day and exhibited identical symptoms."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2X3BXV1RBEAE",
            "text": "Club music, French, affordable"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NjZQQW9RRRAB",
            "text": "Excelente."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbGFHeEhBEAE",
            "text": "Nice spot for brunch in our neighborhood. French toast was so soft and yummy. Loved the Eggs Florentine and don’t mind going back there for it.\n\n** A warning here that Mimosa is $10 with brunch the following ones are $15 we were misunderstood when the server kept on asking if we wanted another mimosas - ended up having 4 mimosa and only the first one was $10 😅"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueExTam5RRRAB",
            "text": "You guys are hating on the food you just order the wrong stuff also most of the time it can take long because people have reservations so they come first if you just walked in and there is only one person cooking remember there are people eating outside to there is a lot to be don’t don’t judge when you have not ever ran a restaurant with only 1 waitresses and one cook"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcDU3U093EAE",
            "text": "Marcela is Lovely wonderful host. Food was excellent"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhbUxEam1nRRAB",
            "text": "Great French onion soup, crepes 👍🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NTRLODlBRRAB",
            "text": "Philippe is an amazing chef! I highly recommend going to Cafe Triskell!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NTdUUE9BEAE",
            "text": "Tiny cafe, great for take out or maybe as a stop on a cute date"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OE1tdkhnEAE",
            "text": "Worst place.\nWaste of time and basic menu.\nNot satisfied at all.\nChoose a different place to dine at."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicG8zZjJBRRAB",
            "text": "Amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib2ZhMmJBEAE",
            "text": "💵Cash Discount of 4% -> Take cash if you can to avoid the card processing fees.\n\nWe went on a Saturday for impromptu brunch. The brunch menu included a drink of Coffee. Cafe Au Lait is a great choice overall.\n\n🏅French Toast\n\nThe broiche bread used for the french toast is incredibly soft and fluffy.  It feel like a fluffy pancake that melts in the mouth.  The compote provides a lovely tart and acidity to balance the rich and buttery toasts.  Loved the presentation in the Skewer and the maple syrup/compote mini glasses were a fun addition to the presentation.  Would highly recommend!\nFrench toast portion is huge for one so its great to share with someone to avoid a food comma.\n\nEggs Nordic:\n\nThe buiscuits were amazing, super airy and squishy.  All baked goods here were the highlights.  The hollandaise and eggs were great, super flavorful and well done.  The topping on this dish has a ocean/iodine like taste that might no be for everyone but I enjoyed the addition of the flavour profile to the smokey salmon and rich buttery hollandaise."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMODRMbDVRRRAB",
            "text": "Good and quick food, cute place, they don't make you feel rushed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6eHItU0NnEAE",
            "text": "This place is great, such a homey feel, fantastic food, relaxed vibe. The closest to a little French cafe I’ve had since being in France. Yes, the service isn’t your usual nyc pace, but it’s worth it and the food comes quickly.  The chef is very cool and helps the servers, awesome place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MGVQQnFBRRAB",
            "text": "We love this place! They get busy so don’t be late for reservations"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUaXJ2UmlRRRAB",
            "text": "The food is AMAZING!!! Those French toast are to die for!!! I also tried the eggs and bacon, delicious!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOS1EWkxnEAE",
            "text": "The house-made french toast was crazy good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbVkyQTN3RRAB",
            "text": "Chef Philippe is the best😍\nThe frisée salad is my favorite!!\nThe lemon sugar crepes are the best crepes I have ever had\nAlso enjoy the duck l’orange, French toast and  quiche."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcG9HU0tREAE",
            "text": "Delicious food. Incredible service. Good taste in music. Definitely a vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREN0wtOHJ3RRAB",
            "text": "Small and cozy place with a great french chef. The food is really good. I was there for brunch and I wanted to try everything. French Toast is amazing and also Eggs Florentine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MGN5Rkl3EAE",
            "text": "Best french place in Astoria and probably Queens"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cTk3X0FREAE",
            "text": "This very unassuming restaurant, that you can barely see as you are driving by, has some of the best quality food for brunch you could ever want and need. You can tell the one man chef show puts his heart and soul into everything he makes.\nI had the Nordic Benedict. Let me tell you. The light and fluffiness of the, what I like to call \"Love bun\" rolls that the, not porched, but fried egg was laying one created an almost spiritual lifting experience. Smoked salmon, to me, tasted like house made gravlax. The perfect blend of seasoning for the Benedict. And the Hollandaise sauce, was golden and  perfect. $20\nI had a bite of the corned beef hash and potatoes, and it was also very tasty. The corned beef was seasoned right and it comes with a fried egg which makes the dish perfect. $20\nHowever, the in house homemade French toast was the most interesting and awesome dish I have tasted in a very very long time. The 6 \"love buns\" on a skewer,  were served with maple syrup and this berry compote, that make you want to slap something, was an amazing addition to the dish. $20\nAll of the brunch menu comes with coffee, tea or orange juice.\nFor $20, I will be patronizing this establishment again and again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aTlPYWVBEAE",
            "text": "Just go to cítrico cafe a few blocks away for $6 wines and much better food and service, I mean the place is cute, but wow the prices are insane. I am so tired of small spots like this charging soooo much money for the most basic of things. There are sooooo many way better priced restaurants/bars in the area. Try Napoli. Cítrico cafe and many more spots. The wine pours are not even 5 ounces and they have the audacity to charge $15! This is not mid town Manhattan. The food was alright. Very small crepe for $17. $60 including tip for a small crepe, an aperol spritz (which was awful), and a very weak pour of wine. So many better spots in the area that don’t charge these obscene prices. Server was alright. Place is very tight. Food takes forever. For these prices you would expect something much better. Save your money. I wouldn’t waste my time at this horribly overpriced place. Crepe was alright I guess. But did not leave full."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dE5xN0hnEAE",
            "text": "A slice of France in Queens! I love the laid back attitude of Cafe Triskell. The food is delicious - the French Toast is a unique take and a special treat for fans of custard. The brunch special is also a great deal and includes a drink (or a 5+ charge for a mimosa). Service is a little on the slow side, but food is always served hot which is critical. Lovely neighbor spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkaF9UVUV3EAE",
            "text": "Very happy to see Cafe Triskell still going post pandemic as it remains one of the best French restaurants in all of NYC both for its authentic flavor and, at its core, being a spot for French comfort food. Don’t miss out on some of the best food in the city nestled in one of the best culinary neighborhoods in NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdS0tdHpRRRAB",
            "text": "An unexpected hidden gem tucked in a Queens street corner and a must for homesick frenchies on the quest for an authentic taste of home. The savory crepes (or galettes) are made with the traditional buckwheat flour and are perfect washed down with a glass of cider. Finish with one of their delicious dessert crepes for the complete experience. I'll be back for more... soon!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNON2VMRWFREAE",
            "text": "Good food good price.  Amazing since years."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxc2JPeGNREAE",
            "text": "Food was good, they really meant no substitutions though, couldn't get a side of fries and needed to have a 2 minute conversation to not cook the eggs runny. Service was bad, the server was rather inattentive and could not add the bill correctly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxZ2NiVjFBRRAB",
            "text": "The French onion soup was indeed fantastic, but the ambiance was not optimal. There was EDM playing so loudly that some component of the counter was rattling with the bass, which was very incongruous for a Saturday afternoon with only a couple tables occupied. It was also very expensive—we paid $56 for a chicken cordon bleu and a French onion soup with no drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMnBxXzlBRRAB",
            "text": "This place has a lot of meaning for me! I have very good memories there. Besides my memories it is the best place to experience authentic French cuisine. You must try egg-florentine and their crepes! It is soo tasty! Must go place in Astoria!!! Highly recommended🫶"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNGUyLU1nEAE",
            "text": "The Cafe is always full and you usually have to wait 30 minutes or so to be served here but the food is quite worth the wait.\n\nOne of their popular dishes which I would also recommend for you to try is their French toast. It is sweet and fluffy with a side of home made fruit jam.\n\nYou can't really go wrong with choosing a place like this for breakfast or lunch.\n\nMy one critique of this place would be that they only have one server who is usually a bit overwhelmed by everything but does a very admirable job of doing the work of 2-3 people. We were seated in a far corner and she forgot to give us condiments for fries after she asked if we wanted some. Our bill also took a while, understandably since she was so busy.\n\nAt any rate, I will definitely bring people here for brunch and eat here again even with that!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhNUpxMXJRRRAB",
            "text": "Really good. Tiny restaurant, a bit of a hole in the wall. My wife and I walked past it many times and decided to give it a try given the high reviews. It did not disappoint.\n\nFrench toast was very very fluffy and flavorful. Wife’s eggs with smoked salmon was equally as good. We are definitely coming back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMXFieUVBEAE",
            "text": "Hidden spot in Astoria! Really small restaurant run by one chef. I've been here for brunch a couple of times and each time I've had a good experience. The food is really delicious. I ordered the florentine benedict and quiche of the day and each dish was tasty. Pretty affordable too; I've heard great things about their dinner courses so must try that next!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdElfMVp3EAE",
            "text": "The restaurant is small and quaint. Food was okay. The quiche was good. Croque monsieur was not. The bread was regular white sandwich bread and there was no flavor. Service was slow. It makes sense since there was only one waitress and one cook during peak Saturday brunch hours. No milk alternatives for your coffee. Menu via QR code. Very hot and humid in the restaurant. The biggest downside truly was having to wait for water, to order, drinks, food, check, etc. I won’t be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKb00yTWF3EAE",
            "text": "I was craving a sweet crepe so I decided to finally visit Cafe Triskell! I'm so glad I did as well.\n\nThis french cafe is extremely inviting, cozy, and charming. It wasn't very busy but then again it was three in the afternoon on a Saturday.\n\nI ordered a cinnamon and sugar crepe with a diet coke. The crepe definitely hit the spot! It was delicious!!!\n\nThe service was also solid and the folks here were very friendly.\n\nI'll definitely come by again and have a proper meal next time.\n\nPro-tip: This is a perfect spot for a casual date! ❤️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdk16OGV3EAE",
            "text": "A tiny absolute gem of a French cafe. The brunch is perfection. Their fluffy, pillowy, cloud-like take on French Toast will blow your mind. One of the best things I've ever eaten. These aren't southern biscuits, more like Yorkshire puddings. Heaven."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLd01lcE5nEAE",
            "text": "Had a wonderful late lunch with my friend here. ❤️I absolutely love the FRENCH TOAST. It was the best one I had so far. Light crispy edge and soft, moist, creamy bread that melted in your mouth. The crepe was also good. The only thing is would like to remind is that they take cash only!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsLXNibGZREAE",
            "text": "Authentic and unique space. We came for brunch but decided to have crepes (1 sweet, 1 savory). Both were delicious and made out of organic buckwheat flour following the traditional recipe of Bretagne. I will definitely be back to try their dinner items."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3dHFIdGd3RRAB",
            "text": "Hidden breath of France in Astoria. It was my first time trying the place and I am impressed. Very family atmosphere. The food is just great, the best French anion soup, the French toast and chamomile lavende tea  were something special. I will be definitely back to try the rest of the menu."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNGVpSEVnEAE",
            "text": "Delicious food cooked a la minute. Tried the brunch corned beef hash and potatoes, as well as the French toast with berry compote. Delicious! Best french toast I've had in astoria. Peach sangria tasted like summer! Would recommend going early, seemed to fill up close to 12 on Sunday."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXODZUeTlRRRAB",
            "text": "This place is a hidden gem!! The coffee is fragrant, the foods flavor is paired perfectly, the service is friendly. Definitely a must go to in Astoria. I will say the lighting is not the best but we did go on a rainy day so it might have been darker than usual. Also super affordable for what you get!!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxdVp6b213RRAB",
            "text": "We had a great time enjoying a nice brunch here. We sat inside, but there is outside seating as well. The food was great - I had the Eggs Florentine and my wife had the Croque-Monsieur. Both were fantastic. I especially want to point out…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN3RiQzZ3RRAB",
            "text": "Delicious & amazing food! We got the french toast, onion soup, and a lemon crepe. All there were fantastic and we're planning to come back soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1cFphTHdnRRAB",
            "text": "The good: Food, speed, music choice (happy lively 80s-90s music)!\nThe fries were salted just right and the Croque monsieur was just the right temperature! Ham was ok.\n\nNow, the rest:\nThe menu on google maps, Apple Maps, and Yelp is an “old” menu with $5 less on most prices. Once you get inside, there’s a QR code to a “new” menu with higher prices and a slightly different layout.\n\nAnd, I was overcharged on tax by a bit.\n\nI feel transparency is extremely important in what are the menu items — The QR code could link to the same on-google menu, for example."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHZ3FuSVp3EAE",
            "text": "Exceptional local French restaurant!! French onion soup is always so delicious and fresh. I always come back for the french onion soup.\n\nAlso ordered the chicken and duck (today's special). Absolutely amazing and I love the duck so much!!\n\nCash only but highly recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMlBqOWZBEAE",
            "text": "Amazing! Incredible! Pleasure bite after bite. This hole-in-the-wall  is an absolute must! It is worth taking a trip to the city for. In proper fashion do not rush. Your food will be prepared in time...time is what it takes to make a…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4MElYeVVnEAE",
            "text": "This is one of our favorite places to brunch. Our go-to's are the corned beef and potatoes hash and their signature French toast.\n\nThe corned beef hash is simply delectable. The flavors are perfectly balanced between the beef, potatoes and the poached egg in hollandaise sauce. Their elevated take on the dish is definitely worth trying.\n\nThe French toast though!!! They have a delicately sweet taste and still have a little crispness beneath the drizzles of the syrup. The thing about their French toast is that some of the sweetness come from the bread itself versus mostly of it coming from the syrup on top. They definitely have a flavor that is unique to their French toast. That is undeniable.\n\nAll in all, amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxN0xudjJnRRAB",
            "text": "We visited here in 2023. 12. 23.\nWe tried Cordon Bleu and Egg Florentine. Cordon Bleu was a little mild for us, but still exotic and good. Also, I love the sauce of Egg Florentine. It was perfect!\nHowever, the best part of this cafe was crepes. We almost lost a chance to try the crepe(tiramisu crepe), but the server highly recommended it to us. It was the best crepe we ever had. Even with no sauce, the crepe was so savory and nutty! If you chose this cafe, you should try crepe and onion soup!! Do not lose your chance to have them."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCakpMdmVBEAE",
            "text": "Wonderful little spot with lots to offer, beautiful waitress who was very accommodating! The food was delicious and very filling. Loved the whole atmosphere at Cafe Triskell!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKLTluYU5REAE",
            "text": "Ate outside for brunch and it was delicious! Staff was friendly and helpful the food was exceptional. I tried the quiche of the day and the french toast. The quiche was great and  the french toast is something I'll come back for!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2MC1LQ1dnEAE",
            "text": "This place was so so good. It was described as French owners from Brittany who wanted to recreate a French cafe experience here in Astoria in Queens, New York City, and it did not disappoint.\n\nThe outside, the interior vibe and kitchen, and then ultimately the butter and sugar crepes, which is the only thing we had room for on this food tour, was devine. So crispy, buttery, slightly but not overly sweet, and so comforting.\n\nLooked like it had a lot of local fans, and we will definitely be back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NDZYZWR3EAE",
            "text": "Really cute and cozy French restaurant with a feeling you are no longer in NYC inside! The butter and sugar crepe was super crispy and indulgent, a perfect pick me up this afternoon to satiate a crepe craving. The espresso was delicious as well. Service is fast and attentive. The entire lunch and dinner menu looks amazing and I’d love to come back to support and enjoy their delicious food; I saw another diner’s French toast and wish I still had stomach space for it!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNzVmQ3JBRRAB",
            "text": "Astorias hidden little French bistro.  It had been a while since I was here last.  The menu is limited but the chef does a great job on nailing the classics.  It was good to be back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNXzlXRzB3RRAB",
            "text": "Oh. My gosh. This food was so good! I don’t know what they did to it, but it’s better than it’s supposed to be. Lol. I had the French onion soup (amazing), a bacon and potato crepe with some Swiss cheese (delicious and actually called a…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZb3RQcHZBRRAB",
            "text": "For over 2 years this has been my favorite place in Queens. It's also one of the best in the NYC area. Chef makes such amazing food and treats everyone like family. I highly recommend everything on the menu but the French Toast is everything. It's only on the weekends and it's worth it. Chef is also sensitive to gluten allergies so just call ahead. I came here often during the pandemic, ordered to go and ate outside and still, the food is amazing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1a3JpMVpnEAE",
            "text": "Def a hidden gem in Astoria, there are less than 10 tables with one chef but the food is amazing! We got the Eggs Nordic + Quiche of the Day (bacon)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNG9Yc0hBEAE",
            "text": "Hidden gem💎French restaurant in Astoria. Really good food and great prices. The place is small but cozy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURta3FQZXNRRRAB",
            "text": "You haven't lived yet.\nDo yourselves a favor and follow my lead!\nCome, get yourselves a French onion soup, a goat cheese salad, two double shots of espresso (for you and your accompaniment) and then get an IPA to round it off and be naughty for fun. 😉\nOur next course is a crepe full of ham and Swiss cheese, and a famous Croque Monsieur sandwich.\n\nEnjoy your visit, it's to be remembered! Tell your friends!!"
        },
        {
            "date": "2년 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwenFmXzFRRRAB",
            "text": "這趟去美國最愛的法式吐司\n吐司蛋奶香加上軟嫩的口感真的超棒！\n不過店內沒冷氣"
        }
    ],
    "reviews_count": 79
}