{
    "name": "Anassa Taverna Astoria",
    "place_id": "ChIJN7M5ifhfwokR0ojtSOmzHrY",
    "grid": "QN1",
    "address": "28-10 Astoria Blvd, Astoria, NY 11102, USA",
    "rating": 4.7,
    "user_ratings_total": 789,
    "phone_number": "(718) 721-5050",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4c1NsVm1la2x5U0ZOWk4ySTFlVWxPTW5NeVJsRRAB",
            "text": "We ate here last night for the first time and everything was absolutely fantastic!! We shared fried calamari and fried saganaki for appetizers. We ordered the Kefte kebab and filet mignon kebab and both were delicious, flavorful, and so tender- great portions too. The vibe in here is warm and energetic. Server was very friendly and paced the meal well. The manager came over to check on how we were doing, too, which is a plus. We highly recommend this place for your next date night!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMmQzSjNWVWxLWDFsb1NrMWZSM2R4UkdvMlgxRRAB",
            "text": "Amazing for events! We just did a rehersal dinner here and it was an excellent experience."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdmNtVTVhMnBuZVVaZlZYWldaRWt5VDJRNVMxRRAB",
            "text": "Great food great atmosphere outstanding service our waiter adonis  is a  consumate professional"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoM1oxUnNTWEZEVDBVeFYwWjVkUzA0WTNObmVHYxAB",
            "text": "Great place, very nice food and great service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbFkwWnZNR2hTWmxOMmIyWnBRazFPVW5KbE5GRRAB",
            "text": "Angel was great the bar !! We come every Sunday and sit at the bar for brunch\nWe love his hospitality"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc2NEZERaekV3UW1aUWVuQjJhWFpzZVdKb05HYxAB",
            "text": "My new favorite Greek restaurant in Astoria! Everything was absolutely delicious and the service was top notch. A little too loud for my taste but it was a Friday night… either way, I will definitely be back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSE5rUlBiVlY0U1V4TE9GRXhSMVpHTURKWllrRRAB",
            "text": "First time there. Restaurant vibes were great. It seemed busy and lots of tables were packed. Bar was busy as well. Food was very good. However, the service was TERRIBLE. Our waitress didn’t fully speak English, but proceeded to correct us on the pronunciation of the dishes. She was very condescending and only warmed up to us once my friend started speaking Greek to her. She did not walk around the table to take the order. I felt like I was ordering at a pub because I was basically screaming my order to her since the place was so loud. She then never came back to check on the table at all. Food came out very late and in batches. Not because it was busy, it was because they didn’t have anyone running the plates. I cancelled an order because somehow it never showed up to the table with everything else, once I called a busboy to ask to call the waitress over, she decided to come like 10 minutes after. By then everyone else was finished with their dishes so I canceled mine.\nI would probably go there once more to get the vibe again, and see if these are recurring issues. I will definitely not go back during dinner time, seems like they are not ready for a packed house. Again, food was good, for what we had. Drinks were not strong, but not weak either. They were ok restaurant drinks. Service was 1/10 and if I was given the same server I would request a different one. She was terrible. Being pretty and blonde doesn’t mean she has to be condescending, inattentive and rude."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMExWVnhOVFozYVZWRFlYVkVORmQ2VkRSUVdHYxAB",
            "text": "What a Fabulous Time..our first time here with a party of 10 to celebrate my Husbands bday. Family loved the food, atmosphere and vibe. The manager, Dimitri  was wonderful...at the end of the night he brought out a chilled bottle of Procesco for all to enjoy.  Our waiter was helpful and friendly.  Check this Place out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSk1qQm1hakY1TXpNd1JFWjJWbTQzUzNCT2IwRRAB",
            "text": "Everything from the octopus 🐙  to the Anassa chips for appetizers were great! For the entrees you can select your fish of choice and they prepare it to perfection. I went with the lamb chops with the lemon potatoes which were amazing. Service was good but the place was packed so I get it. Overall great experience 🙌🏽"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWWVrSlBVbTFvUjJOUVFXWmFTMGs0TUZZNVpHYxAB",
            "text": "Not one to usually leave reviews, but this restaurant is an absolute must! We tried the Octopus, Grilled Calamari, Branzino, and Chilean Sea Bass. Every dish was cooked to perfection. The food was outstanding, and the service was just as impressive. Truly top notch. Thank you! Oriana R."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVVRIWlZiMWxmYnpOc1lrSnVkbDlyV1hZMWVHYxAB",
            "text": "My first visit to this restaurant won’t be my last. The food was delicious, from the Skordalia, the zucchini chips, and lamb chops to the lava cake finish. Service was equally wonderful—friendly and responsive on all levels. I also enjoyed the casual atmosphere combined with a fine dining sensibility and attention to detail."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6N1BHSC13RRAB",
            "text": "I regret to share that my recent visit to Anassa Taverna was extremely disappointing, primarily due to the unprofessional and rude behavior of our waiter, Anthony (or Antony).\n\nFrom the moment Anthony approached our table, it was clear he was exasperated and impatient. While I was perusing the wine bottle menu, he abruptly closed the book and pointed to another menu featuring cocktails and wine by the glass. When I questioned why he did this and implied I may be interested in ordering from the wine bottle menu, he dismissively replied, \"I can tell.\" This was not only off-putting but also quite insulting.\n\nDespite this initial rudeness, we decided to stay because we were celebrating a friend’s birthday. I ordered a bottle of sparkling water, to which Anthony responded with an exaggerated, \"OH, you see, a bottle of sparkling water,\" and rolled his eyes. This response felt microaggressive and was indicative of his behavior throughout the evening.\n\nAnthony’s attitude continued to deteriorate. He rolled his eyes and sighed audibly every time we interacted with him. He dropped items on our table and immediately walked away without checking if we needed anything else. At no point during our meal did he come to check on us or offer additional water.\n\nThe final straw was when a friend requested an additional meal to go on a separate check. Anthony responded with an eye roll and a curt \"OK.\" This behavior was not only unprofessional but made what should have been a joyful birthday celebration feel hostile and unpleasant.\n\nAfter mentioning this experience to the management, the manager was very apologetic and addressed our concerns sincerely.  I have frequented Anassa Taverna multiple times and have seldom had such an experience. This seemed to be a one-time issue caused by a rude employee. I hope this feedback helps ensure better service in the future, as Anassa Taverna usually provides a wonderful dining experience.\n\n***UPDATE***: The manager, Vasso, went out of her way to make things right by offering us a complimentary dinner so we could re-experience Anassa without the rude server, Andoni. We returned a year later, and while the food took about an hour to arrive and was a bit dry, the overall experience was much better than our first visit. This has at least opened us up to being willing to come back again in the future."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scFVHTjFTRzR5TlhSeFRHeGtUbDh5YTNadmIwRRAB",
            "text": "All our dishes were delicious, but my grilled Swordfish kabab was SO good! The service was relaxed but attentive. And the decor was very modern and stylish."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbFFXdFZNRXhWV2psWGMzazNiRVF0YWpGbk0yYxAB",
            "text": "We celebrated a birthday recently and Anassa was the perfect place!!!! Antonis was our waiter and I want to extend my gratitude for the service he provided.  We felt like family because of his sincerity.\n\nWhat stands out to aside from the great service is the quality of the food. The presentation, the taste… perfection!!!!!\n\nLlamas!!!!!\n\n🥰"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oak1rTTNTVWhRYURaZmRGVnFSUzF0T1dsV1FYYxAB",
            "text": "When in astoria, not a bad place to hit up. The food good and the atomispher a great spot to grab a drink when In the area"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210V1ZtZzNNME13ZWxsZk1XWjNOMWQ2TFZWd1dHYxAB",
            "text": "Fresh seafood. The place to go for fresh whole grilled fish. Beautiful, modern restaurant. Local crowd. Surprised to find this spot in Astoria among old dated spots."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaFRrNXNaaTFZWVVWdVgyZG1iRzl5VDJSbldtYxAB",
            "text": "Food was amazing!! Antonios the server was super friendly and helpful. Can’t wait to be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keFpscFBPSGRQWDJvME1EUldNa1JsYWpKVmNXYxAB",
            "text": "Food was excellent. Server was excellent. Atmosphere excellent. Will be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNWFsUktZV1F4Vm1SQ1MyeHlSMU5hV210MVRsRRAB",
            "text": "Anassa Taverna Astoria is one of the best Greek restaurants in Queens! The atmosphere is modern and elegant, perfect for a night out with friends or family. The seafood is always fresh, the Greek meze are authentic, and the service is warm and attentive. A must-visit for anyone looking for top Mediterranean dining in Astoria."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbk1FUnVURVZFVEVKQmEwZE5TbFpxVWxodE1sRRAB",
            "text": "I took my family for dinner celebration. I enjoyed the sea bass and fried calamari. The staff were very attentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSV2NXZE5WMVUzYTBOZk1ETjNlR2xvTVhZNVYzYxAB",
            "text": "Delightful dessert, amazing experience lamb Sh... Were perfect price great... Definelity will come back enjoy my experience, manager is a great guy that knows what customer service is..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQmNVUkNXVlIxYW1wb1UzaHBXVTFSZGtJMFVVRRAB",
            "text": "Great place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUlVVcDJNVGszWm1OVFVYbEpRMHgzZFZSTVJuYxAB",
            "text": "Food was really good as well as the drinks"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSb2RqSklZMTlTTWpOT1kxVm9ZVE4zWDBkRlVHYxAB",
            "text": "This is the first time we visited Anassa, Astoria. We thoroughly enjoyed our dinner. We really want to thank Danielle for her friendliness, helping us to understand the menu, and with cocktail and wine selections. We had Greek sausage as appetizers and shrimp and filet mignon entrees served with perfect wine pairings. The orange cake and ice cream topped it off. We will certainly be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b2RYVm9RVkZzZWtJMWFVNVVlRFJqY0daU2RsRRAB",
            "text": "One of my favorites restaurants in the city!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORWNVOHlNRGxWUVRCMlVURjBjMkpoZURSMU1GRRAB",
            "text": "Visited for a birthday dinner with family and the food/service were phenomenal! The appetizers had us so full! The entrees were all amazing! I throughly enjoyed each course as well as the sangria. My faves were the Greek sausage and lamb chops- cooked to perfection! HIGHLY recommend for a special celebration or an intimate dinner. The restaurant is very stylish with great ambiance. LOVED it!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdVZ6bExObmxIY1c5MFRHZHlhR0ZZU1RSeFZXYxAB",
            "text": "I live in the neighborhood, and have enjoyed Anassa Taverna in Manhattan on Third Ave many times.  At some point this Astoria restaurant decided not only to not take reservations for 1 (which I think was the protocol from the beginning) but to not offer tables inside or out to solo diners when plenty were available to a walk-in.  “Sit at the bar, or go away” is all that’s on offer.  Sometimes a person wants to sit outside.  Sometimes a woman, sitting alone at the bar, invites much more conversation than she would ever want.  I’ve never gone back for a meal.  Not as a single, and not when I might bring a big group for a celebration."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMWJHaFBkbUY0VW5aRGNrRlJSVzk1ZGxsMWVrRRAB",
            "text": "Great experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbE9HSkRTSHAwUTJ0amJ6ZzFTR05NT1hGbVgzYxAB",
            "text": "The meatballs are just like Adana kebab, but the meat has no flavor, not enough salt, and the huge potatoes fill the entire plate, leaving the plate empty and the meatballs not tasting right. Other than that, everything else is okay, the appetizer plate is pretty good, and the pasta is also good. I don't care about the others so I can't say anything about them, but I think they're good too."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNWNtbEhkWEUxVjFGUWN6SmhYM3BQWW1kNk4yYxAB",
            "text": "Can’t say enough about this restaurant. Been dining here for years and never written a review.\n\nFood is always on point, drinks are always great. Staff is phenomenal, managers are always taking care of everyone.\n\nIt’s a great space, even for events."
        },
        {
            "date": "3달 전",
            "language": "uk",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTFFqVnNVVm93VlcxZlNqRm9MVnBxYVRBeVZXYxAB",
            "text": "Супер асортимент і супер обслуговування!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRVVFZDNiMmhEV1dkZmIyVkxVV3BXWW1SMVRYYxAB",
            "text": "There are many Greek restaurants in Astoria, : Anassa became my favorite. Everything was excellent—the food, the service, and the ambiance. My only suggestion would be to lower the music volume or consider playing something more calming, like classical or higher-frequency music, to enhance the overall atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFM1dHaHVOa0pQYUMxS2VqRkJhbVYxYW5acVlYYxAB",
            "text": "We really enjoyed the dinner - food was absolutely delicious, and good cocktails and wine too. Love to go back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kT2RXMXNjRVY2Y0Zoc0xWVlRTbmswWVZWb01WRRAB",
            "text": "Best seafood and Greek food in Astoria! My swordfish was sooo good, service was great too! Thank you for a wonderful birthday dinner!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSa2QyeDVkamhQVkdKTWEySmxUbUZ3TlUxV05HYxAB",
            "text": "Always a good vibe when i go here. Food is exceptional and fresh. Atmosphere is warm and staff is very welcoming. 10/10 must go!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZdGVFeEpVemR0ZG1ScFYwZzRibTlXTFdSVmJGRRAB",
            "text": "Excellent service, delicious food.  We had a great time yesterday for my birthday dinner.  I can't wait to go back. I loved the beet salad and everything else we had.  We will definitely be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOaWI1YVRJdjRfYTVnRRAB",
            "text": "Anassa Taverna Astoria delivers a polished yet soulful Greek dining experience that feels both upscale and inviting. Visited on a Saturday evening with two friends, we were immediately struck by the warm lighting, marble accents, and the hum of a lively crowd. The open kitchen and attentive staff set the tone for a memorable meal.\n\nHighlights:\n•\tThe grilled octopus was tender with a perfect char, complemented by capers and onions.\n•\tLamb chops were juicy and flavorful, served with roasted lemon potatoes.\n•\tLobster spaghetti featured a rich tomato sauce infused with ouzo and herbs. ￼ ￼\n\nDrawbacks:\n•\tThe restaurant can get noisy during peak hours; consider dining earlier for a quieter experience.\n\nInsider Tip:\nDon’t miss the complimentary revani cake at the end of your meal—a delightful semolina dessert soaked in honey syrup."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPYjd1Nl9fNHRucnVnRRAB",
            "text": "⭐⭐⭐⭐⭐\n\nDining at this incredible Greek tavern in Astoria every week is an unforgettable experience! From the moment I walk in, the warm and inviting atmosphere makes me feel like I'm in Greece. George, our server, is absolutely the best – attentive, friendly, and knowledgeable, ensuring that every part of our visit is perfect.\n\nThe menu is a delightful array of authentic Greek dishes, and every bite is bursting with flavor. I highly recommend the fresh fish and the grilled octopus – both are cooked to perfection. The freshness of the ingredients truly stands out, and the portions are generous.\n\nTo top it all off, the homemade portokalopita is the best I've ever tasted. It's the perfect spot for a cozy dinner with friends or family. I highly recommend it to anyone looking for an authentic Greek dining experience!\n\nG.S"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbXhqNVg1a0puRE9nEAE",
            "text": "Great food, service, and drinks. Would definitely be coming back. If you’re going on a weekend, don’t forget to make reservations."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPSFM4NTNaNmZQM2JBEAE",
            "text": "Good ambience and great service. The lamb chops and octopus; both were really good overall. Though, I’d say the octopus had a bit too much dill; it kind of took over the flavor. I also ordered the truffle fries, but they came out more like baked truffle potatoes , which ruined the whole truffle fry experience. Wouldn’t recommend getting those."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdnJtTG1tektDaFFnEAE",
            "text": "Great experience"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdWRHSXVBRRAB",
            "text": "Yes the food was good but the bartender does not know how to make a drink. The Long Island iced tea was no alcohol in it or I think he just weighed the bottle over it while sitting there. Another person complained about a drink that was too sweet. They had to come back and pour more champagne in it. Not for $15. I should have complained but I didn't. My wife stopped me overall. The spirits was okay"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZck9pNDdBRRAB",
            "text": "TOP NOTCH!!! I highly recommend Anassa Estiatori in LIC!  I frequently dine there with family and friends, at least monthly, given my Westchester residence. Reservations are essential.  For my recent 40th birthday celebration, I collaborated with Dimitri, George, and Antoni to host 30 adults and 8 children.  Their support was exceptional. The atmosphere was superb, the cuisine consistently delicious, and the service outstanding. Dimitri and his team provided a truly familial hospitality. I look forward to planning our next event there."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcmRHMVlBEAE",
            "text": "One of the best greek restaurants in Astoria NY"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJanFYOVhREAE",
            "text": "Had a wonderful birthday experience at the bar with Alejandro! Beautiful restaurant with lovely staff. My friend and I enjoyed all of our drinks and food, particularly the saganaki cheese and filet mignon kebab."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdUlEMHl3RRAB",
            "text": "me and my buddy waited 50 minutes for some typical ravioli which contained more sauce than ravoili as a whole. I feel like i paid for the sauce rather for the food itself."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bEtTRWpRRRAB",
            "text": "I ordered food on Uber Eats. They switched it to Relay and then cancelled after 2 hrs. I was trying to order for my 92 years old Greek dad. What do they even accept orders to just cancel?"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d0tDQllnEAE",
            "text": "Don’t order online from this place. Food just doesn’t come. Terrible service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaHZtMnVnRRAB",
            "text": "Great fun place"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRZ3ZyRmRBEAE",
            "text": "Prompt and friendly service, nice Greek menu and good food."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bnVUdzNRRRAB",
            "text": "즐거운 분위기 속에서 맛잇게 먹었습니다. 다음에는 씨푸드 요리도 도전해보고 싶네요. 가벼운 저녁장소로도 추천합니다!"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNob0pYZ0R3EAE",
            "text": "서비스최고\n분위기도 좋음"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdl9LMXh3RRAB",
            "text": "Came here on a Saturday night with reservations. Very lively. Waiters were attentive. The shrimp saganaki was flavorful. The octopus was exceptional. The lamb chop was delicious. Wasn’t a big fan of the baked clams. They were too oily and not fresh. I don’t think the waiter seemed to care when my friend told him. However, we had a good time as the drinks were good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMTRqdDZBRRAB",
            "text": "I had a wonderful experience here. We had a reservation and we were received and seated accordingly.  Server was amazing and knows his craft. May be little under staffed for a place with such foot traffic. Food was amazing and my wife really loved the cocktail. That was my first experience and definitely gonna be on my goto list for future occasions."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaeUxyRGRREAE",
            "text": "Great dinner spot in Astoria. The space was huge and not something I’m used to seeing in the city, plenty of space around tables. Thoughtful design touches and nice furniture and bar setup.\n\nOverall most of the food I tried was great, the service to get the food out was just very slow. It was a busy Saturday night so I’ll give them a little leeway, but it took at least 20-30 minutes for the entrees to come out, maybe longer… but at least we had really really incredible drinks to sip on. The Selene was amazing but the Madame Onassis was one of the best cocktails I’ve tried! Incredible drink and I can’t wait to come back and try another.\n\nThe organic salmon entree was what you’d expect, not the most innovative or incredible dish but still delicious. The sautéed veggies it came with were great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENnU3V2FnEAE",
            "text": "Came for the brunch party on Sunday.\n\nFood came out family-style all at once, didn’t think it was anything crazy. Pre-fixe menu is $80 and for dessert they legitimately bring out Dunkin’ Donuts munchkins in a box….\n\nService was pretty slow especially to get drinks. Took a long time to order & receive them which was upsetting considering the price we paid. I had a cardigan on my chair and the bouncer threw it on the floor.\n\nParty itself is fun, but prob wouldn’t get a table next time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNEtDdHBRRRAB",
            "text": "We Had a reservation on Friday at 7:30pm and everything was top notch. Dimitri is an absolutely fantastic manager and made sure everything was delicious and that we were happy. The ambience is so beautiful, and you can tell every single employee wants to make sure you have the best experience. Now let’s talk about the food. I know this sounds like an exaggeration but EVERY single thing was amazing. We ordered the tuna tartare, octopus, lamb chops, branzino, lava cake, and vanilla ice cream. You know a restaurant is awesome when even something as simple as vanilla ice cream can be done to the highest standard (It was a real vanilla bean ice cream; you see all the vanilla bean specks throughout). And the one drink I recommend the most (if you’re into a sweet, but not like juice) is the Madame Onassis. It’s a peachy drink and the best part is there’s little popping boba that they put on a mini shovel on top of the drink. How cute! And I can’t believe I forgot to mention they gave everyone in the restaurant a free round of Greek shots. The hospitality and food is unmatched. Thank you again to Dimitri, and all the staff at Anassa!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOU9mclpBEAE",
            "text": "Had my bridal shower at Anassa Taverna, and it was perfect!! The staff and manager were so friendly and accommodating to us. Food was delicious and very filling - definitely go for their lunch menu instead of brunch if you're hosting a daytime party here. Every detail was perfect, including the tablecloths, place settings, and stationery design.  Highly, highly recommend this place for a party or just a nice meal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdXVlaE1nEAE",
            "text": "I love eating here. The food is outstanding every single time I come and the atmosphere and vibes of the place are always immaculate. My favorite dish is the octopus, followed by the branzino. Also worth noting that the three dip appetizer is outstanding as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc19HamZnEAE",
            "text": "I appreciate the service and chef accommodating all my needs including beets with Greek yogurt. Bronzino is tasty. I like the lobster pasta and would like pasta to be house made rather than purchased outside. I like Avra lobster pasta better.\nI like they serve food very fast.\nFireworks is fun\nVery popular and crowded"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNU1xX0dREAE",
            "text": "Is one of my favorite stop here in Astoria!\n\nCocktails are great and the food is also on point.\n\nThe zucchini chips and the lobster for two. The fish. AND THE START BREAD !!!  lol"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneGRDekF3EAE",
            "text": "From the moment we stepped inside, we were enveloped in an atmosphere that exuded sophistication and warmth. The staff greeted us with smiles that immediately made us feel at home, and the ambiance was a perfect blend of modern Greek elegance with cozy charm.\n\nThe menu is a masterpiece in itself, showcasing both creative and familiar flavors that promise to delight. The cocktails  are creative and delicious!\nA Culinary Experience Like No Other!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2bnVUNnNnRRAB",
            "text": "We spotted this place as we drove by.  It had the right look, so we had to find out if it had the right taste.\n\nWe came back 3 hours later and tried the octopus, zucchini chips, fried cheese and the Black Sea bass.  Everything was delicious.\n\nCome here for good food, good drinks, and interesting music."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlek9mcjVBRRAB",
            "text": "Absolutely love this cute Greek restaurant in Astoria. Great food and love the ambiance of the place. The waiter was wonderful and made sure everything was good. We came in around 2pm which they only served brunch till dinner time. The food…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeGFPcnNRRRAB",
            "text": "We celebrated a birthday here and were blown away by the quality of service, food, and atmosphere. We got to pick out our own fish and the waitress was so kind and attentive.\nIf you have a special occasion to celebrate or just want an intimate dinner, come here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbXREVEVBEAE",
            "text": "We decided to goto Anassa last minute on a Saturday night. All the reservations were taken but the hostess told us we can do first come first serve at the bar and that I could call back to check the availability. I called back as I got closer and the host said she would hold two bar seats for me. The bartender was really friendly and helpful. He went through all the popular items and his recommendations and helped us take a picture. We ordered the lamb chop, the dips spread, grilled branzino and spinach rice. They also have fresh fish on ice that you can pick to be grilled. Everything came out perfect and amazing. I don’t have one complaint about Anassa. The interior was also quite nice. There was a noisy table and the couple next to us was bother by it and told management and they informed the noisy table immediately. Great food, service and ambiance. Can’t ask for more. Will be back and my new favorite Mediterranean restaurant."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcEpDRTdnRRAB",
            "text": "Este restaurante superó  mis expectativas.  Es un lugar amplio  con una de decoración muy, muy chic y con un ambiente muy cálido que nos hicieron sentir bienvenidos.\nLa atención por parte de Dionicio y los demás companeros fue exclente.\nEl sabor de sus platillos son deliciosos  y sobre todo están preparados con ingredientes frescos y de gran calidad."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwN0lYYm1BRRAB",
            "text": "Anassa is a spacious and gracious restaurant. But most importantly, it's delicious!!!!\nWe had reservations to meet our daughter at 7:30. We drove from upstate NY, about a 4 hour ride. Traffic was light so we arrived in Astoria at 4:30. The restaurant had it's doors open,so we went inside. The wait staff was so gracious since the dining room didn't open until 5 pm.  They allowed us to use the restrooms (they took pity looking at two seventy something folks). The hostess said they we were welcome to return when they opened at 5 and said she would seat us at a table since sitting at the bar would be uncomfortable.\nDinner started with cold salads and pita bread. The lobster ravioli were a combination of creamy and saucy. Since it was my daughter's birthday,  they brought out ice cream with toppings with a large sparkler. Her drink had the traditional eye icon floating on top. A great novelty, and they are edible. Overall, a delicious \"trip\" to Greece."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhOThPZXJnRRAB",
            "text": "Amazing food, elegant ambiance and great service. Great place for a special event. I recently did my daughters baptism I was very pleased with the outcome and all my guests were very happy. My go to dishes are the ananssa chips, grilled lamb-chops with lemon potatoes"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MzdYdnBnRRAB",
            "text": "Beautiful Greek restaurant with super tasty food . Celebrate my birthday here and come back here again and again . Delicious zucchini tower, romaine salad, grill octopus, lobster pasta and so much more. One of my favourite sangria as well. Perfect service and great atmosphere. Recommend for every seafood lover ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dHRfRmd3RRAB",
            "text": "Was heading to Astoria seafood, but it’s close for vacation. Found this rating 4.7 Greek seafood place on Google map, decide to give it a try. Love the octopus. Calamari good, can be a little more brown. Greek salad needs more olives, less…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxd052c0x3EAE",
            "text": "The ambience and atmosphere here is super awesome! Literally had the best octopus I've ever had. I would come back for the complimentary bread and hummus alone cause even that was incredible. We had the branzino and lamb chops which were both absolutely perfect! We sat at the bar for a more casual dining experience and the servers were friendly and social."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLaUtPakFnEAE",
            "text": "This restaurant has become a family favorite for us. A little pricey, but worth it! Our waiter was so friendly and funny and was great help with the menu! Everything we ate was delicious!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpaTV6eW5BRRAB",
            "text": "Overall good food and nice ambience, the staff is super friendly and the manager came over to check that we were happy with everything.\nFood: appetizers were CHEESE SAGANAKI, OCTOPUS, HALLOUMI. All three were delish but the octopus was a little too salty.\nMain dish: The lobster spaghetti for two, although the presentation of the dish was nice the dish itself fell short. The pasta could have been more al dente and the flavors were nothing to remember. However, the lamb chops (3) blew us away! we ordered an extra one and very happy we did, honestly the best lamb chomps we had in a while!\nCocktails are also very well made!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlemNXckZREAE",
            "text": "First time at Anassa. We were craving a Greek dinner and made a reservation here a couple days before. We were very much surprised (in a good way)! The ambiance is excellent with the decor and music. Food was excellent, as a group of 3 we shared some apps, great cocktails and lamb chops. Highly recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMTl1YTJBRRAB",
            "text": "We had a very nice time !!! It was my friend’s bday, and we surprised her with this incredible dinner.\nThe staff was super friendly, food was amazing… drinks, and everything!!!…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NjRpbkxBEAE",
            "text": "Food was great. Service was good. The wait between appetizers and mains took a very long time (considering it wasn’t a weekend when we went) and to be honest a bit of a buzz kill. The octopus was killer. I’d go back. Although the cocktail menu hasn’t my favorite the wine selection was solid."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2aGZXSTlnRRAB",
            "text": "One of my favorite cuisines and Anassa Taverna at Astoria made me fall in love with it all over again.\nIt's a generously big place, much more open and spacious than it's Manhattan cousin.\nI would say the menu is also more wide. We got a cute table by the door that overlooks their outdoor seating.\nOrdered a glass of red wine; cabarnet.\nMust order their spread, you can pick up three of five on offer and they serve with generous portion of pita. We ordered tzaziki, flava and Tirokafteri.\nOne of their best appetizers I can confidently say is fried zucchini patties. Though a bit greasy but the crispy and juicy finely cut zucchini with light flavors is too tempting to just stop at few bites.\nTheir shrimps saganaki in tomato sauce was delicious  as well. It was what I expected.\nWhat disappointed me was their Chilean sea bass skewers. I have always known Greek food to be flavorful with minimum use of spices but somehow this dish tasted bland.\nLastly we ordered swordfish kebabs, they serve it with broccoli rabe and pita bread. It was a perfect end to our deliciously soul fulfilling experience at this place.\nService was good as well, we were taken care of full evening and they were in no rush to push us away.\nI want to return here to try their octopus.\nI definitely recommend this place. True gem in Astoria."
        }
    ],
    "reviews_count": 78
}