{
    "name": "De Hot Pot",
    "place_id": "ChIJP8OZxhJbwokR7KIGqK8m3Tk",
    "grid": "BK9",
    "address": "1127 Washington Ave, Brooklyn, NY 11225, USA",
    "rating": 4.5,
    "user_ratings_total": 902,
    "phone_number": "(347) 240-1180",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRFdYbFZMWFEzYVd4cFNFTkxhSFJPYmpSeWVFRRAB",
            "text": "I've been hearing everyone rave about these doubles, so I decided to order three. Unfortunately, I was left feeling quite disappointed. The curry and peas lacked flavor, salt, and any sort of seasoning. I asked for tamarind sauce and pepper on the side, but they gave me a bland mixed version instead. Just yesterday, I had a double from Bake and Things, and let me tell you, it was on a whole different level. I feel like I wasted my $7.50 for something that didn't deliver at all. I really can't understand all the high praise after such a letdown."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbk9IVkNWbFJxVDNsNFFtOUVNRWgzU1RkcVluYxAB",
            "text": "Amazing food and very friendly staff. Keep going back again and again"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWWRUWlBiME5sYUZKSGFFZFpaVGhvVEhCYWFsRRAB",
            "text": "Just had my first double and aloo pie today…so happy it was from here.  Absolutely delicious and you can get non-spicy variants!   Oh and did I mention it was super affordable and they were gracious about answering my questions, first time trying trini food and had such an amazing breakfast."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNXRiQTNnRRAB",
            "text": "They make the best doubles. I always come here for doubles. I have tried it with different meats available. So much flavor, and definitely fulfilling. I'll definitely return to try other meals."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcVFVMXNaVWt3V1d3MFdqVmxSbkpGTW5oSFFWRRAB",
            "text": "First time having a double so I’m no expert but it was absolutely delicious. Got the boneless chicken with everything and it was incredible. Cant wait to come back for roti"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGblR6VkVjR0ZVUmtsNmVGUlBNbEprUkdWMWRXYxAB",
            "text": "the veggie plate can't be beat!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NFpUZFZaVXRtTFU1UFNsZEZWR0ZoWjFKeVdrRRAB",
            "text": "When ever I work by Prospect Park I make sure I stop in to get food..very good chicken roti and the best shrimp doubles in town !!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkd1JuZDZTM0p4UWxsUFQyTldTV0pUTTFaWVIwRRAB",
            "text": "The food was not good the bartender is excellent dinero was super great and keno was great too the server was not great she didn’t have good customer these two works are best at this place hostess not even greet us with a smile"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRWJtWkpVVzF6WjFwMllWWkJUR1JuVFVkYWFWRRAB",
            "text": "Fast, uncomplicated service, delicious meals, gold medal winning, delicious boss doubles, love this place❤🤍🖤…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSek5WVkRjREZmZGxKelUxaFlOMUExTUdsQ2RrRRAB",
            "text": "This is in my opinion the best roti in the neighborhood! Just be mindful they might run out if some items at the end of the day, and the prices on the website are not correct. I added a picture with the updated prices. Oh, and cash only"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWVRHMVVVM1ZrT1RWdGIxWkVZbGg1VjBwNk5WRRAB",
            "text": "Really great veggie roti! Quick line"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bFoySkxURjlUVHpOM09IZDFTMFp6WkZWV1ltYxAB",
            "text": "My favorite spot for doubles. Tamarind and salt n pepper for me. So good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201a1IwbzViM2swVlRaUmNUQk9SRXgxT1hSWGNsRRAB",
            "text": "It’s a little cramp in there but they move fast to get everybody out,  the food best trini doubles in the city ONLY BAD THING is that they don’t take CARD they need to start doing that"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNM1lYRTFSV3RUTVdNd1dESkNZVzR4Yms5bFJGRRAB",
            "text": "Accidentally I stumbled on to this place,my mom is the one that goes here.She constantly buys doubles for the family whenever she visits.My wife came here also a week ago.Today I was just in area and decided to get the family 7 doubles,and a chicken Roti for myself.I was surprised the chicken Roti tasted real good.The doubles as always was tasty and delicious.So if you're in this area,they are not to far from Prospect park, where Empire Blvd and Flatbush Ave intersect."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNE0yZDRZVGxDVFhKalRXSXhNVTFsUWtrelJIYxAB",
            "text": "so good! the doubles with everything on them gets me feeling right every time! every thing on the menu is solid. Cash only!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zd1NUZERWSG8xY25kUVYyNVlXVWRtWW5CVWNYYxAB",
            "text": "No frills experience, but i've yet to find better doubles in the city. Delicious. Take out only"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaMVRXSkhORGN0ZUdWRmExVlllbWRvVkZoTk5WRRAB",
            "text": "Takeout/cash only, but very affordable doubles. I’d highly recommend adding beef/goat — super tender and flavorful.\n\nAlso tried their beef patty, but the doubles here are the standout dish."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZeHNxYUJnEAE",
            "text": "Their potatoes for their curry is cut up too big , they use the wrong curry , their food has no flavor.  We all got diarrhea from eating roti, their roti skins are too expensive  a roti skin should be $1.00 -$1.50 A dozen roti $12.00 Their roti skins is hard and too fat at the ends, the tamarind sauce needs garlic and shadow benni and a little sugar"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVdFVIWnROa1JDT1hacmVVRlVlR1JKYUVSQk9WRRAB",
            "text": "The hot pot is the hot spot 😋…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sT1JVeGZTMUY1VEc1U1J6QkxNVEJTYkVOSVpWRRAB",
            "text": "The foods good the attitudes aren’t . I won’t be spending my money here anymore after the way I was treated ordering food here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKbmx1cXoydS1MdDRRRRAB",
            "text": "Great tasting food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJTzZ4N3Fxd3FMbmxRRRAB",
            "text": "Delicious food! Pleasant staff, very helpful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLcjJqWjNKZ0xmRnJBRRAB",
            "text": "I had a great experience will be returning"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOUEdqSnZIdE9HVk9BEAE",
            "text": "Best doubles in Brooklyn! Food is delicious and affordable. Service is very fast, which helps when the line is long. Not especially chatty and friendly, but it's not the kind of spot. Get in and out and enjoy!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMbWJ0NFBOOEphb2hRRRAB",
            "text": "Neighborhood gem for 15+years. Family owned and operated (shout out Christine and Andy!). The staff is dedicated and hard working, the food is amazing and the prices are great. De Hot Pot is consistently at the top of the list on the Brooklyn subreddit when people ask who has the best doubles in Brooklyn. Warm welcoming establishment with delicious, well priced food. Great doubles, aloo pie, rotis, patties and more. Vegetarian and pescatarian options."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKQ091YVNFekxHZTFRRRAB",
            "text": "I used to be a big fan of this restaurant, but unfortunately, my last experience was a disappointment. I had a issue with food handling that led to food poisoning. I observed that the same staff member was handling both food and cash without proper hygiene practices, which was concerning. Due to this incident, I have lost trust in the restaurant's food safety and will not be returning."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3ME9qZ29RRRAB",
            "text": "Very delicious doubles. Never had a bad meal here. Authentic Trini food. Cash only."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQSE1tb2F6c2FHWXRnRRAB",
            "text": "Delicious and legit !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeGZIMzNnRRAB",
            "text": "Delicious! The doubles with the tamarind, mango achar and scotch bonnet, 😋 mmm, mmm, mmm delicious 🤤. They used to sell something called fish buns that I can't find anywhere else but I have cravings for it all the time 😭. Please bring it back in abundance.\n\nTo the Owner: What happened to the halal meats? You are going to lose your Muslim patrons by not offering halal. Bring it back so I can come back."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4MnU3Umd3RRAB",
            "text": "Great food and staff"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bElIT0ZBEAE",
            "text": "No B.S., ungentrified, straight to the point ol' school Trini spot w good food and good prices. I'm so glad they're still here and hope they stick around for years to come."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdmF2M1J3EAE",
            "text": "If you Love good Trini food. This is your place. Line can be out the door, but it is worth the wait"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbHAzTjF3RRAB",
            "text": "Great prices, amazing food. Just wish they had seating!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidGE3VkFREAE",
            "text": "Workers talk too much amongst themselves and you wonder why the order wrong.  But for my first visit the food was fine and priced reasonable.  Would go back if I find a park\n\nOk fast forward…. I must have dropped in on a moment but today was so different. Atmosphere was pleasant and right to the point. The boneless chicken doubles was brilliant the currant roll was ok would buy again"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndGVuUWxnRRAB",
            "text": "The best roti shop in brookkyn. The food is always fresh and tasty. I'm never disappointed."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfejQzMWx3RRAB",
            "text": "The roti skin was horrible, it was hard like it was stale and microwaved, very disappointed and we bought so many"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNDlPdDFnRRAB",
            "text": "De Hot Pot!! Top 3 doubles in the world, go get any grandma ma from Trinidad or Grenada to put them to de test, the Chana is soft and tender, the Bara is fried to perfection and full of flavor, the tamarind sauce Is sweet and will take the doubles to another level, there meat pie  right by the register has soft flaky crust and the beef inside is  seasoned with love, get a orchard or a banana solo to wash it all down and thank me later.."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcEttdWJnEAE",
            "text": "De hot pot Make some of the best curry goat that I have tasted in a long time from outside source. They doubles are very good too. This establishment is only a takeout."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNnJlX19BRRAB",
            "text": "Good trini food I recommend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dzY3UDJnRRAB",
            "text": "Service is good and the food is good obvious by the long lines at times.\nIts a nice little grab and go restaurant to have in the neighborhood for breakfast lunch and dinner.\nDecent prices too!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2Nm9PYVhBEAE",
            "text": "Food is very delicious , fresh & affordable! One of my favorite spots to come to"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dkpQcUFREAE",
            "text": "Great tasting food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M052b2VnEAE",
            "text": "The best"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcGR1azNBRRAB",
            "text": "Incredible roti!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNXZ2cmVBEAE",
            "text": "Best curry mango 🥭"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdF9uNTd3RRAB",
            "text": "Closes I’ve tasted to home"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzZ2VyRnZnRRAB",
            "text": "The spot for Doubles. This is a true classic of this neighborhood, steadfast and strong and tasty … truly legendary  spot…. Like Culpeppers, Immaculee, Allan’s, Peppa’s, Scoops, Gabay Market & The African Record Center, De Hot Pot is a cornerstone of Our community and I hope it stays that way for years to come…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdnN5ckFnEAE",
            "text": "Amazing doubles"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeDZDYXh3RRAB",
            "text": "Busy in a good way where you know the food is slammin and worth the wait."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaWMtRHB3RRAB",
            "text": "Kamini is the best!!!! Most friendly person there and not to mention the food is 🔥🔥🔥🔥🔥💯💯💯💯‼️‼️‼️…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMlBhNnRRRRAB",
            "text": "Takeout only. Cash only, but there's an ATM at the door. Toppings are extra and I should have sprung for some hot sauce if I had known the channa was mild. Saltfish was wonderfully tender."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNWFyZlpnEAE",
            "text": "Cash Only. They are currently allowing only 5 ppl at a time inside but the line moves quickly.\n\nStill my go to neighborhood joint.  Great value for the money. My go tos are still the doubles ($2 for the plain extra if you want extra-- I go plain all the time) with pepper sauce and tamarind sauce combo.  You can't go wrong.  Rotis are still massive ($7-9).\n\nBut I would be remiss if I didn't mention that the flavors are a little different.  Not different bad.  Just different.  But the pepper sauce and tamarind seem not as sweet or spicy as they usually are. I still love this place, I do but I wonder if all the new gentrifiers are forcing the owners to water things down a bit.  I'll give it another try in a month or so and will report back.\n\n5 customers allowed in at at time. Mask and social distancing required.  Everyone respected this rule.   Even in the cold.  I appreciated that immensely during this covid times bc the place is quite small."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHaF9DMkpBEAE",
            "text": "I love this place. I must say every single time I come here there food is consistently amazing; never over spiced never over cooked! A great over the counter dining experience.\n\nThey do require wearing masks upon entry.\n\nWhen you’re craving Mouth-watering Trinidadian style of Cuisine, GO HERE!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlX1l2ai1nRRAB",
            "text": "I got a double (being a roti newbie still trying to understand what exactly it is and why I don't need to specify what goes in the double). Huge portion. The food tasted home-made and was super filling. Lesson learned is to bring home to…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaDV2NXB3RRAB",
            "text": "YUMMY! YUMMY! YUMMY!!! My taste buds were blown away with all the delicious flavors. My friends rave about this place, so we had to try it! It’s a must-try, for sure. I had a boneless chicken double with tamarin sauce. DELICIOUS. Cash only spot, but beyond worth it! Thank you De Hot Pot!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBLUpyZDV3RRAB",
            "text": "An update. I take the bus or dollar cab when I'm in a hurry to get to this place and pass about 3 similar restaurants on the way because they have the best doubles. It is to die for. The lines can be long at times but it is so worth the…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpcEthQzh3RRAB",
            "text": "I'm probably not an expert on rotis or doubles, but I feel that I am an expert on deliciousness and this is it. I have had roti in other spots, but this one is fantastic and consistently good. I used to get lunch here several times a week - says it all. Affordably priced - lunch for under ten dollars. I would usually get the wrapped boneless chicken roti (pictured below) and doubles. They ask you how spicy you want your roti, and even if you ask for spicy, they go easy on you. I think they have to trust that you won't come back and complain about the food being \"too spicy\" before they will actually give you spicy food. This is totally understandable because people actually do this (order spicy food and then regret it) They also have a large selection of imported Caribbean goods and packaged food and drinks for sale in the store/restaurant.\n\nAlways a line and cash only. This is real brooklyn food. It should be a stop on a food tour (after covid obviously)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCZ3AzQi1nRRAB",
            "text": "Great doubles and roti; takeout only. Each time I've visited, the line is out the door but moves fairly quickly if you know what you want already. Very affordable pricing, but note that it's cash only; there's an ATM onsite."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OHJueHNBRRAB",
            "text": "Great food! Bit of a wait but so worth it. Got the chicken (bone in), goat, and shrimp doubles. The roti is huge! Cash only."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dzhyYkhREAE",
            "text": "The best Rotis hands down. There is always a line out the door. The only place my friends and I buy. I went in for 3 and I ended up getting 5."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaXZiQ1lREAE",
            "text": "Food Was Good\nShould Go Early To Get Doubles And Fresher Food…\nThe Food Was Good Though"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNTd5bExnEAE",
            "text": "NASTY 🤮 in all areas! I ordered doubles. The inside was SLOP! The chickpeas weren’t curried. They didn’t have any of the fixings for the doubles NO TAMARIND, NO MANGO CHUTNEY, NO CUCUMBER, and NO PEPPER.  The food smelled terrible! It had me vomiting!\n\nIt wasn’t what I thought according to the rating. Please do not waste your time. The food is gross and it’s not worth a penny!\n\nThe customer service is horrible! The woman at the front counter had such a nasty attitude that a customer took over and started to explain something. It smelled like bleach! Everything looked ran down inside.\n\nAll the best however this restaurant is a BUST!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeGNxb1JnEAE",
            "text": "First time trying doubles, got regular and shrimp with everything on it, $8 total, $2 for the regular I believe. Amazing stuff. First time Trinidadian food also, glad I came here after a day at the gardens!!! If I lived close by I'd get 2 or maybe 10 to bring home!\n\nChickpeas were fresh, sauce had a little heat, the shrimp tender and everything tasted great! Highly recommend this place, 10/10. No experience with any other Caribbean food and was gonna eat elsewhere so couldn't really order the rotis, but that also looked great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqOTZmRXR3RRAB",
            "text": "First time trying a roti and doubles and it was life changing! The chicken double was our fave but the veggie roti was really good too. Will definitely come back when I’m in the area. Make sure you have cash!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREdFpIelRnEAE",
            "text": "One of the best places to get doubles. However, their customer service is terrible. I wasn’t aware that certain add ons were extra and instead of letting the customer know that. They just added it on without telling me. When I went to pay my total was $5 more than I expected so I told them I’ll just take two doubles off my order. That created a big problem and the treatment I received was disgusting especially being that I’ve came here many other times in the past. I will no longer be spending my money here until the Indian man and lady learn to have better customer service. That’s not how you treat loyal customers. The black man there too needs to learn that as well. Without your customers you don’t have a business just remember that."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cmFYaXJBRRAB",
            "text": "All the foods are very delicious. They can brush up on the curry chicken and shrimp because I feel like the amount u get with the dinner should be a little more. Other than that everything else is top notch. Best place to get Caribbean food in Brooklyn!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwajlqc09REAE",
            "text": "Food was great! From the doubles to the curried chicken, curried goat, curried shrimp, curried beef. The roti’s are amazing as well very fresh. As well as the greens and plantains! The gravy they have is so delectable very rich and tasty. The Chana and vegetable options are amazing as well. Oh and if the service isn’t rude in a Caribbean place then the food ain’t good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREdnV6WlNREAE",
            "text": "On Sunday we went there for lunch. The channa had a partially burnt taste. The curry goat was way too salty. This place on a Sunday especially is a hit or a miss. I'm very disappointed in their quality of food. They can do better. It's Trini food!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacC1icWVnEAE",
            "text": "Fantastic place to grab roti and doubles! The boneless chicken roti was incredible. I'm still thinking about the doubles days later. So good. Grab your order to go and sit in nearby Prospect Park to eat. Perfection."
        }
    ],
    "reviews_count": 69
}