{
    "name": "Cafe Mado",
    "place_id": "ChIJrwTqaQBbwokRaK-iQfAWdG4",
    "grid": "BK9",
    "address": "791 Washington Ave, Brooklyn, NY 11238, USA",
    "rating": 4.7,
    "user_ratings_total": 190,
    "phone_number": "(347) 627-8298",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRGMybHlZa2xxZFRWc09VVkhUV04yYlc5T05WRRAB",
            "text": "Absolutely incredible pastries, coffees and sandwiches the rear patio is lovely"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NlJFcDVTMlZwV2s1d2JVUXphSFpMWVZWNGRYYxAB",
            "text": "Cafe Mado stands as the prime example of excellence in more ways than one. The team behind the food is cohesive, kind, and talented. The service is attentive, friendly, and efficient. Some of the best Caesar salad I’ve ever had, tender steak, unique flavors and out of this world homemade bread and butter. This is my go to place to celebrate special occasions or to show someone one of, if not the best restaurant in Brooklyn."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkc05EQldNVFl6WTJVNE9GSndRVkUxYURSSFpHYxAB",
            "text": "Delicious and refreshingly original take on lunch and brunch. Every dish is refined and inventive, blending different cuisines and flavors in a way that really works. Most of our dishes had a subtle kick.\nThe experience felt energizing compared to the usual predictable brunch scene."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMk1HeFBORmhZYW1oVmJtVlBZWGRmYm5GdkxYYxAB",
            "text": "We LOVED our dinner experience in their cutest backyard, super peaceful and memorable! We also really enjoyed the food, the butter was out of this world, the baguette was amazing, the eggplant sesame dip was delicious, the smoked date provolone farinata was insane, the Caesar salad was perfect, the cabbage dish was soooo mouthwatering and my favourite dish of all, followed by the bean purée and the crazily yummy sourdough bread next to it as rank two! I didn’t try the rib chops but my friends were dying for it loool\nThe only thing I didn’t like (but the rest of tbh party did) was the trout crudo, for which I blame Theodora for shooting my expectations for crudos to the roof! Also I couldn’t get my head around the price for that little amount of harissa, which wasn’t even that special, neither were the fries (and this one, everyone else was on the same page as me)\nOh and there was this empanada shaped dumpling bread dish that we loved but don’t recall the name.\nOverall, we really enjoyed our meal and we will be back :)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Jd1pURmtTemxvTVhFd1VHSmhVREkyWjNsb1EyYxAB",
            "text": "Always a treat for breakfast, lunch, or dinner. Fantastic spot for a chill weekday breakfast and coffee, a kinda fancy lunch, or a lovely dinner. Inventive and thoughtful food, they clearly care and go above and beyond to serve excellent quality.\n\nI love the so many things there, but always can rely on the simple but delicious jambon beurre sandwich for a quick snack.\n\nDon't skip their (annoyingly expeensive but totally worth it) homemade sodas!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcWR6bEtlRlp2WTFGV1NYUjJVVVZmUnpSbU5GRRAB",
            "text": "Cafe Mado is such a lovely spot! The pastries are fresh and delicious, the coffee is smooth, and everything tastes homemade with care. The vibe is cozy and relaxed, perfect for catching up with friends or enjoying a quiet moment. The staff are friendly and welcoming, making you feel right at home. A great place for good coffee, sweet treats, and warm vibes"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMWNtNUpWblpVU1ZadmQweG5hMU5RWm14NlpXYxAB",
            "text": "Everyone was so lovely!! We had a big group and they were so accommodating :) food was great! Faves were the apps and skate. The drinks including non alch were amazing as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xb1VtUlJjRE4zVjJNdFl6RkxNV3RHVTJ0clVIYxAB",
            "text": "It’s always a great time at cafe mado, ever since they opened! The dishes are phenomenal and so fresh, but the hospitality is what makes us come back for more :) Rylan is a treasure and always makes us feel welcome.\n\nOh, don’t forget to try their sister bakery / cafe, Laurel. :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWk0wUXRZekJvTVhGeGN5MUlMVXh4Vmt0TFRXYxAB",
            "text": "Very interesting place with not too big, but very creative menue. You better ask the server or Google some terms that they using to describe their dishes. But don't get me wrong,  this sophistication matches the taste. Everything including bread was a top notch.  Personally my favorites were the pasta, skate wing and the pork. Unfortunately I was so full that had no space for a dessert,  but from what other people having it looked very interesting.  The place has inside seating as well as outside on the backyard.  They are quite popular so reservation is highly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paelNtcFplbU5MWkZoSFprNTRUV1ZqU1ZreVNFRRAB",
            "text": "Wonderful meal - we had Lucas as our waiter and he is an amazing host. Really made our evening special"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeU5tOVVkRGRoVUZaUE0yNVFiMUpwWmw5emNrRRAB",
            "text": "Recently had brunch there - first they don’t have kids utensils. The waitress told us it’s best to share all the items including sandwiches. We ordered two sandwiches - egg hash brown cheese and Lion’s main. Those came out looking like a burger - I’m not sure how 4 people are supposed to share those. We asked the waitress if she can help us cut into 4 pieces cause it seems like it will be very messy to do that ourselves. She just gave us a knife and said we can do it ourselves…. Ok…I’m not expecting Michelin 3 star services here but if you are going to ask for a 20% tip later, I hope I could get a better experience here.\n\nLatest, food is very salty and seems like they uses too much dressing. Fries were good tho!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SaE1VTkVXSFIyYmxKb1FVRlViSG8xVVdaVmJrRRAB",
            "text": "Love this place! Always take my tourist friends here for brunch. However, my usual \"tony\" order recently came drenched, I mean spilling off the plate with sauce, which was no bueno. Not sure if they changed line chefs, but it was too saucy to eat. My friends egg sandos was too soggy to eat with her hands and fell apart. This has never been the case before so I hope it was just a mistep that day. I also hope they bring back the yummy sprtizs they used to have when they first opened in the summer! The food and friendliness when you walk in, is a welcome space to the neighborhood. I hope it sticks around for awhile!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSGEySTBZWFI0U1VjMk1HaDVkMTlvWW1aV01YYxAB",
            "text": "We’ve now had brunch and dinner here, and it always hits the spot! I love that their menu changes slightly so every time we go there’s something a little different to try!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRVp6SmlhazAxY0ROMlVrVlhkM0pUTWpkclMzYxAB",
            "text": "The most beautiful place, delicious food, stylish folks, an utter dream to be here for lunch!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NVZteElURVJsVmtsT1ZsVjNkVlZOY21sRVRtYxAB",
            "text": "Same team as oxalis so I knew it wouldn’t disappoint. Croissants were amazing and sandwiches were good too. Good place to chat and have coffee or do work. Excited to come back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOYWFXbzFVVVIwUlZvMFF5MVhUbkprYTNkUVpXYxAB",
            "text": "slaps every time !! bury me w that white bean dip"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKT1dHSkRVbHBPZEV0dU1sSk5ZV2htVFU5WVZsRRAB",
            "text": "Sensationally perfect"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWYWVFSmFRME5UZFZCc04ydDZMWEEyWkVZdE4wRRAB",
            "text": "Had a wonderful experience at Cafe Mado recently. Everything we ordered was delicious - the bean dip, the cesear salad, and the french fries with a side of harissa were favorites. The only thing I would skip if I returned is the martini. 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTldVNVNNRmRKZUZSVWFrWjFaVUUwWmpCUloyYxAB",
            "text": "Just about the best dinner I’ve had in Brooklyn this year. What I especially liked was the lack of stuffy coldness that comes with food this good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSExUSmlYMmRvU1RWb2NHTjBMVWwxT1RjM1ZWRRAB",
            "text": "Let me say that I have been here twice and both meals were absolutely transformative. The treatment of each ingredient is inspiring and fresh! The Summer Squash and Sunflower dish we had the other night was an absolute smash and the Rib Chop with the bark pan sauce...oh my god! The tomato toast with mussel butter is a must get. I didn't take a lot of pics because I was having too good a time. Our server Kenny made us feel like we were at an old friends house. The hospitality was absolute perfection. I love this restaurant and I can't wait to celebrate there again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRk4yUlhlRWhRU0d4aWN6TTRaSEkwVDBwRFMxRRAB",
            "text": "Hidden gem! Amazing rotating menu, service, and vibes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdk1GbEZMVFpZV1RocldqVnVRV2x5V2tkSllrRRAB",
            "text": "We had a great birthday brunch here on Sunday. I love the atmosphere, especially in the back of the restaurant with the garden like setting. Their prices are reasonable for the quality of food and drinks. We started with raspberry espresso tonics, a latte and the jasmine & pear beverage, loved them! They do have a pastry counter at the front of the restaurant where you can purchase pastries. For brunch we had the Bonny melon, the Redwood breakfast sandwich, the smoked Steelhead Trout, Mado's sausage breakfast sandwich, Lion's Mane sandwich and the chocolate croissants plus seasoned french fries. All of our food was excellent and our server Sam was so accommodating. Highly recommend making reservations here for any occasion, it doesn't disappoint!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oc1QxSk5WM3BOZEZJM2JUZEhRVXhuWWxCcFVXYxAB",
            "text": "Overall rating:4.9\n\nOmg, absolutely obsessed. My friend suggested this place & so happy to have brought it into my life. The FOOD IS SO GOOD OMG. I obviously did research before and here’s what I got.\n\n- Cappuccino: delicious but with 2x sugars!\n- The Tony: this is so highly recommended I was actually pretty concerned with getting it because it looked overrated. But wow was I surprised. OMG delicious!\n- Le Caesar: GET IT. It is so simple I know. I can’t believe this costs exist. But it’s soo good.\n- Pici (?) - you’ll have to tell based on the picture\n- Watermelon mocktail - did not taste like watermelon\n- Pink cocktail: can’t remember what this is, but my friend said it’s good!\n\nMy only critique on why it’s not a 5 is because the service got so spotty at one point. Usually before waiters leave or change shifts, they tell you. We lost ours toward the end and it felt impossible to order more or even get our check."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRVJUSlFaVWhIV0ZGQlpteE9aMnRuUzI1UVdGRRAB",
            "text": "Had a wonderful birthday lunch.  The atmosphere was\nbright and inviting, the service quick, friendly and knowledgeable about the choices.  Most of all the food\nwas original and delicious.  As a perfect finish, they\nserved us delicious gelato and a pastry assortment, gratis, for the birthday girl.  Conveniently located near Brooklyn Museum, park etc. Would definitely recommend and hope to come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbFRYSk1kRkYxY1dGTFEzcDJObkJaYlU1V1pYYxAB",
            "text": "Everything about Cafe Mado is worth coming back for."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRlpuVlpVbUp3TmpKZmVpMHdTM0o0Y1hoelpYYxAB",
            "text": "Honestly for the quality of what you get, overrated and over-priced.  It's a shame, because there's so many people in the kitchen, and the ingredients are very high quality, but the results are just okay.\n\nI went here for dinner a while ago, and the staff were sweet but the food underwhelmed, particularly the Caesar, and especially for how much we paid.\n\nI got some lunch here more recently. The croissant was so stale and chewy. No crisp, flaky crunch when you bite into it. No mess of crumbs. And even the flavour was so lacking I didnt eat more than the first bite. The tuna sandwich had a really nice filling, lovely balanced flavours, but the bread was wet because it had been refrigerated too long. The ham baguette was nice but nothing that I'd go back for."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swdGNHWmFZbmxOZFVOWWJGTXpOazQ0Ykdoc2VVRRAB",
            "text": "THIS IS AN OFFICIAL PETITION TO MAKE THE CONFIT TUNA SANDICH A PERMANENT MENU ITEM. IT IS THE BEST SANDWICH I HAVE HAD IN MY LIFE. I would also like to petition for the turkey with pickled poblano to come back but it’s less urgent than the tuna. This place is the best."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSE9GUTFVbVpDTmpOeFIxTm5URFJUYVdoWVNIYxAB",
            "text": "Everything about this place was amazing from the service to the ambiance to the amazing food. We were lucky enough to sit at the chef’s table closest to the kitchen and got to witness the masters at work the whole night during our meal.\n\nFrom the cocktails to the starter baguette and butter, caesar salad, grilled bean puree and lastly the pork tenderloin, every dish was delicious. Compliments to the chef!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdU0xVTFWMmRGVmpBek0yeEZkVlZ3YjFGd04yYxAB",
            "text": "Food and service were perfect! I had just proposed at the Brooklyn Botanic Garden and we came here to have a small lunch since I saw all these great reviews. Chef Nico came up to us and asked how everything was and what we were doing, after I informed him that we just got engaged he generously surprised us with gelato, fruit and even pastries to go. Nico and the rest of the staff really made this lunch special and we look forward to coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWU16RnRYM0YyYWtodGNWSkNlSHB4U205ME5GRRAB",
            "text": "We really wanted to like Cafe Mado and had high expectations - especially having enjoyed dining for a previous birthday dinner at its predecessor, Oxalis.\n\nSince the price point of Cafe Mado is also on the higher end, we decided to hold off until another special occasion to try it out.\n\nI’m afraid to report Cafe Mado left us incredibly disappointed with uninspired, flavorless, and poorly executed food with a distracted service staff to boot this past Thursday.\n\nOur dinner was comically bad, and basically left us feeling robbed.\n\nThe only thing this place has gotten right are its drinks menu, enticing on paper and perfectly executed.\n\nSERVICE\nTimings were really off at the start. We were sat at our table without water for 10 minutes, watching the hostess, multiple servers, and the owner/manager walking hurriedly back and forth past us, before our server showed up.\n\nWe easily could have walked out of there, nobody would have noticed, and I wish we did and had spent ~$150 elsewhere.\n\nWe had in mind two appetizers, an entree, and a side of fries, and said we’ll see how we felt after that. The server explained he had to put our entire order in all at once, and that we couldn’t add anything later on. That’s fine, but then he went on and detailed each dish by listing how many bites/pieces there are, and suggested we add another dish. He then critiqued our choice of fries as being “too heavy” and that the wild rice dish would be better with the beef. Even if that is the case, we simply wanted fries that night, not rice. We felt pushed again to add a dish to our order on his recommendation, so we caved and added a third appetizer.\n\nFOOD\nGrilled Bean Purée - this is a bland all beige dish, looks like cat throw up. This was the dish we didn’t want in the first place.\n\nAsparagus - three pieces of boiled asparagus cut to make the plate look more substantial. Our main complaint here is that it was also bland and lacked seasoning/salt. They were trying to rely on the same flavorless dressing used in the bean appetizer which was reintroduced here as foam which deflates within minutes.\n\nMussel Toast with Harissa -  a sorry sight of mussels on a raft of soggy bread afloat in a repellent vinegary and watery sauce.\n\nBeef - 6 square slices (actually instead of the 7 as forewarned by our server) of fatty beef with an overly sweet vegetable purée, topped with a few sprigs of undressed greens, reminiscent of a stereotypical tv dinner.\n\nFries with Herbs de Provence and Garlic Aoili - over fried and over salted. The garlic aioli tasted like plain mayonnaise squeezed straight from a bottle. We actually couldn’t eat these and left them untouched. The server didn’t say anything clearing off the full bowl of fries when we asked for a check.\n\nWe feel like this restaurant is coasting off the success of Oxalis and is finding it difficult to create a menu with its new identity. We ran out of there after paying the bill.\n\nAlthough we tried to make light of it all and joke about how bad it was, it still is shocking to us to have spent this amount of money and not having enjoyed one dish. Save yourselves from this overhyped overpriced place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SkxXTmxiR2RFVEVNM1luWkRWbGhHWW5GQ01FRRAB",
            "text": "Food was awesome, atmosphere was beautiful but, what really made the experience unforgettable was the service. Our waiter Jordan was so awesome! He made some amazing recommendations and had a really positive and fun attitude. 10/10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRM05IUkNjRU5rV25wSldYWXhkV2RrVldKUFFtYxAB",
            "text": "Lives up to the top 100 ranking!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tab1puVnNOME5EVWtac2EyNU9iM3BXVjNKdGIwRRAB",
            "text": "The food is so very inventive and sublime. I prefer it for breakfast vs. dinner to be honest.\n\nWe ordered almost everything on the breakfast menu and each dish was exceptional. So happy to have it in our neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSlVXOXhRWHB0TkZFNE1qSTFXbHBpYUhvMldVRRAB",
            "text": "Had a really wonderful experience today for lunch. The food and drinks here are absolutely stellar. Many vegetarian options to choose from. The hash brown breakfast sandwich was glorious. Though I loved everything about my meal, it was the service that I really want to comment on. I’ve never felt more welcomed at a restaurant than I did at cafe mado. They have cultivated such a warm and inviting atmosphere.  It was truly such a pleasure to dine here and I hope to return soon."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wb2NYSkhOazlJTWtwUWJWSTVaakZOVURWb1pHYxAB",
            "text": "Great little place for some delicious French themed food complemented by equally great and friendly service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJNnVfdHI4Zy1TTUlBEAE",
            "text": "Really great seasonal food. The asparagus and anchovy sauce were extremely good. The steak was stunning. Lovely staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLLXV0LWVkMDZmQjRnRRAB",
            "text": "We had so much fun! Such a treat. Expensive but a great experience, so makes it worth it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKUEk4N19nOHJmandRRRAB",
            "text": "I had to take out a loan for the egg and cheese sandwich."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYnMycmFkNXNiUjVnRRAB",
            "text": "One of the best all day cafe’s in New York. Great cafe and bakery with gorgeous pastries and breads and delicious drinks as well as a full sit down cafe for lunch and dinner with brilliantly executed dishes that celebrate the seasons and flavors of the Mediterranean. Great for a morning coffee and meeting or work session as well as a casual afternoon snack before the museum or gardens or even a celebration meal with beloved friends or colleagues."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMdVhtNzMwNmZXNkN3EAE",
            "text": "This is a really lovely cafe/ restaurant, just a little overpriced. Also there was quite a worried host considering this was an 80% empty restaurant late on a Tuesday lunchtime who definitely was “sticking to the rules” on what seating was available."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJRDc3ZnZndDlxamdBRRAB",
            "text": "The entire staff was very welcoming and attentive. The space was airy and had a skylight. The menu had plenty of veggie and mocktail options."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfd01EODV3RRAB",
            "text": "They need to tell us where they source their plates"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYmc0WVhtOXVyZ21RRRAB",
            "text": "Nice lunch. Sandwiches were really good. We enjoyed some non alcoholic drinks that were delightful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQU3loS3ZubDRfR1JnEAE",
            "text": "Pici is a pasta I have only ever seen in Siena - I was excited to see it offered in the US.  My excitement disintegrated when I discovered they're charging meal prices for appetizer portions.  You get about 7 bites for $36 (after tax/tip) - that's more than $5 per bite!  (Predominantly noodle, with a smattering of greens and topped with parmesan - definitely not a hearty dish.)\n\nWorse, I paired the pasta with a glass of wine.  It hit me hard without a substantial meal to balance it out, and I felt pretty drunk on the walk home.\n\nThe service manager's kindness when I gave him my honest feedback made me reluctant to leave a review, but people should know what to expect so they don't make the same mistake I did.\n\nIf you're going on a date or with a group where you'll share a bunch of dishes, you might not mind the small portions, but this is not a good place to come get a meal by yourself on a weeknight."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLXB1VkVREAE",
            "text": "Creative food, thoughtful service, gorgeous ambience, everything is absolutely perfect here.  One of those restaurants that makes you grateful you live in New York."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc3JMZW1nRRAB",
            "text": "It was a special night. The food was exceptional! Definitely get the baguette and the broccoli with tonnata was out of this world. The desserts were all unique as well.  The service was kind and attentive and the wine list was well curated. They have a great outdoor space as well. Definitely go!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcktEc1BnEAE",
            "text": "Had an amazing dinner in the outdoor garden. Food was excellent and service was top notch! Totally impressed and will be back!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbDZQVDhBRRAB",
            "text": "Beautiful place but the service was inconsistent (felt judged) and (similar to other reviews) the food was incredibly over priced for what you get... and you can't even add an egg for extra $$ to the avo toast.  Better to go elsewhere for dine in breakie... like the casual cafe around the block!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM2ZLaUdREAE",
            "text": "From the food: classic good food with culinary experience. Won’t blow your mind but its great. The restaurant has great light for summer night or brunch. Will go again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMmYzc0hnEAE",
            "text": "Cafe Mado is a place where, as soon as you walk in, they wrap their arms around you with love and ultimate care. The whole experience is incredible with the food and service being top-notch. They have a dedicated team of amazing chefs. I would recommend this place to anyone and everyone!!!\nEvery time I’m here it’s a memorable time whether it’s breakfast lunch or dinner!!! They turn the most simple things into delicious and flavorful bites that I’ve never experienced before"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMHRTMWpnRRAB",
            "text": "I had a great brunch at Cafe Mado. The sausage and egg sandwich was tasty. The pain au chocolat was perfectly flaky, and the latte was rich and smooth. The friendly service and inviting atmosphere made it a perfect spot for a relaxing brunch. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OExhQnJ3RRAB",
            "text": "I’m such a huge fan of Oxalis and I can’t wait for it to reopen so it’s no surprise that I ended up loving Cafe Mado!\n\nThe menu seems super understated but I promise everything is more special than it seems. My favorite were:\n\n- Pici Pasta with Fava Beans & Mint: Super lemony and loved that the fava beans were kind of the highlight. The intermittent bites of mint were great too.\n\n- BBQ Tri-Tip with Dried Chili: This one surprised me. The beef was so tender and I loved the chili sauce it came with.\n\n- Grilled Mushroom Toast with Egg Yolk: I honestly love anything with a runny yolk and the grilled lion’s mane was super umami and made this mushroom lover extremely happy\n\n- Blackened Yuba: This was like tofu skin soaked in some chili tomato situation and I wanted more.\n\nDon’t sleep on the desserts either. I know they sound kind of uninteresting: Swiss Roll with Huckleberry and Strawberries with Chamomile, but we liked them a lot more than we assumed!\n\nWasn’t in the mood to drink so I got the two nonalcoholic options: the Grand Fir and the Jasmine & Pear. The Grand Fir was flavored with pine and was the “drier”option, while the Jasmine & Pear was floral (lol surprise) and slightly sweet. Both were carbonated. I really liked both!\n\nService was friendly as ever. The servers seemed like they were excited to share what their favorites were and it made me excited as well. The dining space was the bar area of the old Oxalis; they’ve remodeled the tasting menu area into a daytime cafe. Need to try that out as well.\n\nOverall: I want so badly to gatekeep this place but I think everyone should try it! Will be back often."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbXY2RWt3RRAB",
            "text": "Lovely atmosphere and good food. Almost everything on the menu has bread, and while the bread is excellent, it was too much. The menu is too vague, and while I'm a fan of restaurants interpreting common dishes, this restaurant's interpretation is too heavy on the bread for me. The service at the bar was somewhat absent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cUlmM0RREAE",
            "text": "Absolutely delicious food, came in only for a bite and some coffee but ended up getting a few plates based on their recommendations, so happy I did. Everything is so well made and paired, savored each bite. Mushrooms were absolutely delicious, the summer melon was unique (sweet, can be a dessert) the red wine is a blend and delicious as well! Can’t wait to go back and try more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NmJDYUNnEAE",
            "text": "Service / staff were friendly and atmosphere and vibes were great. The three food dishes we got tasted good and had a nice presentation, though took a while and wouldn’t be anything to write home about. Cocktail selection was underwhelming - the pour for my house spritz (pictured) was noticeably smaller than what was served to other tables."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdjRMeGh3RRAB",
            "text": "Had a great Sunday spring dinner here. Everything we ordered was very well executed and super flavorful! Highly recommend for dinner and very accommodating for groups"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBLU8zdkRBEAE",
            "text": "I had a very nice dinner here. I feel like small plate/sharing style places like this often miss the mark but every dish we got really delivered. the Caesar salad was so fun and delicious, the cavatelli and pork rib were my other favorites. their bread from their bakery is amazing. the only part of the experience that was off was that we were charged for the dessert they brought out on the house since we were celebrating a birthday, which was a little strange, but not enough to knock it down to four stars. otherwise, I really enjoyed this meal and will probably be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBc2FLMGFBEAE",
            "text": "We LOVE Cafe Mado! We visit at least once every time we come to Brooklyn. It’s a great spot for brunch/lunch/dinner/mock/cocktail before or after a trip to the Brooklyn Museum. The space is beautiful — we love to sit at the bar because it’s got tons of windows and is surrounded by tree and also we always meet great people and the folks who work there are awesome! The food is beyond amazing. Faves include the Caesar salad and the fries. Their pork with 5 spice seasoning is delicious and you’ll want to try their Brooklyn bitters and soda, any cocktail or mocktail, or coffees. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNib3RTQ3pBRRAB",
            "text": "Everything i had was great, its a bit pricey but it definitely worth a try. The pici, fried fish, Toni and tomato toast were all great, and the mocktail I had was memorable ( jasmine and pear ). Dont forget the desserts, the hojicha ice cream mochi balls is good !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cWZtQk1REAE",
            "text": "All around a great visit to this spot! My friend and I got 5 different items (bread, two apps, one main, and fries). Overall the bread and apps were the stand out by far! The bean purée situation was unreal and the strawberry ricotta toast was divine. Also got the Caesar salad which was crisp and salty. I’d say the big miss for me was the main with the smoked trout. It was a TINY piece and the mushrooms were too smokey for my liking. The dish is $32 bucks and not worth it. Funny enough my friend who recommended this place also said his fish dish was his least favorite part and sadly I agree. The cocktails were great (spritz & strawberry) and the dessert was so tasty (sponge cake). Menu changes a lot! Great service. I’d go back but skip any fish dish!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNHFqdUpnEAE",
            "text": "We had a lovely Sunday dinner here and it was easily one of the best meals I have had in recent months.  The decor is very relaxing and the noise level was just right.  Service was attentive and not rushed. The food and beverages were very well designed and prepared.  This is not a vegetarian restaurant but the vegetable dishes are better than what one would find in many vegetarian places.  Everything is fresh and flavorful.  Even the bread and butter are exceptional.  Desserts are creative and tasty. It's a restaurant you would want to come back to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OU9TTkVREAE",
            "text": "Had lunch in the garden, and loved every minute of it! Had a great caesar, and cici in a perfect lemony pesto.\n\nI also appreciated that they had alcohol free drink options!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMa19La3F3RRAB",
            "text": "opening week. got the pissaladiere and peas with house made cheese. the pissaladiere had a nice crunchy exterior but was overwhelmingly one note with the salty toppings. lemon helped a little bit but wasn’t enough to save the dish. on the other hand, the house made cheese was disappointingly bland and came out 35 minutes after the pissaladiere which made for a rather odd service.\n\nthese two came out to $60…it seems folks come here for the “vibes” (it’s a beautiful if not cramped, space!) or the kid friendliness (probably half the tables had strollers lol). i regret not getting the mushroom toast over the pissaladiere, but unfortunately won’t be back for the opportunity."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNXRieDVBRRAB",
            "text": "Delightful dinner! Service was outstanding and extremely nice. Highlights were the chicory salad and pork ribs. Simply amazing!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOWF5VDJ3RRAB",
            "text": "partner and I often come for coffee/breakfast pastries. While the service is casual, it’s always very tasty.\n\nDinner is my personal 10/10. Literally never had a bad dish or bad service. I often eavesdrop on the tables next to us, and they will often get different recommendations/explanations/etc based on their individual needs/wants (table next to us got some A-1 advice on wine!). Again — service is 10/10. Perfection.\n\nFood has also never let us down. And we have eaten here many times AND are very picky/critical\n\nPlease eat here. Tip well. Enjoy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6aHFHVHd3RRAB",
            "text": "Newest neighborhood gem, steps from the Brooklyn Museum. Space is beautiful, clean, and calm – walk right past the pristine kitchen to the modern coffee & pastry counter. Menu includes breakfast sandwiches. Lots of seating, including an outdoor patio. Croissant is 10/10, pastries were excellent. Mocha was wonderful. Service is outstanding; kind & responsive. The entire experience was immaculate. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibjk3OG9RRRAB",
            "text": "Their signature egg sausage sandwich was great. Really nice space with an open kitchen in the front that you can see when you walk by. The sausage pattie was cooked perfectly and I like the black sesame on the potato roll. If you like spicy, then definitely ask for the harissa sauce.\n\nI didn’t have the greatest service on my first visit, this time. The counter person seemed annoyed that I switched from a pastry, which was pre-bagged that she pulled from behind the counter, to the sandwich. I then I probably waited 12-15mins for the sandwich. They seemed to be making a lot up front, which could have been a big order but still 15 minutes is a long time to wait for a breakfast sandwich that’s supposed to be a grab and go. Their coldbrew was tasty but the counter person was also snarky when asked if they had chai (and no they don’t)."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJckpqZUJnEAE",
            "text": "So delighted to have this gem close by. Though I loved Oxalis, I think Cafe Mado surpasses its predecessor by matching its mastery of flavor and technique and serving food in a much more casual environment all day long. Our dinner in early spring was exceptional. Each dish was bursting with flavor and textural complexity that I could not get enough of. I can't wait to return."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aU1pSm1BRRAB",
            "text": "Delicious meal. The \"Tony\" sandwich was fantastic. Also recommend the pissaladiere and the chanterelles. Highly recommend. Server was excellent too. I hear they have a nice back yard but it was raining so we will have to return when the weather is nice."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnXzgzSllREAE",
            "text": "Cafe Mado is the absolute BEST neighborhood cafe.  The food is fantastic, wine is refreshing and the service is unbeatable.  When I informed the staff that I was pregnant, they were incredibly thoughtful and mindful of the dishes being served.  During one visit after their big NYT review, they ran out of some of my favorite menu items - they felt so bad that they sent me home with bag of free croissants.\nMany of the small plate focused restaurants in prospect heights lack a point of view or any sort of cohesiveness, but the French focused food here blows me away every single time.\nI’ll probably spend the rest of the winter dreaming about summer lunches in their gorgeous backyard.\nTl;dr? Cafe Mado is a real neighborhood gem."
        }
    ],
    "reviews_count": 70
}