{
    "name": "Rancho Avocado",
    "place_id": "ChIJjySo4ydbwokRo4zBqFlNhEE",
    "grid": "BK9",
    "address": "1166 Nostrand Ave, Brooklyn, NY 11225, USA",
    "rating": 4.9,
    "user_ratings_total": 125,
    "phone_number": "(347) 632-2982",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neU5YSlpha0pmVGs1dmRXVmtkMkZKTm1aSGRXYxAB",
            "text": "really solid Mexican food and employees here are awesome. Really happy to have them in the area."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMVMwRkVOMnRDUVVOaFJVOXhUMlZOU1UxcFptYxAB",
            "text": "I’ve been living in the area for quite some time now and never gave an opportunity to this place and now Im glad I did it.\nI was attended and served by the owner of this family-run-owned place and it was very kind and nice to hear his story of how this place came to be.\nI had a steak burrito and it was delicious. It came with some special brown sauce and the combination was superb.\nYou can feel and taste of home cooking in this place.\nIf you are around the area or live near there and like to eat good quality food please go to this place and support your local businesses and specially when you see that is family owned-run, they literally cook your food.\n100% recommended."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSelYwOVJNRTl1T1Vkc1ltNXJNa0pZUWxBM2IzYxAB",
            "text": "This restaurants food is amazing. The tortas are the best I've had in NY."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcGIzZWtRRRAB",
            "text": "If you’re looking for the best Mexican food in the area, look no further. The burritos are huge, packed with delicious ingredients and the al pastor is so tasty. On top of the delicious food, the owners are so sweet"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNlNYSmhjbk5rZVVWb2EzTlljbFZhTUV0VVptYxAB",
            "text": "I love Mexican food! Most mexican food I have had in the city is good but not the same. But the tacos here are so flavorful! Just like what I had in Mexico! Fresh and properly spiced."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeU1sOWFOV3A1WmpWUWMwaGtVMWRhVUZkcWRYYxAB",
            "text": "This food is so yummy, and the women working there were so nice, making all the food just the two of them! Tostones are the bomb, dipping sauce sooo good!! Everything we tried from the chicken quesadilla, to fish tacos was great. We ordered two nights in a row!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNVJVZHRUblZxYUhSU1REZEdSRGh2VEdsYU1IYxAB",
            "text": "Food and atmosphere was great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRWRqVnNTV295TnpaQ1QybElTWEpJT1RCVFoyYxAB",
            "text": "Great place all the way around food people everything"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubGJUbTVnRRAB",
            "text": "I'll be honest and write a serious review for once here-- the people who run this place are nice and that's why this spot has such a high rating so far, but the food here is just not fresh... Went here near closing time, and I saw the cook microwaving the food I ordered in a plastic cup :/\n\nHopefully the plastic was microwave safe or eating here is also a health risk. Cannot recommend. There is not very good Mexican food in this neighborhood so just stick with other kinds of food tbh.\n\nEdit: So the reataurant has responded to my comment with what I can only describe as a bald-faced lie. I am well aware that I saw my refrigerated birria being heated in the microwave in a plastic tupperware. There is no doubt about this, and failing to take accountability only solidifies that this reataurant CANNOT be trusted. There are many good mexican spots in NYC, and unfortunately Rancho Avocado does not qualify."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcVVqQk9ORmw2T1dkbWRuQjNOa0pIUW0xaFdVRRAB",
            "text": "Very Nice! Great fresh Food and super friendly people."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tac1VWODNNMHR2YTA5bGRrRjVkV1JqWWpKNFZXYxAB",
            "text": "Been coming here for a while now and the Al pastor tacos hit every time! The workers are always friendly, grateful that they’re in this neighborhood :)"
        },
        {
            "date": "4달 전",
            "language": "la",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRFp6bGhRV0YyVkVoSmVWbHZRVzV2YmxaUU5tYxAB",
            "text": "Best carnita tacos"
        },
        {
            "date": "4달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPS2d1ZVhiOXBMcUx3EAE",
            "text": "Très bons tacos ! Accueil très chaleureux"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMR00yb0czaW9PVlRREAE",
            "text": "This place rules. Favorite burrito in BK. It's a utility burrito, sturdy - you can eat it with your hands no foil and its heavy you're going to be catatonic after eating it. Quesadilla are also heavy heavy, they do not skimp on the meats, veggies, mushrooms, what have you. Favors are great, salsas are poppin, vibes are welcoming. Thank you Rancho, te amo."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMnJmNTBBRRAB",
            "text": "Great food. Steak torta is one of my favorite neighborhood meals. People are really nice too. Love to see them."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd3BxWmRREAE",
            "text": "Fresh ingredients, great service, and amazing consistent flavors! I have been coming here for just over 2 years now and have tried the burrito bowls, burritos, salads, and tres leches cake…everything is always fresh, made to order and super flavorful. I would highly recommend for takeout or a quick solo lunch"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcnEzUkZnEAE",
            "text": "love it 😍 i hope you add corn salsa to your menu as a topping option one day"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ajVxaFlREAE",
            "text": "One of the best burritos I’ve ever eaten (chicken tinga, and I lived in New Mexico for years lol).  The chips and guac are made fresh and both were incredible.  I’m genuinely upset that I found this place.  I’m about to gain fifty pounds."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcWQ2QTl3RRAB",
            "text": "Food is absolutely delicious!!! The steak tacos are so amazing 😍😍😍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcElEc1V3EAE",
            "text": "Service and food was AMAZING. they are so kind. I definitely recommend coming here. The food was great! Big portions and really yummy food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndVltbnpnRRAB",
            "text": "Solid food! I enjoy it and it’s good quality ingredients, however, I really wish they made their own fresh tortillas. They make such a difference with tacos."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdDZ2eVJnEAE",
            "text": "La comida muy buena burrito bowl muy rrrricos"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeE5QWVpREAE",
            "text": "Awesome chef! The food is simply delicious!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbGRDdmhRRRAB",
            "text": "Incredible service, delicious food, the best spot to get a burrito bowl."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcm92MS1BRRAB",
            "text": "Burrito bowl with the tinga chicken was excellent every time I ordered from this place. Can't recommend them enough"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeE42dW1RRRAB",
            "text": "It has great tacos the sauce that comes with it is awesome you should try you will fall in love with it👌"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aHJmajZBRRAB",
            "text": "Really tasty grilled chicken dinner!! Fabulous food and amazing price. Sweet people too."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LTZTSHlnRRAB",
            "text": "Have loved this place and it’s been a staple for me to get the pastor bowl once a week. But they recently changed the al pastor from marinated cuts of pork to ground pork. Which tastes way cheaper and just has a really bad texture in a…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubjdQOU5BEAE",
            "text": "Incredibly nice workers, great food, good vibes, come have a nice meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNWRIN19nRRAB",
            "text": "Great Spot ..great food\n.great staff ...Been there 2x and can't wait to go back ..Shrimp Taco is my Favorite"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNud1lLS05nEAE",
            "text": "The food is 10/10 the service is 10/10 the restaurant it self is small but they provide great service and great food ! Their tres leches cake is to die for !!! My co workers and i eat here for lunch all the time . Only thing i do not like is that they charged for cheese, sour cream , lettuce to go on your tacos. The tacos normally come with cilantro and onions only. Guacamole is extra but that’s expected."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuN0plakV3EAE",
            "text": "Always the best!!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuc01qRGdBRRAB",
            "text": "Me encantan las tortas de bistec son mis favoritas , la comida esta muy deliciosa , pollo  asado con arroz y frijoles 😋muy amables las personas que trabajan muy recomendado el lugar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINmRYdV9RRRAB",
            "text": "Always can appreciate some delicious food that’s freshly made"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIZ3VXaWNREAE",
            "text": "Excelente experiencia la comida deliciosa y buen servicio muy recomendado"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ajd5X05nEAE",
            "text": "Top Quality"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3b1ptanVnRRAB",
            "text": "The chef was so welcoming as soon as I walked in and created light conversation before he made the food (they cook/grill your meat in the spot so the food is fresh). I got a steak burrito bowl with some cream-filled churros; 10/10 will definitely come again!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NXJ5NE5REAE",
            "text": "Amazing food and great customer service, especially the Birria Taco 🌮."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NmJLV09BEAE",
            "text": "Walking by around dinner time, the A grade caught my attention so I decided to try it. Delicious steak burrito, and sweet plantains! Generous portions. Good pricing; about what I was expecting. Staff were friendly and professional. Reasonable wait time, ~20 mins, for a great meal cooked to order. I will try their fresh juice next time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bnJfbnFBRRAB",
            "text": "I trust the chef with my life!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaDQ3cVNnEAE",
            "text": "The food is amazing. I’m pretty sure that everything is made in-house, including their tortilla chips. Their burritos are also the best around, the chicken and shrimp are my favorite. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicS1TaHZ3RRAB",
            "text": "The food was good. My family and I enjoyed it. The place is small and pricey. But it is worth it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicVBmM0x3EAE",
            "text": "I don’t typically write reviews, but this is simply the best Mexican food I’ve had since moving to NYC.  Possibly ever.  I highly recommend the birria burrito (or birria anything). The owners are also incredibly kind."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicUx5ZHJBRRAB",
            "text": "Amazing food with amazing people!! Great customer service and the food is always soo good!! 10/10 always. I always get either the Steak burrito or the Steak quesadilla, now I am becoming obsessed with their barria tacos which is what I got recently in the picture!! So flavorful and great cs! Keep it up :D"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNWVEOXpnRRAB",
            "text": "Love love love this place! Fresh, tasty food + nicest owner! Just the neighborhood, authentic, small business I love supporting. Come try their burrito bowel with pernil or al pastor - to die for and for such good value!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcWVmU2dnRRAB",
            "text": "The food here is mouth watering. Their cream churro’s are to die for and the cooks aren’t stingy with the amount of meat they pack into their delicious tacos. If you haven’t already made a trip to Rancho Avocado, stop by today!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMd2VLaWd3RRAB",
            "text": "It appears Middle Eastern or Indian open a Mexican restaurant and that’s OK but you have to know how to sell another nationalities cuisine if that’s what you wanna do. The person that was serving me did not know what a Tres Leche was yet it’s on their menu and the food just didn’t feel totally authentic Mexican. If I’m ordering a nacho and your main menu already indicate what’s in it why are you asking me? What do I want on it like as if we’re at chipotle."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLXRlQlRnEAE",
            "text": "Hoy tuve el placer de comer dos tipos de comida de rancho avocado y la realidad es que su comida está cada día mucho mejor me alegro mucho por el avance y gracias por la comida la recomiendo 100%"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqc2RMY0RREAE",
            "text": "Food is incredible"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqZ2ViT2ZnEAE",
            "text": "- good tres leches\n- loved the birria\n- loved the chicken tinga\n- loved the shrimp\n- i did not like grilled chicken\n- decent pastor\n- fast turnover\n- delicious churros\nyou get a lot for $5"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NWYyWTBBRRAB",
            "text": "This is it. This is the place you've been trying to eat at but didn't know!\nThe place smells incredible. The food is beyond fresh and the people working here are the sweetest kindest and most incredible team.\nI didn't know what to order and I didn't have glasses on so I couldn't quite make out the menu.\nNo problem! I just said what I kind of wanted and BOOM they made magic for my mouth.\n\nI wish I could give it 6 stars. I'm beyond impressed."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaeHFYYUtnEAE",
            "text": "Original rating: 3.5\nNew rating based on owner’s response: 3\n\nI found this place because it had a full 5-star rating. I went on a Tuesday around 1pm. I’m not sure what I was expecting. But I definitely was expecting affordable. Tacos at $4.5-$5?! These tacos are the exact same price as manhattan. I am in PLG for a reason.\n\nCompetitive prices, fine. Although I strongly disagree. There was one couple in front of me & I had to wait at least 15-20 minutes. I feel like that would have been justified if I saw a lot of online delivery people pick up theirs before mine. But I didn’t. The waiting time for tacos is just way too long for me (+ for $5 tacos).\n\nConsider adding music to feel a bit more homey and lessen the idea of waiting. Or say the waiting time before I order. It is a new spot so I’m not giving a 1-star. There are clearly areas of improvement.\n\nBut, an oily taco for $4.5 with only meat, some onions and cilantro. That’s odd. Your competitors that are charging the same price have different toppings and are cleaner tacos. Consider at least adding pineapples to your short rib. I thought there would be at least avocado in it based on the restaurant name.\n\nI’m not sure if I recommend. But I recommend giving it a try in a few months.\n\nUPDATED: 9/14 based on owners comments\n- I've updated all mention of brisket to short rib. Clearly it was memorable that I already forgot what I ordered the next day.\n- Please note I added hot sauce, myself, not mustard to add flavor\n- I've removed this line \"the owner seems nice based on the other reviews.\" based on owner's response \"with so many places you have been should be ashame of yourself\"\n- Replying to this specific comment \"you took advantage of one of my chef that was burnt cooking your food and yet you took a picture of them while in pain how can you do that? just having  funn  by looking the other in pain  waooo!\"\n>> I took a video of my experience & waiting for 20+ minutes for 2 tacos that just had meat on them, two hours after it opened. As I previously mentioned as a new restaurant, I planned on visiting again in a few months. But that's no longer the case."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOaS1UeTJRRRAB",
            "text": "Tried their shrimp burrito bowl and churros. Loved the churros. Very fresh and crunchy. Perfect balance of flavors. The burrito bowl was loaded with rice, salad, black beans and a few shrimp. Loved the unique seasoning of shrimp. The taste was good but there was too much rice. Would have loved sour cream and salsa picante on top as it was too dry."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aTRUc2ZBEAE",
            "text": "Amazing food here ..I had an extensive conversation with chef Kwin about his hopes with his restaurant and he is taking it day by day …all ingredients that goes through door is well taken care of ….he also an experienced sou chef that had work amongst Anthony Bourdain and in Salena a Michelin star chef… Though new to the neighborhood he brings he’s experience and talents right to my back door."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eXYyaHF3RRAB",
            "text": "Jumbo, super tasty burritos packed with lots of protein and not just rice and beans (but the rice and beans are good too!) Quick service, friendly owner, and spicy salsa. 10/10 would burrito again.\n\nEdit: 10/10, did burrito again. Except this time tacos for Tuesday. Carnitas that was juicy and crispy and al pastor that was sweet and tangy, and both were absolutely packed with the protein. These are amazing tacos from an amazing place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M3NPcFhREAE",
            "text": "Delicious tacos and burritos! We tried the birria, carnitas, and tinga. The guacamole was the BEST guac I’ve had in a long time!! Some places skimp on certain guac ingredients, but this guacamole was flavorful and filled with lots of fresh ingredients! We scarfed down the food before we could get any more photos but we will be back! Overall would definitely recommend and enjoyed meeting the kind and enthusiastic owners who know how to throw down in the kitchen. :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdXJMaGdBRRAB",
            "text": "The food was off the hook. This is my second time ordering from them and I will be returning. The food is fresh and high quality and the service was amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaEtuRlJREAE",
            "text": "Really nice folks and good portion! Shrimp was very juicy and all the veggies were very fresh."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaGNxVmp3RRAB",
            "text": "The food was really good, affordable and the custome service was impeccable. Would definitely recommend. They don't have indoor dining but they have outdoor dining."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdHN2R0FnEAE",
            "text": "Awesome new addition to the neighborhood. Super friendly staff and the food was excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaE1XdmtBRRAB",
            "text": "This place just opened and I was very impressed. Their staff was very warm and attentive and they are clearly very gifted chefs. The food was very fresh and very well made. The ingredients were high quality. The only cons were they were a bit pricey and the location doesn't accommodate those who want to eat in comfortably.  It's a great takeout spot with high quality, flavorful food and a really good staff. I'm glad they opened and I will certainly be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd2JpZEZREAE",
            "text": "Unbelievably delicious food. Reminded me of the places I’ve eaten visiting my grandparents in Mexico. Flavor is fantastic, the two women working there were so lovely and friendly, our meal was filling and wonderful. Our new favorite spot in the neighborhood!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKX3RxVkRnEAE",
            "text": "Rancho Avocado is one of my favorite food spots in PLG. I’ve been there enough times that the owner recognized me today. You can tell that he and his staff care about treating their customers with kindness and also giving them their money’s worth in terms of quality of the food. Tonight I got tacos, and I swear I could taste the love. You could see the extra effort, even though I was the last order of the night (and I’m sure they were tired from a long day). Side note: they’re one of the few quick dinner spots open on the later side for which I’m grateful cause there isn’t much else at 8 or 9pm on a Monday. The burrito bowl is also bomb. They use good ingredients and don’t skimp on how much they give you. I’m sure I’ll eat through the whole menu in time. You should too. 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsc2ZtWUF3EAE",
            "text": "The food I’ve ordered has been delicious. I’ve been here several times as well and the owner was always very friendly and welcoming.\n\nI’ve ordered the burritos and tacos.\n\nBirria was good\nChorizo is good\nAl pastor was good\n\nDidn’t try any of the other meats."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OUt6dS1RRRAB",
            "text": "Listen up, everybody wants that “mom and pop taco shop right around the corner from their house“… this is that spot. Everything is handmade everything feels home-cooked and everything tastes Delicious! The owners are incredible people and the neighborhood is lucky to have them"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbHBpNGRBEAE",
            "text": "I had the grilled chicken burrito and my girlfriend had the veggie burrito - both made with fresh-tasting ingredients with a satisfying balance of flavors. Friendly service which, as someone who works in customer service, is just as important to me as the food. I highly recommend trying this welcome addition to PLG."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcE9MVmpBRRAB",
            "text": "Stellar food, the birria tacos with consume are amazing. We also never skip the guac or al pastor tacos. They are so friendly and kind to our toddler too. She loves coming here for her guacamole fix."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNEpYdk1nEAE",
            "text": "I’ve come here nearly once a week since it’s opened. Easily the best Mexican food I’ve had in Brooklyn. The owner is a great guy and  really cares about the quality of his food and his customers’ experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKN2JqRklREAE",
            "text": "the owner is very pleasant and their food is even better! had their burritos and burrito bowls a couple of times already, looking forward to more meals here :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdHQ3R1h3EAE",
            "text": "This place is amazing!! I’ve tried a few of the items and they never disappoint. Super polite people also. They always cook the pork juuuust right and have a cute outdoor area"
        }
    ],
    "reviews_count": 70
}