{
    "name": "Kulushkat",
    "place_id": "ChIJtUFC2xJbwokRLmKg_Ztjjm8",
    "grid": "BK9",
    "address": "1137 Washington Ave, Brooklyn, NY 11225, USA",
    "rating": 4.1,
    "user_ratings_total": 496,
    "phone_number": "(347) 378-2514",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNVgxZE5PVGszZDJOTlVreFplVkpCVTBFM1VtYxAB",
            "text": "Everything I've ever tried is great but the falafel sandwich + fries is unbelievable! Possibly the best falafel, ever. Also, definitely get the skhug sauce on the side. It's v hot and v tasty."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONU5XVnpVRk54V21NM1QyeG1lVFIyTWtOcVUwRRAB",
            "text": "Bangin’ pita bread and best tahini sauce that goes on everything. If you’re a meat eater the mixed grill is flavorful or vegetarian curious, try the eggplant wrap… ah-mazing!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzdFMwNXBVMVJhTldWWFdYbDFZbmxWWkdSNlltYxAB",
            "text": "The restaurant sets high standards. The food quality and service level were outstanding. Kulushkat keeps me coming through their doors. Their kitchen maintains consistency. The cooking showed skill and staff showed care."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaR1puRnVabVJFTXpKUlJtUmhRbmxEU3pkWGExRRAB",
            "text": "one of the most delicious restaurants on this planet"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWFFVUnRWRnBSVURSTWRXbEJUM0Z6UTFoeFlWRRAB",
            "text": "Their hummus will elevate your idea of hummus and ruin grocery store brands forever because it is sooo good! Beyond hummus their grilled meats are so flavorful and one of my faves is the eggplant pita. You can’t beat the fresh bread, we always order extra. The food travels well, unlike French fries, so delivery is great. The staff is always kind. This is Moroccan Food, for the people geographically challenged, Morocco lies on the Mediterranean. I digress.\n\nSo, I even catered my holiday party with them last year with people raving that I need to have it again this year."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGclpWUktTVzVxTXpkdWFUbE9hVTltUjJnd1oxRRAB",
            "text": "Remarkably tasty. Cheerful mood throughout. I never get tired of this place. Their service approach was superior. This spot handles every detail well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKblExOXRPRWRqWW1wTGNXSkVjVVJwWm1Zd2VFRRAB",
            "text": "The food sucks in execution AND it’s cultural appropriation.  This is Palestinian and Arabic food.  Not Israeli."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaFdWQlZRemhNUlRGWlJIRmZXbkZKYVhOTGRGRRAB",
            "text": "We were there on a Wednesday night and we're the only ones dining in (though there were plenty of delivery pickups). Service was excellent and attentive. The vibes were impeccable.\n\nThe hummus was silky smooth and rich with tahini and the pita was thick, fluffy and warm.\n\nMy friend ordered the beef & lamb kebab, and it was stunning. It's a mix of minced breast with spices, but the Moroccan roots are strong. The texture and flavor reminded me very much of kebabs I had in Fes.\n\nI ordered the salad sampler. The red cabbage salad was very well dressed and yummy. The Eggplant a la Yufa was every but as good as I had hoped - it managed to be lightly charred and soft whole also sliced thin and attractively presented. The chopped salad was simple buy very fresh. And then the pickles were just sliced arabic pickles, and they ended up actually complementing my friend's kebabs particularly well.\n\nWe both cleared our plates and had a wonderful time in process."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNVVrSmZkeTAwTlhOUFVFVjVNRzF3TnpJMVVGRRAB",
            "text": "I hate when a restaurants review have nothing to do with the food or service!! Most of the 1 star reviews for this place are courrier related. My food arrived promptly and is delicious!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRU1uTlBRMnRTUWpZMlYxTkhjVXhFVkVsblUxRRAB",
            "text": "Badly behavior"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUlMyaEVTalJTTmtWYVQzRnFXRjlMZVVneVozYxAB",
            "text": "mannerless😡😡😡…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSWNHeHljbWxVTTBFeUxWVlRSQzFuTm1kak1GRRAB",
            "text": "Disrespectful"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NU4xOVlabk14ZGtWV09XTTFXRE5PTkU1eFlWRRAB",
            "text": "Service no good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRFVWbGpWazlQYkdWalZHbHVNMGN3UjFoV2NsRRAB",
            "text": "If you live in this neighborhood I don't need to tell you... a Hidden Gem with spectacular food! Stellar service, so friendly! Top 5 of my best falafel in the WORLD! Must eat!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMlEyMU1iV0p4YWxCRGNGTnZOakpKYmxScWRFRRAB",
            "text": "Mal comportamiento"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTGRtRTVWWEZUUW1saVpXWm1aRFJmZGtoSVJGRRAB",
            "text": "Lento para hacer cualquier orden"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVk9VNURka1Z5Y1Zwc1lUSkZjQzFNWVdsVmRFRRAB",
            "text": "behabiar is not good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR1pWSlJjemhRUzBORGVuTmpUVVZWUTJwdFoyYxAB",
            "text": "Walked in and thought we were at the wrong place.\n\nIt’s a super small shop with an open kitchen.\n\nFood was excellent, everything tasted incredibly fresh and you could tell it was being made right then and there from the salads to the meat.\n\nMon-Thur they also had a 20% off for dine in.\n\n10/10 would go back for meat platter and salad"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdVdISk5TRU41VlVoRVRWTnNWekEyV0VwWWVYYxAB",
            "text": "Excellent"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMVYyRkROMVZIVW5sbmVFSlRSV2N5U25KM01sRRAB",
            "text": "Bad behaviour"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRlpWcFpPVmR2YzBGRlYySldTblF5Ylhkd2VWRRAB",
            "text": "Kulushkat 1137 Washington Ave, Brooklyn, NY 11225 The people at this store are not nice. uber GRUBHUB Dasher delivery rider Not behaving well, asking to wait outside Delivery service not good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOeW95NUR1MTRQeDJnRRAB",
            "text": "I order takeout often. The food is always great. I’ve never eaten in the restaurant. It’s a small cozy space, looks fine and they’re always playing good music, I just prefer takeout since I’m around the corner and usually solo. I do think they get tons of delivery orders and wait times tend to be a bit long but I just factor that in when I order. I think if you’re eating in they probably would prioritize your order but don’t really know."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcnB4cGFRME9iODZ3RRAB",
            "text": "Incredible neighborhood spot- such nourishing, delicious food in a low key setting. We love being regulars dining in and for takeout. Thank you ♡"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKalRpNUQzNExYTEhBEAE",
            "text": "The food here is SO amazing!! Highly recommend the falafel plate or the eggplant sandwich. Everyone who works here is super kind as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYWt4dHZmdjhTV2NnEAE",
            "text": "Delicious, affordable and nice atmosphere"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMX1dwZVdROXFXOUdBEAE",
            "text": "Rude employee"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLNzRqT1BNdTlhUEhREAE",
            "text": "Don’t go there very rude employee"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd0thSnhBRRAB",
            "text": "This restaurant staff behaviour so rude, they use bad word with online delivery man. They are taken too much time for every online delivery. They make discrimination with online delivery man and general people. That felling was so disgusted."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd002MWx3RRAB",
            "text": "Staff behavior so rude with every online delivery. They are taking too long time for online delivery. They make different level with online delivery man and general people. That behavior is so disgusting."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3djdxX2lBRRAB",
            "text": "This is a great spot in PLG for Mediterranean food. I have used their catering services and everyone loved their food and options."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3LWNmZlhREAE",
            "text": "Do not order from here unless you want to wait for over 2 hours and receive cold food.\nFood never delivered on time. Not once. It gets to the point where the time just keeps increasing. Calling the restaurant for an ETA just gives you false hope and makes you wait over an additional hour.\nBy the time the food arrives it’s cold soggy and inedible. The delivery is less than 1 mile away and still takes hours. Never again."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc2VHdzhnRRAB",
            "text": "I was cold and  hungry and saw a sign over the door that said \"FALAFEL.\" I went inside and they were bumping some serious grooves. The falafel was very well seasoned and had marinated eggplant which deepened the mix w a rich umami. Their spiced french fries had a punchy kick. The grooves never stopped. Everyone was in a good mood. Wait time could be better."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRai1LdUFREAE",
            "text": "Everything is bad, people are bad."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXNpbEVBEAE",
            "text": "Great food and very cozy. Get multiple sides of the pickles!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdjhQX29RRRAB",
            "text": "This place is a gem in the neighborhood!\nWe’ve been ordering from them for years and going there occasionally and truly, from the food to the service it’s always been consistently great.\nDon’t believe the bad reviews… I believe they have ulterior motives…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NE8tWGJ3EAE",
            "text": "Food was not good. Hummus did not taste right. The rice was a light vs a darker yellow like usual and there was no salt on the chicken. Just a very unflavorful dish for the expensive price."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LUl5eVV3EAE",
            "text": "Wow the food was amazing!!!!!!!!\nLove it highly recommend"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbVpQR0V3EAE",
            "text": "Falafel pita is great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcklUT0tnEAE",
            "text": "There was hair in the food. I think the person at the front counter also does some of the cooking but doesn’t wear a proper hair net."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuc2FUUWJBEAE",
            "text": "By far one of the best chicken Shawarma in the city. Great food and friendly staff. Any time we have some visit from outside of the city this is one of the first places we take them"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN3VDSGl3RRAB",
            "text": "That’s maybe the best falafel I’ve had in the city"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcV82S3B3RRAB",
            "text": "Good food good vibes. Not sure why this place isn't 4.5+ stars"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbHF5bV9RRRAB",
            "text": "This is hands down my favorite Mediterranean restaurant in Brooklyn. The service is impeccable and the food is Always delicious.  It's a small  neighborhood restaurant and the owner is there everyday working just as hard as his employees."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbW9YZ0NnEAE",
            "text": "Service is very bad"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMXBLV3VRRRAB",
            "text": "Not very Mediterranean, shawarma was unrecognizable, more like a roti"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIX0s2RTVnRRAB",
            "text": "Great falafel and super helpful staff!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NzdtSnl3RRAB",
            "text": "Best falafel I’ve had in a long time. Ordered the pita and appreciated how evenly distributed it was between falafel and cabbage. Hot sauce is 🔥. Can’t wait to try out the other items."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cWRiQmR3EAE",
            "text": "Staying an away from this place. The food is nasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3N3FuV1d3EAE",
            "text": "Been here several times and each time it's unbelievably slow. Food is good but the wait is unbearable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieDU2SUNnEAE",
            "text": "My daughter recently moved into the neighborhood and had ordered food from Kulushkat several nights ago. She enjoyed it so much that she suggested my husband and I join her to go there together. We were very pleased. The food was delicious! We had the hummus and lebneh to start. My daughter and I ordered the chicken shawarma, which was delicious. It was served on top of flavorful rice, a salad with a zesty lemon dressing and a side of red cabbage which rounded the dish off nicely, My husband ordered the falafel pita sandwich. He loved it. Besides the food being so delicious, everyone at the restaurant was super-friendly and attentive. We feel so lucky that we found this gem and will be visiting Kulushkat often!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabTdpTjFnRRAB",
            "text": "I wanted to try something different from what I usually order out for delivery. This hit the spot. Stuffed grape leaves were nice and fresh. The beet salad was also fresh and tasted good as well. Loved the humus and tahini sauce, which added a nice flavor to the chicken swarma plate. Only criticism is there wasn't enough rice. However, food is very tasty, and I would reorder these food items again."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbllHTVpnEAE",
            "text": "The best falafel I've eaten in this neighborhood. They no longer have indoor seating, so it's kinda awful to dine outside while it's so cold out. I'd recommend ordering ahead or get a take out. Service is relatively slow since they always seem to have orders coming in."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhcVBtcUxREAE",
            "text": "Ordered some chicken skewers for pickup and the food was fantastic. I can't remember the last time I had such big white meat skewers that weren't dry. I love how it was flavorful but not too salty. You definitely get a lot of food. The cucumber salad was on the salty side. Looked like there was several tables in a cute outdoor space on the street as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeG83akd3EAE",
            "text": "The most wonderful experience today. I showed  up with my hungry visiting family and although they were still 30 min from opening, the owner and chef did his best to get us set up outside in the lovely outdoor area as soon as possible.\n\nThe friendly chef/owner personally took our orders and was so helpful in helping every person get what they wanted. Everything we ordered was spectacular, and very generous portions too. We got the chicken shawarma platter, 2 sabikh/borekka orders, a falafel pita, shakshuka with merguez and a side of cheese borekas. All were amazing and I would easily order any of them again, and the various members of the group who are pickier were also happy, a miracle.\n\nI eat a lot of Mediterranean food so was expecting something more standard, but the chef did some fun spins on the traditional and really excelled. Flavors and quality all exceeded expectations, and in a pleasant atmosphere with the best service. I don't live nearby, but definitely plan on making a special trip to come back.\n\nThank you once again for being so helpful and accommodating and for making such wonderful food!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6dHMtWUxnEAE",
            "text": "Chicken skewers were excellent. Falafel was as good as it gets. All of the dips are 10/10 and their pitas are top shelf as well. Great hidden spot in the neighborhood."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDcnZhLVZnEAE",
            "text": "We ordered lunch for pickup yesterday and it was super delicious, presented beautifully and the portions were quite generous. The falafel and the hummus were superb, as well as the fries. I found the baklava to be too buttery, though.\nHighly recommended!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXMU5MbnFBRRAB",
            "text": "Beyond thankful this place it right around the corner! You can order anything of there menu! It’s all delicious! They have a family style option. I HIGHLY recommend ordering it the first time you go, so you can try a little bit of everything."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvcjdIZVFnEAE",
            "text": "I had a great experience here on a nice Sunday afternoon post-run. Wait staff was really helpful with menu suggestions and further detailing any items on the menu we wanted further clarification on.\nI got the chicken shwarma + falafel combination in a whole wheat pita. It was perfect balance of crunch from the vegetables and falafel, tender, soft bites of chicken shwarma and braised onions, and creaminess from the sauce. I would definitely come back again for a post-workout meal because it is so close to Prospect Park and provides the right nutrients I need after an intense run."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNThDb2VnEAE",
            "text": "The food here is delicious. We had a lentil soup and falafel pitta bread, and while we were waiting for it to arrive they brought over a little plate of pitta chips and a dip (for free). The waitress was super friendly and the decor is lovely."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSb1kzUUdBEAE",
            "text": "A whole red snapper is more than enough to share between two, and it's delicious, and there are many options for flavors, and I very much want to go back already even though it's only been a day"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjMmVIVWJnEAE",
            "text": "Petit Mediterranean kind of kosher restaurant. The food was delicious, service on good. Not a 100% Mediterranean i.e no seafood including no octopus...whats on the menu is very good food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldjhLT1pnEAE",
            "text": "If you want high blood pressure go here the food was extremely salty I MEAN EXTREMELY SALTY. I could hardly finish it the only good thing was the hummus & peta, I will not be wasting money here again!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5M3BYcVBnEAE",
            "text": "My first time ordering at Kulushkat,\nI ordered Eggplant pita and burrekas,The food was so good!  Delivery came very fast!…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZbm9lTkd3EAE",
            "text": "I’m obsessed! Such fresh, delicious food. The falafel is my favorite - love the addition of eggplant to the toppings. Incredibly friendly service. Online ordering is a breeze. Delivery is prompt."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrbUtMQjBBRRAB",
            "text": "Hummus is to die for! So creamy and flavorful! Highly recommend. Eggplant is also very flavorful served cold."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJZ0tqb1dREAE",
            "text": "Cannot say enough about this place. Tasty and inexpensive, it was a treat to find and a place I could visit daily. Their bread is scrumptious and hummus on point! Friendly staff eager to help."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibU1pUFRREAE",
            "text": "Food is decent with generous portions, service is nice. And it’s always busy.\nUnfortunately when trying the place yesterday for the first time we found a long black hair in one of the hummus/sauce take out bowls :(\n\nI really wanted to like the place - it’s a few blocks from my house and I know these things can happen - but I’m too grossed out by that experience to return."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdnZtWkNnEAE",
            "text": "Had eggplant a la yafa and a falafel. The eggplant is a new favorite dish and the falafel was made perfectly (crisp exterior, soft fluffy interior). Server was very warm and helpful. Prices were very fair for what I got. Will go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSaDlLR1BBEAE",
            "text": "I can't say much about the atmosphere since I've never been in person but I've ordered delivery from here more than 5 times and it's always really fresh and tastes amazing. Definitely a go to for gyro/pita sandwiches. The desserts and drinks are also great!\n\nAs for delivery, everything has always arrived still warm and within whatever time frame they estimate me."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDMllhbXd3RRAB",
            "text": "I love this place.  The food is always fresh and the service is always great. The Eggplant sandwich is probably my favorite sandwich in all of NYC.  Maybe ever.  It's so good.  I keep wanting to order the falafel which is also very good, I…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROdWNEUlp3EAE",
            "text": "This food was excellent! There was a mix up with my delivery and the restaurant called to explain everything and ended up issuing my food for free. They were very kind and courteous. I look forward to ordering from here again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJa3FLNkpREAE",
            "text": "This place was amazing. Small place, but very cozy.\n\nChicken Shwarma Pita was legit! Good price too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsdl9xZjZnRRAB",
            "text": "Excellent food and great customer service. Fresh ingredients and with nice flavor. My only complaint is that they are now only open at 4 PM and not earlier, so can't grab food there for lunch (I work at a medical center nearby). Please please open for lunch also !"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwN3ViYVlBEAE",
            "text": "Very good fresh middle eastern Mediterranean food. Reasonable priced"
        }
    ],
    "reviews_count": 74
}