{
    "name": "Pasa Pasa juice bar and food",
    "place_id": "ChIJZyR2_oRbwokRvVlSyP2KpRk",
    "grid": "BK9",
    "address": "404 Rogers Ave, Brooklyn, NY 11225, USA",
    "rating": 4.9,
    "user_ratings_total": 138,
    "phone_number": "(917) 697-6948",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKME5FZG1PVWxJWTFkS1ZrWnZTM3BCYTJkcU1rRRAB",
            "text": "I had an incredible experience at Pasta Pasa! The juice bar and grill offer such a delightful combination of fresh, flavorful juices and delicious grilled dishes. The atmosphere is welcoming, and the food is always top-notch. There’s a women named Shelly, who truly made my visit special. She was incredibly attentive, warm, and genuinely caring about her customers. It’s rare to find such excellent service, and she made the whole experience memorable. I highly recommend Pasta Pasa and will definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSGFGWTRiWGRQUVZkSlJuZGlWeTFoVHpKdU5sRRAB",
            "text": "You don’t want to miss this place!\n\nI’m visiting Brooklyn and stopped by here simply looking for a smoothie. I did have a wonderful smoothie (Peanut Punch) and also decided to try the vegan burger. Best I ever had, so flavorful! I decided to take a salmon bowl to go…because take all my money, please.\nBut that’s not all! We met the lovely Jamaican couple/owners, and they were just delightful. Especially Shelly who clearly makes everything from the heart and exudes pure joy.\nI’ll come back every time I’m in the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Zd1VUSlNaRm95U1VWTFUyOVhaa3hpVVdabk1IYxAB",
            "text": "Best smoothie I’ve ever had 🙌…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORVkySmlaVzFCWWpGV2JIZEZkazF3YTFWV2JsRRAB",
            "text": "Tropical w the ginger. Tooo good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaVVuaDFRbTFoVEZFd2F6bG1WMmxzVm5CNGNXYxAB",
            "text": "Not only is the Acia Bowl good the customer service is excellent!!! Felt at home. Thanks again and will be coming back!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsZmJEQjVhVWRGZW5GbFlVZHNVMFpmWVd4UmFYYxAB",
            "text": "Pasa Pasa Juice Bar & Grill is a true gem in the community! ✨ It’s refreshing to see a woman-owned, Black-owned business serving authentic, natural juices and quality grilled food that’s made with care and love. Every juice is fresh, rich in flavor, and you can tell the ingredients are real and wholesome, no shortcuts here.\n\nI’ve seen some unfair negative reviews that have nothing to do with the food, service, or atmosphere. It’s disappointing that people choose to tear down instead of lift up, especially when it comes to hardworking Black-owned businesses. Age has nothing to do with passion or quality, and the owner’s dedication to excellence is clear in every glass of juice and every plate served.\n\nIf you want natural juices that are both delicious and good for your body, along with food that’s seasoned to perfection, Pasa Pasa Juice Bar & Grill is the place to go. Shelly is creating something special, and the community should be proud to support her. 💛\n\nHighly recommend, you won’t regret stopping by!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wd01sSllaek5IYmxvMk9GUnRWbVo1VkRGUU1IYxAB",
            "text": "Perfect local spot to get delicious fresh food and juices! So friendly, so clean and I'm still dreaming about my salmon coco bread sandwich and fried plantains! The watermelon juice was so refreshing and the spinach patty so well-seaaoned. Thank you Mark and Shelly! Run - don't walk - to get yours! Great space to dine-in (although I had to head out) -with communal games too!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNlJXeHdRek5MVFRGdGVYSm9VbVJvUzJacVVIYxAB",
            "text": "Warm wholesome smoothies food and vibes"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSFgyZFphVEJsY0ZkWk9WaEhaRkE0WXprdFQyYxAB",
            "text": "Best patties, best smoothies, best salmon, kindest neighbors. Love this place and recommend it to everyone."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FelJYQm5OVVV3WHpKbFgwcHVRbDlqVUZwMlUwRRAB",
            "text": "Absolutely delicious salmon bowl as well as smoothies. This place is a real jam in the area. I am loving my salmon bowl and I have loved all the smoothies. I’ve gotten there in the past."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aZmJGVk5YMGxOTVhkdmVYQmphVVZUTWtaNGFVRRAB",
            "text": "Always pass by here on my walks and decided to try them today. I just got a smoothie, Tropical Joy which was already ready in a fridge. It was really good. And the workers were really nice & friendly. Will be back to try other menu items."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1a2JYTllNekIzYldGdmVsOXlXVWRaZEhkME9VRRAB",
            "text": "That veggie burger is AMAZING!! I got it with pepper and fried plantain."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUmVEbGFSSEIxUm5oYVFWUkRibnBMTkhkM00wRRAB",
            "text": "if you don't like ginger this may not be for you. if you love ginger, you will love it here. very chill and friendly people as well"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTE1XNWtSa1JrUVhSVWJFVmhOek5mYkVSSWVYYxAB",
            "text": "This is easily the best vegan burger and smoothie in Brooklyn"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNFNFVkZOMHR3UzI1YVZuTldORUp6UVhJNE5rRRAB",
            "text": "I walked in to pasa pasa on a wim this Thursday evening never having been or heard of the restaurant before. I was greeted with a warm welcome from who I assume was the lovely owner that radiated joy and made me feel as if I was coming home. Something i’m sure is common place amongst her customers. I asked her what I should get being hungry and never having been and she suggested the salmon sandwich. I continued to watch as she literally danced around the kitchen entertaining me and the other customers with her loving spirit and self commentary.  After leaving and trying the sandwich and protein smoothie I now regard it as one of the best sandwiches of my life . The restaurant advertises that their smoothies are made with love but I think that’s false advertising as from my experience here everything is made from love owners and chefs included."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNM0EyWjZLMV9DX2JnEAE",
            "text": "Truly excellent food 👌 salmon is incredible. Plantains are tops. Veggie burger is a true innovation. Its a slow paced vibe but get inTO it…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaWVWaDJNRmxGUTBGaE5WSkphVEIzYjNaNE9IYxAB",
            "text": "The young lady at the counter immediately met me with a smile, and a warm and inviting attitude.   I asked her about a few recommendations and I went with the \"Ital ade\" juice and a jackfruit patty.  Both were made very well.  The juice was great and had a strong ginger constitution. The jackfruit patty was a great little snack.  It was baked, not fried, had a great texture to the filling and was similar to curry flavor.   The atmosphere was great.  For a smaller spot, it had decent seating and was nice and quiet.\nThanks!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPNjV5bzdkbkszX0R3EAE",
            "text": "Hidden gem...do not miss the veggie burger!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYVA2N3ZPaTVURmN3EAE",
            "text": "This was a just by chance stop. I saw a man enjoying his smoothie. I parked and went into the store and bought a smoothie. Delicious and good for my body.  I drove on listening to Gregory Isaacs on my way...Nice way to start the day."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcmNIMTNRRRAB",
            "text": "Place is really nice and the workers are great - smoothies sucked booty tho (also not made fresh?)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbHRqNkZREAE",
            "text": "Green breeze was delicious. The woman at the counter friendly and welcoming. I’ll go back for the food !!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveUpEV2JnEAE",
            "text": "Best Salmon sandwich I’ve ever had!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc3UyUktBEAE",
            "text": "What a nice, positive place to be ☀️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MWNuNlFnEAE",
            "text": "I was visiting my sister in Brooklyn and she mentioned this place she wanted to try. We were there at 9am on the dot and the doors were opened. We were greeted with smiles and good island vibes immediately upon arrival. When you walk in you immediately feel the warmth in your soul. We got the salmon sandwich and the bowl to split and share. They were both DIVINE! You can taste the extra quality in the oil used for the sweet plantains. Salmon was cooked to perfection with every ingredient just bursting with freshness.  I can't wait to go back this summer! My sister has now made this a go-to for her local runs."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LU1HbjN3RRAB",
            "text": "Delicious food and smoothies. Positive and kind people."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbUt1TEF3EAE",
            "text": "Protect Pasa Passa at all costs! Food is amazing and made with a lot of care and the owner Shelley is so vibrant and full of life. If I lived closer I would be there everyday."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReDl1d2pRRRAB",
            "text": "Amazing!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOF9QcDNnRRAB",
            "text": "A really delicious salmon sandwich and possibly the sweetest owner"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfak5qYk9BEAE",
            "text": "One of my favorite local spots! The smoothies are top tier, the food is made with love and the customer service is beyond excellent. Feels like you're home when you go there. Add it to your daily \"work outside home\" shops."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOTRfWmpnRRAB",
            "text": "Best veggie burger and smoothie options in Brooklyn. It's a MUST when I'm in town. Thank you Ms. Shelly!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbC1Ycjl3RRAB",
            "text": "Truly wholesome and healthy food, awesome space, and Shelly is one of the brightest personalities in the neighborhood. You’ve got to check this place out if you’re in the area."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaHMyYlpBEAE",
            "text": "I have come here multiple times now so it feels right to leave a detailed review. This is such a wonderful, unassuming spot offering great food and vibes. The first time I went, I was met by the infectious positive energy of the owner, Shelley. We conversed for a while about how she started the place, her passion for health and nutrition, and the vibrant plants and decorations of the place that lured me and possibly others into coming in. That day I ordered the salmon jerk salad bowl and dined inside. It was so fresh and flavorful. Shelley also brought out some porridge for me to try and it tasted so hearty. Made with love and care. The food and the above-par service left a big impression on me so I kept going back for salads, smoothies, patties, acai bowls, and more. From my several visits so far, I have realized one thing. This place is not as concerned with profit as it is with connection. Connecting people to healthy food and environment. I will keep updating my review as I go but so far, I have loved returning to this place for a familiar smile, beautiful ambiance, outstanding service, and importantly, food that is made with love and health in mind."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmLUlmNmJnEAE",
            "text": "Love this spot. The smoothies are fire. The salmon burger goes crazy. And I just was given a sample of the daily porridge. I didn't know porridge had so much flavor!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmc3ZydE9BEAE",
            "text": "I just discovered Pasa Pasa, and I’m already planning to make it my regular spot for acai bowls and smoothies—this place is THAT good! Even though it’s a 20-minute walk for me, it’s completely worth it, not just for the quality of the food but for the experience as a whole.\n\nFirst off, the ingredients are top-notch—organic, fresh, and bursting with flavor. The acai bowls are rich, perfectly balanced, and clearly made with care. You can taste the quality in every bite and sip, whether it’s the smoothies, coffee, or bowls.\n\nBut what really makes Pasa Pasa special is the energy of the owner, Miss Shelly. She radiates warmth and positivity, and you can feel her passion for what she does in every interaction. Her welcoming vibe makes you feel like you’re part of something more than just a food stop—it’s a little slice of Jamaican hospitality.\n\nIf you’re looking for a spot that serves amazing food with an even more amazing vibe, Pasa Pasa is it. My only regret is not finding it sooner!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2a3JtTWFBEAE",
            "text": "Initially, the food appeared satisfactory; however, the wild salmon bowl left an unusual aftertaste that raised concerns about its freshness. Unfortunately, I experienced severe stomach cramps for several hours after the meal, along with frequent restroom visits. Additionally, the customer service fell short of expectations. The older woman at the front was unhelpful, not allowing us to browse the menu at our leisure and displaying an attitude as if it was her duty to dictate our choices. As first-time visitors, we wanted to explore the menu, which is typically provided for customers to review. Instead, she vanished for ten minutes only to return with a dismissive demeanor. Her behavior came off as unbalanced and discourteous, which may be rooted in cultural differences. Regrettably, this experience has led me to decide against returning to this establishment."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNmNlN3ZBRRAB",
            "text": "Pasa Pasa Juice and Grill Restaurant\n12/3\nIf you're looking for a spot that combines great food with excellent service, Pasa Pasa is a must-visit. Their açaí bowl is hands down the best I've ever had—fresh, flavorful, and perfectly balanced. The staff here are incredibly friendly and go above and beyond to explain their menu and the preparation of their dishes, which adds a personal and thoughtful touch to the experience.\n\nThe wait time was surprisingly quick, making it an ideal spot for both a quick bite or a relaxed meal. I’m already looking forward to my next visit to try their unique lasagna made with coconut cheese and peas—it sounds absolutely delicious!\n\nHighly recommend this gem of a restaurant!\n\n12/4\nBack today for my açaí bowl, and once again, Pasa Pasa Juice and Grill didn’t disappoint! Centrally located in the heart of Crown Heights, just three blocks from Prospect Park, this spot is perfect for anyone looking to refuel with positive energy.\n\nTheir açaí bowl is absolutely incredible—delicious, filling, and so satisfying that I’ve been enjoying it as my one meal of the day. It’s packed with fresh ingredients and the perfect balance of flavors.\n\nWhat makes Pasa Pasa even more special is that it’s a fully vegan restaurant, so you can indulge guilt-free knowing every dish is plant-based and wholesome. Whether you're looking for a refreshing juice, a hearty bowl, or just a burst of good vibes, this is the place to be. Highly recommend"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQemNXeHh3RRAB",
            "text": "Pasa Pasa had the tastiest burger of my life & the staff is so funny and exceptional. Everything is nutritionally balanced and so good for you. I HIGHLY RECOMMEND!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQa2NMeVZREAE",
            "text": "If Pasa Pasa becomes a franchise it could heal the world. Best Veggie Burger i could imagine. Great smoothies. Such friendly staff, and affordable on top. Adding so much value to PLG!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcDRQaFlnEAE",
            "text": "Everything is delicious and the people are so sweet and friendly.\nthe soup is amazing ✨🍲✨"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYamF6ZnlnRRAB",
            "text": "My first time in was only a month ago and I’m already on a mission to try every smoothie flavor. I’ll eat anything she makes. Last time I came in for a bowl of soup and walked out #healed.\n\nThank you for keeping us nourished.\nWITH LOVE, Alecia"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeVpUNU5nEAE",
            "text": "Best acai bowl"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNk5uWWtnRRAB",
            "text": "What can I say? I keep coming back for the food and conversation. Shelly is a lovely woman, that's created a healthy restaurant in the community. She brings the flavor! Her vegan burger is the best I ever had. I've been plant based for 12 years. It's made from vegetables, beans, and a nice set of spices. It's not beyond meat, which I appreacite. It's spicy, which I love.\n\nIf you like smoothies,  please stop by and try one. I recommend the Tropical Joy and Peach Prardise. They are my favorite. The ginger hits right.\n\nThe veggie patties are delicious! Buy all 3 and try them out. You won't be disappointed.  Get an extra one to share.\n\nI am happily making my way through her menu.\n\nI'm so glad to have a place to go and be greeted with a big smile and joy. This place is a gem in PLG. I keep coming back. ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNub01LWkZ3EAE",
            "text": "Everything here is delicious, fresh, and healthy. Owner is the sweetest"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIczRyQ2l3RRAB",
            "text": "The food is delicious and the owner is an absolute sweetheart. Not to mention the Acaí bowls are absolutely amazing and affordable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdk1pdVBBEAE",
            "text": "Favorite Juice shop in the neighborhood.  The smoothies are very filling with a delicious mix of ingredients and the owner is the sweetest."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicTh2d0VREAE",
            "text": "Delicious juices!! Friendly service. Very informative. Owner is the sweetest 🥹❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiaW8yWUJREAE",
            "text": "The jerk salmon is DIVINE! I especially loved it in a sandwich with all the fixings. Delicious nutritious food, yummy smoothies, and lovely staff.\n\nThe owner to so warm and friendly! Support this local Black-owned biz you won’t regret it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiM05EWUlREAE",
            "text": "Best smoothies in thr neighborhood!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyX2JHaFB3EAE",
            "text": "I have lived in the area for almost two years and I cannot believe it took me so long to come here! This place is amazing vegan food and everything is delicious. The owner is incredibly nice and can give the best recommendations. I am currently obsessed with their mushroom coffees or mushroom matchas. If you haven't visited yet you must!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycGFheGVnEAE",
            "text": "Delicious food and best smoothies in the brooklynn neighborhood"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwa3Y2Ry1BRRAB",
            "text": "Can't say enough amazing things about Pasa Pasa. I've been a couple times and I'm looking forward to my next visit. My favorite businesses are ones where the owner's passion is palpable. From her menu to how she interacts with her patrons-…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eWV2THlnRRAB",
            "text": "The Wild Salmon bowl was amazing. Perfectly cooked and appropriately seasoned (wasn't salty at all). The pairing of the fresh veggies and dressing really boosted the experience. There were even some oven baked sweet plantains in there that melted in your mouth like butter. Highly recommend and will certainly be returning 💯💯…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6amF6NHpnRRAB",
            "text": "YUMMMMM - the peanut smoothie is like drinking a gingerbread cake, except healthy (at least that’s what I choose to believe) and the roasted salmon sandwich is next level - hard to put into words how perfectly cooked that salmon was. And also healthy! Which doesn’t mean it was strictly necessary for me to eat myself so full I can barely move but what was I gonna do, control myself? Not likely when the food is this good 🤤🤤🤤. Owner is an absolute delight and the whole vibe is just joyous. 12/10, will be back (and will pace myself better 😆)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5M3RfZWNnEAE",
            "text": "Really yummy jerk salmon salad tbh, veggies were fresh and the salmon was tender! I also really love all the plants inside, especially the banana trees!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdEt2eEF3EAE",
            "text": "Pasa Pasa is a gem in the neighborhood. It’s amazing to have healthy Caribbean dishes so close by. Swing by and speak to Miss Shelley Shelley Shelly! She will give you love and treat you like family."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1LXV1ZzVBRRAB",
            "text": "Warm and welcoming. I got a cold press and a expresso. Both were delicious & all natural. Prices are excellent and Shelly was super sweet."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUa1lxbkZ3EAE",
            "text": "When i tell you walking into this shop is a MUST, the owner is so friendly and truly cares about the ingredients she uses. Food 10/10! Not only is it good but the ingredients are fresh and organic!! Not a lot of places can say that. Just try it won’t regret it. Salmon bowl or the vegan burger must try + the smoothies"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6dUpxN0JBEAE",
            "text": "The salmon bowl! juices and smoothies here are 10/10. I haven't tried everything, but I plan to. Also the customer service is awesome. Shelly is the sweetest, she creates an atmosphere that feels like home. Love this place :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUbEszcThnRRAB",
            "text": "Once you meet Shelly, you have a new family member. Family cooking, family advice, family hospitality. She does not skimp on ANY ingredients. This is the healthiest food you will find eating out ANYWHERE.\n\nShe truly cares about feeding people fresh, unprocessed food with whole ingredients. You can taste the quality and love in everything. When I am sick and eat here I instantly feel better. I am happy to spend my money here and you will be too.\n\nShe did try to kill me with her fire cider but I will save that for another time.\n\nGod bless Pasa Pasa!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6b3VESU1REAE",
            "text": "Not only is Pasa Pasa a beautiful restaurant aesthetically, but the food and service is incredible. Shelly made me feel seen + taken care of. The Salmon and salad is sooo flavorful and fresh! A must-try"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwa3BqZ0RREAE",
            "text": "Shelly is the sweetest! you MUST come and try the Summer Peach smoothie. it’s delicious and has super foods!! Thank you Shelly!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbWVESFhBEAE",
            "text": "Amazing smoothies, juices and food! The lasagnas are Amazing! Everything here is healthy and tasty!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNmFuY05BEAE",
            "text": "Loved the vibes of the shop and the owner, Ms. Shelley; she is a pure gem who instantly makes you feel welcomed! Amazing vegan patties and healthy juices 😋 Will definitely be a returning customer and try the rest of their menu! Support Caribbean/Black owned businesses 🖤🤎🖤…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacE9XdnhnRRAB",
            "text": "This place was very cozy! Also offered the best vegan options! Do not miss the moment to eat here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydnB2ZXlnRRAB",
            "text": "I attempted to get a smoothie and they were out of Watermelon, but had some type of asian melon and the older woman got an attitude when I asked her if it was sweet and how did it taste. She then got disrespectful and called me a \"girl\". In my culture that is rude. Not sure what the attitude was about. I've been there in the past and will not return!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaWM3dUZREAE",
            "text": "The vegan lasagna was absolutely delicious! Loved the patties too! Shelly is super kind and welcoming. Can't wait to try the coco cane smoothie next time!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXbnNIVlFREAE",
            "text": "ital ade, curry jackfruit patty, and salmon patty were really good and did not disappoint. looking forward to trying more."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHbjhTWUNREAE",
            "text": "I’ve seen this place for a while when I walk my puppy. I was so happy to see how they also provide nutritious, generous food donations for anyone in the area who may be of need. I love the plants and flowers outside. Inside the  owner and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtXzd6MlVBEAE",
            "text": "Everyone is warm and welcoming. I love the energy in this place! The Ackee, plantain, and lentil patties are so yummy. The best patties I ever tasted. The ginger drinks are nice and strong just how I like it!! I will be back!"
        }
    ],
    "reviews_count": 69
}