{
    "name": "Moe's Pastrami & Burger",
    "place_id": "ChIJNaGSvfhbwokRlhDVEgmjprY",
    "grid": "BK9",
    "address": "569 Flatbush Ave, Brooklyn, NY 11225, USA",
    "rating": 4.8,
    "user_ratings_total": 796,
    "phone_number": "(646) 949-1717",
    "reviews": [
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWlQxTnFabkpMVDJsd2NIZ3dlV1JDWkMxc1puYxAB",
            "text": "Cheese was very artificial, fries suck, sandwhiches are over priced. Don’t get the Ruben, it tastes awful with the amount of Sauerkraut"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cWFrbFhOVTluWldvdFpVcFZaemd0UmtGamRXYxAB",
            "text": "My wife gives it a 4 I give it a 3 came all the way from Jersey just to try the food I'll be back though they might have to do a little better if they want to compete with David's brisket house no disrespect"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taa1NVZElVRkZxVjNCSmIxOXpYM2wzUzNWVmNHYxAB",
            "text": "Amazing and affordable halal Pastrami sandwich, I got my sandwich toasted but I might try it not toasted next time. I ordered the medium and added cheese, also shared it with my brother but you could eat it alone for sure."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWWNXMU9UelJvVTBaaFJEQnVlR1paYkhKNFZrRRAB",
            "text": "I tried the pastrami and the brisket. the brisket was pretty bad (way too fatty, not particularly flavorful) but I saw other reviews saying that the brisket is great, so I'm assuming I was just unlucky. oh well. the pastrami was beyond incredible, which is why I'm comfortably leaving five stars in spite of half my order tasting bad. I'll be back soon for more pastrami inshallah"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zM2RqRlBiWEpJTFhkdWNITk9aVEJRVjBwS2NrRRAB",
            "text": "Got it — no bullet points, just smooth sentences with dashes throughout. Here’s your revised 5-star review with dashes only:\n\n⸻\n\n⭐️⭐️⭐️⭐️⭐️\nMoe’s Pastrami and Burger – Brooklyn’s Best\n\nMoe’s Pastrami and Burger in Brooklyn is on another level – the best pastrami sandwich I’ve ever had – smoky, tender, juicy, perfectly seasoned, and stacked high with fresh bread that ties it all together. The burger is just as incredible – juicy, flavorful, perfectly cooked – with melted cheese, fresh toppings, and a soft bun that holds everything perfectly. This spot is a true Brooklyn hidden gem – authentic vibes, generous portions, and food that tastes like it was made with passion and care. If you’re craving the best pastrami, a juicy burger, or unforgettable comfort food in Brooklyn – Moe’s is the place to go – friendly service, clean environment, and flavors that keep you coming back. Absolutely a must-visit – I’m already planning my next trip back."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eFdFdDNlRU0zVmkwdFNETjFVRWR0Y3psUVNGRRAB",
            "text": "My dad, my sister, and I came here and we were blown away! My dad is extremely picky with food and even he loved it — which says everything.😂  The food was insanely good, super flavorful, and HALAL which made it even better.\n\nWe ordered the pastrami sandwich, the burger with peppers/onions and added beef bacon, and the pastrami fries — and every single thing was a 10/10. Fresh, juicy, seasoned perfectly.\n\nThis is officially one of our new favorite halal spots. Highly recommend!! ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMVN6UkdYM0F4YmsxS1puUlFURXBYWjJVNFNVRRAB",
            "text": "Great place\nThe food delicious, everything is clean and cozy. The staff is kind and friendly always a pleasure to come here"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTWRETllWbGRxZG1sZmR6VktSRTVUTW10bGVHYxAB",
            "text": "Great options! Good pastrami"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSZlVGTlFjakpQZFd0dk1rczVVbk5TYUU1RU9IYxAB",
            "text": "Awesome."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205c1dIVkpOblJZZVZwdE9FeEJUekJCWlRoNlZVRRAB",
            "text": "Very good and fulfilling\nGreat portion sizes\nEverything is always fresh and they are not rude at all\nDon't meet me there beat me there"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNFgxQTRNVWhZYm1OekxWVkhTbkZIWDNoNFVuYxAB",
            "text": "I will upload photos next time i order but the food is excellent cooked well very clean and great service what other you want from a food place than all this."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQlZUWkJZbmxUWTFscVFVZHZVSGhQUlY5dmRrRRAB",
            "text": "They food is good i rather them than the corner store...."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SlNqaElPVE5STVVKNloyWlVXbGh2VDBGbWJWRRAB",
            "text": "Amazing food, I got the pastrami burger and cheese steak, the flavors were great, the meat was juicy and flavorful. The place is kind of small but besides that it's still really good. Would recommend."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeFp6QnBPVFU0U2taMGIwZDNRekpOZVc5YVIyYxAB",
            "text": "Great"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeU5uTkdNRkl0VW1aRVMwOTVUSFE0VVcxbmMyYxAB",
            "text": "It's a good pastrami sandwich. Above average, nothing incredible"
        },
        {
            "date": "2주 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMk9HRkVOa1ZFYTNwc1lVdDRlRFpGYzIxTlgxRRAB",
            "text": "Pastrami was lekker, zoete aardappelen ook heerlijk"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVFMyOUhkSEJaVGxaVVQwdE5RWFZKTkZSWVpWRRAB",
            "text": "Great Burgers and friendly staff"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabmNqSTJNMlpZTm5CdlZWTTRaa001TkhoWVRVRRAB",
            "text": "Never have halal pastrami before, it is really good at Moe's. And you can pick the size is right for you. The price is reasonable. Service is friendly."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSR05tVkhURnAwZHpOMlRFNXZZWFJoVDJwM1gwRRAB",
            "text": "Great neighborhood joint. The people are great, the food is tasty, the service is quick and the price is good. Had great pastrami and corned beef."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRGRIUjBlRTFPUVcwdFpUSnRhRUpYTVRKMWNFRRAB",
            "text": "If you ate Katz’s pastrami sandwich, or 2nd Ave. pastrami sandwich, you’re probably not like it very much but when you compare the price, you will start liking it. I gave them four star that mean it was pretty good."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veFVuRkRWRXhEWTFrMVZIRXdWblF0ZVRkb2RuYxAB",
            "text": "Absolutely amazing food. The Pastrami was extremely fresh and juicy. The prices might seem high however the food portions are extremely generous and worth the price. Must visit."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqX3JhOWpBRRAB",
            "text": "A surprise pastrami sandwich on Flatbush in Lefferts. It was tasty and very good. I could have done without the toasted rye bread which they snuck in, which makes me think the rye bread may not have been that fresh, so they toasted it. A second and third visit cemented my vote that this pastrami sandwich is every bit as good, if not better than Katzs."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMGFIVk5VMWRsWTNwRk9YUkNhRmd4VEVZeExWRRAB",
            "text": "Brisket, pastrami, and Philly steak was incredible. Good service and great food, highly recommend!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eWR6SlRUV0ZZYmxkUU5XNDJSMkZCTFdWb1MwRRAB",
            "text": "I cannot recommend this place enough. Their pastrami was flavorful, tender and really good. So good that we took an order to go. Please go and support this business!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWamRIcDJXa2x4ZFZoelZFdFliMFZIZVhKSGVFRRAB",
            "text": "Great sandwiches. The pastrami was almost buttery!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWT1NVVkVkM2R2YldoR1ltMDBPVFpPUzNOVFJuYxAB",
            "text": "Pastrami was excellent"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WlRrSmtTV1o1VlVWVVdHRlBSMFp5YWtaNFRFRRAB",
            "text": "Just went for first time. It’s a small sandwich shop with a few tables. Outstanding pastrami, onion rings, and milkshake."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMVJuRjBNVzVaWXpkVWVUSk9ka2xDTVdOaU9VRRAB",
            "text": "The best brisket ans pastrami sandwiches and steak fries  I have ever had"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabFREUTJNelp6ZVd4M2F6VlFXbkYwWjBORFJsRRAB",
            "text": "The pastrami sandwiches and burgers are delicious, and the guys who work here are nice. Always good to stop in for lunch. Ordering a bunch of pastrami with rye bread and mustard packed separately is also nice to bring to friends and family who live outside of NYC."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVmMxSk9ZalJqVFRkSFRUQnlSRFZwYVZCWVdIYxAB",
            "text": "Nice and not expensive like some others..."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUk1rcFNMVmxSUVRkelFXRjZOR1JXVTFWNlVrRRAB",
            "text": "Best pastry in town. I loved it as well as the experience"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SclVsZFRZa1JUU2w5VloyUllOVnAzUVRSWFNIYxAB",
            "text": "Clearly family run, you can taste the care."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SZmQwcHpUalJOTUVoQ1JFZEhXbGt3YzFaMU5rRRAB",
            "text": "We had a chicken sandwich, beef pastrami and brisket. Everything was soooo good but brisket is what will keep bringing me back again and again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMmJUUm5VMWhwU0V0V1FsTlJNazVrVnpndFFWRRAB",
            "text": "Friendly staff and delicious food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeWRWOUVkbXBHVTJ3MGRuUk1Ua0p4YjJKNFRYYxAB",
            "text": "The food was very filling, nice and warm, and my mummy liked the cheese steak :D"
        },
        {
            "date": "1달 전",
            "language": "bn",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRE9FUm9aWFIxUlZNNGMxSXRSV0Y0ZUZOeGRuYxAB",
            "text": "গ্রেয়াত পাস্ত্রামু"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVFJGVjZPVjgzTmtRM2MzTlNValpIYzJoV04xRRAB",
            "text": "The place is small and a bit crowded, but for good reason! The food is fantastic and the staff are incredibly accommodating and efficient. The brisket and pastrami sandwiches were fantastic, and unlike other delicatessens not abhorrently expensive. They had a great selection of sodas to choose from. If I lived closer, I would make it my regular spot!"
        },
        {
            "date": "1달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMVVWbHplV0ZGUkhwcGNuWlFaRkI2Y1hnMWFIYxAB",
            "text": "pyszne pastrami, najlepsze w NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcWJVSnpYM013YzB3M2FreG5TamRmVFhSeWFrRRAB",
            "text": "The food finished quickly and was very fresh. The worker was very pleasant and informative. The energy is just really cozy"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQlZuaGFaRzFNUTJoWk1WaFJlVlJXVnpOWldIYxAB",
            "text": "The cornbeef sandwich was delicious\nI'll be sure to keep coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCM2EyZHViVE5EWXpKd1lsTXdjRkpGZW10VGNuYxAB",
            "text": "I was craving pastrami and saw this while on the bus. I decided to stop and I'm happy I did. The burger was flavorful and the pastrami was delicious and soft. Why pay 25 for pastrami elsewhere when moes has it for 12 and better."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRE5EZDVVRlZ2Y1hOU2IzTkNkMlpJU1U0NFZIYxAB",
            "text": "We came here encouraged by the high reviews and the supposedly “good prices,” but the reality was quite different. I ordered the extra-large Reuben sandwich for $22, expecting something hearty that would really satisfy my hunger. While it was tasty, the portion was honestly tiny, and for the price, it felt disappointing.\n\nFor comparison, at the famous Katz’s Deli you pay $29 — which isn’t cheap either — but you get a gigantic sandwich packed with meat, and you leave full. Here, you pay for something called “extra large,” but it’s small, almost laughably so.\n\nOn top of that, there were no toilets available for customers. Overall, I can’t recommend this place. The value for money just isn’t there, and I left feeling a bit scammed by the portion sizes.\n\nEDIT to Owner’s Response:\n\nTo put it simply, calling the sandwich “extra large” feels misleading when the portion is actually quite modest. And while the owner mentioned a $15 price gap with Katz’s, the reality is Katz’s charges $29.95 (about $32.61 after tax), so the difference is closer to $10, not $15. Accuracy and portion transparency would go a long way toward justifying the value here (photos attached for reference)."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4ZlkzTlpYM0IwWW04M2JqZExiR2hYYTNneGMxRRAB",
            "text": "Mashallah my favorite pastrami spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTE1tTkVXSEp3UlRsQ2JGTnphVWRqY0dKS2JIYxAB",
            "text": "Well done Moe’s"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3d1pWTlFUVFpDYkd0c1NsSlBOVGxuYTA5QmRFRRAB",
            "text": "I had the chance to stop by Moe’s Pastrami & Burgers while in Brooklyn this past weekend, and I’m so glad I did. The sandwiches were amazing, we tried the pastrami & corned beef combo and the turkey sandwich combo, and both were packed with flavor.\n\nThey offer a few different sandwich sizes, and my combo with fries and a drink came to about $30, which felt fair for the quality. The restaurant itself is small (seating about 12–15 people), but the atmosphere was friendly, and the staff made sure the food came out quickly.\n\nAnother plus: all their meats are Halal. If you’re in the area and craving a hearty sandwich, Moe’s is definitely worth a stop!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210T1ExQnlhelJtYkhablowbEZiek5TUlhGUVdGRRAB",
            "text": "Best. Bite. Ever."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oalRWSTJTbTU1ZVZoMU5XOU9ZbFI2UVVwdVNrRRAB",
            "text": "Nice little pastrami shop with good tasting sandwiches. Been a repeat customer."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcWNteEpTVVF5YUVSQ2VsOHdNRkJOVEVGYWJVRRAB",
            "text": "Absolutely epic Pastrami Reuben. The best pastrami in the halal game hands down. Perfectly seasoned, tender, and juicy. Meat quality is superb with the ideal protein:fat ratio. Bread is lightly toasted, perfect amount of cheese and toppings. A staple in Brooklyn NY. Nice selection of drinks and shakes. Only regret is I didn't get the large sandwich instead of the small.\n\nUpdate: TRY the Brisket cheese steak. I decided to change it up from my usual Pastrami Reuben, went with the brisket cheese steak and it was phenomenal. Super tender beef, peppers, and the right amount of cheese. Moe's has officially put halal brisket on the map in Brooklyn."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNVNIRnZVR05PVVZadk1rSTRabE5mZVZGR1pYYxAB",
            "text": "Absolutely amazing! Moes redefines what Halal food can do with exceptional professionalism and the best halal meat you’ll ever eat. I’ve searched the whole country for halal meats and options and can say with confidence that this place goes above and beyond with flavor, juiciness, combinations, and service. Alhamdulilah keep it up brother!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scGRIRkJOekJGYms1bFNVaENkRFJpVG5WcVRuYxAB",
            "text": "Nothing special, overpriced, taste and texture was  not upto mark. Sorry nit doing anymore visits."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOalEwZFRVMjVPTm1nMWJ6RnFRa2wzV0hseGEzYxAB",
            "text": "They serve the best halal pastrami and brisket sandwiches in NYC! The customer service was excellent—friendly and welcoming. They even let my cousin step inside to watch how the sandwiches were made and take videos, which was such a nice touch. We tried both the pastrami and brisket sandwiches, and while both were delicious, I personally loved the brisket more. Totally worth visiting again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRU9YZGZXbWxEZVUxWlMzVlpja3RGZEZJek4zYxAB",
            "text": "Staff gets a 10/10. I was standing outside on a Friday between 1-2 when the inside is closed for prayer time but it was hot outside so the staff immediately came outside and accommodated me. I had the ruben pastrami but it was a extremely greasy just dripping on the tray. I expected better. Onion rings were decent. Personally, i was a little disappointed but the staff really was very nice. I may come back and try the brisket and hopefully it was just an off day."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPV0cwdFBSZ3RleEh3EAE",
            "text": "Best Reuben sandwich ever!!! The pastrami is great and this is coming from a Montreal pastrami guy. Even the fries are super crispy these guys are super welcoming and serving up some amazing food - definitely coming back. Saw some people get cheese on the sandwich I gotta try that"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaS2MzUmtiblZKVFdSQ1dXMU5TbGRCYXpndFFtYxAB",
            "text": "If you're a big fan of Katz Pastrami sandwich, then look no further to Moes!! Hands down best halal pastrami and corned beef sandwich in Brooklyn.\n\nI stopped by to get my favorite - The Reuben on Rye with the fixings. Omg the flavor and loaded it up Extra Large. No way I was going there to get a small haha. But you can appreciate the options for those that want smaller portions.\n\nThis simple deli style serves up sandwiches and burgers and even shakes! Their side orders section and variety of fries will give you plenty of options.\n\nThe service is quick and the atmosphere is simple with seating area in case you want to chill. So if you're in Brooklyn period...just stop by and get your grub fix. It's a must, let's go!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLelN6TVBPdnN1SnhnRRAB",
            "text": "Came here for the first time and had the MED size pastrami sandwich with fries.\nThe pastrami sandwich was normal, nothing special, Ive had better ones.\nI felt that they didn’t put me enough slices in my sandwich for the price I paid and also its taste was sometimes simple, couldn’t taste enough the pastrami. The fries were good.\nA bit disappointed but overall is not a bad sandwich, it’s just that I expected something spectacular based on the other reviews I read but it wasn’t.\nMaybe I could come back here again sometime to try other sandwiches, give them a second chance and possibly have a better opinion."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNlkzb2tnRRAB",
            "text": "Another Halal pastrami & brisket spot in the Brooklyn area.  Also on par with Katz Deli prices (High). Great atmosphere and very helpful & friendly service.  Tried the pastrami & brisket sandwiches to go, both were good.  Will definitely be going there to eat in person next time."
        },
        {
            "date": "2달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNFJEVXRTR001UVcxM09XZzVUVlV5V0dsV1JsRRAB",
            "text": "الاكل لذيذ جدا, الاكل فرش  chicken tenders كرسبي وطري من الداخل وبالنسبه للبرجر لحمته حلوه ،اما بالنسبه brisket اللحمه طريه والنكهه موجوده ،bastrami مدخن وطري جدا ، ice tea نكهته رهيبه .. من المطاعم الذي لازم نزوره مره ثانيه.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKalJnSW5GeTR1ZlhBEAE",
            "text": "Note- cash is preferred but you can use credit card when the purchase is at least $15. Credit card service charge is 3.996%\n\nI got a pastrami burger combo (seasoned fries and drinks). That was $15.75. After sales tax, credit card charge, and tip, it ended up being $20.\n\nThe fries were extremely crispy and fresh. Great crunch.\n\nThe pastrami combined with the burger meat made for some great textures and taste.\n\nExcellent place and I always have to show love to the Yemeni business community in Brooklyn"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wc2FGZ3hlRFpsTjB0UFYwVlFORTF6UzI0NVRsRRAB",
            "text": "Amazing spot! The owners are so friendly and welcoming, and the Reuben sandwiches are packed with flavor — tender, perfectly made pastrami. My partner and I drive all the way from East Elmhurst to Brooklyn just for this place. Totally worth it!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUVRGbEtVakJTVW5waFVrd3lSRkpwY0hoSWRWRRAB",
            "text": "I found this restaurant based on the reviews and decided to try it, but I was highly disappointed. The burger was just average, and the fries were of very low quality, tasting like bagged fries from the supermarket. Considering the high prices, the quality did not match at all. Overall, it was a very disappointing experience.\n\nEncontré este restaurante basándome en las reseñas y decidí probarlo, pero quedé muy decepcionado. La hamburguesa fue simplemente promedio y las papas fritas eran de muy baja calidad, con sabor a papas congeladas del supermercado. Teniendo en cuenta lo caro que es, la calidad no corresponde en absoluto. En general, fue una experiencia muy decepcionante."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preFdDMHRWamRmUkhBdFV6RlRUMDlKV1ZkemJtYxAB",
            "text": "Just had the best pastrami burger in Brooklyn and it is HALAL!!! I had the pastrami burger which was insanely good. Loved every bite of it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvenFXUUd3EAE",
            "text": "Checked out Moe’s Pastrami after hearing good things, and Alhamdulillah, it really delivered. The pastrami had the right ratio of fat to meat; tender, juicy, and full of flavor. Every bite was delectable. Bread was fresh and did a good job holding everything together without overpowering the meat. Portion size was generous and satisfying. Staff were friendly and welcoming.\n\nAlways refreshing to find a legit HALAL joint that hits the spot without compromise. Definitely a go-to for HALAL comfort food in Brooklyn. Will be back, inshaAllah."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNTV5Zk9REAE",
            "text": "10/10!!! My friend and I came here for iftar and I was really surprised to see no one inside. My friend had the brisket sandwich and I had the pastrami rueben. We also shared the onion rings and chili cheese fries. All the food was fantastic, super flavorful, fresh, and you can taste the quality of the meat.\n\nMy cashier was Malik and he was very kind and helpful to us. The guys at the counter gave us dates to break our fast and the place was very nice and clean. Overall our experience was very good and we will definitely be coming back. If you’re in the area come and support these guys, the food and vibes are really good and they are making quality food."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcDZDSGlRRRAB",
            "text": "Drove an hour and a half to try the pastrami sandwiches and they were amazing. So where the brisket so with the corn beef And the cheesesteak and brisket was OK. Not my favorite.  We wanted to sample them all, so what we did was we ordered for sandwiches and split them in fours and each of us had a sample of each. And the cheese fries were amazing"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cGItQndBRRAB",
            "text": "The owners & workers were an absolute joy. They catered to all of our requests & made the sandwiches better than we wanted...\n\nTried pretty much the top 6 sandwiches... too hard to rank them... All were #1.\n\nParking is street parking & depending on time of day, it can be a challenge. We were a party of 3 & went in for an early dinner around 5-6pm so parking was plenty."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveFMzbHNabVJDUW04NGRtdGZWbHA0V1VOMGFGRRAB",
            "text": "Absolutely amazing food. Lovely courteous staff and warm welcoming atmosphere. Came and had a Ruben and Brisket sandwich on rye bread. Delicious 10/10 from England."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJNnB1djNtNDlyU1h3EAE",
            "text": "Great spot not far from where I’m staying. Staff is very nice and super cool.\nGot a burger, chicken sandwich, and pastrami. I got a med size pastrami and I wish I got the large, that was really good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNJNHBkNhAB",
            "text": "Their fries are some of the best fries I’ve ever had - cooked to perfection. Golden crispy on the outside, soft on the inside, well seasoned. The guy who took our orders and brought out food was very polite and hospitable. The restaurant was clean and a good vibe."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQejZ2NHpCM0tlMndBRRAB",
            "text": "Great food, pastrami sandwich was delicious and at a great price. If Moe's was next to Katz I'd go here, sandwich was just as good if not better and just as filling."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMThmQnd3RRAB",
            "text": "Follow me on Instagram and TikTok@posh.antics\n\nThis was my 1st time trying it and I was VERY HUNGRY after church on Easter! I was feeling for a burger but been craving Pastrami for a little while! To have my craving satisfied here was 10/10 experience! The bread was SOFT the burger cooked the way I asked (MD or MD Rare). If not they will cook it MD WELL! The fries were amazing! Now I suggest reading the menu because the COMBO comes with a FREE CAN soda ! I went and up graded my meal to Boylan Shirley Temple and didn’t realize until after but the service sooo good he gave me a can on the house! I will definitely come back because it is enroute to where I need to go and the Pastrami Sandwich combo was calling my name next if not the BURGER ! Soooooooo good & the service was just as good! The place was CLEAN and I got my food FAST! Which is amazing because I was REALLY hungry ! So thank you Mow for a great experience and I will be back ! For more content follow me on instagram @Posh.Antics 😁!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VeVRIWnRTREJ4T1ZKalVWVlpOMUUyVlRCcWNYYxAB",
            "text": "Absolutely Delicious!\nMoe’s Pastrami is hands-down one of the best spots in Brooklyn for mouthwatering sandwiches. The pastrami is juicy, perfectly seasoned, and piled high—exactly how it should be. You can tell they use quality ingredients and take pride in every order. The staff is super friendly and welcoming, and the service is quick. I also tried their fries and they were crispy and flavorful, a perfect side. Whether you’re a pastrami lover or just in the mood for a great meal, Moe’s is a must-visit. I’ll definitely be coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNGFsSmtVMkZxVjNWTlduUnRXVXBNUTAxVE1HYxAB",
            "text": "I had such a great experience at Moe’s Pastrami and Burger! The owners took the time to personally make sure everything was perfect for me, and the food they prepared was absolutely delicious. You can really feel the care and passion they put into what they do. The restaurant itself has a very warm and welcoming atmosphere, making it a place where you instantly feel comfortable. I’ll definitely be coming back — highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaYWQwOTJaRzR0VmtvemRubGlSVXgwVkhGNk5tYxAB",
            "text": "If you’re even remotely a pastrami fan, this place will change your life. The second you walk in, the aroma of slow-smoked, hand-sliced pastrami hits you, and you instantly know you’re in for something special. The meat is unbelievably tender, with just the right balance of smoky richness and peppery bite. It’s piled high between fresh rye bread that somehow manages to hold its own without overpowering the star of the show.\n\nThe portions are generous and every bite tastes like the perfect balance of tradition and craft. The staff treat you like family, with the kind of pride and passion that makes you feel like you’ve stumbled into a decades-old neighborhood secret. Even the sides are knockouts: crisp pickles, tangy mustard, and coleslaw that cuts through the richness perfectly.\n\nThis isn’t just a sandwich. it’s an experience, a celebration of flavor, and hands-down the best pastrami I’ve ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcUtxNFd3EAE",
            "text": "This is a nice sandwich shop with friendly service and plenty of options. I came here because it’s halal and had a positive experience. The food is delicious and the prices are fair. I had a pastrami sandwich and I enjoyed it. The quality of meat and bread was good. The cheeseburger was also tasty."
        },
        {
            "date": "7달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM056T1pnEAE",
            "text": "Pastrami sandwich besteld medium , Beef Quasedilla en Zoete aardappel met kaassaus. Pastrami brood was super lekker.. wat een kunst met vlees! Pastrami smelt op je tong! Beter dan dat ik mij had voorgesteld.. medium size was meer dan genoeg voor iemand uit Amsterdam.\n\nDeze zaak kwam ik tegen op youtube in Nederland.. meteen heb ik de lokatie opgeslagen om langs te gaan.\n\nZoete aardappel friet was super lekker.. in europa krijgen wij dit niet op deze manier voorelkaar.\n\nQuasedilla beef was sappig lekker en smaakvol!\n\nDank jullie wel voor de gastvrijheid en bedankt voor de Zuid Amerikaanse chefs!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMzVPSzh3RRAB",
            "text": "Pastrami was great, didn’t love the fries. If you like pastrami, you will probably like it. I especially liked that there’s a choice of how much meat you want, so you aren’t forced to buy a massive sandwich at an inflated price."
        },
        {
            "date": "4달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeFVGVnBTMEpmT1RCeVYySlFXSEU1Y0ZkT2FYYxAB",
            "text": "Kesinlikle tavsiye ediyorum.etleri gerçekten çok lezzetli vede helal.İf there is 6 star ill give 6 star.honestly i really like their pastrami sandwich. definitely come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbXNmM3JnRRAB",
            "text": "Asked for lettuce and tomato on the side. The dessembled the entire burger. I ordered takeout and didn't realize until I was already in the middle of Prospect that the food was inedible. I had to walk home 30 plus minutes and cook this dry burger.\nI've ordered before and this is an utter disrespectful joke. Cheese in the packet?! Why would I order food to have to cook it myself? And I asked for no pickles, but it's all together in the container with cheese plastic.\n\nI will never return here. I would have walked home and demanded my money back if it wasn't such a journey to get there."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSFREaG9PSFJKUXkxNmQyeE9ZbVl5TnpZd1UzYxAB",
            "text": "Wow this spot is the real deal. Pastrami was as good if not better than the legends. Great service too. Will be back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdDZIVmtBRRAB",
            "text": "Halal Pastrami Sandwich !! YESSSSSS THERE IT IS. This spot was dope , pretty far for me but I had went with my Muslim friend and they loved it . Got to try the Rueben !! Thank Me Later. Service is fast and nice . Family Owned Business !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJN01qSkwwNTdIeEZnEAE",
            "text": "Good pastrami sandwich. Clean quiet place. Took a while to get the order but definitely worth the wait."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UVpsQlhkV0pYVGw4M1lVcFJVblpFVDBGNU9VRRAB",
            "text": "Travel 50 minutes to try the pastrami and I'll definitely do it again and again, the service 100% the place super clean and the food was amazing, very delicious, I'm going back soon, i ordered the pastrami Reuben and it was amazing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2N0tUNnlBRRAB",
            "text": "I came to the store just a bit after it closed. The owner Mo generously offered to make me food anyways, but the ovens had been cleaned.\n\nI came back and he remembered me. Then I had the food: absolutely incredible. Best pastrami I’ve ever had, this goes up against any meat place I’ve been to.\n\nCan’t recommend highly enough."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OUxqZW5nRRAB",
            "text": "The pastrami here is really impressive. Super tender and just melts in your mouth. It has such a nice smoked flavor. I bought the extra large for me and my partner. The fries and pickles are really delicious too!\n\nI liked it so much that I even bought pastrami to bring home to have more later."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKamZlWkxnEAE",
            "text": "Run, don’t walk to this restaurant. This is my second time here and I’m just as happy as my first visit. I ordered the brisket sandwich. It was flavorful and exactly what a brisket sandwich should be. The dipping sauce, mustard and pickles made the whole sandwich perfect. I highly recommend this place and will be returning.\nOverall, the place is very clean, the owner is very friendly and the dining experience is beyond perfect 💯"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NTdLbXFnRRAB",
            "text": "I gave this location 4 tries before posting this review. I can't, in good faith, recommend Moe's for the pastrami sandwich. I'm sorry. Selling a pastrami sandwich should be sacred.  The first sandwich was delicious. They have gotten consistently worse. The second had ONE piece of fresh and One stale bread. While the pastrami has good flavor, you can't take the scraps, throw it on two pieces of bread and charge $30. That should be a crime against humanity. There's Little bits of meat and clumps of seasoning; no slices. They don't send extra mustard and the pickles have been gutted WHY?! The fries are good but I'm done giving up my dough. Unless I can visit in person. That way I can witness what they are doing. Just check out the pics and see for yourself."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaUttUGZREAE",
            "text": "This place is da 💣!\nThe best burger in the neighborhood at the best price, served with a smile by courteous and enthusiastic people. It truly was a gourmet food for fast food price.\nEverything burger came with onion rings, special sauce, avocado, lettuce, tomato and beef bacon, all for $9.99.\nPastrami burger, which was equally delicious and satisfying came to $9.99 as well.\nI will definitely be coming back.\nWife concurs.\nP.S. Next time I want to try Yemeni tea. Noticed it too late."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUVdtWnZNREpGZHpnd1pWOVRUbTEwWkVWRmJIYxAB",
            "text": "The food here is amazing. So far we’ve tried the chicken quesadilla, pastrami burger, seasoned fries and pastrami sandwich. Everything was so tasty. This will definitely become our go to spot in the neighborhood. The person taking our order at the counter was really nice and friendly."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQa28yNTV3RRAB",
            "text": "Anyone who’s got a dedication to traditional pastrami like these guys is Jake by me! Had a top notch sandwich and a taste of the excellent brisket. Props to having different size sandwiches. Moe’s will definitely be a stop on my pastrami circuit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveGJTMVhREAE",
            "text": "This place is a neighborhood gem. Pastrami of course is amazing but don't sleep on the pastrami breakfast sandwich. Really, really good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdlFtVkhXVmR0WlY5dFNYVTNUVlJCVEU5MlZrRRAB",
            "text": "One of the best Halal Pastrami/Brisket places I ever got the chance to eat at Alhamdulillah! I ABSOLUTELY LOVED IT AND ENJOYED IT SO MUCH. I had a wonderful experience and will definitely come back again and recommend to others. Drove an hour away to try it out and it was worth the drive! And the staff is super friendly and kind."
        }
    ],
    "reviews_count": 91
}