{
    "name": "Hello Bar Bk",
    "place_id": "ChIJNYMOd9NbwokRdmYSw0t_RiU",
    "grid": "BK9",
    "address": "1110 Nostrand Ave, Brooklyn, NY 11225, USA",
    "rating": 4.6,
    "user_ratings_total": 58,
    "phone_number": "(347) 365-3587",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaVRtRXRZMGd4Y1dweWVrUkJka295U0VzdFJtYxAB",
            "text": "Went there for a screening it was very nice."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeU0zWlFhMEpwT1dKd2RVVmlWRlp1VFdoVVEyYxAB",
            "text": "From the moment I sat down, the bartender Jimi set the tone for an unforgettable night. His service was nothing short of exceptional—swift, attentive, and effortlessly charismatic. Each drink was crafted with precision and flair, proving he’s not just mixing cocktails, he’s curating an experience. While waiting for my drinks, the energy never dipped; his warmth and quick wit made the bar feel alive. For a first-time visit, he made it feel like I’d been a regular for years. A true master of his craft and the heartbeat of the bar. I’ll be back to see you again Jimi."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeVMxaGlaV3B2UWxBMWVFZE1aMUphTjBoTk9IYxAB",
            "text": "I had the most amazing experience with Jimi the bartender. He was so attentive, professional and super charismatic. I still remember the jokes that we shared. I will be back to Hello Bar BK to see my favorite bartender !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMVRIVnVkVWRWZVhJMFlXUTNWMnBRU1VGUGIxRRAB",
            "text": "Came here on a Tuesday for Tacos. We sat inside at the bar. The bartender was friendly and attentive; very welcoming.\n\nI had the jerk chicken tacos and and shrimp tacos with margarita special. The tacos were really good. The margaritas were good as well. Full bar. Games included. I was told Sundays are lit. !! I would definitely reccomend this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OemVEZEpTWFpMV25oVGR6VjFaRlpRYlVKRFUwRRAB",
            "text": "Chic, cozy, creative. This place to be!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcVlrOU9MWE5PY0hCb2VXbEVRa3N0ZFhoVFVYYxAB",
            "text": "Drinks were tasty S.O to the bartender I ordered a steak taco it was giving more like burger meat 🤔 vibes were nice I would return to try the chicken taco instead for taco Tuesdays I like the idea of 2 tacos and a marg cute concept"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UlprbHNVVzl3YzI1R1MxcGtWbFoyYjIxeE9HYxAB",
            "text": "Jose, makes some good drinks and an WHILE VIBE. Definitely coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pselgwVXpkMDVPVGxSRGVYaHZOWGxqWjNSdFJrRRAB",
            "text": "Love Jose!\nFriendly, and makes delicious cocktails."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRlpIaE1WVEJIUms0ME5IRmpZVWhYY0VwWU5FRRAB",
            "text": "Decent experience. Not too crazy"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdFoxbDFZVEYzTkVsblRVd3hOR2hzZWpSZk1sRRAB",
            "text": "Enjoyed trivia night and the cocktails here! Would come back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMeTd1dnZqbXN2V09nEAE",
            "text": "Overall rating: 4.7\n\nSuper cute bar in the PLG area. The owner is so sweet and nice! Admittedly I wish drinks were a tad cheaper given the area, but can’t knock that down for a good vibe. The music is a vibe but I do wish it was just 3-5 ticks lower. It’s so loud for the space & when it’s not crowded. Definitely a bar for the rotation."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLNkcxNWVJbHNhLWpBRRAB",
            "text": "Overpriced Drinks [2 shots and 2 drinks=$75] Bartender Attempted to charge me for the wrong drinks. She is drinking as well and enjoying more than the customers. Have to hunt her down to order due to her being outside talking to the guys or at the other end of the bar drinking. Also Put ice in a cup with her Bare fingers but maybe it was for HER Drink. The atmosphere is cool though!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcnIzMHhBRRAB",
            "text": "The brunch is good and the vibes are awesome! Good music too!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBN1BlUFBnEAE",
            "text": "Honestly one of the best bar vibes I've experienced"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNDltcDV3RRAB",
            "text": "Great new spot for brunch small and spunky great music and food and service!!!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNVlUa3J3RRAB",
            "text": "About last night great vibes music was on point the dj “smashed” the host zo was so energetic had my vibes grooving lol crowd was very mature very nice tuck in on nostrand ave"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMDhTOFJnEAE",
            "text": "Awesome spot, super nice employees, five stars"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeXBUdk1nEAE",
            "text": "Cute little spot with tasty bites, good drinks, great music, staff & immaculate vibes."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmek9QcTVRRRAB",
            "text": "Great customer service, incredible DJ I believe he goes by the name DJ Brooklyn Jay had us on our feet the entire night the owner even showed up to personally thank us for coming  I will definitely be back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NmVpUlB3EAE",
            "text": "The vibes are great and they have games you can play but ....we did notice that they charged us delivery fee when ordering drinks on top of the taxes 🤔 🙄 😳 😒 We spent over $20 in fees and taxes for 4 drinks ....so I don't think we want to come back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MHFMXzVRRRAB",
            "text": "Pineapple Jerk Wings are absolutely insane! The owner is very nice, great music and vibes for a rainy and cold Weds."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuZ01yWlNnEAE",
            "text": "My favourite bar in Brooklyn. Celene is a warm and gracious host who makes everyone feel welcome. It’s clear that this bar is a pillar of the neighborhood, as I had many great interactions with locals and regulars who keep returning for the incredible cocktails, delicious food and almost nightly special events. There is a real sense of community and I know if I lived anywhere nearby this would be my local spot after work. Highly recommend attending one of the live music events or Karaoke!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bHNDLXhBRRAB",
            "text": "Just left this place. Thought the bartender was a sweet young lady but she accused my friend and I on running out on the bill. Had her friend chase us down the block and accuse of us of not paying. There was a barcode on the receipt to scan where we can pay through some site and I made sure I paid and it went through before leaving. Just a tip for this bar moving forward, don’t have that QR code to pay as an option if you’re gonna just accuse and have your friends run after us and say we didn’t pay.  The friend who chased us down claimed she’s going through it with her ex but respectfully, that has nothing to do with me! I always make sure I pay and I didn’t feel comfortable of being accused of something I didn’t do. FYI. My friend and I are both black and she’s white so you do the math. Wish I would’ve gotten her name but all I remember is that she has pink hair and was sad about an ex and took it out on her customers. Such a shame."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOWFLTDNRRRAB",
            "text": "Great staff and incredible drinks 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyd0xfR0tREAE",
            "text": "Cute and tiny. Drinks were good, and I really enjoyed the chicken nachos! All the staff were kind. One of the chairs outside was wobbly, but I got over it, lol"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcUtPLTNRRRAB",
            "text": "Izzy is the best!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUc09IcmxRRRAB",
            "text": "\"Exceptional service from the bartender at Hello Bar! Their engaging personality and knack for conversation truly elevated my experience. Not only were they skilled at mixing drinks, but their friendly demeanor made me feel right at home. Five stars all the way!\" Ask for salisha."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMjdfdk1BEAE",
            "text": "Great taco Tuesday deal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdGNxX2hBRRAB",
            "text": "Latin Bistro own by celine based on 1110 Nostrand Avenue is a charming spot offering a cozy atmosphere and a unique Sunday brunch menu. The bistro stands out with its homemade Putin dessert and refreshing passion fruit margaritas. For a hearty brunch option, the pancakes served with sausage perfectly balance fluffy and savory flavors. The friendly and inviting space makes the most of its compact size, creating a warm environment that enhances the dining experience. This neighborhood gem brings a delightful Latin twist to brunch, making it a must-visit for both locals and newcomers seeking a memorable meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdG8tczNRRRAB",
            "text": "Definitely hidden gem in Brooklyn bar scene. The atmosphere here has a great vibe. The staff is great and very attentive. Food and drinks are great and pocket friendly.. I will definitely return to Hello and say \"hello\" ☺️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMXJXT0d3EAE",
            "text": "I don’t usually do reviews but I would like for this place to stick around. Not too many options for this style of Spanish food in the area, especially at a bar. Spent two hours and did not break the bank, which is also another plus. Affordability, great vibes, drinks and food were on point. Definitely will be adding this place to my rotation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMXRIb0h3EAE",
            "text": "Trendy spot in the heart of Brooklyn. The drinks and atmosphere here are outstanding. Salisha is an awesome bartender as she is very welcoming and knows how to craft both standard and creative cocktails."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMXU2UWZREAE",
            "text": "This place is a vibe. The drinks are the boom and the empanadas are amazing.  The service was officiant and the follow up was impeccable. The sophisticated decor gives the place a cozy effect. Just what the neighborhood needed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMXM3N1l3EAE",
            "text": "I was told about this place from a good friend of mine.  So I have. To check it out. Since the minute I walk in the atmosphere was pleasant and I like it .  The staff was very friendly and attentive.  Love it.  Would definitely recommend this place and I am coming back for sure"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMXBTMnVRRRAB",
            "text": "A chic dive bar that my friends and I randomly found on a girl night out in Bk. The cutest vibe with the best empanadas and impeccable service. This is a rare find in the area, definitely a gem. The combination of a laid-back atmosphere with top-notch food and service is surely a winning formula. If you're looking for a cozy spot to unwind with delicious empanadas and attentive staff, this is the place to go. Bonus is they have a bunch of fun games and trivia nights, definitely a good night with my girls!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbHZfdlB3EAE",
            "text": "The ultimate best and greatest place in Brooklyn. Nice and cozy bar for specialty drinks at reasonable prices. Food is spectacular and delicious. I will go back without a doubt. I highly recommend. Congratulations 🎊🍾🎉 to the owner.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbHBlVWJBEAE",
            "text": "Celene is absolutely amazing. The atmosphere is great, people are welcoming, the food is fantastic"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbG91N1J3EAE",
            "text": "Came the other day, food was amazing, drinks were even better! Prices were great for everything from how good the food is to how great the drinks were! Definitely will be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbHVQeGl3RRAB",
            "text": "Love coming here! Never disappoints! Food is always amazing, drinks are fantastic! Prices are even better! Can’t say enough about here! Just need to come & see for yourself! Always a great place for a sip & snack don’t get me started on the night life! Can’t get enough 🤩"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbHQyLWtBRRAB",
            "text": "Loved the food, loved the environment! Super laid back, fun & drinks are always on point. Definitely going back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMDcteGhnRRAB",
            "text": "This is my lil secret hid away. The drinks are amazing. The bartender is from the islands I believe Tobago. Ask for her drinks. The spot is beautiful I’ll be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqZzR6alpBEAE",
            "text": "Great bar smooth and chill"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqb2J5WTdBRRAB",
            "text": "The nachos are really good !! Great happy hour deals as well. Bartender is really nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqZ2VqRldBEAE",
            "text": "Love this place! It’s super cute and the food is amazing. Great spot for some delicious dishes. Definitely worth checking out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbEpqbkJBEAE",
            "text": "This is such a cozy little unexpected spot. The decor is absolutely CHIC inside and the staff is so friendly and kind. Honestly I’m so glad we got such an upscale spot for the neighborhood. Great prices too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkczRDcHlBRRAB",
            "text": "In the defense of the establishment, I don’t want to unfairly critique if they are NOT attached to tonight’s event. Attended a cute/quaint “Galentine” event. Everything for the most part was flowing smoothly except the food service from not even an extensive — but limited “appetizers only” food menu (side note: the drinks really decent). Ordered a set of tacos and waited over 90 mins only to hear the bartender apologize for the wait. Within that time, I saw a set of tacos come out for another party, they were MINI tacos, not even something that the insides would be dangling out of any shell. It was almost embarrassing to think about the wait time compared to what’s coming out, which was roughly three SMALL plate orders. If this establishment plans to contend with NYC foot traffic, cuisine needs and social demands,  it cannot “rinse and repeat” service like this — or the only thing they will be serving is – crickets."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOb3FINmJnEAE",
            "text": "The service is great ! Food is amazing! And the b44 is right outside ! I ordered chicken empanadas and chips with guac. Everyone who works here stays with a smile on their face. You dont even have to come for the bar ! You can come just to eat !,i recommend coming here :) 10/10!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOZ3U3QnF3RRAB",
            "text": "Came here on a random Friday night and was super impressed . The vibe is super chill, local , pastelon and empanadas were fire"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOX0t5and3RRAB",
            "text": "Ordered the cuban sandwich and the pastelón and both were delicious! Looking forward to making this a regular neighborhood spot."
        }
    ],
    "reviews_count": 49
}