{
    "name": "Empanada City",
    "place_id": "ChIJNRvEK3BbwokR_y7hGNgFr9A",
    "grid": "BK9",
    "address": "363 Lincoln Rd, Brooklyn, NY 11225, USA",
    "rating": 4.5,
    "user_ratings_total": 1075,
    "phone_number": "(718) 363-5252",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMWFGQlllRzgzYTIxNmFYWnJObTl2WVhCbkxVRRAB",
            "text": "Ordered on uber eats. Not good. Ordered pastelon(1/5- all plantain, no meat and cheese was not melted), Americana (1/5 not tasty, cheese tasted like cheese wiz, expected ground beef as it’s marketed has hamburger—not chucked), spinach and ricotta (2/5, would have been okay but the spinach tasted weird not sure if it’s a canned spinach they use or what but didn’t taste fresh). The guava and cheese was the only one that was decent enough to finish"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aelUwcDZRbmRhWTNKRVl6Wk9WWFpmVlVob2RHYxAB",
            "text": "First time there and the empanadas did not disappoint!!! DELICIOUS!!! I had 1 veggie pastel and 1 shrimp with a side of their pink sauce 🤤🤤🤤."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wemJFZDRWelJyTUZRNE5qVlpSR2w2VDNSNlVWRRAB",
            "text": "The empanadas are a super convenient hand held size that cooked perfectly and super filled. My favorite is the shrimp. Perfection. Don't get me wrong I've tried several others there however the shrimp is the show stopper. With that said y'all do need give a little more love on sauces. We should get at least especially if I order more than two or three at a time."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNFlqazRPRFU0YzNKaWNrcFdWMDVtTWt0VGFtYxAB",
            "text": "Walking into this place, I was greeted with very clear branding and ambience with the amazing tunes and smell. It wasn’t crowded and pretty spacious. The service was great, I was given time to really think about what I wanted to order without feeling rushed. The icing on the cake was the BBQ chicken empanada and the cheese empanada. My daughter being 8, is picky; and even she enjoyed the deliciousness. The drink was the best non alcoholic drink I’ve ever tasted. Empanada City is giving Mamas Empanadas a run for their money."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMmFFRkdWMjVHZDFOYWJ5MDBaR1kyUldnNFNGRRAB",
            "text": "Yum!! Perfectly seasoned, cooked to order, overstuffed goodness so it will take a few minutes.  Cozy seating area if you want to enjoy, hot and fresh.\nThe cons... they charge for sauce, you get none if you don't order it...  $.30 each.  I got the avocado and hot sauce, decent but nothing fancy.  They have plastic cutlery, no knife, just forks. They have rice and bean dishes with your choice of protein, but if you're traveling, and you like your beans separate, they will not pack it separately. So I didn't order it. They're not very accommodating, but they were still good. I’ll be back,  rates 7.5/10 This shrimp empanada is my #1 favorites."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNVZHeEhNV0ZwWTNkSE5FWklSVFZEVERSbVltYxAB",
            "text": "They sent me seafood empanadas when I ordered beef. I don’t see how those are even similar. Careless. They went right in the trash."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bFMyWjZVMjF6ZFZaWFpVOUVkalkyVURCVU1FRRAB",
            "text": "Great food, i ordered 4 different varieties and a were great and tasty. I would definitely recommend."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMFdUZzVNblp6UTBaQlVXeHJkbFY1YW5GdldrRRAB",
            "text": "Definitivamente le doy un 10/10, las empanadas son frescas, un buen tamaño y un buen precio. Sabor exquisito especialmente en las adobadas de Pollo, Pizza y Ropa Vieja. En definitiva fue un boom con respecto a las empanadas, 10/10😍. Lo único que si deberían mejorar es en cuanto a las Piñas Coladas, pues sabe mas a Coco Colado que a Piña.\n\nI definitely give it a 10/10. The empanadas are fresh, a good size, and a good price. The flavor is exquisite, especially in the adobadas de pollo, pizza, and ropa vieja. All in all, it was a great experience compared to the empanadas, 10/10. The only thing they could improve is the piña coladas, as they taste more like coco colada than pineapple."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWWNqWTJURFZsVkhVM2Ewa3dURFo0VEhObk5IYxAB",
            "text": "La chica que esta en frente es una mala educada no attended al clientele y todo le da risa asi que es unprofessional... la comida es sin sabor no gastes su dinero en ir a este lugar"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbmIzcGpZbTVJWjFaSk5VTTBVMVV0UlVNNFdYYxAB",
            "text": "awesome awesome awesome"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MGVVNWxZbUZsWDB4R1JEbHFOR3hqYVVwdFMyYxAB",
            "text": "Empanadas are always on point!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeFZEVllPRk41T0dZMFNXSlljVzg0YjFZMU9VRRAB",
            "text": "Customer service Amazing\nFood exceptional"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHbTlDNFBnEAE",
            "text": "OMG. Hands down the best empanadas I’ve ever had. Seriously!*\nCrispy on the outside, soft and juicy on the inside. Packed to the brim with fresh, delicious stuffing. Place is clean, staff is professional, friendly and polite. Service is fast.\nThey just gained a new happy customer.\n*Wife concurs!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocVFsZDNNemRXU1VSNU1EaElZMUV6TnpCVmRWRRAB",
            "text": "I've been coming here for a long time and it's always been good, but this place has gone downhill recently for some reason. I got delivery from here today and received overcooked half full empanadas that were bursting open and they forgot one that I ordered (my favorite one no less). Really too bad, this place used to be great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCU1lXWjJjRWx1WVUxTVNYWkRaME10Y0d0UFVXYxAB",
            "text": "First time here, wanted some empanadas.\nI had 4 of the classics: beef, chicken, Platano & mozzarella and spinach & ricotta and they were all very good.\nIt’s wonderful to have this spot a few blocks away from my home. I will be a frequent customer from now on."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tka1ZGQnVTWFEzZW5OV2FHYzFRMEYzTlVwUWNXYxAB",
            "text": "the empanadas filled with oil"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcUw5TnlHcU5yalNnEAE",
            "text": "Great service,  good empanadas"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQNk9uZmVfdDhTWGpBRRAB",
            "text": "Plantain & Cheese with Avocado Sauce! 🙏"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbXZnNEd1aDdTaFd3EAE",
            "text": "Rope vieja are the best"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLVZ0SnFhaThYbTlBRRAB",
            "text": "Really fresh and delicious empanadas. The beef, cheese, and mixed vegetable were wonderful. Avocado crema was great, too. Very fair prices. Highly recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveklfOVhBEAE",
            "text": "My daughter loves it here. Sadly they no longer take phone orders but food is ready in record time"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNGI2U2JBEAE",
            "text": "Perfectly fried crust and fully filled. Dynamite empanadas."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMTUtOFpBEAE",
            "text": "The empanadas are really good. My favorites are the beef, and the Cuban ones. The fish empanada are also really good. Worth the money.\n\nTheir pork is often over salted tho. Also I was disappointed when I ordered ( twice) their rice and beans ( this place can be pricey ) so you would expect fresh food but their rice taste like it was cooked, frozen, and then warmed up again."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJc182TkdREAE",
            "text": "Un lugar totalmente recomendado para los buenos paladares, sin duda alguna todo allí es una verdadera delicia amo demasiado las empanadas, podría ir todos los días pero voy una vez a la semana, hablo a mis amigos de este lugar para que vayan y prueben todas las delicias de este sitio, aparte la atención de Andrés es increíble, te sientes en casa una vez que vayas no dejarás de ir!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNDZ5T3ZBRRAB",
            "text": "Es un lugar mágico donde te sientes súper muy bien atendido Andrés y Nathacha son excelentes anfitriones y los demás que preparan la comida tienen manos de ángel !!! Visiten este lugar es muy bueno excelente!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcU5yejl3RRAB",
            "text": "Ordered online and got the complete wrong order. Shorted 3 empanadas and none of the ones I did get were the right ones. No answer when I tried to call the restaurant. Also got a gross dessert empanada when I had ordered all savory. Will never order again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNExldFlBEAE",
            "text": "One of the best empanadas in the area and the purple drink is 🔥"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeDRqRHl3RRAB",
            "text": "Such a blessing to have had this establishment move into Our neighborhood. Gives us all an amazingly delicious fresh and fun option for Dinner or Lunch. I die for the Riopa Vieja … YUMM!!! Absolutely quality top\nNotch spot for Empanadas."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX3JQblh3EAE",
            "text": "Small empanada joint. Empanadas are huge and consist of classic choices and some more unique ones. Have come here multiple times and been left more than satisfied each time, will continue to come back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM29fNFZBEAE",
            "text": "My first time coming in here, I was stunned by the amazing choices and the taste of the empanadas. Instantly satisfied and becoming a loyal customer. God bless y’all."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdl9IY0lBEAE",
            "text": "Empanadas are very good i love the concept of this place. Its very cozy good for a pick up or a quick bite. Very flavorful"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBa0pMdy1BRRAB",
            "text": "Always clean and inviting fast service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbGRyOFl3EAE",
            "text": "3 bright and shining stars for their empanadas but do yourself a favor and do NOT get the beans...."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMC12bHVRRRAB",
            "text": "One of the best empanadas I've ever had. The bacalao was my favorite, but I'll go back to try other flavors as well."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaXNqRFZnEAE",
            "text": "The food is great"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNDhpZWJnEAE",
            "text": "Love! just simply Love ! Great food ! Amazingly portion, the best."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcS1xNEFREAE",
            "text": "Best empanadas in the city hands down. Try the ropa Viejo, my favorite."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcGJhVkJREAE",
            "text": "Best empanadas fried fresh each time"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNma1lUV3l3RRAB",
            "text": "It was amazing the food. A little more pricey them your typical empanadas  ut worth it."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaWJfRVpBEAE",
            "text": "Ok look, the empanadas are good, but for the love of God PLEASE label them! You have the shorthand listed for the website for this reason I'm sure. I shouldnt have to cut into 10 empanadas to find out which one is spinach and ricotta.\n\nEDITED TO REPLY: It does! I called in and was told by your team. Unfortunately, not all the lettering was legible but definitely helpful!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ2VuS3lnRRAB",
            "text": "Great place for a variety of empanadas!\nDefinitely recommend checking this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbS1HQ3BRRRAB",
            "text": "Great empanadas!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaGZXN293RRAB",
            "text": "Fantastic spot for a quick bite!  Perfect for sitting down as a quick and easy lunch option. Big fan of their mac and cheese empanada and the spinach ricotta one."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNGJISHZ3RRAB",
            "text": "wow!\nCompletely blown away.\nExceeded my expectations. Absolutely delicious. I ordered almost every empanada on the menu.\nEverything is seasoned to perfection. The staff is wonderful. The only thing missing is maybe a tiny bit of music while you’re in there but other than that legit perfection.\nso glad I finally have an empanada place that I can rely on ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaTVmemZREAE",
            "text": "I saw the good reviews on Google, so I stopped in for lunch.  Definitely some of the best empanadas I have had.  I ordered a Signature Chicken,  a Pastelón, and a Ropa Vieja empanada.  The shell of the empanada was the perfect texture, nice and crispy, and though it they are fried, it wasn’t greasy.  The ingredients were all very fresh, and super flavorful.  Exceeded my expectations.  Definitely recommend, I will be back to try some other varieties.  The fruit limeade drink was good too."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwcExheHFBRRAB",
            "text": "Their empanadas are pretty good, especially when they're fresh. I'm a big fan of the guava dessert one. And if you're in the mood for a caffeine boost, their lattes are delicious and affordable. Just be sure to ask for a small  double shot of espresso for that extra kick.  Avocado sausage decent, but the pink sausage just mayo and ketchup so if you have that mix it up yourself. I recommend!\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3eU9LRFh3EAE",
            "text": "This is the inside of my pizza empanada. Not cheesy nothing like a pizza. I’ve never had pre-chewed cheese. You disappointed me 😮‍💨."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOU02XzVnRRAB",
            "text": "Really good food. The sauce is way too expensive but you don’t really need it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMk9DYXZ3RRAB",
            "text": "Have experienced both dine-in and delivery. Eating them freshly done (dine-in) is obviously better than delivery, but the delivered ones still satisfy the empanada craving!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiczlETGFBEAE",
            "text": "The empanadas are delicious! Ex-pert-ly fried, with crisp dough and soft fillings. I ordered the pastelon and ropa vieja empanadas."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5enNqVGRREAE",
            "text": "Really mediocre empanadas. No cheese pull and they practically serve it cold. The pizza empanada had cheap ingredients honestly tasted like a Tostino pizza roll. For the price I expected something better. Pretty disappointing."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad092OHV3RRAB",
            "text": "Cozy little place with tables inside and a couple small ones outside. Service is not that friendly, but the empanadas are good. If you want sauces, you have to pay $0.25 for each one of them. I ordered different empanadas to take out, and I love the fact that the empanadas are labeled. However, they did not pack the like flavors together."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd3YzN1NREAE",
            "text": "Well kept organization BUT—- the service is trash- not welcoming. I waited in line for about 10 minutes before I asked “should I  place an order online? “ one cashier was helping a customer with a catering order and the other was just standing around looking aimlessly. They were not busy. Anyway…. The plantain and cheese didn’t have a pull nor did the pizza, or the pastelon…. The avacado sauce was great. But for the price the sauces should be free especially that size of sauce. It’s so small especially since I ordered 9 empanadas."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNXRYdnVBRRAB",
            "text": "Great Flavor Options! Decent Prices, Train station 2 blocks away so Easy to get to. Love it.\n\nSo I actually been looking for an Empanada place since the one that I use to go too in the city has closed down due to covid. I got an email from Uber Eats while doing food deliveries about this place. So I hopped on the 2 train in the city to go check it out. I absolutely loved it. Someone said their smoothies are amazing so I decided to try the Nutella one and it was definitely one of my faves now. So I expected the pizza burger to be my fave one but surprisingly it ended up being my least fave. The Americano was my Fave, it was Tasty and delicious, I will be going back and probably getting 2 Americanos and 1 Cuban. The Cuban was my 2nd Fave. I definitely recommend checking out this spot, you won't regret it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdlByVVRREAE",
            "text": "So my Anthony brought me 2 shrimp Empanadas my fault this was my first time and was not sure how I would feel about it, but boy oh boy I told him don't ever bring me 2 again he can bring about 1 dozen they were that good now I was not there with him but he brought home some avocado and some other sauce it would be nice to have like a light spices sauce. That being said am also going to try the many others they sell so can't wait see you then."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMzVtZlhREAE",
            "text": "Empanada City is a cozy restaurant with a welcoming atmosphere and friendly staff. Their Chicken BBQ empanadas are a standout, combining tender chicken with smoky barbecue flavor. The empanadas are labeled with their flavors, making it easy to choose. The house-made sauces add an extra layer of deliciousness. Whether you're a fan of Chicken BBQ or want to explore other flavors, the Empanada City family-owned restaurant is a must-visit for authentic and flavorful empanadas."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhZ04zWnR3RRAB",
            "text": "I was desperately craving some empanadas & searched “best empanadas in NY” on Google. Empanada City came up & I quickly ordered off Uber Eats! The crust was so flaky & the meat tender on the inside! I also loved their sauces. Will definitely be going back to try & want to go visit the restaurant next time!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvOFl5bEh3EAE",
            "text": "Went out looking for a fun new place to try on Valentine’s Day with my girlfriend. We ended up here, and it certainly did not disappoint. The outside of each empanada is crisp and golden, giving way to the tender, mildly chewy crust underneath. The fillings were all super delicious with my personal favorites being the signature chicken, the shrimp, and the plantain with cheese.\n\nEach empanada also bears a code that tells you exactly what’s inside. Simply look for the letters that are pressed into the crust (SH for shrimp for example) and then reference the cheat-sheet they give you with your order!\n\nThe restaurant itself was clean and had nice decor and the staff was exceptionally friendly- chatting with us and making sure our experience was great. A+ happy to have this place in the neighborhood."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdDRQTnZBRRAB",
            "text": "Been coming here for over a year and my partner for the last 3! We can’t get enough. Their empanadas are always fresh, always super tasty and they claim; “the best in Brooklyn!” And it’s really hard to argue that; they really are up there. The prices are fair, they offer a plethora of fillings and creative flavors. They have the best system as an Empanada Restaurant, marking their empanadas with stamps, which is a step few (if anyone) I’ve seen take; which is so helpful when divvying them out wondering which is which. Each empanada is stamped according to the lettering on the menu.\n\nThere’s really  nothing to dislike about this place! Some forewarning though they don’t keep their empanadas hot in a little case; so if you’re thinking you’ll stop in for a grab and go, it’s more like 4-7 mins for your order once you place it. It’s fresh you know? Still a grab and go but in that time frame.\n\nThey also have a delicious limeade with fresh fruit inside that is divine! 10/10 you need that drink (or one of their other delicious ones) to wash down these empanadas 🤤\n\nThe inner atmosphere is also always pleasant. Nice music plays, while the staff is friendly and attentive. It’s nice and quaint & sometimes you can sit outside! Whether you need a snack on your way to the Park or dinner, it’s a great spot to eat at."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcHNxcUVnEAE",
            "text": "Review update: I bought five empanadas, three spinach, two shrimp, and one piña colada drink. I bit into one of the spinach, and there was plastic wrap within the spinach empanada, so it must’ve been fried within the spinach empanada and the taste of the shrimp empanada is not the same anymore, so this place has fallen off. I hope I don't get sick from eating plastic-filled empanadas. 12.7.23 update\n\nYummy in your tummy. Bombdiggaddi...with awesome sauce. < this review was 5yrs ago"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaTdPWlRBEAE",
            "text": "These empanadas are amazing. You have to try the shrimp — it’s so delicious. Washed it down with a pineapple smoothie 👌"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdE9YQ3VBRRAB",
            "text": "The empanadas are so fresh and wonderfully flake-y. They have so many flavors to choose from, I can't wait to go back! They also have a good amount of seating space, which is nice if you're looking for a place to meet friends for a great meal."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLdmNlcENnEAE",
            "text": "Deliciiiiiious, the crust is not thick and it’s really fresh. It doesn’t retain as much oil as other empanada places. Cuban empanada was amazing. I want to eat more but three was my max. Really friendly staff."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJMmNxcEtBEAE",
            "text": "Great spot for good food at good prices.  There's an empanada for everyone here, along with signature smoothies/drinks.  The staff is highly friendly and accommodating.  Will definitely make future trips here."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5dGZUbEd3EAE",
            "text": "I ordered from here from Uber eats. The delivery was prompt however the rice and beans with pernil I ordered was inedible. The pernil was very salty and the beans were hard. The best thing was the rice. I also had a burger empanada where I…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUOHJESjF3RRAB",
            "text": "Every week I order 2 Ropa Vieja and 2 sMac’n Chicken empanadas. They are the most DELICIOUS empanadas. They have a ton of  filling options. One of my favorite things about this spot is all of the empanadas have the name of them on the outside of the dough so you know exactly which one you are eating. HIGHLY RECOMMEND!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0cFpIUEV3EAE",
            "text": "They were good, but not the best empanadas I've had - and I don't like that they charge you 25¢ for each freakin sauce. Annnnd I didn't expect an over-made-up huite gyal to be taking orders and not even asking me if I wanted sauce and then charging tax on it and then forgetting to put it with my order. 🙄 Plus, how are you supposed to get dipping or pouring these thick sauces out of these cups. Ugh. You bet I took the sauce home.\n\nSupport Empanada Mama in Queens any day. They have way more options and all the green and red sauce you want - no extra fee!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2NW82T2NREAE",
            "text": "I just ordered from UberEats and I am SO disappointed!\nAfter reading all of the reviews,  I was excited to try Empanada City. When I opened my bag, I was surprised that my six empanadas were not labeled, looked dark like it is was cooked in old oil, and had a hard and crunchy texture. I was immediately disappointed and frustrated. I had to cut open the empanadas to see which was which. My mother was also annoyed by the packaging and look of our order. She said that her beef empanadas were flavorless and a waste of money. I agree--My beef empanada barely had meat in it and looked plain sad. The ropa vieja looked more fresh   was full , and tasted the best to me, but could have been better.The pastelon one was MISSING the mozzarella cheese and a bit dry. Lastly, I would say the guava and cheese was pretty good. However, I will stick to what I know and will not be ordering again!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdzlud09nEAE",
            "text": "Second time I been here and let me be real about this place. Yes the empanadas are good and crisp. All three sauces are delicious and one sauce should be good enough for 2 empanadas. But at 3.50 a pop its just a tad too pricy. One empanada…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhXzdyM09BEAE",
            "text": "Friendly staff! Fresh empanadas as wel  I ordered the pizza burger and the ropa. 5/5. Would come back. Def comparable to empanada mamas."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHLTlpUzRRRRAB",
            "text": "A Prospect Lefferts Gardens staple. Always reliable, accurate, and DELICIOUS.\n\nI went and picked up shrimp empanadas and tried out the Americana empanada (VERY GOOD) the other day - I didn’t make it out of the outdoor seating because I knew it would slap as always. Ate everything on their cute patio space because I couldn’t wait until I got home.\n\nShrimp empanada with a little avocado sauce and pink sauce is the BEST. The empanadas are conveniently labeled on the crust part in the corner so you can distinguish between different empanada flavors."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJOGZXa0NBEAE",
            "text": "Had an amazing lunch from @empanadacity thank you @ubereats for the speedy delivery!\nChicken, Shrimp, and Pizza  empanadas 😋 I love the spicy green sauce... Flavorful bites and crispy light flaky shell...\n\n#thaprofechanel #restaurantreview #empanadacity #brooklyneats #brooklynfoodie"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdklMUUdBEAE",
            "text": "Delicious, really happy with this spot! I had the shrimp empanada and wish I bought two because it was so good. My 3 year old son had the broccoli and cheese and also loved it he ate the whole thing. We had the avocado dressing and my son…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3LXYyelBnEAE",
            "text": "The food and drinks are pretty solid. The ropa vieja is meaty, moist, and tender inside of its crisp shell. Definitely recommend.\n\nThe cheese and broccoli was a bit on the bland side and the cheese isn't really a melting kind of cheese, more like a firm queso fresco. Not bad though.\n\nThe three sauces are avocado, pink, and heat. Right off the bat, just skip the pink sauce. The Mayo and ketchup make it taste like a mainstream burger joint's secret sauce and the garlic flavor is a bit overwhelming and stale. The avocado is cool and rich which isn't bad. The heat has some nice chili flavor so I do recommend that.\n\nI got the morir sonando which is oj with evaporated milk. It tastes like exactly that and isn't anything to write home about. Would be good on a hot day though.\n\nThe venue is very nice and cozy. Good feel for a quick snack or a casual date. The guys behind the counter are very friendly.\n\nOverall, the food and value are okay, but don't strike me as outstanding in execution or authenticity."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtMUwtT1pBEAE",
            "text": "The empanadas are soooo great! Not greasy at all!!! Definitely a different taste from the usual chicken and beef ones"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4c1BIaFNnEAE",
            "text": "Estaba super rico, os encontré por google ya que no conozco ningún lugar dominicano con empanadas. Me encantó, muy rico.. el jugo de chinola no estaba muy concentrado a mi gusto es la única objeción"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5OFlER21RRRAB",
            "text": "We took home a variety of their best sellers. The Americana was my favorite but 😒“someone” inhaled most of them so I can’t really do a good review. I will go back this weekend and this time, I ain’t sharing.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtM3JDY25nRRAB",
            "text": "“Best empanadas in Brooklyn” is correct. With a beautiful hard shell encapsulating a decadent gooey core, it is truly out of this world. The chicken is shredded to perfection and can’t wait to go back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMkstRElnEAE",
            "text": "Great variety and authentic taste! Reasonable prices. Clean establishment and courteous employees. I will definitely be back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5dG8tWVhREAE",
            "text": "We've been wanting to try this place for ages and it didn't disappoint. The empanadas were light and crispy, and there was SO much filling. We got four each but they were so big that three would have easily been enough."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcjdQcENnEAE",
            "text": "Spinach ricotta and plantain cheese were my favorites. Thought I’d like the classic plantain/cheese/beef but didn’t like as much, meat was kind of bland. Flan was a bit firm dare I say “dry,”? Still a great option when you’re in the mood for empanadas."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcW9xZ013EAE",
            "text": "BEST EMPANADAS I'VE EVER HAD! The place is super family oriented, great location, great staff, and of course... GREAT FOOD! It's a MUST to check out! You will definitely come back for more and more and more!!!"
        }
    ],
    "reviews_count": 82
}