{
    "name": "Risbo",
    "place_id": "ChIJBb-QzRRbwokRk_PoI4uduws",
    "grid": "BK9",
    "address": "701 Flatbush Ave, Brooklyn, NY 11225, USA",
    "rating": 4.5,
    "user_ratings_total": 982,
    "phone_number": "(347) 425-9116",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkaE5FTnFhWFo2TkVoV1NtMVFkelZJTTBac1VIYxAB",
            "text": "The food here is very tasty and the atmosphere is nice with its own vibe.  Be mindful not to get here too close to closing as they tend to run out of options towards the end of the evening.  While on one hand, this is annoying; on the other hand, it’s a good sign that the food is fresh as it’s made to accommodate a number of anticipated guests per day.\n\nThe service here is limited as there is no table service. You wait in line, order, put your name in and wait for someone to call your name so you can then pick up your food. You will also then need to clear your table.\n\nIt’s for this reason, I personally feel the price doesn’t match the experience.  While very tasty, I easily drop $50-$60 (including a cocktail) on what feels like a casual cafeteria style meal.\n\nI give this 4 stars because the quality of the food and drinks can’t be ignored and the vibe makes it a neighborhood staple.\n\nTip: my favorite thing on their menu is the pear brûlée cheesecake!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkb2VpMXdWazkwY1RSNFdYTjVTM1ZUYlY5bVJWRRAB",
            "text": "Best bar in the city! I highly recommend’"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdWRIZFNhM2xXUVZkelMya3dNQzA0UzNGeFpYYxAB",
            "text": "My favorite restaurant in the neighborhood, finally open for breakfast/brunch most days! The pastries are particularly incredible if you can get them. Everything on the menu is a delight, but the rotisserie chicken (with harissa) is truly unrivaled. You can make atop tier sandwich if you get the platter with a pita bread at lunch time. Wash it all down with a rum cocktail or the house made ginger juice! The atmosphere is so warm and welcome, classy without pretense. And the backyard patio is so lush and intimate. The desserts are also very solid and generous, perfected with Morgenstern's ice cream!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQlIyZFJiMlJzUmsxSGFGaGljV2xoYVZKMmJVRRAB",
            "text": "Excellent food and even better wines, some of which were totally unknown. Service was great 👍"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WR1ZuZDVlSFowUlhWdGIxcE9XVmMwWkV4RWNYYxAB",
            "text": "Got the chicken, potato’s and pita bread.\nGreat seasoning on everything, literally couldn’t complain on that.\nThe chicken was a big tough"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zdFIxTTVORlY0Wm05VlVIbFhiM1JxVkRkR04zYxAB",
            "text": "Great service and amazing drinks. Works great during the day to get some work/reading done. I will definitely be back during the day to enjoy the patio. During the evening the vibes are chill and social. And the cocktails were superb"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWmVEbEdaSFZKZVhkWVltUjBSekl0WTA5SlpFRRAB",
            "text": "Great service, atmosphere, and food.\nAlso very good with vegans and food allergies!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbWJHRjFhVmxRT1Rac2EwaEdkMHN4TkVaTlNuYxAB",
            "text": "Great local spot, community feel and delicious food !"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMVJqbHhXRXh0Y0RoMk0xcDJTVGcxVFhGNVdtYxAB",
            "text": "The food here is pretty incredible. Meats are all high quality and juicy. You can tell a lot of thought has been put into every dish. I love the chicken platter. Max and cheese is also divine. This is a fast casual place--order at the counter then sit. It took a really long time to get our food when I went on a weeknight.\n\nThey also have a bar. The inside feels like a garden which is so peaceful and lovely. Chairs could be comfier."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQmIwMVlabTFCTkRoTVVUWnBkRmR4Vm1KWWJVRRAB",
            "text": "Spicy merguez sandwich — one of the best things I’ve eaten to date"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wT2VsVnpWMGx3UVU0dGNYaDBkR3BwY1RaVVprRRAB",
            "text": "Good place to go with friends. Very relaxed, and food was great."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWmJYYzRNR05mTTJkMWRXSmlVREYwUjB4cFRuYxAB",
            "text": "$40 for the roast duck and it was too salty to eat. Seemed like it was brined way too long. The sauce just tasted like cinnamon which was bizarre. It’s counter service, so I didn’t expect the service to be good, but the people who work there just stand there and watch you struggle rather than help you with the door, or find the water station. I came an hour before close so it was not busy at all. My food took 20+ mins then I was kicked out while I was still eating my overpriced food.\nI usually don’t leave bad reviews, but this was a pretty negative experience for me."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbVpIZGxkVkJyZFVKRlVIbHRZMVpMVFdWT2JsRRAB",
            "text": "Great Brunch and Backyard Vibes!\n\nThis is a lovely little coffee shop in the neighborhood that also serves alcohol.\n\nWe tried their brunch platter, which was really delicious (though slightly on the salty side). The latte was also very good.\n\nHaving brunch in their backyard area is such a relaxing and wonderful way to start your day! Highly recommend it for a pleasant morning meal."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWVZUTXlWSGhDUVRkT1RIbHVXR2RmUlhkVWRtYxAB",
            "text": "Delicious food & drinks, and a lively atmosphere! I highly recommend, but it helps to know the setup for ordering and seating ahead of time. (Order at the counter and seat yourself, wait to hear your name called, pick up your tray. Water and silverware at the counter. And order the frozen mocktail!!)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWk1YWTBWa1Z0YjFjNU9IY3dhakIzY1hSbWIzYxAB",
            "text": "The kale salad will change your world. Everything is so well seasoned and perfectly cooked. Delighted with everything I have had from here!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVVowMDRjakpMWWt3eVVFSm9NVXBVWTJ0amFXYxAB",
            "text": "A delight everytime. Best backyard in brooklyn."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MlVXNHdOVGRRUnpReWMyeFpTSFY2WnpSQk5sRRAB",
            "text": "I picked up dinner to go, the platter with roasted chicken and everything was amazing. It was a lot of food so ended up making two meals out of it. I especially loved the hummus and cauliflower that was included. The food is well worth the price and it's a super cute place inside."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQlMyVlpUbFEyWDI1SWNtSm5lRnBJZEVSaFpYYxAB",
            "text": "I could eat this place every day. Hands down one of the Best restaurants in New York. Juicy Rotisserie chicken .. Best Mac and cheese ...roasted veggies... creamed mashed potatoes. Love the dining and atmosphere.  Everyone super friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTVYxOTNSak0yYlhKTU1FZ3RaaTB6TkZKc00xRRAB",
            "text": "My daughter said that it is the most chilled place 😌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV2RUazRlREo1WlY5SFJFOUNaMWRUVlVkSk5tYxAB",
            "text": "Extremely slow line - overpriced bland spring greens salad that took forever, they charged me for smoked salmon and forgot to add it, said no merguez salad side and yet you could see it on the counter. Do not come here for lunch"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCc1lYRXlNMlY0Y2s1bU5uSkdjbGR0YVdsNloyYxAB",
            "text": "Great, friendly service and tasty food in good vibes!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNGVtTkNOVzFzYzB0bmRsQkZZMDV1TW1KT1FYYxAB",
            "text": "Incredible neighborhood spot. Nice little private patio in the city. Great cocktails and even better food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdGEybGtSR3BhVUVOaFQyWjFNRFZRY0cwM2NsRRAB",
            "text": "There's a lot of competition in terms of delicious chicken in the neighborhood but Risbo's roast chicken is in a league of it's own. It's quite literally perfection. Sides are a bit greasy but solid vibes, service and other patrons! What a hidden gem for the neighborhood. Will be back to check out the happy hour soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pndFdsTkpURFZHTUZkU1RFRXlRVE5JYkZoeWVsRRAB",
            "text": "Good food good vibes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVGJGSmhhWFpNUldoT1EydGZPVWRRZWxSbVFrRRAB",
            "text": "Food was excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMmVqZDJiM0F0VGtOWmRtbHlSbWwwTmt4VlRsRRAB",
            "text": "epic atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TGRqRlFWRk4wT0doVldWa3liSEphTWxCbFdsRRAB",
            "text": "Awesome food, coffee, vibes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTlFqY3hjWEJYWlZvdGVrRlVjSEJVVG1GTU5IYxAB",
            "text": "stunnnnnnning backyard, easily the prettiest backyard in new york restaurant history"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdWJEWlBkbVJYYW5WMVZqQlZTREZoV1RsdFYyYxAB",
            "text": "The food,drinks and vibes good. I would definitely come back here again.\n\nFYI it gets packed fast sooo first come first serve type of vibes.\n\nFavorite drink: Ginger Rum drink\nMeal: Lamb and chicken\nSides: mash, plantains, Mac and cheese (vegan)\n\nThe food doesn’t come out hot it’s the only downfall about the food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUmNtWlNhRjlqZG5CdVZuTmlhbTVDY1RoUVgyYxAB",
            "text": "I have been three times now and have decided it is my favorite place in Brooklyn to grab dinner with a group of people. I love that you order and pay up front but the vibes are still elegant and high-end. The chicken is phenomenal. One time I just went and got 1/4 chicken and nothing else and it made my day. Highly suggest this place for dinner. BUT I once got a chocolate croissant and it was stale. That was disappointing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMGJYa3dUVUozUVVrM1oyODJhVlJoUm01UU1YYxAB",
            "text": "Wow. Wow. Wow. Extremely tasty and fresh food. Lovely team. And ample seating either indoors or outdoors."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUVlVZDVNa281YUhaVWJVUkhWV3h2VTFreGNsRRAB",
            "text": "The food is great and they give you a good amount. The bread pudding was very good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMVVqVm1WazVyTUY5T1REWlBOR056Y0ZVNFNVRRAB",
            "text": "The food is good. But you seat yourself and bus your own table. So I found it a little obnoxious that lowest default tip was 20% at the register. It’s not cheap so that would’ve over 6 bucks for just taking my order and and texting me to pick it up when it’s ready."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMFgxRkJSbEkwWjFaR2N6UTRXRjk2ZGpSU1FrRRAB",
            "text": "I’m obsessed with their mashed potato. The food is served in a buffet style but it’s good nonetheless😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTFFtbHlhRTVsWHpCRldXa3lZWGN5ZUZFelJIYxAB",
            "text": "Very meh. Food was so boring. Don’t fall for the hype. Best thing is chicken but also not spectacular. Everything else is so boring, literally EVERYTHING is okay at most, including Mac n’ cheese. Don’t travel to come here. Not worth it. Only come here if you’re 10-15 min by walk. Any place is better than this. So mid. Over-hyped and not worth it. So annoyed I came here because of the good reviews. Go to Chinatown or literally anywhere else. Meh. Meh. Meh at best."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVGIxWmpWVkpHTVVkM1RGbzNSM0pDVjNWVGVsRRAB",
            "text": "Laid back vibe, excellent food and kind staff. Love this place. I'm thrilled a rotisserie spot has so many great vegan & vegetarian options, sides are all amazing, harvest salad is so yummy, love the brunch, and omg the Remedy juice (ginger & bissap/sorrel) is FANTASTIC!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMmFFNUNXazgwZG14aGRrbFRjRnAwU0ZCcFRVRRAB",
            "text": "Brunch at RISBO was simply EXQUISITE!Moist Rotisserie Chicken, savory light and fluffy waffles and lamb sausage. Mmm! ♨️😋🙃What a treat!\n\nI happen to pass by and the aroma drew me in. I absolutely loved the decor, open concept dining, ample garden seating and excellent attention to detail.  The drinks left me wanting more and the music playlist had everyone grooving. RISBO, you have something special here and I can’t wait to come back and try the rest of the menu. Mercí! 🧡🧡🧡"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNE5WOTRNMmx3YVhSTlgzbEVaV3RLYWpCMVowRRAB",
            "text": "Good place)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keVZVbHBNbEJsUnpkQmJISkJTeTF6WDBOVGJFRRAB",
            "text": "Way way overpriced"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbVdYcE1WRTlsV0hGNlMzTndPR3RCU1dKM1FXYxAB",
            "text": "It wasn't bad, but it wasn't great. The ambient is good, but the food is not for everyone. I went because I thought it was going to be French cusine, I found nothing French. Maybe I had high expectations because of what I though it was going to be. I'd give it another chance."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTlowcG5NVE5IUlZsaFpHTXpjSHAwTld0RGFtYxAB",
            "text": "Roasted pork platter was quite good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCb2FUWnBZbmQxWDNWeVZYTmpWa3BaY0RSSVZGRRAB",
            "text": "Everything is excellent but the cobbler is……..truly spectacular. Love this spot!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMVNrbFVjbXcwU1ZaT2FtUlpNbTUwTVdaMlJYYxAB",
            "text": "A delightful summer evening! Four of us came here before a concert at King’s Theatre, and we all thoroughly enjoyed our meals. I had the lamb (so tender, great accompanying sauce), the pickled cabbage slaw (yum), and we all shared a platter with warm za’atar spiced pita bread hummus and pickled veggies. I recommend it all. Two of the people were vegetarians and they were pleased with the hearty and flavorful options. We sat in the back garden area. I’d come back for sure."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMFZDMDFkRk50T0d3dFgxRmFiMmg2UzBobk4xRRAB",
            "text": "Things take a long time to get served. You have to order at the cashier and pick the food up yourself, but things aren't in order."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGU1FtbGFRV3c0UW1RM1VHNVROSGhhUzE5Zk1XYxAB",
            "text": "This is indoor/outdoor hidden gem from the outside you wouldn't think it's so big inside. They offer healthy food options freshly prepared. When you walk in you get cafeteria vibes due to the tables however the decor is nice The outside area was really nice and perfect for large groups. I enjoyed my meal. The hibiscus drink was not Caribbean style but it was ok. I definitely would try another drink if I go again. This is a good place to be with friends or a solo meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zd2VWVnpiRTlwVDNCeWNHSTBiVWxCZFU1bWNVRRAB",
            "text": "Delicious, flavorful, and fresh! Every bite is wonderful. The service team is kind and warm. SO grateful to have discovered this gem!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUFIxVlJWMjV1ZERkMFVtaE5jbGR3YlhGaFoxRRAB",
            "text": "Michelin recommended - the food is like nothing I've ever EVER had before. The chicken and waffles are undescribably tasty.\n\nThe parlor is a great atmosphere too. A cross-breeze blows from the garden patio in the back to the street. There are plenty of livation options, including a ginger-bissop mocktail.\n\nThis is a must-visit restaurant!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWVowcG9WamhNVUdoemRIZHRibTl2ZFV4NGEyYxAB",
            "text": "amazing food !!! and very nice people\ni don’t know if it’s really french but i definitely recommend this place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eVkyVmpiVmgyZWxWbk56UjZjMnQyWlVoaUxYYxAB",
            "text": "I live near by and have tried many of the restaurants in the neighborhood. I can say with confidence that Risbo is one of the best places to go for lunch or dinner. The back outdoor space is amazing and the entire establishment feels very welcoming. The drinks and food are top notch! I haven’t had anything i didn’t love. Everything comes together to create a very cool vibe. I’ll be coming back regularly!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVFJYRkxiMmROVkc4MVZqbGxOWFZtZEd4TldtYxAB",
            "text": "It’s good food… but it’s just a buffet and silly expensive for counter service where you have to bus your own table.  There are some amazing restaurants in the area that charge the same or less PLUS you get service and drinks.  Drinks here are Village pricing, honestly Tito’s isn’t worth $16 if the bartender does less work than a Starbucks barista making a latte.\n\nUpdate to respond to the owner:  be a part of the community you aim to serve by hiring waiters.  They come by and ask if you want dessert, more drinks and help you make more money while also setting you apart from Shake Shack.  You don’t have staff because you don’t want to pay them.  Own up to it. Your people looked bored and indifferent… not like they’re getting the living wage this place should offer at these prices."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMmIzbFJSaTF5TTNSM05ESmxVRmcyVkRGVVNXYxAB",
            "text": "Amazing French cuisine that’s flavorful and delightful. I had walked by here a couple times and was curious to try it. So happy I did. What a gem. The menu seemed a little expensive, but after eating the food, I can tell the care they put into each dish. The price is worth it, and I will be back. The dining area is also cute and intimate. This is a laid back spot to catch up with friends or bring a date. Give it a try. I doubt you’ll regret it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZemNYTTBaa2RXTkZBd1ZuTTFjM1pOVVZWTFZIYxAB",
            "text": "Really enjoyed an easy/casual salad bowl at this place after a walk in Prospect park. The food is fresh, the ambiance is very relaxed. The chicken was juicy. Back patio very cute"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJdng0LWZEdExueVpnEAE",
            "text": "Relaxed atmosphere with delicious fresh and healthy choices. We had the vegan bowl and kale salad. Both tasty and fresh.\nGreat service and the inside and outside are perfect at anytime of day to eat. Ginger juice is really refreshing.\nYum."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQcXRlcVhREAE",
            "text": "Food was great! We tried a good variety of the menu items. They were attentive to dietary restrictions and made sure the dishes we had were without sugar. The bowl called The Healthy One was very filling and had nice flavors. We especially liked how they cooked The plantains. The backyard seating area was lovely and unique."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNSHp0dDM0dWR2RC1RRRAB",
            "text": "LOVED! I appreciate the simplicity of the space and the menu alike. The phone was very delicious and I enjoyed every bite. The highlight was the spices on the chicken and that cabbage salad. I personally don’t like pumpkin seeds but in addition to the veggies.. I am now a lover. Will start adding to all of my veggies moving forward. I definitely recommend this place to anyone looking for a vibe. The drinks were also delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZnVyLS1TeG92Z29BRRAB",
            "text": "Amazing spot. Great food. Tables could use a bit of better cleaning.  Service bottlenecks at cashier as you order and pay right there.  Food and drink runner and busser would be nice touch. That being said, great how casual and affordable it is for area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdVUxZExPVnBCWWw5U05IbEhORk5ZWXpGTFpXYxAB",
            "text": "Risbo has a special place in my heart. I always try something new and I’ve NEVER been disappointed.\nThe atmosphere is great, the food is delicious (little heavy on the cilantro topping though) music is always chill.\nI enjoy this place very much."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueC16NzZnRRAB",
            "text": "It was my first time eating at Risbo, and it was amazing. Great vibes, food was good, and customer service was excellent. Great location! They have outdoor and indoor dining. I choose to dine outdoors, which is in the backyard. I love the setup it was vibrant, peaceful, the flowers/plants were beautiful....I give it 10 out of 10. Great hang out spot"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOGN5dlJ3EAE",
            "text": "Service was good and friendly! Loved the food- got the chicken platter. Chicken was juicy and seasoned well! All the sides were yummy!! Got additional pita bread which was fluffy and fresh (went well with the hummus). Will be back to try more dishes and enjoy the backyard seating!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcTVDT05nEAE",
            "text": "The food is OUTSTANDING. I was pleasantly surprised to receive a half chicken with my chicken and waffle order. So many chicken tender/waffle meals out here.\n\nThere is a beautiful outdoor garden seating area. Cocktails are not that great some can use simple syrup but honestly the food is astounding, service is great & the ambience is wonderful. Will definitely be back here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaE5VbEdWMDVSU1RGWE1FVmFUVk00WTJjNFRuYxAB",
            "text": "Breakfast Sandwhich through me back to an Ecuadorean llapingacho. The way the pickled onion married the egg and herbs seasoned the bread and bacon. Every time I go I sink deeper in."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMVpULVlREAE",
            "text": "I didn’t particularly in enjoy my dining experience at Risbo.\n\nI was confused by the ordering process, and the lady at the register provided no clarity. In general, the staff didn’t seem too friendly to African Americans, but maybe that was just my impression .\n\nThe food was ok, but it wasn’t memorable. The atmosphere and free spirited vibe was the best part. Hard to recommend if you’re a black person."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBLTR2UW9BRRAB",
            "text": "Risbo overall was really good. The food was delicious and filling. The atmosphere was great for a weekend brunch. Service is limited but responsive.\nThere is some communal seating and some intimate seating.\nIt is a great spot for brunch."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREM3VtcGRREAE",
            "text": "In short, RISBO is a neighborhood gem that everyone should visit. The proximity to our home makes it a convenient and enjoyable spot for us to dine at. The friendly and professional service, coupled with the delicious and fresh food, keeps us coming back time and time again. And let's not forget about the beer selection and cocktails which are expertly crafted and add a special touch to every meal. We are grateful to have such a wonderful restaurant just across the street from us. Thank you RISBO for always providing an amazing dining experience for my family and I.\n* 2 stars for the “Atmosphere” only because of the lack of AC. During the summer heatwave it’s pretty brutal, even in the backyard."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdlk3SUNnEAE",
            "text": "Saw Risbo on TikTok as I was looking for a nice, quiet spot for a solo brunch. The stunning interior and roasted chicken both looked amazing and I was not disappointed. There is a bar to the side and fast-casual ordering as you walk in. I got the Oeuf Brouillé ($18.00) which came with: Creamy French-style scrambled eggs, crème fraîche, chives, salad, roasted potatoes, toast. I got a side of 1/4 Roasted Chicken ($10) and a French 75. Everything was gorgeous; I never had French scrambled eggs and the texture was so light/fluffy. Their roasted chicken was seasoned well, although I prefer my chicken to be cooked a hair longer. I sat in the outdoor patio out back, and it was so breathtaking. The only thing I struggled with was sitting comfortably because the tables were short"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdDdPdG9BRRAB",
            "text": "Excellent. Michelin guide rated. Food is delicious. Space interesting, varied, well designed. Staff very friendly and polite. Atmosphere convivial—people first and privacy if you need it.  We had to wait FAR too long on A Saturday at about midday or earlier. When I went to ask why we were still waiting after 30 minutes, I was shown the plates sitting on the counter but we had not been notified so it was barely warm."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcEpLQ2J3EAE",
            "text": "Love, love, love this place. The meat is delicious. The duck is incredible. The sides are also nice and varied. Great prices and a good selection of wines and drinks! Would travel to this neighborhood just for dinner here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQV0lzNC1IanBEM3NnRRAB",
            "text": "Terrible food and service experience. Ordered 2 duck main courses. One was fine, but the other was all fat and bones, barely 2 bites of meat. We showed the server to be told there’s a strict “no refunds or exchanges” policy (strange for that to be a restaurant’s immediate response - perhaps a sign of high number of complaints?). They were firm in their position and barely prepared to even have a conversation about it or inspect the dish. Also 1 of 2 glasses of wine was cloudy “because it was organic”, but the same wine from a fresh bottle was transparent, so it was really just off. Considering the lack of table service and bussing your own table, $110 above-Manhattan prices for this experience was deeply unsatisfactory. Nice garden.\n\nEDIT following owner reply - understand it’s a quarter of a bird. However, for main course price of almost $40, would have expected some meat to be edible. One dish was fine, the other there was almost no meat. They didn’t even inspect the dish to verify the complaint and were immediately defiant. Unsure why the owner is suggesting malicious intent simply because I posted a review on both Google maps and Yelp !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1X2JhODdRRRAB",
            "text": "Fantastic food, great ambience at reasonable prices. I had the Rizzo platter with pork, the meat was tender and extremely well seasoned. The sides were all vibrant and delicious! My friend got the quarter chicken platter and it was equally good. The mashed potatoes were like butter!\n\nThe ice cream and blueberry cobbler for dessert was such a treat! It tasted like someone had just made it earlier that day.\n\nI’ll definitely be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cmNPRlRBEAE",
            "text": "I initially thought the whatever chicken was a little too salty, but with the mashed potatoes, it was better. The tacos were also good, despite the tortilla was slightly burnt around the edges. Overall 4 ⭐"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMTRfWkt3EAE",
            "text": "Loved the vegetarian options available for brunch! We sat outside in the garden & it was perfect :) Def my new favorite brunch spot in the area!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNEtLUzhnRRAB",
            "text": "The chicken was the best thing on the lunch platter but the sides were very underwhelming and over all the price of 20 dollars this meal was very lackluster. The service was ok but not very welcoming. Lastly they if you want simple glass of water look the other way because the water come straight from the tap and is warm not cold no ice"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcHZfUVRnEAE",
            "text": "The food was great, the ambiance was also great. The only thing I’d suggest is to allow pregnant women to order scramble eggs. Not sure why they’re not able to accommodate because the chef is amazing!! He was my favorite part of the experience. He was in the zone and cooking so gracefully! The woman at the front seemed annoyed that I even asked. But other than that it was fine"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMZlRxNGVWNHRYZnF3RRAB",
            "text": "Found this place by chance and it legit drew me in. The smell was incredible. It’s counter service, and that part was cold and unfriendly. The kitchen is open, like a hot sandwich counter, but homier. A row of dutch ovens, and cooked rotisserie birds. It wasn’t busy but my order took 25 minutes. The backyard is a very nice setting. I got their take on chicken and waffles, and it was the best meal I’ve had in a long time. Can’t even describe it. Amazing. I did not have drinks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKalB6WW53RRAB",
            "text": "We liked it for the overall vibe and new tastes. Pita and hummus was excellent. Pita was piping hot. The Risbo platter had a lot of interesting sides which I liked. The chicken was good, I liked it better than the roast pork. I wanted the pork to be a little more succulent, but it was flavorful. Next time, I will try the duck and lamb. You order and pick up at the counter. Outdoor seating is super cute and a ton of options back there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMm9QU3BnRRAB",
            "text": "You order first at this place. I ordered the Healthy One. The black beans were spicy, and the plantain was sweet and yummy. Stirring everything together helped calm the spice and tasted good. I’d go back and order different veggies Al la carts to try the other vegan options. Vegan options were clearly labeled which was nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXa0ltOTJBRRAB",
            "text": "dining here is so fun, i loved the vibe inside and their back patio! my partner and i arrived starving and ordered the full chicken, it was seasoned deliciously and cooked to perfection. so moist and delicious! our favorite side was the mac and cheese, but the roasted veggies and sweet potatoes were great too!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dC11dW1BRRAB",
            "text": "I enjoyed the food and loved the ambience, the plants everywhere were calming and the back yard magical.\nI am not giving 5 stars because of the rude bartender who acted very condescending to me and didn't add my Angostura bitters to my drink. If she doesn't like working where she has to interact with Black people, she should work elsewhere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ejQydjZBRRAB",
            "text": "I loved everything about Risbo. I had the rotisserie chicken. It was so good. Even the breast meat was moist. The deviled eggs were great. Amazing flavor. Enjoyed the Mac and cheese as well as the mashed potatoes. I also had the watermelon rose which was really good. Vibe great, food great. I will definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdzZTbnZ3RRAB",
            "text": "My husband and I moved two months ago to the neighborhood and have been looking for new places around to have a nice dinner and in that searching we found Risbo. It’s an incredible place, the garden is beautiful, it’s easy, casual and feels comfortable. We had the kale salad that was amazing in flavor and quality, the duck, which for my husband was the best duck in many years, the ribs, delicious and the mash potatoes that were also very good. The drinks were also very nice. I would definitely recommend and come back.\n\nPs. The poem about immigration and community made me felt that the dining experience was absolutely worthy and that this restaurant is more than just selling food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbnJUTDhnRRAB",
            "text": "We checked this place out on a pretty steady Friday night. The staff were working like a well oiled machine. You can tell that they really care about the quality of the food that they put out based on their concentration, and it showed in the final product! We got the risbo platter with chicken and the shepherd’s pie bowl. The chicken was so tender and delicious, and everything was well seasoned.\nCheck this place out if you’re looking for casual dining with excellent food!"
        }
    ],
    "reviews_count": 81
}