{
    "name": "Honey Badger",
    "place_id": "ChIJPwg6URNbwokR_YxBHdIupJ8",
    "grid": "BK9",
    "address": "67 Fenimore St, Brooklyn, NY 11225, USA",
    "rating": 4.5,
    "user_ratings_total": 178,
    "phone_number": "(646) 670-0601",
    "reviews": [
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX2RiY19nRRAB",
            "text": "A truly exquisite, unique, and intimate experience. The owners are a couple who run the whole operation themselves, and share with you over a prix fixe menu something they clearly take great pride and joy in. Each course was creative, well-thought out, and motivated by how best to use the season's ingredients.\n\nThe modest portions for each course kept the focus on savoring the experience and had me comfortably satisfied by the end of the meal, without being overly full (an issue I've had with tasting menus elsewhere).\n\nOn the pricier side, this won't be a frequent stop, but I definitely look forward to coming back and seeing what new things they come up with for their ever-changing menu!\n\nHighly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX1pxY2tnRRAB",
            "text": "This is the perfect place if you are looking to experience flavors, textures and ingredients you have never thought of. It is the quality of the food that counts here not the portion size.\n\nAmazing intimate space, with a couple who takes extreme care into their dishes they create. They provide a guided experience through every dish, while making your time feel completely curated to you.\nTheir fall menu  Curry was hands down the best thing I have ever tasted. It even brought a tear to our eye (I am 100% serious)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiN3NlUkt3EAE",
            "text": "I recently dined at Honey Badger in NYC and had quite an unexpected experience. The evening started off well, with a pleasant ambiance and friendly service. However, when my steak arrived, I couldn’t help but notice it had a slightly yellowish tint. I wasn’t sure if this was intentional or a mistake, but it did make me a bit hesitant. The flavor was unusual—definitely not what I expected, though not entirely unpleasant. It was just... different.As if that wasn’t enough to make the night memorable, the dining experience took a whimsical turn when enormous rabbits started to appear in the restaurant! These were not your average bunnies—they were massive and quite the sight to behold. At first, it was amusing, and everyone around seemed entertained. But as the night went on, the rabbits became more adventurous, hopping between tables and occasionally bumping into things.The staff was kind and tried their best to manage the situation, but it was clear they were as surprised as the diners. While the giant rabbits added an element of surprise and humor, it did make it difficult to fully enjoy the meal. Overall, it was an evening I won’t forget anytime soon, but I’m not sure it was quite the dining experience I was looking for"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMDVEelNnEAE",
            "text": "Hidden, literally hidden, in an alley in Brooklyn is one of the most amazing restaurant experiences I have ever had: The Honey Badger - My Noma experience❗️\n\nA chef couple, Fjölla and Juntas, assisted by their friend Rachelle, created an amazing restaurant where they present food that, besides being incredibly delicious, is sourced from amazing local farmers or foraged by themselves from the ocean or local fields. (…Oh, we got that grain from a guy who foraged it using a canoe from a lake in Ohio…)\n\nThe menu is totally Kaiseki, influenced by the local seasons, vegetation, and fauna, and it changes frequently. They even offer a Water Pairing that includes water from a glacier, a maple tree, etc.\n\nThe restaurant has been there for some 9 years. It has won multiple amazing awards but is still affordable and accessible.\n\nThe definition of a hidden gem. 💎💎💎"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OUthNENREAE",
            "text": "Very interesting experience! Proprietor and chef team forages their own ingredients and prepares only the most freshest elements of the season. The serving portions are a bit small but by no means a lack of technique — in fact, the preparations were very complex with each dish that I felt the menu price was extremely value for money for the care and technique required to conceptualize and deliver each dish. I will recommend to anyone who is passionate about wild-to-table / farm-to-table"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NUlyVS1BRRAB",
            "text": "Absolutely amazing experience, this is 100% an adventurous experience. Go in with an open mind and enjoy the ride. Truly fantastic. Can’t speak highly enough about the experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMnAyVUt3EAE",
            "text": "When we each got a check for over 300 dollars, with itemized charges handwritten on a small piece of classic notebook paper, we burst into prolonged laughter. All we had was 4 bitter berries picked from a neighbor’s garden, two tiny slices of raw fish foraged from the Delaware river or something, a tablespoon-sized salad that for all I know could have been the grass picked from the botanical garden nearby, and some dandelion wine that tasted exactly what you think it tastes like.\n\nThis place came in highly recommended from a friend who actually never went there, but whose friends reportedly enjoyed it. So it was I guess our fault for not doing due diligence to learn on what this place is about prior to our visit.\n\nIf you’d like to have a 1 cubic inch slice of an unknown raw fish, a local mushroom that someone found somewhere, and a few sips of fermented dandelion water, and pay 600+ for a party of two (plus tax), this is your spot. Oh, they also didn’t take credit cards or even Venmo. One of us had to go find an ATM to get 700 dollars to cover the price plus tax. The whole thing convinced me this place is a scam.\n\nHighly DO NOT RECOMMEND. Unless you want to intentionally spend  that kind of money on the experience I just described. You can experience a lot of great dining for 700 elsewhere in NYC that will make your palate go wild, and not just your mind."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqOTdhWndnRRAB",
            "text": "This has been quite possibly the most extraordinary dining experience I've had in NY in half a decade. I can't speak highly enough of the small, passionate team creating a wild-for aged, multi-sensory, humanistic, and narratively rich haute cuisine experience.\n\nEvery moment of this meal was an adventure for me. Across 11 courses and even water pairings, I ate my way across the ecosystems of the New York region in a way I never imagined before. I am altered by my time here at Honey Badger!\n\nDelicious, and unlike any other restaurant in the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOW9YZ1lBEAE",
            "text": "If you are the least bit interested in noma and it's techniques, Honey Badger will delight you and teach you about local foraging possibilities. I came from central Connecticut just to have my birthday dinner here, and my expectations were exceeded. As an amateur forager, I expected to see some familiar items I use already, but everything I ate was new (and has inspired my home cooking). Each dish packed a flavor punch and when finished I felt pleasantly full, and not overful. Every dish is beautifully and creatively presented, usually on natural materials such as rocks or shells. The menu changes constantly and if I could afford to, I would try every new rotation as I would love to taste what these inspiring chefs create next."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNHRhV1Z3EAE",
            "text": "Want a dining experience that You will remember for the rest of your life… one you might tell your grandkids about? Are You adventurous with Food? Well no matter how many chocolate covered ants  or Fugu Soup or even if You have tried that Kopi Lewak coffee, You haven’t seen anything like Honey Badger!! Unique, ingenious, brave and breathtaking is how I would describe a meal\nHere! Not your typical joint and not for the Cracker Barrel & Long John Silvers crowd.\nAnd doesn’t hurt its owner and operated by the most amazing Family. A must for any adventurous and experienced Foodie.\nEnjoy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMFlLMGN3EAE",
            "text": "Never had before North Eastern Pink Shrimp Caviar, a sensation unlike any other!\nPrepare to be dazzled by the exceptional flavors and textures of this rare delicacy. Each dish is meticulously crafted to deliver an unforgettable dining experience that will leave you utterly captivated. You're in for a treat as you savor every moment of this culinary masterpiece! This place is not for those who are not adventurous and ready for things they never had before.\nLove it love it love it!!!😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREa1pQS3NnRRAB",
            "text": "First time we visited Honey Badger - a most unusual dinner, eating anything nature in the Northeast has to offer.\nBring a lot of time, get surprised by the menu and engage in a culinary conversation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dzdYX09nEAE",
            "text": "Such an authentic, delightful, unpretentious-but-exquisitely-elevated fine dining experience. From the elegant and creative plating to the design-forward decor and intimate setting, every detail of the restaurant and experience was so thoughtfully curated. The service was sublime and friendly, and the chef is truly on another level with innovative food that doesn't follow trends, but instead follows seasons and pays reverence to the bounty of nature. I can't wait to come back for every seasonal menu. I'm also so grateful that this neighborhood has the privilege of being graces by such a unique establishment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5akpXMVdBEAE",
            "text": "It was the best food experience I’ve had. The menu was unique, a real wild experience. You have to have an open mind, if you allow them they will rock your taste buds. Worth the price."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0eHBUR3hRRRAB",
            "text": "As a 200$ fine dining\nService is poor - only food intro and water filling, won’t change utensils\nFood quantity - every dish is 1 bite size, none of us felt slightly filled\nIngredient - mushroom/fish/duck egg/blue crabs from upstate NY/MA and other nearby states, nothing of either quality or rarity worth the price\nDecorate/furniture - cheap wood and cement everywhere, a farm house will have better ones. utensils like from 1$ shops, wood like but may not from real wood for the foam weight, and full of scratches dents.\nKitchen - whole restaurant is a studio, no separate of ‘kitchen’ and dining tables. Noise from dropping items, oil, smoke all over. No matter why they don’t even have proper fire and stove in the kitchen.\n\nThe whole experience is like a scam, didn’t feel a bit of honesty and diligence from either the chef or the hostess. Saw the other good reviews here, not sure why we had this completely different. Waste of time and money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOeHUzanJRRRAB",
            "text": "An amazing and unexpected experience. Exceptional quality and delightful setting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaXZ5WFJ3EAE",
            "text": "Definitely a very interesting restaurant. I loved the space and the hospitality of the owners. The ingredients to the meal were unique in that a lot is foraged or you wouldn’t find elsewhere. The presentation and dinner ware were pretty. But beyond that novelty, the flavors weren’t really there. I wowed at the cool ingredients but not really at the taste. The utensils given were also not adequate to eat the meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc2FLNjBBRRAB",
            "text": "This is the place you want to write home about! And without question, one of New York City’s most unique dining experiences!  I’ve been back multiple times and am consistently amazed by the creativity of dishes, quality of food, and knowledge of the chef / serving duo. To top it off, the customer service here makes you feel more like a friend or family, than a customer. They also cater events which is fantastic to know! I cannot say enough good about this place.  You just have to go for yourself! Honey Badger is 11/10 in my book!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxM0lpVXRnRRAB",
            "text": "Honey Badger is a culinary gem , from the moment you step inside, you are transported into a world where gastronomy meets artistry, and every dish tells a story. Offering an extraordinary “wild to table” experience, this establishment has undoubtedly set a new standard for fine dining.\n\nWhat truly sets Honey Badger apart is their unwavering commitment to surprise and delight. The whole experience unfolds like a carefully choreographed performance, where each dish is presented with an air of anticipation, inviting guests to immerse themselves in the culinary journey."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxak56MEpREAE",
            "text": "Experience the wild & feed your inner beast with every dish on the menu. My girlfriend loves the Bone Marrow ice cream. Words can't describe but here are a few.. Aromatic, Delicious, Flavorful, Mouth-watering, Nutritious, Satisfying, Savory, Tasty, Appetizing, Delectable, Saccharine!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOUtfSC1RRRAB",
            "text": "Junayd and Fjola are truly artists dedicated to their craft. Honey Badger isn’t just a restaurant, it’s a curated experience, and you truly feel their passion and care in every course they present. It’s special & unique without feeling pretentious. I cannot say enough about the warmth and welcoming atmosphere they have created. Go to Honey Badger for the food, stay for the people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdE5ma09BEAE",
            "text": "Special occasions are happiest when spent in a local near by restaurant.   Having Honeybadger so close has spoiled us on us on thinking that this place is normal but it’s anything but, Fjolla and Junayd go above and beyond to create Nights that me and my family will always hold dear."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWMjVXOFBnEAE",
            "text": "I highly recommend this dining experience to all the adventurous eaters. Everything in this establishment was put together with such thought and detail; from the decor to the plates and cutlery to menu. You can taste the the love and passion behind every bite and sip. It is truly amazing how much flavor they can pack in a bite of food. If you are looking for a truly unique journey for your tastebuds, I urge you to give Honey Badger a try. You won’t be disappointed! Extra bonus- the owners are really down to earth and you can feel their heart and soul the moment you walk into this place."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNac3IybGpnRRAB",
            "text": "A restaurant for the adventurous foodie, like Aska’s indie counterpart. Super interesting meal. While the cooking is less refined than Aska, the ingredients are more outlandish. Honey Badger feels more worth it than many of the “standard” fine dining options at this price range.\n\nThe tasting menu explores the flora and fauna native to the Northeast, many gathered from foraging. It changes throughout the year depending on the season. The restaurant will tell you at the time of booking—mine focused on fish.\n\nI do wish we can order drinks by the glass. I don’t care much for wine, but the cocktails and homemade ferments were wonderful.\n\nIt’s incredible that this whole operation is run by two people.\n\nP.S. I can’t upload the pastry dish because Google thinks the picture is inappropriate. It’s a croissant with scallop puree and baby shiner fish."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbGNDM3NRRRAB",
            "text": "One of the most interesting meals I’ve ever had & we go to a lot of interesting restaurants & eat pretty much anything. I loved it - I’m a bored foodie & this place excited me. The place is really small but cozy & beautifully decorated. The chef-proprietors serve you themselves & know a lot about each dish. I learned new things to add to my food repertoire here - excited to come back for other seasons! (We ate here late June/early July for reference)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c19QT3lnRRAB",
            "text": "I dined at Honey Badger last night with my most sybaritic friend, and neither of us will soon forget it. New York is full delicious things to eat, but I can't remember the last time I was so surprised, delighted, and actually revitalized by a meal. We came for the \"spawning season\" dinner, and tasted so many things we had never eaten before. Bright green slippery elm seeds that tingled like szechuan peppercorns, tiny hot pink flowers from american redbud trees, spruce tips, the crowns of angelica trees served under a glass bell jar in a mist of hickory smoke, cordyceps coiled like noodles in a savory dashi broth -- bright bursts of wild flavor accompanying extremely fresh fish and shellfish (moon snails, slipper snails!) This is food for thought, and thoughtful food: chef Junayd Juman, working on his own in the open kitchen, has incredible technical skills and creativity, and his confident preparations of foraged, fermented, and hyper-fresh ingredients stage these amazing flavor choreographies, I don't know how else to describe it. His partner Fjölla Sheholi is an enthusiastic and knowledgeable guide to not only the components of each dish, but also their cultural and ecological contexts.\nI could go on, because this place is really special. It's also unlike any other \"fine dining\" restaurant I've been to. An exquisitely elegant meal, but served in a space that feels as personal and welcoming as a family home; a series of delicate small plates, minimalist and artful and yes instagrammable, but also nourishing. It's the kind of food that leaves you feeling glad that you're alive, and more curious and hopeful about the world and its possibilities."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bGNteDZnRRAB",
            "text": "it was without a doubt, the best meal I have ever had. the thoughtfulness and kindness that goes into this meal is unmatched in any high-dining experience I've had. we enjoyed a spring menu with a water and cocktail pairing. every single bite and plate was a delight."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwMGN2bV93RRAB",
            "text": "Table and Tableware was extremely sticky. Not hygienic place. Food portion was very small."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNzdYMUJnEAE",
            "text": "The course menu was amazing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobnMtSkdnEAE",
            "text": "My boyfriend took me to Honey Badger last night and proposed! They went out of their way to make it a special night for me. I am very thankful! Highly, highly recommended…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbGR5TFpBEAE",
            "text": "My favorite fine dining experience in Brooklyn"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1OEtHNjBnRRAB",
            "text": "Unique experience, with an amazing family behind!  Highly recommended!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNE9lSUtBEAE",
            "text": "There are not enough superlatives in the world to describe how exquisite this meal was. We’re vegetarian (we let them know ahead of time), and the restaurant went out of their way to prepare a meal that rivaled that of our omnivorous table mates. The care with which the food is prepared— the passion with which it was presented— the detailed explanations of each dish… superb. We’ve never had a meal so unique, beautiful, and tasty before, and likely never will again. Five stars, five stars, five stars!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMHYtekxBEAE",
            "text": "One of the tastiest and definitely most thought provoking meals I've ever had. The flower blew our minds and the ramp kimchi mussels packed an incredible umami punch. Best of all though was Fiola, our tour guide through this hidden world of flavor and care. She is radiant with passion and love for the food their tiny kitchen prepares. I recommend doing the drink pairing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHMTlpc0lBEAE",
            "text": "This is honestly the coolest/best dining experience I’ve had since moving to NYC 8 years ago. The attention to detail, and robust flavors are something out of this world. If you have the coins, spend them here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHbllIZFN3EAE",
            "text": "Delicious tasting menu! Perfect for a special occasion and to try new foods. Plus, the little outdoor cabins are so sweet and romantic. Fine dining without any stuffiness."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcHBqRndBRRAB",
            "text": "I can’t find the words to describe this place and the experience.\n\nIt takes me over three hours to get there and back and I’ve been there more times than I can remember.\n\nThe owners are extraordinary people!\n\nYou have to experience it yourself to believe it.  No review can prepare you for it!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHakpHd1RnEAE",
            "text": "This was a truly unforgettable meal, and I could not recommend it more! Frankly, it was probably the best meal we've ever had. The whole experience was so special and I can't think of anywhere else in the world you could have a meal like this.\n\nWithin minutes of sitting down Junayd and Fjolla felt like old friends. They made us feel so welcome. With each dish they brought us we heard stories of how the food was gathered and prepared. They were responsive and friendly towards the many questions we asked.\n\nWe had a total of 11 courses and 4 drink pairings, each of which presented us with ingredients, flavors, and experiences we had never had before. From hickory smoked acorn cheese to lobster of the woods, all of the dishes were incredibly seasonal. You could tell that great care and consideration was put into crafting each one.\n\nI highly recommend making a reservation here. For some folks the price may be too high, but I encourage you to give it a try for a special occasion. Bring someone you really care about and you won't regret the experience.\n\nThank you again Junayd and Fjolla! We'll be back as soon as we can..."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2djlISjd3RRAB",
            "text": "The food and service was very good. Definitely a culinary experience but the 3 stars is based on value. We paid $1200  for 4 people which seemed grossly overpriced."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2c2M2Tzl3RRAB",
            "text": "Amazing!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2MGJPSkxBEAE",
            "text": "So this 4 star review is based on the value of what is delivered rather than its quality. We went to dinner and had a very good evening, the food was delicious, the people kind and attentive and our quirky outdoor hut perhaps not super comfortable but whimsical and \"an experience\". We had the prix fix plus drinks pairings and spent about $700 for two people... The food portion came in under $200 per person, which felt like a lot but not obscene... The drinks pairing at $80 for two glasses of wine (good but in the $20/bottle retail category) and two home made drinks felt like more of a stretch...\n\nAgain, great everything but the $700 doesn't quite fit what is being delivered"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2czZDZlZREAE",
            "text": "Beyond delicious! Overwhelmed by their hospitality. Definitely going back!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhXy0yR09REAE",
            "text": "Amidst the backdrop of Hurricane Henri, our group of five were blown away, not by the wind and rain, but by the incredible experience we had at Honey Badger (HB). We had our own quaint outdoor chalet complete with music, fan, air purifier, plexiglass windows and tree branches weaved into the ceiling that miraculously kept us dry despite the record breaking deluge outside our little sanctuary.\n\nI arrived without reading reviews or descriptions of the cuisine. I was only told Brooklyn and “wild-to-table” so I was intrigued, yet a bit wary. If your expectations are set for large portions or a formal Michelin-star experience, then HB may not be your jam. I’ve enjoyed many meals at those restaurants, but they are like the symphony of fine dining, whereas HB has the flare and improvisation of a jazz performance - both are amazing in their own way.\n\nHusband and wife team Junayd Juman and Fjolla Sheholli immediately set the tone with their warmth, enthusiasm, knowledge and what they described as a palate “opener.” The spilanthes flower bud had us all wondering what could possibly come next as our salivary glands kicked into overdrive. The sensation was so novel that I delayed eating the other parts of the amuse-bouche to let the party in my mouth continue for a few minutes longer.\n\nWe were delighted by what seemed like a torrent of a dozen different courses that included Montauk oysters underneath a glass dome filled with juniper smoke that filled our cabin parklet with a lovely aroma when unveiled. We also had acorn cheese with wild berries, cucumbers and olive oil made by Fjolla’s family, seaweed taco, scallop carpaccio underneath squash blossom, truffle with mushroom, squid, sea bass, egg from traveling chickens and many other unique and wild ingredients combined in a bold, yet delightful way. The pace was never too slow and at times, it was the opposite as several courses were presented in unison. My description doesn’t do the cuisine justice as my mind was racing to keep up with the flurry of new items we were introduced to. Even with a menu, it would be impossible for me to fully appreciate the thought and creativity weaved into every dish.\n\nHB has built a loyal network of local foragers and fisherman who drop off their discoveries to create daily surprises that are then deftly prepared at HB. This is where Fjolla’s childhood in Kosovo, Junayd’s Trinidadian heritage, their exposure to Italian, French and Asian cuisine, their expanding knowledge of techniques and recipes forgotten or lost over the generations are all combined with wild ingredients, some of which are preserved and stored at HB, to create a truly inspired and memorable dining experience.\n\nSomehow Fjolla & Junayd found plenty of time to talk with us despite being a team of 3!?! at the restaurant. I can’t forget their daughter Nina who played DJ for the night. They regaled us with their love of the virtues and health benefits of wild ingredients, as well their efforts to support their local Brooklyn community - they  rallied neighbors and farmers to prepare meals for 60+ elderly members of the community that were literally starving during the depths of the pandemic.\n\nWhat an incredible team who are innovating, and yet humble as they are constantly learning about the infinite treasures nature offers. They also maintain a boundless optimism and energy despite the pandemic headwinds that no doubt have impacted them as well, but they somehow turn it all into a positive. If it hasn’t happened already, it’s only a matter of time before New Yorkers, and people in the US and abroad, are clamoring to experience the magic and movement Fjolla and Junayd are creating at Honey Badger that leaves a positive impression that lasts far beyond the few hours spent at the restaurant.\n\nEverything about HB is special. I can’t wait to return to support this under the radar gem. As if on cue at the end of our experience, two mushrooms opened up just outside our parklet, although I’m not sure they were the edible type ; ) Oh, the wonders of nature!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMlBtN05REAE",
            "text": "Lovely and interesting tasting menu. Good service. Unique ingredients and tasting experience. Will come back again 💯."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLOTlqbENBEAE",
            "text": "My experience here will stay with me for the rest of my life. I actually mean that.\nI am not a foodie-type person, and never spend money on food. If it’s healthy, I will eat it. Food as fuel is my general approach. But I went there a year and a half ago to have meat for the first time in my life (since being a lifetime vegetarian), as a sort of sacred ritual to initiate this new phase of my experience, and it was honestly mind-blowing for me.\n\nI took it slow, the whole thing lasted 4 hours, my eyes were closed much of the time, and honestly the plants and animals I gratefully took into my body that night put me into a deeply altered state. I have friends that just went for the first time recently, and they confirmed my experience. They, too, found themselves in an altered state.\n\nI recently went back with my family, and had an amazing time. Their outdoor structures during covid are something you really just have to see for yourself to understand how much attention and creativity they put into every aspect of what they do.\n\nThese are generous people, who really care about and live what they share through their food experience. When you go, you are supporting a wonderful family, an ecosystem, and a network of foragers, hunters, and others who put restoration of local ecosystems first.\n\nI highly recommend this place if you are looking for something really special. When you go, I would recommend thinking of it not as a meal, but as a sacred experience of communion with life."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLbFoyZEZREAE",
            "text": "Oh my stars. Five of them, take them all. I took three dear friends here, and I must say we were absolutely not aware of the experience we were getting into, I just remember being intrigued by the ambiguity and had wanted to come for a while. Well, I just had probably the most amazing culinary experience ever, and it was a 7 minute walk from my apartment in Lefferts Gardens (how did I not come here yet?!). This city never ceases to amaze me. The outdoor structures they’ve built are so beautiful and private and very safe, and we embarked on a multi course sensory experience, and opted to do a drink pairing, and our minds and tastebuds were blown. This is forest to table, forage to table, wild to table realness. Everything is foraged from the North East and everything is so complex yet so simply presented. Everything had intention and love in it. The bill was not cheap, but I was so happy to invest in this beautiful experience run by the most loving, passionate, and hard working couple. Don’t come hungry (small portions), but come curious (each dish is out of this world and unique). Perfect for a romantic date, celebration, or dressing the f*ck up and treating yourself to something transcendent. I love this city, and I love Honey Badger."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaFppMVlREAE",
            "text": "Wow, truly incredible experience. Service was perfectly paced and the food was some of the most inventive delicious bites I’ve had in NYC in a lot of years. It’s adventurous in the best way."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5dElxQ3lRRRAB",
            "text": "Lovely people running this place and, wow, what an experience. The tasting menu is high budget but felt worth it for such a special, unique experience. I’ve never eaten or tasted such things before and am amazed by the things they put before us."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bnF2NXVnRRAB",
            "text": "Very bite was a delight and surprise. Great service and the cabins were perfect for a winter romantic meal."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTNjhmaXZ3RRAB",
            "text": "One of the best restaurant experiences we’ve ever had. Each dish was so unique, thoughtful, and delicious. Their dedication to local ingredients is admirable. The service was also impeccable and personal. Highly recommend!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVM2FDN2RBEAE",
            "text": "This was by far the coolest place I have been to. I got the Omakase and the wine pairing, I was excited with each dish that came out and never wanted to leave. Everything was delicious and had an interesting background that was shared with…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwLUkySFF3EAE",
            "text": "I went to Honey Badger because I was looking for good quality wild to table food near me, and I was trully impressed. Not only the food is outstanding, like nothing I have ever tried before, but also every plate comes with a story of where…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzam9qZWFnEAE",
            "text": "Amazing place to have dinner. The owners are special people and you would do well to say hello and hear their amazing story about the restaurant and the food. The dinner uses the freshest and most interesting ingredients. The prix fix is a…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRN2VfU19RRRAB",
            "text": "This is truly a hidden gem in the neighborhood! Honey Badger has become one of my favorite restaurants in NYC and probably the most unique restaurant I have ever been to.\nThe food at Honey Badger is made with the utmost care, and the owners Fjolla and Junayd have their own foragers and hunters that bring them quality vegetables and meats that have been killed and raised humanely.\nThe menu is constantly changing and I have tried a hugely varied array of different dishes: octopus, guinea foul, ostrich, etc. These dishes may sound strange, but they are truly exquisite.\nAny person that cares about eating well and enjoying food MUST try Honey Badger. It truly is like no other!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdzVfbV9nRRAB",
            "text": "Hidden spot next to Prospect Park. It reminded me of Sleep no More theater experience, when you are discovering secret dishes and ingredients. A very small and unique restaurant, that will pleasantly surprise you with every meal. Opened…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjOHBLTF9BRRAB",
            "text": "The take home boxes they started selling since quarantine are a must. Definitely grab the rainbow trout and the duck legs when available. Great people on top of all of that. I cant wait to see what they create once all of the restaurants re-open"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTbnFIMzJRRRAB",
            "text": "It wasn’t looking like a great Christmas. Unable to visit my family for the first time in my life and in a city I’ve only called home for two years, things seemed foreign despite their familiarity. Presents didn’t arrive on time. Zoom didn’t replace family time. It was a bleak end to a bleak year.\n\nThen, on the 26th, I had the opportunity to take solace at Honey Badger. My partner and I were warmly ushered into a cabinesque structure lining the street in front of their establishment. On a silk curtain strung across the restaurant’s windows played classic movies featuring New York skylines not seen since our grandparent’s generation. Our feet and cabin were warmed quickly by the provided heaters.\n\nNo sooner had we sat down when our waiter, who also happened to own the restaurant along with his amazing partner and their daughter, brought us a pallet cleanser that was aptly described as wild; the spilanthes plant. Used by Native Americans to cure toothaches, the plant has a mild anesthetic effect, almost like a tingle on your tongue. The curiosity of this plant was a foreshadowing of the delights to follow.\n\nEach course we had built upon the last. Inside our well-built yet makeshift abode, we dined on roast duck, oysters, fish baked in coconuts, and chestnut soup.\n\nI’m a simple guy. A home cook meal is almost always preferred to a fine dining establishment. And yet the meal spoke to me in a way I’ve never experienced.\n\nPerhaps it is because I’m an aspiring outdoorsman (and because Honey Badger sources everything from local foragers and farms). Perhaps it's because it's Christmas. Whatever the reason, somehow, sitting in that tiny little cabin with my gorgeous girlfriend, having carefully constructed course after course described in elegant details made this stranger in a strange land feel like he was home, if only for a meal."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpOGNxMWtnRRAB",
            "text": "Best-kept secret in Brooklyn. The service is exceptional, the ambience is so warm, and the food is so creative and delicious. True attention to every detail down to the antique flatware.  They added cozy little personal lodges for safe dining that are the cutest solution I have seen in BK."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjMTR1ejNBRRAB",
            "text": "I just received a most incredible CSA box from Honey Badger restaurant that included beautiful ingredients – Japanese knotweed, chickweed, Tuscan Kale, artisan potato chips, eggs, local honey and yellow broccoli flowers among other things.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvd2N2NVNBEAE",
            "text": "Really enjoyed my experience here. The food was of course delicious and very unique but my favorite part of the experience was the passion and complete enjoyment coming from the owners. They love what they do and the energy coming from them was contagious! I highly recommend this place and will be back with friends and family."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3M2JxM3ZRRRAB",
            "text": "Omg, what an incredible gem! Fjolla brings foraged magic to the table, a commitment to presenting food that’s in season and wild. Food was gorgeous, tasted delicious, and warm gracious hosting."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3N2JiZEx3EAE",
            "text": "Very interesting spot on Flatbush with a farm&wild-to-table concept. The menu changes every few days so can't recommend a dish in particular, but the tea and ravioli we had was amazing."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBLWRmOUx3EAE",
            "text": "A “Wild To Table” experience, intimate connection to the north east.  Omakase is based on short season ingredients."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4bnJESFVREAE",
            "text": "I discovered this gem after recently moving into the neighborhood. I have been twice so far and will definitely make this my upscale treat that I will frequent with friends and family regularly. The outdoor space that they have set up this summer is unique, cool, chic and comfortable. The food! An eclectic delicious adventure. It is clear that every ingredient is carefully chosen including the herbs, vegetables, and condiments. The summer salad is a favorite that is so fresh and crisp with flavors of organic greens, tomatoes, mozzarella and rare cucumbers drizzled with homemade dressing. A simple dish yet so delightfully exquisite. Everything tastes amazing. The star of the menu in my view however is the pasta! The owner makes fresh pasta daily! I had a simple spaghetti pasta with octopus, olive oil, herbs, sun dried tomatoes. Absolutely fantastic. I woke up the next morning wanting it! This restaurant is an experience. Lots of unique wines as well. Go with someone you love. The energy is beautiful and your palette will be delighted. I guarantee it!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMUtfYldREAE",
            "text": "Hand down the most interesting, exciting, and delicious eating experience I've ever had. Every time I tried a dish, I wish I had a bucket full of that food! But then they brought out the next dish which ignited my taste buds in an entirely new and refreshing way (but if I had to choose, my favorite dish would be the scallops with sea truffle...like, wow!). The atmosphere is insanely cool; the best way I can describe it is \"upscale lumberjack.\" Our waitress was lovely, incredibly articulate and brilliant, readily providing answers to our endless questions. My dinner at the honey badger was absolutely unforgettable, I can't wait to go back!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDeGZEeFRnEAE",
            "text": "Unique and rustic experience. Decent food, and creative atmosphere with the outdoor dining ambience / woodsy atmosphere. Friendly and energetic owner and staff (albeit, needs more training). You can feel the effort and thought put into the experience.\n\nThe details and execution is where things start to fall short, which is critical if they want to elevate into an experience that commands the price point at $450+ for 3. We arrived at our table with broken acorns and debris on the seats. 2 of 3 napkins were dirty with visible stains all over. We waited 10-15 min before anyone came over to introduce and explain anything. When they did, it was a confusing explanation about drinks and what was available and they did not reconfirm allergies at the table (which later led to bringing out food that one in the party couldn't eat). Wood structure was cute, but need to remove labels/tags still sticking on them as those cheapen the look. Ingredients were all pretty interesting, but none seemed to really justify the price. Finally, cash or venmo payment was a complete surprise at the end and should have been mentioned upfront. Frankly, it felt almost too casual/hip to pay half a grand via venmo (not to mention the credit card points that we couldn't get from this meal).\n\nAll in all, it was decent and promising experience, good for a 'cool' weekend meal, but it has a lot of kinks to work out before it can be truly a special and elevated experience."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvbk0zc1lnEAE",
            "text": "AMAZING restaurant in Brooklyn! I was absolutely thrilled with my evening here! The 7 course tasting menu was the perfect combination of art, innovation, and deliciousness! They accommodated me as a vegetarian (and my foodie guest was just…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvcU1DQVBnEAE",
            "text": "Honey Badger is, without a doubt, the most innovative restaurant I've been to in my 64+ years on this planet. I've lived in NYC for almost all of my life and have been to many great restaurants here, around the U.S. and overseas, but Honey Badger is one of a kind.\nTo begin with, the restaurant is the creation of a husband and wife team who built the space from scratch in a storefront on Fenimore St (right off Flatbush Ave). The physical space is both intimate and enchanting - totally unique - unlike the \"cookie cutter\" approach one tends to see in every \"hip\" restaurant in Brooklyn these days. All the details were conceived and executed by them; even the \"background\" music is tasteful and just perfect.\nWhat about the food? It's almost beyond belief. They source all their ingredients through a network of foragers and hunters. There's no factory farmed anything here. Everything they prepare has been obtained in the most ethical manner possible - by environmentally conscious people who work with nature instead of ravaging it.\nWhat they do with the raw materials is almost beyond belief and without precedent. I've never eaten more creative and delicious dishes prepared in a way that will absolutely blow your mind. It's like magic; some sort of alchemy!\nI absolutely recommend doing the tasting menu when you come here. Allow yourself at least 2-3 hours to fully appreciate the experience. The menu changes every night (depending on what they've received), but I would just go with whatever they're offering. You won't be sorry."
        }
    ],
    "reviews_count": 68
}