{
    "name": "gertrude’s",
    "place_id": "ChIJnRyRtUBbwokR4veV9Er_PAU",
    "grid": "BK9",
    "address": "605 Carlton Ave, Brooklyn, NY 11238, USA",
    "rating": 4.5,
    "user_ratings_total": 410,
    "phone_number": "(718) 269-0043",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdFYyMUhjV2hJUmpkYU0yOXJTMEZuTTJORFYzYxAB",
            "text": "Latkes were good, but very tiny for the price (a little larger than a quarter). Bagels were not great compared to other bagels in the area. Gluten free options were very limited. We also had to remind service to bring out a side and coffee drink they forgot. My French toast babka was just fine and only came with 3 little slices of strawberry. This place is pretty expensive for brunch in the area and overall was kinda disappointed"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205T1QxZE1kbWxVYjBoMU4xOXROWG80VW5wRVlsRRAB",
            "text": "Came in on Sunday for brunch, and was disappointed with the execution of the food. Have always been a fan of Gertie’s so was very excited to try out Gertrude’s, but it felt like the brunch rush really impacted the quality of the food. We started off strong with latkes & cinnamon sticks, but when the mains came out, we were kind of surprised. The bagels were cold and not toasted, and seemed like the smear was lacking. My friend got the hash, which was also skimping on meat, and some potatoes were undercooked. Wanted to love this place but not sure I’ll be back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xweVNVWlJla3h0T0U5RllrUmxXVGRoVUUxelYwRRAB",
            "text": "I ate here with friends September 27th of 2025 for the first time. The place is clean and it's a nice restaurant. Unfortunately I have a pepper allergy, I can have black pepper but not pepper the vegetable, chili pepper, things like bay seasoning which I told the server when ordering. I got the latkes and trout, had an allergic reaction, and was sick for three weeks. It's just such a miserable experience for me and has happened twice in the last five years, here and at a Super Bowl party. I'm leaving five stars because I don't like bashing businesses and I would highly encourage you to chance your processes so this doesn't happen to other patrons. Something as simple as a small red flag attached to a toothpick with the allergy written on it (which they have at some other restaurants) could make such a difference for someone."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsZmVXeERSbTl6TTNSWldrWmlaV2RJYVhaVGIzYxAB",
            "text": "Gertrude’s is the kind of place that quietly wins you over from the moment you walk in, it’s cozy, elegant, and effortlessly welcoming. The space has that signature Brooklyn charm: lively but relaxed, with a sense of care in every detail. The menu strikes a beautiful balance between comfort and sophistication, fresh, seasonal dishes that feel both homey and refined. Service is warm without being overbearing, making the visit feel personal. Gertrude’s is where you go when you want a meal that feels special, but never pretentious, a true neighborhood gem. Travelled all the way from LES!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUVZXTnNabGxoWXkxVFkwVkZjMDA1VW5oUVgyYxAB",
            "text": "We had one of the best dinners ever at this restaurant, thanks to the exceptional bartenders Allie and Karla. Their recommendations for both food and drinks were spot-on. I can’t wait to return and explore more of their drinks and food! (The layer cake was INSANE)"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdFQzRTVURk5WY20xeFJ6bEtiRVphT1Rkc1gwRRAB",
            "text": "Had a lovely dinner here. Drinks were perfect, food was yummy and in good portions. The staff was great, particularly in getting creative regarding a workaround for a food allergy."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210blVHdE5WbTV6UjBsbVFXWlpaV1pvUWs1S2JFRRAB",
            "text": "Went here for brunch and was greatly disappointed as I had read so many glowing reviews of this place. It's kind of comically expensive for what you are actually ordering.\n\nFirst we had three mini-Latkas for $21, which were served without apple sauce (whats the point?) Even at the absurdly overpriced Kat's Deli, you could get twice as many Latkas for just $16.\n\nThen we ordered the Rueben Burger and the Brisket Hash. The hash was dry and I was hard pressed to tell you where the meat was. Felt like a scam for $30. The burger was good but nothing to write home about.\n\nI also ordered one iced tea.\n\nAfter tip our meal came out to $105. Which, frankly, made me feel like I had been shaken upside down until all the change had fallen out my pockets. Even by Brooklyn standards, this felt especially egregious for what was essentially Deli food.\n\nI know I shouldn't judge a restaurant off of their brunch, but it would take a lot of convincing to come back here for dinner."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKV2RrczVWbFpKV2xaQlZURjZTRlZtVkZOcVZXYxAB",
            "text": "Came here last night, long weekend, on the early side around 7. There was no one in line and a lot of empty tables and seats around, but the white male host said the wait for 2 would be 45 minutes. While I can’t say for sure it was racially…"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMGV2a1Z3EAE",
            "text": "Was okay"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkb2EwRkJYMVZ4VFZoS2FDMDRiRVV6UlZsV05rRRAB",
            "text": "We had brunch here with my friends and not a single item we ordered was satisfying. Besides, they can’t make poached eggs so we ordered soft boiled but apparently they can’t even serve them warm. Not coming back."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210aFlUWkZkWEZPZG1wdE1tcHVXVlE1U1d0c1NVRRAB",
            "text": "All the compliments written about this restaurant are deserved. This place delivers on quality without charging luxury prices. Employees provided warm service and answered everything with good cheer. The restaurant delivers on location, service quality, and price fairness. This spot delivers excellent service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UlptWlpObTVwVGtVeFZVVk9Nazk0UVhSVFFtYxAB",
            "text": "Excellent flavors, nicely presented and quick serving"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ak5UYzNNMlIyV1hGRWFuWlBWbTgyTVVZdE5GRRAB",
            "text": "My partner and I popped by on a Saturday brunch time without a reservation & was able to be sat in about 20 minutes (took a little walk of the surrounding blocks). Food was absolutely incredible, no complaints. I had the Babke French Toast, very sweet and filling. My partner destroyed the Big Nosh. Prices are decent for the amount of food.\n\nThe outdoor seating was quite uncomfortable, seating on a slant with tables propped on little levels. Additionally, they seemed a little short staffed for a busy weekend hour. The service, while all incredibly nice and accommodating, was quite sporadic in timing (all different wait staff, hard to pin down when ready to pay check)."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205QmJIaFZXbGs1ZWtrMWNUaHRjREpQWWpkVE4zYxAB",
            "text": "I love gertrude’s. I’ve recommended this restaurant to a bunch of folks, locals and out-of-towners. They have a great happy hour deal, $10 martinis. Their fries are perfectly crispy. And their black and white cake is my favorite, I literally dream about it.\n\nHowever, today, I noticed the inconsistencies with this restaurant. Sometimes gertrude’s is the best, and sometimes it is only okay.\n\nI’ve been served burgers that were too rare and too salty. My partner always orders it without cheese, and we’ve had to send it back a few different times. Most servers are nice, and one was rude enough to leave a bitter taste.\n\nAll in all, this place is great, but only sometimes. Come for the happy hour and the cake, but don’t expect much else."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sck4zaG5ZMWxKYlRsR1JVNXZjakpZWmxSbWQxRRAB",
            "text": "Absolutely delicious and they can safely accommodate GF options"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sck5UVktOazlvUWxWeFpWSXlRVFI0VDFSNlRWRRAB",
            "text": "Great local spot for good dining and cocktails. Highly recommend - the staff was super accommodating with our stroller."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVFZVa3hla2N4VUhSa0xWbFZTMDVoYUZFM1ZXYxAB",
            "text": "Great spot in Prospect Heights with a cozy atmosphere! The burger was juicy, and the latkes were crisp. I also enjoyed the Black & White Seven layer cake which was rich without being too heavy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SME0zWk9MVmRrZVVWMlRIcEdWVTgxU0VOTFpHYxAB",
            "text": "Delicious meal! I recommend the pre fixe menu. Great service, fun atmosphere, and wonderful drinks."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWlQxQlpkSFpST0dKeGNVUmZNVVZTWkdSZmMwRRAB",
            "text": "prospect heights staple. leafy salad, chicken, martini!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xd1EwcFpVRXBaYkVsdGJGVlJRVTVWYlRrNVRFRRAB",
            "text": "Gertrudes is our go-to brunch spot for hosting visitors. Do yourself a favor & order to share The Best Catch, Brisket Hash, Pickle Plate & some Latkes.. then Babka French Toast for dessert. Thank us later! The Borscht Bloody & Port Tonic…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oc1ZqQmlaRFJMUWxrNFNsQlBkRzlHTmxWelQzYxAB",
            "text": "Came here Friday night with a bunch of friends and it was really great. We got oysters and a whole platter of different smoked fish and all sorts of stuff and it was just really an amazing way to spend happy hour right before dinner. The food was great. The service was great. The drinks were awesome and I would highly recommend this place to anyone looking for some great drinks and great bites in Brooklyn."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMlJYa3dXRVpwWVRZd09VMDNTMWxEUjAxZlJFRRAB",
            "text": "One of the most pleasurable dining experiences I’ve had in Brooklyn, perhaps the US. I was seated for my reservation at the bar with no fuss before my friend arrived, and was greeted promptly. I had a white Americano to start and it was a perfect pre-meal cocktail. Friend that I was dining with got the chicken with their perfect shoestring fries and I got the burger with dressed latkes. Everything was excellent. Price was reasonable. We had a blast."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWmREaHlkemxMTURad1FVdzRSV2RoVUU1NllrRRAB",
            "text": "the best part of this experience was the bathroom.\n\nfood was quite lousy/mediocre/subpar. the bagel felt like it was from a package. french toast definitely frozen. the bloody mary was mislabeled. the space itself is cool. server was kind of miserable.\n\ncardinal sin - bad bagel.\n\nfood so salty, the yolks were pale and clearly low quality eggs.\n\ndon’t go here! go to russ and daughters or agi’s counter."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMFpWaDNObE15YVZKWFVuTlBWa3N6YWkxTFJYYxAB",
            "text": "rude staff and mediocre food"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVlFqUjVOSEExWmxGYWMyUnJWVkl5YVdFMWQxRRAB",
            "text": "Cute place- was excited to finally get dinner here, sat at the bar. Disappointing. We won’t be back. Bartenders were friendly, but food was bad save the latkes and slow to arrive / weird timing. Too expensive for this kind of experience.\n\nOrdered the chicken and honestly, this was the driest chicken I have ever had at a restaurant (or maybe even at home). It was as if they cut it and it sat under a heat lamp or they put it back in the oven until no moisture was left.\n\nMentioned to the bartender and they were apologetic about it, offering free dessert. So we ordered the cake which I’ve heard so many good things about and two espressos. Espressos were cold and the shots so long they were undrinkable. It took *forever* for the cake to come out- and when it did, was cold as if it just came from the fridge. The icing was rock hard. If they didn’t have this ready to be served, I wish we would’ve been told. I would be understanding and ordered something else. Also I prefer the coffee to be served with dessert, not 15-20 minutes beforehand."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGb2QxQmxhSGMzYjJoMWRHeDJOMW81TlRoM1ZVRRAB",
            "text": "Weekends bring such crowds that reservations become almost necessary. The menu items are delicious. gertrude’s maintains both a cool vibe and excellent service. Staff remain pleasant without any arrogance. My overall impression remains positive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUFJrYzNlVFpxZWpSVVgwd3haVlYwY25oVWFsRRAB",
            "text": "My experience at gertrudes was a mixed bag.\nCons\n- the borscht bloody was really horseradish forward and chunky (but I understand its an acquired taste)\n- there was a hair in the burger which was gross 😭\n\nPros\n- the chocolate egg cream was so delicious\n- latkes delicious but small portion\n- best bialy was also delicious!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SlNuUlRVekZKTTBoeGQwTTBhWGRxYmtsU2FrRRAB",
            "text": "They turn classic dishes into something extraordinary."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZUp1LWkweVpld1pnEAE",
            "text": "Monday night burger was s-tier, latkes are fantastic, bread pudding was freaking insane, love the duck theme"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLQ3IzUFBMX2RlUEJ3EAE",
            "text": "Love Gertrude’s!  Amazing food, drinks, vibe."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJdU9tOXFEamR2SWZ3EAE",
            "text": "This restaurant is located comfortably in Brooklyn with excellent food and atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYUM3UERBaWUyemN3EAE",
            "text": "Excellent service. The fish is chef’s kiss !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNWDUwY2pDX2VPRDNRRRAB",
            "text": "The best place in the hood"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOcmpfZVdacS1IaEZBEAE",
            "text": "Delightful warm and friendly service. Excellent Monday night burger special- \"incredible\" says our resident burger eater. Great patio seating for a large party, delicious, fun, and unique menu, really great desserts- every plate licked clean!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQ2d4dEhWNHVya2d3RRAB",
            "text": "Great brunch! Get the challah French toast sticks. Wild good."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOZTBwclRzOThiMHZ3RRAB",
            "text": "Food was beyond salty. The owner was not accommodating. The restaurant was not accommodating. Excessive salt. 🧂🧂🧂🧂🧂"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPX01oOXk5d3NpcHVRRRAB",
            "text": "We just left Gertrude's and it was an amazing experience!  We were there to celebrate my son's marriage ceremony. Everyone was.extremely attentive and went way beyond taking care of us!  Daniel and his waitstaff couldn't have been nicer. My new daughter in law is already planning a return trip next week. The food was delicious as we had several appetizers and 4 main courses. Unfortunately no desert as we were too full. Thanks again for a great night!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKYTlvSnVQeUs2V3dBRRAB",
            "text": "Have been here for brunch before and had the most delicious meal and terrific service! They have a happy hour as well, and I wish restaurants would get rid of their happy hours if they are going to act so resentful of them? Nothing more disappointing than have a great meal one day and then coming back (and excited to do so!) and being treated with less than stellar service, food that has been obviously sitting under a heat lamp for some time (perhaps because I’m only paying happy hour prices?) and an overall air of annoyance that you’re there at all."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJcm13SUg0eTllb1ZBEAE",
            "text": "Overall just an okay place. I went for dinner over 7 months ago. And just went back for brunch today. Both times I had a reservation but still had to wait over 30 minutes to be seated. The drinks were just okay at dinner. Food both times also just okay, nothing special. Also the food took forever to come out both times. I could get some latkes and a bagel at any Jewish deli around the area in a fraction of the time, and it'll be better probably."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLLWIyZTZfZ0pqUUdBEAE",
            "text": "It’s incredible, just go! Just moved into the neighborhood and I already know this will be a regular date night spot for my boyfriend and I."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOWGQ4ZUdwaTVYbEh3EAE",
            "text": "Incredible and memorable. Food and service were perfection."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMMnVoNmpZbmZ2ejJBRRAB",
            "text": "The cabbage dish was way undercooked, bland and the filling was primarily canned cannelloni beans. Weird take on a traditional Eastern European Jewish dish. The latkes are tiny, overcooked and very salty. Not worth the price or the effort to get there. The other dishes, burgers and chopped salad were unremarkable as well. Never going back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZkM3THJLcV8zbzBRRRAB",
            "text": "Amazing food, vibes and service all around. Worth making a reservation for!\n\nThe latkes w/ trout roe and the burger are menu standouts for sure. Half chicken also deserves a spot on the table to share!\n\nHave been twice for dinner - once during their ‘burgers with buddies’ series and again with a group of 6. Holds up! Highly recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQam16NS1iN1BHM1VREAE",
            "text": "Very very cute, food was pretty standard"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLWFydERnEAE",
            "text": "Where to begin…\n\nOur server was inattentive, seemed overwhelmed, and distracted by coworkers. For such a small space the restaurant was surely over staffed which made the wait for everything feel even worse. We waited a while for our drinks and when they did come it was just a few drinks at a time and not the entire tables order, one of which never came. As the food started to come out we had some level of expectation given the price point. Plate after plate we felt underwhelmed and felt like it was just another small plates restaurant that was built on hype and not substance. A lot of the food felt like it lacked salt, sugar, acid, etc. I believe most of us who went will not be going back. I’m sure there’s people who enjoy this kind of place but it’s definitely not for me. On a positive note the decor and atmosphere was really nice and they have a lovely bathroom. I don’t normally ever write reviews even for mediocre experiences but I and my table really felt the need to say something this time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2FDaGlBRRAB",
            "text": "The half chicken was succulent, delicious sauce, lovely evening."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvemJDNGVnEAE",
            "text": "Gertrude’s in Brooklyn serves elevated Jewish classics in an intimate space. Our favourite item was the matzo ball soup. The spetzle was also good, but not incredible. We felt the tables were a bit cramped and didn’t love that the chairs were stools with no back support. The challah bread pudding dessert was too sweet for us and the ratio was off: it was 80% compote, 20% challah bread pudding. Also the ice cream had tons of ice chunks in it. Overall, we expected better given the prices and what we’d heard."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvanRuSlh3EAE",
            "text": "Food was cold and waitstaff rude and not accommodating"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMy1tZGNBEAE",
            "text": "Cute spot with great brunch."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJanE3WVpREAE",
            "text": "Gertrude's is my platonic ideal of a neighborhood restaurant, from its cozy ambience, to its creative but not overly complicated cocktails, to its menu full of familiar dishes prepared with interesting twists and technical finesse (I assume it changes with the seasons, but a recent favorite was the chopped salad, which leaned on refreshingly bitter radicchio). I've been for dinner a few times now and appreciate that you can easily order for a more casual experience, or a more decadent and celebratory one. Most importantly, if you have the chance to get the warm challah bread pudding—take it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUak0tbHRRRRAB",
            "text": "Saturday brunch was lovely. We shared platters around the table. The Best Bialy was very good, but the bagel a bit hard or stale. The Babka French Toast was amazing and the Latkes too. The Reuben Burger was only ok and the Hy’s Melt was average, would not order it again. Coffee was good! Prices were very good for the food quality. Nice brunch spot, charming servers and good price quality ratio for the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcXE2VFV3EAE",
            "text": "I’ve been here probably 10 times now and have experienced brunch and dinner. Gertrude’s is one of my favorites! The service is fantastic— waitstaff remembers you and your preferences. The food is so yummy— come on Mondays for burger night, you won’t regret it!! And the atmosphere is welcoming, cozy, and fun. Really such a great addition to the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N04yZ3p3RRAB",
            "text": "I came here for brunch on a Saturday with a friend. The space inside is very tight, which normally is whatever but it had been raining all day, so it made things a little uncomfortable. I ordered the Best Bialy, but had them put it on an everything bagel. I also ordered the House Salad. My friend had the burger. The food was fantastic. The bagel is served open faced and it’s a huge portion. The vinaigrette on the salad was super tasty; it made the dish taste very bright and fresh. I had some of my friend’s fries, which were also good. They are the thin and crispy type, which I love. I also had a glass of the Muscadet, which was good and my friend had a glass of the orange wine.\n\nTotal bill was well under $100, which I thought was very reasonable for two meals that included wine. I will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc3U2bklREAE",
            "text": "Service and staff were great. They were out of warm cinnamon buns so we went with the berry tart.\n\nWe sat outside in covered seating. The beet bloody merry was different than a normal Bloody Mary but was still awesome and the egg cream latte was enjoyed too."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3em9MaGhBRRAB",
            "text": "Such a great first impression of Gertrude’s. Cody, the sweet bartender, made a delicious cocktail with rum and herbs! The interior is calming with light pastels ( as a realtor - A+). Its European influence is so cute. I’ll for sure be back for more :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQZ2Iyc3lRRRAB",
            "text": "Beautiful atmosphere, good music, great service.\nLatkes are a must. Deep fried little goodies topped with sour cream, dill and roe.\nThe purple potato knish was cool, but not necessary.\nWe liked the pickles.\nThe sour beer I had and my wife's New Year's Eve brandy was great.\nThe spaetzle was OK, but a bit like eating unnecessary carbs (we got the veggie version). Noodles, mushroom broth and that's about it.\nShnitzel squash had a great salad but the breading came off. Should not be on the menu.\nThey need an actual veggie main, like a veggie burger. They also need a fish entree.\nAll in all, solid experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdE9TSTVnRRAB",
            "text": "Gertrude’s is a charming restaurant tucked away in the heart of Prospect Heights, offering a delightful dining experience. The ambiance has warmth and charm to it, particularly if you're fortunate enough to secure a coveted bar seat—an option I personally prefer for its cozy atmosphere.\n\nThe menu at Gertrude’s is a\nMix of fusion of classic Jewish dishes and innovative culinary creations. Among my favorites were the trout roe latkes and the burger accompanied by crispy French fries. While the food was certainly enjoyable, I must admit that I wasn't completely blown away. Some dishes leaned a bit heavily on the salty and vinegary side for my taste."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwajd5Y1R3EAE",
            "text": "Great neighborhood spot.  Staff is fun and friendly, drinks are good, and food is tasty.  We had the eggplant schnitzel, the spatzle of the day, and a couple appetizers.  The fries were absolutely amazing and the food was all good and satisfying.  Definitely a solid spot for dinner."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcThDUWNnEAE",
            "text": "Had the best time here. Went on a Saturday morning for brunch and sat on the heated patio! The staff was incredibly friendly and it was a cozy neighborhood spot. You could tell everyone had a lot of love for this place. Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnZ0lfWkVBEAE",
            "text": "Typical brunch spot in the area with some interesting plates. The majority of the menu is normal brunch food but I’d highly recommend their latkes which stood out to me the most. Enjoyed the coffee but overall the food was just okay. Would recommend trying it out if you’re looking for a place to eat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMDhyZXVBRRAB",
            "text": "Have been on my Jewish food tour of Brooklyn. Came here and was good. Wished the salad was a little more generous with the white fish but the bagel was flowing with white fish salad. So can’t complain there. Will come back and try other dishes.\n\nWhat was ordered:\nWhite fish salad 7/10\nWhite fish bagel melt: 9/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwa3Y2ZUhnEAE",
            "text": "Must-try! The food is definitely a standout! The latkes are a bit small but boy does it pack a flavorful punch. Their pickles are tasty and has a firm bite, all that you want from pickles. The chicken is surprising flavorful and well cooked. We had their special dishes that night (steak and pesto spetzel) and they’re both amazing. Worth it to save some room for the summer fruit cobbler. Drinks are good and stiff flavors of classic drinks."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaG92MGF3EAE",
            "text": "Fantastic all around. Fantastic friendly owners. Great staff. The pickle brined chicken is fantastic. The star of the dinner was the tzimmes! But you'll be a fool not to save room for the AMAZING 7-layer cake. Bring your appetite and bring a friend, this place is a real treat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbVBYaGlRRRAB",
            "text": "While the atmosphere and service were great, the food at Gertrude’s isn’t that good. Dishes have no complexity of flavor and some are plain bad. On the good side, the three layer cake and cocktails were tasty and satisfying. A steak special was also delicious. Everything else was somewhere between meh to bad.\nThe challah roll was dry, the latkes only flavor was salty, the House Chopped Salad was just not tasty with the salami overpowering everything else. The half chicken had a lot of cartilage in it, and the duck spatzle’s only flavor was bitter. We left a lot of uneaten food on the table, which wouldn’t happen if we liked it better.\nI think this place has a lot of potential, if they fine tune their food."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNDZETU9REAE",
            "text": "This was excellent - honestly one of the best brunches I can remember having in nyc. The tower was an ensemble of so many things, left feeling very full. Also the quality of each item was top notch - whitefish salad was incredible! Staff were lovely"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNHMtVWZBEAE",
            "text": "Overall rating: 4.5\n\nAs a new restaurant, this spot was hustling. So crowded at like 5:30, which is crazy to me. So it must be good!\n\nThe first time I went I tried to do a walk-in which was no bueno. Next time, I did a reservation and the hostess was very nice. I was kind of expecting for them to give me some tang to sit at the bar since I was solo, but since a table was reserved it was pretty easy.\n\nThe server was so nice, but I was a bit taken aback by these prices. Usually, I prepare myself mentally when looking at the menu online. But they don’t show prices on their online menu, so when I got there it took me some time to adjust.\n\nI got a burger which was okay. Not okay enough for $30. The fries were good. And the drink prices were very reasonable!\n\nBut I’m not sure if this is something I would come back to on my own. I can see it being a great place if I worked in the area or I was dating someone that lived close by. But idk, there’s something off for me.\n\nThe staff was soo friendly and the restaurant looks great! But I don’t think I’m the target audience & that’s okay. Give it a shot and see what you think :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIZ3FpMEpREAE",
            "text": "This place seems to be always busy which is a good testament. I had been curious to try since moving to the neighborhood and it did not disappoint. The food and drinks were good - I got the salon bialy and the pomegranate cold brew. Our waitress was also so kind and warm. Highly recommend for a neighborhood brunch spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURELU9pQ0lREAE",
            "text": "This place is divine in every way. From the food to the vibe to the way the staff treated all of us, it’s sure to win you over. We had the big leafy salad, the seared cabbage with cashew cream entree, roast chicken and the latkes with roe. It’s clear the chef loves what he does because the food is the star of the show. The staff was mindful of any dietary restrictions we had, and were kind, helpful and professional. Thanks so much Gertrude’s!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXFLTlV3EAE",
            "text": "dropped by for a post movie cocktail ... on leaving made reservations for dinner tuesday night.  great pickle plate.  great dirty martini with housemade pickles and pickle brine.  house water drawn thru converted draft line ... great tunes playing.   what's not to like?"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURac00taHdBRRAB",
            "text": "Hostess was awesome and helped me out on getting a table when the place was jam packed. Good is spectacular, but the menu is small. Will definitely be returning because my guess is that they rotate the menu pretty frequently. Had the eggplant schnitzel and the burger."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwM3FHWktnEAE",
            "text": "Wonderful restaurant with creative seasonal specials, delicious food, and vibrant neighborhood ambiance. We had the special corn salad pictured here, bluefish app (so good) and tongue which was crispy with a refreshing sauce and such a fun new experience of eating tongue. Our mains were WONDERFUL: the whole trout cooked perfectly with delicate flavor and amazing fennel sauce, and a burger with the best mustard sauce ever. I loved the latkes too - and dill sauce with the burger. The staff was friendly, attentive but with a laid back approach. You cannot top this chocolate cake!!!!! Best finish to a fabulous night of food and dining al fresco! Gertrude's is an absolute must!!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsNlBpZ1B3EAE",
            "text": "Cute cozy neighborhood spot. Went there around noon on a Sunday without any reservations and had no issues getting a table. The nosh plate was perfect to split between two people; their latkes are crispy on the outside but still pillow on the inside (really good).\n*update review* I suggest making a res if you’re going on the weekend during the summer.  And the simple child bagel I thought was a bit salty and had less avocado than what I was expecting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMb00zRVJREAE",
            "text": "the cutest restaurant in the neighborhood that’s always full! we got a relish tray and a hash brisket. both were good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsbWFTS09nEAE",
            "text": "Had an excellent early brunch here! We showed up shortly before 10 and there was availability and we got seated right away. We really went big with a bagel special, apple cake, latkes, and eggs with a side salad. Everything was excellent. The Apple cake and latkes were standouts and the service was perfect: attentive but not rushed.\n\nHighly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWOTlmRTZnRRAB",
            "text": "Controversial take but this is better than Sadelle’s relative to value. The signature bagel & shmear balanced each other perfectly, not overwhelming. The maple cocktail was punchy good too. Latkes were pretty standard but then I’m not into potatoes much. Great and attentive service."
        }
    ],
    "reviews_count": 75
}