{
    "name": "Novelli Cafe and Restaurant",
    "place_id": "ChIJhc85GWRbwokRWi5rtRJE_-c",
    "grid": "BK9",
    "address": "1034 Nostrand Ave, Brooklyn, NY 11225, USA",
    "rating": 4.3,
    "user_ratings_total": 92,
    "phone_number": "(718) 986-5892",
    "reviews": [
        {
            "date": "16시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTVQxbHliRzlyTWtoclJHTk5VVms1VDJ4RmFVRRAB",
            "text": "I asked to use the bathroom. The host said no which I expected. So I said “I don’t mind buying a bottle of water so I can use the bathroom.” She said “We only sell big water of bottles that cost $20.”\n\nSo I just left."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeFYyRkhSVVJqYWxWRmNGRkhTMkV0ZDFaRFprRRAB",
            "text": "This is by far one of the best dining experiences I’ve had in New York City. The building is beautiful, with a warm and elegant interior that’s kept exceptionally clean, professional, and well-organized. The atmosphere feels both cozy and refined. The food is absolutely delicious, and I always look forward to their unique coffee selections each week. Sabina is incredibly kind, attentive, and highly responsive with her team—everything runs smoothly and with great coordination."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMVRHWllRVE5WYjFscU0xWTJNbGR0WldoTU1GRRAB",
            "text": "Muy acogedor, la comida exquisita y buen precio."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVVNHZDZVamhXTUVOYWVVaDFZVVUwYVVneExYYxAB",
            "text": "Wow! The food is incredible and the staff is so kind! Such a great addition to the neighborhood"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Sk9YVkNabXBLZWsxVWJVeGxWM053YTA5VlRHYxAB",
            "text": "It’s my second time here. It’s an amazing place, delicious food, and the staff is so friendly and kind. I recommend it to everyone. Our server Aisha was so gracious and kind"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVU4yWkNSSFJ6ZVRWRVVtOTRYekZFYlhaVmQyYxAB",
            "text": "It’s an amazing restaurant in the neighborhood."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaVppMHhjblJYUTJkWGNuWnRRbVF3WWxoalpFRRAB",
            "text": "The Food, Service and Ambiance is Impeccable!\nThe owner is so warm and generous! I recommend this place to everyone! ☺️🥰😋…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NE5YUlVVR2M1UzJwT1JGWnVRbG80YzBaS2RHYxAB",
            "text": "Restaurant staff member Nia was very warm and kind to me and my staff as we made a group order for lunch and the rest of the staff was very nice and friendly and the pizza 🍕 was delicious 😋 🙂"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eFNISXhaakZ5Um1oWE5VaERhRzR5YkhwZk9VRRAB",
            "text": "Great veggie pizza and creamy artichoke pizza! They also give complimentary freshly baked bread with olive butter at the start of the meal that’s lovely! Warm and relaxing ambiance great for a chill dinner or a nice date night"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUVVuVXpNVlIwUkdoblQxOVNTVGxOWVdGV0xYYxAB",
            "text": "Novelli Restaurant Café is one of those spots that instantly makes you feel like you found a hidden gem. The atmosphere is cozy but still has that upscale touch, perfect for a night out when you want good vibes and good food. The staff were super welcoming and made the whole experience smooth from start to finish.\n\nI went with the Cornish hen and mashed potatoes, and man, it was on point. The hen was juicy, well-seasoned, and had that perfect balance of crisp on the outside and tender inside. The mashed potatoes were creamy, buttery, and paired perfectly with the dish — comfort food done right, but elevated. You can tell they put real care into how they prepare the food here.\n\nWhat I also loved was that nothing felt rushed. The service had great timing, and the portions were generous without being over the top. It’s the kind of place where you can relax, enjoy your meal, and actually savor the moment.\n\nOverall, Novelli gave me an experience worth coming back for. I left full, happy, and already planning what I’ll try on my next visit. Definitely recommend this spot if you want quality food, a chill vibe, and great service all in one. OH LAWD!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSGQyNXVRa1IyV2tSTmNuaEpZMWRoYlZrdE9WRRAB",
            "text": "Honestly an incredibly disappointing experience. The owners/staff were very uptight and not welcoming, and the food was mediocre at best. Pizza was soggy and flavorless and the ambiance was also lacking. Also wayyyy overpriced."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUFUwTm9UMlYzZWpkUGIzaDVaakJUTjNkS1IzYxAB",
            "text": "great service and good food  ! i’ll definitely come back .  i got the arugula salad with grill chicken . and the mix grill platter along with salmon 👌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweU1uaE9NMDFHTmtKSGIyMTVVa3RXWlc1bk5uYxAB",
            "text": "I loved my entire experience here! My faves were the pizzas, the capparcio, steak, and mix platter! Can’t wait to come back\nFor happy hour!\n\nCheck out the full review on https://www.instagram.com/reel/DNWYTJ4vtXM/?igsh=OHdnMGs3am5lZ2Rp"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sT2VtdFhOSFpCVTI1R2FTMWZkVkJGY3pWNFdsRRAB",
            "text": "I really enjoyed my experience  here . I live near by and I love that they have a verity of great food choices . I got the margarita pizza and butter shrimp . Both to die for ! However … I gave 4 stars because of how the manager or owner a lady spoke to the employees.. I was baffled no employee should be spoken to that way. The waitress made sure  my husband and I were well taken care of they did a great job . I felt so bad when she spoke so nasty to the server… and when I tipped the server they didn’t even keep it as I walked out I seen them putting it in a jar.. the food is great I just hope the employees are really getting treated fairly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GZmF6bHJWbFJyVG5Sb1NsZGpkVWRyZUhRNE4wRRAB",
            "text": "Delicious! We loved the Aleppo Kebab Bide especially."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONFJGRlVWM1UzUmxCaWFVbDVVVTlzWVdsTWVIYxAB",
            "text": "I want to first off say the service was great everyone was nice and welcoming … the portion size is ridiculously small for the price you’re paying . I don’t know if you’re trying to preserve food or what but the prices need to match the portion size as well . And then to add the 18% fee on top ? Yes the people need to be served more food. Drink was decent didn’t taste much alcohol in it but it still was good . They do give you complimentary bread which is a plus . Just a few things they need to work on."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdVQ4cDItODhEZFNREAE",
            "text": "Mix grill , chicken Parm , pizza was so delicious . and the dessert was delicious also"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSFlVWkhWMFpHY0ZKdWIzZ3lSakJDY21SdFlrRRAB",
            "text": "Dinner was great service 5 stars\nGreat food great service\nTry it you will not regret"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTGNuWXhMVVZPVkRsU2NHTnZaVFI0WTBkclFVRRAB",
            "text": "Very Aesthetic and cute and food tasted amazing and very affordable prices 10/10 recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdGJYWXdVMU5LU1RkMFRGbHZaVEJPV1d4WlZHYxAB",
            "text": "Just ordered take out and when we came to pick it up we were greeted with the most friendly smiles, so I’ll definitely be back to dine in. Got the chicken parm sandwich and the artichoke pizza and both were great. I liked the sandwich best, while my boyfriend liked the pizza best. The red sauce on the chicken parm sandwich was delicious and rich, I would eat it by the spoonful."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcmFYbzVha3BQYzE5VVNGWmlNWGxaUm5oQmFuYxAB",
            "text": "I really wanted to give this place 5 stars but being charged an 18% service charge (separate of the tip) for a party of 4 was a little ridiculous. We live nearby and were looking forward to making this place a go to - we love Mediterranean and their hummus was wonderful along with the grilled platter, yum- but the additional 18% plus what we tipped meant we were paying almost 40% on top of our bill. Not sure what the reasoning is but hope they change this in the future.\n\n***Amended review to 4 stars, based on owner's response. Apparently the 18% service charge IS the tip... I thought the server mentioned that it didn't go to them, which is why we tipped additionally. Hope it really does go to the staff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSFVYcDZNVEk0VVVSM2JYaFpWWG90VVVwS04xRRAB",
            "text": "Went here for brunch and it was amazing! My waffle was flaky but not to hard, plenty of avocado and fresh fruit on top, the salmon was the best I’ve had in my life, the waiter was so attentive and made sure my bloody Mary was made just right. Even the bathrooms were nice, spacious and clean. I highly recommend this place, and the customer service is outstanding."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTlptNUhZMUl6TlZCVmRXcDRaVWhXZWpCMlUyYxAB",
            "text": "The quality of the food is way overpriced. They charged me 7$ for 3 pieces of shrimp. The salad could’ve been better. I ordered chicken tenders and fries for my kid. The fries and tenders were undercooked. And overall my total came out to $52. So not worth it. The people, service and ambience was great but I don’t think I would ever want to come back because of the quality of the food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVmQxcDNYM2RUTkZOeFp6aG5jemRuUXpkbVZFRRAB",
            "text": "Great tasting pizza\nNice cozy atmosphere\nGreat service\nClean bathroom"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cU5qTlNOMU5ITm1GdFpVMVRZa2RDYTJ4a1UzYxAB",
            "text": "I live super close to here and really wanted to like this place but I give 1 star because waitress was bad, and they do an 18% service charge (which isn’t consider tip). I will never go back. Just price the food 18% higher if it’s not a tip, no other restaurants I’ve been to do that BS."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNFNtTm1TRTE1VDFWeE5HWkpZMUZOTXpBMk1YYxAB",
            "text": "So happy with our experience here! Food was amazing, staff was incredibly kind, atmosphere was refreshing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMU1tdGtPVFJNTUVreVptUlJObU4xYlZKT2NWRRAB",
            "text": "We tried this place for lunch on Wednesday and came back again Thursday night. The food is mouth watering and the atmosphere is relaxing and very nicely decorated! The manager was very friendly and the service was quick! We had the burger and chicken parmigiana on Wednesday and we had the meatball and margarita pizza Thursday night. Both times we were not disappointed. If we lived here we would go every week! Highly recommend!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNU5XcHVaMVZ5ZDNJeVFXOVFUMlpqYlMxdVdWRRAB",
            "text": "I really really wanted to like this place, but they failed miserably at the basics.  My daughter ordered the chicken tenders / nuggets and fries.  I can't recall which name they used for the dish, so I put tenders / nuggets.  The chicken was soggy and pink inside.  It was not crispy at all.  I don't think there any children looking for soggy chicken.  My daughter enjoyed no part of that dish.  The sprite was the only thing she enjoyed.  I ordered the chicken shis kebab because they are typically delicious at other restaurants.  This was not the case at all here.  With a typical kebab, the meat is meaty and flavorful.  That was NOT the case here.  This was a grounded up, dried bland abomination of a kebab.  They had a white creamy dipping sauce with some red powder that immediately gave me an allergic reaction.  The food was all very expensive, and I have zero desire to return.  As for the decor, it all looks very nice.  Money was spent to make the place visually appealing, but the food misses the mark by miles.  I write many reviews on Google, and I give my honest unbiased opinions.  The goal is to help bring about needed changes.  To be completely fair, a few of the guests that dined with me and my daughter loves their meals.  Those dishes were fish based.  My oldest daughter had the sliders and she took one bite out of the 3 mini sliders and wanted no more.  Hopefully they can make some much needed changes.  I must commend the wait staff, as they were on top of everything the moment we walked in.  They did everything within their power to make us comfortable, and get our orders out quickly.  Unfortunately, they have no control over the quality of the food.  For me, the dining experience was terrible as me and my daughter's found our food not fit for consumption.  As you can see, only a single bite was taken out of the sliders we brought home, and only a chunk was eaten from one of the three kebabs."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNVHA0cmpHak8tMVJ3EAE",
            "text": "FANTASTIC pizza, had the truffle, marg, and veggies. Best pizza I’ve had in all of Bk!\n+ the Branzino is incredible, and very generous shrimp servings. Delicious summer cocktails. A place you can have a date or a big family outing. Discovered it a month ago and already been 5 times."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOV0ctc3lWamV2aFhREAE",
            "text": "Well I start with the  place is  very cozy  to have a good moment with friends and family\nWe have the pizzas  margarita and artichokes  which it was  delicious  as well  the. Calamari and burrata etc.   Everything was fantastic\nThe only  issue was\nWhen I pay  the amount  of the check  the waitress never mentioned the tip was included all ready   But still  has some Options. To give   tips   On top   The machines so I decided to put a 22%  of tips  thinking normal tip  but o surprise when I did my total of the consume what I did doesn’t match the price so it’s when I notice the over tip\nSo please if you going to any restaurant  make sure ask for your paper bill  to be make sure what you. Pay"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMVGVyZDZ6bDRIdU9BEAE",
            "text": "The OWNER OF NOVELLI CALLED THE POLICE ON MY SISTER AND I --two Black women--in the heart of Flatbush, a historically Black neighborhood. Why? Because we calmly offered feedback about being denied access to the restroom as a willing customer, and expressed concern that her decision may have been racially motivated.\n\nAt no point were we aggressive. We didn't raise our voices, threaten her, or make a scene. Yet after dismissing my concern as \"crazy\" and insisting she \"doesn't see color,\" the owner, Sabrina, escalated the situation drastically. She demanded I move further away from her--after I had already stepped aside--then weaponized her whiteness by calling the police.\n\nLet me be clear: calling the NYPD on two Black women over a verbal disagreement is not just an overreaction--it is a violent, racist act. It reflects a deep awareness of the potential harm that could come from involving a police force with a documented history of brutalizing Black people. Whether Sabrina wanted us arrested, harassed, or humiliated, her intentions were clear: she wanted to assert power and punish us for daring to speak up.\n\nFortunately, the responding officers--two Black men--immediately recognized that we were no threat and left. But that doesn't erase what happened. The OWNER OF NOVELLI made a calculated decision to put our safety and dignity at risk simply because we challenged her behavior.\n\nIf you value racial equity, community, or basic human decency--do not spend your money at Novelli. This business does not respect the people of Flatbush, and its owner should be held accountable for perpetuating the same racial violence that continues to endanger Black lives across this country."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNdmt6YzNtcFlqUnpnRRAB",
            "text": "ETA: While I do not own a local business (a family member does), the owner of Novelli thought otherwise and within hours of me posting this review, there were 3 new one-star reviews for that business. Disappointing - as my opinions are my own, not his, and do not reflect personal feelings, only my experiences. I'm not decreasing my rating here for that reason. (When I initially read the owner's response, I planned to soften my initial review in light of Novelli being so new. Better I think is to go ahead and give them a shot and decide for yourself.)\n\nOriginal Review: I really wanted to like this new spot in my neighborhood, but it was a miss for me. The decor was surprisingly cheesy for a brand new spot - all the glass and mirrors and fake flowers. The wait staff were very pleasant and eager to please. Salad was ok - a bit over dressed.  I was hopeful about the pizza because the oven looks legit, but the crust just didn't have a good chew and I found the sauce really sweet.  Tried the pizza with the kebab on it and the kebab was good but the pizza again was piled with overly sweet toppings. Another customer was loudly playing videos on her phone next to us the whole time. Playlist was also not to our taste. With Camillo a few blocks away, I can't imagine coming back, especially because it feels like a bit of a splurge to eat here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZngwSS0ydDh2UWRBEAE",
            "text": "Everything was just so good here! Food, service, atmosphere- such an amazing experience overall! Everyone was extremely pleasant, especially our server Leo.\nWill definitely be back!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMM192LUNld05mOUZBEAE",
            "text": "Went this weekend with a family of 5. It was a well-rounded experience at Novelli Cafe, with fantastic food and courteous staff. The food was the star of the show, everything was fresh, flavorful, and plated delicately. The café has so many options whether it’s for a quick bite or a full meal. The staff was friendly and attentive, they had great recommendations, and everything came out just right. Highly recommend the salmon or the mixed grill platter for the main course, both were stand outs for us. The apps were all good too, we got the fried calamari, falafel, and the Fattoush salad. Earned a spot on my list of places to go to in Brooklyn, will be returning soon!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMSEdqcV9NaHBiNTdnRRAB",
            "text": "Great place that had a lovely atmosphere. The food was outstanding and the service was great. The waiters were friendly and they were great helping with our orders. A great place that I would highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPN2prNlNVNjhyYTZnRRAB",
            "text": "Food was delicious and service was great"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNbWIxSUNILXRyWEN3EAE",
            "text": "Horrible people. I was going to do a takeout and they did not allow me to use the restroom. The food looks sad and overpriced"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPSG44YUtQaXZtUTZ3RRAB",
            "text": "This was my third time coming to Novelli Cafe and it honestly gets better every time. The food is always amazing, fresh, flavorful, and cooked just right. The staff is super friendly and makes you feel like part of the family. There’s such a warm and welcoming vibe here, it’s the kind of place you wanna keep coming back to. Whether it’s brunch or dinner, everything I’ve tried has been great. Definitely one of my favorite spots now."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMX2J0YUgyay1hR213RRAB",
            "text": "Gotta say first time being here and wow just wow this place was absolutely amazing the service was great such friendly people and they know how to make the table laugh definitely coming back here 10/10"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOUGozLVN0d0p1WFF3EAE",
            "text": "Food is very delicious. The staff is very friendly. The restaurant is very clean very fresh food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPVFk3NUQ1am96bkFnEAE",
            "text": "My husband and I had the most amazing brunch experience! My husband ordered the Eggs Benedict with turkey bacon, and I went with the bacon, egg, and cheese waffle and it was absolutely delicious. The eggs on the Benedict were perfectly poached, and the hollandaise sauce was rich and flavorful without being too heavy. My waffle was the perfect balance of savory and sweet, crispy on the outside and fluffy inside. We also shared a Caesar salad, and it was fresh, crisp, and perfectly dressed. The best part? The prices are super reasonable. It’s rare to find a brunch spot with food this good that isn’t overpriced. We’ll definitely be coming back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbUlrSm5XODZLOWpnRRAB",
            "text": "Was at the bar next door and stopped in. Excellent food. The staff was lovely. Fair pricing. THAT TRUFFLE PIZZA WAS BOMB. Will def be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNejRrdERzOVlidXp3RRAB",
            "text": "Absolutely amazing experience at Novelli, food was absolutely amazing, the staff was so warm and inviting, that’s just in addition to the amazing service and attention to detail!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLVZwTldpOEpQaHV3RRAB",
            "text": "I ordered the banana and Nutella crepes . They serve with two crepes and a drizzle of chocolate on top . It was delicious I also had a coffee was good as well . The waiter Justin provided great service . I was able to utilize the wifi to do some school work . The staff is kind and attentive. Enjoyable experience looking forward to returning for the brick oven pizza . Atmosphere is very classy and up to date quiet cute and cozy ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMQ005cS1Na3JtQ3JnRRAB",
            "text": "Worst pizza ever. It was burnt so much that the pizza crust was black on the bottom and top. The ingredients weren’t good either. Very disappointing."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKR3puSUtFdGNtTWNnEAE",
            "text": "The decor is a little dated for a brand new place, but the calamari and oysters were perfect.  Get a nice cocktail and you have a wonderful way to spend an afternoon."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYmMyNXl0ekxHalhBEAE",
            "text": "Where do I even begin, Novelli so far has been a great addition to the Flatbush/Nostrand community. The food is phenomenal, 11/10 would highly recommend stopping by and trying out a variety of their dishes and tasty pizzas. The service is extremely friendly, I felt as if I was at home eating my grandmothers cooking. The servers/waiters are very friendly and considerate. Oh and how can I forget the food is very affordable. We thank you for bringing a lovely restaurant/cafe into our community. Anything less than a five star rating would be blasphemy. ENJOY :)))"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPSDY5WVNNNXF2Q1hnEAE",
            "text": "This is a great brunch/dinner spot ! I loved the environment and people here. Justin the bartender made great drinks aling woth great servers making sure you’re doing well. Pizza 10/10!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNaWhnX2JmbWIyNDZRRRAB",
            "text": "I ordered the tenderloin steak, and it was absolutely sensational, this coming from someone not fond of beef. Service is amazing and attentive, great atmosphere and you just want to stay and enjoy the time. It's a great place to give a shot! Love it x3!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKN24xY1dCbXZ1Z1ZnEAE",
            "text": "yummy! great vibes & cocktails. really lovely local eatery to show some love"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnEyanN3RRAB",
            "text": "Absolutely loved everything about this place! The food is beyond amazing and every dish we tried was packed with flavor and cooked to perfection. The ambiance inside is just as impressive: warm, stylish, and incredibly welcoming. It’s the kind of spot that makes you want to stay a while. The staff? Truly top-tier. Friendly, attentive, and clearly passionate about what they do. Easily one of the best dining experiences."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJamNoczc5bE4temJ3EAE",
            "text": "We just popped in to check it out and the surprise 😮 we got. The food was amazing, very tasty,  beautiful  well put together places. And I'm in love with the Mint Lemonaid. So refreshing. I will definitely be going back. The whole staff is inviting and warm. Love it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcGF1STBRRRAB",
            "text": "You truly don’t understand the amount of joy that I have to finally see a beautiful and fine establishment as NOVELLI in my hometown, MY Community!!\nThis place brings warmth to the soul with great class, true comfort and delicious eats plus don’t get me started on the amazingly engaging hospitality you receive from entry to departure\nhonestly from the WHOLE team to QUEEN Sabina the owner herself EVERYONE truly makes you feel right at home as if they’ve been a staple on this corner for years!\n\nI had their delicious Grilled salmon fillet served with creamy quinoa, sautéed asparagus, and a smooth lemon cream sauce. I then had the Aleppo Kebab Bide which is a Spiced lamb kebab with grilled salsa and biwas on a traditional bide base. My last entree and also my new found favorite dish was the Branzino Fritto which is a Crispy whole branzino served with steamed rice and house-made tangy carrot pickles. For dessert because I could not stop lol I had the Tiramisu made with Phyllo Dough it had Mascarpone cream layered with espresso-soaked phyllo dough, topped with cinnamon, crushed pistachios, and syrup and I also enjoyed the grilled fruit plate which was a tasty grilled skewered pineapple topped with toffee sauce and served with vanilla ice cream.\n\nHaving Novelli in the heart of the neighborhood is a dream come true and I know the community truly loves and appreciates it from the esthetic to the hilarious and amazing beings like Saint and Bing and PLEASE don’t get me started on Justin the bartender whom has THE BESTEST skills behind the shakers no other around and the sweetest the hostess Logan and her inviting smile — two years in the making and it honestly was worth the wait !!\nsee ya’ll soon for more !!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdnU3c0xBEAE",
            "text": "What a pleasure to have a restaurant of this caliber in my neighborhood. Food, service, and atmosphere is phenomenal. Although it was my first time, I am already looking forward to returning to try the oysters. My compliments to the chef management and staff!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdnY3WGpRRRAB",
            "text": "From the second you walk in to Novelli you are welcomed with open arms . The decor and atmosphere is so warm . The big red oven that made the pizza to perfection. Everything I had was top notch. Looking forward to my next visit ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvanFfOGF3EAE",
            "text": "It’s my new favorite place 😍😍😍😍😍 If you’re in Prospect Park, Novelli Café is a solid choice. The desserts are next-level—rich, delicious, and totally worth saving room for. The service is friendly and attentive, making you feel right at home. And if you’re a fan of seafood, their seafood risotto is a must-try—flavorful and perfectly cooked. Great spot for a relaxed, tasty meal!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbmVDXzd3RRAB",
            "text": "Novelli is a place where the owner gave so much attention to detail. Every little detail in this beautiful restaurant made me feel like the whole atmosphere is complete! We got the pizza which tasted delicious. Then salmon with the quinoa it was absolutely amazing. Following the entree we received this amazing dessert I will attach a picture of it. It was very creamy and rich in flavor!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNWNTV3ZRRRAB",
            "text": "Huge success with the grand opening! Every bite was so delicious and meticulously prepared. We had the shrimp, chicken kebab, dolma, Aleppo kebab bide pizza, panna cotta, tiramisu and rose lemonade. Everything was wonderful. Service was attentive and friendly. We can't wait to go back for brunch next!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMQ2dyY3p1dFBLcFpBEAE",
            "text": "Great drinks and vibes. Justin, the bartender, is a true mixologist who makes the best drinks. He is so warm, and friendly that he keeps you coming back. He makes you feel like you’ve known him forever. He’s the reason why this is my new favorite place to go and unwind."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZM0pqaUV3EAE",
            "text": "A wonderful dining experience! The fresh salads and Cornish Hen were absolutely delicious, and the panna cotta was the perfect dessert to end the meal. The service was top-notch, with friendly and attentive staff. The atmosphere is so cozy and inviting, making it a perfect place to relax and enjoy your meal. Portions are generously sized. Definitely recommend this spot!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcFlMQVh3EAE",
            "text": "Novelli is a place I have been waiting for. We are talking many years. It merges Italian and Middle Eastern cuisines and does it well. I ordered the hummus gluten free with vegetables. This wasn’t listed as an option but should be, as many more after me will be asking for the same. The hummus was rich and creamy with a surprise mint leaf. It made an excellent dish even better. Next, I had the arugula salad. I asked for dressing on the side but the salad still had dressing. It was good but I prefer all accoutrements to be on the side. I wish shrimp was an add-on, given the heavy emphasis on seafood. Finally I added asparagus. They were lightly salted and delicious.\nOverall, the food was good but lacking in value. Prices this high should mean exceptional food, and Novelli is not quite there. But they have a good start. Service was good, and the bartender knew his stuff. I imagine Novelli will do well as an upscale pizza restaurant, as well as brunch and of course, the coffee and espresso they sell. Happy they are here!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcm9fd1lnEAE",
            "text": "From the experienced Owners to the spectacular staff to the amazing Pizza-chef and the fantastic location Novelli is cruising towards success !  I wish Novelli decades of success here on Nostrand Ave and thank everyone involved for their hard work. The place is comfortable, bright and the food is excellent! The pizza sauce is absolutely delicious and the Cacio e Pepe was perfection.  Already Looking forward to my next trip to Novelli Cafe!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOX2xxNGpvcTZlOVBnEAE",
            "text": "Good atmosphere, friendly staff. Pizza  was soggy, sauce is really good. The downfall was seeing an extra fee on my bill (after asking to see the breakdown of it) and when I asked if the tip was already included I was told no that’s a fee for the use of the table. (THIS FEE IS ILLEGAL) I was baffled isn’t that the whole point of going to a restaurant??? So guess what, you just lost a potential loyal customer. …"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc1lxYURnEAE",
            "text": "From the moment we walked in, we were welcomed with warmth and genuine hospitality. The ambiance was both cozy and elegant, with a beautiful setup that made the meal feel extra special. The staff was attentive without being overbearing, and they checked in just enough to make sure we had everything we needed. Everything moved at a perfect pace relaxed but never slow. It’s clear they take real pride in making sure their guests have a wonderful experience. I can’t wait to return!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYWJ1Wjd1OV96WFlBEAE",
            "text": "We had a family Mother's Day dinner, with two 5 year olds along,  at Novelli last night, and it was exceptional!  Nolan (sp?) who greeted us was so kind, as were Justin, who made some great drinks, and our server (shoot I’m blanking in his name), who was quick to get the bread and pizza out to the boys.  The food was excellent, and everyone is sooo nice there!  It’s only been open a couple of weeks, and you need to check out this gem before it gets too busy.  You will not regret it!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc2NyckZ3EAE",
            "text": "This place has such a great vibe! The energy in the room was lively but still intimate enough for conversation. You could tell that everyone, from the servers to the management, genuinely cared about making the night memorable. It’s the kind of place where time flies without you realizing it. We left feeling happy, relaxed, and already planning our next visit. Truly a gem!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc3A3TTF3RRAB",
            "text": "Well, where should I start! Exterior and interior- super cute, cozy,  lovely,  very nice. Now, let me tell you about there Food - DELICIOUS DELICIOUS DELICIOUS!!!\nEverything,  just Everything was very tasty and delicious! Even Pizza ( I do not eat pizza) my friends told me that it was best Truffle pizza ever!!! Well done! Oh, I forgot , Service- waiters and bartenders and basboys and the girl hostess- just exceptional Job!\nYummy! Promise,  we will be there often! Promise! Thank you to Novelles owners! Good, very good Job!!! 100 points out of 50!!! Good luck!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURva1lhdXFRRRAB",
            "text": "Had a great time at Novelli. Staff was very welcoming and took great care of us! Absolutely try the Frutte di Mare, I loved it. Desserts were delicious too. Definitely coming back here!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaGRiM2ZBEAE",
            "text": "The food is exceptional and they have a stellar wait staff. Race was so attentive and funny. Word to the wise—get the steak. One of the most memorable things I’ve eaten in so long. Can’t wait for this to be my new neighborhood spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKN3kxZWZvMVpxaEd3EAE",
            "text": "Cool place with great atmosphere, delicious food and cocktails. The best desserts ever!"
        }
    ],
    "reviews_count": 70
}