{
    "name": "Bleu Nuk Bk",
    "place_id": "ChIJdbnwmV1bwokRJof6WvOFs6A",
    "grid": "BK9",
    "address": "1150 Nostrand Ave, Brooklyn, NY 11225, USA",
    "rating": 4.7,
    "user_ratings_total": 121,
    "phone_number": "(718) 210-2529",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nd2R6VkVjR2d3UkROaGVuZHFSbWRSVlZaWFVWRRAB",
            "text": "Nice spot with potential, but the service was slow and the food didn’t quite meet expectations. Hopefully it improves."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oV1pFZFRORGxTYURVNGEzVkJRVWRJTFVSeFpXYxAB",
            "text": "I feel a little shameful to say our family comes here weekly 😂 because our toddler loves it so much that she would throw a tantrum if we go to another place. Food is consistently delicious and bar tender Dionne is the most attentive person! The cocktails always hit me right !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadlprUm9kVzFHZEZkdlJteG9VVkJ4VUV4amMxRRAB",
            "text": "Cute little spot on Nostrand ave. Great food, great vibes. Oh and we absolutely loved our hostess!! Definitely recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSE1DMVNhR1pIV0ZJd2VYRkNNV05SVDBNNVdFRRAB",
            "text": "Food was delicious! Everything was seasoned to perfection, from the sauces to the entrees. The drinks were fresh! I had pineapple ginger, was heavy on the ginger which I loved.  They ran out of sweet potato hash, which I wasn’t told before I ordered. I was sad but the server was lovey and she made it up! 5/5 definitely recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdlJUZHFZbTVvV0ZwTVJDMUZNMHMzYUVGeVFVRRAB",
            "text": "🙏🙏"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMk1tRlpSMVJMYzJsTGJsaFBOWFJXTVZOR1oyYxAB",
            "text": "We just googled brunch spots near me and thissssss lil spot popped up and we saw carribbean- American cuisine and was on it! He had the chicken and RUM RAISEN waffles, exactlyyyyy what I wrote RUM RAISEN !! and when I tried it off his plate we both were shocked how DELICIOUS it was believed me you will but be disappointed, I ordered the shrimp and grits and baby the coconut smooth grits were it and the sweet succulent shrimp with just the right amount of heat!!! I was very impressed from the SORREL MIMOSAS TO THE SPOON to scoop up my grits was TOP TIER!!!!! Check them out.. I'm waiting to try dinner next week!! Service also great!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNelZscG9RakpTVUZJMVRXMW9XRGRRVkRrMWFsRRAB",
            "text": "We recently held a repass at BleuNuk in Brooklyn, and the experience was truly exceptional. From the moment we arrived, the staff, especially our waitress and bartender Dione, made us feel genuinely cared for. She offered heartfelt condolences, checked in on us regularly, and even asked if we preferred the music to be turned down — a small but thoughtful gesture that meant a lot during a sensitive time.\n\nThe food? Outstanding. Every dish was beautifully presented, perfectly seasoned, and absolutely delicious. You could tell each plate was made with care — there wasn’t a bite left behind on anyone’s plate!\n\nBleuNuk isn’t just a restaurant; it’s a place where warmth, quality, and service come together. Whether you’re planning a special gathering or just looking for a great meal, I highly recommend it. Your belly will be happy and your soul fulfilled."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdVJHZHRTRXBhUm5SVFduWTVOVmxqTmxwTmJWRRAB",
            "text": "When we  (Group of 15)walk into the restaurant you were greeted warmly , ambiance was perfectly cozy staff was so thoughtful and accommodating Now, the food — absolutely phenomenal. Every dish was beautifully presented and bursting with flavor. From the appetizer to the dessert, it was clear that the kitchen takes pride in both quality and creativity. I highly recommend this restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4T1JIUnhOVmxDYlVGeFJITjRWVUpOY0ZjM1FXYxAB",
            "text": "Disappointing. \"Nice flower no smell\" is a saying...first this place perfectly. We have driven past this place several times and always wanted to try but finally did and was a no go. Not for us. After eating countless places both caribbean…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NmQwMUdabGhQU20xbmRqbG5NbWRMTUhOVWJuYxAB",
            "text": "I truly enjoyed my time here! The food was absolutely AMAZING!!! it was so good. I couldn’t even get a picture of it! The service was amazing. Really enjoyed the music that was playing and the atmosphere that was set. I definitely could see myself coming here for lunch, dinner, or even just kind of a remote work moment. The happy hour has really great prices even outside of it you get a good bang for your buck! Dionne was so dope and attentive, and made an amazing drink! I will definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padldUQkxiRWhrTUU1MWRVbEZaVzFEVlV4cWJXYxAB",
            "text": "What a wonderful experience! Food was amazing, service was friendly and the music was a good volume and very islandy. Definitely recommend for dinner."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQmNuZG9TVlpqU21jd2EwbHllVXRTVldKb1dIYxAB",
            "text": "My brother and I came here to toast our mother’s heavenly birthday, and I’m so glad we chose this place. The service was great, the iced coffee was amazing (made me wish I wasn’t lactose intolerant), and the bake and fish was so worth the wait. Will definitely come back again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJR052S2FCMTZMTGdRRRAB",
            "text": "My first time coming here I had a drink and an entree it was so good it’s rare to find a spot like this in Flatbush I would definitely recommend this place for drinks and food I never been here for brunch but I definitely will this weekend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQSEhfZHktNl9tSVBBEAE",
            "text": "Great neighborhood bar with food that looks good (didn’t eat) and good draft beer."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKdlRpUHYwdFBHVVVBEAE",
            "text": "Staff? Very personable welcoming , simply incredible. Ambiance? Nice. Food? I the Accra (fish cakes) 10 out of 10! A fav. I also enjoyed the escovitch snapper"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOT180TUx6X3JxMVpnEAE",
            "text": "The grilled salmon dish is amazing! Loved the craft beers"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLdjZsWW13ZzRHUHp3RRAB",
            "text": "Brunch was delicious, and the service was spectacular"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPdUVoSnJmNXVHZXFnRRAB",
            "text": "Amazing food and hospitality!! Shoutout to Orian! Great neighborhood spot"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLVE14TGlrMmRmcVNREAE",
            "text": "Amazing food and vibe"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcWp0b1NfOHZLZFJREAE",
            "text": "Bartender is one of the nicest people"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNeWstWlBMbDhEWFJREAE",
            "text": "I enjoyed the service, the food and the vibe. I'll definitely be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNGZDVlJnEAE",
            "text": "Food and atmosphere are very good. The staff is very professional and friendly. Special thanks to Dionne who went above and beyond to accommodate my group."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdnFHblJREAE",
            "text": "We stopped here for food and a cocktail after noticing it while riding down Nostrand looking for a new place to check out. The space is really nice and open. Loved that they had 2 TVs and a really large bar. We sat at the booth seating behind the bar with a great view of the TVs. The derby and the NBA was on and that made me happy.\nThey are a wine and beer only establishment and we ordered the sangria hoping it would not be too sweet. It wasn't and that was another plus for us. We ordered the spring rolls and oxtail pot stickers. The springs rolls were magnificent the sauce it came with was dynamite! The oxtail pot stickers were decent but probably would try something else next time. Definitely recommend the spring rolls.\nWe were enjoying ourselves so much we ordered an entree the jerk chicken pasta. It was good and I added the sauce that came with the spring rolls and that really kicked it up.\nThey had a 90s R&B playlist that was loud enough for you to hear and sing along lol but not so loud that you would not be able to have a conversation. Our server Natalie was awesome. Very responsive and was handling all the tables with ease. Her pleasant attitude made the experience here even more enjoyable. We met one of the owners and was happy to let him know that we were very pleased with our first visit and would be back.\nThis place is a gem in the neighborhood. We will be back very soon to try more dishes. Great for a date night, catch a WNBA game, meet up with friends or just a chill solo outing they will have you covered."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN2VPZktREAE",
            "text": "The coffee was delicious, the food was on point, and the ambiance was supreme. The brunch menu was great. Prices are also reasonable. Let the Caribbean music ride out more through! Lol"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcmVPakZREAE",
            "text": "Food was ok but the service was terrible. Food took an hour and wasn’t hot, no water or coffee refills. Asked for more coffee 3 times and never got it. Don’t come for brunch!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcGUzTEF3EAE",
            "text": "Jerk chicken wings were amazing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdWE2THZBRRAB",
            "text": "Our new go to brunch spot! Such great Trinidadian food with a twist. The flavors are very authentic."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc1o2NW13RRAB",
            "text": "The food was music was great. Brunch was great and service fast."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eU9XY1JREAE",
            "text": "Went during the early evening hours. Weather was still warm enough to sit outside or you could eat inside. Music was a bit loud but other than that the atmosphere was enjoyable. The waiter was the bartender so you have to wait until she’s finish to get her attention. The Bleu flight drinks were light with alcohol but enjoyable. The juice selections  is store  container  brand mixed with alcohol. I’d definitely come back as long as it’s not during prime time  hours"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3amJMRzlnRRAB",
            "text": "Lovely place. Delightful atmosphere and pleasant staff. We were a group of 10 on Sunday.  The food was good, for the most part. Of the items  ordered by our group, the best were the French toast, chicken and waffles, avocado toast and the omelette. Apparently, the sauce of the shrimp and grits, had really good flavor also but the slight sweetness of the grits took away from it a bit. I definitely plan to revisit soon."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCaHRQcXVBRRAB",
            "text": "Love the corn soup. The Escovitch Fish dinner is delicious."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmd2ZMX2tRRRAB",
            "text": "Delicious food 😋 amazing, tasty drinks 🍸 and outstanding service! Me and my bf accidentally walked in into this restaurant, and for sure, we will be back. Fish 🐟 was mind-blowing!!! Pork was perfectly cooked and seasoned, so as my pasta 😋"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ejRYTHd3RRAB",
            "text": "Best food and service in the area"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbDZ5V21BRRAB",
            "text": "Such a Vibe... Service Great food delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYLS0yV0NREAE",
            "text": "Always a great experience. Food is great good vibe as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIZ3VTWkp3EAE",
            "text": "Thank You Bleu Nuk for providing the neighborhood with another amazing dinner and drinks spot and helping give Nostrand Ave the fun, cozy and well-used vibes it has been giving off lately with a string of interesting, fun and cool spots. Loved the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aUlXUmtRRRAB",
            "text": "Nice little place for breakfast, very kind staff but don’t expect to get an espresso ;-)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybThYOVZBEAE",
            "text": "Excellent food and amazing staff. The owner is a gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycXQ3eEx3EAE",
            "text": "Great customer service.. Food amazing too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNTZDM0xnEAE",
            "text": "Stopped by for a late lunch and the food was great. The jerk smash burger was so flavorful and the fish and chips fresh! We’ll be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdk4yNTFRRRAB",
            "text": "Mac n Cheese pretty oily. Had high hopes. Bakes with fish, didn't expect batter and deep fried. Disappointed. Fries were really good though. Needs more vegetarian and kids options. Pretty pricey Brunch menu. $100 includes tip.  Overall could be better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdE5PRlNREAE",
            "text": "I am utterly appalled by the abysmal quality of the food at this restaurant. Not only was it overcooked, but also undercooked, demonstrating a complete lack of culinary competence. I cannot stress enough how strongly I discourage anyone from dining at this establishment. Save yourself the disappointment and seek out a restaurant that actually knows how to prepare a decent meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6NXNtZjZnRRAB",
            "text": "Consistent! I’ve been many times and no complaints. Food and staff are amazing! Get the codfish fritters. Salmon or jerk burger and the pasta! The bake for brunch is also so good. Attended a private event and it was executed seamlessly. Photographer was great as well- not in your face but got great shots of every detail and everyone."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aWVQN0dBEAE",
            "text": "I can’t say enough about this wonderful new restaurant. The food is absolutely delicious! Omg, you have to go for Taco Thursdays. The best tacos you will ever eat. Everything on the menu that I’ve tried has been like a party in my mouth. Dionne, the best bartender in NYC, is just a delight. She makes the best and most beautiful cocktails/mocktails I’ve ever seen. She is welcoming and keeps me coming back for more. This is my new favorite neighborhood spot. People let’s support this wonderful addition to our neighborhood. Looking forward to many years of fun at this great establishment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUN2VhcWFREAE",
            "text": "Superb customer service. Great food. Love this place for happy hour and also brunch. Haven’t had dinner yet but soon will!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMXNmVVFREAE",
            "text": "This was an ehhh experience.\n\nWe had to wait 15-20 minutes to be seated, awkwardly standing around in the front of a rather small place. The service could have been significantly better, especially considering that it was Mother's Day.\n\nIt took about 10 minutes to receive a menu once we were seated, only to discover that it was a very limited Mother's Day menu. We should have been notified about this when making reservations, or while waiting those 20 minutes to be seated, or even during the first 10 minutes we spent at the table reading from the regular menu online. My experience is somewhat unique as I didn't have access to the full food offerings Bleu Nuk provides. However, the waitress was very dismissive about the last minute menu change, and her attitude really dampened the vibe because we just wanted to celebrate and enjoy a good meal for Mother's Day. We didn't feel welcomed, but it was too late to find another place, so we stayed and ate from the limited menu. They even gave us a hard time about making simple substitutions like replacing chicken for shrimp scampi for my two siblings who are allergic to seafood and had to make do with the few options available.\n\nThe food was pretty good, but the portions were small and not worth the final bill or the service. Inattentive waitress, forgetting to bring drinks, bringing the wrong food to the wrong table multiple times, needing to ask for simple things like syrup for waffles multiple times. Once again, my experience was unique as I didn't have access to the full menu, but I wouldn't go back or recommend it to anyone else because the service was slow and inconsiderate."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd19tMWRREAE",
            "text": "Delicious food and amazing service. really chill vibe! what else can you ask for"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdnJYdFBBEAE",
            "text": "Best food I had in a long time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqN3JDV2FnEAE",
            "text": "Great food, great service,  great drinks and great atmosphere. I only suggest increasing the portion size of the chicken on the chicken and waffles and adding some salt. Everything else was PERFECTLY seasoned."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcWJLMzd3RRAB",
            "text": "Chill vibe with lovely folks. Great spot for a beer and a bite. Get the spring rolls!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdHBLZ29RRRAB",
            "text": "A fantastic new addition to the neighborhood!!!\nI love everything about Bleu Nuk Bk.  For starters, it's simple, elegant style with great attention to the nuanced detail of comfort go a long way.  Minimalist yet padded bar stools are a key factor, gorgeous lighting,  beautiful wall design, and rustic chic bar shelving with excellent glassware are just a few of the things that immediately elevated your experience.\nThe staff is noticeably happy, which tells me it's well run by caring owners and  great management.\nThe menu is a beautifully curated mix of delicious local favors with a modern yet classic approach.\nEverything we tried was a taste sensation, made with great love.\nThe mussels stood out in high regard for me. It was a nice appetizer portion, with full sized tender mussels which is a skill in itself,  but the great surprise was how well this heavily garlic broth stood out.  Garlic can be tricky,  and is often the gross, prechop, often rancid, kind, and when I saw how much garlic was in this dish I was ready to be disappointed but to my great surprise it was one of the BEST, most well prepared, garlic forward broths I have ever had!!! It has to be fresh and it has to be added to the mix at the right time, and this chef knew exactly how to handle every ingredient.  Just spectacular!  My coconut rice chick pea was comforting but still light. My anti pea, nut, legume husband absolutely LOVED my dish and much to my surprise,  he couldn't keep his fork out of my dish!.  That's high praise!!\nHis steak dish was so flavorful and expertly cooked, still soft, juicy med/rare which is rarely(see what I did there)  accomplished on the thinner cuts. We loved everything about it.\nAll the sides were bursting with flavors.   Nice quantity to feel satisfied without feeling too full.\nThe only suggestion would be a few additional wines to round out diverse pallets.\nWe're so excited to have another great walk to restaurants in our growing food destination neighborhood! Enjoy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkalp6NmR3EAE",
            "text": "Came here for brunch for the first time! Ordered the chicken and waffles (red velvet) and it was so good. The vibe was great and the waitress was extremely attentive and kind. Will be visiting again soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROX3BPRVJnEAE",
            "text": "Who said the party has to stop once brunch ends?\n\nI don't who said that, but I do not agree and neither does my girls. So we ended up at Blue Nuk BK after brunch. Again they have been previously but this was my first time.\n\nAs the first timer, I followed their lead and let the vibes flow. We had drinks and while I do not remember the names (one was definitely a rum punch) they were amazing.\n\nThe drinks and the ladies serving us was so amazing even you we only stop for drinks we sat so long enjoying the cocktails and atmosphere we decided to get a couple of things to nosh on. Sweet plantains and shrimp tocos.\n\nI honestly can't wait to go back.\n\nJust A Note:\n\nBe prepared to call an Uber because you will get here and forget all of your worries."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaN0l6NVF3EAE",
            "text": "The food was good. Except for my dush. The crab and dumplings. The dumplings were too hard. And I didn't expect to have to literally crack open the crab. The flavor was good, though. Intried my sister's salmon and coconut rice. It was delicious, and the shark my brother in law had. Oh, the jerk chicken rolls were good, too. The rum punch was really good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScjZPRWlRRRAB",
            "text": "Great food, drinks, and service.  Dope new spot that definitely feels welcoming and chill. Cool after work spot, too, esp with weekly events like karaoke."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MnAyRlBnEAE",
            "text": "First coming here date night with my boy friend and actually I am having dinner right now everything is so good ! I ordered the salt fish fritters oh my god !!!! Small black own business I really really enjoyed the vibe the food the drinks - drank one drink spicy mango margarita and I’m lit !!! Please come support them you won’t disappoint they take\nThere time making food but it’s worth it !!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadGNMVEdREAE",
            "text": "The restaurant staff was amazing. Some dishes were spicy, but the flavor to me of all of the  food was amazing. Hey, the service was awesome. Of course, the drinks were excellent. Thank you to the beautiful service of  Bleu Nuk and to the staff. Great job. So I tried the tacos; and they were delicious as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNTREUlJREAE",
            "text": "Where have I been? I did not know this gem\nExisted! I had the most amazing brunch date here with my bae. The food was delicious. We had the curry crab and shrimp and grits. I am very picky and have zero complaints about the food. Dionne was such a beautiful soul. She made me and my guy feel so at home and made us some awesome special request cocktails. The vibe was also so chill. We will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxX3ZfYUJREAE",
            "text": "The food was amazing, didn’t take long at all. All employees were kind and respectful, Definitely coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0cU1heDdRRRAB",
            "text": "Okay hands down the best jerk chicken tacos ever ! As a food Quality person that that knows the FDA guidelines and deal with food everyday I love this place. Made reservations just in case it was packed didn't want to wait. They were so friendly and give us three choices on where we want to sit.  My boyfriend had the Tropical drink and I had the brukup I love his drink my drink was okay just Minty and strong. I order the Jerk chicken tacos and jerk wings 10/10 Great!!!!!!My Boyfriend had the E. Fish which he try for the first time really good I taste a little bit knowing I am not a fish person.  The servers were great and so friendly!!!!!  My only feedback would be play or have better music maybe reggae or Soca but like the old times ones. I highly recommend checking out this restaurant for a date night totally worth it!!!!\n\nQuality of food: 100%\nService: 100%\nDrinks: 90%\nFood: 100%\nParking:  50% depending on the day and time"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMzdiTlBREAE",
            "text": "We had a great dinner here.   Food I had a Caribbean vibe and both my wife and I were impressed by how well everything was cooked.  I had the corn soup — it was excellent.  The sweet plantain appetizer was superb: a nice light caramelized covering that was almost crispy, over a perfectly cooked interior.\n\nThe whole experience was a pleasure."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaM3FEQnFBRRAB",
            "text": "Friendly welcoming atmosphere. Staff make you feel like you're one of the family. bartender Dion is a very creative mixologist.\n\nTaco Thursday has a good variety of reasonably priced and good size portioned tacos.\n\nI'm looking forward to being regular."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxMXAtS2NREAE",
            "text": "Angus burgers, fries, codfish fritters, plantains. Everything was excellent. The sauces were so good. Staff was fun and friendly while we waited. Music was good. Will be back again ASAP."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdS15ZnRRRRAB",
            "text": "Today experience was different than my first time in September. I have no problem at all with the food. Today, we got corn soup, oxtail & pasta, chicken & waffles, angus beef with fries and Mac & cheese to take out. As we’re waiting, we decided to get Sorrel and Mojito and jerk chicken rolls. Here is my problem with the service. The sorrel was already made it was just served. They did it and bring it to my husband and I have to wait for my mojito because the bartender was busy talking and entertaining other customers. The mojito had way too much mint and the jerk chicken rolls were cold. The sauce was good.  I was about 5 minutes away from home, so I was expecting my food to be hot enough. The soup was hot and the Mac and cheese. The rest were cold. My dissatisfaction included the food temperature. The environment was good. Good vides and nice music."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbHJhSjJnRRAB",
            "text": "I think I just found a new favorite spot in Brooklyn! Walked in on a Saturday evening (around 7:30pm) and the restaurant only had two families seated. By the time we left around 9pm, the whole restaurant was packed. Im sure it would be helpful to make reservations especially on weekends.\n\nFood: was delicious! The appetizers we ordered were plantains which were perfect and the jerk chicken egg rolls. I like the concept of the eggrolls but i think it could have used more seasoning and stuffing. I ordered the Ragamuffin pasta (rastapasta) w/ salmon and it was flavorful and seasoned well. Boyfriend ordered grilled salmon and he cleaned off the entire plate.  Dessert was bread pudding w/ ice cream and it was delectable.\n\nDrinks & Service: were top notch! Our bartender and server, Dionne was so sweet but a badass behind the bar. Her customer service was great! Those drinks were 5/5!\n\nAmbiance: spacious, clean, good music & bathrooms were clean as well.\n\nLooking forward to coming back for Taco Thursdays!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdXVyM2tRRRAB",
            "text": "They have a good thing on here but could use some tweaks. The atmosphere ia great, music great. Food portions great. However, i think the pasta i had could use a little more flavor. Flatbush is changing but please lets not have another Carribean restaurant that turns down the flavor and spice to appeal to the new folks moving in.\nI was here on a Thursday night and dining areas was empty but the bar was full.  It took 30 minutes to get my drink order (Non Alcoholic) and another 10 to get out appitizers. The entrees came out 5 minutes later. That was annoying. I hate when i am getting everything all at once. I understand its a new businesss. I'd like to see it thrive but please make a few small adjustments.\n\nJerk Chicken EggRolls were great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdk96Mkp3EAE",
            "text": "The lamb burger was really good, great flavors! And the pineapple ginger juice was so tasty and refreshing, most places hold back on the ginger but this was perfect because you got the flavor and the kick from the ginger."
        }
    ],
    "reviews_count": 67
}