{
    "name": "Flatbush Thai Corp",
    "place_id": "ChIJ01oue9JbwokRl_M5L9hBzB8",
    "grid": "BK9",
    "address": "561 Flatbush Ave, Brooklyn, NY 11225, USA",
    "rating": 4.5,
    "user_ratings_total": 151,
    "phone_number": "(347) 240-7462",
    "reviews": [
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treE9YcHBVa2RyTlVkdVZIZGFZWEp0VUV0RVVYYxAB",
            "text": "Pineapple chicken curry out of this world"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMFpsb3lOUzF3VUZWdFlWbFhUWEpvT1RGNE5tYxAB",
            "text": "I often have padthai for lunches, they have the best PadThai with authentic flavor in Brooklyn"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MmRIbFdTa05sWTNONWNTMTFjaTE1VDBOR05FRRAB",
            "text": "This place is a gem! It’s a small space, so I recommend takeout. The menu is small too but everything is delicious and the prices are super reasonable. Their curries are spicy but that’s a good thing in my book. They also have some good early bird and cash specials."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnc3J1ZDNBRRAB",
            "text": "Tasty and very good portion sizes"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adVZWWTRVSE5IVTFreFdYcERNSFJZT1hOVE9WRRAB",
            "text": "Food is yummmm"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMU9WbEZWbmhoVm00d1IzcElSRXM0UVdsT1oxRRAB",
            "text": "Delicious pad see ew and pad Thai!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMFNHSnpPVmhYYVdkTFdFVkRaVzh3Tkc5YVNIYxAB",
            "text": "Thai Tea is the best!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNNzQtdW01d052QnZnRRAB",
            "text": "I ordered online and they canceled my order without any warning or further information.  We were left hungry and scrambling for what to do for dinner."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnb2MzS3NRRRAB",
            "text": "Have dinner with my daughter on Valentine days. It was a great experience . The place was clean. The food very tasty and well presented. Customer service amazing.I will definitely go back and recommend others to go."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNzVuSXFBRRAB",
            "text": "Quick service and friendly staff. The food comes in great portion. I got Pad Thai with chicken."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdDZ5OU1nEAE",
            "text": "Absolutely delicious. Food came quickly, portions were great, everything was hot and fresh. This is everything you’re looking for."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNC0zUmZBEAE",
            "text": "Unparalleled Pad Krapao 🙏🙏🙏"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMXVxc053EAE",
            "text": "Wonderful food and a very reasonable price!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaTdMVURREAE",
            "text": "We loved our meal at Flatbush Thai! Every dish was prepared fresh and was delicious. The portion sizes were HUGE and the dishes were affordable. So glad we discovered this spot :D\n\nOverall, food was amazing, service was friendly and quick, restaurant was clean and comfortable.\n\nI got the Tom Kha soup and the Chicken Pad See Ew. The soup was perfectly balanced with coconut creaminess and lemongrass tanginess. The pad see ew was also great — loved the chewy, wide, flat noodles and the sauce.\n\nMy friends ordered basil noodles, chicken pad Thai, eggplant, and pad kaprow dishes, and everyone loved what they got!\n\nI can’t recommend Flatbush Thai enough — can’t wait to visit again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNUxEY2FnEAE",
            "text": "Love this place!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNjZQdEZ3EAE",
            "text": "This is our go to neighborhood Thai restaurant. The food is delicious"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2Z2RUZE93EAE",
            "text": "Down to earth place"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2N0w3aDN3RRAB",
            "text": "It is our favourite cafe in this are! Pineapple fried rice is so delicious!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQLThyZU9nEAE",
            "text": "Great price , great food"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NWQyZUhnEAE",
            "text": "This place is a gem. Great price and portion. Chill dine-in atmosphere. Best Thai food around Prospect Park. After a long day at work, I come here for my comfort food: pad thai, basil fried rice, or pad see ew. As someone who is Thai, this place makes pad see ew just like my mom does. Their kua kai noodles, papaya salad, and pad kaprow remind me of Thai street food. Everything is just so good here and the owner and staff are super sweet and friendly. Also, highly recommend their takeout CASH MENU ($9 pad thai, $9 basil fried rice, etc)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNILWQtVlZBEAE",
            "text": "I love their food. Anytime I get a change I’m there!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIekxTdldREAE",
            "text": "Placed an order about 30 minutes before close and the food as well as service was amazing! Really good pad thai, lemon thai iced tea and spring rolls. Probably the BEST thai food in the area (especially below Prospect Park). 11/10, cant wait to be back! The team is very welcoming and cater to customer needs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MWVHdi1BRRAB",
            "text": "Consistently delicious. In my neighborhood and I go all the time. Been to Thailand and ate like crazy there, this spot won’t disappoint.\n\nBasil eggplant is delectable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiLXJ2czlBRRAB",
            "text": "Can’t beat the $10 pad thai cash special !! Solid for the price"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaXZmODlnRRAB",
            "text": "Delicious Pad Thai!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyLTZPRDhRRRAB",
            "text": "Love this place! I ordered pad thai chicken and red snapper basil sauce to share with my wife. My wife loves the fish! The waitress is very friendly and helpful. We’re definitely coming back to try more dishes."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6Z19LQmtBRRAB",
            "text": "First time ordering and wanted to go in person. Got it to go, and wanted to try a rangoon to see if it was worth it and the girl at the cash register said we couldnt because we would look \"ghetto\" like in a \"chinese restaurant\"... whatever that meant.\nFood taste great but dont think we'll be going back!\nMe and my friend are carribb and she really just made us feel unwelcomed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMM1oyVGtRRRAB",
            "text": "Delicious! Food is great, super flavorful and just the right amount of heat. Portion sizes are good and so are prices. New spot for whenever I want Thai"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMd29uZWlBRRAB",
            "text": "I went to the store on 06/15/2024 I ask for 2 orders of 3 piece wings with fried rice and I was giving the wrong order instead I received 2 fish with rice instead I called to rectify the mistake that was made and the young lady that works there was very rude over the phone and was mad because I didn’t look at the receipt I told the you lady that I thought you heard me so I waited 30 minutes to receive my fixed order and then I arrive back the lady embarrassed my in the store and scolded me because I ate some of the rice I said because I had to wait so long for the wrong order regardless it was a mistake that she made also mistake that I made by not checking my receipt but she as a representative that serve people food could’ve understand the miscommunication because I did and I wasn’t upset but the way she treated me in front of customers in the store that was sitting there eating was rude and embarrassing and I will not ever go there in life ever again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bzY3bkNREAE",
            "text": "I randomly walked into this place on a whim after a trip to the hardware store.  Never would have guessed its the best Thai takeout in the area.  Unassuming but the flavors are undeniable.  I got takeout that time, then delivery the next day.  Pad thai- you can taste tamarind and fishy umami; massamun -was the best ive had in a while, rich and savory.  Papaya salad was too spicy for me to eat but i was lowkey expecting that so i can't be mad haha."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6bnIzSXBRRRAB",
            "text": "Einfach, gutes Essen, höflich und sauber (auch die Toilette). Hier würde ich regelmässig essen, wenn ich in der Gegend wohnen würde."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6dktyMEN3EAE",
            "text": "The Pad Thai was amazing! Good portion , fresh and flavorful:)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqamQ3YU5REAE",
            "text": "The pad Thai was wonderful! Great food, very affordable, great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaUx5Qm53RRAB",
            "text": "I got the vegetarian pad Thai.  Chef is putting  way too much vinegar in the food.  I like sour tastes but this is too much.  I called the restaurant and she said that's the way it is and then hung up."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcHN1ZXVnRRAB",
            "text": "Great curry taste\nWell spiced"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5ak5IZTl3RRAB",
            "text": "The Red curry Vegetable is always so hot, fresh and the taste is amazing. They deliver to your front door if you have cash and they deliver if you go to their website and pay using your debit card/credit card. Great place to eat and very good prices for Thai."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cU1UNmdnRRAB",
            "text": "10/10 MOST AUTHENTIC PAD SEE EW IN FLATBUSH 🤩🤩🤩!! The customer service is great and the food is even better. I always order a “Chicken pad see ew” with a “Thai iced tea” and it never disappoints ! 10/10 for appearance, portions and flavor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkOWZ2VjdBRRAB",
            "text": "Ordered delivery several times. Super consistent and the delivery driver is nice!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROM3RDQkZ3EAE",
            "text": "Food is excellent and portion sizes are generous."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd2RQRVFREAE",
            "text": "yummy food and the lady was so nice too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGdGVqQmhRRRAB",
            "text": "Had this delivered. The pad Thai was delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGOVpmbTZRRRAB",
            "text": "Really yummy!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c3BHQ2p3RRAB",
            "text": "They got a B restaurant rating from the city, and when I went on the health department’s site to see why, it said “evidence of live roaches”. Never again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1dk83T2xnRRAB",
            "text": "I suspect the recent positive reviews are fake as this place was not a good dining experience. Upon entering we were ignored by the only person working who continued to sit at a table and slurp soup. We decided to seat ourselves.\n\nIt is dingy and feels unclean inside. I noticed a B health grade sign and was surprised it wasn't lower. We decided to order to go instead because of the rude service and unpleasant interior. Upon reflection we should have walked less than a block north and dined at Amy Thai instead, but we decided to trust the positive reviews and take a risk. I ordered a pad Thai and spring rolls. Although the portion was large for the price, the food was very bland and tasteless, lacking key ingredients like peanuts and beansprouts, and so most of it was thrown away."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1b1pYWXhnRRAB",
            "text": "It was all very good but the papaya salad was great!  Just the right amount of spicy.  The Thai tea was also good.  The service was very friendly and helpful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNmFYR1ZREAE",
            "text": "Sweet and spicy chicken was good, but nothing I'd go out of the way for. To be honest I was in a rush and needed to quickly pick up some lunch before heading back to work and just ordered without too much thought. I would go back again and try one of their signature dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaWMtb3F3RRAB",
            "text": "It did in a pinch, and I will absolutely come back for takeout. The eggplant and papaye salad are delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURad1p6dVpREAE",
            "text": "The fry chicken wings is extremely salty. I called to complain and she told me that the fry chicken is packaged food. Do not buy the wings. You will feel salty and upset.\nMy husband got the pad Thai chicken. Flavorless & salty as well. The shrimp roll appetizer was okay but I have had better. I will not order from here again. I feel like I just wasted $50"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabF9xYTZ3RRAB",
            "text": "Ordered through Uber eats. The order never showed and Flatbush Thai was totally uncontactable. Uber Eats told me Flatbush Thai does its own delivery. Do not order from them"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNablk3RTJBRRAB",
            "text": "Flatbush Thai Corp is located in a cute and lively neighborhood, I really liked the view, my creamy Pad Thai with lots of squid rings, the place itself, and the owner/manager Cobi (please correct me if I mistaking). Will come again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSMVpLUDN3RRAB",
            "text": "Tasty Thai food at excellent prices (and large portions)!\n\nI had the pad Thai (4.5/5), garlic chicken (5/5), tom kha (3/5), Thai iced tea (4/5 - a little bit too sweet and the restaurant portion is smaller than Togo), and the crab rangoons (4.5/5 - super stuffed)!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdmZLeHR3RRAB",
            "text": "I went to visit Flatbush Thai again with my friend today. They have some new items. We tried creamy spicy Tom Yum Seafood and Kua Kai! Highly recommend both!\nWe love the food and service here! We'll be back soon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXd3BxcXF3RRAB",
            "text": "We found this new place just opened up! We ordered chicken Garlic and\nBasil Noodle chicken for takeout. We love the food and they are very tasty and reasonable price and portion! Highly recommend!  ##Flatbush Thai  ##The best Thai food in town."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlM0xQQ2x3RRAB",
            "text": "What a gem! It’s great to have delicious, authentic and flavorful Thai food in the area. I loved the chicken pad Thai and the shrimp basil noodles! This place is a must try."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OWMyYmZnEAE",
            "text": "First time ordering from here. Got the spring rolls, chicken wings, and Thai rice with shrimp. It was really good, very flavorful too"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadXJYUDZ3RRAB",
            "text": "I got the green curry for lunch and it was sooo good! It came with a side of rice. The portion was pretty big and I had enough to take home. The employees were nice and attentive too!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPblBqM2x3RRAB",
            "text": "The best pineapple fried rice with seafood (shrimp and squid) in the area. I also try the Rangoon for an appetizer. Everything is delicious. They also recommended to try the Basil fried rice. I will absolutely be back soon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bExuQVF3EAE",
            "text": "Excellent spot had the papaya salad seafood Thai fried rice spice was excellent on point Thai iced tea very refreshing especially fresh and crisp papaya in the salad"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCemVQU0d3EAE",
            "text": "Small, chilly, no frills restaurant with a few tables and no Thai beer or alcohol (boooo!). Appetisers were better than the entree. Tamarind Duck was overcooked and dry AF."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXZ3J5bjdnRRAB",
            "text": "Pick up my lunch, tofu green curry and chicken basil fried rice. Super delish! Must try!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCbmNlbDNRRRAB",
            "text": "This is a great neighborhood Thai spot! I got the spicy basil eggplant and pad see ew. Both were excellent, and the portions were generous. Overall I found the place reasonably priced. They offer free delivery within a certain distance if you order off their website!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcFotMzZ3RRAB",
            "text": "Amazing new Thai place in the neighborhood!\nThe food is tasty and fresh.\nWould recommend the Pad Thai :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSa055NzZBRRAB",
            "text": "Love the food, presentation, and ambiance here. Really comfortable space to eat by yourself or with others. Great price, portion, and options for food. The food is DELICIOUSLY fulfilling. One of the best Thai foods I've had. Come and enjoy the space and food. Thank You Flatbush Thai. Will be back. Was so excited about the food I forgot to take pics for review. Sorry, will update next time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcjZfejlnRRAB",
            "text": "Amazing Thai food with a cash discount! Their ingredients are so fresh and the lychee ice tea has real lychee in it, which I really enjoyed.\nWould recommend getting their veg dumplings, pad Thai, basil fried rice (fav)! Always love a place with so many veg options so well made."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMWJERWVREAE",
            "text": "Thai food is fresh and closer the the flavor profiles you will find in Thailand! The green curry was amazing. The red curry was too salty but I will not hold it against them because of the other food we had. Prices are also reasonable for NYC!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbWFlZ2tRRRAB",
            "text": "Seriously the only place I’ll order from. Pad See Ew with chicken is my fave but Pad Thai is also really good, saucy but not super oily like at other places. They’re very nice and prompt and I think one time they forgot my iced tea but I don’t even care because it’s a gem of a spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNW9DYWFREAE",
            "text": "Some of the best Thom Yum soup I have ever had. It’s so flavorful and it has a good spice level. It’s sweet spicy tangy and umami all in one! Pad See Ew was also delightful."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbjhPX1hnEAE",
            "text": "Love this new place! I ordered basil noodle with shrimp and basil fried rice with duck! They gave half of crispy duck! So generous! Service is so friendly and sweet!  Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaW8tZG5BRRAB",
            "text": "Fabulous,  flavorful! Wonderful service, professional staff and affordable prices. I used to only go to Amy but I have to say this spot is way better. This spot deserves every 5 star rating they get. Good job Flatbush Thai Corp! Thank you!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cnBlWHdnRRAB",
            "text": "The food was fantastic, affordable and large in portions! Definitely a good place if you want to get local Thai food in Brooklyn! The staff is very kind and respectful!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNFlyUEZBEAE",
            "text": "FOOD IS AMAZING!!!!  I was nervous to order from a different Thai spot then I usually do, because I am from queens,  but this one outbeat my queens location😲. If you love thai food order from here you won't be disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cnUtYVFREAE",
            "text": "Flatbush Thai has delicious and authentic Thai food. The appetizers are great, especially the crab rangoon, and the entree portions are very generous. Highly recommended!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeXZUQy1BRRAB",
            "text": "The food was really delicious and filling, the restaurant is very clean, and the owner is very nice! Price is very fair and there was a cash special between 4-6pm as well. Definitely one of the best Thai restaurants for its value."
        }
    ],
    "reviews_count": 73
}