{
    "name": "Prospect Pizza Brooklyn",
    "place_id": "ChIJJ_INRRNbwokRcOEGP3HS4gU",
    "grid": "BK9",
    "address": "599 Flatbush Ave, Brooklyn, NY 11225, USA",
    "rating": 4,
    "user_ratings_total": 379,
    "phone_number": "(347) 663-4410",
    "reviews": [
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNGVGaG9Uek41TFVscFMzUjFVVEo1VVdZM1ZHYxAB",
            "text": "Actually my favorite pizza in NY. Best vodka around. Little on the sweet side, which is definitely my thing, but might not be yours. The dough, the crust is perfect NY style."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eWVYRkJSR3RXYXpobk9ERkxWR3hsYkVKdllVRRAB",
            "text": "Shitty pizza and even worse service"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeWIzbDBMV2xQTVRkNGVFaGZWbGhRY25wS2JHYxAB",
            "text": "Solid 2 star pizza with unrealistic price. Meatballs were old, dry, and overcooked. Pizza tasted sweet for some reason? Highly doubt they use fresh mozarella..."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcGNtUllSVVV3VTBGdGNYTnZlRU16VURCdmJVRRAB",
            "text": "I would highly advise checking the expiration dates on the drinks , grabbed a drink from there and it was expired by a whole year 😡…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMU1UVm1Ta0pST1dGU2NqVk1lalV0ZVVFeFpGRRAB",
            "text": "It's okay. Very average tasting pizza. Also, they charge more for their two slice special than they do on Wall St. Pretty insane."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMGRsbFBXWEYxWWpsemVUSjNOVmRtWDNoRWRHYxAB",
            "text": "We ordered a plain pizza, chicken bites, and garlic knots. Everything was delicious!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkV1ZtRkNSbmxZU3pWNFRrdHBNV1k1ZFRsUmVsRRAB",
            "text": "Subpar crust, bad cheese, cheap toppings. Truly just overwhelmingly mediocre."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUU9YVnFUVkJ3TFU1eFdqSlBURGRZVm14V00zYxAB",
            "text": "This is a true hidden!  We absolutely loved the pizza.  The garlic knots are zeppoli were also delicious.  We stopped here before our walk through Prospect Park over the weekend and figured we would fuel up before the outting.  We have our usual go to pizzeria a few miles away, but this place happened to be conveniently located along our route for the day.  It was around noon on Saturday and the place was relatively empty so it seemed like the perfect opportunity to try someplace new.   We were not disappointed!!  Our slices were amazing and absolutely delicious!!  The staff was kind and patient, and we ended up coming back again for more food to go after our walk.  These are the places that make your community so awesome.  Great eats nearby is always a good thing!!  We will be back!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYkVwTVNxbnFpZ2dRRRAB",
            "text": "Pizza by the slice FTW. We stopped by for something quick and easy, and that’s exactly what we got. We opted for Margherita, chicken bacon ranch and a couple slices of pepperoni. Helpful staff and yummy NY-style pizza…. doesn’t get much better than that."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNS081cXlwMVkza1JREAE",
            "text": "Las slices perfectas para acabar el día en Brooklyn."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcl8zSzRBRRAB",
            "text": "I called to order pizza over the phone and the woman  mentioned that she need my id to scan it into system. Have anyone else heard of this before ?Is this something new  ?? I’m really curious to know?"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaWJlbTBBRRAB",
            "text": "I only go for pasta Bolognese wit penne it's so good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbUxDYjNBRRAB",
            "text": "Pretty sure this is where the ninja Turtles get their cheese pizza"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMy1hZEtREAE",
            "text": "Ordered pizza for Superbowl a day ahead of time. Called after it was an hour late and they said it would arrive in 15 minutes. Called again when it still hadn't arrived and hour later they said it was out for delivery. Called again another hour later and they said it was 15 minutes away, when I told the woman on the phone I'd been told that 3 times now she hung up on me.\nThey then claimed they delivered the pizzas and refused to refund me"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBODVhZDNBRRAB",
            "text": "$10 credit card minimum at a pizza place? Just lost a daily lunch customer."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOVBUVXZBRRAB",
            "text": "Traditional grab a slice and go. Not much seating but great for take out"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2X1BlMlV3EAE",
            "text": "We ordered take out. Pizza, chicken wings, and Caesar salad. My husband loved his buffalo chicken wings. I found the pizza to be lackluster. Not true New York style and for some reason they only put the toppings on one side. The Caesar salad was great, but there was not enough salad dressing."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdWZTNkNREAE",
            "text": "This is a great spot. Love their margherita!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubDU2a0R3EAE",
            "text": "Hair in pizza smh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcklDX01nEAE",
            "text": "Real great pizza place and super quick perfect service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURic2JXVjh3RRAB",
            "text": "I had delivery from this restaurant I've never been there so I can't rate the atmosphere but the service was pretty quick"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycHV5SkdnEAE",
            "text": "Great service and great pizza 😋🤤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MEp6NnFBRRAB",
            "text": "Owners treat staff badly! Down talk them and just plain rude to the workers. Will not order from them again!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcllDb0p3EAE",
            "text": "Great pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENGFmSWpBRRAB",
            "text": "Great local pizzeria.\n\nGot a margarita and Buffalo chicken with blue cheese. Crust is thin but has a nice crisp. Margarita sauce was tangy and sweet.\n\nAppreciate that they take credit card."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5a3JmcGVnEAE",
            "text": "Best pizza on the Lincoln/parkside stretch of Flatbush."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5OWE2Z0xBEAE",
            "text": "Horrible disgusting place, I do not recommend anyone to visit. the girl at the checkout is boorish and rude"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkaUkyc2NREAE",
            "text": "Generic. Nice bed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdGRya1hREAE",
            "text": "Noting memorable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaWRIY19RRRAB",
            "text": "Actually those kinds of details have to be secret it's the cood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOeHUyR2FREAE",
            "text": "Great pizza and fast friendly service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxenQyU1FnEAE",
            "text": "tried many pizza store since moved nyc a year ago this is one of best pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsbTh2RDVnRRAB",
            "text": "Recently ordered from there for delivery. Delivery was over an hour late and the food was cold. They were extremely difficult over the phone and refused a full refund because we weren’t sending back our food when we needed to eat. Delivery driver was dismissive and laughed in our faces when we confronted him about how late the food was, repeatedly telling us it wasn’t a problem. It’s not the first time the delivery has been late, but the first time they were thus rude. I will never be ordering from here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseXVHdmpRRRAB",
            "text": "Had the margherita pizza. So delicious. Lots of cheese slightly sweeter sauce And crust was perfect blend of crispy and chewy went back twice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcHFmYzdRRRAB",
            "text": "Terrible service.\n\nAnd as if that wasn't bad enough they have absolutely zero compassion for a sick little kid.\n\nThey would rather watch him have a bathroom emergency with this sick smirk on their face then let you use the bathroom after begging and offering any amount of money they want for it.\n\nThese are awful people and I hope their business closes.\n\nApparently they sell rotten food too so overall just go to the pizza place right down the street, you won't be financially supporting a monster."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1M29fdEpREAE",
            "text": "Amazing pizza and no delivery fee! Love this shop!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaM2ZQd2xBRRAB",
            "text": "I waited 35 minutes for a large pizza!!!!! It’s expensive for the taste !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabmVEeTdBRRAB",
            "text": "The plain slice is very nice. Classic thin crust, really good sauce. Friendly service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdkl1N19nRRAB",
            "text": "Good pizza, recommended"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKM29QdkFREAE",
            "text": "Delicious 👍🏿👍🏿👍🏿 thank you guys 👌🏼👌🏼👌🏼"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbk5YVjVBRRAB",
            "text": "The food is good, fresh, tasty every bit 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MXFLeVVREAE",
            "text": "Best pizza in Brooklyn and the toasted almond cake is sooooo good omg 😋😋…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdl9HTkpnEAE",
            "text": "Chicken parm was good. I asked for penne pasta instead and that penne was in the vodka sauce I’m going to assume. Either way it was freaking delicious with out the chicken. The pasta comes in a separate pan from the chicken. The grilled chicken with pasta was delicious. The grilled chicken was slightly salty but the spinach was great, not soggy or oily. Cooked perfect. And I had a slice it was great and fresh!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeS1uRDB3RRAB",
            "text": "Good good"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcjQtenZRRRAB",
            "text": "Best pizza spot in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSanF5ckV3EAE",
            "text": "Do not recommend based on today's SliceLife delivery experience. I live 0.6 mi away. Ordered a single large pizza at 3:27pm, arrived cold 4:34pm. It's good pizza - just order 75 minutes ahead of when you want it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaXNqQlJBEAE",
            "text": "Very very slow"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobWVqb3BBRRAB",
            "text": "Received a cheesesteak with leaking, moldy green peppers and twice fried fries. Grandma pizza made with stale 99 Cents Tomato paste.\n\n$50 for old rotten food and owner bold- facedly claims it's not his.\n\nNever eat here\n\n*Edit*\nThe Rotten Smelling Food you so keenly mentioned was purchased from your establishment, with reciepts.\n\nThat picture is of the Rotten bell peppers I gave safe passage into the trash.\n\nI returned to your business with your Rotten Food on my time, to offer you the opportunity to give me a refund as a courtesy, not because I need you to get one.\n\nDue to your response, you still lost that $50, in addition to everyone on Google now being aware you sell Rotten Food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoekxpVThRRRAB",
            "text": "Great Pizza terrible service.Counter girl has no idea what's going on. Need to train her properly on counter and customer service Paid 18 dollars for a salad with grilled chicken only to get cheated and have to walk back to store after a delivery to get more chicken for salad. Barely anything more then I received the first time. Girl tried to argue on phone and I went straight there they had another small batch of chicken waiting getting cold. Glad I came to grab it. Prospect Pizza these thin shavings of chicken I am sure make you money but if your gonna give me ice berg lettuce I should be able to get a full chicken breast not thinly slice fillet chicken breast for 18$. Again great Pizza bad everything else... Recommendation: stop cheating the neighborhood and train your staff!!!! Will take a break from buying here. Usually go here 3 times a week for pizza"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCXzhUNVFREAE",
            "text": "Old school Pizza. It tastes so good. Definitely will be going back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bWNyQmJ3EAE",
            "text": "Horrible service! These people are new to the neighborhood and have the highest priced pizza trust me! Been here for 30+ years never had a bad experience with a pizza shop until these guys came around. Rude & impatient, and doesn’t have any care for the customers. A hour before closing time Gino’s down the block sells discounted slices especially if it’s been sitting there all day, but Prospect Pizza will sell you the stalest pizza and driest cheese full PRICED right before closing time. 1 star."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURremRxQTZBRRAB",
            "text": "It was okay. The cheese slices were good, but the one with spinach and ricotta cheese wasn’t. The latter was just bland with no flavours - it became a chore to eat after two bites."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNbWNIRTRBRRAB",
            "text": "Great dough, nice and thin. Overall taste is super. The cheese is a bit too oily for me. Good value meal overall! 2 slices for dinner set me back five bucks."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4OTlLUmx3RRAB",
            "text": "Ordered a large cheese pizza and a eggplant hero. The pizza was alright. It was a little sweet. The eggplant hero was terrible. There was a little bit of sauce which made it extremely dry, you couldn't even tell there was eggplant in it and there was no cheese. Save your money."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdy1HYUl3EAE",
            "text": "This is one of the best pizzeria Around Brooklyn. People who works there are pretty nice. Pizza and kitchen items are really delicious and they do maintain their quality. Would highly recommend to others."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3eWFQakl3EAE",
            "text": "Had a great meal here. Very well-rounded menu. High quality ingredients and preparation for a great price. Highly recommend!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRM2RqdGN3EAE",
            "text": "new york style pizza by the slice. Plain or with toppings they are an easy go to for the neighborhood. Lots veggies (spinach or broccoli) in the pinwheels too"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dHVtYU5nEAE",
            "text": "It’s good in person. I had an unfortunate experience when ordering the “Grilled Chicken Caesar Pizza” on UberEats to find out it has no sauce or cheese - just a Cesar salad on a pizza crust - despite it being the same price as the others. I…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlOExpQWtBRRAB",
            "text": "This is the best place for salads and pizza. They making fresh also people are so nice. One thing I like mostly they always give my order on time. Never do late And they know very well customers time how important. I love this place because of tasty and fast."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnaExLLS1nRRAB",
            "text": "This place deserves every 5 star review. The neighborhood desperately needed a solid pizza joint and man does this place deliver. Every pie I've gotten has been excellent, with super fresh toppings you rarely get from slice joints. So happy to have it around."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMVBMZHRnRRAB",
            "text": "When are used to live just across the street from prospect pizza, it was my go to place. Are used to get pizza from there every single week and it was always really really good. I also like the stuff there. The owner would always be very friendly and easy going. I even got some free mountain dews a couple of times"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHOU9lWVh3EAE",
            "text": "I’ve ordered from this place multiple times and have enjoyed the pizza. However, sometimes they would mess up by forgetting toppings. Every time I would forgive it and not complain. This time I ordered a Margarita pizza for delivery and when I opened it it was a BBQ chicken pizza. I notified them of the mistake and that I had already broke the delivery seal sticker and touched the pizza. I was told a new one would be sent to me so I gave the pizza to family to eat while I waited for my replacement. The driver came back and asked for the pizza before I get mine. I told him that I already opened it and gave it to family because I was told I was being sent a new one. I was then told because of that I can’t get my new pizza. I called back and was told that they weren’t going to do anything because the pizza had already gotten eaten. Confused, I said that he told me a new order was coming which is why I let them eat it. He spoke very rude like he was rushing me off the phone and said there was nothing he could do. There was no offer of a refund or credit for a next pizza. Very disappointing as I’ve been very forgiving during their previous mistakes but I have learned my lesson and will not being ordering again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcDZ5bGV3EAE",
            "text": "This is the worst pizza I ever tasted in my life! The price was more than what was posted on the board plus tax. The girl put my two slices in the the box and sealed it without asking me if I wanted to put anything on it. I live right…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDNWRyZm5RRRAB",
            "text": "Is give this place 3/10.\n\nIt’s 1.2 miles from where I live, but took 1.5 HOURS to arrive cold. So I had to heat up the oven. If I was gonna heat up pizza Id have rather had frozen, as the pizza was sub par.\n\nI got a Marsala chicken sandwich and Stromboli. I ordered (and paid for) marinara, which was inexplicably missing. The sandwich was alright.\n\nDon’t bother with this place, there’s better Italian in the area."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXaGVTU1BREAE",
            "text": "I ordered a white pizza with an extra of FRESH garlic.  When it arrived as I was taking it upstairs I smelled something rancid.  I opened it and the smell became quite powerful and the garlic looked like it came out of a jar, this was not…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNNzV2Wkd3EAE",
            "text": "People always give this place rave reviews, but I find them a little over priced and underwhelming compared to some of my favorite places in Manhattan. I think the pizza sauce isn't that great, the dough is good tho. The slices are nice and big which is a plus, but again not enough cheese."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dDhmTHZBRRAB",
            "text": "Good Pizza! Many varieties to choose from. I love their garlic knot and the dipping sauce that comes with it. They also serve other Italian base dishes. The service is friendly, service with a smile."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNmR2eGZREAE",
            "text": "Work of art…amazing food we loved every bit the best"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNDlXcGtnRRAB",
            "text": "Fast service and delicious pizza. Will be coming here as my #1 fav. Pizza joint.\nEdit: Had to change to my review do to what I witness today at the pizzeria. After recommending it to my mother, we entered the pizzeria because she wanted to try it out. While we were waiting for our order to heat up we witnessed one of the staff members treating the man making the pizzas,who mind you was the only one making the pizzas,poorly. He literally scolded him while repeating him an order that was right in front him and angrily told him to \"hurry up now!\" This man was apparently busy finishing up one pizza to do the one he was told to do while the one who scolded him just went back and forth. I felt bad for the guy since he was only one at the pizza making station. There were others standing around there not doing anything and just having a conversation."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0eEt6M3pRRRAB",
            "text": "Moved to the neighborhood a few weeks ago and already hit this place twice. Love their sauce and the quick, friendly service. I'm especially fond of the fresh mozzarella pie (the sweetness of the tomatoes sauce against the basil and fresh mozzarella is 👍).…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5d05hY2VBEAE",
            "text": "We ordered from Prospect Pizza before. They Chicken Ranch with Tomato & Bacon Pizza is one of my favorites. This time we skipped pizza and since we have Manicotti leftovers from the night before we just ordered Philly Cheese Steak Supreme Hot Hero and 6 Pieces of Chicken Fingers with Fries. It was mistake. Big one. Philly Cheese Steak was OK, but Chicken Fingers was un-eatable. It went straight to trash bin. It was huge disappointment.\nChicken Fingers is some kind of substance, somehow pressed in to the form of chicken finger. It's not real meat. At the price of $12 for 6 pieces I suspected better that that. Prospect Pizza  should be ashamed to have this on the menu.\nThis was the last time we ordered from Prospect Pizza.\nDelivery was on time and food was hot.\nToo bad."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvcWRYaFpBEAE",
            "text": "If you like rude employees at mediocre pizza spots when you call, this is the place for you. I'll give it that the pizza isn't bad, but it's a run of the mill spot that's a dime a dozen in NYC. Not special enough to come back after being hung up on twice for asking about the menu. Their menu inside is covered in daily specials, yet you call and ask about them and they respond with, \"What are you talking about? What daily specials? We don't have daily specials,\" and then hang up on you. When you try to follow up and train the employee that there are daily specials at the place where he works, he'll then hang up on you if his limited English doesn't allow him to understand.\n\nJust go to a different and better place. Not hard to find. Gino's down the block has the same stuff."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdE1PakVnEAE",
            "text": "Not sure what happened today but the pizza pie that I ordered was salllty (after just only 2 bites I was already  having heart burn or just hungry)  I had to throw it out but not before I called the store to see of they will fix it just got…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURveTgyRUF3EAE",
            "text": "Called to order a pie and sodas for delivery, was told it will take 25min. 25min turned in to a very very long hour , i finally got my COLD pizza and they forgot my sodas ... 🤬🤬🤬\nDeliverer said ill be back with your sodas...\nPass another hour no soda not even a phone call from the place(the owner is aware about this and no effort to fix it)\nIf you offer delivery services please hire few more guys instead of driving.\nPizza should be FUN , and your place ruined our night"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdHZPMXN3RRAB",
            "text": "The pizza is good but delivery is never consistent. Tonight I received half sausage half pepperoni which noone in my home eats in a soaking wet box. Called and hes talking about next time.......ugh what do I do this time. Highly annoyed we…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZLThiT0hREAE",
            "text": "Thank you guys for having us! We called to see if there were any specials. Although today is Friday they hooked us up with the Thursday special for our 7 kids we have out for a special occasion! The pizza is awesome and so is the service! Thank you so much can’t wait to come back!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRaE1DY3FnRRAB",
            "text": "Stop #265 for @pizzas365: Prospect Pizza has a decent, very cheap, slice overall. There is a bit too much cheese and the sauce is too watery, but overall it's pretty decent (again, especially for the price). 3.8 Stars."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvb1BHRW9BRRAB",
            "text": "I've been in N.Y. for one week visiting. Being close to Flatbush I bumped into this pizza joint casually one evening. For the rest of the week I just couldn't stop eating their pizza. I highly recommend the sausage pie with extra cheese."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2ejZxOW9BRRAB",
            "text": "We went here to order pizza today they said 10 mins we ended up waiting half and hour and then they started making our pizzas they are so slow and they were calm when they kept making the same small pizzas multiple times but got stressed…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbzV5d0ZREAE",
            "text": "Friendly staff and really good pizza with some unique and delicious toppings, I got chicken Caesar salad pizza, the crust was thin and crispy, fresh lettuce, ripe grape tomatoes and a light Caesar dressing. Definitely will come back."
        }
    ],
    "reviews_count": 80
}