{
    "name": "Pacha Cafe",
    "place_id": "ChIJ88eqLABbwokR95WKNo1Rn3U",
    "grid": "BK9",
    "address": "594 Rogers Ave, Brooklyn, NY 11225, USA",
    "rating": 5,
    "user_ratings_total": 69,
    "phone_number": null,
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTFkzRk1jVFpDT1cxaVZGRkdZa3RzYjBWcFIwRRAB",
            "text": "Almost didn't want to give this place a 5 start review so it stays the neighborhood hidden gem that it is.\n\nFood is amazing and the staff always warmly welcomes you as if you stepped into your best friends apartment."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1d1JHeG9MV2x5Y0dZNE1qUlNka1JyYVc1Vk1GRRAB",
            "text": "This place is superb. No wonder it has 67 reviews that are cinco estrellas! The coffee is ground perfectly and the aesthetics are supremely copacetic. So happy this opened up in my neighborhood! Taking my reiki healer there right about Meow!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMk5uZHdkWGhmYkVOTFJtbEJURTlsUTA1RWRGRRAB",
            "text": "Five star coffee, great space, quiet, friendly, great people. So glad to be treated like a pacha for a matcha!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVGF6UkxWazQ0VVc5V05HOVZObUpoZERScFEwRRAB",
            "text": "Truly a well thought out cafe. From the menu design, food and space, everything is spectacular! You can taste the effort and love put into this place. I feel blessed that Pacha is in my neighborhood."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTmEwUXdPVWRhVDFaWVUybEtNbXRhZUc1dE1rRRAB",
            "text": "I love this coffee place! It's all very well thought out and served with care and love. You should try Peruvian tamal and emoliente."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocWRVcG9hVXBhWTJjMVVqUmtVVmhKT0dWSWNGRRAB",
            "text": "Great spot all around. Spacious for working, warm and cozy vibes, very friendly staff and great cafe food/coffee. Really enjoy this neighborhood spot"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNVlrbFJVRVJDTkZObk5YUmFNMU01Vm5RMGFFRRAB",
            "text": "So happy to have this new cafe in the neighborhood. Finally- phenomenal coffee! The egg sandwich and burrito are delicious. They’re still putting the place together-missing store sign so don’t walk past it!\n\nNice outdoor seating and seating at the back too. Great, friendly team that makes the experience even better!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CR2JrMDNSVXhpVVZGZmVrVnRVMUV5WjJ4U2MxRRAB",
            "text": "Love this spot! Ate here several times over the last two months and it was always a wonderful experience! Food is delicious, menu has familiar as well as specialty items. Their coffee and matcha are really delicious! And my partner and I are usually very picky about our drinks. :)\n\nI also would like to add that the owners are such lovely people. They are kind, welcoming and professional!\n\nI am really excited about this business and I hope they are here to stay!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205a1Z6Rm9XbUpsU3pGelRubFZNMDVRWDBacE5VRRAB",
            "text": "Only had the almond croissant for food but it was super yummy and they heated it for me. Also brought my stuff over to my table when they saw my hands full, and were so attentive and kind. Very welcoming environment and my new go to for when I'm in town visiting family."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWkxVSkdPRVExZGkxQ05IaDVjRVZQVXpGVlVFRRAB",
            "text": "Great cafe. Was actually on my way to try Hamlet when I stumbled upon Pacha. Great coffee and the  jackfruit tamal was tasty as well. I only wish they had a vegan pastry, as nice as the tamal is it isn’t something I want with my coffee all the time. Great seating indoors and outside and great WiFi."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVWIyb3ljRTFFU21WRVozTTROSEpxVkV0NFRWRRAB",
            "text": "Pacha is such a fantastic, welcoming addition to the neighborhood. Excellent food and coffee. A loving, attentive staff and a friendly, upbeat atmosphere. Definitely recommend!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVVdVTkNUV1JRTWs5V1FUZGpjbEp2V1cxTGFuYxAB",
            "text": "Thank you for opening your door (and you bathroom), to the community on a day like this where the community celebrates it's identity. Other coffee shops close doors or only allow take out instead of embracing the community and it's…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWlFtUm9hazR5VDBSa1ZDMDFabTVEWkdOVWJIYxAB",
            "text": "People are lovely, everything is delicious, and we can’t stop drinking the cold fashioneds"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTVFWWnFaVWxoU1ZWT01TMUpiMnBPYXpCWlgwRRAB",
            "text": "Great place to hang out especially when you are looking for a place to study 📚"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSM1JDMWtRV2d5ZEhKbFIyZG5jbXRWTURGRWRtYxAB",
            "text": "Pacha is such a great addition to the neighborhood! The best coffee around every single time, according to my coffee-obsessed wife, and a terrific, tasty and varied option come breakfast and lunch time. Their Pacha chicken sandwich is so original and just wonderful. The owners couldn’t be nicer, what a great atmosphere and their quiet garden invites you to stay put for hours. But please don’t. Word is spreading around fast and we should do our part by emptying those coveted tables as soon as we are done!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUVUzZEdTakZ3Vmw5R1NYbzBkVjlPVTNoekxVRRAB",
            "text": "Great addition to the neighborhood... different coffee options, great breakfast (the breakfast sandwiches egg is so fluffy and the schug toast is amazing), and nice people"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNVNXWkNRbVZCUkV4RVVHczNjRXhqWjBsMGRHYxAB",
            "text": "I have been a longtime fan of Katie and Ivan and loved the way they shaped the menu and ethos over at Cafe Calaca. Their new cafe is sweet, cozy, and could grow into a perfect neighborhood hub if you make it your home :-) Try the cold fashioned, the Pacha chicken sandwich, and the jackfruit tamal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WVFsZFNlWGw2YjJWeVVqaFNNVWwyZVUxVVMwRRAB",
            "text": "Best coffee in the neighborhood and maybe the best breakfast burrito I’ve ever had."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWE9GbzROR0p5V1VaSVRGY3dhbTlGYTNkaWJGRRAB",
            "text": "Great spot delicious food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1V2JWaDFWbTR3TWxJeFF6TkRZamxRWkVORE9IYxAB",
            "text": "Had the macha latte and croissant, it was great! The atmosphere is really lovely, awesome place to work. Will come back :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R1RuQnNXR2MyT0c5NWFUWmhiWEF6UkRrMlpGRRAB",
            "text": "Great food, great vibe"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oclp6QnVhRlJsWTBkMExVMTNWM2h0TUdZMmRrRRAB",
            "text": "Divine coffee shop with decent seating and a restroom!! Try the cold fashioned with orange bitters and a twist of orange peel. It's so good and their pastries are also yummy. Can't wait to go back here in the fall when I'm in Brooklyn again. Staff is awesome."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NFpVVm9iVmhLYWpaelJVTXdUVzFQZW5wWE5sRRAB",
            "text": "THIS is the cafe I’ve been waiting for in PLG"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxV1h6a3hiRmwyY1ZCMmNXMW1lVlZ6Wmt4R1RuYxAB",
            "text": "What a GEM! It’s so nice to see this cafe in the place of the old pizzeria. Katie and Ivan are friendly, welcoming, and really create such a warm energy in the cafe. The food is flavorful, and a delight. Whether you want to catch up on some work, read, or connect… this place is worth checking out for sure!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKcFRIQnFXRlF3VlhsbVJESTRUR3R5UjFWUU9FRRAB",
            "text": "This place is everything you could want from a local cafe/restaurant. It won’t be a secret for long…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bVJVZHJaM1J6VlZWTWJVVnhSMGRwZG05TGFGRRAB",
            "text": "This place is an absolute gem 💎 and such an amazing addition to the neighborhood! The owners are incredible, food delicious, coffee on point, and the atmosphere is top notch! So grateful to have this new spot in the community!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkM1FsVnlhV0ZHVFRsNGIwZGFNMWhaYUMxeFowRRAB",
            "text": "Friendly staff and lots of seating including a back patio! Many people there working on laptops. Happy to have this new spot in the neighborhood!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBemJHaHRWbWxpU2pWRFFWUnBWRVpvTURkSVpHYxAB",
            "text": "The food and drinks here are delicious, flavorful, and fresh. The coffee is really excellent and made with care. I love the vibe and energy of the place, plus the owners are lovely and good people."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRlNHRXhYM2QyUTNWVlYxSnBlVTlxWVdGaFluYxAB",
            "text": "The shiso soda and chocolate olive oil cake are nice. Staff were friendly, lots of seating"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201T2VFcHBlRGxXUlU1bVYyRkphbHBXUlhwV1NtYxAB",
            "text": "Cold Fashioned is probably the best mixed coffee drink I've had in years - not too sugary, great orange flavor, and refreshing on a hot day. The Shiso Lime was just as good, too. Looking forward to trying the food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5QmJrUnBWbGRET1c1dVN6VjBXbk5WVEhGQ05HYxAB",
            "text": "Ivan and Katy are super welcoming and kind! Absolutely amazing avocado toast it comes with a side salad (that has really delicious dressing w it) best value for $12!! Iced Oat latte is great! They have vegan and vegetarian options. If you’re in the neighborhood definitely stop by!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeFRVUklPRm8wZEhRMFVqTXhlRUV3TVZkalNWRRAB",
            "text": "The bessssttttt. Amazing amazing food. Perfect coffee. Peruvian food and drink specials. I would come here every day if I could"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcE5HTTJTM3B3VG01RGRVaDNOSFprY2xaT1pHYxAB",
            "text": "Great food, great coffee, great people! And great gluten free options"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wamF6QTVZbEpUV21OdlltSXljM0JTZWxKNGQxRRAB",
            "text": "Stumbled in on their opening and fell in love with the staff, food, and overall vibe. Give these peeps your business and tip your barista!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMVZDMVdkRmhVYVRsZmMycFBVVXBwVGpoYVpWRRAB",
            "text": "The iced tea was incredibly delicious — refreshing, aromatic, and perfectly balanced in flavor. But what truly made the experience special was the amazing staff. They were warm, friendly, and made me feel genuinely welcome.\nThank you for a great vibe — I truly enjoyed it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneE5WOU9hVTE0YURodmFGVnFVMmc0UkU1WWJrRRAB",
            "text": "Excellent food and great service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0V1gyWmxiMFpPVWxGc2JHdFZSVlZ0VFdsR2RWRRAB",
            "text": "Great Coffee shop!  their breakfast burrito is phenomenal. One of the best I’ve ever had . Great vibes inside too!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcWVFRkNjbEl4YURCM1JYUlZPSFJJVUVSMmRFRRAB",
            "text": "Amazing vibes and space. Awesome addition to the neighborhood!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVVpXUnliMGhEYlhoaFpVaHNiRm8yUmtWR1NIYxAB",
            "text": "Lovely owners! Peruvian perfection and great vegan options! Affordable too! I ordered to go and I didn’t even make it to the door, the food was so good 😍"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNVzloOHpMNjlyc093EAE",
            "text": "Haven’t eaten here yet, but the cold fashioned is amazing. Great vibe + backyard!\n\nUpdate: the food is delicious! Great vegan options."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1a1JURnZNMWxZTmxkWllXMDRNSGhaTjFVelRYYxAB",
            "text": "Everything was excellent! Food was outstanding and the owner is so kind, welcoming and warm. They have quite the space too— seating in front, seating in the back and a patio with umbrellas. So happy they’re in the neighborhood!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ObVNVdFNaWHBLUzNSeVIzZHhjbmt5WVZGTk9XYxAB",
            "text": "The Cold Fashioned cold brew situation is 😚🤌🏻\n\nKind owners, beautiful atmosphere, delicious espresso. Love it love it love it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQk1FRnpkM0kxUTJkSGVqRlVXVUpQTnpadk4xRRAB",
            "text": "I absolutely love this place. I was counting down the days for the grand opening and it did not disappoint!\nSo far I’ve tried the jackfruit tamal which was delicious and satisfying, it served as an excellent breakfast and I literally felt satiated and energized all morning and into the afternoon. I’ve also ordered their breakfast sandwich: bacon egg and cheese with an aioli on a brioche bun, amazingly tasty- no notes! I think they perfected it.\nThe backyard is serene. A little oasis in the middle of Brooklyn, shaded by tree canopy and umbrella. I come back here to sit and drink my coffee, study, send emails, breathe.\nThere are also a lot of options for seating indoors, like more than you’d think.\nI really love Pacha, and am so grateful for what they’ve brought to PLG."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRFdqRjVOakpmWDBKbVYyeHhiVGRrUTNSNE9HYxAB",
            "text": "Very nice atmosphere, and friendly staff. The chicken sandwich was bursting with flavor.  I’ll come back to try the espresso drink."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRDQxSXlGc1pEY3Z3RRAB",
            "text": "Wow- so much flavor! Cold fashioned is super unique and the dressing on the eggs was marvelous. Wish I could try all the food! Highly recommend. Friendly staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSWJFaHROMVJ0VmxRMldsQk1ZemRNU1ZsVFpWRRAB",
            "text": "SUCH a nice coffee shop! You can tell that the everything is made with a lot of love. The owners and staff are super friendly and responsive. The tamales are delicious, and the egg sandwich is one of the best I’ve ever had. Coffee is excellent and inventive."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waE1HbzRRbE41V1VSYWFGOTNVbGRsVkVNd2JrRRAB",
            "text": "Super cozy cafe with a backyard and delicious food! They make their own tamales and put a lot of care into the beverages. The cold fashioned (iced espresso w orange bitters) is very good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLU08zS2FYenFyZkxBEAE",
            "text": "Delicious food and wonderful staff, a very welcome addition to the neighborhood"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPU3hyclNvNDVmZVJREAE",
            "text": "I had both the jackfruit & chicken Peruvian tamales, which were not dry and super flavorful. I really liked the thin red onion topping that goes on top! The schug scrambled egg toast was great too.\n\nFor coffee, I tried the Cold Fashioned as it looked interesting, and it was excellent esp. with a splash of half and half.\n\nThere was a nice backyard area but it was full when I got there, I'll have to try it out next time I come."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aamQxUnBjR0Y2U0V4clNYbzVVbXBrYVdaWWNWRRAB",
            "text": "Such a cute new cafe! Great amount of seating and back patio. Food and drinks were creative and well made."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOUHcxcFc2aTU2Y2pnRRAB",
            "text": "This place opened on Wednesday and we’ve already been twice. Kind service and lots of seating. The back patio is really cozy. The coffee is really great and I love the chai they use. We tried the Chicken Tamal and the Breakfast Sandwich. Both were so so good. We were too full to go for a pastry but they looked really good too. We’ll be back for sure, so glad to have a Peruvian spot in the neighborhood!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTFpuaGxVMEowT0UxdWVsQXdkbGRhU1dsbU5uYxAB",
            "text": "I never write reviews, but this place is brand new and there were pickled kumquats on my avocado toast and the iced dirty chai was delicious!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPanR6WTd6M2VTSmt3RRAB",
            "text": "Perfect cafe! So excited to have Pacha in the neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQeWkyX0dXLWFTX01nEAE",
            "text": "great addition to the neighborhood! friendly service with a nice pastry selection & food menu"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMalhfX3pWbEpUVHNRRRAB",
            "text": "Beautiful place! Great outdoor area"
        }
    ],
    "reviews_count": 55
}