{
    "name": "Island Krave Cuisine",
    "place_id": "ChIJ8cWjATRbwokREF5U6lS6MCg",
    "grid": "BK9",
    "address": "1137 Nostrand Ave, Brooklyn, NY 11225, USA",
    "rating": 4,
    "user_ratings_total": 33,
    "phone_number": "(347) 627-2278",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSZk1VUlVRbUkwVFV4MmNVVkRTbHAxYUdKRVNYYxAB",
            "text": "Lamb chops with fried rice was amazing. Smoothing hospitality."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNLWh0Ym53bWVlZ0t3EAE",
            "text": "Bad customer service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOUpfaGRBEAE",
            "text": "This is my go to spot every time I visit Brooklyn. The food is consistent and up to par with freshness and quality. Definitely suggest coming here if you’re looking for a nice home cooked meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURva2NIMXlBRRAB",
            "text": "I’m never the type to leave reviews but yes the red velvet cake deserved a 0/5 star. Customers shouldn’t be served a expired cake for $5.50"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOXUyd3RBRRAB",
            "text": "I had the best Jamaican food ever. JR and the whole team took care of me. And my family the oxtail was falling off the bone tender."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX05LN1lnEAE",
            "text": "My husband is not the easiest person to please when it comes to food & He absolutely loves it here! He says “Their food is definitely worth my money!” Overall, Everything is always a 10/10!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURialpiZ093EAE",
            "text": "Best stew chicken I’ve had, thanks. I’ve tried a few items here and everything is great, I can also recommend the curry goat."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMjltN3lRRRAB",
            "text": "Great food, excellent customer service. Environment is always clean."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OC1TTTZ3RRAB",
            "text": "The food was tasteless and dry but the staff is friendly and helpful."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQX3VfaUlBEAE",
            "text": "Pretty good Island Fare. Slightly up-priced, however, a little inconsistant. One day I had the fried chicken legs and they were good - the next time they were over-fried and not so good. Tried the codfish fritters 3X and twice they were very good and not oily - then the third time they were made with too much flour. Horrible red peas soup cooked without coconut milk, thyme, pig tail, smoked turkey neck bones, finesse or love. Now the plusses: stew peas GREAT👍but EXPENSIVE!  Ackee and saltfish GREAT👍 stew chicken above average. Restaurant super clean and staff mannerly. Way way better than Glorias or Culpeppers or Soldier's Buffet and above Lucky's (especially in the rice-n-peas department) although Lucky's makes a better Red Peas Soup."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQek5tdXpRRRAB",
            "text": "Stopped for lunch last week  and loved the meal I got here. Super full portions and fresh\n\nThe seafood pasta was made to order and seasoned perfectly. The oxtail platter was gone in 4 minutes lol. Will Be back next week to try some more"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaV9pS2JBEAE",
            "text": "They have this particular lady who took my order , she was extra rude and nasty for absolutely no reason. I used to go there 3-4 times a week . They can forget about my business now . At the end of the day whatever you have going on at home or in your life just don’t bring it to work with you ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudWVQcEpnEAE",
            "text": "Ever since this restaurant renamed from Jerk Pit, their food quality has gone down. I have ordered delivery a number of times and something is always missing. One time I ordered a jerk chicken meal and received ONLY jerk chicken, no meal. I appreciated them trying to rectify that mistake however my orders onward always had an issue. My most recent order I received undercooked meat and missing items. I have tried to give this establishment chance after chance because of how good Jerk Pit was but this is just continued disappointment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3Ny1mQWhBRRAB",
            "text": "They serve Golden Krust Pattie’s. Tasted horrible. The filling was just mush and the patty lukewarm, no sign of meat anywhere …. scary. They should disclose that the don’t bake but sell golden krust nasty patty’s cause they know good and well nobody going into golden Krust to buy no patty. I threw it away."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibHB2ajN3RRAB",
            "text": "Just delicious! I recently discovered this gem in Brooklyn. I was originally hooked on the King Fish and rice and peas. But this past Saturday I had the smoked Jerk Chicken... finger Licking good. I Literally licked my fingers. It was perfect! Just right and Moist not dry on the  inside. It was so good I ordered 4 quarters to go.  Then I came back the very next Day for more. Definitely my go to spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM0pybDNRRRAB",
            "text": "PLEASE season y’all’s fish properly, bought a 2 brown stewed King fish dinners and it smelled raw. Also for goodness sakes,  tamarind juice DOES NOT NEED GINGER in it smh 🤦🏽‍♂️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyOHJLN0VREAE",
            "text": "I got the curry goat cabbage and rice and peas and macaroni Pie was very delicious being that I come from a Caribbean background I would definitely recommend Island Krave Cuisine to anyone that would like to taste they have very good options and some items are not visible but just ask them and they will let you know what else they have available to add to you plate."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMM2JuenRRRRAB",
            "text": "This place is the best very official clean and delicious food extremely good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcWYybnpRRRAB",
            "text": "The food is delicious. The cashier is a pleasure to deal with."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUMUxqRzZ3RRAB",
            "text": "Very good food the owner is helpful and very hands on with the food , great atmosphere and even better meal ! Will definitely stop by again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNjRtSUpnEAE",
            "text": "I recently dined at Island krave and had an incredible experience! The oxtail was amazing, tender, and flavorful. The fried chicken was seasoned to the bone, very crunchy. The jerk chicken was delicious, perfectly spiced, and cooked to perfection.\n\nThe service was perfect, with attentive and friendly staff who made sure our large order was accurate and timely. No mistakes, just great food and excellent service. Highly recommend this place for true Jamaican food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcmN5T2p3RRAB",
            "text": "Such an amazing West Indian restaurant, delicious food, great presentation, clean environment and the staffs were amazing, I will definitely be going back with my friends."
        }
    ],
    "reviews_count": 22
}