{
    "name": "Krupa Grocery",
    "place_id": "ChIJDXCWZh5bwokROj_-7EfM3NI",
    "grid": "BK9",
    "address": "231 Prospect Park W, Brooklyn, NY 11215, USA",
    "rating": 4.6,
    "user_ratings_total": 876,
    "phone_number": "(718) 709-7098",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sa1ZVeFpPV1pZTjJwUGNHbHBUSG90U0dKVGRsRRAB",
            "text": "The Angus burger was a hit with my group and I loved the gnocchi Bolognese. The host was super friendly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMlFucEJjakV4VEhnemNXUk1Wa1JtTjJsalZVRRAB",
            "text": "This place is consistently good and a neighborhood staple. They have a variety of items that can appeal to different palates, especially if you're trying to have brunch with a whole bunch of friends who want different things. Customer service is also lovely. I recommend the gnocchi bolognese, lemon ricotta pancakes, THE BRUSSEL SPROUTS (!!!), THE CURRY FINGERLING POTATOES (!!!), and shrimp burger."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNWFrOVZRMUZJVTJoU2QySkpaekpvU1ROZmJYYxAB",
            "text": "Great food, service, and vibes!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNFFXVXlYM2xvUlhocGVHcDVRMUJKTjI5WlZXYxAB",
            "text": "Killer mussels. Nice staff"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUGVHcDVVakkzYzFkb2RFZHVaalZPVG5GSGEyYxAB",
            "text": "Everything was amazing! Friendly staff, good pricing, tasty food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRVpuVjJVVUpxZW5Ka1ZWbEJhRjlsVEVORGMzYxAB",
            "text": "I stopped in just for a beer and a quick bite, and it was a solid experience. It’s nice to see a place where you can still get a draft beer for only $7. I ordered the homemade chicken nuggets, which were really good: fresh, hot, and clearly made in-house. They came with honey, which was a nice touch, though I think a little hot sauce would really take them to the next level. The staff was pretty friendly and welcoming, and overall the vibe was laid-back. I’d definitely come back again. The shrimp burger seems to get rave reviews, and that’s next on my list."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoM1dsOXVhRFJ1ZVd4UVQxVXlPR05TYW1NM1ZYYxAB",
            "text": "I can't speak to the food, but this my go-to coffee spot for an iced Kyoto style coffee.  I fyou haven't had one, try it!  Reasonably priced at a flat $4 as well.  Friendly people behind the bar, and beautiful atmosphere inside / out in the backyard.\n\nEDIT: I can now speak to the food and it is EXCELLENT."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VM1l6VmpXRlJuTm1ONWMweExRblJTY0VnMlFXYxAB",
            "text": "When we have company we always take them to Krupa, it's our go-to for special occasions or to celebrate having survived the week. Great brunch great dinner great coffees and pastry, cocktails, etc. The outdoor patio is fantastic in good weather and has heaters and a retractable covering for bad weather. My meat-eating spouse is always very happy with the seasonal variations in the burgers and steak, and I enjoy the vegetarian/vegan options. I've never seen anyone less than thrilled with anything on the menu. IIRC there are several gluten-free options and substitutions. We arranged to bring a group of ~10 and had a great experience, and while we didn't end up using their wedding reception-sized options they looked good too. Very popular so make a reservation."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZeVh6Rm9aR2xsWDFSblFuRmtjblJEUlhkZk5VRRAB",
            "text": "Best neighborhood spot... always welcoming and delicious. Breakfast gnocchi, pancakes and steak and egg with mole are unreal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jemFGaFFRa1JVWmpSZlMxODRRbVpsTkY5bVVVRRAB",
            "text": "Service was exceptional.\nI did not have anything to eat but the menu looks great and diners looked satisfied and happy.\nI will definitely be returning for lunch and/or dinner."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNFZqaDFlbTVuZVRkSldUQXpRVXBwV0RoclJVRRAB",
            "text": "Nice little backyard. Food was great - my favorite dish was the stracciatella salad. The ricotta gnudi was good but slightly bland. My daughter loved the crispy brussel sprouts and risotto balls best. The \"chicken\" tofu was flavorful and a sizable dish."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUVRucE9kMmx2ZVVremNEUmFVSGhqVEdKVGNsRRAB",
            "text": "Came here with family for brunch and we were happy with the options available. My partner is gluten free and had their breakfast gnocchi which was unique. I had the breakfast tostada which isn’t gf."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWalpYWXdNV1JxUW5GcVpIaG1SWHAxVm1aYWFIYxAB",
            "text": "Such a wonderful experience! From starters, to main, to dessert. The chocolate tart with marshmallow may very well be the best dessert I've ever had!! Highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SmRIbFhVM05HTFVSU1N6Rk1OWGhRZDJKRVQxRRAB",
            "text": "Delicious food every time, and great vibes! Grateful to have them as a neighborhood go-to. Try the hot shrimp burger!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQmVIbG9aVTQyZEVWbVltTkZPVmRIWVdaTE5sRRAB",
            "text": "Nice after work spot or visit on the weekend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MmJEbFdUbkJ6U210aFh6ZFNZbUZFYjJ0TFdIYxAB",
            "text": "Simple, elegant, delicious. Staff was very lovely."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTFprbHNXRTlZY1c1TlpIVXhZazlYYlVKdU1sRRAB",
            "text": "Great place for breakfast. Friendly stuff"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKdklsS090LTlmdjRBRRAB",
            "text": "Super cute place, and the staff is super nice. Loved the mussels, the drinks were nice. They didn't kick us out right away when it closed and it was a great end to an evening!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPU0R5TjYtX3NXdENnEAE",
            "text": "As soon as I saw the lamb burger...I was all in! It didn't disappoint!👌🏾 It was ground lamb but also gyro cuts of lamb as well. There was a yummy sauce too! The waiter was tickled as he heard me trying to figure out the ingredients. I hit the nail on the head with my observations! I paired it with an arugula salad. Delicious! Our server was lovely."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYXZ6cUxDNk1YOGRnEAE",
            "text": "Great date spot, ate in the back patio"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOQ2lrZjJDMFpYV25nRRAB",
            "text": "so worth the weekend mta subway service to sit on the back patio and bask in the wonderful atmosphere. terrific food (everything had to be sampled by the two of us); the fingerling potatoes alone were worth it, never mind the delicious lamb burger and salmon and risotto. many thanks"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM2RQYzBRRRAB",
            "text": "This restaurant was a delightful surprise.\nThe double lamb burger was imaginative and rich in flavor, with a well-balanced sauce that complemented the distinct taste of lamb beautifully. The texture of the lamb itself was unique and refined, making this burger absolutely worth trying.\n\nThe fried baby potatoes, recommended by our waitress, were another highlight. Trust me — they were far more interesting and satisfying than ordinary fries, with a wonderfully crispy exterior and a hearty bite. Truly excellent.\n\nThe dessert provided a perfect finish to the meal — a wonderful combination of chocolate, peanut butter, and marshmallow, offering layers of flavor without being overly sweet or overwhelming the ingredients.\n\nThe service was attentive, thoughtful, and perfectly paced — never rushed, never dragging.\nAll in all, it was a thoroughly satisfying dining experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGRTRDFBRRAB",
            "text": "I'm glad we stopped by this restaurant - the food was really tasty 😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdzZiOF9RRRAB",
            "text": "Perfect date night spot, food was excellent and service was spot on. Cocktails were delicious. Just a warning, the burger doesn't come with fries!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdHFla1lBEAE",
            "text": "Had a delicious double lamb burger, no wait on a Sunday afternoon."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeUstMkt3EAE",
            "text": "The weekend brunch was alright, the risotto balls were good. Overall a cute place for brunch and drink."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cWYtdTdRRRAB",
            "text": "Beautiful space, excellent service and food is awesome.\nShared the lamb burger, ceasar salad and ricotta pancakes. All delicious!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbDYtNVdBEAE",
            "text": "This place was packed and for good reason! The menu is eclectic but incredibly thoughtful with plates of all sizes that can cater to all moods and eating styles. Perfect for someone who’s starving or just needs a quick bite with something that appeals to all palettes. The shrimp burger with gochujang aioli and cabbage slaw was a show stopper and the beet salad was flavor-forward ! I’d only recommend that the red onion in the beet salad be (more) pickled and that the red wine on tap be less cold, but the latter might be unavoidable. Will definitely be back to try more things on the menu!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbTVuazZnRRAB",
            "text": "Just stopped in for a quick drink. I didn't eat anything but the food smelled and looked great as it passed me.\nI will definitely stop by again and try something next time I'm in town. The place has a great pub feel to it. Service was attentive and friendly."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNGNleE13EAE",
            "text": "Sat at the bar and enjoyed our cocktails and food- loved everything- especially the lamb burger and brussel sprouts!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRX092M0Z3EAE",
            "text": "Stopped early during their $2 off drinks. Had a glass of wine and their Risotto Balls.  Thoroughly enjoyed them both."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaEpIMlNBEAE",
            "text": "Favorite neighborhood restaurant. It's always good.  Our favorite dishes are the ceviche, fried brussel sprouts, chicken fried tofu (beware it is very spicy), lamb burger, shrimp burger, mussels and the farro quinoa salad.  Great cocktails and wine selection - some even on tap (the gruner veltliner is excellent).  Staff are super helpful.  I always thank the kitchen staff on the way out, which they appreciate.  For dessert last night, we had this incredible rum and coconut parfait with a plantain cream and it will VEGAN - much appreciated by the lactose intolerant folks.  It was not too sweet, rarely exotic (I've never had anything like it before) and totally delicious.  Anyway, the restaurant has had a hard time this past winter and deserves your support.  Eat here now!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMV9tNEJnEAE",
            "text": "Krupa is the best restaurant in the neighborhood. It’s not even close. Meant to write this review dozens of times already. We’ve had countless important moments here over the years. I’ve lost track. We’ve also rented the whole restaurant out for a private party. We’ve never left feeling anything other than completely satisfied. Tom, Jenny and all the staff are super welcoming, helpful and caring. Food is terrific and unique. Drinks are great. If you haven’t been here for some reason, please go. And get the Nashville burger with Brussels Sprouts :)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNkl6MjRnRRAB",
            "text": "Love this neighborhood spot!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNTdHeVZREAE",
            "text": "Great vegan options!! The tofu has the best fried crust it really does live up to the “chicken fried” name!…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdjduUGx3RRAB",
            "text": "A gem in the neighborhood\nConsistently good"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeGI2LVB3EAE",
            "text": "Ugh. Totally stone cold eggs for brunch. Long wait for drinks and food. An overall odd combination of flavors and textures."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2c00tc1hnEAE",
            "text": "Been NYers 40 years, lived in BK 16 and Windsor Terrace 6 years. Krupa has been one of our favorite restaurants to go with or with our kids, small or large groups since our first meal. The owner and staff are inviting and friendly and the food and atmosphere are wonderful. Really can’t say enough good things about it. Everyone we know loves it too."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ejh2ZjhRRRAB",
            "text": "What a great experience for an early dinner. Potato wedges and chicken wings to start. As a party of 6 we ordered the Nashville shrimp burger, the angus burger, ceviche, beets, Krupa fondu, etc. We also ordered three desserts including the chocolate tart, the pumpkin spice, and the pot de creme. We happened to go on a Sunday night during vinyl night. So stoked to hear old David Bowie during dinner."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ejRxV253RRAB",
            "text": "The epitome of south slope restaurants that should be labeled “bland and pricey”… mid at BEST food and at a very high price, Krupa does have “vibes” and atmosphere to go on. The staff are nice and being there feels cool and it is usually buzzing but not a place I’d miss if I never went again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaU5xNGdRRRAB",
            "text": "GREAT FOOD, GREAT DRINKS, GREAT ATMOSPHERE 👨‍🍳  Been coming to Krupa for many years and it’s a very versatile restaurant bar that does not disappoint in any way. Whether you’re meeting someone for morning coffee ☕️ with breakfast in the backyard or a larger group at night for cocktails 🍹 and small plates to share; Krupa is a solid choice. The drinks are extensive and very good list of beers and spirits. Great place for a date but also a good place to kick back solo at the bar for dinner. All the dishes are a must try. Tip: they actually do have tasty chicken nuggets so if you want to order for your 👦🏻 or you can also just order for yourself too (they’re good). In any case, highly recommend Krupa ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5Z0thSzRnRRAB",
            "text": "I would like a backyard like their. So well decorated and amazing atmosphere.\n\nFood is amazing delicious and beautiful. My friend ordered and it’s meant for sharing with friends. I love the wings.\n\nService is okie. In the backyard, they don’t really check on you much but it’s okie.\n\nAtmosphere is great."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwb3BMUG9nRRAB",
            "text": "Yummy food and service. We stared off with the arancini. Most amazing I've ever had! I had the gnocchi and my friend had the green eggs and ham. I wanted to try the gnocchi because of all the wonderful reviews on it. Personally, I did not…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcmNDRTdnRRAB",
            "text": "Great restaurant! A friend took us here as one of their favorite spots and I easily see why! The food was super tasty and the staff was so nice and professional. The laidback atmosphere with attention to details. The outdoor seating was covered and we didn’t even notice it feel the rain, which was awesome. It’s also heated in the back so that’s why the photos are so tinted. It felt warm though. Very nice experience and restaurant and definitely worth stopping in and checking out. They have some amazing vegan options too that are well thought out and crafted. So also consider them for that! Come on down and enjoy a tasty meal 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOEpqM0lBEAE",
            "text": "I had a delicious lunch today at Krupa Grocery in Windsor Terrace. The food and service were spot on (thank you Kaitlin and Armando) ~ even the manager, Tom, came by our table to be sure everything exceeded our expectations!\n\nThis tastefully decorated restaurant is comfortable and features a beautiful backyard as well as tables and a bar.\n\nWe began with two refreshing Arnold Palmers, then split orders of chicken liver pate deviled eggs and and risotto balls. Both were fresh and bursting with flavor. My buddy then had a shrimp burger and I the angus beef burger accompanies with their salt and vinegar & curry fingerlings (potatoes).  My one minor suggestion would be to ask for the burger with a bit less of the sauce because as delicious as it was, it tended to mask the exceptional quality of the burger itself.\n\nFor dessert we made room for their s'more pie that was decadently good and went well with their delicious brewed coffee that I had or the cappuccino my buddy went with.\n\nTop of my to do list for next visit will be the lemon ricotta pancakes!\n\nThank you Krupa Grocery for a beyond delicious lunch!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMHVlb2FBEAE",
            "text": "Like many of the reviews, the ricotta gnocchi was delightful! The salted cod croquettes were a bit too salty for my taste (I should have expected it since it has “salted” in the name). Although the place opens at 9, food starts at 10AM!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHb3RleFpnEAE",
            "text": "Really cute place with indoor and outdoor seating. We went for brunch. Coffee was good (a little bit cold), we had a mistake with our orders (both) but they made them again. Green eggs on toast were great. Eggs with gnocchi was nice, spice could be a little thicker. Service was very friendly and the place has a nice cool atmosphere. Backyard looks so cool. Reservations are available for brunch as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN0w3VHd3RRAB",
            "text": "After a late afternoon visit with friends, they recommended  that we would love having dinner at Krupa Grocery . And they were absolutely right! We had  such a fabulous dinner that we are considering moving to this wonderful Brooklyn neighborhood that has so many wonderful restaurants. We started by sharing a “ yellow gazpacho” made with yellow tomatoes, cucumbers and “summer kiss melons”. Since we were sharing the soup, our server made sure for each of us to be served ( what seemed like) a bowl of the most delicious gazpacho we’ve enjoyed this summer. We also ordered Ricotta Gnocchi that was so tender with subtle flavors including basil, cherry tomatoes Pinot Grigio and black sesame seeds. I also thought I could taste a hint of orange zest. In any case it was a great choice. We also devoured a warm beet salad and crispy Brussel sprouts!  Needless to say, while it was our first time dining at Krupa Grocery, we will definitely be back soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLXF6MktBEAE",
            "text": "I have to say my experience here was absolutely amazing!!!! The food was phenomenal and filling. My boyfriend enjoyed his chicken wings and his bloody orange drink. the service was excellent especially since I have allergy to nuts and they accommodate me with no issue. will go again :-)"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNaThENXR3RRAB",
            "text": "Update: Just adding to my original review below, I came here again this year (2022) and nothing has changed about Krupa. The food was phenomenal and the service was second to none. Also, I recommend making reservations!\n\nSome of the best service I've ever received! In addition, the drinks and food (fingerlings!) were fab. The cymbals and cow bells throughout the restaurant are also a nice touch. :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbXZlcUtnEAE",
            "text": "This place has it all for the neighborhood.  It has atmosphere, great staff, great cocktails and really delicious food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMElIOHJ3RRAB",
            "text": "The salt fish croquettes are just Guyanese fishcakes with a french name.  They taste good, but I feel West Indians add more seasoning, but salt fish has a good seasoning naturally.  My lamb burger was very good.  The smashed fingerling were so-so.  My blood orange Arnold palmer was not too sweet but not as refreshing as I expected."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbW9fSTd3RRAB",
            "text": "This place is our go-to whenever friends come to visit us in Brooklyn.\nMain reason is the drinks. Hands down, top 5 best bars for drinks (and reasonably priced) in Brooklyn.\nSecond reason is the atmosphere. It's located in a cozy little main street near Prospect Park so you can sit on the street and you can also go in the backyard garden (perfect for any occasion).\nFood is ok - I mainly get appetizers because the vegetarian options didn’t seem too great (I wish they would put a appetizing veggie burger/sandwich on the menu).\nThe servers are also excellent and accommodating - always gotta give a shoutout to them!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPZ0t6QTl3RRAB",
            "text": "Krupa Grocery is a great place to go if you’re looking to have an amazing weekend brunch! They’re service is amazing & the staff is full of friendly welcoming people. I ordered the shrimp burger, the green eggs & ham, & the gnocchi breakfast, and it was excellent. Would definitely come again & I recommend to everyone."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocllDLTVRRRAB",
            "text": "Loved my dinner at Krupa Grocery. I had the Nashville Hot Shrimp Burger and it was fantastic! I also enjoyed the Shishito peppers & a Pepino Picante cocktail! Can’t wait to eat here again 👏🏼"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z1BiZHNRRRAB",
            "text": "Very relaxing vibe and beautiful backyard. The service was a bit lacking. Asked them basic questions about the menu and they couldn’t answer. Kitchen was fast and food were out with good quality. My companions liked their gnocchi dishes (breakfast and ricotta). I’m not super impressed with the lemon ricotta pancakes. The fried Brussel sprouts were pretty good with the dipping sauce. A little disappointed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyMXBhUzZBRRAB",
            "text": "While probably best known for its brunch (judging by the lines on the weekend) its cocktail vibes shouldn't be ignored.   While they may not have many specialties, the 'Logan Roy' has a sweet, vegetal taste that answers the age old question - what would happen if an Old Fashion and a Manhattan had a baby? Grappa notes replace vermouth for a smooth sipper."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdXFMYVRnEAE",
            "text": "Had dinner in the back garden. Yummy food, great service. Suitable for children, too, and gluten free, vegetarian eaters as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1c2F5YTlnRRAB",
            "text": "Awesome experience at this neighborhood gem. The food was delicious, but honestly the service blew us away. Bussers and server were extremely attentive, informed, and sweet. Would return for the food, but the hospitality makes this place a must visit."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaWJlMDFnRRAB",
            "text": "Went for an early dinner. Fluke ceviche. Amazing flavors... strawberry sauce, a kick from jalapeño. Cod croquettes with a delicious aioli. Creative, tasty food."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnbHByckVBEAE",
            "text": "We had brunch here. I got the breakfast gnocchi, and it may have been the best breakfast meal I've had flavor-wise. It was rich, creamy, savory, and filling.  The meal was a great sized portion. I also got a coffee cocktail, and that was good as well,  but the star was the meal.\n\nThe staff was all friendly. The place is clean and cozy. There is an outdoor seating area, which was nice. We would have sat out in the garden area, but I had bad allergies that day."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSLTVqaWFREAE",
            "text": "Stopped by here on a whim the other day, and it was excellent. We split the shrimp burger the angus burger, the farro salad and some grilled olives. All great, though I think the shrimp burger was maybe a little plain. Definitely not “hot.” The bartender was friendly and mixed delicious drinks. Will be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHZy1EaGlnRRAB",
            "text": "We love the food here and live just a couple of blocks away. Just tried to get brunch and while the entire Resturant was empty, including the back garden and front seating, they still wouldn’t seat us for 30mins—totally insane. These pictures are 15mins after we went an got food elsewhere. Peace!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1a2N6SXBnRRAB",
            "text": "I've been dinning at Krupa Grocery for several years and have yet to be disappointed. My fav go to meal is the cod croquettes and a side of the arugula salad... So tasty."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMya3VpM3Z3RRAB",
            "text": "We came at a busy time but there was a lot of seating. Food came fairly quickly and was delicious! Menu has a lot of variety and items were fairly priced."
        }
    ],
    "reviews_count": 65
}