{
    "name": "Sweet Catch BK",
    "place_id": "ChIJH6P3kklbwokRis1YQwtwC20",
    "grid": "BK9",
    "address": "1222 Nostrand Ave, Brooklyn, NY 11225, USA",
    "rating": 4.4,
    "user_ratings_total": 649,
    "phone_number": "(347) 240-7799",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsYU1XdFFaMjVFUVhkdk4xbHpZVmMzTjFKMUxVRRAB",
            "text": "Sweet Catch is one of my favorite restaurants in PLG. The catfish, fried okra and mashed potatoes were all perfectly cooked and seasoned. The staff is so friendly and welcoming too."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQk0ycHRiemN5TkRKcFpXZHFjbE5SZG5OeGVHYxAB",
            "text": "Amazing brunch. Best Grits I’ve ever had. Lily was so great and attentive!!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UFIwTnVWazVUTkROYVVUaFBjR2RSYzA4eFNtYxAB",
            "text": "Naaaahhhh! Jean playing(saxophone)… RNB PLAYING… energy flowing.  Worth my 1 1/2 hour trip."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkU1VXaG9ZVkI2VHpGSFUyOTBNbmxoZW1rdFpWRRAB",
            "text": "Great atmosphere love the decor very classy"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONlJYRjBZelV5VVVKU1JHcE5hMk5WZVRoQlQyYxAB",
            "text": "This spot consistently delivers what I'm looking for. Employees provided reliable service. I anticipated a well-situated restaurant at Sweet Catch BK, but found exceptional service too. Their food has incredible depth! This place removes all awkwardness."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRE1HTjRORkUyU1U5clYwdHZPRmRIUTBKeUxWRRAB",
            "text": "The restaurant atmosphere is friendly and welcoming for people of all ages. Besides the good food we saw on the menu We mainly came to support a black women owned restaurant. We ordered fish and girts with drinks and the grits did not disappoint me. Our waiter was nice, friendly and accommodating. She checked up on us as much as possible."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCZk9FdDRVRk16WjFnMGNYVjRRazlJUzBkQ1duYxAB",
            "text": "Food was ok. Catfish and grits were super salty. Not enough staff to tend to tables. The wait for the food was way too long. I hope management takes care of the logistics in the future so I can continually support"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdWRsUjZhR1JhTUhCTlNIVnJSM055Wm5sdGNrRRAB",
            "text": "I went here for a birthday get together, it was a party of 20. First, I'd expect to get proper dishes for the appetizer, not LITTLE plastic PLATES as if we were in a fast food restaurant. For the appetizer, it would have been nice to have  separate portions, not a shared platter as we were not given enough of the fire crackers shrimp. It was only enough to get one piece each. The portions for the dinners were small. There was nothing spectacular about them as they were over salted. For dessert we were given a tablespoon of sorbet in a sample size cup. The service was inadequate as we have one server for the party to take orders. You'll be sitting there for half an hour before anything comes.  Don't even bother to get the drinks as every one were ordered was not worth it. We ended up going outside side to buy our own. All of this cost us $75 per person which did not include the drinks or tip! For an $1,800.00 I'd expect way better service and food. The one thing good about the service was the chef came put to talk to us and tried to make up for it. The cornbread and sorbet were tasty."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTFQwaE1TSEJxTFZodlREbFZRbWRNTUhWUVMxRRAB",
            "text": "Loved the atmosphere, music choices, and the food was great! Very calm and inviting. The stand-out of my meal was definitely the fried okra. As someone from the south it reminded me of home <3. The sober mule mock-tail was also quite delicious. Our dishes did take a while to be served but the chef personally came out to apologize for the wait which was unexpected but a very nice gesture nonetheless! The meal was certainly worth the wait. Definitely recommend if you’re wanting an enjoyable experience at a black owned establishment!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFNrcDNiRGxaV1Y5UVZWazRjbkpEVTNablRFRRAB",
            "text": "The food was ok, nothing to rave about. The hostess was very friendly but it took quite long to get our food. The DJ played great. They had karaoke 🎤 . It's a nice vibe."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNFdsaFViR1ZCWmpCWFFXbHVlbHB6ZDFOQk9YYxAB",
            "text": "This spot hosted a family dinner with several of their dinner specials. Host and service were great and the music vibe was classic R and B."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkblZXaHhTMjlDTm01V1VXeE9iMVYwZVU1aFNVRRAB",
            "text": "I have been here before and I’ll be back again because the food was so good, just writing this makes my mouth water but feel free to see for yourself.. I share food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdlJsUlRkbmxvV21oNVNsRmxORjk0ZEVab1prRRAB",
            "text": "Good food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNU1sSkZRM1JMYzJzME1tUlVkVVJUYWs0d09IYxAB",
            "text": "My wife and I went to Sweet Catch BK last night for their 3-year anniversary, and after such a phenomenal experience, it’s clear why they’ll be around for many more years to come.\n\nThe service was warm, attentive, and welcoming from start to finish, and the food was absolutely exceptional. We started with the deviled eggs topped with crab meat and the baked oysters. Both were packed with flavor and beautifully presented. For entrées, we enjoyed the Jerk Short Ribs and the Fried Catfish & Grits. Everything not only looked amazing but tasted even better.\n\nSweet Catch BK truly knows how to deliver a memorable dining experience. We’ll certainly be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdWEwTnFYM0pOYlZBMVgwNU1URlpNUVc1TlIzYxAB",
            "text": "the catfish & grits was bussin. come here. period."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQlF6STVTMDlhVVhFd1dEWnRkbTVPTFZWa2VXYxAB",
            "text": "Had the waffle, shrimp and chicken with peach and cream. This is the best waffle and chicken I’ve had. Gabriel was a great server!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sblZtaG1NblZuVFZwSk5IZzNWV1oxVldScGIwRRAB",
            "text": "The food was delicious and I really enjoyed the music selections. Gabriel was an amazing server. He gave great recommendations, and I ended up getting the peaches and cream chicken and shrimp waffles. So good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMFEyMTJVR2xmYzJOSVprOTZSRkJKVTJweFNHYxAB",
            "text": "Very nice place, the food is great,  drinks are good and the ambiance is nice. I had the shrimp and grits. Our server Gabe was awesome and surprised my friend for her birthday with shots."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSk16TnJURmxQV21SNGVISkdOMEYzU25weFQzYxAB",
            "text": "This was my first time at Sweet Catch while visiting from Toronto, and it did not disappoint! The food was absolutely fantastic, fresh, flavorful, and cooked perfectly. The service was outstanding as well; everyone was warm, attentive, and made the experience even better. Truly a gem, I loved it and will definitely be back next time I’m in town!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRmVURXdWbU5tYm5WYWMzRmFZVlZqU201M1YzYxAB",
            "text": "One convenient plus is that there's adequate parking available on Nostrand Avenue, although it is metered, so be sure to keep an eye on the time. The Guava Lemonade was refreshing and probably the highlight of the meal.\nUnfortunately, everything else didn’t quite meet expectations. We ordered Shrimp & Grits and Catfish & Grits, and while the proteins were tasty, the grits were stiff and lacked creaminess; not what you’d hope for from a Southern style dish. The silverware felt cheap, which didn’t help the overall impression.\nService and ambiance were also lacking. Staff were walking around in sweatpants and du rags, which, while possibly acceptable for back of-restaurant comfort, doesn’t inspire confidence when seen in the front of the restaurant. If you’re going to dress that casually, it may be best to remain behind the scenes.\nThe music selection was great, no complaints there, but the volume was too high, making conversation across the table difficult. That might be fine if you're just there to vibe, but if you're coming for a meal and a conversation, it’s disruptive.\nThe menu looks promising at first glance, with a lot of options that sound great. However, after trying the food and experiencing the service, I honestly felt no desire to explore the rest of the menu. The whole experience made it hard to justify the $87 bill for two entrees and a juice , especially when the food was so so and the atmosphere unrefined.\nThis place is listed on Resy, but for my fellow Amex cardholders, I’d recommend looking elsewhere in the area. There are definitely better spots to use your dining credits on. Places that deliver a better balance of quality, service, and ambiance.\nFinal thoughts: I honestly can’t think of an occasion where Sweet Catch BK would be the right fit. Brunch, casual dinner, date night ; none really make sense here, given the overall experience. Sadly, it’s not a place I’d return to or recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeFZXdEhUa2x3WkRGVFVqRjBabXBPWVhkWlYyYxAB",
            "text": "We had all had the the catfish and grits for brunch and the deviled eggs with crab meat and it was simply delicious!! Definitely one of my new brunch spots! Special shoutouts to the chef and our waiter they were so catering to us! ❤️❤️❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUFVIaFBjbDl6TTBvM2FucGxURU5zZWs1WVlsRRAB",
            "text": "This was my first and will be my last visit to this establishment.\n(I ordered takeout.) Upon returning home and opening the bag, I was disappointed as usual. If I resided closer, I would have promptly returned the food.\nI spent $35 on the beef short rib, and $33 on the seafood pasta but the portion was far from satisfactory, especially considering the inclusion of a large bone.\nWhile I acknowledge that certain foods can be expensive, the price charged does not justify the portion size.\nIf you seek value for your money, I recommend exploring other options."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeWEwVjVSRGQ2Y1hGS1VFOU9URTVsVkVkcVExRRAB",
            "text": "Second time I’ve been there and both times food vibe and staff was amazing! Gabriel handled our table and he made our visit so memorable that we want to bring all our friends when we come back !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbFEwWmlkV2x5VWxrd1lYYzBja293UTB4NVIzYxAB",
            "text": "Our server Gabe was great! He was very nice and accommodating. Great atmosphere. Great drinks. Great music. I would definitely come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMFUwMTJNVXhSZDNaQ01IaHhjRTFSYjJsUlVVRRAB",
            "text": "Service is amazing ! Derek the server was so attentive !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaE5WSllUalpLYmtNelNucExPRkExWkZacVIyYxAB",
            "text": "Thank you sooo much\nDerrick was amazing waiter !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSV09WcG9TV2R1UkRkWldFRjZURGhuYTNwWU5FRRAB",
            "text": "I had an amazing time at Sweet Catch BK ! The customer service is amazing and the food lived up to the hype ! Shout out to our waiter Derek ! He was very attentive and friendly ! I absolutely love this place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNWNISklXbEJmWVdFeVV6aFZZMGw2VmxaV09XYxAB",
            "text": "Food and service is amazing !!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVFl6UndUMjVwVlZwS0xWcHBRMDV5YVRKTU1IYxAB",
            "text": "Julian did a great job of accommodating the table. He made sure everyone was happy & even suggested great food! Definitely a must try!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4QlZucGhZMnBIY1U5dVdrNXJjR1ZDV1Uxa1lXYxAB",
            "text": "We have dined here a few times. The food is alright. Definitely a bit overpriced but I try to support local business. However I decided to not go back anymore when I noticed on my bill that 20% tip is included for party of 2 or larger. Seriously? The service isn’t even that good, just bare minimum, took my order brought over my food."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeGFuVmtVMjl4ZFUxNE5XSjBZalZ2VHpSQlVXYxAB",
            "text": "I hosted my birthday here and had a great time. Planning with the owner, Ka'wana was a breeze and everything turned out exactly as expected. We had a large party of 16 and everyone raved about the food and drinks. The DJ kept the vibes going and our server was so sweet and helpful. Definitely recommend!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTWFqazNaek5RWkROWE5XZEdhMEZsZWtOclNFRRAB",
            "text": "Amazing food, drinks, and good vibes.  I really enjoyed my experience at sweet catch. I will definitely be coming back.  Compliments  to the Chef!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTU56Wm1hWGN6TWpOb05FbE5hSEl3TTBwUmQxRRAB",
            "text": "The chef Erica was awesome and Breonna was the best 🤗"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0elFXSm9aRlJvUmxCUk9HazNaM2hHTUhoUlVtYxAB",
            "text": "Service  was  💯.  I will be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Q1lVdzJjVVZ1ZUdsTFptbDBlVVZxWlVGa1ZXYxAB",
            "text": "Wr had a great  time...everything  was great....love the spot......chef Erica...was the Best ..!!!! Or Server Brianna wascl on point....will be back !!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gd0xXeGtkR0Z4TTJ4Nk5GcGtTV2h5WjE5WFRGRRAB",
            "text": "The food was delicious!! I had the shrimp and waffle. Great service and atmosphere too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcGFuVlJhVTVvV1hNeFJYWjRlRXByYkZVMlVsRRAB",
            "text": "I took a chance on this restaurant because the food appeared decent.  When I arrived the place looked clean and neat.  Once seated it was clear that the service team was happy, in good spirits and they provided service that was pleasant and attentive.  However that is where it ended.  The drinks were tasless and small for the price.  Our food took more than 45 minutes to arrive and when it did it did not arrive together, we had to wait again for one of our guests food.  The portions are like kids sizes, which was disappointing as the prices they charge are like fine dinning Manhattan prices.  The food was salty and the plates we received were chipped. Very disappointing. The last straw is the deceptive menu pricing.  There is no paper menu, so have fun trying to see small print o. Your phone.  there is an item that says one protein and 2 sides for 27 dollars. The catch is that its ONLY if it's chicken ....but it does not specify it on the menu.  So when the bill comes if you choose salmon or shrimp its 27+ 10 dollars.  So you pay 37 dollars for child size mash potatoes child size fries and 4 shrimp or a piece of salmon. But shhhhh....its a surprise!! Because it's not clear on the menu.  If you dont choose chicken you pay 27 for 2 child size sides.  So disappointing. And as a final slap, unless you go alone you are paying 20% AUTOMATIC gratuity.  I will never go back ...and diner be ware."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWM1VrbFBNUzE1UTNoWlFscG1Va1poTmpKRlVYYxAB",
            "text": "This place brings a lot of good soul to the food and I really enjoyed the vibes and great for all party types. Their 3 course menu has great options and i enjoyed their wine. Carb friendly as well just minus the dessert! Check out our amazing video on Instagram @jadaexploresall!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUFJscHdZVTlSY1RoUWFsWkJURTVRVTNJMmNFRRAB",
            "text": "Kina was exceptional. She truly made the experience. Of course I loved the food as well as the beverages. She was the cherry on top."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU2JsOVllR2RKVVZoME1tRkpXUzFGY1ROdlExRRAB",
            "text": "Tiarra was a great server and was very hospitable, adaptable and personable. The Sunday happy hour was great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wc1RVWlhlVlp6UWtkUlVrdHVTMHRwV0d4V2NFRRAB",
            "text": "Tiarra, our service was top tier, food was great, owner was super gracious. Location is beautifully situated, and worth the trip."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RlpGWTBkMUJ3ZG1WNlZVNWFPRzF5Tm1OTmNXYxAB",
            "text": "Great tasting food, host and servers were nice but a little out of sorts."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKeWRUaEJUREJQYkZwWGJ5MXlWVlpsWlY5M2JVRRAB",
            "text": "We had such a lovely time. This was our first visit and it definitely won't be our last. The chef came out to say hi and just knowing she was putting her foot in each dish really amped up the whole vibe. Thank you Sweet Catch 🥰"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeWMyMXZia0p6Y1UxVE0ydHlWRWgyZW1WT01VRRAB",
            "text": "I’ve been here twice now and the food was excellent both times. My favorite dishes were moules frites and firecracker shrimp Good happy hour deal. Will be back many more times"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNFIyTXRSSGhGWTFoMlJEQlNSbWhhVUhSak5uYxAB",
            "text": "My friends and I have been on the hunt for a good bottomless brunch spot & Sweet Catch checks off all the boxes! Love this place. So far I’ve been twice. The food is always delicious, and the service is the best. Gabriel was super attentive and very helpful. I can’t wait to go back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocU9WQldTVzl2VlVoT00xOVZOVXBqYzJJNGRrRRAB",
            "text": "I went for brunch and had the honor of being served by Gabriel. He provided amazing services, very attentive. I definitely will be back. Great atmosphere, you’ll absolutely love it!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS1pWbEllVVozVG05eGJGTkpjMDFVVFVsb2JHYxAB",
            "text": "The mussels with this specially made sauce was amazing!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dVRtTklia05FVFVKSmNETTJUMVJSTVVsQ2QyYxAB",
            "text": "The oysters were great. The drinks were perfect. The curry mussels were the best I've had. Had the bang bang shrimp. Had the Gumbo.  That was too salty. Didn't enjoy that too much. But everything else was fantastic. Definitely going back..  We sat at the patio which was a great part of the restaurant and the music playing was perfect."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVVJHMXhaSGRXVm0xc05GZE5YMXBCV1dWbmJYYxAB",
            "text": "This culinary gem remains hidden from most tourists. The employee had a wonderful demeanor and ensured our initial Restaurant experience was entirely pleasant. The food surpassed similar establishments completely. Meals showcase traditions from around the world. The staff treated us with sincere interest."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oV1NGTkxObW8xWjJFMVJYcGFZWGt0WkRoa00wRRAB",
            "text": "Great food & atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsT1JscDJUVXAzYWxSeWFVOTFZVVptUkhoM2RFRRAB",
            "text": "We had a lovely brunch in a lively atmosphere where a large party was celebrating. There was a bit of a mix up with the menu QR code that displayed only 4 pages with no brunch menu. My husband had chosen gumbo and okra but it turns out that was the dinner menu. We were shown how to refresh the menu to show 6 pages and we chose cornbread, broiled oysters, catfish and grits and a catfish sandwich with Cajun fries. Everything was excellent. We also tried some signature cocktails. The bartender came over saying another customer didn't like her drink so he wanted to check because we had the same drink. It was a bit too sweet. He was able to adjust it at the table. We ordered more oysters after finishing the initial batch. The party was so lively and the DJ was attentive enough to ask if the music was too loud. It wasn't. We will definitely visit again to try the gumbo and okra. The staff was so attentive that they cleared not only finished dishes but a scrap of plastic wrapping that had fallen from a customer near our table and a paper towel I'd used to dry my hands on our table. It's the small things that I noticed. We didn't feel slighted at all despite the large party of like 40 people that came in after us."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxYU56WjRVVkoyVHpBM1pFUTVhbmswWkcxNGVIYxAB",
            "text": "Came here for a group brunch celebration fr my birthday recently. Kawana and her team went above and beyond to make sure we had a great time! Came for the vibe and ambiance because it gives that perfect lunch by the sea vibe, and back patio is so nice! The event manager was so nice answering any questions I had before my event, and helped setting up the backspace. Servers were so attentive constantly making sure hr drinks were filled, and the chef even came out to make sure our food was to our liking, which it was! The day was so lovey and it had a lot to do with how we were treated."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1M2EzRXpRMms0WVVwUWRUSktjWEZEVDJsVk0yYxAB",
            "text": "I must say this is my first time back in 2 years and they did not disappoint. I was seated immediately. My server was Derrick he was very attentive and amazing. Shoutout to the chef and kitchen staff the food was 10000000/10. As for the bartender executed my drink to the T 100000/10. Service and atmosphere out of all was amazing. This restaurant is 10/10 definitely would recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHZuX3hRRRAB",
            "text": "The service and ambiance of this restaurant is top tier! I had a 90th birthday dinner party for my mom and it was well done and very convenient if you want to celebrate and not worry about the clean up. You do have to bring your own decorations and table cloths but the room by itself is gorgeous. Very picturesque and cozy. The staff were so accommodating leading up to and during the event. We met the owner who just seemed like a beautiful soul. Very kind! The food was great we had a fixed menu with a little flexibility for options. These items I highly recommend from the fixed dinner menu - salmon (nice and fresh) seafood pasta (fresh and very tasty), buttermilk chicken (crispy & tasty) chicken pasta (also yummy) and the Harvest Delight (done well for vegans). The short ribs was extremely spicy, they may need to cut down on the spice. Also the sides - collards way too salty and yams way too sweet. We have to be careful and considerate when seasoning as our community is plagued by high blood pressure and diabetes. Their mixed drink we’re sooooo good! I had a lemon drop and it was amazing! Otherwise, I would definitely return to Sweet Catch and I will recommend it for family, friends, colleagues and events. Thank you for a wonderful time filled with great memories Sweet Catch! Little Caribbean is blessed to have you. It’s only up from here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMlVWZzNPWGR1VUZsSVNXNUJaMFJqYWs5aE1FRRAB",
            "text": "Came here with my wife to enjoy a midweek date night and to give this restaurant a try since we pass it all the time...... I'm sad to say that the time spent was actually a waste of our time. We got seated at 6:40 and didn't get water or our order taken until 6:58 by the host! Not even the waiter. Now I know some people may argue and say that waiting almost 20 minutes to have your order taken isn't a big deal, but when it's only 7 tables in the dining room and only 4 tables we're being used ours included with one of those tables finishing up their meal, 20 minutes is  a long time *They had a private event going on in the back HOWEVER if you can't multitask to make sure that the front of the house is covered and taken care of then you should have closed for that private event. We started out with Deviled eggs (Basic & Bland) and oysters. Once our drinks finally arrived (they showed up about 10 minutes AFTER our food) they were overly sweet. All in all we just decided to go ahead and pay for what we consumed and went to another amazing neighborhood establishment to continue our dinner and our evening. Definitely won't be revisiting this location again. Nice atmosphere, Bad Service, Bland food & drinks."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbktMXzV3RRAB",
            "text": "I recently visited Sweet Catch in Brooklyn after hearing rave reviews about their catfish and grits, crab egg Benedict, and seafood boil. Despite my bestie having already enjoyed a great experience there without me (side-eye), I decided it was my turn. My niece had been craving a seafood boil, so it was the perfect excuse to check it out.\n\nWe arrived around 7 PM without a reservation, and after a short wait at the vibrant bar, where the host was incredibly welcoming, we were seated in the beautiful back area complete with a swing—perfect for photos! My niece customized her seafood boil to her liking, and the staff was more than accommodating. I opted for the catfish salad and crab dip, and let me tell you, the food was delicious.\n\nI couldn’t stop there—I returned for a brunch vibe, and DJ Jarvy Jarv had us rocking during a packed session. I indulged in the crab egg Benedict, deviled eggs, and oysters. Also, you must try their sorrel rum punch; you’ll love it! If you go, let them know I sent you. Sweet Catch is truly a Brooklyn gem not to be missed!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsa2RVVldWV2xSYlZsQ1gzTkhTRTFGYW1wc1pIYxAB",
            "text": "I came here to meet my party and there was no host. I went to the bar, and they were unaware of the reservation. I had to find out through my party. Once I was able to find my table, I noticed throughout my time there that a host never appeared to their stand. The server was not good. Although he had a pad, he still made mistakes. In addition, they ran out of mac & cheese, and there were no dessert available. The food was not good, bland, and overpriced. Plus, the drink was overpriced and served in small cups. I will not recommend nor attend this restaurant again. The ONLY good thing about the restaurant is the decor."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcUlyWWJjbjdldzJBRRAB",
            "text": "Amazing brunch and dinner ! brunch was so good we stayed for dinner 10/10 love it and the manager accommodated me with the reservation. Black owned, DJ, Good food, Good drinks and clean !  definitely order the lobster mac, greens ( let not forget its vegan), yams, cat fish, corn bread, shrimp and grits…. i can go on and on ! #fanniebawsapproves"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNE9VRjNRekZOUmtGSFVtNVVVeTFVWVVodFIzYxAB",
            "text": "A great seafood restaurant. A great after-work spot. A great everything. As I walked in, the space was full of people, but the staff was attentive and made sure we were taken care of. Music played, people laughed and sang, but our table was still able to have a conversation.\n\nWhen my order came out, it wasn’t exactly what I asked for and honestly, I was a little nervous to say something. But I did, and I’m so glad I spoke up. Our waiter didn’t make it a big deal at all; they handled it with care and got everything fixed quickly and kindly.  That alone made me feel like I was in the right place.\n\nThe service, energy, and food all came together to make it a standout night. I’ll definitely be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNGFfSkxnEAE",
            "text": "My Wife and I had our wedding celebration here and it was a great time! It was about 30 of us, friends and family! Everyone was raving about the drinks and food so much that we decided to go back after for a date!\n\nHands down the crab dip & plantains, the honey glazed cornbread, and seafood pasta, just to name a few are a must try! The coconut mojito mocktail was delicious!\n\nThank you Sweet Catch for the great vibes, great customer service, and great food & drinks. To top it off the manager Kawana was very pleasant and hands on! We were not disappointed! If you are considering a place to have your next event we definitely recommend Sweet Catch BK!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdDhPMnVRRRAB",
            "text": "Overall rating: 4.5\n\nI’ve been two times for their happy hour.  One of my friends is a regular & I don’t usually go out in the area, so it was a great new visit. I am absolutely obsessed with their mussels & curry. I wish I could buy a jar of that curry 🤤\n\nThe second time I went was about 2.5 weeks after. So I thought it was weird/ interesting that the second time I went, I had a 20% automatic gratuity to my bill bc the first time didn’t have it. Maybe I gave the impression that I wouldn’t tip? I’m not sure. But the first time I did, so overall confused. Maybe it’s because I’m quiet? Hm not sure. Will try again to see if I have a different experience. I really like the community. But maybe I’m too different."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObGFqRXdSV05IVUd3d1gzZEZjazVsU1hadFVtYxAB",
            "text": "We had such a great time celebrating my twin sister, who is preparing to welcome her first daughter. She wanted an intimate baby shower and Sweet Catch BK was the perfect spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VObnhodXVGa2FyaGZBEAE",
            "text": "My friend and I went to happy hour and got a dozen oysters. The oysters did NOT taste fresh and were shucked terribly- there were little pieces of shell in them and they were still attached to the bottom of the shell. We were there at 5pm, there were maybe 4 other people in the restaurant, and the dj was BLASTING music to the point we had to shout to hear each other even though we were sitting right next to each other. Will not be returning."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJS1E3ZnJlMnRyUERBEAE",
            "text": "Over the weekend I got to celebrate my Birthday/Graduation at the Black Female Owned Restaurant Sweet Catch in Brooklyn. The seafood/soul food restaurant is the perfect place if you are looking for an intimate gathering with family and friends. I HAD A GREAT TIME!!!!\nEveryone knows planning a dinner party can be very stressful because there are so many moving parts and changes happening. However, Kawana and her team ensured that my guest and I had EVERYTHING we needed, and I mean EVERYTHING. And when those last-minute changes were happening, her team took swift action in making changes that accommodated everyone. I HAD A GREAT TIME!!!\nThey allow you to bring in your own DJ, their pre-fixe menu for large parties have several food choices that can accommodate any individual food preference. The drinks were flowing and strong. All my guest left happy, content, and satisfied. Everyone has stated to me, “the vibes were good, food was great, and you felt the love in the room”. I wouldn’t have been able to plan this dinner party without the help of Kawana and her team of Staff, they are AMAZING!!! I still have goosebumps on how well everything went from start to finish, I can’t stop smiling. I HAD A GREAT TIME!!!!\nThank you again to the Staff of SWEET CATCH BROOKLYN for all their hard work and exceptional hospitality Saturday Evening. YOU GUYS ARE AMAZING!!!\nSpecial Thanks to Khemah and Danielle, their level of professionalism is unmatched, attention to detail was point on, and their flawless customer service, THANK YOU LADIES from the bottom of my heart. I am so appreciative of you ladies for helping my guest and I create a memorable evening. I HAD A GREAT TIME!!!!\nI will be back soon!!!\nTHANK YOU, SWEET CATCH!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueFBXRzRnRRAB",
            "text": "1st I want to say the service is great. Staff was very attentive and friendly. The ambiance was good. Aesthetics are very pleasing. Music was great.  For appetizers, we ordered the crab deviled eggs and the Maryland crab cake. Both were 10/10. Now for these entrees. We ordered the chicken and shrimp on a cornbread waffle and the catfish and grits. That waffle was everythingggg. The meal was so good. Now them grits was THE BEST GRITS IVE EVER HAD!! 10/10. I will definitely be coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNGNteGpVR05WTUdSUGNGVm1XVmxLUWxsRk0xRRAB",
            "text": "Threw a party here... the  atmosphere is nice. The service was mediocre. The food however was not good. The fried chicken was dry and tasted like there was not one ounce of seasoning and looked like it was fried too long. Cornbread was like a little 1 inch triangle that tasted like a burnt pan... The portions were too small for a 65 dollar plate. The waiters didn't take drink orders. It was really disorganized meal. Our guest also confirmed that the food was not up to par. I suggest the menu is reevaluated and the chef trained better. The host was really nice tho. She made the experience so much better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxb2NUQjRTalkyVkhsT00yWm9MVzA1Y2xkS2JIYxAB",
            "text": "Such a beautiful experience! Came from Philly for my friends birthday and can’t wait to make it back. The staff was friendly , food was GREAT, and the DJ helped to set the fun and lit atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLWFPbFZ3EAE",
            "text": "I celebrated a milestone birthday here for a large group. Despite some hiccups in the planning/reservations, the team was attentive every step of the way. Great communication and worked with me to navigate around challenges (I can’t wait for the patio to be open for use!). The day of the event, the staff was warm and friendly. The food was superb. Even the chef came out to make sure we were enjoying everything. The waitstaff was attentive and made sure the vibes flowed. The DJ was great. Everyone had a great time. I couldn’t have asked for more. 10/10 experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dExIMm9RRRAB",
            "text": "Great customer experience from seating to leaving! The crab dip is a hot seller— 4 out of 6 tables placed this order; I’d recommend. The black eye pea fritters are unique and an acquired taste; great for plant based crowd. The seafood pasta was a hit! The noodles I could eat as an entree on its own; can be a shared plate as well. The sweet catch dinner plate was great in portion size as well as flavor! The shrimp and grits are a good seller too, next time I’ll just request that light finishing of the parsley garnish.\n\nI’d like to come back and just sit at the bar and have the cocktails! Great establishment and you call tell all the workers enjoy their job!! I didn’t get to check out the patio because it was raining, but I bet it’s awesome especially as the weather gets nicer. My only critique is I wish the dj stayed longer than 6:30pm on a Saturday night— maybe that’s the plan as the summer approaches."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSeVMyWm1hVlJQZDFaUVZIZGxSWGRNYVROblJVRRAB",
            "text": "First time here, the punch is phenomenal and the crab cakes are delicious. The coating is nice and crispy and there is real crab with a delicious sauce on the side to dip it in. The mesclun salad is also delicious alongside the dish.\n\nI had the jerk short rib, which was delicious. Very tender and seasoned to perfection. The service was great as well. Gabriel took care of us and was very nice.\n\nThey include 20% gratuity for two or more, which is very different from a lot of places so just be aware of that as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMblRvSm5Ec3BUOWx3RRAB",
            "text": "Great place to break bread with friends. Friendly and courteous staff. The food was amazing. Definitely come back from Staten Island to have a good time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROX29PN1J3EAE",
            "text": "Last month the girls and I stopped by Sweet Catch to check out their brunch selections. The ladies had been before (I think for a soft opening event) however, this was my first time.\n\nFrom on-set I was a fan because the seafood centered menu, but to learn that this establishment is Black Woman Owned, was literal the butter to my lobster, so to speak.\n\nI decided to go with Shrimp and Grits but was told that they were out for the day, visible disappointed they managed to work something out for me. I was so happy they did... shrimp n grits 10/10 would highly recommend. My two girlfriends ordered the crab cake eggs benedict and the shrimp, chicken and waffles. I had the opportunity to try both. The crab cakes were good and the fried shrimp was amazing, we order an additional side of shrimp. The waffle left us all with questions, it was a savory corn waffle but the powdered sugar and syrup did not really appeal to any of us.\n\nOverall a great experience, small yet comfy atmosphere with nice lighting and decor and great staff with a DJ providing the brunch vibes.\n\nDefinitely worth checking out.\n\nJust A Note:\n\nHead to the back for a cool photo-opt."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2b2VyZTZRRRAB",
            "text": "Sweet Catch has a $60 brunch special that includes bottomless mimosas or Bellinis and one entree. They have a fun environment with a DJ and a back patio to enjoy the warm weather in the summer. I recommend the crab dip and avocado toast 😋✨\n\nFollow @butteronaroll_ on TikTok & IG for more 🧈"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5X0p5VkZREAE",
            "text": "Very welcoming!! We went for bottomless brunch which was $60 per person with a main course included along with different options such as different flavor mimosas. We had the oysters,  black eye pea fritters and fried chicken and shrimp with waffles. The food was delicious and the ambiance was lovely."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sb1lWUldYek4yTmtGWFZERmZWUzFZVmxGMWVGRRAB",
            "text": "Went here this past weekend to celebrate a friend‘s birthday. The service was amazing. The food was even better and the drinks kept coming. I definitely recommend this place. If you’re in the area are looking for a great brunch spot. Can’t wait to come back and try one of their dinner items."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcFJHMTRMWE40UmtwUU5tMXRiRXB4ZUhsQ2FIYxAB",
            "text": "Omg had apps and dinner here two Fridays in a row. Not my first time but I think I forgot how delicious their food. Something is in the fried fish because MY GOODNESS. I also loved shrimp, coconut curry mussels, fries… man everything was delish!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdGE3OWhnRRAB",
            "text": "This place was nothing short of amazing! The owner was delightful and very accommodating. We came with a couples group from our church, and they were able to adhere to dietary restrictions for some, and the price was more than reasonable. I had the fried chicken, and usually non-seafood dishes at a seafood spot, tend to be ok at best. That was not the case here! I loved it! My wife had the catfish and grits, and absolutely enjoyed  it too! The sides were beyond delightful as well. Everything bursts with such flavor. If you're thinking about dining here...THINK NO MORE....just go! It's well worth it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN1Bla0RBEAE",
            "text": "I recently contacted Sweet Catch about hosting my 50th Birthday Party for about 20- 25 guests. The owner Kawana promptly called me back and she assisted with all the planning. The weeks leading up to my dinner, she was always just an email or phone call away.\n\nThe night of the dinner, we had the most amazing time! The food, the staff, the atmosphere…everything was perfect! My guests all enjoyed their appetizers, drinks and meals. If you are thinking about having a small event there…just book it! You won’t be disappointed. A birthday I will always remember!! Definitely 10/10!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdjhMcWR3EAE",
            "text": "So this place is cute, however the food took too long to come. The waiter was the bartender too🤣. They are a little overpriced. The grits are good. I had better flavored shrimp. The lemonade was amazing though. They put the tip automatically when there is four or more!  They should let customers know that before hand. I would go back!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3c19QUUZnEAE",
            "text": "Stepped in for an early dinner to this restaurant that I always see in passing. Decor was cute. Drinks were creative and refreshing. Food was delicious, flavorful and tasty.  Staff was friendly and knowledgeable and the vybe at the establishment was chill and laid-back. I definitely recommend visiting this spot. You must have the cornbread it was memorable; in a great way. My black rice with snapper in a coconut curry sauce was outstanding."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRmQza3pSR2MzUW1kT05uWktVVTV6V0dkZlpuYxAB",
            "text": "so here’s the breakdown I think the service was phenomenal. The atmosphere was beautiful. Every square inch of the restaurant was lovely BUT the food did not meet the same expectations. I rate my order of the seafood boil one star. It was bland/Tasteless. I’ve never been so disappointed. For $60 I was expecting to be wowed. Do yourself a favor and do not order the seafood broil. My mom had the fish, macaroni and cheese and collard greens. She reported that the macaroni and cheese with cheesy, the collard greens were smoked to her liking however the fish was bland(no seasoning). The Restaurant should master making seafood. It’s cool that the sides are yummy, but this is supposed to be a seafood restaurant so I was very disappointed. I will not return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNTdIaVhREAE",
            "text": "Nice place to check out for brunch. Staff are very nice and helpful when it comes to recommendations. Food is really good and you can never go wrong with mimosa. The shrimp deviled eggs are definitely a must try.  I had the chicken, shrimp and waffles for my meal but with the regular waffle batter. Waffle was soft, fluffy and light. Food wise, everything was good. I like the fact that the owner was walking around and checking on everyone to make sure everything was ok and to answer any questions. She showed us the backyard which I didn’t even know they had. Backyard is nice and warm which is perfect for anyone looking to dine in a backyard during the winter. I would definitely return here again for brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMzRQNVV3EAE",
            "text": "Restaurant Name: Sweet Catch BK\n\nI recently had the pleasure of dining at Sweet Catch BK, and it was an exceptional experience from start to finish. Here's a breakdown of what made this visit so memorable:\n\nFood: A 1\nThe food was simply outstanding. Every dish was prepared with care and presented beautifully. The flavors were perfectly balanced, and the ingredients were fresh and of high quality.  The chef's attention to detail really shines through in every bite.\n\nAtmosphere:\nThe ambiance was warm and inviting, making it the perfect place for a cozy dinner or a special celebration. The décor was tasteful and modern, yet it maintains a welcoming vibe that makes you feel right at home. The lighting is just right—not too bright, but enough to create a comfortable dining environment.\n\nCustomer Service:\nThe service was impeccable. The staff were attentive, knowledgeable, and genuinely friendly. They made sure that all of our needs were met without being overbearing. It’s clear that they care about providing a top-notch dining experience, and they went out of their way to make us feel welcome.\n\nDrinks:\nThe drink selection was equally impressive. The drinks were expertly crafted, and the bartender was happy to make recommendations based on our preferences. Each drink complemented our meal perfectly.\n\nOverall, Sweet Catch BK exceeded all our expectations. From the delicious food to the inviting atmosphere and outstanding service, this restaurant is a true gem. I highly recommend it to anyone looking for an unforgettable dining experience."
        }
    ],
    "reviews_count": 83
}