{
    "name": "Pomo BK",
    "place_id": "ChIJv8oanR9bwokRJ9ngZL91RJg",
    "grid": "BK9",
    "address": "2122 Beekman Pl, Brooklyn, NY 11225, USA",
    "rating": 4.5,
    "user_ratings_total": 75,
    "phone_number": "(347) 384-1944",
    "reviews": [
        {
            "date": "3주 전",
            "language": "gn",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJdFgycFZibkJoVkZGNVVteHZNa2t6ZVc5aGFWRRAB",
            "text": "Mau and Noel! Gracias por todo siempre! Son lo mejor!\n\nGo try this Mexican place! It’s the BEST in the neighborhood!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWWFVRjJSVFZPY0hoa016aDVjbDlpWm1jM1NFRRAB",
            "text": "Truly, this place never misses. We’ve been here so much and have never had a bad experience. Drinks, food, and vibes are immaculate"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NWRXbGpRa1JSUTBaRFltMW9lRGRPV1hGTmRsRRAB",
            "text": "I came on Friday, September 18th,2025 around 10:30pm. My experience was HORRIBLEEEE!! The bartender was so drunk, giving out free shots all night, he couldn’t get my drink order right. I tried to speak to the manager who told me his name is “victor”. Once the bartender spoke to him, he wouldn’t even hear me out. He just basically told me that they are not serving me any liquor, mind u, I just got here and was not able to have one drink. I asked a few customers around and of course his name was not victor. I would NOT recommend this place AT ALL."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaUxVOVJla0ZzYURKbE9XaENTblF3Ums5eU1rRRAB",
            "text": "Amazing happy hour margaritas, amazing al pastor tacos"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWmIyMWlkWE5zU1cxUFNGWlVkMDF2WjNoQk5VRRAB",
            "text": "I adore this spot. The owners and staff are beyond hospitable and at the top of their game, and the food is absolutely sensational  - especially at this price point. 5 bucks for a taco is pretty common these days, but please take note: THEY MAKE MASA TORTILLAS IN HOUSE!! I feel like I'm committing an act of infidelity on my previous Mexican joint, but I have no choice.\n\nThe margaritas are also stellar, as are all the drinks. Come ready for a nice tipple and chat with the owners :)\n\nPs: they were a-ok with my lil' (well-behaved) terrier joining us, which was simply above and beyond <3 thanks, guys, and see you soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUlR6UldWVUZMYkZadE5rSk9XREJsU0daeVExRRAB",
            "text": "I ordered steak tacos for takeout, but what I received was disappointing. The meat didn’t taste like steak at all and was completely lacking in flavor. The meat looked pale and unappetizing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNloxVXdiMWx1YzFwMVYwMW5SRVJpTFZBMFJHYxAB",
            "text": "Enjoyed the company at the bar, bar keep nice guy. Drinks are affordable, come and please support this place, people here are very chill but I don't usually go to bars anymore! 🍻😊 #Bar #Drinks #People #Support"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205S1NWYzNVV3N5YVU1TGNtcDZMWE5OU0ZvNE5sRRAB",
            "text": "Great spot but opens whenever they want. Don’t bother coming before 4pm on Saturday or Sunday. They may or may not be open."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPekVpTS1lNU9xU1NnEAE",
            "text": "They serve Mezcal Margheritas and Mexican pizzas."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMX3ZsTktLay1md3ZRRRAB",
            "text": "Great drinks, and the music is on point. Definitely worth checking out and great for drinks!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPZV9tZW1XemF1cHd3RRAB",
            "text": "Servers were fast and nice.  Food was terrible. Decent atmosphere, no circulation"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOUEZ4TnpmME9DUDVRRRAB",
            "text": "Great food as always\nGreat drinks\nPizza is A plus\nGet the tacos\nDecided to Comee because of spanglishreviews on instagram"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbmFmYkdnEAE",
            "text": "This place rules. Delicious drinks and the best nachos I’ve had in the area. Gotta stop by. Friendly staff too!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNzY2WnFBRRAB",
            "text": "Wow. Run, don't walk, to this place. We tried a few things--the shrimp tacos, elote pizza, mole pizza, and cheese pizza for our kids. It was all excellent right down to the dough they use. The mole pizza was SO good that we ordered a second one before we were finished with the first!\n\nI'm not exaggerating when I say they make the best margaritas I've ever had.  Top-shelf ingredients, light, refreshing and absolutely no sour mix in sight.  You can't beat the hospitality at Pomo either! We can't wait to return!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dDRDX3R3RRAB",
            "text": "Solid food and drinks! Strongly recommend the mezcalitas and the esquites pizza. 😋"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNXZ1OGx3RRAB",
            "text": "Pizza was just not good. Tasteless avocado and sauce."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBa0s3MEZ3EAE",
            "text": "Pomo is great! We've come three weeks in a row now. Tacos are great – tasty, filling, and high quality ingredients. The owners are really welcoming and friendly."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfazlPTHdRRRAB",
            "text": "The place was cute .. We sat at the bar.. Drinks were strong and delish.. Marcello was the bartender he was great … The Tinga pizza was amazing! Definitely will be back for the pizza and drinks"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cDRydy1BRRAB",
            "text": "I didn’t eat but the margarita, service and vibe was great. I’ll definitely be back"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQX3RmZEF3EAE",
            "text": "A hidden gem in the PLG/ Flatbush area! The drinks were strong and delicious, the pizzas are so unique and yummy, and the vibe is very chill but decorated nicely. This is my new hangout spot for good eats and drinks with friends or a date night out. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueXNlN2NREAE",
            "text": "Pomo is super cute and Javier (the chef) is awesome! The cocktails we got were tasty and stiff. The music was on point the whole time. I love the neon everywhere, and I’ll never complain about a disco ball. I wouldn’t have thought to put Mexican flavors on a pizza, but it was delicious. Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINHNQRTJ3RRAB",
            "text": "Great drinks amazing pizzas\nI got the Elote pizza amazing !!!!service on point  !!! Def come back"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNId0xiMV93RRAB",
            "text": "Awesome spot. Great service. A ton of different tequilas and mezcals. Lots of pizza options. Good seating inside and out.  Will be back for sure"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bXZqdDdRRRAB",
            "text": "I had been hesitant to go here, because it’s often empty. But, I think it’s a hidden gem! The food is better than the other Mexican restaurants in the area. The drinks are very good. There is outdoor and indoor seating. The owner is sweet and previously worked at restaurants in Mexico City. And there is often a DJ! I have no idea why it isn’t more busy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bXRpcXR3RRAB",
            "text": "I recently visited POMO & PIZZAS X and had an amazing experience! The pizzas were absolutely delicious—the dough was perfectly crispy on the outside while remaining soft inside, and each bite was rich and savory. The environment was warm and welcoming, making it a great place to relax and enjoy a meal. The cocktails were a real highlight—creative, flavorful, and a perfect complement to the food. To top it all off, the music added a vibrant touch to the overall atmosphere. Highly recommend this spot if you’re looking for a unique and satisfying pizza experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOVBLcGR3EAE",
            "text": "Delicious Mexican pizzas and frozen margarita specials. Service was excellent!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidDlmVTZnRRAB",
            "text": "This place is so amazing! The pizzas are some of the best I’ve had in the city. Mad props to Javier, he’s got a new regular!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaTZUTDlRRRAB",
            "text": "I went to Pomo and now there’s a pizza place in the corner of the store and it’s Mexican pizza and it THE BEST PIZZA EVER there’s Al pastor and a couple more pizza they came out in  10 minutes nice and FRESH we also got the buffalo wings which came out very quick the meat was falling off the bone and it was so juicy and tender the buffalo sauce was average and the drinks were refreshing!!!! The staff was VERY FRIENDLY ❤️ I was invited to the private event with some friends and they said the menu should come out Saturday or latest Sunday. I will 100% be coming back! I have never had a rating this high but the place deserves a high rating. Also the area has a lot of homeless that’s the only downside from the atmosphere. Everything is perfect 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyay0zZnhBRRAB",
            "text": "The best mezcal margaritas I’ve had outside of CDMX. Also best happy hour deals of almost any bar in Brooklyn. And the food is delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeV9qX2J3EAE",
            "text": "It appears to be a goof spot for happy hour. Pet and children friendly. I do not recommend the tacos.  The chicken was from a can."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqb2R2WFlREAE",
            "text": "Hidden gem"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqb2F2MXBnRRAB",
            "text": "best cocktails!!\nyou should try it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqX00yRWNBEAE",
            "text": "We love this local spot tucked on a small block off Flatbush! The mezcal cocktails are delicious (especially the Penicillin)… and the pork tacos are soooo good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbjhUdUVREAE",
            "text": "i went once and had a really great time, i had a chicken torta which was pretty good. both the cocktails i had were delicious. this place shows great potential for becoming a popular local spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZ2NEajB3RRAB",
            "text": "Very Clean Great Service Good Bar Lowkey Vibes In The Neighborhood 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdE43eEV3EAE",
            "text": "Best spot in Brooklyn. Thank you Mauro and Pablo. The cocktails are delish👌🏼 and food flavorful. Will come back again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dTVUazVBRRAB",
            "text": "This place is a true hidden gem in Flatbush. Mezcal (that’s actually high quality—not the cheap stuff!), solid tacos, and really friendly staff. We travel from 20 minutes away by foot for their happy hour and some tacos in the middle of the week. In an age when many bars either have bad happy hours or none at all, I really appreciate an $8 margarita that actually tastes like a GOOD elevated cocktail (not like sickly sweet which is the norm in the neighborhood) Im not a beer drinker, but the excellent Mexican microbrew on tap is $5 during happy hour, which is kind of unbeatable.\n\nI used to love the old Erv’s here (RIP) so I respect the folks here holding it down despite the tragic history of the place. They’re just out here trying to make a nice spot to enjoy authentic Mexican spirits ✨"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5N3RyR05BEAE",
            "text": "Nice cocktails"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MzVhYlR3EAE",
            "text": "This place is legit. Best margs in the neighborhood by a mile"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOcjViaFRREAE",
            "text": "Stopped by for a dinner with a friend. We had couple drinks and a burger each. Burgers were awful. It wasn’t really a smashed burger as it says in the menu. Patty was tasteless and the rest of ingredients below average. Drinks and beer were fine. Good service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscXB1aTJRRRAB",
            "text": "Tasty Carne asada quesadilla and the Mexican Penicillin was well mixed"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcUlDUjJnRRAB",
            "text": "Dope, chill,  cool vibe on the cut. Great drinks,  service, live music. Check it out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGMmJmY2JBEAE",
            "text": "Pomo BK is a great Mexican cocktail bar. The food and drinks are wonderful. I tried the shrimp taco, it's one of the best in Brooklyn. Give Pomo BK a try, you would enjoy it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaN1BpZkJ3EAE",
            "text": "Fantastic meal!  Amazing cocktails and delicious food - we had guacamole, tacos and a burrito.  Very authentic, non- cheesy/saucy Mexican. The manager, Pablo, is awesome.  So happy Pomo opened in PLG!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdllIZ09REAE",
            "text": "This hidden gem inside a cul de sac has some of the best tacos: juicy and flavorful, and packed full. The shrimp tacos are an especially good deal.\n\nEach of the cocktails are balanced and use high quality ingredients and thoughtful garnishes. I appreciate they use agave (which tastes better and is better for the body) instead of simple syrup. But if you're not drinking they can make a few cocktails without alcohol and have an excellent alcohol-free paloma (not just grapefruit juice) with complex and interesting flavors.\n\nThe owner is friendly and attentive, and the vibe is pretty chill. I've been here once a week since I found this place, working my way through the cocktail list but ordering my favorite tacos again and again. It's great for an easy date night, but also has lots of space for a large group or party.\n\nDefinitely come here for the food and drinks alone, but I'm looking forward to seeing their events programming pick up, with salsa dance nights, comedy, and music shows."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaC1tdUxnEAE",
            "text": "Delicious food and friendly staff. Thanks for a great time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aXBLbjd3RRAB",
            "text": "Steak and eggs, gorditas, and the best margarita in Flatbush / PLG. Great spot for brunch! Check out their taco Tuesdays, it’s a great deal and the food is amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSODdUN21BRRAB",
            "text": "Wonderful spot for delicious margaritas and authentic Mexican food. The guacamole was served with their homemade peanut salsa, which I would buy by the jar if they sold it. So good! Tacos were excellent. We tried the shrimp, carnitas, soyrizo and pork. Perfectly seasoned and very filling. Service was excellent too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNVlhLTVRRRAB",
            "text": "This is a great new spot in PLG! Maybe the best tacos I've had in New York. The carne asada is juicy and generously heaped onto the tortilla. The carnitas are perfectly cooked, slightly crispy on the outside with the inside melting in your mouth. They have delicious shrimp and vegetarian tacos as well.\n\nThe staff is very friendly and knowledgeable on their tequila and mezcal selection, which is also prominently featured in their menu of tasty cocktails.\n\nThey also offer carryout and delivery through Grubhub!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdVlEU0p3EAE",
            "text": "Hella cute inside, getting its sea legs still. Cumbia on rotation, neon, clean aesthetic. Definitely recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNFpUU0tBEAE",
            "text": "Love love love this bar. If you want to get to know about tequila and mezcal this is the place to go. The bartenders are super informative, friendly and the place looks beautiful. 100% see potential at this place. Can't wait to see the growth of this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOGZ2ZDBBRRAB",
            "text": "Visited for the first time today. Asked for something non-alcoholic, and the bartender hooked me up with a delicious virgin mojito.  He then checked in me too see how I liked it.  I felt welcomed. Not sure about the comment about non-inclusivity.  I'm black, and they treated me like a VIP."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOWY2SXV3RRAB",
            "text": "Edgar and Mauricio are as knowledgeable as they are kind. They’re down to talk nonsense or get real about their passions. Your passions. Chisme. Generally just talk about whatever. They’re willing to flex their knowledge of cocktails and…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNWFMSDl3RRAB",
            "text": "Nice spot, tasty drinks and friendly service.\n\nWas surprised that a mixed drink (rye + ginger beer, rum + ginger beer) were $18 a pop. Probably won't go back for cocktails for that reason."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodjhpZ0ZnEAE",
            "text": "elite cocktails, elite food. it is hidden gem. get here before it takes off. the workers are all good people and are highly professional."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM3RyRkx3EAE",
            "text": "Food took 45 minutes to come out when there were only 5 other people here. The I was told they didn’t have a specific item I ordered it. I was only told after the rest of the food came out. This place was very underwhelming and left a bad taste in my mouth literally and figuratively."
        }
    ],
    "reviews_count": 56
}