{
    "name": "PLG Coffee House and Tavern",
    "place_id": "ChIJT8GkcG5bwokRby0XYER8lxc",
    "grid": "BK9",
    "address": "499 Rogers Ave, Brooklyn, NY 11225, USA",
    "rating": 4.1,
    "user_ratings_total": 742,
    "phone_number": "(347) 413-7944",
    "reviews": [
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPc3BuY1NnEAE",
            "text": "I love their food, location, and vibe, but they really must work on wait times and cleanliness. The air purifier they use is covered in visible dust, tables are sticky, and there’s a musty smell of old burnt bread. If this is what it looks like from the front of house I can only imagine the back. Also, it takes like 30 minutes just for a smoothie. Also, none of the employees wear masks. Unfortunately I’ll need to take a break from PLG for a while.\n\n2025 update: I think they’ve cleaned up their act, but they’re still very slow/ forget orders/ etc. still recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wU1QyaDBUbU5LZEMxT1EwTTRWbVJsVVRNNVZuYxAB",
            "text": "They are not a tavern, it is a coffee shop."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toalpIcGFNMnhMYUROYVkzTm1VRU5VYUZOYWIyYxAB",
            "text": "Man, I’m super disappointed in this neighborhood coffee shop. Went there this morning and waited 25 minutes for 2 Breakfast Sandwiches and after 25 minutes of waiting, one came out wrong and had to be remade (another 10 minutes). The chef behind the counter (Glinda, I think) was on her phone the entire time I was there which is fine, but very unsanitary to be cooking and tapping on your phone at the same time. Made me lose my appetite watching her go phone talking and tapping on her phone to assembling sandwiches. Which it could have been a better experience or at least refunded for the mistake and amount of time I had to wait (~35 minutes for 2 sandwiches…)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSlJGTlZibXQ2VVVweFVGRlNXV3BsVUc5VmRtYxAB",
            "text": "Living in the area for 35 years and this is one of my favorite coffee and breakfast spots. The vibe is calm, the staff are professional and down to earth. every time I have a client looking to buy in the area, I always bring them to PLG Coffee House."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WGMxWXdjV05HVTNad1QwZHpVSHBsZUVRNFNHYxAB",
            "text": "Waited 30 minutes for a to go sandwich"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bGVWUk5TRlJTYlhVMFdsRm1ibDk1VWxjdFQzYxAB",
            "text": "Haven’t had coffee this good since the 90s haha. But seriously, black coffee and espresso is some of the best in Brooklyn. The atmosphere stands out too which is why I’m here all the time. Staff keep it real. This is a gem and a rarity."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdlVWTndhVGxrVkVwZlVESmZTRzVxVURoRlpVRRAB",
            "text": "Best latte I’ve had in Brooklyn. I basically come here  on alternate Side parking days. Because they’re a little out of my way.\nNote to self; pay with card next time. They don’t seem to keep much change in their drawer. But no big deal."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdFlMc0N3EAE",
            "text": "Ive been coming here for years and became even more loyal when I noticed they were feeding front line workers during the pandemic. Places like this make my love of PLG even deeper!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQ2RWbEdVRzFVYlc5TlVFZzNhVkZxZDNWclFrRRAB",
            "text": "came with my husband, baby, and friend on a friday afternoon and grabbed a seat at the communal table. not too crowded, mostly people working on their laptops. quiet,some music (slightly lower volume would’ve been even better), and we were able to chat without raising our voices. my baby fell asleep ins troller and we enjoyed two smoothies, a tuna melt, and turkey avocado sandwich—all delicious and decently priced. sandwiches used to take forever but were done in a decent time on this visit. friendly staff. atmosphere could use some work—space felt cluttered and outdated, you’ll walk out smelling a bit like food. overall good experience and nice neighborhood staple."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUlVHSmFlVk5HU21obVlWbGtWVVYwV0VzdGQwRRAB",
            "text": "Moved a family member into the neighborhood the day before so we popped in here on Sunday morning for some breakfast. Had bacon, egg and cheese on an onion bagel and it was delicious. Coffee was great too. We’ll definitely be back when we visit! 🥯☕️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTmFXNUZVV1Y2TlU5WmFEQXhla0ptY1Rjd1RFRRAB",
            "text": "Rude. Slow. Order a mess. :("
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQcmJQMkNREAE",
            "text": "The lattes are good with a lot of milk choices. There's a community fridge (love that, gets an extra star just for that.) Service is usually fine but slow. Lots of tea choices. However, the food is reliably inconsistent. Sometimes it's really really good, other times it feels like they are scraping the barrel. Today I got a crumbled overcooked slice of bacon on my BLT and some stale tortilla chips bc they were out of potato chips. I am going to avoid food there for a while and stick to drinks."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSkxVTk1jRlJhUmpjNVVscEZhMGRMTjFZMk5IYxAB",
            "text": "Excellent service!! Tha cappuccino coffe is the best."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SE9FUnlVMU5LUlZsbFRVTnJWVWc0VVVneVVIYxAB",
            "text": "I’ve given this place a try several times over the years, hoping it might improve, but the experience is consistently disappointing. The service is careless, the staff seems untrained, and the food is mediocre at best. They frequently get orders wrong, and instead of correcting the mistake politely, they act annoyed when you point it out. It really feels like they don’t care about their customers. Thankfully, the neighborhood now has much better options , places that actually make an effort and value the community."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMWVVaG5PVWx5TkZGbWVreGZaVXgxV0hsbWMyYxAB",
            "text": "Tried to have lunch once with my parents. Took 45 minutes to get sandwiches, my parents are quite elderly. I felt guilty, the work staff was shouting at each other, and at the end, sandwich wasn’t anything better than a deli. In fact, much worse."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BemNqaG9OR1pZVEY4elJ6bE1TRGRIZVMwMmFtYxAB",
            "text": "This place holds some of the best memories of my life. Every time I walk in and order the same black ice coffee and 2 biscuits that I ordered for 4 years, it brings me back.\nFood is top quality and very fresh.\nCoffee always on point\nSmoothies delicious\nMusic - all bangers!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReU5USldaRVJoYUdaZmRuRlNhSEprTlMxalMzYxAB",
            "text": "Had the farm chicken sandwich. It was very tasty.\n\nService was friendly but a little unprofessional.\n\nNice vibes but didn't feel like the AC was working. Then again, it was one of the hottest days so maybe it just couldn't keep up this time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUVMzQm5NbmhhUzB4UFpVTjFia1JpTkVaWldVRRAB",
            "text": "Out of most of the menu, tables dirty, asked for no capers and received capers. Smoothie watered down. Coffee mediocre."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVdFQzSnViM2xLWmtScWFqbFBiMVZWT0Mxd2FuYxAB",
            "text": "Very disappointing experience.\nI waited over 20 minutes just to place my order at the counter and it wasn’t even busy. By noon, they were already out of eggs and avocado. How is that even possible? Totally unprofessional and a waste of time. Definitely do not recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVVlrMVlRbDlsY0RSR1YyVTRWMHRXV1hSSU5VRRAB",
            "text": "More than once have gotten coffee grounds in my coffee, always overpriced and mediocre food, and service has been bad since I moved to PLG more than 6 years ago. I’m seeing pretty similar reviews, which makes it even worse because management has done nothing to rectify any of the staffing issues that likely are leading to most problems. With so many good coffee shops literally a couple blocks up and down Rogers now I pretty much never go here for coffee any more and as soon as a better sandwich place pops up I won’t have a need to come here when I’m in a pinch for lunch"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPUFlvNTNadHBfVnpBRRAB",
            "text": "Great little cafe. Burrito was lovely and reasonable pricing for area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJR0trNkR3OV9QVUlBEAE",
            "text": "Waffles with eggs and bacon were yummy! A+"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VONmpuNG5xaHRTNVRnEAE",
            "text": "Really bad situation. They were out of much of the menu. Then a thirty minute wait for sandwiches. They brought cheese on vegan friend’s sandwich. They refused to give me a refund. Then she had to wait thirty more minutes. There was no more hummus, and the cheese was still there on the plate for unclear reasons. Two people working when there should be four."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMbkRwcURCcHJfVFFnEAE",
            "text": "Beware of the biscuit. It’s a cheese biscuit and they don’t mention that :/"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKUGIxWUhDM29EN1R3EAE",
            "text": "I always try to go to PLG and support them. The staff are incredible. I can definitely recommend the tuna melt. But they do some weird things sometimes. I don’t like cold brew and always make sure to order iced coffee (they have both on the menu) but often I get charged for cold brew (it’s more expensive) and served that. If they’re going to have both I should get what I ordered. If it didn’t happen every time I tried to go there I would feel differently.\n\nI will also sometimes get their breakfast sandwiches which are outrageously priced for what you get. I got an $8.50 BEC and there was only one egg on it? I’m glad they got more bagel options now but come on.\n\nI really love the workers and the vibe at PLG and I love supporting small businesses and the community fridge. But I often spend around $20 there and I don’t know what for. But I will probably continue to go in hopes it’ll be what it can be one day."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvd2I3RE9BEAE",
            "text": "Guys. You really gotta pick it up. I have been here several times hoping that I'm just there on somebody's bad day but this place has been consistently inefficient and sloppy. Today, they were seemingly out of everything so I got a sandwich that seemed quick because I needed to get back to work. It took 20 minutes to assemble a bagel with whitefish salad, 7 capers and 8 tiny onion slices. I didn't even get to eat it because when I went to inquire about it, it was on a plate though I had asked for it to go. The woman at the counter noted that it was meant to be to go and then I watched her pick up the sandwich with her bare hands and package it to go. I was speechless. I just left and threw it away. :'("
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJa2ZfUzd3RRAB",
            "text": "I enjoyed my Turkey Club sandwich but GOOD GOLLY this economy is hitting me hard. The sandwich is $12.5 and I DID elect to pay an additional $3.50 for an additional egg, so should be 2 eggs total because hey momma needs that protein.\n\nSo when I got this square sandwich that cost me $21 including tax and tip I’m just like.. what in the world is going on??\n\nI had to double check that I did in fact get the 2 eggs, it just wasn’t as fluffy as I was expecting. Server seemed super annoyed I even asked lol but hey this cost me an additional $3.5 are you sure? He didn’t like that. Oh well.\n\nAlso, 0.85 for a “delivery fee” and when I asked what that was about, he said it was actually a credit card fee.. and I’m like ok well … what. you know the feeling.\n\nService was good, I like the food.\nGraffiti benches and overall wood/brick feel is nice. I learned PLG stands for Peace Love and Gratitude"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcl9UVV9BRRAB",
            "text": "The customer service is definitely not good, that 2 feet tall Spanish lady needs to do something else in that place, not customer service… not a place i would recommend to my worst enemy… why do people open businesses when they have no customer skills…\none of the WORST place i ordered food.. NEVER AGAIN"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJemYtNkp3EAE",
            "text": "Great place to work from. Their turmeric latte is very nice."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3enZ1ZmtRRRAB",
            "text": "Warm and friendly shop with vegan cream cheese options, I’m glad they have the community fridge as well, an important way to give back to the community. Their coffee is inconsistent, sometimes it’s good sometimes not but we all have these days."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aElIMkR3EAE",
            "text": "Delivery takes a very long time relative to other places in the neighborhood.  I live two blocks away & food is late & cold.  Probably best to eat there."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMk43OFhREAE",
            "text": "Great vibes, good food and coffee."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMks2Nll3EAE",
            "text": "A great spot in the neighborhood! I love to come to PLG to enjoy a really excellent bacon egg and cheese, a good cappuccino, and a really exceptional community. The employees are beyond friendly and I’ve met tons of cool new people around the shop. This and Miss Barbs are absolute neighborhood staples."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMkl6dTVRRRAB",
            "text": "Easily some of the worst customer service I’ve received at a coffee shop. Not only was the cashier rude, my husband and I ordered our sandwiches to go, waited close to 30 minutes, only to find out from someone else that worked in the kitchen that our sandwiches had been ready long ago. The matcha isn’t great either. 😵‍💫 I usually don’t leave places negative reviews but I couldn’t let this one slide."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOGFQV1pREAE",
            "text": "This place rocks!\nHowever, I COMPLETELY agree with a previous review about bits of foil getting into the burritos after they cut it in half! PLEASE STOP WE ARE BEGGING. I know y’all have parchment paper back there!\nAlso, the last time I went they replaced the traditional crinkle chips with bagged lays chips (a travesty).\nOther than that, great establishment."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMk1ieGNnEAE",
            "text": "Dude taking our order hardly looked up from his phone"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdklDY3RBRRAB",
            "text": "The staff was friendly. The coffee was delicious. The bacon, egg, and cheese on a biscuit hit the spot. The entire dining experience was casual and good. Perfect spot to grab a bite and enjoy your morning coffee."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfak02Ymt3RRAB",
            "text": "Wonderful kind people serving delicious food and coffee!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNU9XaDN3RRAB",
            "text": "Nice place to hang out with good coffee and a great BLT"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbDh2eVV3EAE",
            "text": "The menu at PLG is accessible by watching a huge TV screen that cycles s-l-o-w-l-y through their offerings, or by scanning a qr code off the TV, then scrolling on your phone. There is no printed menu of any kind and no chalkboard. Not my favorite set up, but the person behind the counter noted that he doesn't want to \"waste paper\" by providing menus. I guess he is the owner or manager. I resisted the urge to ask if he's ever heard of a menu board. (Simple! Effective! Cheaper than a 75\" TV!)\n\nI ordered a tuna melt with a side salad for lunch, paid approximately $20 plus tip, then sat down. I must say I was shocked at what I received. The salad was fine, with fresh ingredients, nothing special. But the \"tuna melt\" wasn't hot, didn't have any cheese on it, and was about four inches long and two inches wide. I mean, miniscule. It was like a baby sandwich or something. When I bit into it, I encountered a rather hard crust around some tuna salad, and several rock-hard lumps of avocado, which I could not eat. I put them aside. The rest of the sandwich I ate in two bites, since it was such a little thing. I brought the plate up front with the avocado pebbles, to let the staff know that their avocadoes wouldn't be ripe for a week, if ever, and they probably shouldn't hide them in sandwiches where they might cause unsuspecting customers to need dental work.\n\nAnyway, at that point I noticed that almost no one else in there was eating; they were all nursing coffees while on their laptops. This is a lesson for next time. I'll get my lunch elsewhere."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dC1hLW1BRRAB",
            "text": "The service here is so incredibly slow. Be prepared to wait 15+ minutes for a coffee or 45 for a sandwich. Love supporting a neighborhood place but the staff do not care about helping customers at all. Go to another local establishment instead."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUa19DalpREAE",
            "text": "Everything I’ve had here has been great but don’t stop here if you have anywhere to be in any amount of time. They are SLOW the point where you may as well make your own food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcnJyMGx3RRAB",
            "text": "Place is trendy and my cappuccino was amazing BUT the bread on my turkey/avocado sandwich was brick hard. No water bottles, and the water provided from a dispenser has bits of who knows what in it. My daughter’s bagel was not good either. Overall I’d say this is more of a spot you pick up some coffee and should not be your go to for breakfast as a tourist of NY."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQLXBldWRBEAE",
            "text": "Food is good, ginger cashier is beyond slow at taking orders."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdjlLSmlBRRAB",
            "text": "Good vibe good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzLU9yeFlnEAE",
            "text": "nice people but they took almost 20 minutes to make a blt sandwich with eggs which costed $15, it has no flavor and is cold. they also forgot my friend’s smoothie although there was no line and did not seem very busy. overpriced and not good quality. i would suggest going somewhere else for brunch on a saturday."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuLVotOUdBEAE",
            "text": "Food is mid and over priced"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOXFDQVR3EAE",
            "text": "Ordered a twelve dollar tuna melt which had about as much avocado as tuna salad by volume, and was primarily just bread. If you are looking for a place to buy the cheapest coffee and sit somewhere with a bathroom and a nice view this place is reasonable, but I would avoid ordering food, which does not seem to be their primary area of focus despite the extensive menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuc191aldREAE",
            "text": "We got two sandwiches and had to wait over a half hour for them. She warned us it would take 20 min but it was well over that for this chinzy little biscuit with no eggs on it. It was supposed to be a turkey cheese croissant with eggs but they were out of croissants. So it was a biscuit and we had to pay extra for the eggs which were not on the sandwich!  It was $10.50 before tax for this tiny thing. The eggs were extra and we didn’t get any eggs. We got it to go so didn’t see it until we got home. It’s a real bummer. My mocha did taste good but there are a ton of other coffee shops I can go to instead that aren’t going to cheat me. It was $40 with tip altogether for two mochas a breakfast ‘sandwich’ and mediocre wrap, expensive for the area. Inflation is killling me!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaFk2MG1BRRAB",
            "text": "Their food prep area seemed like a simple assembly station, but their eggs were freshly scrambled and quite tasty. However, they use foil to wrap so after they cut the burrito in half, bits of foil gets included in your food so had to watch out the first few bites.\n\nChai was from a box mix and tasted watery/weak. Also got a Cortado, which was strong! They were busy on a Saturday morning...good thing, lots of local patrons. The counter service person was fast and efficient at handling all customersand making drinks. Kudos to him!\n\nNice outdoor seating area. The also hosted a neighborhood fridge for food drop off to share as well. What a wonderful gesture!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeDR6LVR3EAE",
            "text": "I have been living in the area for 15 years, and I have been client of PLG Coffee House and Tavern since they opened. In past, cafe used to have beer on tap. Anyways, that was in past.\nFood was always consistently great, since the day cafe was open. In my opinion, sandwiches still are one of the best in the area.\nBut service, only so-so. During my last two visits to establishment, in both occasions I left unhappy. Two weeks prior my last visit, we had lunch in the cafe. As I understood, counter person stepped out and kitchen crew were filling in. Because person who serviced us at the counter couldn't figure out how to apply rewards to my order. I let it slide at that time. Same person prepared our sandwiches and send it out, one by one. Why entire order was not prepared and send it out at the same time, it's mystery to me. I had coffee which I think is good, and my guest wanted to have decaf tea. Problem was that person serving us was clueless which tea in their selection (which is decent), were decaf. That we had to figure out ourselves.\nOn second occasion, I made take out order over the phone. I tried use their mobile app, but that thing been not functional for some time. When I got to cafe to pick up my order, food already was prepared. We got The Club sandwich, The Farm System, I also added two plain croissants( for next days breakfast) and two pieces of Lemon loaf.\nThis time again, person at the counter couldn't figure out how to apply rewards. After I told him that I have some rewards on my account, and I would like to redeem it, he ensured  me that it will be applied at the end when payment will be processed. It didn't happen. When I got home and checked the receipt, no redeemed awards were showing.\nWhy PLG Coffee House running their rewards program, if no-one trains the staff how properly apply it to costumer's orders? And like I mention before, mobile app is not functioning at all.  For some people this may be minor issue. But in my opinion: either you doing good, or don't do it at all.\nNow about food. As I mention before, sandwiches are still one of my favorites in the area.  Croissants were good as well. Lemon Loaf was old and dry. Definitely not that day's baked batch. And if you charging $4.50 for relatively small piece, at least have decency to sell ONLY freshly baked. I didn't get any beverage on my last visit. But I think their coffee is good and teas are delicious. On both occasions we visit cafe around 3pm.\nThat said, I don't think I'm going there any time soon. Luckily, there is more cafes and sandwich shops opens in the area. I probably will explore some new ones, before I order from this business again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiak5IRXRnRRAB",
            "text": "I honestly can’t believe they thought this was ok…. Usually like this place is decent (yummy even!)  but the audacity to send a not fresh tuna sandwich is outrageous. The Relay service delivered quickly after pick up in a cooler so it wasn’t the heat… be careful ordering here! Used to like it!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKZ0t1V2JREAE",
            "text": "This was our favorite coffee shop when we stayed nearby on vacation for a week and a half. The coffee is great, I ordered mainly iced Americanos in the morning, and the price is fair.\nThe indoors of the shop has a pleasant ambiance and is air conditioned; however, the seating indoors is extremely limited and very cramped. The outdoor seating is convenient and nice, but in the late morning the streets get busy and outdoor seating is not well insulated against noise or pedestrian traffic. Extremely convenient if you're on the go, not the best for longer meals out.\nWe also ordered the bagels when we went, bacon egg and cheese. Very good breakfast bagels for the price."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyM3ZiaUVnEAE",
            "text": "The best coffeehouse in this area by far 🤩 but it will be noted ; if you order the food as the menu suggests it tends to come out right. If you need a simple “no cheese” they will likely mess it up. NOW; they fix every order. But it may take up to 45 to get your food. But the staff is always friendly. ALWAYS! And care to fix the problem. They’ve got a few POS systems that don’t talk to each other well but why I emphasis that this community favorite cares and gets it right. If you’re in a rush sometimes it’s gonna be a struggle but welcome to nyc. The fact I’ve always been treated with respect and understanding and they show that to every customer says a lot. They have the best black coffee in this area and the some of the best service. Come hang out and see how they also support the community with the community fridge. Coolest spot 😎 ☕️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcEl6UzhRRRAB",
            "text": "Consistently good drinks but there were a bunch of egg shells in my burrito the most recent time I ordered food. One crunch is tolerable. Three is a lot. And one of the shells was half an inch large. Bruh....... 🧐\n\nI will be back for beverages and simple sandwiches only."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiM05Qa0pREAE",
            "text": "I love the coffee here, and the food is also very nice. But one thing I cannot accept is the prices. I know it’s NYC and all, but damn. You have to be ready to pay $25-30 for just a sandwich and coffee. The employees are usually friendly and polite, but sometimes they seem indifferent to customers’ needs."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlajRHTXJRRRAB",
            "text": "I am not a delivery driver. But the owner of this establishment decided to assume I was—based on the color of my skin—after seeing my photo in my review. This place is atrocious and a downright health hazard. The air quality is extremely poor. I have included pictures as evidence. The NYC DOH should investigate the cleanliness and hygiene of this place.\n\nI hate giving elaborate bad reviews because running a food establishment is a very hard job, and bad reviews can be crippling. My primary reason for leaving a single star originally was that, as the only person in the coffee shop, it took them 20 minutes to fulfill my order for a simple bagel and coffee. So, I initially left a single-star review without any words.\n\nBut the owner, who, in addition to being incompetent in running a food establishment, is also a textbook bigot. My review is public, so it would take five seconds to Google me and see that I am not a delivery driver. And even if I were, the audacity of this owner to assume I would be so stupid as to not know the correct party to review is mind-boggling.\n\nIt appears that the peace signs and LGBTQIA paraphernalia on the storefront are merely avenues of virtue signaling to pander to progressive clientele in Brooklyn, while the true foundations of this establishment are rooted in general incompetence and blatant racism. If this were the only place left in the world for sustenance, I would gladly starve to death.\n\n(I suspect the owner will edit their comment after seeing my edit, so I am including the original comment I received in response to my single-star, no-comment review. For good measure, I am also including the pictures that demonstrate the abysmal air quality of this establishment.)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bnFpTmh3RRAB",
            "text": "It's the ambiance that makes this place for sure. It's super cute and comfy and makes you feel as if you're at home. The outdoor seating is really nice too. It's usually pretty crowded inside in particular so be prepared. We've been here dozens of times and it's mostly that it's so close that we keep going. The Ruben is amazing. It's a great sandwhich spot and if you wanna go work on your laptop but not in Starbucks. It's coffee is decent it's juices are really yummy. The quality of the sandwiches and the portion sizes could be better. There isn't a bathroom though."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNy1EdFRBEAE",
            "text": "We live in the neighborhood and were excited to try this place for breakfast.\n\nWe ordered a firecracker burrito ($10) and a Greek salad ($14). Unfortunately the food took about 40 minutes to arrive, and my burrito was served cold for some reason, including the egg and the cheese inside. The server called the greek salad a veggie bowl, but we waited too long and were in a hurry to take the time to flag any of this down. The salad was not worth the price, and the burrito was disgusting.\n\nWe also ordered a coffee to go, and it was $6.50 for a medium size. That’s Starbucks prices… in this neighborhood. Yeah no.\n\nWe won’t come back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHZ2NQNzJnRRAB",
            "text": "Food was good. Place was quaint however don’t let your kids play with filthy toys in the corner. Wait time (for a bagel and a biscuit) was unacceptable.\nService could not be worse. The attitude behind the service made me feel invisible. I was ignored as they texted and had a great time with each other instead of acknowledging and helping  the customers in front of them.\nThe entire experience calls for zero stars based on the attitude and behavior. However even though my bagel lacked promised capers, my wife loved her biscuit.\nChai latte was good too.\nWill not return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MFBfeXp3RRAB",
            "text": "Very cute and cozy local spot for coffee and breakfast. Always a nice atmosphere and friendly staff. The food is good and clean. Simple and delicious. Mostly, they are consistent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtenQ2dzFBRRAB",
            "text": "5-star review for the croissant breakfast sandwich. The croissant was perfectly toasted, buttery, crispy, and golden delicious. I ordered it with three eggs, bacon, and avocado and it might be the best breakfast sandwich I’ve ever eaten.…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NkxleGZBEAE",
            "text": "Update: went again food was cold. Like you can’t serve people cold eggs and bacon. Went before the rush and it’s like what can they even do to remedy the situation if the food comes out cold when it’s slow. What to expect when busy.\n\nFood!? Amazing!!! Firecracker…slaps, Petite Belgian waffle…light crispy airy and soft in the middle nice and sweet!!! Cold brew, dog water. But she’s a dog woof!! But nah it was overly bitter, tasted like the beans were old."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbmJPQzhnRRAB",
            "text": "Cozy and Artsy cafe with gluten-free options. Coffee was made to perfection and service was super attentive. The barista/cashier M -like the letter- was rocking front of the house service with grace. Thank you M!!! Loved the Punk/ska…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIODdEZFNREAE",
            "text": "Grabbed a cappuccino from this cafe. It’s pretty decent. A little burnt but the ambiance is very cheerful here."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHX05HMENnEAE",
            "text": "The kids corner is a source of infection. Dirty and disgusting. I get that the place is not kids oriented but at least remove the toys from that crowded corner.…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3MnViaU53EAE",
            "text": "The food is so fresh and delicious. Their menu is creative. The atmosphere is inviting. Great little sidewalk eating area. Having draft beer is a bonus. The owners are always there and are super friendly! This is the way a business should be run!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdVpqV3lnRRAB",
            "text": "great atmosphere, lovely service, & some of the best egg sandwiches I’ve ever had :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiN3JQX1lREAE",
            "text": "As a transplant this was a great place for me to settle into while easing into NYC living. I loved this place because it’s so close to my house. Unfortunately there’s been a few occasions where the food was old, moldy, and not up to par. Also the price increase wasn’t my favorite but not much I can do there. My real complaint comes about the atmosphere. I loved being here to work in a calm, cool environment. However, after 12pm there’s loud trap and hip-hop music, making it extremely hard to keep up the productivity that you walked in with. I see so many customers walk out what was once a thriving environment. Don’t get me wrong, the morning crew also plays a bit of hiphop, but it’s cleaner lyrics, lower volume, and doesn’t sound like drill music. I hate I can’t be a reoccurring customer here, truly disappointing."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvOXUzeUl3EAE",
            "text": "WiFi is strong and coffee is stronger. Small coffee shop with a wide range of caffeinated beverages, typical café breakfast options, and a decent sandwich selection for lunch (option to change them into salads. They get pretty annoyed if…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NWYtOUpnEAE",
            "text": "I visited PLG while spending time with my family in Brooklyn, and it was a pleasant experience all around. I ordered the turkey avocado sandwich, which was absolutely delightful—fresh, flavorful, and satisfying. The staff was super friendly and helpful, making the visit even more enjoyable. I also tried the Green Machine smoothie, which was really good and refreshing. Overall, a great spot to grab a bite and relax. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNXQzM05REAE",
            "text": "How cute is this Bijoux Cafe on Rogers AVE... Great service with a smile yesterday and again today... Jomar took our large order and helped with suggestions... Pastries and Coffee ready great and served fresh... We'll be back ..✌🏾...OH and great background music... 🙌🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eHIyTXVBRRAB",
            "text": "Brought my son here for a quick mommy and me lunch. The Turkey avocado was really good. It came with those wavy chips , a crispy pickle, and I also purchased a drink on the side for the both of us. They have a large selection of Natalie’s juices. My son enjoyed the strawberry lemonade. Will definitely visit again."
        }
    ],
    "reviews_count": 73
}