{
    "name": "The Bobbed Bandit",
    "place_id": "ChIJbcngekZbwokRB8M2r3woRcs",
    "grid": "BK9",
    "address": "429 Rogers Ave, Brooklyn, NY 11225, USA",
    "rating": 4.7,
    "user_ratings_total": 140,
    "phone_number": "(347) 240-0774",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNVZqVXpOV0poWWtZeWJGVXhhRlJ1T1VSS1VsRRAB",
            "text": "INSANE BURGER- the patty is extremely juicy and the buns are fluffy. The fries are super crispy and well seasoned too!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdFNuZEhhVzVQYkdOd1l6QXRjVmxIWVZCR1pXYxAB",
            "text": "Today was the 2nd time in a few months i went here with thr same group of friends previously. Service was great and the Tall Accomplice was the drink of the evening! However the food could've been better. Though very tasty, the bottom part of the bun of the cheeseburger was very soggy, the hush puppies were super bland and the kale salad was mostly kale."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdE5tTlViRTlhUm05UVJraE1VMTl5WTBoMVozYxAB",
            "text": "I have been here a few times for brunch. The food and drinks were really good. Servers are friendly but always seem a bit overwhelmed. That is ok . My biggest problem is it takes way too long to get the food. Ready to wait 30 mins - 1 hour even when the restaurant is not full."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMlRWRkhaV1F5WlZWU1pWZFJiM05KU2tGSllsRRAB",
            "text": "Customer service is always excellent here and go to spot for a quick and light expresso martini!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oek1WbHNSVTlPU1hSVWFDMXNWblp1VkdSRlRVRRAB",
            "text": "Such a cozy neighborhood vibe. Excellent cocktails (I promise I’ve tried almost all) and the owner is here waiting tables regularly. Their burger is top tier!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJa2NQNm5nRRAB",
            "text": "Love this neighborhood spot. Their drinks are well-made and their dishes are delectable. If you want a burger or chicken and waffles dish done right, come here. I recommend everything here. 08/2025 Update: Also, they have the best fish and chips I've had in my life."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NmExcHdVVFZTYzBVd1JXNXRhVEYwY0ZOaGJIYxAB",
            "text": "We have been coming to Bobbed Bandit since it opened and have always loved the environment and food.\n\nUnfortunately we’ve had several experiences back to back recently where the food took over 40 minutes to come out and will likely not return due to this fact."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcE1XaHdNMGhvWTJSRE9IWjFSVEY1WVV4ME9HYxAB",
            "text": "The Bobbed Bandit is a really cool spot in Brooklyn—the decor is stylish, the vibe is fun, and it definitely draws you in. Unfortunately, the food didn’t match the atmosphere.\n\nThe mac and cheese was surprisingly bland, lacking any real depth of flavor. Overall, our dishes felt under-seasoned and forgettable, especially when compared to the many incredible eateries in the area. Even the cocktails, while well-presented, didn’t offer anything that set them apart.\n\nThe Bobbed Bandit has a lot of potential, but right now it feels more like a place to be seen than a place to eat."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaFRsQkdVRkowUlZoelVrWjVWbk5aWnpKQlJGRRAB",
            "text": "Lil pricey  but all round good atmosphere 👌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRll6ZDNNbGxyWjBabGVURjNZV0kyU2pWMFluYxAB",
            "text": "Good outdoor seating"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdFgwaDNiVVEzWW5sa1pVaDFUbDkwVkMxNFdXYxAB",
            "text": "We went on a Sunday evening and it was pretty quiet. Our order was taken soon after we arrived and it was a short wait for the food. Drinks were on point and the food was so good!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVlgwRTRSVWhWVkdJdFgyOWlaa3BYUjJWQmFtYxAB",
            "text": "I met a friend here, but when I arrived, she said she had been sitting for 15 minutes with no one offering help—so we left. I may return on my own, and if I have a better experience, I’ll update this review accordingly.\n\nUpdate 6/18 … as I said I would, I came back on my own to give this place another try, OMG five stars all the way. I sat up at the bar. the bartender she could not have been more sweet.  great energy super friendly absolutely loved her. She recommended the burger and honestly one of the best burgers I’ve ever had great atmosphere. I’ll definitely be back here. I’m glad I came back!!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqaXNLd1lBEAE",
            "text": "The Bobbed Bandit was a real life bandit, who was pregnant and who robbed this very spot where the bar now stands (when it was a pharmacy back a hundred years ago.  Amazing! And so is this bar/ restaurant, fun, friendly, neighborhood spot. Very reliable and full of great people. So grateful to have this place on my corner. Also it’s also the only Edmonton Oilers Bar in NYC. Stanley Cup Finals are on and this is a great place to watch ! ❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMT3l1S2V1aFBIRE1BEAE",
            "text": "Kristin is an amazing bartender! High quality food and drinks, and love the ambiance."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNUEJvdGJuZ2MzNTdRRRAB",
            "text": "Great food and drink options. Service was a bit slow but, our waiter was excellent."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dko3c3RRRRAB",
            "text": "3.5 ⭐️\nA dimly lit cozy spot that was great for a group of 4 on a Sunday evening.  Server was nice and friendly, I just think we overall were looking for a more…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRaktxT1lBEAE",
            "text": "Nice people, beautiful foods in a gorgeous yet seemingly simple room.\nA true neighborhood gem!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMU15RlNREAE",
            "text": "Love everything about this place, delicious food, friendly staff and a cosy environment. We went for brunch and ordered the kimchi and eggs and the biscuits and gravy.\nGlad this spot is in our neighbourhood we’ll definitely be returning."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcnF6TXlnRRAB",
            "text": "Shouting out Kay the bartender and the server whose name I did not get but worked the same shift tonight. Immaculate service, very kind folks who truly put in the work to ensure we had a great time tonight. The burger and chicken sandwich was delicious; I even got a cheese pull from the burger!\n\nFirst time customer and will definitely return."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOTRyQjhBRRAB",
            "text": "Great food very nice people slow service but would totally come back here"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOTRDMVN3EAE",
            "text": "The Bobbed Bandit was a pleasant surprise. My wife suggested we go because of the burgers. I’m not big on burgers so to me it’s no big deal but then ……. That pull pork sandwich was so good we needed an extra to go. The drinks were just as amazing. The owner and host were friendly and attentive. I love this place, the vibes were just right. It's definitely a place that I will be visiting often."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmd3VqWTV3RRAB",
            "text": "Cutest ambiance and such a good meal and great, flavorful cocktails! We had the burger and the seitan sandwich made vegan (highly recommend)!! Brussels were awesome!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmblphczBnRRAB",
            "text": "Really cute spot. Incredible burger. Hard to get waiters attention. Service not the best but would go back for the food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ajVYZ1hREAE",
            "text": "The food, the drinks, the staff, the owner. All incredible. I could eat their burger every day for the rest of my life, and the cocktails are perfect, too. Love this place!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ODVXXzVBRRAB",
            "text": "The burger and fries were great, drinks were okay but the service was lacking and they made the absolute worst “apple pie” I’ve ever had to date. I literally took one bite and couldn’t go any further because somehow it was bitter, despite being drenched in chocolate sauce?. The waitress completely ignoring it and not even asking if I wanted it to go signaled to me that it was in fact, not their best menu item. Overall, the atmosphere gave that if you’re not a regular here, you probably won’t enjoy it enough to return."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNmRtdXdBRRAB",
            "text": "Compre un bacon egg and cheese muy rico"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzXy1tY1dnEAE",
            "text": "The server was extremely rude and unhelpful. I was speaking to the server & he just walked away to start a personal conversation. When I mentioned I was interested in a particular drink, he mentioned that they discontinue items from one month to the other. When I asked for a suggestion he’s wasn’t helpful & was like there’s the menu. The server was extremely rude when I asked the status of the food order & he’s like “food takes time” as if I didn’t know this but not 30 minutes for a soup & fries in an empty resturant. The food took forever to come out, the soup was cold, the bread was hard & cold and the cheese barely melted. The pull pork sandwich was ok, but the fries were dismal and not existent. This was my first & will be my last time here."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzXzQzVXRnRRAB",
            "text": "I came to this restaurant on a whim this weekend and was shocked by how quaint, charming, and calm the environment was. Our server, Connor was so kind and he made sure that we were taken care of from the second we walked in to the end of the meal. I’ll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYM3NlUWdBRRAB",
            "text": "got brunch here and loved it. we got the kimchi eggs and biscuits and gravy. they were both very good though the gravy was a bit salty for my taste. overall, the meal was great and pretty affordable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYa3FuUWV3EAE",
            "text": "Food is great, drinks are great, people are great, you couldn't ask for anything more! Very fun but laidback neighborhood spot with fun and clever drinks, plus the standard things you'd expect. Outdoor seating when it's nice out. Staff are super friendly and fun. Stop reading this and just go already!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYb0ltZzB3RRAB",
            "text": "Came here for brunch while visiting family in New York and I’m very jealous I wasn’t staying in New York longer because I would love to visit for dinner. Great place with great food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdDg2Tkp3EAE",
            "text": "Friendly staff and delicious food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcUlDMk5nEAE",
            "text": "I love this restaurant. They switched up the brunch menu so today I got to try something new - fried egg sandwich with kimchi and Swiss cheese on sourdough. The dinner menu is also great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNF96VXZ3RRAB",
            "text": "Great chill spot to grab a drink, watch the game.  Quick, fast, and friendly service and welcoming locals."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bHZMbXdnRRAB",
            "text": "The food and service was okay, however the drinks were expensive and watered down, so I wouldn't reccommend getting their drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicC02dDhnRRAB",
            "text": "The burger and cocktails were delicious! Bingo night was super fun! I highly recommend The Bobbed Bandit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicTZPS2NnEAE",
            "text": "Foods great, service great! Friendly funny staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib1BUUE9BEAE",
            "text": "The Bobbed Bandit was a delightful surprise. The owner and host were friendly, attentive, informative, and gracious. We enjoyed our time with great food and drinks. The steak (have medium as our host suggested, you can't miss), fries (crispy), and the salad were excellent. Even the burger was savory, and it's a double patty (not necessarily needed, but definitely appreciated). Drinks were ever so delightful. It's definitely a place to frequent with good vibes, food, and drinks you will enjoy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNTkyQ1ZBEAE",
            "text": "Great new neighborhood spot. We went to check it out mostly for the burger and it did not disappoint!! 10/10 would recommend; no notes. I truly did not expect both patties to be as thick as they were. Both were equally as juicy and the cheese perfectly melted.\n\nWe also got the hush puppies which were pretty good also. The star of that dish was the honey mustard dipping sauce that came with it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqelpuRFhnEAE",
            "text": "Bar with amazing brunch and nice staff. I enjoy sitting at the beautiful (clean) bar with a Guinness and a book."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6b0t5Zk1REAE",
            "text": "I came here on a trip to NYC and was absolutely blown away by the bar staff particularly! Sil was my bartender for the night and made sure that each of my drinks was expertly crafted to meet my needs. I cannot rave about them enough. They were incredibly attentive, friendly and warm. Highlight of my trip!!\n\nThe food was such a let down; overtly salty and left a lot to be desired which is why I’m rating it 4 stars. Come for the drinks and eat elsewhere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NEs2TFN3EAE",
            "text": "Great food, cocktails, and beer selection.  Friendly staff and cool atmosphere.  Neighborhood gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NU9yX3NBRRAB",
            "text": "The Bobbed Bandit is legit awesome.  Brunch 12-4pm Sat & Sun.  Dinner 5-11pm Wed-Sun.  Family friendly; something for everyone.  Corner of Lefferts and Rogers.  Delicious food & drink, terrific service, and gorgeous interiors.  Love the mix of bar seating and upholstered booths AND outdoor seating on a large patio.\n\nEverything was 💯 delicious and reasonably priced, from the tender pineapple and soy-marinated skirt steak (home run for both our kid and us) and flavorful burger to the crispy home fries, chicken & waffles, and kale salad.  Pineapple juice for the kiddos (they’ve also got orange and cranberry), coffee & espresso, and cocktails.  The espresso martini and tropical pineapple concoction with chili salt (Grant’s Rx) hit the spot.\n\nRun, don’t walk!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0Nl9IOS13RRAB",
            "text": "The Bobbed Bandit is exceptional. The must try food items are the burger and the apple pie, but honestly you can’t go wrong with anything on their menu. The bartender Sil will craft you cocktails that are dangerously delicious. The vibe and atmosphere is casually intimate, from the decor to the playlist this is the perfect everything bar. A nice date, a dinner with friends, a birthday party, watching the game. You name it; you’re going to have a good time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0bThpeV9BRRAB",
            "text": "One of the best burgers I’ve had in NYC. I also had a French onion soup and split the hushpuppies, wings and apple pies. All delicious. Sil was an incredibly friendly and attentive bartender and every cocktail made was amazing: Flatbush Ladrone, Espresso Martini and sips of the Sting and Celia 🤌🏼. The playlist featured r&b and laid back alternative rock that fit the aesthetic and low lighting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxN1BhV1BnEAE",
            "text": "I recently had the pleasure of visiting a cozy rustic bar with a small but delightful menu, and I must say, the experience was fantastic! The highlight of the evening was undoubtedly the burger - an absolute masterpiece of flavor and juiciness.\n\nHowever, it wasn't just the food that made this place special; the staff added an extra touch of warmth and hospitality. One bartender, Sil, stood out in particular. Sil's friendly and attentive nature created a welcoming atmosphere that made me feel right at home. Their knowledge of the menu and willingness to offer recommendations added to the overall exceptional service.\n\nIf you're looking for a charming spot with mouthwatering food and outstanding hospitality, this rustic bar is the place to be. Don't forget to say hello to Sil, the bartender who will make your experience even more memorable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMExYQ1dnEAE",
            "text": "Listen Up! You have been dreaming of a Cute, Delicious , Hyper local, WateringHole-meets Bistro for years now and that time has come.\n\nThe staff is groovier than midnight at Soho house, the vibes give new American Gothic meets your favorite fun aunties speakeasy parlor room and the food is going to be a destination for the Neiborhood! Best Burger in the Neiborhood, reasonably priced cocktails good beer selection\n\nlets go again next week!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMi1qVnVnRRAB",
            "text": "I was in the area and bumped into this super chill spot. First, it is super dim so perfect for date night. Second, the drinks were flawless!  Third, Sil the bartender was beyond on point with the service.\n\nThe burger and garlic fries are to die for. Two patties perfectly seasoned. Sometimes garlic fries can be too garlicky, but these were perfect! Next time I definitely have to try the brussels sprouts!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdmRlXzhnRRAB",
            "text": "☕🍸🥃 Bobbed Bandit: Where Espresso Martinis and Old Fashioneds Reign Supreme! 🥃🍸☕\n\nTucked away like a hidden treasure off Lefferts Ave, there's a speakeasy that's the talk of the town – Bobbed Bandit. With a name that conjures images of clandestine rendezvous and daring escapades, this cozy joint is a haven for cocktail connoisseurs and merry mischief-makers alike.\n\nStep inside, and you're transported to a bygone era of glamour and intrigue. The ambiance is intimate, the lighting just right, and the cocktails? Oh, the cocktails – they're nothing short of legendary.\n\nFirst up, the Espresso Martinis – a symphony of caffeine and spirits that'll wake up your senses and set your soul on fire. Each sip is like a jolt of energy wrapped in velvet, a perfect balance of bitter and sweet that'll have you buzzing with delight.\n\nBut let's not forget the Old Fashioneds – a timeless classic that's been perfected to a tee at Bobbed Bandit. Made with expert precision and a dash of mystery, these libations are a testament to the art of mixology. Sip slowly, and let the flavors unfold like a whispered secret.\n\nWhat sets Bobbed Bandit apart is its dedication to craftsmanship and quality. The bartenders here aren't just mixologists – they're maestros, weaving magic with every pour and stir. It's like watching a master painter at work, creating masterpieces in liquid form.\n\nSo, whether you're in the mood for a pick-me-up or a trip down memory lane, Bobbed Bandit has you covered. Raise a glass to good company, great cocktails, and the allure of the speakeasy – here's to Bobbed Bandit!\n\nCheers to caffeine, cocktails, and the thrill of the clandestine! 🍸☕🎩"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOVBLNVVnEAE",
            "text": "Great hospitality here with delicious drink and food menu. Atmosphere is cozy and warm. Much appreciated addition to the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dE9Ua1FBEAE",
            "text": "Went here for brunch today! I had been looking for a sit down breakfast spot, so I was excited when I saw they were offering brunch!\n\nWe got:\n\n-Irish coffee\n-eggs in paradise\n-the breakfast burger\n\nAnd they were all great! The Irish coffee was the perfect balance of sweet cream and coffee flavor, and I definitely felt a little buzz from it! My breakfast burger was also perfectly cooked.\n\nI would absolutely come back here. I would love if brunch started earlier and I would love to see French toast on the menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOUxMaVhREAE",
            "text": "Been here 3 times in two weeks. Such lovely staff and such delicious craft cocktails. Great neighbourhood add"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOE1DaW5BRRAB",
            "text": "I happened upon this chic bar during their opening week and it was amazing!!  The owners and bartenders were so welcoming and friendly and all greeted me with a big smile! The bartender was really knowledgeable and skilled at making every drink that my friends and I  asked of them. The restaurant/bar itself had such a warm atmosphere!  I really loved the look of the entire place, especially the booths!  The vibes that I felt immediately and throughout my visit made me feel like  I was a regular at The Bobbed Bandit for years! The drinks are delicious especially the innovative specialty drinks and the food is SO GOOD! I’ve been raving about the burger to all of my friends! I can’t wait to try everything on the menu but have a feeling that the burger will be my go to meal! If you’re looking for a great place to grab a quick bite /drink, a place to meet up with some friends, or a fun date night spot, this place is it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0a1Btc0VnEAE",
            "text": "This bar/restaurant has great drinks and delicious food. Try the burger or chicken wings or French onion soup, truly so good! Can’t wait to try the brunch menu next. This gem is female owned and has an amazing ambiance and aesthetic. Perfect for a date night, solo night out, or outing with a group of friends (there’s lots of seating)!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbzRlZEpnEAE",
            "text": "Really amazing local bar! Vibe is nice and relaxed but still feels upscale, food and drink menu is off the hook amazing! The bartenders are super friendly and always welcoming!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5M2FuZlZREAE",
            "text": "I love this little bar!  So beautifully decorated with an authentic feel of old Brooklyn, it has a very cozy, inviting atmosphere.  The food was incredible and out of the ordinary for what you would expect from a pub. The staff were very nice and made us feel very welcome.  I look forward to going back the next time I am in town."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MTVPYlRBEAE",
            "text": "I was really excited to see a new restaurant come into the neighborhood. Having my first brunch today I feel a bit disappointed. The chicken and waffles were unconventional but not in a satisfying way. The chicken color was dark, almost like it was burned in the fryer and the taste was a mixture of something sweet, lemony and kind of strange burnt / bitter taste. No syrup on the waffle and it was a bit muddy or dressed with the burned sauce. I can’t really place it but it wasn’t something I would come back for. Hoping the other dishes are better as I want this place to stay. Coffee is drip which is fine but I think ours was on the burner too long as that tasted old and burnt as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbDgzdnNBRRAB",
            "text": "I absolutely love this new addition to the neighborhood! It’s my new favorite spot. I came here to celebrate my birthday and SIL and Forrest took such wonderful care of us! They really made my day extra special!\n\nSil is truly a standout bartender. Not only are they extremely knowledgeable but they make you feel so welcome and at home. I’ve been there a few times when I wasn’t sure what I wanted and each time they came up with a fantastic cocktail! This truly is my new home away from home!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOLXZ2YWZREAE",
            "text": "Stopped in here for a drink on a Tuesday and had to come back for brunch. Amazing drinks (don’t sleep on the Irish coffee—it rivals The Dead Rabbit’s) and food that was better than expected. Insane burger, perfectly cooked. Awesome home fries and really fresh salad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMEtESTlnRRAB",
            "text": "Cozy, chic bar with nice cocktails and tasty food. There's always a nice crowd hanging out and up for a chat, if you're in the mood. And the place is both queer-friendly and female-owned, which makes it an especially great addition to the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROZ3FEdFpnEAE",
            "text": "Oh man. So lucky this place opened! Food is amazing. The French onion soup was great. Cocktails were fantastic. The music was also incredible. The staff and service were the best parts though"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkeVplZTFBRRAB",
            "text": "Had the pleasure of eating brunch, here at the BobbedBandit the last few weekends and I have come to the realization that I am hooked. The atmosphere is relaxing, laid back, food is so good and the server who goes by \"T or Tay\" was funny, likable,  gave good conversation, offered food recommendations and was a great help. I like her alot. I also like that the place is female owned. Nicole, the owner is always very pleasant and welcoming. If your in the area, stop by and judge for yourself. I know you won't be disappointed."
        }
    ],
    "reviews_count": 62
}