{
    "name": "Camillo",
    "place_id": "ChIJxV-NUm5bwokRtHUmJiQYucw",
    "grid": "BK9",
    "address": "1146 Nostrand Ave, Brooklyn, NY 11225, USA",
    "rating": 4.6,
    "user_ratings_total": 774,
    "phone_number": "(718) 576-6886",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205M1lXd3pYMjF5TVhsMlZERXpTRFpaVkhOTU1XYxAB",
            "text": "Long story short about the score: The food was fine, but the bartender (that was also our server) didn’t have a great attitude.\n\nNow, details.\n\nThe Prosciutto and Pecorino was everything you need and more. The bread was super fresh and soft and the honeyed almonds were addictive.\n\nI got the Pappardelle oxtail and my friend got the Pollo Arrosto. Both were solid meals, but we added a pinch of salt to both, and I’m not mad about that, better to have the option to spice it up a bit.\n\nThe main issue with the host was that he had some not-so-friendly attitude throughout the night, but the straw that broke the camel’s back was that when it was time to pay, we asked to split the bill, and he threw a mini tantrum about how it would be so much easier for us to pay each other, and that they have to pay “more fees” for processing more transactions, and on top of that, he said that he was “wasting his time” by having to have each of us pay.\n\nI have been a server, and I understand that charging only one card is easier, of course, but it wasn’t like he was very busy; it was a quiet Tuesday night.\n\nI was happy to have tried this place after, but I’m not sure I would be coming back after this experience.\n\nBesides that, a final note was that the restaurant itself was very charming!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WV1JtRXdSVWRyWWpSU2RHVTROR2RsUWtsWGRuYxAB",
            "text": "We had a group dinner of 12 people on October 9. The food was amazing along with the service. We organized a family style menu ahead of time and it was perfect and everyone loved Camilo!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kblpVVTNWa05yUzI5bk4ydE9jR016YzA5ellrRRAB",
            "text": "My favorite Italian spot in the area. Make sure to order the Carciofi!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3Mzd1RDZnRRAB",
            "text": "Un magnífico restaurante italiano. Tuvimos una cena muy agradable. Comida de calidad en un ambiente tranquilo"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxamFuWlhhM2hLTTFscVpXZG9OM1V4VFZkdWRXYxAB",
            "text": "I love this restaurant! The people working there are very kind, the Negronis are incredible and the food is such an experience. You must visit this restaurant. My favorite choices are the Plum Negroni and the Oxtail pasta."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRFNWUmlPR04zTkVaVVVrZGFVMHc0VlhaYWJGRRAB",
            "text": "Pasta was fresh and delicious but I thought the sauce lacked depth and flavor."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeWFYVkJVSE5hVjBWV2RXRTJXbWd3TlVSS1JIYxAB",
            "text": "Stepping into Camillo, a cozy Italian eatery in the heart of Brooklyn, is a transportive experience. The ambiance, with its warm lighting and rustic decor, immediately sets the stage for a meal that promises both comfort and culinary sophistication. As a food connoisseur, I'm always on the hunt for a place that respects tradition while elevating ingredients, and Camillo delivers on all fronts.\nThe meal began with a moment of delightful indecision, faced with the restaurant's extensive selection of aperitifs and negronis. The sheer variety of negronis, from classic to house-infused, is a testament to the bar's dedication to this iconic Italian cocktail. I opted for a flight of Amaro, savoring the complex herbal and bitter notes before diving into the food.\nFor starters, we ordered the Arancini, a classic Sicilian street food that can be a benchmark of a kitchen's skill. The golden-fried spheres were perfectly crisp on the outside, giving way to a creamy interior of Arborio rice. Tucked inside was a rich, flavorful pork ragù and a molten core of mozzarella cheese. It was an impeccably executed dish—a true taste of home-cooked Italian goodness.\nThe Asparagi & Ricotta pinsa was the star of the show. Pinsa, a Roman-style flatbread, has a unique texture—light, airy, and with a crispness that holds up to its toppings. The pinsa was a canvas for a symphony of flavors. It was generously topped with roasted asparagus, their earthy sweetness enhanced by a sprinkle of salty Parmigiano. Cubes of crispy guanciale provided a savory, porky richness. A dollop of cool, fresh ricotta balanced the intensity of the other ingredients, adding a creamy, slightly tangy element. The true genius, however, was the truffle sauce—a deeply aromatic and complex concoction of truffles, porcini mushrooms, black olives, and a hint of anchovy. This sauce was a masterstroke, infusing the entire dish with a luxurious, earthy depth that lingered beautifully.\nNext, the Eggplant Parmigiana arrived, a comforting and robust dish. It was a beautiful example of how simplicity can be utterly delicious. The layers of tender eggplant were perfectly stewed with a rich, vibrant tomato sauce and blanketed in a generous layer of melted Parmigiano. Each forkful was a harmonious blend of sweet, tangy, and savory flavors, with the soft texture of the eggplant providing a satisfying mouthfeel.\nTo conclude, we indulged in the Tiramisu. This quintessential Italian dessert was a flawless rendition. The mascarpone cream was light yet rich, its subtle sweetness offset by the robust bitterness of the cocoa and espresso-soaked Italian ladyfingers. The layers were impeccably balanced, avoiding the common pitfall of being overly saturated. It was a perfect ending to a magnificent meal, leaving a lasting impression of authenticity and craftsmanship.\nCamillo is more than just a restaurant; it's a celebration of Italian cuisine's soul. From its thoughtful aperitif program to its flawlessly executed dishes, it's a destination for anyone who appreciates the art of good food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSa2RURnJSQzB5UkV4R05VaGZhekk0Y0MxWVJuYxAB",
            "text": "Nice neighborhood restaurant. Fast service. Faves were the fried artichokes, the asparagus pinsa, the cod, the parpadelleand the 🔥🔥🔥 tiramisu.\n\nDidn't care for the lasagna at all. Too much starch (pasta and peas) to filling ratio. Not interesting."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsamFVcDFjMUJRVWs5TVYySkVkM1pVWjJwU1lWRRAB",
            "text": "The atmosphere is beautiful and calming with a good selection of wine and friendly service! But the food wasn’t great on the night I went. I saw the reviews and was very excited to try it out but was ultimately disappointed. I ordered the oxtail pasta and didn’t enjoy it so I packed it to go and ordered another pasta just wasn’t any better. Nevertheless the restaurant is beautiful and has a really good aura to it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcFNHOWFNbkl4ZUdWblRreHBXVGx3ZDJ4QlkwRRAB",
            "text": "First time at Camillo. We loved the food. We had two waiters. One was delightful and the other was impatient and rude. He was condescending when asking us to distinguish between which type of Negroni we wanted, became impatient and walked  away after a brief moment of me asking my daughter(whose birthday we were celebrating) which app she wanted and overall seemed angry at us the entire night. I almost asked the other waiter if only she would wait on us. Would love to come back but would look in the window first to see if he was off that night."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWVVIQkVjekU1UlV4clMzbzBRbVZxYm5SVVRtYxAB",
            "text": "Been a few times, we really like their pizzas and pastas and the first round of drinks has come out really quickly every time! Only note is that the service noticeably backs off once the food arrives so there was a missed opportunity to put in more drink orders or order dessert since we're waiting to flag someone down to get the bill."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSVlXaFJWRmszTjA1bllYVjRPV05VVFVkdFRVRRAB",
            "text": "Great food, service and atmosphere!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sYWVsVnpkVUZGTVhGeU1Vc3pYMUp4TWxkS01IYxAB",
            "text": "Usually, I have lovely experiences at Camillo. Tonight, not so much. I entered the restaurant at open and there was one other party there. The restaurant completely empty outside of myself and the other table. I sat at a two seater but moved to a four seater to accommodate all of my bags and give me room for what I planned to order. One of the servers comes over & says that I am not allowed to sit there and that the table is reserved. I returned to the 2 seater and sat there for two hours. Not a single party came for the table. Nor did a party of 4 come in at all for the whole time I was there. Sad that something so minor couldn't be accommodated."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcmRHSnNOV1V0V0VaU01sQlNRbTlUUVVWUFJFRRAB",
            "text": "Camillo is a very bright spot in a neighborhood in transition and a solid Go-To for my wife and me. The pizza is greasy and they have GF crust available! The Tagliata (aka; sirloin steak) served with mashed potatoes and arugula salad, is the best in the wider area. Philipe, and his colleagues behind the bar, serve delicious cocktails and conversation and greet you by name when you walk through the door. I love this place and think you will too"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oemVrRXlRV1ppTW1Kd1dtTkNkVlJQUjI5SGVHYxAB",
            "text": "Went here for a nicely budgeted dinner. We didn't have a reservation but they had a table for us. We had the chicken pate appetizer,  the Coda alla Vaccinara and the Pollo Arrosto. All of it was good. Service was good. We'd go back. Great little neighborhood spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwQ1YwSTFla2RXVW1Oa2VrNVZOVWRVUWpsUFkzYxAB",
            "text": "The food is incredible as is the service.The best dining experience I’ve had in NYC!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VldGQnBXa2wxTmtvMGFFdzVWR1ZyV0hBeWVXYxAB",
            "text": "Ordered the oxtail antipasta and napoletana pizza, and I enjoyed it for the price. This is one of the best you can get for the price and quality. Would recommend for the great service and food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GT2REVTBMWEZrYVRKbmNVVlNPRWRDYlZWcE4wRRAB",
            "text": "Brilliant! Spent 3 wks in Rome last year. Camillo’s food equal to the best we had there. Not an “Italian” restaurant, a Roman one. Also service excellent. Get a reservation!"
        },
        {
            "date": "4달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMFFYUldVMncxYlZsVk9VOUJkVzFCT1VSMGMzYxAB",
            "text": "Perfetto!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTFMxOUdkbkpyYTFsWVNVOW9iV3R1WTJSQ1QyYxAB",
            "text": "A Negroni menu!? Sign me up.\n\nDo not skip the fried artichoke appetizer, I can’t stop thinking about it.\n\nAlso they have vegan cheese for the pizza"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKbnFnZWlXaWR6M0RREAE",
            "text": "Went here twice and the food was still great. The specialty drinks were the highlight for me. Staff was friendly and helpful. With various pizza and pasta option there is something for the Italian cuisine lover!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMT2Yxby03cllXeHRRRRAB",
            "text": "love the atmosphere and the spritz, alici burro is the best."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMXN6b0N3EAE",
            "text": "Very good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJN082c1p3EAE",
            "text": "Food is fine. But if you’re in a Black neighborhood and all your customers are white, you need to make an effort. Hire Black people, bring in a community music night, I don’t know what, but it is your responsibility to get creative. Otherwise it’s just a bit pathetic."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJelpfb3FRRRAB",
            "text": "Amazing pasta! Great unusual combinations of pastas and sauces. The gelato was extraordinary."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LXZyZzRRRRAB",
            "text": "The food was not great, but the staff and the service was amazing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3Z3FDTmNnEAE",
            "text": "Excellent food, friendly staff and cozy atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dFB1U0JnEAE",
            "text": "My favorite Roman pizza and I have take-out countless times before eating in. Reason is it’s so hard to get a reservation or a reservation with a table bit far away from the door.\nHowever the funghi on the flat thin Roman-style pizza sings to me whenever I need a good Italian pizza and it does not help, I live 15 mins walk away. The pepperoni pizza is a close 2nd and the Cacio E Pepe is one of the best I’ve had. Just have to eat it fast before the cheese hardens 🍬\nI forgot to mention the kale and chick peas soup is so hearty and warms up a belly on a cold day.\nDesserts are solid Italian favorites so any of them can’t go wrong to close up the meal.\nNote of caution, if you don’t want to smell like a smoked meat, make sure you come in through the south of Nostrand. I do love me some jerky but that smoke is not something I want on me for the entire night."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYak1MSnp3RRAB",
            "text": "Love the new menu! Always a great time. So grateful to incredible staff that run the place."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBd0k2TDFBRRAB",
            "text": "Great Pizza spot, we had the Felino and Napoletana Pinsa, highly recommend this place."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfa0xlZFZ3EAE",
            "text": "The oxtail pappardelle and the fried artichokes are pretty good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcE9tRlpnEAE",
            "text": "Service very nice and carbonate was excellent"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bDRtTll3EAE",
            "text": "it was a fantastic meal, had the pizza and beef cheek pasta"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2d01fM3pBRRAB",
            "text": "Camillos is top tier. Great food, service, ambiance, and all that jazz."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcVlIcmZBEAE",
            "text": "Delicious! The team was very accommodating. I cleaned my plate for everything! I had the chickpea and kale soup, the pasta with oxtail, the pistachio olive oil cake. The prosecco on tap was perfect; I wanted to buy a bottle to take home but apparently it's shipped by the barrel directly from Italy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbHZTVVZREAE",
            "text": "Excellent place - have been going to it for the last 6 years. Quality, service and vibe is consistently top notch."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzejhTZENnEAE",
            "text": "Cozy neighborhood restaurant. Great drinks and selection. Friendly and attentive staff.  We ordered the zucchini blossom flowers, the carbonara, and the abbaccio alla romana. Outside of the carbonara, everything needed a touch of salt."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcTRLdVh3EAE",
            "text": "first time here. amazing food & service!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcXVDUERnEAE",
            "text": "I was very pleased to find Roman Jewish fried artichokes on the menu. They weren't exactly like the ones I loved in Rome, but close enough. What a treat! My only complaint was that the place was too noisy for me, but I'm older than their typical customer."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOFlhWF9nRRAB",
            "text": "Lovely neighbourhood spot with great service and drink list. Loved the fried artichoke and the fresh pasta. Only critique was the pasta sauces were too salty."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcWZ1R3VBRRAB",
            "text": "Super special spot! Delicious food and wonderful service. Their negroni menu is delightful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNnN6QVBnEAE",
            "text": "Every time I eat at Camillo, the food is outstanding. The staff are always attentive and super friendly. I’d argue it’s one of the best Italian restaurants in Brooklyn."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcnVyTVV3EAE",
            "text": "This is one of the best Italian restaurant we tried in Brooklyn. This restaurant is even better than many restaurants we have been in Italy. I would give them 6 stars if that was possible. What makes the food special is the authenticity and quality of the ingredients. Many ingredients are imported to keep the essence of the dishes. The restaurant doesn’t seem to take shortcuts using cheaper ingredients, and you can feel the difference in the food.\n\nThe pasta and overall ingredients are very good quality. We always have the salad, and carbonara and amatriciana pasta. Simply delicious.\n\nAlso, the staff is AMAZING. They are kind and good-vibe, going beyond their expected role and responsibilities. It is very difficult to find this type of service in NYC.\n\nAll of this to say that this place is genuine and authentic in all senses. And this is something difficult to find."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYb3BmY1VREAE",
            "text": "I love Camillo, the food is amazing and so is the wine. The Coda Alla Vaccinara is my favorite!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeVBUeWZBEAE",
            "text": "We had a wonderful first-time dining experience at Camillo for my husband’s birthday. The atmosphere was cozy and inviting, perfect for an intimate celebration. We ordered the layered eggplant, butternut squash and ricotta Pinsa, the kale and sausage Pinsa, and finished with a delicious carbonara. Yummy rich, flavorful ingredients, and I paired my meal with a classic Negroni, which was the perfect touch. Definitely a spot we’ll be coming back to 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYel9ibHRnRRAB",
            "text": "Friendly and comfortable place to sit and unwind. Many of the beloved Italian dishes are on point but the artisan pizzas are to die for. I would recommend this restaurant for some wine and pizza nights."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudnJDU0hnEAE",
            "text": "A must when visiting my daughter."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURINGVWVhAB",
            "text": "Not sure what all the hype is about this restaurant. We had the Carbonara and Pizza. Neither were anything to write home about. The sauce on the Carbonara was more of a soup than sauce, and made with cream, which didn’t help. The soupiness of the sauce really took away from most of the flavor, I’d recommend skipping it all together. The pizza was fine but there are much better options not far. This is fine in a pinch, but there are other tastier options within steps that I’d sooner recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINXZfTlN3EAE",
            "text": "Hosted our baby shower here. The food was excellent and plenty. The staff was super accommodating and attentive and were open to whatever my ideas were. Would host another event here in a heartbeat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdDkzM1RREAE",
            "text": "According to Gambero Rosso, the Italian equivalent of the Michelin Guide, Camillo is one of the five best pizzerias in NYC. Totally correct. Its pinsas, with an extraordinary external crunch, are masterpieces. Unmissable!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dVBMOVhREAE",
            "text": "We stumbled on this amazing Italian restaurant driving across Brooklyn. It’s been some time since I’ve had delicious roasted artichoke. The pasta and dessert were tasty and flavorful. Great service and beautiful decor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NC1PN3ZnRRAB",
            "text": "Camillo is a delightful gem nestled in the heart of Nostrand Ave, Brooklyn. This cozy spot offers a warm and inviting atmosphere that makes you feel right at home. The food is truly exceptional, with flavors that burst in every bite. From their authentic Roman antipasti to their unique pinsa, each dish is crafted with care and precision. The prices are quite reasonable, making it a great value for the quality you receive. I was particularly impressed with the friendly and attentive service, which added to the overall wonderful dining experience. I will definitely be returning to Camillo and highly recommend it to anyone looking for a fantastic Italian meal in the neighborhood."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNWJYQXp3RRAB",
            "text": "We been going here for a few years now. Their Fughi pizza, oxtail pasta, meat lasagne with beef cheeks, sooooooo good. The bartender made me an amazing drink once not sure what it was called or what was in it but it was everything. My daughter gets the shirley temple with her funghi pizza or meat lasagna but its no regular shirley temple it is a very elevated version. Not those sickly red maraschino cherries. They add some delicious dark dark red cherries that add a completely different flavor profile to the drink.  Save the best for last. The fried artichokes 😍😍😍😍😍😋😋😋😋😋😋 they are my favorite!!!!! I go there sometimes & just order that. I sit and enjoy or take home the lemony goodness & crispness of the leaves & the soft inside the heart. Sooooooooo goooooooood. Let's not forget the staff. They are great! It's been the same people here for quite some time.  We also enjoy eating outside on summer nights."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1LXZETjF3RRAB",
            "text": "Excellent Roman restaurant right in the middle of Brooklyn. Roman food is my favorite of all Italian foods and it's also hard to find authentic Roman food in NYC - but apparently it's been down the street in Brooklyn the entire time. They have the holy Trinity of Roman pastas (cacio e pepe, amatriciana, and carbonara), a variety of pinsa (Roman pizza), and my personal favorite - carciofi giuda (Jewish styled fried artichokes) that I've never found close to correctly made outside of Rome. They also offer a variety of spritzes - I went with the limoncello spritz which was great and apparently the limoncello is made in house.\n\nWe went here for an anniversary dinner and every dish we had was amazing. I had cacio e pepe which is my litmus test for the real deal or not - it was perfect. They even use tonnarelli pasta - it was better than many that I've had in Rome. My partner had the oxtail pappardelle and loved it. The wild mushroom pinsa was amazing. The selection of mushrooms was unreal - lobster mushrooms, oyster, and maybe chanterelles. Usually restaurants skimp on mushrooms and toss in lower tier shrooms like cremini, white button, and portobello - not at Camillo.\n\nFor dessert we had tiramisu and pistachio olive oil cake - both were great. Also, the wine selection was good. The service was excellent and not rushed. The atmosphere was friendly and lively on a Sunday night. All in all - I have found my new favorite Italian restaurant for the 11 months out of the year when I'm not in Italy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0b2Z1c0RREAE",
            "text": "My friend and I went right when they opened, 5pm. It was us and a father and daughter a few tables down. The staff were great. Didn’t rush us and would always pop by at the right time, you know when you aren’t mid bite or sip 😂. We started with the rosemary spritz since it sounded herby but bubbly. It was delicious! Perfect taste of rosemary and bubbles. We got the soup which was great, warm, not too hot, not too salty, great thickness to butternut squash soup and the roasted/toasted sunflowers were a great garnish. We dipped our bread in the EVOO and then in our soup. I got the oxtail pappardelle and the meat was so tender with a great amount of sauce so that every bite had a burst of flavor. Lastly my friend and I split the pistachio olive oil cake. It was soft, moist, lightly nutty, lightly sweet. A perfect balance and bite with a spoon of ice cream/gelato.\n\nThe ambiance was chill, it can be a date spot or just a dinner with friends/colleagues spot. The music was also great, a lot of 90s/early 00s RnB… I caught myself singing or humming a lot but the music wasn’t loud, it was just a nice layer of enjoyment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMy1DM01REAE",
            "text": "Intimate establishment, but service was polite, prompt and attentive. We were seated immediately because we had reservations. I had the PINSA. It was delicious 😋. Cooked appropriately....Not to crispy or to doughy. The sauce was tangy with a hint of sweetness. The cheese was high quality and didn't taste salty. And the meat was quite flavorful to top it off. Would definitely recommend giving this place a go. I for one will be returning. Thank you"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSa3RqMmtRRRAB",
            "text": "Overall rating: 4.6\n\nAs not a usual fan of Negronis, I really liked it here. And very affordable! This is the Brooklyn, I know & love 😍\n\nMy friend and I opted for pizza instead of pasta, but will definitely be coming back to try the pasta.\n\nTiramisu was okayyy, not the best, not the worst. No complaints.\n\nDef recommend giving a try if you’re in the area. Looks fancy from the outside looking in, but very chill & great music."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwcGVUemRBEAE",
            "text": "The restaurant is very Beautiful. The atmosphere was great and the added brass decor was easy on the eyes. Honestly, looking at the menu I was a bit uncertain of the food. But it turned out to be good. The pasta was cooked very well and the pizza was baked very well. I would definitely visit this restaurant again in the future."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBX0lLUHZ3RRAB",
            "text": "If you live in Prospect Lefferts Gardens, but want to feel like you’re dining in the West Village, this is the place to go.\n\nBring a date, or some distant friends to impress, but don’t come alone looking for a hearty meal.\n\nThe decor is nice and the service is attentive; The food is good but not memorable.\n\nIt’s an Italian restaurant, but don’t come with the expectations of free bread and olive oil.\n\nEnjoy the atmosphere, and leave Camillo (literally) hungry for more."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNDRlVnhBRRAB",
            "text": "I wanted to check out this place for a very long time and I wasn’t disappointed! We ordered olives, chicken liver pate and caprocciosa pizza. Food was great! My partner didn’t like his drink and our server was very helpful with suggesting something else.\nThat definitely wasn’t my last visit in this restaurant!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMXFPS1VnEAE",
            "text": "Authentic Italian! My friend and I ordered a pizza to share and our own pasta dishes. She ordered the gnocchi and I had the oxtail pappardelle dish.\n\nCozy. Comfortable and nicely spaced tables to feel safe dining indoors."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2Ni1HeFd3EAE",
            "text": "Laidback but warm and charming neighborhood spot, would also work great for a date night. There was only 1 waiter serving entire bar and restaurant including the outdoor guests which is nothing short of astonishing. Service was sort of slow…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeXNfNXdBRRAB",
            "text": "The highlight of this meal was the drink and the olive oil cake. The restaurant has a nice decor and my waiter was cool but the pizza was pretty subpar and the pasta was ok. BUT THE OLIVE OIL CAKE. big wow."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHMzdiQTJ3RRAB",
            "text": "Food was great, loved the ambiance and so pleased that they are in our hood !!!!\nGreat cocktails and wine selection.…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBOV9pRUJBEAE",
            "text": "Awesome, quaint Italian restaurant. Hidden away in the Lefferts neighborhood, Camillo is a well decorated and properly staffed hole in the wall. This restaurant honestly belongs in Manhattan the way they run this place. Food is amazing and service is more than great. Definitely recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeUpXSlRREAE",
            "text": "Camillo is a beautiful restaurant! As its sibling restaurant Locanda Vini e Olli, it has a delicious selection of negronis. The pinsa amatriciana was delicious, and along with the negroni just made the perfect experience. The dessert was fair, but could be better. Overall a very pleasant experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobFlucXFBRRAB",
            "text": "Had a lovely time at this cute little spot in a neighborhood that can often appear destitute for dinner spots. The pizzas are generous and easily split between two people and the prices are reasonable and everything is around $2-3 less on average then more north-western areas of BK. On par with the location of the restaurant! The spritzes are fun flavors and beer list focuses many local brews. Was happy to find this spot and looking forward to returning. As others have noted servers can be a bit slow/aloof but that is preferred while chatting and enjoying though can be a bit difficult when trying to pay. (Let us tip you! Haha!)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURac05mQW13RRAB",
            "text": "This place reminds of a rustic old Italian place. I think definitely worth a visit and they do an amazing Aperol Spritz, one where they pipe the bubbly from tap, which is fun! We really enjoyed a number of the appetizers and the lasagna was fire. Would say that the meatballs were not that great. Might be a good idea to retire that dish! Service was also spectacular. Looking forward to coming back to here again during the fall."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwMmJYS0ZREAE",
            "text": "This place is amazing. Feels like family as soon as I walk in. Kid friendly, lone dinner friendly, group friendly and date friendly. I go there all the time and it never disappoints. Check out my food adventures on Instagram at @saltandsavor"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUaUxTaDhRRRAB",
            "text": "We stopped by for coffee and desert after an early reception. Gelato was very delicious, and affogato was just a perfect combination of sweetness and bitterness. Would love to visit for a dinner next time …"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxa3BYUnFBRRAB",
            "text": "On Christmas Eve, we arrived at the restaurant and were pleasantly surprised to find it quite busy. Whether you're looking for a family-friendly atmosphere or a place for a romantic date night, this is the perfect spot for you.\n\nThe staff at this establishment are not only friendly, but also extremely knowledgeable about the authentic Roman dishes featured on the menu. They are also well-versed in recommending the perfect wine pairings for each dish.\n\nFor our meal, we decided to try the pizza pasta combo, starting with the indulgent Felino Pinsa. These pizzas are generously sized and can easily be shared between two people.\n\nThe Cacio e Pepe dish lived up to our expectations, with its smooth and cheesy flavors. The Beef Lasagna was baked to perfection, with just the right amount of crunch on the cheese topping.\n\nOne of the staff members recommended that we try the chilled Cabernet, which is served on tap. It turned out to be an excellent choice to accompany our dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaHBhSGZREAE",
            "text": "The food and drinks here are top notch. Highly recommend getting anything with mushrooms on the menu, it was so absolutely fresh. I got a non alcoholic negroni, which was so close to the real one. Would come back :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMk52NUdREAE",
            "text": "The restaurant looks clean , friendly staff , food is delicious. They use real tomato 🍅 sauce in some restaurants use tomato paste  and makes the food taste bitter. I think this Italian restaurant is my favorite for now ."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRemZ5czRBRRAB",
            "text": "A swanky joint that serves a great balance of seafood/meat/veggie italian dishes as well as roman style pinsa. Also they have honed their negroni cocktails to a fine master piece. Always a great experience!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZa3VHWFhBEAE",
            "text": "Lovely, genuine Italian restaurant with attentive, personable staff. Don't miss the pasta mixed in the cheese wheel topped with fresh pepper. Grazie!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGcU1mM2NREAE",
            "text": "Great place with a cozy atmosphere! I went there with my friends and we had an amazing time. The food was awesome so tasty! Highly recommended"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZck1IMDBBRRAB",
            "text": "Food was good. Nothing too exciting. Started with the Romana pizza which was tasty but not amazing. The pastas were also good but nothing to write home about, nothing was bad but nothing stood out. The house rose however was great for the price, much better than expected.\n\nThe service was okay but could also use improvement. The server knew the menu well and was able to answer all our food questions and changed out the plates between courses but didn't refill our water glasses or pour our wine for us, which is very disappointing for a $50 a person dinner.\n\nOverall I'm not disappointed I came and would probably give this place another try but I'm certainly in no rush to come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNoek5sRBAB",
            "text": "Nice restaurant at the heart of Little Haiti. There is not a lot of restaurants in this immigrant community. Well priced. Good portions. Good staff. For Italian food, they make an effort to make their cuisine stand out from the rest. Would recommend to a neighborhood friend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtXzVDdEF3EAE",
            "text": "Excellent Italian place! We loved the pate, carbonara, the goat with mashed potatoes, pizza and a selection of orange wine."
        }
    ],
    "reviews_count": 79
}