{
    "name": "DJONDJON",
    "place_id": "ChIJTX1IoC1bwokRPWu7-zOniw8",
    "grid": "BK9",
    "address": "1206 Nostrand Ave, Brooklyn, NY 11225, USA",
    "rating": 4.4,
    "user_ratings_total": 1256,
    "phone_number": "(718) 676-1047",
    "reviews": [
        {
            "date": "20시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcmExRk1ZMkl6UW05cFQxZHFhbEZNUXpoSVdYYxAB",
            "text": "My family and I stopped by for lunch and was VERY IMPRESSED not only by the food which was DELICIOUS with their beautiful atmosphere it’s like being home.. but we were also VERY IMPRESSED with Korrine’s ability to be the be informative  pleasant most of all welcoming loved her charismatic personality it was infectious hats off to you boo!!💛💛💛… perfect experience thanks ☺️"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcFkySlZYMFYyYUVkdlptdEthakZNT0VwM1dsRRAB",
            "text": "Korinne is the best part of Djon Djon!!!  Hands down her customer service was a professional delight! Every item she suggested was a hit!  She makes a good drink too!  I called my brother and mom to get their to go orders because I didn’t want them to miss out!  Super chill spot with dope food! Thank you so much Korinne and will see you on the come back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSQ1FXeDVNa1JoUkRVMVRYVnljRUozYlMxRE5IYxAB",
            "text": "I recently moved to the neighborhood and have since had the opportunity of dining here a few times. Each meal has been quite memorable and has had me coming back for more. Truly an experience, and the service i has been equally amazing (Huge shout out to Marcel!) I am excited to try more of what is on the menu."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWGJUZzJUbWx4VVhGT1VXeHpYMlF6YVVOVFoyYxAB",
            "text": "Amazing Haitian food, the servers are very kind"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGek0zZzVhVmx3T1ZwV1pESlBjRGxPT1hSRmFsRRAB",
            "text": "great"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTGJuRnhNRFZPUzA5c2RXMW9jVTVaYW1ndGJIYxAB",
            "text": "This was a 10/10, so many options and very delicious food. The kremas was watery and didn’t taste much like cremas more like coquito than kremas."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVVVuWm5lbUZZYXpKTU1UUm1SMGRxYlRsdWJXYxAB",
            "text": "A very pricey place for a Nostrand restaurant where rent is low and cheap labor."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWWFEUlFRVkZTVVd4cVRGSnRaRVZKZFhWa1NtYxAB",
            "text": "Flavors were great and food was cooked well but it’s insanely overpriced. I ordered the chickpea laya (basically just a bowl of stewed beans) and added chicken for $28–  I got 4 chicken thigh joints thrown in the bowl and it was just bone and cartilage.. zero meat. Almost $30 for a bowl of beans and chicken bones with no rice or sides is actually crazy."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eE1UWmhTMVpSZG5SU1JXMXZlRTk0VFVGclZrRRAB",
            "text": "I came here for a family gathering. They accommodated all 30 of us. I know it was probably a little hectic, however everyone was very attentive. My server Moe was amazing. The food was served family style since it was a large group. Everything was really good, but my favorite dish was diri blan sos pwa, and the goat. The goat was so tender, the sos pwa had so much flavor. My experience was 10/10 & I do recommend!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVFJqSkJiRkJyVGxSdmJGcHNkbWxwVDNKWWVWRRAB",
            "text": "Honestly, my mother was a top notch cook however this place has one of the best Akra!!!!!! I mean it was sooo soft on the inside yet nice and crispy on the outside. The salmon was just ….I have no words. Honestly I am MOST definitely coming back. The service was 100/10. The waitress extremely friendly and familiar with the menu ( she was NOT Haitian)\n\nAnyways , we’re coming back with more people. It was definitely worth it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSZlRFUjFVbDkzTkZkMU9HUnJlV2Q0WVd0dlNYYxAB",
            "text": "I came here with my friend, and although the food was pretty good, it did feel overpriced compared to other Haitian places I’ve been to where the food was just as good. A simple plate of rice and plantains should not cost $30. It was cute in there though.\n\nBut the service was weirdly rushed once we got our food. It took a while to get our food, but once we got it, our waiter kept returning to ask about to-go boxes despite us having PLENTY food left on the plate. The second I was done eating he rushed to take my plate and offer the check.\nWe weren’t even there for a full 90 minutes but the waiter’s insistence on getting us out was so odd, that we paid and left. I won’t be returning off the rushed service alone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdGRXMHdUVlpXYTJ0MmJuaFhkMkl4T0ZCSFgwRRAB",
            "text": "We came here for the first time tonight and were absolutely blown away by the food. Everything we had was outstanding. We had the mussels and the sauce was incredible. My voodoo pasta was sooooo good! Everything we ordered was just so good. I highly recommend this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TVYwNWlkR1JmV1ZJMVZsUXRVRXgzTW1OMk1YYxAB",
            "text": "Took my family out for a Sunday dinner. We will definitely come back. The grilled goat (kabrit) was delicious and so was the lambi creole!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVU5tZExhSG8wV0VzM05YaHZZWEIzVm1kWFRXYxAB",
            "text": "Had dinner over some good jazz night and the atmosphere was delightful. Really nice staff and tasty Haitian food. A must try!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTVEyNHlablpPTTJseVpFRkpOMEZFYjNKUVRuYxAB",
            "text": "We really enjoyed the food. There was variety and many delicious options. The place was trendy and well maintained. Our waiter was very nice and the general manager Mr. Fedner was kind, knowledgeable, friendly, and helpful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMmVtVmZjRFpFVkdwWk1WSk9WWGxRTmpkblNXYxAB",
            "text": "Food was excellent. It feels like the food is organically cooked, with good attention to detail, making for a very good presentation and experience.\n\nI got the beef blood sausage, and DjonDjon paella. Blood sausage was nicely juicy and flavored, the tomatoes and sauce paired very nicely, adding a nice touch of acidity and sweetness. The DjonDjon paella is nice and satisfying. It is not boldly flavored, which meant I could eat a lot of it in one sitting without feeling overwhelmed.\n\nThe atmosphere is nice, like casual fine dining. I highly recommend giving this place a try, I will certainly be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNlRpMVhPRXBaU0hWTlNWUXRRM05SWlVKcFFVRRAB",
            "text": "Marcel was a delight to have serving us at the bar we had appetizers and drinks “Citadel punch” I rate it 5 stars. This is my second time coming to this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VFRqYzNSbEJYWmpJMFpIcDVRVEptWkd0M09IYxAB",
            "text": "My friend and I came here for a quick bite and drink and was greeted by our waiter Marcel who was so pleasant from the door. I ordered the kafou honey jerk wings and citadel punch and it was perfect. Marcel provided us with everything we needed and was helpful with the menu. I will be back again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNlNUVXplRWx1UjNKWmJESkxiMVp4VW5BMmNYYxAB",
            "text": "Food was Excellent, hands down one of the most authentic Haitian food I’ve had. Our server Marcel was very professional and friendly. Will definitely come back for lunch tomorrow"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMldraEViRWhFTjB4dWVWUnVMVlYxU25VNFRuYxAB",
            "text": "Authentic Haïtian food, i really liked the place, the service is really good, everything is clean and the atmosphere is calm and cozy, the food is really good and tasty. Our server Marcel was really good,polite and efficient, definitely will come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUFFXcHRVV2x3TnpsTVJVYzVWRzAzVGs1MlQxRRAB",
            "text": "The service was top of the line, Marcille  was very kind and answered any questions we might have had. And the food was well seasoned and delicious.The store and music was very inviting,  I will definitely be coming back with even more friends"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneGEyUnNUUzFpYWtWdmVrUlhiSFJPTW01M1EyYxAB",
            "text": "Brought my older Haitian parents here for a birthday dinner with a party of 12. The service was excellent and they really accommodated our party! My parents had a ball and can't wait to return!\n\nThe Djon Djon staff created a warm environment, with music playing at the right volume. The food was authentic and delicious, with a very short wait for appetizers. I particularly enjoyed the legume, which was stewed just perfectly. The cocktails were also delicious, with the Jus Corosol being a favorite among our group.\n\nThe manager Marcel made sure all our needs were met. He brought out sparklers and desert for the birthday people, with old school Haitian music playing. Very classy and nostalgic.\n\nThis is the perfect restaurant for a intimate family dinner and I would recommend to all my friends.\n\nThank you Djon Djon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTVgwMUlOazFVT1ZabGRrWlZZMmd0WlhGVE1sRRAB",
            "text": "Went for a friend birthday 🎂 food was delicious I will definitely be back 😋"
        },
        {
            "date": "1달 전",
            "language": "ht",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVU4wVXdWa04zU0U1c2NuWnVVRU13ZUhwRGIxRRAB",
            "text": "Bon sèvis ak bon manje. Saumon an pi bon"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNU5UQnBXbWhrU1ZWb2NrOWpWekpxVEZack4zYxAB",
            "text": "Amazing food and truly an authentic Haitian experience coming from a Haitian girl"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NFRURjNNMmxSVUhsUWJIaEdiblpIYlc5VFFtYxAB",
            "text": "Julissa was such an incredible server! The service was phenomenal and the food… no words just too good. Flavorful, with great portions. Definitely coming back for more!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsYVVGazVkRmhzWkRGNWRIcEphV3BwUWkxNWJIYxAB",
            "text": "Great lunch. Mussels for an appetizer were fantastic. Service was spot on."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNVVVSkxjbEJOYW5KdU4wOHhURUpCVm10eVdXYxAB",
            "text": "I was expecting to taste real authentic Haitian food but got u seasoned/overly seasoned expensive food from what seems to be the trash.They dont put the prices on the menu so they can trick you into buying an expensive item.It took a long time to get our food when there were less than 3 other people.The bathroom only had hot water so my party burnt their hands.They charge 20% more for parties of 4 and over and automatically make you tip!They say its a new york thing,then say some restaurants do it which let's you know it is only them."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbFFXTkROMnRRTFVsalRsQjBiVVJpWVcxdE0xRRAB",
            "text": "Include 67 dollars just for tip in the bill. Came out to be somehow 400$ for 7 people. Waiter was decent but other one gave me odd vibes. Food was below average for an insane price"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbmRsQnNNblY1UW1WVlMyVkdTRzVZYXpKWlgwRRAB",
            "text": "I had an amazing time at Djondjon. My friends and I went here for dinner and we were impressed. The food was absolutely delicious. Our waitress, Julissa O, was outstanding. She constantly checked up on us, offered great recommendations, and was overall a vibe. I highly recommend this spot for delicious Haitian food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKZlgxVmpSVkIxVTA5M1JFbHdiRTFOVFRSUVVXYxAB",
            "text": "Excellent Service from Marcel\nMarcel was fantastic during our visit! He was friendly, attentive, and made sure we had everything we needed without ever feeling rushed. He gave great recommendations, checked in at the right times, and really made the experience enjoyable. The food was great, but Marcel’s service truly made the night memorable. Highly recommend asking for him if you come here!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdGJGSXhRVmg0UkhkSVdWWkVWRjlOVFRjeldXYxAB",
            "text": "AMAZINGGGG! I’m just a girl for the Bronx. The food, ambiance, and service were top tier. The food was flavorful and fresh with no long wait time. Please please please check them out. It was worth it! I’ll be back 😁"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWmIwWTVPVjl4VlZSVE1sWlNOa0Z1TWpOTU1tYxAB",
            "text": "Incredible hospitality, and the food is immaculate. Loved dining here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STk4ydGxjVkpmZW5veVdsVlFURXhaYVRGVk9HYxAB",
            "text": "After trying 3 other restaurants, we landed here and DjonDjon did not disappoint! The live band was well into its set so the vibes were right! It was my sister’s first time Haitian food and I’m not sure how it could age been any better. Food was delish and plentiful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMFJUaHBjRzFZZFd0aWF6aEJVVVZ5WTAxeVZVRRAB",
            "text": "I had such a wonderful experience at [DJON DJON From the moment I walked in, the atmosphere was warm and inviting. The staff was attentive, friendly, and made me feel welcome right away.\n\nThe food was absolutely delicious — every dish was fresh, flavorful, and beautifully presented. I especially enjoyed the [signature dish or favorite item], which was cooked to perfection. Portions were generous, and everything came out in a timely manner."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21salpHVkNTV2RGYmxWZlkyNDJaVlIxWDFKcWRVRRAB",
            "text": "Friendly staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dGNVWkRWVmhOZFd0RU5HWTBVRFp1TTB4SU1XYxAB",
            "text": "Food was Very tasty"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRM2R6VTBUblZwUm5jM1VGUkhaek56V0hOVFZHYxAB",
            "text": "Thank you guys for everything"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wa1ZtUnRTa05WTVdkM2JXaHZUelI1VDNkeVQzYxAB",
            "text": "Good restaurant I love it !!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oc2JHVmxkVTU1ZGpFNWJsUjZVME5hU1hCbWEyYxAB",
            "text": "O my god thank you guys"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMWFYcE1NbVp1U0c1NVNrVnVVVlpZVkVaMGMwRRAB",
            "text": "I stopped at this restaurant on my trip to NY from FL, because I saw all hype  on instagram but boy was I disappointed. I could easily deal with the overpriced menu if the food was good, but terrible macaroni au gratin, more like macaroni with cheese sauce, very dry, the chicken with sauce taste like ketchup so is the kabrit with sauce. We walk from the subway so  I had a couple bottle water w us, all of the sudden the manager came to our table to ask if we could put our water on the dirty floor because that’s not the brand water they served there. I’ve had water with me at fancy restaurants, never had a manager asking me to put it on the floor. Spending over $200 and have to put our water bottle on the dirty floor. Never again. Our sever was very pleasant thou."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMVZXOHhjV0ZETWpoa1JsaHdNREl0V0d4Wk5rRRAB",
            "text": "I really wish I could have said that it was a better experience, but unfortunately, we did NOT enjoy our time here at all. Came out on Monday night. The food is nice, although for my tastes, personally, it could have used more seasoning. I was unable to provide photos for all that we had, just took a few pics. There was music but just so many people coming in and it seemed the establishment is quite unorganized. It was too loud, the band should have played indoors! And our food took so long to come out. But our server was so sweet and really tried to make sure our experience was a good one. I would say they get a gold star for hospitality but the way they berate their staff in front of guests is just deplorable! I saw a young lady behind the bar get shouted at to \"go HOME\". We shouldn't have even been able to hear as much as we did from our table, but it looked like she had just had enough and wanted to give her two weeks' notice and the man who was screaming fired her there on the spot instead! I know, but you can't expect much decorum coming here because there was even some sort of fight that broke out and police showed up! It was chaotic! I think the young woman that was slapped also worked there! I saw a lot of gentlemen standing around and yet not one took any initiative to protect her. We felt bad for the staff, but this is just not a good look for a business. Do better. I was so upset that it ruined our night that hubby told me I need to go online a write a review!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oaU9WaHVVM0ZaV2twcVYyUkdTRVpRUVdwTVdVRRAB",
            "text": "Food was good. That’s unfortunately all I can say since the food takes such little precedence over what I saw while I was here this week…\n\nI was here on Monday night; I have never EVER seen such disgusting and horrible disrespect to staff members before. I literally witnessed (what I assume) was the manager fire an employee on the spot it the most disturbing way. Yelling at the employee like they were a child. It was abusing behavior how he was talking to her. It’s was absolutely unacceptable behavior coming from a grown man. After seeing that interaction I completely lost my appetite. At the end of the day, no matter what their situation was together—no one deserves to be embarrassed and treated like that. I hope they go to labor complaints about this interaction.\n\nDon’t even get me started on my safety that night. I did not feel safe at all. I ALSO saw an event of a young girl—also another staff member—getting SLAPPED!! I saw a young man console her after the event while the “grown” men (which from my understanding was the owner and the other the manager, from talk I heard) only were trying to get the girls out who got the young woman instead of breaking up the actual fight itself. I took a video at one point where I literally heard someone say “do they not have security?”. Police were called later that night. This is the second time I’ve been here where police have been called to the restaurant. Coincidence right? If that doesn’t tell you what you need to know I don’t know what does.\n\nOverall—I’ve been here multiple times, especially during busy hours and will not be returning after the behavior I saw that night to the staff and by the management. Horrific behavior to people that work for you. Don’t spend your money where they treat people like this. People like this need to go out of business."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wb01ta3dVSFIwVWpKYU4yWlhUVlZYTmpSeE9VRRAB",
            "text": "Oh my god. This is the first time I’m giving a restaurant 5 stars across all boards. I ordered from UberEats. I got the Baked Chicken meal w/ Black Rice and Macaroni Gratin. It was all $31.57. A bit pricey even though I ordered it for pickup. When I got to the restaurant everything was so beautiful and put together. The tables, the music, the decor…AMAZING. My order was ready before I got there. The lady behind the counter was so nice. She gave me good recommendations for next time I came. When I was there I decided to get the Pate Kode w/ Herring. It was $17 and came in 3, but it’s $21 with tax. Ugh it was so so so good. I loved the filling. It reminded me of the Guinean version of it, Fataya. Guinea 🇬🇳(West Africa—my country). The same filling but with different fish. I swear I’ve never had this kind of feeling when I ate the Pate Kode. That’s a 100/10. The Macaroni Gratin could honestly be better. It looked and tasted bland. No seasoning. I didn’t like it. Just pasta and cheese. That’s a 6/10. The Djon Djon rice was phenomenal. I’ve had it before but this one is very good. The Baked Chicken was absolutely amazing. It was tender and juicy to the bone. Reminded me of Poul Nan Sos. The stewed chicken. It tasted so clean and delicious. That’s a 10/10. I loved the Pikliz. I love it. I love it. It was not too vinegary or bland. The only thing that made me twitch was the prices. $17 for Pate Kode?! $31 for a medium sized meal?! But I understand things might be expensive nowadays. That’s just wild. I honestly recommend this restaurant for a first time. It’s so good and it tastes like real Ayitian food 🇭🇹 Sak pasè🤗🤗"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wb1h6VllPVmxaWm05cVozb3pkakZ6VFdVMVkzYxAB",
            "text": "The salmon was very good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5c1FXOU5RMEpsTTNJelZIVjJhblo0U1VrdFlrRRAB",
            "text": "My boyfriend’s Haitian mother rarely eats out or enjoys food made by others, so taking her to Djon Djon for her birthday felt extra special. We started with the herring patties, griot sliders, and fried plantains — SO good! At first she looked at the patties a little cautiously, but after one bite she lit up, praising them and everything else that followed.\n\nFor our mains, we had the voodoo pasta, fried griot, and fried goat — all flavorful and perfectly prepared. But what truly made the evening memorable was our server, Elijah. He was attentive, kind, and thoughtful in every detail. He not only made sure our drinks were delicious but also went above and beyond to celebrate Mom’s birthday in the sweetest way.\n\nThank you, Elijah, for your incredible service, care, and warmth — you made the day unforgettable!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25remIySTRRMnAxVUhwblVWZFJlSGhhV0hOcWNFRRAB",
            "text": "As a Haitian visiting NY, I was really excited to try this place, but unfortunately the food fell short of what I expected. I was looking forward to trying your food but unfortunately my experience left me a bit disappointed. The legume, sos pwa, and white rice didn’t quite capture the flavor I usually expect from a Haitian dish. The rice wasn’t the typical jasmine or basmati style, the sos pwa tasted very plain, and the legume seemed to lack seasoning. The plantains also seemed to be the frozen kind, and the pikliz was more vinegar-heavy with mostly cabbage and carrots.\n\nMy aunt ordered the fritay, which came with only a few items and they also didn’t have much flavor. We actually ended up leaving still hungry and stopped by a nearby bakery afterward.\n\nI really encourage you to focus on the quality and authenticity of the dishes, since Haitian food is known for its richness and depth of flavor. I understand you may be trying to make the dishes more approachable for a wider audience, but in doing so it feels like the essence of true Haitian cuisine is being lost. Staying authentic to the bold, vibrant flavors could really set you apart."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbVJrVmhWbG81TWxOUk0wMTJORkZ3ZGtsQ1VHYxAB",
            "text": "had such an amazing time! Voodoo pasta was to die for. Elijahs great attitude and attention really complemented the lovely atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkclNVRmtUMGhTWmxJNVNHc3RhMWxmWWpWQ2JsRRAB",
            "text": "Amazing food made better by the excellent service. Our waiter, Martin was so so attentive and engaging, even going the extra mile to call us by our names. We came across this amazing cozy restaurant late one Monday night while looking for somewhere to grab a bite. From the moment we walked in it was a vibe! We had the salmon and the voodoo pasta; both full of flavor! We pretty much shut down the restaurant, with the owners taking the time to come over and chat with us! Andre and Raquel will be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wd2JYaHdXRmhZT0ZOM1pHVXhVbFJYV0ZKTlVIYxAB",
            "text": "Came in to this restaurant a few nights ago while in the neighborhood and due to the reviews. And I am soooo happy I did!! The food was so good I was doing a lil happy dance in my seat. Lol And the waitress Julissa was a sweetheart! I had the Voodoo Pasta which I substituted the mushrooms for garlic and it was amazing!!! A must try! My friend and I shared the Chickpea Lava and green plantains and it did not disappoint! My friend had the Kabrit En Sauce with black rice, and he said it was the best goat he's had to date. I tried the black rice and Chickpea Lava and wow! That alone can be the perfect meal. I also had the cocktail Haitian Sunset where I substituted the orange juice for passion fruit and it was perfect! I cannot wait to come back. 😁"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMFNscENNSE4xU2s5aldtNUJjVTkxYzI1dmFIYxAB",
            "text": "Traveled from Jersey to try this restaurant and I must say it did not disappoint. Comfy, cozy, and stylish restaurant. The staff and services were excellent. The food and drinks was absolutely delicious 5 stars. I will definitely return and drag some friends ands family to experience this lovely Haitian restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OcE9IcExiRzEzZUhOS1NuUm1TVFl4TkhCeFVYYxAB",
            "text": "Stepping into DjonDjon in Brooklyn, I was immediately struck by the inviting atmosphere – and even better, finding parking was fairly easy, a definite plus in this vibrant borough! I came in with high hopes, and DjonDjon delivered beautifully.\nOur server, Julissa (I hope I'm spelling that right!), was an absolute delight – attentive, friendly, and made our dining experience even more enjoyable.\nI opted for the DjonDjon Burger and it was fantastic. The patty was juicy and flavorful, perfectly complemented by the fresh toppings. But what truly elevated the meal were the sides: the Green Plantains were perfectly fried to a golden crisp, sweet and utterly addictive, while the Black Rice was rich, savory, and incredibly satisfying. Every bite was a testament to the authentic flavors DjonDjon brings to the table.\nBased on my experience, DjonDjon is a must-visit for anyone craving delicious Haitian cuisine. With its fantastic food, great service from people like Julissa, and convenient parking, it's a gem in Brooklyn. Thank you ❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOS0ZtY1QybnJHQ25nRRAB",
            "text": "An extraordinary dining experience! I had the legume stew dish with shrimp and sweet plantain on the side. The stew was unbelievably good, it felt like a home cooked meal. We also got fried herring which was a great app to our meal.\n\nThe service was incredible too. I actually lost an expensive piece of gold jewelry and the staff were prompt in helping me find it!\n\nGreat service and delicious food! I’ll be coming back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMnB6X0ZBEAE",
            "text": "Great ambiance! Romantic, friendly and a perfect date night. Tasty dishes and good service. We ordered a chicken stew, goat stew and griot sliders with pikliz. Everything was delicious. First time having Haitian food and loved it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNGNYbzNVM05IVUd0SlJsVTJWbmhFWkVoT1RtYxAB",
            "text": "I was really excited to try this place, especially since I’d been craving conch (lambi) for a while. Unfortunately, the food overall missed the mark. The rice lacked flavor, and both the lambi and pikliz were surprisingly bland definitely not the bold, spicy taste I was expecting. It felt like the food was toned down for the gentrified crowd. If this is supposed to be gourmet Haitian food, it’s not giving.\n\nOn top of that, the ventilation inside was poor it was uncomfortably hot, which made the experience even worse. For the high prices, I expected much better. For now, I’ll stick to my spot in the hood where the food is authentic, flavorful, and worth every penny. Service was good so we did tip above the included 20% gratuity."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdE1uQkhhM0F3Umprd1EzZzJaMWxmVmkxRU1FRRAB",
            "text": "I Came here with some friends for late dinner during my visit to NY. Service was excellent, Julissa was very friendly and attentive. She delivered exceptional service with a smile.\nI ordered the Haitian sliders and the acra. The sliders were a bit disappointed. Nicely presented but the breads were too soggy because the picklis were served on top of the bread instead of the side. The acra was ok, not the best. for drink i ordered the mojito and it was very disappointing. My wife ordered the salmon which was well presented and very tasty. She ordered the Dessaline drink and that also was on point.\nI like the ambiance which matches well with the decor. The outside sitting is an added touch to the place. I definitely would like to come back and give another try next time i’m in NY\nEvens C"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CYVYydEJaV1poZWtGVFpuaDBabnBCYW5kSlMwRRAB",
            "text": "I had the whole fried Brazino with plantain which was delicious. I was worried it would be dry but the fish was so flavorful, I was pleasantly surprised. Besides the bartender singing like it was American idol tryouts the service was great and I would definitely go back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNzRuOFZBEAE",
            "text": "Honestly, by far the best restaurant I have ever been to. The server/ owner was phenomenal in every capacity. He was very knowledgeable of the menu and made tweaks where he needed to make sure everyone had a dish they could choose. The food was exquisite and downright delicious. I never had experience like this before and I really appreciate taking the trip from Boston to experience this international cuisine."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMRFJ6SldxdnIzVTFnRRAB",
            "text": "I reached out via email maybe a week or 2 in advance for a May 28th graduation\n\nThey were organized, patient and did everything to make sure everyone was comfortable!\n\nThank you so much to the waiter that served us! I am sorry I forgot your name. You were amazing! I hope you get promoted because you had everyones orders on point even with my relatives switching their seats or waiting to order lol\n\nI would come again and strongly recommend to others. My family had a blast celebrating my Masters degree. Bondye beni nou! Mwen pap bezwe rezon poum tounen vin manje. Nou te byen jere nou. Mwen pa gen regret kem te fe resevasyon mwen avek nou\n\nKe bizness la kontinye grandi ❤️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d291a2ZREAE",
            "text": "Great food. Great service. Great atmosphere with the live band playing. The mushroom ravioli with chicken added was fantastic! The coconut shrimp with sweet plantain, on point!  The mocktail was very  tasty. I absolutely will be back! Shout out to the manager Marcelle & our server Charity!! What an amazing experience!!! 🍴🍸🎶"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNnB2aGt3RRAB",
            "text": "My bf and I went here for dinner yesterday and needless to say, we left a bit disappointed. The atmosphere and ambiance were beautiful, but everything else was just blah. The service was not great, and left us waiting for unnecessarily long. I ordered the grilled lamb with green peppers and onions (+ black rice), and when it came out, I was even more disappointed to see how small my dish was. The flavors were okay, the black rice was dry and a bit bland, and this dish in particular is way overpriced for what you get. My bf got the duck and veggies (+ mac & cheese), which was pretty good. All in all, it’s a cute spot for drinks and appetizers, but they need to re-evaluate the pricing for some of their dishes and the flow of their dinner service.\n\nAlso, it doesn’t hurt to look at images of the dishes before going because had I known my dish was going to be that small and look the way it did (wasn’t expecting the lamb to look like that at all), I would have ordered something else. Just a heads up!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbUpHcUh3EAE",
            "text": "5 Stars for Djon Djon!\nChef Wesley and his team make you feel right at home with their warm welcome. Their Haitian dishes are both mouthwatering and beautifully plated. My top picks include the griot sliders, Djon Djon spaghetti, goat with white rice, and the black bean sauce. Don’t forget to try their refreshing Haitian lemonade. Highly recommend this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMFVVeG1TWG8yVkdvMFVIcDVUM1JRUnpkS1ZtYxAB",
            "text": "Ok traveled from Atlanta and had to try this place. I’ve had Haitian food in Atlanta and south Florida broward and dade counties so I know good Haitian food. Plus my father side of family are Haitian so I’m very familiar with the culture. I tried to find something bad to say about this place thinking all the positive reviews had to be false but I couldn’t. The food a 10 the atmosphere a 10 the service we received also a 10! The drinks were amazing and the food was breathtaking. Good Haitian dishes and pikiliz made exactly how it should be. No complaints. Can’t wait to come back and visit again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNUzh6LXFxaDR1aTJRRRAB",
            "text": "The Fritay is always fresh and perfectly cooked. The griot is AMAZING!. The vybe is really just that a vybe. If you want the full experience go and eat in but if you want the food or drinks order online you won't be disappointed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkaFdVVXhSeTB5VHpkMmJ6ZDBRM2M1VERaV2VrRRAB",
            "text": "Really great spot and really chill . Haitian food is the key to my heart and they did a pretty good job it’s a 7/10 for me . I really do recommend this place…… check it out"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ2JXYnJBRRAB",
            "text": "Came here with a friend that wanted to try this spot it was absolutely amazing. My favorite thing was the nonalcoholic mojito and the Mac and cheese! My friends really liked their coconut shrimp and the sliders. Great ambience and friendly atmosphere."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIZzgyVXhBRRAB",
            "text": "This is a nice Haitian restaurant that I visit when I’m in the area. The food is good and I love the live entertainment. The menu has been revamped a bit so it’s nice to have some new options to try out. Good for date night or catching up with friends!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBemNqWVBREAE",
            "text": "Quite the expensive menu items but super glad we got to try it outt. My favorite was definitely the jus corossol mocktail, that's soursop and coconut milk. My tostones (green plantain) was crispy, dipped in the chicken wing side green sauce, delishhhhhyyy. The Kafou wings was wow juicy for me i did not expect it, its seasoned and good portion pieces of flats and drums.\n\nAkra was an interesting try of malanga pretty mush inside, the salmon was unfortunately dry not very juicy. Fried pork was ok in the lobey fritay, but the beef sausage was omgg delicious.\n\nMy friend loved his stew goat and the black bean sauce."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6d1k3RzFBRRAB",
            "text": "I visited the restaurant last night and I was pleased with my overall experience. Among the other Haitian restaurants that I have visited, I will say that this one got my heart. The place was clean, the music choice was great on point the whole time. The food was absolutely delicious, the portion was decent for the price, the pikliz was to die for. The only thing is I wish they gave a more decent size for the black rice. Overall, good vibe and great food. I will visit again soon. I will recommend this place to anyone looking for a great Haitian restaurant.💯"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FM01XOXlVRGhJU3pJMFpIUTVUbXBFUWt0UFMwRRAB",
            "text": "Had the BEST time celebrating my friend’s birthday here! The owner, Marcel, greeted us personally and brought out the cake with a sparkler on it and had birthday songs blasting. It was an incredibly joyous experience. Food was phenomenal - I got the paella + a side of sweet plantains and the pikilz were so good. We had a group of 8 and were so impressed - food was delicious and the service was top notch. Can’t wait to come back soon. I wish I got pictures of the food but I was too hungry."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYd3R1UHZ3RRAB",
            "text": "We're really enjoy the food and the music. We like the presentation of the black rice. The punch was delicious not too sweet. Nice and clean place. Clean bathroom.  Nice personal, the server was so nice she's doing a good job. The food 😋 tasty.  See you soon.  Thanks for your business."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQTEI4N25yMnM3VXF3RRAB",
            "text": "Jacob was absolutely amazing! He was friendly, attentive, and made some of the best drinks I’ve ever had. His energy behind the bar was welcoming and fun, and he really went above and beyond to make sure everyone was taken care of. Definitely one of the best bartenders I’ve come across — highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneS1hN3lnRRAB",
            "text": "I went on a random Wednesday afternoon and I’m impressed. I love Haitian food and this place made me love it even more. Wesley was highly attentive and ensured I had a great experience. The Chiktay was great - loved that they paired it with tostones. Of course the duck with black rice was the highlight and it was amazing. I have to return as there are so many dishes I still want to explore especially the Lambi, the pasta and the Legume aubergine. All in all a great experience with amazing Haitian fare and chill vibes with konpa playing in the background. Absolutely loved it! Thank you! Not sure when I’ll be back but I will! ♥️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMkxPa3lBRRAB",
            "text": "Our experience here was nothing short than amazing ! The owner was nice and personable (photo with us). 10/10 when in town this will be our stop at all times! The voodoo pasta was to die for !!! I’m so glad I found them on instagram they did not disappoint"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPb3JQYlNBEAE",
            "text": "Out of towner reviewer:\nUNBELIEVABLE! One of the best meals ever!\nMy wife and I stopped by for dinner after arriving into Brooklyn for the weekend.\n\nHere’s what we ordered:\n-Kabrit en Sauce w/ black rice (very delicious! the goat was so tender. Note: this does have some spice to it)\n-Chickpea Laya w/ black rice (fully vegan and very, very good. A large portion, plenty to eat)\n-Macaroni Autin (possibly the hidden gem of the menu. So creamy, hot, and delicious)\n-Sweet plantains (amazing, just what we wanted for a nice sweet treat after dinner)\n\nThe staff was super friendly. Just as a heads up, they don’t serve alcohol, but we heard the mock tails are still good to have. The meal prices were a little higher than anticipated, but still, very much worth it.\n\nOverall, we were highly impressed with Zanmi and recommend it to everyone. This restaurant is a diamond-in-the-rough establishment, definitely come check it out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbXVLbmNREAE",
            "text": "Let's see, where do I start? I am a proud Haitian American and spent many of my summers in Haiti. So I've been able to have delicious Haitian food. I am so happy that I traveled to Brooklyn and ate at the restaurant under its new name. It was a well decorated restaurant with vibrant art and beautiful colors. The food was absolutely delicious. We had the grilled Branzino, Djon Djon Box, macaroni gratine, Griot sliders, and legume w/shrimp, and I was impressed. The portions were perfect and shareable. Everything was so well seasoned and amazing. We actually devoured everything. Vanessa was our waitress and she was quick, knowledgeable, and very friendly. I'm already planning my trip to return. If you're in Brooklyn, just go and try it out!\n\n**currently no liquor license but they own a bar across the street you can get cocktails in the meantime. I'm sure they'll have it by the time I come back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NEpXcTFnRRAB",
            "text": "The food at this establishment is far from fresh, often tasting as though it’s been leftover from prior meals. To add to the disappointment, the service provided by the two waitresses is unprofessional, leaving much to be desired. I found myself questioning the authenticity of the positive reviews on TikTok and Instagram – they simply do not reflect my experience. I strongly urge you not to waste your money at this place, as the food made me feel quite ill after I left. Additionally, the chairs are uncomfortable, further detracting from the overall experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHeTYybUtBEAE",
            "text": "The food was absolutely delicious. I tip my hat to the chef, who was absolutely wonderful. I got a chance to chat with him a little and expressed my enjoyment of the meal. I visited with friends who had not had Haitian food before, and I must say we all cleaned our plate.\nThe staff was friendly and professional, and the space comfortable with Kompa music playing in the background. We will definitely be going back. Excellent."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Z195Y1BBEAE",
            "text": "Awesome food, ambiance and service. Our waiter Marcel was very attentive, offered suggestions to try off of the menu. It’s not everyday that you come across a fine dining restaurant specializing in Haitian Cuisine. Thanks for answering the call guys. Can’t wait to come back in the summer to enjoy the sidewalk cafe 👌🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MGFUTFhBEAE",
            "text": "I wasn't completely sure what to expect here, but we had a delicious meal that was ACTUALLY SPICY! So many \"upscale\" places cater to milder palletes and reduce the heat found in ethnic cuisines, but that's not the case here and I'm so happy for it.\n\nWe dined in on a Tuesday evening and there was no wait. We ordered the crab cakes, the pate kode with herring, kabrit en sauce, and the grilled octopus. All was cooked to perfection, and the spicy dishes were balance so that the spice didn't overpower the other flavors.\n\nOne thing to note here is that they only serve mocktails and soda, no liquor or beer offerings."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6cGRxNTNRRRAB",
            "text": "The food is So delicious. First, we stated off with the Haitian Sunset, \"omg sooo good. Then had a haitian long Island. The appetizers we had were the wings and the coconut shrimp. All I can say is delicious!! The entrées we had were the macaroni gratin, Djon djon box with chicken, lambi en sauce, black rice, and legumes. Food tastes just like your mother is in the kitchen throwing down.\nThe service is impeccable. Marcell is so\nwelcoming and attentive. The ambiance is just perfect. It's just right, not a lot of stuff crowding the table, so you can really enjoy your food.\nSecond time coming to this restaurant, and all we know is that we will definitely be back! The food is seasoned just right, not bland at all like we have read online. When you come, see Marcell.. he is THE BEST!!!!!"
        }
    ],
    "reviews_count": 81
}