{
    "name": "Grill Zilla",
    "place_id": "ChIJx-2-SmlbwokRRiLThPlI6ng",
    "grid": "BK9",
    "address": "589 Flatbush Ave, Brooklyn, NY 11225, USA",
    "rating": 4.8,
    "user_ratings_total": 22,
    "phone_number": "(929) 714-4443",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMGIySkJiMFp5UzJsRU1GaDNRVUZ1UjJOMFIyYxAB",
            "text": "soo yummy, got the chicken and lamb over rice. great portion size and nice people!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taelpGTnhVMUpGZWxoZlpGRmhiMnRwTUZVMWFYYxAB",
            "text": "Good food,friendly service,clean and peaceful environment.Thumbs up to this halal restaurant."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbk1FOWlhRTR5VDFGRVRtVm5NbUpWYWxKM1FVRRAB",
            "text": "Grill Zilla – Warning to the Neighborhood\n\nThe first time I checked out Grill Zilla, the grill chef offered me a sample of chicken over rice . It tasted decent.The grill chef was polite and accommodating while the manager/worker was standing there acting weird as if he didn’t approve of the grill Chef offering me a sample.\n\nThe second time I went, the manager/worker tried to serve me dried-out chicken scraps left at the bottom of the pan. I had to tell him it wasn’t acceptable before he finally had the grill chef make a small fresh batch. Then he pushed me to take lettuce that looked old, possibly unwashed, and had been sitting there all day. The fries were just broken bits, and when I complained, he made a tiny portion that didn’t even fill the tray section for fries.\n\nBy my third visit, the manager/worker attitude was nasty. Same thing with the chicken scraps, same thing with the fries. What made me lose all trust was when he came in from outside and handled the food without even washing his hands. That’s completely unsanitary.\n\nI told him straight up: you cannot come into our neighborhood with this kind of disrespect, bad attitude, and food that isn’t even fit to serve a dog. People around here work hard, and we deserve better than being treated like that. If this is how Grill Zilla plans to operate, they won’t last long in this community."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TWIySnBkeTEyTm5CQlZYaFNkakJLWjFGQlZIYxAB",
            "text": "Very tasty chicken rice and salad. Friendly staff as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSWIzVm5jbmxWYUc5UVpYazRWVFZETFRZMVpGRRAB",
            "text": "great food, great service, great prices."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aS1ZYQkZaWFZvYnpoUGIzUkthRWhNVFRCbU9HYxAB",
            "text": "I had jyro they gave me extra fries definitely i will come again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kcWJtSnFVMXBQTVZNemFWbGlRV2hhVXpaWUxVRRAB",
            "text": "Great Middle Eastern food! Really nice and attentive manager and cook."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sV1ZYRnpWSEZEUVRSaU0zTTFUa1ppZFdGMU1rRRAB",
            "text": "Great food, good hospitality"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSVJIaFlWSHAyUVhjelEyczBRa1p2YTJsdFpGRRAB",
            "text": "Manager was great and the cook was amazing hand down best halal food in the area!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poR2FIZHZNMTk0YUU1T2NVMDVVV2d6Y2tWRVJrRRAB",
            "text": "Best food ever the king of Halal food Grill Zilla TAKEING OVER FLATBUSH IT SEEMS  AND BUSHWICK BEST BURGERS 🍔 AND WINGS AND FRIES 🍟 MUST TRY FREE SAMPELS IF IT YOUR FIRST TIME…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcFFXRmliRk5pWlZoallVeHhZbGMzTXpOT1dGRRAB",
            "text": "I loved everything about this new spot in Flatbush. They were welcoming and offered me a sample of their flavorful chicken over rice, it did not disappoint. The space is new and clean with a lot of seating. I ordered the zilla signature burrito which is essentially a chopped cheese in a burrito wrap with fries inside. I can say this was 10/10 and the perfect portion size. I will be back again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSb2VUSlhRVGRETFVJNWMwRndRVVJPZWxrNVdtYxAB",
            "text": "The food is great- definitely some of the best halal we have had in the neighborhood. Both the chicken and lamb were well seasoned, the rice was fluffy, the fries crispy, the veggies fresh, the white sauce creamy, and the hot sauce is hot! The manager was very kind and welcoming, and his pride in his work came through very clearly. We will be back soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTVozSnhURWx0WVVsWFoydFJZVGM0TUVGeFQzYxAB",
            "text": "The food here is so good. The food is fresh, flavorful and the staff here is so friendly & accommodating. We had the Zilla Signature Burrito and the fries, 100/10. Definitely check out this restaurant if you want authentic Halal food. Looking forward to eating here again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWclpVOVdaa3R1UVV3NVFVSkpXR2R1YVRWQlVtYxAB",
            "text": "Amazing food, chicken or rice combo or rice and chicken wings. I tried it. It was amazing and delicious. I definitely recommend this to family and friends. Thank you grill team."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMVRYVXdhR3BWWVVZNExVZEtUbEp4V0RaQ2NsRRAB",
            "text": "Chicken over rice was good , the sauces white and green sauce made it even more better. And it’s halal"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeVkzSndOazFaVkd0MU1GWjVXV1psT1ZWbVEyYxAB",
            "text": "The best chicken over rice I had in my life.. first time writing a review for a restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UE4zVXhhaTFsY2s5bVdtWkVkbGxSYzJacFpGRRAB",
            "text": "Best Chicken over Rice Combo and the sauce hits different!"
        }
    ],
    "reviews_count": 17
}