{
    "name": "Gino's",
    "place_id": "ChIJu2urCEBbwokR_zGo-7WvJ3k",
    "grid": "BK9",
    "address": "548 Flatbush Ave, Brooklyn, NY 11225, USA",
    "rating": 4,
    "user_ratings_total": 275,
    "phone_number": "(718) 287-1277",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vdE9FTmxkakpHVTFCRFRUZE1TQzFQTnpRMlRtYxAB",
            "text": "We had a great experience, stopping in here to grab a pizza. We got a half pepperoni half cheese pizza and it was a figure around $17. The pizza came out within 1015 minutes and we were able to eat it on the tables that were inside the shop. There is not a lot of seating so it’s not a great place to sit down and eat but definitely a great spot if you wanna grab something and take it with you."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVVJqTlRTWFpEUWtKa1RXaGxURFZKT1hOc1kxRRAB",
            "text": "banger local italian place. came here the other day and got lasagna, and it was literally the best thing ive ever tasted in my life. i just reheated the other half of it in the microwave and it STILL slaps. i thought the price was a little steep but for the portion size youre getting, its definitely worth it."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNmFERlBWRFZoYjNwbldIRjFURzFEVDJST01VRRAB",
            "text": "My new favorite neighborhood slice. Classic NY cheese slice, perfect sauce to cheese ratio, excellent thinness."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUVVXbG9OM1pDYWpKcFJHZFZlR3RoYkRkSmNFRRAB",
            "text": "Best pizza and chicken roll great Costumer service not expensive"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Q1FURkVUMVV6Tmt4SWRsTXRjVTlSTlZoMFZGRRAB",
            "text": "Terrible customer service I am not sure if this shop is under the same management or owners but I have learned my lesson ordered from Uber on the app it states that the Pizza is delivered by store staff I get the pizza which is a disgusting disaster dough not fully baked and smashed in one corner of the box when I called to tell them their response is call Uber we don't deliver it which is an absolute lie I suppose we can't expect good service from people who are dishonest and if they can't own up to the truth and have to be rude I don't choose to eat anything else absolutely disgusted customer service and honesty matters I gave one star because you can't give 0"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NM1N6VnBZWFV5VkRReVpXdHJNbFI1WmtwTE0wRRAB",
            "text": "Really wonderful yet underrated place. They have good sangria!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSmRFZzNWWEJhZFVwdmEzTjFVbUpoT1doNlVXYxAB",
            "text": "I order from here often and the food is always very hot, well seasoned and generous with portions. Fresh and delicious!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKRHRoNnVuX3NlQ21nRRAB",
            "text": "Had their Chicken Parm, clams, and a few incredible cocktails. Everything tasted incredible and fresh! Highly recommend to anybody that is looking for incredible Italian food by prospect park! 🔥"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRDdsYjdIdnBEbHl3RRAB",
            "text": "solid pepperoni pie for delivery. best crust in the neighborhood for a slice"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJell0dHJRaUlTMlpREAE",
            "text": "How extremely disappointing this was. The pizza was incredibly undercooked. You pick up a slice by the crust, and the whole slice turns flaccid, allowing all the cheese and tomato sauce to fall completely off. The cheese and sauce doesn’t even stick to the pie! Are you kidding? How can you think that’s an acceptable way to send a pie out the door. Unbelievable. Would not recommend. I can’t believe I’m saying this, but you’re better off getting papa johns"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvZ3BUUWlBRRAB",
            "text": "The vegetable lasagna and the grilled chicken house salad were absolutely delicious!! My new goto for Italian!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MzQzUGRBEAE",
            "text": "A solid slice in the neighborhood. Great customer service. My go-to spot in PLG."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMWVfZ3pRRRAB",
            "text": "Everything was amaizing the service the food.\nI suggest you to go there."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeE4yNktREAE",
            "text": "Looking for classic Italian, look no further! Everything we ordered was super tasty and cooked to perfection. Our favorites were: mussels in white sauce, fried calamari, meat lasagna & lobster ravioli 🤌"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBaE9YNW5BRRAB",
            "text": "Omg, the food is awesome. Must try this hidden gem. Calamari, mussels, chicken wings and lobster ravioli, all delicious 😋."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bTdya3JnRRAB",
            "text": "Not only is the food amazing here! The drinks are amazing! Josie is the best bartender she’s very attentive, personable and her drinks are top tier especially with her twist of adding fresh fruits 🍉 12/10 no complaints you guys won’t be disappointed at all."
        },
        {
            "date": "10달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bE9MdWR3EAE",
            "text": "Yusuf Bey'in önerisi ile geldik çok memnun kaldık"
        },
        {
            "date": "10달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Mk1MWkh3EAE",
            "text": "Yusuf gardaşımın sayesinde geldim,çok iyi ,çok lezetli"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Mk1qLUJREAE",
            "text": "This is delicious"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bVAtbm1nRRAB",
            "text": "It’s absolutely awesome with everything and I really love their chicken pizzas"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQM0lMMWl3RRAB",
            "text": "Pizza is good its filling but the sauce the crust could use some work. Very convenient  location tho right next to the train perfect for when your on a rush"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM2Uyd2lnRRAB",
            "text": "The food is absolutely delicious.\nFrom the Shrimp Parmesan to their Chicken Florentine,  Fried calamari and I love their Baked Clams.\nThe waitress in the restaurant is a doll. I do all three, take out, dine in and have deliveries."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzX29Icl9RRRAB",
            "text": "Not too shabby, but def better pizza out there. I liked how doughy the slices were, but the cheese and sauce just weren’t doing it for me!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeUk2N0xnEAE",
            "text": "I want to say the food from here is great because most of the time it is. But I recently ordered pizza from here and I've never been so sick in my life after eating something. I have no idea what happened but something is definitely wrong with the pizza I ordered because I don't get sick eating anything else."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudnBXa0JBEAE",
            "text": "The food is mostly great. I don’t like that their prices differ depending on what menu you’re looking at. Feels a bit like bait and switch."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNid3BPMnRBRRAB",
            "text": "THE COOKS ARE AKWAYS FRIENDLY AND FAST WITH FRESH FOOD. LOVE THE BAR WHERE CAN I SIT W/MY FOOD & DRINKS."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOHZqSHR3RRAB",
            "text": "Always quick and consistent!"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib1lqUmRREAE",
            "text": "L’endroit le plus magique , avec une superbe ambiance , des serveurs top ! Un endroit local loin des bars aseptisés plein de touristes . J’ADORE"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyalpPQk1nEAE",
            "text": "Pizza was over priced and I’ve had better for cheaper just super oily by the way."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNXBuWFNREAE",
            "text": "I placed an order today for four slices of plain pizza, an orange soda can, and linguine alle vongole with white clam sauce. However, I was charged a price that differed from the amount listed on your printed menu. Upon calling your establishment, I informed the staff member who took my order that my soda can was missing, to which he indicated that he would contact the delivery person. After not receiving a callback, I contacted your establishment again. The same staff member mentioned that he would issue a refund of $1.25. However, I pointed out that the price of the soda can is $2.00 as per the printed menu.\n\nThe call concluded with me feeling deeply dissatisfied and requesting the contact information of the owner. The staff member informed me that the owner is in Florida and that he does not possess any contact details, which I believe to be untrue. I am deeply disappointed by the perceived lack of honesty and quality of service. Therefore, I intend to dispute the charges with my bank and cease patronizing your establishment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbnJES1V3EAE",
            "text": "Don’t be deceived by the size and lack of ambiance of this pizzeria ! The food’s very good which is what really matters. Large fresh clams not canned, came with olive focaccia. Only thing missing in my take out order was the grated cheese,under $20.Cash only"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5aDc2Z2xRRRAB",
            "text": "We've gotten delivery a few times. I always get the Pollo Inferno which comes in a super good and weird (in the best possible way) balsamic vinegar and cherry pepper sauce. It also comes with mashed potatoes and broccoli sides. My partner gets caprese salad with a side of meatballs which is good too. I'm taking off one point because the fried Zucchini had a bunch of lemon wedges shoved on top in the take out container so that when that dish came, a lot of it was soggy and had an overwhelming lemon taste. Still, I totally recommend this Gino's (which taste-wise I prefer to the much more famous Gino's in Bay Ridge)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5a3BlUC1nRRAB",
            "text": "Dough lacks flavor, sauce lacks flavor, cheese lacks flavor. Very greasy. Worst of the 3 on the block."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5OWY3alR3EAE",
            "text": "Purchase a Grandma's Pizza with extra basil and for the bacon lovers half bacon. You'll never eat another slice of pizza again. The experience is out of this world awesome sauce good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNkxyeHpBRRAB",
            "text": "Ordered the blackened chicken Alfredo pasta and it was great, very tasty and fresh. The chicken parmigiana sandwich was great !!! Garlic knots 1/5."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOeTRfTEpnEAE",
            "text": "Great restaurant and anyone who says otherwise may be lying ! Good taters milky and yum all around"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNXNyWmtBRRAB",
            "text": "Best pizza place in the neighborhood!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGMjh5TTVBRRAB",
            "text": "BEST PIZZA STORE IN TGE NEIGHBORHOOD EVERYONE KNOW TO GO HERE & NOT ON RUTLAND 💯"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaLWFybjNBRRAB",
            "text": "Very disappointed with my recent order. I came back from a 12 hour shift wanted to eat some food at home from one of my favorite spots I been there for graduations, birthdays , I always recommend this location to my family and friends and strangers for their lovely service. The owners a sweet man! HOWEVER I made a Yelp order thru Grubhub and the order came on time I tip the delivery driver however the food wasn’t the right order. I called the restaurant to let them know directly that the order wasn’t correct if I can receive the right order and I will tip the driver . I told them I can send a picture of email as proof that it wasn’t made correctly. And honestly I would’ve just eaten it but the order wasn’t what I was even craving or wanted. The guy on the phone said there is nothing he can do and just hung up. I called grub hub and the lord and told grub hub they are on their way to deliver my food. They said this three times however when I called I got hung up on and said there nothing we can do. On my fifth Grubhub call they finally refunded me my money. I was honestly disappointed because  this was a location I went to since I was 15, kinda sad this had to happen but it not okay. I was willing to take a picture email and even pick up my new order or tip the delivery driver but I was told my order wasn’t wrong. That’s not how you treat a customer especially a loyal one. I hope there a better solution however as of now I won’t go until then."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNUpxVktBEAE",
            "text": "Trash pizza. Should’ve know by the cheap pricing.  Better off with a dollar slice.  Pizza barely came cut.  Ordered toppings on one half. Received full toppings.  Doughy and greasy.  Trash"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcHFmNTdnRRAB",
            "text": "I loved  coming  to gino they had a very nice fun bartender I think her name was qee I had so much fun doing karaoke 🎤 were is she"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4d0pTeFZBEAE",
            "text": "TERRIBLE!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4d0pTNFlnEAE",
            "text": "MAGGOTS IN PIZZA DO NOT BUY FROM HERE!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4d0xpdFVREAE",
            "text": "DO NOT ORDER FROM HERE THEY WILL TAKE UR MONEY AND NEVER DELIVER UR ODER BEWARE IF SCAMMERS"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4d0xqbWtnRRAB",
            "text": "Terrible never order from here"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4d09qTmtBRRAB",
            "text": "Terrible service I ordered online I didn’t get my food they’re not answering the phones after they told me they would call the the driver to see where my order was! DO NOT ORDER FROM HERE IVE BEEN WAITING 2 HOURS FOR NOTHING"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSallyWURREAE",
            "text": "Joke! They want $13.75 for a garden salad with two topings and it is deli lettuce not even anything good. WoW definitely never ordering from them again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSc1BXWjdRRRAB",
            "text": "Great pizza! Made out of stone oven! Taste delicious!\nPlace is a bit small though"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSblppSWNREAE",
            "text": "The service is outstanding, phenomenal and the young lady serving my friend and I was the best."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSM3ZHcmhBRRAB",
            "text": "Food is delicious and well cooked. Please go here !!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXcThmNF9BRRAB",
            "text": "Food was Amazing. Service was excellent\nIlan was very attentive and helpful!\nTortellini Alfredo with chicken & mimosas perfect brunch! Props to the kitchen!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3LXVtb09BEAE",
            "text": "Stopped here on the way to Kings theatre to grab something quick before going to see a show. The staff was friendly and welcoming and the restaurant itself was pretty cozy, but the pizza was pretty boring. Nothing special here if that's what you're looking for, but it's not bad if you're in a pinch and need a slice.\n\nPizza Adventures: Destination #77"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtaS02eDB3RRAB",
            "text": "Stopped by Gino’s on the way to a show at Kings Theatre and the food was - and I cannot stress this enough - DIVINE. I’ve been to Europe recently and somehow this white sauce is the most memorable; the garlicky lemon saturated each mussel. We even dipped the calamari - which was crisped to perfection - in the sauce, too. The eggplant rotini texture was deliciously soft and not mushy. Our server was kind & accommodating and made the perfect lemon drop martinis. The bathroom was also clean and pleasant. My only complaint is my vegan friend didn’t really have any options to choose from. I would dock a star but Gino’s deserves more than a 3.9 rating. I think more vegan-friendly menu items would be an appreciated addition. Thankfully the bread was delicious & enough to satisfy her during out short visit. Safe to say I’m coming back next time I’m in Brooklyn!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpZ2Z1U213RRAB",
            "text": "I always loved this pizza and considered it one of the best around.  I have been purchasing at this location since I was a little girl.  Today, I am disappointed because it appears the sauce has changed. The last time I tasted the pizza I…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReTZxVUt3EAE",
            "text": "Firstly, Google has the wrong placement but the right address for the icon. This sleepy little gem is up at Lincoln on Flatbush where Washington starts. The restaurant is actually two: brightly lit brick oven pizza on one side, an elegantly lit restaurant and bar on the other.\n\nSecondly, the food is tasty and decently priced as well as plentiful. My girlfriend and I came out on a Monday night. There was no crowd and the owner talked with us about how the neighborhoods is up and coming - he's been here for twenty seven years. The waiter and hostess greeted us with kind smiles when we walked in and the waiter was always there to perk up the dish with fresh pepper.\n\nAll in all, I'd say that it's an excellent restaurant. Well worth your hard earned cash."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdWIyX25BRRAB",
            "text": "The mozz sticks had a crisp exterior and that deliciously gooey cheese you can pull an arm’s length away from your first bite. My daughter who never eats pizza crust found herself devouring her Napoleon pizza’s hand tossed crust; it was that perfect combo of crispy and chewy. The cannoli cylinders were crisp and subtly sweet while the filling was silky, creamy ricotta perfection, almost like a custard but more dense and rich, with these chocolate morsels that melted upon tasting their dark sweetness. Everything tasted great.\nBest of all was the service: a kind and attentive waitress whose name I failed to get. I’ll ask next time, as my daughters asked several times that we return. We will definitely be back."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dTRTWWFREAE",
            "text": "The food ...service... and atmosphere was wonderful.. The best fried calamari that is not like rubber, but perfect in texture, that almost melts in your mouth. Everything ordered by myself and friends was very good, from appetizer down to desert and coffee. Everything was authentic Italian food, served on time, with good friendly, and helpful servers. This was our first time, there but it will not be our last. We also loved the intimate and cozy atmosphere with low lights and small candles on the table where we were served. The owner even spoke with us and introduced us to another customer who was a 30 year customer with his family..(imagine meeting new people like they were your friends.)  I came here by word of mouth, and now I will tell others. My New Favorite Brooklyn Restaurant. Gino's Trattoria = 5 stars..."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrdWY2STZBRRAB",
            "text": "Pizza was decent but a few things ticked me off. First, the large pizzas are pretty small. Second, I ordered for a birthday party for little kids and specifically asked for it to be cut into smaller slices several times and it came without…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cXJYcTFnRRAB",
            "text": "Gino’s has been my go-to Pizzaria for some time and today’s experience was unique. I initially tried to reach out to the company by phone but was hung up on and couldn’t get through when I tried calling back afterward until the third time.\n\nI made a special request under an order for the delivery of garlic nots to come with extra sauce. Upon arrival, there was no sauce. So I called to ask if it was a mix-up. I also noticed that my pizza didn’t appear to have been made nicely either, as some of the toppings were not diced or cooked through.\n\nWhen someone answered, they couldn’t be bothered and just said someone would bring a sauce and hung up on me before I could finish my questions. On the third time of calling back, I got a response, and they were aggravated. I just told them not to bother sending someone back. I do not want food coming from someone uninterested in their customer's concerns."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOGV5RTR3RRAB",
            "text": "One of the best Grandma slices I have ever tasted.  I know people say that but like really though. The cheese to fresh sauce ratio is spot on and that cruuusssstttttt...chef's kiss. Do yourself a favor and get you some!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbGEzT1FnEAE",
            "text": "They deserve ZERO STARS. Food is OK some days and other days NASTY. Do yourselves a favor and DON'T bother ordering with a large bill because even when you tell them to bring change they say OK and then once the delivery guy gets there and you hand him the large bill he looks at you like you've got two heads and says he doesn't have change. When I call Gino's they tell me to give the delivery guy the money and he'll bring me back the change. YEA OK. Once I ordered a side of garlic knots they forgot to bring them. I called them and they said they would send someone out with it. Hours passed and no one came . I had to go down there and get my money. SO UNPROFESSIONAL!! They don't even bother to heat the food up at times. And other times the pizza is so soggy from all the grease and other times it's burnt! Smfh. I used to love ordering from them but I won't be anymore until they get it together because it's just a waist of time."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRc29DbGZnEAE",
            "text": "Good place for small out of the office meetings. Or if you just want an after work get together. Delicious food as they offer a variety of selections paired with a nice atmosphere. Friendly staff who offer great service and welcome you each…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3OWVXclVREAE",
            "text": "I liked the relaxed atmosphere. The patrons and staff are very welcoming. The food was excellent, I had the mozzarella sticks. The fresh bread with olive oil & herbs was good too. I definitely plan to go back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2ajZILWVBEAE",
            "text": "I enjoyed delicious spaghetti with meat sauce with a side of vegetables. Healthy olive oil is used and most likely all of the meals are yummy at this intimate cozy restaurant. There's a varied choice of foods. Everything is clean and the…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNN19YNXF3RRAB",
            "text": "I just went here on Sunday December 8th and order a Hero Sandwich. It was the Chicken Parmigiana to be exact. Once I got home I started to feel strange. At the middle of the night I started vomiting, even the color of my urine change. It’s cleared that I had been food sick because of what I ate from this establishment. I kept with this symptoms the day after, it was so bad that I wasn’t able to go to work. Thank God it only lasted one day and I didn’t got hospitalized. I’m definitely not going back to this establishment, since they don’t know how to handle their products. I don’t advise anyone to go to this establishment and if you go, let me tell you is at your own risk. They don’t even deserve a star."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMTZhWmZBEAE",
            "text": "I have been going this place for a few yrs because I live nearby.  The food used to be good that’s why I gave them one star, but it is now tasteless.  Most importantly their customer service has always been horrible.  They always have an attitude, are rude, and don’t listen to your order or directions.  My husband says they are rude as well; they were argumentative and hasty when he tried to place an order over the phone.  They are very impatient and rush you when you’re placing an order, but it’s never packed or busy inside the pizza shop or restaurant so I don’t know why they behave like this. Today I tried placing the same order I have placed for the last 4 yrs with them and they said they do not make that and I need to call the restaurant and then they hung up. I will not be going back. They lost a few customers today."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndE5hN0JnEAE",
            "text": "Great place pleasent staff and food is awesome"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNWE2VDJRRRAB",
            "text": "Brick oven pizza here is on point — hands down.\n\nThere are a few other spots around the neighborhood that are solid, but some of them aren't brick oven. You don't get that char every now and then on the crust. Gino's knows how to cook it up.\n\nI have to be honest, I've had a few pies from here, but my favorite is a classic margarita. They really have the sauce dialed in on that pizza, so if you wan't that classic garlic heavy tomato sauce and fresh basil with the globs of mozz on the top, then this spot will scratch that itch.\n\nService every time I go in is always really friendly. There aren't a lot of places to sit inside. Just a few tables, so it's not really a go-and-hang-out kind of spot. Perfect when you want to grab a pie and walk it back to the apartment if you live in the neighborhood or want to take some food up to Prospect Park."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURraWZxa2VnEAE",
            "text": "I’ll first start off by saying, the food IS good. However, the service IS terrible as well and it’s not worth going to this place to be VERBALLY ATTACKED by the bartender. I placed an order to go from the bartender with glasses. I’m not sure what I did to him but he placed my food on the table and proceeded to do whatever he was doing at the cash register. He didn’t say “here’s your food,” or anything. He just left my food on the table which was absolutely fine. As I picked up my food to leave he sarcastically yells at me “You’re welcome!” I STILL said nothing to him and proceeded to leave. As I’m walking towards the door, he’s talking OBVIOUSLY loud enough because he wanted me to hear him. He’s talking to another patron about me saying “She has a bad attitude!” Again, I said not a word to the bartender the entire time... is it my imagination that I’m supposed to please the bartender when I’m the paying customer? The people who work at Gino’s are a reflection of the establishment.  If it’s ok for the bartender to bark at and talk poorly to one customer to another customer then please believe the bartender here one day might do it to you as well.\nAgain, the food is good/ amazing but, it’s not worth paying for AND getting cursed out by the bartender. 👎🏾👎🏾👎🏾"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBN29PWlpnEAE",
            "text": "I've ordered twice from here. The first time was a pizza pie half white/half cheese. The pizza was bland without any flavor at all. A great disappointment. my second and last order was for chicken calzone, chicken roll and two slices. I…"
        },
        {
            "date": "13년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbHUtR2J3EAE",
            "text": "One of the best pizza places in Brooklyn, and there are very few. I must say say their pizzas are not as good as they used to be, but they are still better than most pizza restaurants I have been to in the entire 5 boroughs. The guys there are friendly and serve very fast."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnaUk2UmhBRRAB",
            "text": "Neighborhood authentic Italian restaurant. The food is prepared fresh either by the owner or the chef.  Gino greets and treats everyone like family as does his wife. Nice atmosphere and great food.  The prices are reasonable and worth every dollar. I recommend it highly."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpcm9XRDV3RRAB",
            "text": "I have had a very positive experience at Gino's Pizza.  They have tasty pizzas and decent prices.  I would certainly go there again.  Perfect place to pick up pizza to take to the park.  I have even asked them to deliver to an event in the park, and they did.  Their Grandma pizza is right on."
        }
    ],
    "reviews_count": 73
}