{
    "name": "Culpeppers",
    "place_id": "ChIJG9-BKW5bwokR_KjbhhaMqvs",
    "grid": "BK9",
    "address": "1082 Nostrand Ave, Brooklyn, NY 11225, USA",
    "rating": 4.2,
    "user_ratings_total": 515,
    "phone_number": "(718) 940-4122",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGS01WUmxPVGxuU0doVGNrSnBTamt6V2xBM1VXYxAB",
            "text": "This is favourite place when I want my Bajan Delicacies, especially the cou- cou and the souse"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTVdtdHJjMmxpYkdGak9GY3RSR2h2YjFkR00wRRAB",
            "text": "Ordered the stew pork, she literally put only the fat and bone in the container. It's my fault for not looking at what she was dishing out. What server doesn't give you a mixture?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdmFuUnhjMFJEYzNoQ1p6WkZUR3Q1U1RscVprRRAB",
            "text": "Yum 😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTlFqZ3hjV1l0WWpsME9YUlFXamRyVGpNNVJVRRAB",
            "text": "I had the coucou and red herring yesterday and it was so delicious. Haven't had this delicacy in years. The staff is amazing and the prices are great, would highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJdGQwUTBObXRvYlhCb1UySlZaRWRVWXpnd00xRRAB",
            "text": "Went there with my Aunt who is bajain like me and this place reminds me of back home with a variety of things to choose from to eat and drink."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdFpsOXVTV2xqVVRoRU0zVTBiMDFSVW1KME1WRRAB",
            "text": "Good amount of spices"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUWF6QlhkbEpoVkc4MVZHRjJPVkpuUjBOb2JGRRAB",
            "text": "The food at this place has s extremely good but the service is not the best there was this lady there that had a crazy amount of attitude for no reason at all.And the place is extremely hot and needs air conditioner especially when the weather is 86 degrees. I would recommend getting better service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TlkyRjJUVWxwZWtFeVUwdDZaMkZTVjFwUlNWRRAB",
            "text": "Bad option to pick up."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVb2VqbGxBRRAB",
            "text": "We placed an order with Ms. Loo, and when we got there, she took great care of us! Thank you!\n\nI was shocked that the fish cake price increased from $0.50 to $0.80... inflation at its finest."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLXFDNWJ3EAE",
            "text": "The staff was extremely friendly and the food was delicious. I was visiting NY from another country, and very quickly, the friendly staff engaged in conversation and provided top class service. Dinner one night, lunch the next day, and a takeaway of mauby and turnovers."
        },
        {
            "date": "수정일: 7달 전",
            "language": "fil",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbnNfWEd3EAE",
            "text": "Food goood"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRLWZiZHRBRRAB",
            "text": "My girlfriend is Bajan and all she spoke about this spot for the last 5 years and desperately wanted me to try it. Of course, I was excited LOL but all for nothing. It was decently flavored but I never had a roti with various sized bones in it. My girlfriend even said she doesn’t recall the roti’s having bones in them. It really wasn’t enjoyable struggling for my life trying not to choke on bones. Eventually I just threw it out. Top of my mouth all scraped up. Not sure if this is a normal thing for them or if they’re just too lazy to remove the bones. Either way, I’m just never eating here again..ever. Atmosphere was cool and the People were kind so it’s no complaints about the restaurant itself but It could be the simplest things that just turns you off …and picking bones out of my food for 45 minutes really kind of pissed me off."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnZzUzdnh3RRAB",
            "text": "The curry goat and oxtail here are to die for. The baked goods are great. But I urge you to get some cou cou and fish cakes."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdEtLaXl3RRAB",
            "text": "I ordered pudding and souse which was very salty.  It was hard to eat it due to the excess salt."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdE5HZ0lnEAE",
            "text": "The food is delicious!!!! There are a couple of seats but I always get my food to go!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQdHVybS1RRRAB",
            "text": "The food is okay, I've only had Rotti from there. My last vist was just that my last. The attitude of the people who work there is horrible. I can say the woman with the glasses is usually nice but the one with the fake eyelashes does not need to work with the public. I don't feel I should spend my money in a place where I'm not treated well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOXZ5aE5REAE",
            "text": "I bought brown stew chicken which was tasty and well seasoned. The tie leaf was also very tasty. However, don't expect a smile from anyone working there. They always look stressed. The \"hello\" is on you. They take your order, fill it, take your money and give you your change. No smile. No thank you. No have a good day. Good food though. Just don't expect to get that welcoming feeling there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMFlLZHFBRRAB",
            "text": "they sold me  3 cake slices  and each one of them had black  mold on it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMDR5VVRBEAE",
            "text": "I visit here a couple of times and each time I go to the lady seems to have an attitude I don't know why the food is okay I wouldn't say it's all authentication food but it's good if the young lady the light skin one with the long fake eyelashes would just stop having an attitude it will make the visit better. But I do like to come here and get my lead pipes and my fish cakes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbXFDcVlnEAE",
            "text": "Had a pudding and souse without the pudding and a frutee.\nThe cucumber had turn to mostly water and had no flavor. The pig was hairy like it wasn’t clean properly. The pig had no flavor. Pig tasted and looked old. Had mostly bone in the bowl and a lot of fat being passed off as pig. Wasted $9. The only reason for the two stars is the drink. It was awful. And the servers were rude. Would not be back for anything else. Guess you got to be a regular or  friend of the owner to be given a good batch of souse. I’ll be back to update if I feel sick after a few hours or days ."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDcXVPdWV3EAE",
            "text": "Food is tasty and priced competively. This place can use organization and process flow."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNmFDRFFnEAE",
            "text": "Staff was not courteous, somewhat rude."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidVk3Wlp3EAE",
            "text": "I like the wide selection of fruit fillings in the turnovers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMk5PMUxnEAE",
            "text": "Love the oxtails, peas and rice, and vegetables."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4N2NXLWRREAE",
            "text": "Food is great. Wait time a little long. Staff is pleasant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyclAzSk53EAE",
            "text": "If I could give it 10 starts I would\n\nHad the oxtail and she gave me some delicious fish cakes\n\nCan't wait to come back on Saturday to try the pudding and souse with some Mac pie on the side cause why not"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcGRuVERBEAE",
            "text": "I love ppl from Barbados 🇧🇧 and there food the #1 place in bk"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMU9lUHNBRRAB",
            "text": "Got my hot 🔥 Bajan pepper sauce !!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURULV8zZVV3EAE",
            "text": "My dad who is Bajan brought me here and the food was 😋 I had cou cou and snapper and it was savory and hit the spot. I will be returning"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUXzluWDlnRRAB",
            "text": "Such delicious food! So well favoured and not heavy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5elBybjRBRRAB",
            "text": "I come here for Souse Saturday.  Be sure to shake up the container to disperse the spicy cucumber marinade.\n\nRecommended:  drink some Prosecco or carbonated water to counteract the richness of the dish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkaF9UcUVnEAE",
            "text": "I'm always going to support the Bajan massive. I got the flying fish sandwich and it was 'almost' like I was in Barbados. I will be back for my next sandwich and macaroni pie."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxN1l6QU13EAE",
            "text": "The food is awesome. Great Bajan spot, pudding, and souse is the best."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxem9qU3pnRRAB",
            "text": "#TGTG -This appeared on my app, so I couldn't tell if it was a restaurant or a bodega, however I digress. I got a healthy serving of rice, meat and fried dough balls, which were fantastic. While the rice were cooked properly, as a South Asian, i prefer basmati rice. Overall I felt satiated from the meal and the staff was courteous and gave me the order in no time :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdFBiSlN3EAE",
            "text": "Best Bajan Food in NYC!  Consistently quality food for decades because it is a tight-knit-Family restaurant that takes real pride in its authentic and delicious cuisine. I’ve eaten here easily 100 times and NEVER been the least bit disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxck1fcUx3EAE",
            "text": "Love it here"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpdnFHQXBBRRAB",
            "text": "Good Caribbean food. Pleasant place to get food. Great and friendly service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsenBTN2JREAE",
            "text": "I can't tell you how nasty my food was. Order delivery of curry goat roti, it smelled wrong (not gamey but rank) and there were crunchy bits in it. I couldn't even be bothered to deal with complaining to them directly because I ordered via GrubHub. I'm so disgusted. Would not recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGeDdMYUdBEAE",
            "text": "The workers can be kind of rude but there are at least two people who I have had a good experience with. The food is good, I think it also depends on the time of day that you go. The atmosphere is kind of small for the amount of people that come in but it is what it is, you order wait for your food and go."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1cXNiQXVBRRAB",
            "text": "Vsiting  New York always ends with delicious delights from Culpepper.  Mauby, turnovers, cassava  pone,  conkies ,fishcakes and I must get the souse for my husband. It takes me back to Barbados."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aE1maXB3RRAB",
            "text": "I've been coming here for years and I just love being recognized as a regular by Dave at least. The food is good and is the closest thing to quick home food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1eUlUdmZ3EAE",
            "text": "If you don't get anything else, you must buy cod fish cakes!!!! They are the best in comparison to my MoM."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadF8yQzFBRRAB",
            "text": "Est. 1998\n\nLayout/atmosphere\n*Bajan (Barbados) half bakery/half luncheonette; electronic kiosk for ordering by door; one table; three stools\n\nService\n*Solid\n\nFood/drink\n*Goat Roti (buss up shut paratha roti) - good; not too spicy\n*King Fish Cutter (lettuce, tomato) - good; roll was doughy, little sweet (fell apart towards the end); lettuce was Romaine; fish tender\n*Macaroni pie - solid; simple"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaODRtcXZRRRAB",
            "text": "I WAS CRAVING COCONUT TURNOVERS, SO I DECIDED TO ORDER SOME. I FIGURED EVERYTHING WOULD BE FRESH SEEING THAT IT WAS A SATURDAY.\nTHE TURNOVERS WERE AT LEAST 3 DAYS OLD. NOW WHY WOULD YOU SELL STALE ITEMS. THE CURRANT SLICE WAS EXTRA SWEET AND FULL OF ESSENCE. THE HAM CUTTER HAD 1 SLICE OF HAM, 1 SLICE TOMATO AND 1 WILTED PIECE OF LETTUCE.\nNOTHING WAS SALVAGEABLE.  CULPEPPERS USED TO BE GOOD BUT NO MORE. SAVE YOUR MONEY AND GO TO ALLANS BAKERY A BLOCK AWAY OR SVG BAKERY A COUPLE BLOCKS AWAY. WORST $47 I HAVE EVER SPENT. NEVER AGAIN."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbmRqQzl3RRAB",
            "text": "Cou cou was delicious. Their Sorrel is healing to the body."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacE1IQjNRRRAB",
            "text": "I can rely on getting a good meal here. Plus I support my Bajan culture. Fish cakes and roti are my go-to but just about everything else here is delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNXVlN0V3EAE",
            "text": "Unfortunately my review is based solely on service, and because the customer service was poor I didn’t purchase anything at the restaurant. Maybe that’s my lost but that’s also theirs as a business because the person at the counter should be welcoming, have a smile on their face, and interact with the customers not look like they hated being there. The person that came out the back looked way more welcoming. That lady at the counter set the entire tone for the atmosphere. The customer service isn’t warm, nor inviting. I accompanied someone and they made purchases only because they came from out of state to do so, I changed my mind after entering the store and getting the vibes after seeing the lady at the counter. I’m hoping she was having a bad day and this isn’t a usual thing because I heard the food is really good and this won’t be good for business."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacEplekZnEAE",
            "text": "Fish cakes perfect. Best peanut punch ever!!! Cheese cutter qnd strawberry puffs amazing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaVlpZDNRRRAB",
            "text": "Bought pudding and sous today and the pudding was fried and very, very greasy and, the sous was bones and pieces of gristle with a few pieces of cut up parsley and I guess cucumber.  It was so tasteless that I cannot tell exactly what it was.  This was the WORST pudding and sous that I ever had."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNGZmY2x3RRAB",
            "text": "Best food Caribbean style"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcnVpdl9BRRAB",
            "text": "Had cou cou and kingfish. Family had snapper, macaroni pie and roti.  Great reminder of back home.  I would recommend this to anyone looking for Bajan cuisine."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbTR6RnVRRRAB",
            "text": "Took the ride from Harlem down to BK, to try Culpeppers. Had no idea it was a take out spot. The food was at best average. I was expecting more. Nothing like official Flying Fish In Barbados. Definitely wasn't worth the ride."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyd3NpTmJnEAE",
            "text": "love this place, my family has been coming here for years!! food is always excellent and authentic bajan food. i love my culture!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyZ0xhRWlRRRAB",
            "text": "Incredible, the portion was massive and the chicken was fall off the bone tender. Plantains were excellent as well as the rice. A+ hope to visit for lunch!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDMXVXdzZRRRAB",
            "text": "Bread fruit cou cou and saltfish were great pigtails and macaroni pie the best. While this isn't a traditional combination it has become a favorite taste buds explosion."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLNU5mRVBREAE",
            "text": "Love Culpeppers and supporting fellow Bajans. Just picked up 100 codfish cakes for a small family function tonight but usually i have some for breakfast w my eggs."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBa0p2SWpnRRAB",
            "text": "Delicious food that's worth the wait. Bajan cuisine."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNNzlUZm1BRRAB",
            "text": "Very Tasty Trinadadian Food!\nYou have to try the Cucumber Ginger Punch!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNjV6SUVBEAE",
            "text": "I ordered the stew chicken and couldn't believe what I got. It was not chicken parts but ground up pieces. There was so much bone pieces in it I might as well have been eating fish. It is a good thing I was not sharing this meal with a…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhc0xqanBnRRAB",
            "text": "The fish cakes were amazing and inexpensive. Reminds me of Haitian marinade. The fish cake was fried but not too hard, just spicy enough, well seasoned, not overpowering and not greasy at all most importantly. It's a great quick snack which…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbHJ1UjJBRRAB",
            "text": "Went here expecting authentic bajan food but it was so disappointing… I think they gave me spoiled rice, it was mushy and smelled spoiled after a 30 minute drive. I asked for ribs and the lady gave me dried out beef ribs and used the sauce to cover it up. I bought salt bread outta good faith- it might as well be rock cake cause the bread was dry and stale. There were flies on the pastries on display I shoulda took that as a warning. -Red flag #1 smh just disappointed was not worth the trip"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1Z3ZTMVlREAE",
            "text": "This was my first time going there. I did take out. Most of my favorite food choices were sold out. I learned from the staff it's best to call in your order for pickup early when the open up at 8am.\nThe food was great. I will definitely be calling in my future orders ahead of time."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLd05Lb3VnRRAB",
            "text": ".The souse was on point! Delicious just like I remembered it to be,Thank you🙂The cou cou however,  was like a cake no flavour. Dry n hard. There was no okras in it that keeps it wet and slippery.All of them were outside in the gravy. Even I…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZa3J6RXRRRRAB",
            "text": "You can find Bajan dishes here like pudding and souse, cuckoo, fish cakes and more. Depending on how much people come to order you may have a bit of a wait but good food takes time. Baked goods are made fresh and tasty like turnovers (a…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpbXNUZUl3EAE",
            "text": "Very Salty, cod fish taste as if it was thrown directly out of package with salt and all. Unwashed and no salt boiled off, my mouth is on fire from the excessive salt and my blood pressure is high.  same with the fish cakes. and I'm not going to mention the three oxtails that was also not cleaned. Never Again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbXJuc1FBEAE",
            "text": "First time ordering food from this restaurant. I ordered the curry chicken with rice and peas and stewed okra. The chicken was very tasty and well seasoned. My sister said the chicken, \" fell off the bones\". I liked the type of curry…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodGMzYld3EAE",
            "text": "My favorite and probably only Bajan restaurant I know that sells souse! So good and the fish cakes are amazing. I looked forward to ordering here, every Saturday before I moved."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJcE4yemxRRRAB",
            "text": "This is my go to place in Crown Heights for caribbean food. I love their okra and fried sweet plantains. Their oxtails are delicious but could be made more tender. I love oxtails that melt in your mouth. Their king fish is hit or miss…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnd1lqQjdnRRAB",
            "text": "Love, love, love their fish cakes which are good for party trays. Some of their baked goods are great as well. Tried an oxtail dinner once and was not impressed on the skimpy portion, so never again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlX01iXzlnRRAB",
            "text": "Worst Bajan restaurant in Brooklyn. I waited for 1 hour for my food, no explanation. The lady with fake eyelashes horrible, nasty attitude. They are so slow in there, they need to hire new professional people. They are unprofessional there. Never again will I eat there. Horrible."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndjZ2OC1RRRAB",
            "text": "I finally found a good Bajan restaurant to satisfy my craving. Fish cakes were hot and fresh, they tasted just like the way I had them in Barbados. Their macaroni pie was good too, I just wish it was a little bigger inside to dine in. It's definitely worth the train ride from New Jersey!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRd3VqQU9BEAE",
            "text": "This review is related to a seamless order. I ordered two entrees and an appetizer from Culpeppers. This was my first time ordering from this restaurant. There was also a $3.99 delivery charge plus a required $4.07 \"tip' Although the food came on time, only one entree was in the bag. I immediately called the restaurant and was spoke to the woman who answered the phone. Not only was she rude and her tone was off, she told me that they were closing, didn't have my second entree and because the store was busy, she was unable to call and let me know before the delivery was made. As I was expressing my frustration, I was told that I needed to contact Seamless for a refund and was hung up on. This place was totally unprofessional. I have used seamless on multiple occasions and when a restaurant does not have the items ordered online, they call and ask for substitutions.  Culpeppers did not do this and was rude in their communication. I will never order from them again, or recommend them to anyone."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCc1BQNTFBRRAB",
            "text": "As a bajan, when I'm in New York, especially on a Saturday i have to go to Culpeppers. I have to have their pudding and souse, my family loves the cornmeal and breadfruit coucou, the pigtails, the turnovers, the jam puffs...i could go on. Point is the food is excellent, staff is friendly and efficient. The only thing I wish is that there the option to sit-down and dine in."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPN1BhY2hBRRAB",
            "text": "Please remember when ordering that this is Bajan cuisine and not Jamaican. If you are not Bajan and use to eating Jamaican oxtails then it will shock your taste buds.  It’s good, however you just need to be fully aware of the type of Carribean food you are ordering in order to truly appreciate it."
        }
    ],
    "reviews_count": 74
}