{
    "name": "Katie O Soul Food",
    "place_id": "ChIJi_PHqXpbwokRIASY03NGLA4",
    "grid": "BK9",
    "address": "452 E New York Ave, Brooklyn, NY 11225, USA",
    "rating": 4.2,
    "user_ratings_total": 414,
    "phone_number": "(516) 669-9941",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnemVESjJlak42YlZwaFJURm5WVmRmT1VWcE1VRRAB",
            "text": "I really wanted this to be good, and it has to potential to be😭. I think they might have just had a bad night? (Or because i ordered via doordash at 8pm?)\nLets start off with the positives\nThe cookies and cream pudding was out of the world amazing.\nThe cornbread stuff was also a 9/10\n\nThat being said -\nTHE FRIED CHICKEN WAS THE Weapon on that formed against my blood pressure. It was salty beyond belief. It was also bone dry (but still had good flavor)\n\nMac snd cheese was just a rub filled with oil and salt.\n\nAll in all this spot im sure is good, i think i just happened to get the last of the food going out that night."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wemIxQnZYelpVTlMxTmVuSjZMVXRTTmtGVWQzYxAB",
            "text": "Accidentally stumbled upon this place cause i noticed the long line...i dont usually do long lines but it was worth the wait. Friend staff and folks on the line were cool."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oclJsSm1kR2x4WjFCc1JURlplVUpGYkRGalRWRRAB",
            "text": "Food is fantastic"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNd1N6SkdSMGhXTkRKeVl6VnpVMTl1YzJOcUxYYxAB",
            "text": "We visited this spot based off of an instagram review. While visiting NY, we made this one of our stops. The food was good. I really like that they willingly allowed my friend to change her order because she didn't like what she had. It was actually a mistake on their part because they took the order down wrong. Anyway, the five of us were pleased with our meals: BBQ turkey wing platter, fried catfish platter,  fried chicken wing platter with greens, potato salad, Mac & cheese, and mashed potatoes. I gave 4 stars for the food only because the roll they give you is so small its almost bite size. All the platters seem to be $25 +tax, and I feel they could come a little better with the bread. The chicken wings were rather small too.\n\nThe atmosphere is not bad but the place is more of a carryout type establishment and they only allow so many people inside at a time to order, so it can get a little cold standing outside on a rainy day trying to place an order. Plus they opened a few minutes late. I did like that they brought samples of the dessert for the day out for us to try, even though I didn't eat one. I dont like strawberries. It wasn't the best I've had, but overall, I would go back and recommend."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUVRYTk9NMDVuWmw5dE9UbFFPRWRXT1RKWmFHYxAB",
            "text": "I came here with my friends because we saw it on tiktok and wanted to give it a try. I ordered fried chicken, mac & cheese, cornbread stuffing, and soul punch. We waited almost an hour for our food which wasn’t an issue because we weren’t in a rush and they seemed busy. Our food was ready and we sat to eat excitedly, and to our disappointment the food was extremely underwhelming. The chicken was overcooked and dry, the mac and cheese was overcooked and was chunky, and the cornbread stuffing just didn’t taste good. The soul punch was not too bad but it was just extremely sweet and tasted plastic-like. We were really disappointed because tiktok said it was good and there was a lot of people on line for it so we expected good things from this place, but unfortunately it was not good at all. I’m sure many others think that the food is good but to me and my friends the meal was a huge disappointment and definitely 100% not worth the $32 payed. Overpriced and disappointing!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZdFVXUkNVUzB0ZFZwak4xQlpkSGRmYkhKaFRFRRAB",
            "text": "I dont know why this place has 4.2 stars.\n\nThe wait was almost an hour which is fine, understandable because theyre a small business with not much space and limited staff.\n\nThe food was just not worth it AT ALL. I got a platter that came with 3 fried chicken thighs, mash potatoes with gravy, and candied yams, as well as a bottle of soul punch.\n\nThe candied yams were basically mashed and so incredibly sweet that i could not have more than one bite of it. Not to mention how oily they were.\n\nThe fried chicken thighs were dry. It was overcooked so much that it was chewy, and only the middle was somewhat juicy. Unsure how you mess up chicken THIGHS that are literally always juicy and almost never dry. And the seasoning wasnt outstanding either.\n\nThe mash potatoes were the best thing i had and it wasnt even crazy, they were just mashed potatoes. You cant really mess that up.\n\nAnd lastly, the soul punch was nice and sweet but had a plasticy taste. Not sure if it was the plastic bottles they used or the actual juice but again, i dont know if its a good value for $5. I had to hold my breath to drink the juice.\n\nIm disappointed that i paid $32 for all this food. It wasnt even okay to me, it was just bad and not worth it at all. Im sure some people would enjoy it as there was a very long line."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbGNtNWtXbFp1V0hGYVNqbGljRTB5VUZOVVdsRRAB",
            "text": "Wasn’t able to order line was too long"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Fd1NsRkZUMkZYYkhGemRFVkhkamRJWDBzeVEzYxAB",
            "text": "It was a Brooklyn ambience  great people,  good music, and awesome food. It was worth the wait."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWk15MUNRVE5vYzJSUVFqbDZUMHcxTWpOMU9YYxAB",
            "text": "Amazing food!\nGreat customer service!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWmNreEpjM2xyT1VadlJrTTJVRzlSUkhsbWIzYxAB",
            "text": "When you come here, don’t expect to get your food right away because they don’t compromise and they make the food fresh"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTmRYUTNTbU42ZUVwR2NESlhXR3hYYmtsS09GRRAB",
            "text": "Stuffing is very good turkey wings also yams are good that's what I had when I went there 3 times.Had to stop going once they started cancelling orders online after I waited a day for the order. That means they are getting too big for my money. I love and support good food and black owned but cancelling orders not taking phone calls is not good customer service"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMVZ6bHVNMFkwYzNsa1ZYTkNURkpaTUU0dGNGRRAB",
            "text": "This restaurant Blasting music with a DJ EVERY FRIDAY- sat and sunday ! Is soooo inconsiderate… You guys have Zero Respect for the neighbors. This is NOT how this zone is… Keep in mind theres plenty of ppl who work from home , the library, and Elders … ITS VERY SELFISH."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWM1VIbFJlbVZvYjJvM1pXcElSbWROT0UxdVEwRRAB",
            "text": "Food was limited because I came late. But the fish, shrimp, smashed potatoes and candied yams were amazing with a side of they strawberry lemonade"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aVJWTkxaVmhJVFhGb2NIcHJVVXhFTm1kTVMzYxAB",
            "text": "I'm so glad I read the reviews before making the trip allll the way from the Bronx. No one should be waiting over 2 hours for mediocre food. That's crazy 😧 they need to hire more staff"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adGNqaHlNMUEwVlZZeWQxWXhkbTlhY0dsdVNrRRAB",
            "text": "I’ve been here three times because I really wanted to give them a fair chance, but after my last visit, I don’t see myself going back. The food isn’t bad the mashed potatoes were amazing and the turkey wings were seasoned to the bone, but the service is extremely slow. It took nearly an hour to order and another hour to get our food.\n\n$25 for a one-piece catfish dinner feels overpriced. I also saw others mention getting samples, but I wasn’t offered any. Having only one cashier taking orders definitely adds to the long wait."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWU1qTnJNa2xvYUZRNFoyaERVM2hzUmtwMFFYYxAB",
            "text": "Food is good thanks"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWFRuTmpZVmRyT0RkRU9FRklSSGhuT0c1eU1uYxAB",
            "text": "Katie O did an absolutely amazing job catering my wife’s birthday dinner! The food was beyond delicious every dish was full of flavor, perfectly cooked, and beautifully presented. Our guests couldn’t stop talking about how good everything was. Katie’s professionalism, attention to detail, and warm personality made the whole experience even better. She truly helped make the night unforgettable. Highly recommend her for any special occasion! 👏🍽️🎉"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscVJXaG5jbU5SYjBzemJIQkplVzVEYTB0eGNuYxAB",
            "text": "Overrated!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wdk1FaHpNblZEVmpSRlNXeFhhMHRHWW0xcVRIYxAB",
            "text": "We traveled to get to the restaurant onky to discover a very long line.  Had the information been made available we woukd have adjusted our trip to Brooklyn.  Please know that we were looking forward to thr visit.  Thank you."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVGQwZGxZamxYTjJObkxVZGtWM042WVRSV2RGRRAB",
            "text": "Never again... never worth the 2.5hr wait for takeout! After spending $100. I had to wait for my food. Wish I could have canceled and get a refund."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sM2NuZE5jRVpYWkZKZk5FWnZSazVKVkVWZlZYYxAB",
            "text": "The food isn’t bad. It’s just alright. The chicken was seasoned well. The mac & cheese was very oily and the yams were like mash potatoes. The wait time was entirely too long I was there for 2 hours. On a scale of 1 to 10 I give it a 5!!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcGQwZzNjbEJKT0UxbFgxUnZSa3cyWnpGalkyYxAB",
            "text": "I waited on line outside for  20 minutes and not once did the line move so I left.\nI asked a couple how long it took them to get their food and they said “1 hour and 20 minutes”.\nTHIS IS UTTERLY UNACCEPTABLE.\nHire more staff!\nThis is no way to run a business! I don’t care how good the food is."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMFVVczFVMjVqYXpoSFQxRjJWbTl2UkZCU2IyYxAB",
            "text": "The food was delicious 😋 but the  wait time was  crazy and they did not open on time i waited two hours… But overall i would rate the food a 10"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSGFIRmZhRmhDYXpKS1QwWnVhVGhXTFVZM2VVRRAB",
            "text": "I waited an hour and I’m actually really disappointed I wanted tik tok to be right about this one but it wasn’t. $30 Down the drain! I ordered a turkey wing meal with mac and yams. The yams were soupy and didn’t have any nutmeg or cinnamon, it was just sweet didn’t taste like traditional yams. The mac was just ew no flavor and the cheese was curdled, horrible. The turkey wings were the best thing in the whole meal but the meat  was very dry, but it was seasoned well. Tbh go to Vera’s their food is better and half the price for the same exact meal."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRFoyNVhXbGgwYld4RFEyaFRjVk5YYkc1NWIzYxAB",
            "text": "You will have to wait for your food…but DAMN it was SOOOO WORTH IT!!!! 1000/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swd2VGbERXVE10TFhwWVFuUlhkREZUU0Vaek0zYxAB",
            "text": "I got influenced by social media to try this spot. The food looked good and I heard the food was worth the wait. Delivery was advertised as an available option, but wasn't, so I went and waited in line - 90 minutes to make an order and another 30 for them to prepare it. The food was fine, but not worth a 2 hour wait, never mind the hot day. For me, the wait time or money I spend on food can make the food less enjoyable.\n\nOverall, this spot is not built for the volume they command and the food is not worth a 2 hour wait."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSGFWZFFUblZYVFMxelVWbzNVRVZCWkdNeGMxRRAB",
            "text": "I should've read the reviews before deciding to go.\n\nPros: Food is made fresh to order. The proportions are great and your choice of protein is great as well. The staff is super friendly and makes you feel at home.  There's a DJ outside playing all of the old school tunes that will keep you entertained.\n\nCons: The line was crazy when I arrived. I had to have a family member stand on the line while I found parking. We stood on the line for 50 minutes before we placed our order. Then, we waited another hour and 10 minutes before we received our order.\n(Total stay 2 hours)\n\nI love to support small businesses. But, that line and 2 hour wait was a turn-off."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STlEyWnVaVWd4WDJkSmRrOXhUblpLTlRrd04xRRAB",
            "text": "This restaurant has decided to BLAST music every Friday, Saturday and Sunday from 2–10pm. It can be heard from streets away and is so incredibly inconsiderate towards all the folks in the neighborhood who work from home, have small children that need to take naps, are trying to use the public library across the street, run a business nearby, etc. Totally understand wanting to entertain people waiting in line, but there's absolutely no reason to be playing music so loudly that it can be heard from streets away (even when inside). It's so incredibly rude and inconsiderate."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Rk9HeENlazFtVW1oUmVqazJlVEp0YUVabVJGRRAB",
            "text": "Will not recommend Unless they give you food within 10 minutes of your order!!! Arrived at 6pm took my order 8pm got food AFTER 10. imagine the ppl b4 me. Imagine thinking you buying food to eat at a NON RESTAURANT.  HORRIBLE taking money and not giving food....food was GREAT! But not  worth 4 hours of our time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZeE4xZEplRmh5YlhOV1dpMUJUbUoxZEVNMlQzYxAB",
            "text": "I would not recommend this place:\nComplete waste of time and overhyped. Food is mediocre and overpriced. I waited in line for 1 hour and then had to wait another hour for my food. I ordered a \"wing platter\" which consists of 4 chicken wings a tiny bread roll that is clearly store bought and not home made, and a small side of mac and cheese and candied yams. The total came up to $25 which is absolutely over priced for that small amount of food! Then the food was just regular, comparable to Popeyes but Popeyes chicken tastes better and is more affordable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTWNEZHBWa3hEVGtkVVJIUkZMVkJUYzBreVZuYxAB",
            "text": "Great food, great energy,  great vibes, & GREAT service. Everything is GREAT!! There isn't anything left to say, but you have to come here ASAP!! You won't regret it.\nI enjoyed my time here. They played music while we waited, & gave us samples.  What more can you ask for⁉️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRGVHUjZNVXd5UXpKNGNuSkJXbTlyT0c1SlpXYxAB",
            "text": "\"THE WORST\" YOU WILL WAIT 5 HOURS FOR FOOD AND ITS EXPENSIVE"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5b1VHSjROM0U0ZEdsWFJtdGxiMHBMZHpCck4xRRAB",
            "text": "Let me tell you about Katie. This has been some of the best soul food I’ve ever had. I live in the area and have always wanted to try the place. I am extremely glad I did. The wait was a tar long to order as the line was 3/4 of the block down which makes sense post eating. Ordered the Turkey Wings platter with mac & cheese; yams with banana pudding. Absolutely outrageous, it’s wonderful to see such a display of traditional cooking still exists."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTFVEbERhRlZtVmsxTGMyTnRWa2M0T1ZGWWJsRRAB",
            "text": "I need you to start opening seven days a week"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SVQzbENhVzlaV1VKWWRDMWZObEpJWlZNek1WRRAB",
            "text": "So I went 09/19/2025, don’t get me wrong the food is good (Im pretty picky)like a 7.5/10 but that line and wait time is what killed it for me. I would come back if I’m ever in Brooklyn but they definitely need a better system going on how to prep and get the food out in a timely manner at least 30-40 mins. Waiting an 1.5 to 2 hours for food is a first for me. Also the DJ was really good while your standing on line"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TVNqUTNabmxLYTBWUGJtcGphRVpQZW1FeGJrRRAB",
            "text": "Pros:The meal was delicious and they provide samples and a DJ!\n\nCons: The wait was ridiculous though. I arrived 20 minutes after they opened and they wouldn’t let any customers in until at least 10 minutes after that. Then I waited outside on line for 2 hours only to get inside and to get back in a line that wrapped around the inside. After I ordered my food I was told I could expect my drink in 10 minutes and my food in 30 minutes or more! Sadly I waited for 45 minutes to get my drink and food at the same time. Also, they don’t serve you in order. The people who ordered before and after me got their food ahead of me. If you decide to try this restaurant bring some water, a chair and wear comfortable shoes. You will be there for close to 3 hours.\n\nSuggestion: Prepare best selling food ahead of time to help speed up the line and keep it in the oven to keep warm. I saw many people leave the line because of the wait and you could’ve definitely made way more money. A patron from the day before warned me before I went in that the wait was terrible."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdmJuVkZXWGhqWDJoR1VWRlplVkYyUkdKcU0yYxAB",
            "text": "I wish I could take a picture of my food but it is gone. The food was good don't get me wrong but the wait has me conflicted. I left my house after 3pm and didn't get back home until after 9pm at night. Firstly I took the public bus to get there which took two hours. Then there was a line outside that took a hour or a little over. Then once you get in there that's around another hour to order your food because there's a line inside also. Then once you order your food that another hour or so to wait which I appreciate the fact that they make the food fresh and on the spot once you order but damn that whole experience was crazy. The people were nice and the atmosphere was banging due to the dj outside playing great music. But I have to be honest I wouldn't do it again like that. Like I said the food is good if and when I ever do go there again it would have to be in a car and right before they open so I can be right at that door in front on line. That way my wait time would be less and it wouldn't be such an adventure getting there. I give it five stars because the food is good but wasn't worth all the chaos that came before.\n\nAlso they don't take cash"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWFFWcFRlbkI0U1VoNU9XOXhibWRoY0hobE0wRRAB",
            "text": "FIRST OFF i would like to say all the staff was very friendly and welcoming. This place has been the talk of the town, so of course there was a line before opening. Came with my sister after seeing many tik tok reviews. The served samples while we’re on line & the line moved semi quick. After an hour we ordered, food came up to $96, waited another hour for the food. So far good experience.\n\nThe food was hot & packaged neatly. BUTTT the big banger for me was the food was sadly mediocre. I was expecting more from all the videos and post I was seeing. It’s NOT nasty at all, but for some reason was expecting more. The candied tea was TOO SWEET, gave a cake ish taste. The mac n cheese was kind of oily so the cheese didn’t stick & the banana pudding didn’t have enough cookies. The collard greens didn’t really have taste.\n\nThe turkey wings were AMAZINGGG & juicy falling off the bones & the garlic parmesan chicken was very tasty. Overalll I’d give it a 4/10. Spending almost $100, I’m kind of disappointed in the taste of the food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMWRuVm9SVGwwTWkxVk9GRlZZakE0YVdsdVZWRRAB",
            "text": "Food was good 😊"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNU1WTmZhRTVXVW5acU5XTm5NRXh3TFVsNFptYxAB",
            "text": "Let me start by saying this... this was really good eating and I cant stress enough that I'll definitely be back soon.  I got the catfish on a platter with rice and gravy and candied yams and a side order of the mash potatoes, mac and cheese as well as collard greens.. I dont even know where to start but every bit of this meal was hit just the right way. Catfish was a decent sized piece but I'll definitely ask for an extra piece for my platter, we'll cooked and seasoned, the rice and gravy was spot on delicious and the candied yams, my favorite, were perfect. The mash potatoes and gravy were delicious, the mac and cheese, delicious but the collard greens were amazing so flavorful and the crazy thing is when I went to order initially they were sold out but because some orders were possibly canceled they made an announcement that there were some orders left and if anyone was interested they could purchase them and I jumped on it, I'm glad I did. BTW, thanks for the sample of the cornbread stuffing, coming back for that next time. It was packed but the staff was incredibly polite and helpful, the whole kitchen team in the back was lazer focused and getting orders ready as well as cooking. The line out the door will let you know there will be a wait but the aroma of the food will make that wait pleasurable and during the 45 minutes I was there I chopped it up with locals from the area getting food and others that were there for the first time as well. To the owner Katie, please dont change a thing, everything was delicious and so well cooked and cant wait to come back soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xacFVWSTBaVFpsZHpNd05tOUZTR2xxWTFWeGQzYxAB",
            "text": "Just was here last night and i personally got to meet the amazing woman behind the menu . Katie’s energy lit up the room and definitely made it worth my 2 hour wait. Yes I can agree the wait was long but when I got home and opened my food I knew it was worth it. I had the catfish Mac and cheese with yams combo . Child’!!!! When I tell you I had the itis right after lol. 10/10 definitely recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dFpUaFRZVWxyYjJaclVrRnpkVkpQT0VsVFJuYxAB",
            "text": "FYI the line was really long. 2 hours in the line then 1 hour wait for them to cook the food. Just know once you get up there and order, you still have a wait!\n\nThe samples they gave us in line were amazing but we left because we didn’t want to wait that long. Went on a Sunday at 3pm"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRmJXeFdiVk4wUjJnMk4xWk9XRGhwVTIwM2FuYxAB",
            "text": "The food was ok  honestly thought it would be better."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNlZrWmxhVzUzZFZaSFpXNWxNM1ZYWm1GNFJXYxAB",
            "text": "Pésimo servicio del personal. Tardan una tarde completa para que tu comida está lista."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscUxUUjVOSEp5VHpod1FrazFjMkkxTVVvMlZsRRAB",
            "text": "I was so excited and traveled far. I called 1st to make sure they were open but it was a 45min wait for turkey wings..couldn't wait so I was disappointed. Only was able to get sides which are small. The samples were delicious tho..ill try again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVWFrWTVialJ4VmtkNVMySnBiVTlWWDBJd1NVRRAB",
            "text": "Speechless. Just… wow. And wow spelled backwards.\nThis is hands down the best soul food in Harlem. I ordered the smothered fried chicken platter with mac & cheese, collard greens, and (of course!) a side of candied yams. Because what’s soul food without candied yams, right?\nTo top it all off, I couldn't leave without trying the banana pudding — and let me tell you, it was mind-blowing. The kind of dessert that makes you close your eyes and savor every spoonful. Once my food was packaged to go, I decided to try the soul punch, and baby… that drink made me want to down an entire gallon. Sweet, flavorful, and refreshing — a perfect pairing with the meal.\nNow, I did receive regular fried chicken instead of the smothered, but guess what? I wasn’t even mad. That fried chicken was out of this world — crispy, juicy, perfectly seasoned. Honestly, no notes.\nThe customer service? Phenomenal. The staff treated everyone like family, and the owner even came out to personally greet guests — a beautiful gesture you don’t see every day. I even met a few local business owners while waiting, which speaks volumes about the kind of community this restaurant draws in.\nIf you’re looking for soul food that warms your heart and hits every craving just right, this is the place to be. You will not be disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUlNXZDFPRzlFWDNWaE0yeEZMVzFRZG1ZeGMyYxAB",
            "text": "The food was AMAZING! Better for takeout than dine in. Be prepared to wait but worth it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQmRFWnJiemsyVGxkemNWTjNPVW81WlMxbGVuYxAB",
            "text": "I ordered through delivery after this place was recommended. My meal came with 2 sides so I got Mac & cheese and collared greens. When the food arrived I received the mac & cheese but the collared greens were replaced with yams. The restaurant did not call to ask what I would like as a replacement side, as most restaurants do if they are out of an item, and that was disappointing.\nFor better practices, do not just assume the customer will take any item as a replacement. Thankfully im not allergic to yams but I don't like them & would have preferred to be given a choice in the replacement."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFelRFMURhRE5CUlhwTGRHOUtkM0JwV0ZSdVEzYxAB",
            "text": "Delicious turkey wings and stuffing.. the owner is a saint. Good desserts too"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUGJVWXpOMEYxVWxsNUxXMDFRWFJvWjNoQ2QwRRAB",
            "text": "Went here from a TikTok review. Got the pork chops, cornbread, and mac & cheese. It was delicious minus the cornbread."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRGMyNUZjMkp6Ym0xdFlsODNVREJCYmsxUmJWRRAB",
            "text": "What an experience! The entire staff, owner etc. was so pleasant. The owner was so welcoming. You’re immediately greeted when you walk in and asked if you would like to try samples of the food. Everything is made fresh to order. The food was delicious. I drove out from Queens to try it and I’ll be back. The day I went, they was playing oldies outside, felt like I was home with family. 10/10 recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX1pic1hREAE",
            "text": "If I could give more stars I swear I would! Unfortunately I’m horrible with names but the man at the counter had impeccable customer service skills to the point  I would have bought everything off the menu! We told him how we drove 7 hours and had the owner come sit and talk with us which that in itself made us feel extremely welcome. Anyways the food we got was devoured and we loved every bit of it! Also not pictured we got the fried catfish, collard greens and cookies and cream pudding just straight yummmm! Thank you to you guys for making every bit of being there worth it!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3c01XZl9RRRAB",
            "text": "I visited this establishment last night to pick up three orders from Too Good to Go. I was greeted by Darryl, who informed me that there would be a 15-20 minute wait as the orders needed to be freshly prepared. I was happy to wait, as I understand the importance of freshness.\nHowever, during my wait, I observed another customer being offered samples, and Darryl also inquired if it was their first time visiting, which he asked me the same question earlier (this was also my 1st time as well). While I understand that every customer is treated individually, I would have appreciated the same offer.\nAfter waiting 15 minutes, I was excited to try the food, especially since it came  recommended by a friend. Unfortunately, I was quite disappointed with the quality of the meals. The 3 orders contained only two small pieces of chicken, which resembled more like nuggets than a full portion, along with a small serving of rice and cabbage. Given that I waited for fresh food, I was expecting a more substantial and satisfying portion, and the quality of the chicken was also quite oily and could use some more seasoning.\nI truly wanted to enjoy my meal and had high expectations based on the recommendation. But unfortunately did not."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdGUtVlhREAE",
            "text": "I went here today and the food was delish! They let me sample so much - my eyes were bigger than my stomach- I got the catfish, the dressing with turkey gravy, and wings lollll but I had to pull over and eat because I couldn’t wait until I got home! I’ll be back - from one business owner to another may God protect your business🤍🤍"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJX3I5NDN3aWRIWTd3RRAB",
            "text": "I had an incredible experience at this soul food spot! From the moment I walked in, the staff made me feel right at home with their warm hospitality and genuine smiles. The customer service was top-notch — friendly, attentive, and quick to make sure everything was just right.\n\nNow let’s talk about the food… absolutely amazing! Every dish was packed with flavor and cooked to perfection. The fried chicken was crispy and juicy, the mac and cheese was creamy and rich, and the collard greens tasted just like something your grandma would make — full of love and seasoning. You can tell everything is made with care and tradition.\n\nIf you’re looking for a place with real soul, both in the food and the people, this is it. I’ll definitely be back — and bringing friends next time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdC1EcjFnRRAB",
            "text": "The food and service is SO GOOD but the prices are kinda ridiculous. I can usually get 3 meals out of $30 worth of takeout but I spent $40 here and only got one. Guess it'll have to be a special treat instead of a regular thing. Daryl was super friendly and gave me a bunch of samples - I think they (re?)opened recently."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMemJpc2tnRRAB",
            "text": "O M G! Finally! Soul food in my hood.\nWhen they are open... I get to have my fried chicken, which I love, love, love!!! Cabbage, turkey wings, sweet potatoes and so much more. 😋😋😋\n\nThank you for the soulful deliciousness"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURELTktZmpBRRAB",
            "text": "The pictures don't do this food justice.  The catfish was perfectly fried, crispy and well seasoned. The sides (Mac and cheese/ corn bread stuffing) were awesome.  Everyone is so nice and... free samples!  Can't wait to come back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205alF6Qm1SVEJEY0VOWFQwa3lUR3AwYWtOMFRXYxAB",
            "text": "My partner and I were lookin for a soul food spot. He googled it n said they were one of the first ones to pop up. We drove from Queens to get it. N we were not disappointed at all. Especially, since we’re both super picky n food is our love language. We love tryin restaurants together. The restaurant is quite cozy n homey. When we got there it was a good amount of people, all different races n ethnicities. Which is a good look! Darryl’s was amazing. We were able to test some of our food before we paid for them. Everything was amazing. I got rice and gravy, fried chicken, potato salad and collard greens. My partner got Mac n cheese, collard greens, potato salad n breast bites(boneless chicken pieces). We also got their signature “soul lemonade”. We then decided to get their dessert “strawberry n cream pudding”. 5 out of 5"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMGNXRldWMjVUZFZWcmIwWm9WVmx4TVZsUkxWRRAB",
            "text": "Service was a great atmosphere was very warm and relaxing. But everything Was either overly sweet or extremely salty.  If you\nhave blood pressure issues or diabetes.Not the place for you.. to be fair everything had the potential of  being  really tasty.... they just have to find that balance."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQSEo5Y3Z1ZzZ1cDV3RRAB",
            "text": "Amazing food and friendly staff. I see a few reviews about the price, and it’s definitely a special occasion place, but we try to justify any special occasion so we can go back to Katie’s. You can taste the time and effort that goes into the food, I always feel like I’m eating at a family get-together when we eat here. The food is so warm and comforting. Worth every penny"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWM05HaGthekZsZG1Ga05UbGlhaTE0VUVKUk5IYxAB",
            "text": "Katie  O treats you with love, I felt like family the minute she introduced herself to me. The food, was just amazing, and that fish platter,  lawd too good. If you're looking for authentic southern/soul food cooking this is it, not no Caribbean/soul food fusion, this is Soul food cooked with patience, love, and with a smile."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUDZ4YjNic18tTGN3EAE",
            "text": "Delicious BK Soul food finger licking good ... Very friendly staff ..worth the wait... I shall return"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUemMzaENREAE",
            "text": "Food is amazing! We got the fried chicken. I loveed their mash potatoes and corn bread stuffing, definitely get with gravy. Service is really great; Darryl was really kind and friendly. It’s nice to have a spot like this in the neighborhood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyb0pLRjBRRRAB",
            "text": "1st and Foremost! 🙌🙌🏾🙌🏻🙌🏽! 5🌟 🌟🌟🌟🌟\nThis is A GEM of a restaurant Authentic!📍\n\n! I mean can i list  how refreshing this business is ?!?!?……\nSoul~Food =the magic behind this food is you can feel it, in your soul~ made with Love……and “ Katie O’s “has conquered just that.\nI want to give Ms.Katie her flowers because from the presentation, to every single bite you can see and taste the time , the love, the legacy, the soul, and great clean food used in every recipe !seemingly no shortcuts!For me it was nostalgic, it reminded me of the taste  & labor of my grandmas “momma’s” cooking . A labor of love feeding all and no matter how much the recipe was pass down no one could do it like momma.\nWell Katie O’s i know your predecessors are smiling as you feed the community with your amazing flavors , great portions and service . I will continue to support you ! And spread the word !…Soulfood use to be everywhere now it is a luxury it has transformed into fusions of cuisines and that’s great, However , this restaurant is the real deal Holyfield👊🏾😂.\nSoul food is time consuming … and it cost to serve the community … lets all support Katie O’s Trust and believe you will not be sorry.The Foodie in me had to express this ,  long winded and all!! I give  the people … all races , backgrounds etc a heads up because  trust and believe you don’t have to go south to get that great southern eating  in ya mouth 😂.\n\nGuys You  Gotta go and get you some Katie o’s!!🙏🏾up this business will thrive.\n~\nP.sThis food is also an option to those fighting big backs☺️ ….moderation is key and the ingredients are phenomenal you will be fine. Everything is phenomenal especially the dressing/stuffing(spicy gravy if you choose) , greens  w smoked meat … potato salad whipped 😳 that’s what i said AMAZING!!!!!!! Yams …. Meats or not  !!!! Drinks ..desserts etc"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcTR2aXNRRRAB",
            "text": "Ok people...so let me tellllll you....me and my husband was out on a humble looking for some good food and babyyyyyyy let me tell you, we went to katio soul food and was greeted with love. The food was amazing them turkey wings, stuffing, mac and cheese, collard greens, cat fish, chicken bites, yams and potato salad, mash potatoes and them $5 shots was a on point, I even had to go back for more collard green cause them things right there was so good. Oh and two more shots of tito's..... the food and service was  a 10/10  i will be going back very soon."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdi1iZERBEAE",
            "text": "This food was absolutely amazing! I live in Pennsylvania and would drive there to get food again. The staff is extremely friendly and accommodating. The samples are also a nice touch!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOUpYMkVREAE",
            "text": "If you visit New York City and make it to Brooklyn, Katie O Soul Food is a great spot to have dinner. We had a very fun experience and very good service. We loved the fish and all the sides. The servings were so big. So good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaXMtd3BnRRAB",
            "text": "Great food and atmosphere! They gave yummy free samples and I ordered the fried chicken, collard greens, and Mac n cheese. It was all very delicious, I will definitely be back! Also the banana pudding was delightful!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUFZGQnJlSEZQWlcxTGRXcGxVV293WkhGNFFXYxAB",
            "text": "Katie O’s has never disappointed! The most delicious fried chicken, collards, mac, potatoes, everything is sooo good and comforting. I moved away a few years ago, and was surprised with a Katie O’s plate of food when I got home yesterday. There are no words to fully state how that meal was THEEE perfect end of my day. That food was so good 😮‍💨😮‍💨😮‍💨. This spot is one of the few reasons I miss Brooklyn. Katie herself is so personable and like a sweet auntie. Please do yourself a solid try everything on the menu👌🏾👌🏾."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOX1cyYXVHOGJyZjVnRRAB",
            "text": "Katio' s food speaks for itself, y'all better get over there, if you want the real down home soul food. I took my home girl and baby we were in love with all of her food. Yep we were greedy lol.. Ms Katie heard me raving about the food tasting, she said she had come see who was racing over the food and came out to meet me, she called me auntie y'all..."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LVl5UEZ3EAE",
            "text": "Katie Soul Restaurant is the place for an amazing experience! The banana pudding was absolutely delicious, and the catfish was cooked to perfection. I also enjoyed the mac and cheese, which was creamy and flavorful. To top it all off, the candied yam was a sweet surprise. The prices were very reasonable, making it an excellent value for the quality and quantity of food. I highly recommend Katie Soul Restaurant for a tasty and satisfying authentic soul food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMU1Fa3phMHhYYlVsNWRsVmthRWRyWTJKd1puYxAB",
            "text": "To start, the service is great! Welcoming energy that is expected at a Soul Food spot. The food is good, not great, but I wasn’t disappointed at all. I’d go back just because I felt welcome"
        }
    ],
    "reviews_count": 73
}