{
    "name": "Market Bar",
    "place_id": "ChIJC9lnWEJbwokRFhZpsYWE6vY",
    "grid": "BK9",
    "address": "1207 Nostrand Ave, Brooklyn, NY 11225, USA",
    "rating": 4.2,
    "user_ratings_total": 136,
    "phone_number": "(347) 221-1772",
    "reviews": [
        {
            "date": "5시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bGFEaFlWMmN5YjNCV2RUbGhaSGhXUW1nM05sRRAB",
            "text": "The owner was belligerently drunk and I’m sure he was doing Pepsi behind the bar when he thought no one was looking .\nThe food was okay and so was the atmosphere . Save your money and go to a REAL Haitian restaurant with Haitian cooks . Not this generically named “Market Bar”"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sc1EzVkpkMUJyYm1NeFdTMUtkMFJMUjFsdmNsRRAB",
            "text": "I am a neighbor and I suffer from the unbearable loud and bad music late into the night, many many nights, from this bar. As I am wring this review, it’s nearly 2am. I have tried to get in touch by calling the place but the call is never…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NFNsQnZjakozUlRneU1WTm9OVzFzV0dwWWVHYxAB",
            "text": "went for a friends birthday and really enjoyed this space! highly recommend for hosting events. Food was great it was fast, delicious and filling, drinks were strong and tasty and the service was excellent!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kd05sRTVSVTFVTUZCdVZtOVZSM3B2VkdaTlpVRRAB",
            "text": "Nice vibez. Good food and drinks."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MGNVdGlRVWRSVDNnd1VWbDFkbXc1YkRoZlJXYxAB",
            "text": "Cute,  corner bar. Just stopped in for a drink quick and ended up staying for a few and a shared jerk chicken quesadilla with a friend. Margaritas were awesome and the happy hour was so good. Would totally stop back by when I'm in the neighborhood."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMlpGbDVTRXRrVHpadmVGTmhkMWczWjJWbVZtYxAB",
            "text": "Awesome drinks and great staff - Jon the bartender was really friendly and professional. 10 stars."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xad2JrZDVSR3BhZWtKS1JXRnhjMnRWVkZwQ1NIYxAB",
            "text": "Great vibe and awesome service! John made me an Old Fashioned and it was spot on, probably the best I’ve had in a long time. The ambience was super chill and welcoming, definitely a place I’d come back to."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TFdteHhabTVHTTBWQk0ySlVOazkzYVdWbFJrRRAB",
            "text": "I came to perform tonight and felt super comfortable with the bartender India. She made sure I was good the whole time and im feeling nice!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bWIxQnZlWGhxY25KbWFEWnZkR2huUTA5clpIYxAB",
            "text": "I had a great time here. Cocktails were delicious and there is a chill ambiance. Jon the bartender guided me to pick the right drinks. Highly recommend it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMlZHRkZjbXB0YW1sU1VHdHpYM2hxYURWWmNsRRAB",
            "text": "Great place to vibe with friends."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSFRYQTRiekpaUkd0aGIwcEVkWEZ3VW1JMWJsRRAB",
            "text": "I hosted an event here last night and we had an amazing time. It was easy to confirm booking via email and my guests and I really enjoyed the food, drinks, and vibe. We had control of the music using our own spotify playlist and pretty much had the place to ourselves. My guests included children, teenagers, and adults and everyone had a great time and enjoyed the food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQV0l4SlB1eE4zN2pnRRAB",
            "text": "Everything mostly good. I would by pass the pizza. The bartender, I forgot the her name , is amazing and very friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJR1QyWlBVZ3NyYnRBRRAB",
            "text": "Music excessively loud."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKU04xTGVmbzdqYnFnRRAB",
            "text": "I hosted an event here and had an fantastic experience. The service was excellent, the team was super flexible, and everything went off without a hitch. Huge shoutout to Glen, who was an amazing coordinator, organized, and responsive. Highly recommend for any event!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKSFd6ZGpyeDVmSjJRRRAB",
            "text": "come patronize your beautiful charismatic wonderful bartenders Patrick and India. They’ll treat you right. They got games, they got tunes and good chats to boot. Frozen rum punch packs an actual punch and you can even take one to go, hang out then head to the park idk if you want to have a nice day that’s my recommendation !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNkxtVDd3RRAB",
            "text": "My team and I used Market Bar for our film’s fundraiser event in March 2025.\n\nMarket Bar was very communicative during the planning process and they accommodated every request. We had performers from a Hip-Hop collective present, and the performance was a magical contribution to the night. We were able to tape posters on the interior and exterior of the bar, which helped to further advertise our film and fundraising campaign. The manager was extremely friendly and helpful, and made us feel comfortable in the space. The bartenders were equally supportive and hands on when we wanted to stream a teaser video on their flatscreen TV.\n\nOur team is very impressed with Market Bar’s service and many of our guests are asking if we’re going to host another event, because of how enjoyable the night was.\n\nThank you for everything Market Bar! We’re so happy to support a local business as independent filmmakers.\n\nGratitude,\n\nThe Stress of IT ! - Short Film Producers"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNnJqVjFRRRAB",
            "text": "Amazing bar, top tier service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc3NxRGd3RRAB",
            "text": "Great frozen margs"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d1lEUVlREAE",
            "text": "me and my girlfriend went here on a whim and it was a nice cozy and relaxed place. the bartender that served us was super sweet and friendly"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bE0td0ZnEAE",
            "text": "The server/bartender was very nice, chill atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MFBIYXFnRRAB",
            "text": "Great fries and wings. Excellent service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOHJIbUJ3EAE",
            "text": "The drinks and the service were great and I’d love to go back but the music was unbearably loud. It’s a pretty small space and  I could barely hear the people I was with nor the bartender. She actually got my drink wrong because she couldn’t hear me. Please turn it down!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBaXNYU3VnRRAB",
            "text": "This place is an after work Brooklyn gem!\nAsk for Glen’s curated 90’s R&B playlist, connect to WIFI on your laptop and order a drink!\nCozy local dive bars with great vibes are a rarity! I love it here"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdEx1OVV3EAE",
            "text": "15 dollars for a store brought pizza is ridiculous... this is New York... pizza is a delicacy... at the very least I thought pizza quality would stay up to par. Anyways I recommend taking advantage of the drink specials, but the pizza is a waste of time! Happy I went during happy hour because I would of been PISSED has I spent 19 DOLLARS ON A STORE BROUGHT PIZZA CAN'T REITIRATE THAT ENOUGH! the service was cool though."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaUxfY01nEAE",
            "text": "Recently had a very unprofessional and unpleasant experience with Market Bar.\n\nMy friend and I were planning a surprise birthday party for another friend and chose Market Bar because of the vibe and the fact that it’s Black-owned.\n\nIt was difficult to get in touch with the staff to organize the event, but we eventually secured a date for 1/11 and put down a deposit for 6 PM–12 AM. We also confirmed that we could bring a DJ, which added to our excitement for the milestone celebration.\n\nOn the day of the event, we arrived at the venue only to find it decorated for a baby shower, which left us confused. After contacting the point person, they informed us they were on their way. By the time they arrived, the event had already started, and we were told the venue was double-booked. They said they’d try to get the baby shower to cancel, but there was little effort made to resolve the situation.\n\nWith no resolution in sight, we decided to leave, requested a refund of our deposit, and scrambled to find a new venue. This was extremely stressful and inconvenient as we had to move our guests, DJ, decor, and cake, but thankfully, we found another space.\n\nThe following day, we contacted the staff, who were apologetic, professional, and returned the deposit quickly.\n\nWhile I appreciate the prompt refund and acknowledgment of their mistake, this experience was far from positive. Unfortunately, I can’t see myself booking here again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNm9QZHF3RRAB",
            "text": "I had a terrible experience trying to throw a birthday party here. They claim that you can use the bar for events for free, but you do have to pay a $200 deposit to secure the space. The communication was nonexistent, they took days to answer emails, and their website had no information or FAQs. Despite paying this holding deposit, they booked a second event on the same day as mine. I was told about the other event the day of and told that it wouldn't interfere with mine. That was a lie. When the time came for me to set up for my event, the other party looked like it was just getting started. The bartender completely ignored me when I asked for help/to speak with a manager about this. And the owner did not provide a viable solution either. I had to move my party to a totally different bar. They almost ruined my best friend's birthday. I do not recommend using this bar for an event."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmanVlNldnEAE",
            "text": "Small intimate spot with great drinks and atmosphere. Has a mixed crowd, played sports, and the drinks are good! Can't wait to go back!!!! Also TRY THE GRIOT NACHOS YOU WONT REGRET IT AMAZING!!!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2ajdtQkl3EAE",
            "text": "I came for the later lunch rush with my girlfriend, and my server was very polite, helpful, and accommodating to my dietary needs. I will say that the atmosphere was more tech bro with lots of beer and liquor flowing. But regardless of, everyone look like they were happy, served and not to in intoxicated for this environment to be uncomfortable for us. I would definitely recommend coming back here on a late night after shopping or sightseeing at brookfield Mall."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aTlMWUp3EAE",
            "text": "Came for a quick bite to eat and drink and we had to stand at the bar for 3 minutes before being greeted.....and we were the only people there.  There is a very young lady there doing triple duty..... cooking, making drinks and taking orders.  She didn't bring all our food out at the same time, and she never followed up with us to inquire if we wanted more food or drinks.  The food was honestly not tasty at all.  My wife had the shrimp tacos and she said she could not taste any shrimp as it was drowning in sauce.  They obviously have no desserts because we were not offered a dessert menu.  The young lady that served us spent more time playing with her phone and talking to a friend of hers that came in to chat with her then attending to a paying customer.  We definitely won't be back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LUxXVndBRRAB",
            "text": "Very chill settings, the food isn’t so good, drinks are simple. Very friendly servers, cozy seating, and support Haitian business."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcElfQV9RRRAB",
            "text": "Chicken sandwich was a frozen chicken patty, not really chicken :/"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaTZtT3d3RRAB",
            "text": "Love this spot favorite weekend spot. And cool for lunch time vibes. Check out happy hours during the afternoon or after work."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaTlPM05REAE",
            "text": "I was hoping it could be a decent date night spot to play games, but it was a miss. Wings, fries, and music are good. But the music was way too loud to sit inside during a weekday night. Because of the noise, we sat outside where the tables…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOU9XYUJBEAE",
            "text": "Good place for a drink"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3Z3VtRlJREAE",
            "text": "We always come for the jerk chicken pizza and stay for the vibes. Nice homey atmosphere with games, comfy cushions and a range of people on dates to families dining in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURib2NiTlRREAE",
            "text": "Lovely neighborhood bar with a nice menu of bar of food. Small staff so sometimes takes a bit to get drinks but that’s understandable. Nice happy hour deals"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieXRiZFhBEAE",
            "text": "Loved this for a late night snack! Great selection of cocktails."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieXRiWnp3RRAB",
            "text": "Great place! Just visited with my fiance\nGreat drinks and food\nRecommend 100%"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6ODcyMDJRRRAB",
            "text": "Finally stopped here. Sat outside. Drinks were delicious. cauliflower was so good. Had a great community feel, friendly people in and out. Sat with my dog outside and they had a little dog bowl. Perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqajhtdTdnRRAB",
            "text": "The wings are AMAZING! Like so freaking good. The frozen margaritas and rum punch were so good.\n\nThe atmosphere is really cool, lots of board games & card games. Ample seating and lots of large tvs.\n\nThe service now is a different story. The drinks on the rocks were awful, they didn’t have certain alcohol to make drinks, and they didn’t let us see the bill in full before charging our card. The server had such a bad attitude it was unbelievable.\n\nLastly, kids are allowed but it is a bar where there is alcohol and music that had cursing. It was an odd experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdmFYLTNRRRAB",
            "text": "The quality of service has decreased, considerably. The bartender they have now doesn't care about anyone who's not one of her friends, they no longer take orders from tables, the prices on the menu for wings have changed without warning in…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdEpTMlJnEAE",
            "text": "1st time visit! Love the energy..will be back!\n❤️🍽️"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bllIWkhBEAE",
            "text": "Had a great time at this bar! The atmosphere was a vibe. Tried Sarah’s Fuzzy berry surprise drink and it was great with the delicious wings! Music was also pretty cool, definitely a spot worth checking out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dmJlbFFBEAE",
            "text": "Sarah was the best here and the food was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N3F1bDV3RRAB",
            "text": "My wife and I stop by often and the service from Sarah is always welcoming! Great happy hour frozen drinks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dEtDY0pREAE",
            "text": "i write this as i’m sitting here - i will say the frozen rum punch is worth it. I got two and they’re strong! The atmosphere is comfortable and I love the music. Although, i saw a completely different picture of the empanadas online, so i was surprised to receive what I got. they were extremely tiny and i ordered beef, but they didn’t taste like beef or chicken (more like potato). I didn’t want to make a fuss so i ate them anyway, but I wouldn’t order it again. The sauce that came with it was really good, but the empanadas don’t taste authentic in any way. Might as well not offer them on the menu at al honestly. Im not sure why they showed a different version of them on instagram. $15 for these little things is crazy. Also, their instagram says that happy hour is everyday which is a LIE. I got there and it was only M-F. The atmosphere, drinks, and music won me over, so i’ll try something else next time. On another note, consider adding hookah to the menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkcEtDc2hBRRAB",
            "text": "Burger was pretty good. Needs mayo or the aioli in the bun but other wise fire.  Shoutout to the bartender Sarah tho. 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOXzRDVFpBEAE",
            "text": "The website says they are a local spot for a good time instead of going to into the city but I wonder how true that is when I ordered a basic espresso martini that was $17 and unbalanced in taste. Made me wish I had gone into the city after all. Regardless, the bartender was nice and the atmosphere was dark, loud but pretty empty inside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbTZUV0VnEAE",
            "text": "I walked went to the bar and the young lady serving was so RUDE. It was like I was irritating her asking what kind of IPA’s you have. She points to the board and says it’s right there read while she’s texting on her phone. I was so excited…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbkt6SWNBEAE",
            "text": "Great bar addition to Flatbush area. Amazing happy hour deal with 2 beers and a pizza. Atmosphere was amazing with awesome bartenders including crystal. Definitely will be coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGbTdMUnNRRRAB",
            "text": "This placed looked nice and the night we picked was a Friday. The music was pumping! A great selection was in rotation by the DJ.\nI really wanted to hit happy hour but we got in very late. The atmosphere is very nice and had a very eclectic crowd. The bar was filled.\nWe ordered a few drinks! Which was just OK! Also grabbed some food that was also just OK! The music and friendly staff made up for it all! It had a lounge type of vibe to me.\nI will return though to try the happy hour and Pizza!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURob0x6eHVRRRAB",
            "text": "Easily one of the best spots in PLG! Not best new spots, not best black owned spots, best overall.\n\nIve been here a couple times and the food, drinks, atmosphere, and service are always on point. I highly recommend the spicy chicken sandwich, its not spicy spicy but flavorful spicy (the distinction is important).\n\nThey also serve coffee so this could be a nice place to get work done. The music and guests have never been too loud imho."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNHFIMlpnEAE",
            "text": "It's a nice spot. The drinks were good. I loved the rum punch. The food was good. The games were a plus. What more can you ask of a bar? I will be back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eUpYWDNBRRAB",
            "text": "Best new black owned brewery with excellent pizza! And they have books and board games!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aGRyWWp3RRAB",
            "text": "Really cute cafe, cozy vibes, great food & bomb drinks 🔥 the frozen rum punch & margarita are both great. The market pizza, sweet chili wings, the griot tacos, & jerk chicken pasta were all amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c2NTOXd3RRAB",
            "text": "I believe support black owned business not only helps the communities but makes a very big difference. I came to this bar unexpectedly and was greeted so much grace and love. The drinks are amazing and the food even better. If you are looking for a little place to vibe with friend I definitely recommend this place 10/10."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaHZIejNnRRAB",
            "text": "This place has UNBEATABLE happy hour prices ($7 for a cocktail??? Girl count me in), incredible cocktails, AND attentive, friendly wait staff and bartenders. I love it here! It has been our regular ever since I moved to this area - Market Bar is like an oasis. Keep up the good work y’all! Xoxo"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMXBUUFB3EAE",
            "text": "I’m not sure if we caught them on a bad day. It was Pride Sunday afternoon around 2, and I was super excited to go for the first time. I’ve been seeing great things on their IG page so I figure my dad and myself should give it a shot. Place was pretty warm AC was installed but not turned on. The two drinks we tried to order( top 2 on the drink menu) were out because they didn’t have sorrel. Some food items were also unavailable. The bartender was nice outside of that. It was just a disappointment. I’ll try again for happy hour in a few weeks but maybe mgmt should have a daily menu so they’re not “running out” . However my “espresso martini” - which is made with coffee was okay and the whiskey sour my dad ordered was really good according to him. Also NYC summer is super humid please turn on the AC😓"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaa2NxNURBEAE",
            "text": "Market bar has become one of my regular spots in my neighborhood. They’ve hired a great team and the owner is very personable and real.\n\nAlways a great time chatting and they make you feel at home. Mondays are my day off and this is usually on my list of stops."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaHZIZTVRRRAB",
            "text": "Incredibly chill atmosphere, friendly staff, and amazing food (love the onion rings!!!) - highly recommended for drinks with friends!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNV9Yc0l3EAE",
            "text": "it genuinely pains me to write a poor review for a neighborhood establishment, but Market Bar needs to get it together on food quality and service before I'm comfortable recommending them.\n\nfood: I have eaten their pizza twice: a large veggie pie and a small prosciutto pie. both times, the crust came out completely raw in the middle. it seems to be very good quality dough, but very underdone. yet the toppings were way overdone on both pies: soggy sauteed onions and burnt-to-a-crisp prosciutto and arugula. there's way too little sauce, and what of it there is collects in the very middle along with the soggy cheese, leaving most of the pie's perimeter a bready wasteland.\n\nservice: it is strange that the pies are always under, considering how delayed the orders have been. I ordered takeout both times and, though I was told 25 minutes on the phone, had to wait 45 minutes in one case and more than an hour in another. in the instance when I had to wait an hour, I was also overcharged by $4 above the stated menu price and had to ask twice to be refunded the difference while the server rolled their eyes at me. in fairness, they did offer me a complimentary draft beer as an apology, but it was small recompense for the hour I spent sitting at the bar waiting for an undercooked pizza."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSLW8ySlZREAE",
            "text": "Really was looking forward to the pizza given the rave reviews. But a 1 hour 20 min wait for food to be ready - without a prior heads up - is not cool. I appreciate the refund and hope to get to try it next time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M3NEcGRnEAE",
            "text": "Sooo Lets Discuss Market Bar!!!! Black owned✅ Love keeping money in my community! The daleview local brewed cider is literally the BEST cider I’ve ever tasted ever in life!!! The happy hour 14 inch pizza and two pints for $25 WHAT AN AMAZING DEAL!!! The jerk chicken pizza knocked me off my seat! I literally grab a pint and a pizza every time I have a day off! Will continue to come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbVp6VDFBRRAB",
            "text": "Not sure why it took so long for me to discover this spot but its a definite gem! Great food, drinks and games that we all love to play (dominoes, jenga, uno - you know) ... and the icing on the cake - live music every Monday evening! Cheers to bringing some joy to Monday - its officially no longer the worst day of the week :-) !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSM2F1NVhnEAE",
            "text": "The bartender is friendly & brings a great Vibe to establishment. The pizza is 10/10. The drinks will have floating after 2/3. An amazing vibe & always will feel nice leaving spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaM2N6ZTVnRRAB",
            "text": "I don’t do many reviews unless it’s really worth it. This place is 5 stars across the board! Food delicious! Atmosphere warm and inviting, service great! Marcel was top notch! Friendly, attentive and professional! I will be back! Great for an after work Friday vibe!"
        }
    ],
    "reviews_count": 66
}