{
    "name": "Antilles Cafe",
    "place_id": "ChIJGZDLBgBbwokRtJfvgxADnnY",
    "grid": "BK9",
    "address": "1170 Nostrand Ave, Brooklyn, NY 11225, USA",
    "rating": 5,
    "user_ratings_total": 192,
    "phone_number": "(786) 250-7065",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cGNFOU1USGs0YTBwalJWVmFSbmRLWkdWcmNVRRAB",
            "text": "Listen listen listen listen!!!!!! I love this Cafe. Not just because of the Haitian and Dominican Roots. But because they really are serving culture with bombs slap food. I had the vegan sancocho! Let me tell you. They don't even need to put that it's vegan. The soup itself is so Hardy and filling. It's not that you forget that there isn't any meat, it's not needed. The consistency is that of a chowder and you thoroughly get to enjoy the root vegetables in there from the mushrooms to the plantains and the corn. I'm in love with their caffeinated lemonade but this might be my staple go-to before their griot!!!!!! And not to mention Drew and Eric are so nice and welcoming! This might be a small space but the atmosphere and service is on Yankee stadium! Never have I come here and have I yet to be disappointed. I could continue talking about the sun kocho, but there are so many other little bistro plates that are also worth highlighting like their grio and saltfish Banh mi!!!!!! They incorporate the Pearl of the Antilles from the setup, to service to food. A true hidden gem but nonetheless a gem!!!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jdFlsOVFRM1ZSWVZSeFltZ3dPR3haWmpOVWJVRRAB",
            "text": "This is a wonderful Cafe. I was able to try a pastry and the coffee both the coffee and the pastry was delicious. I hope to come back soon and try some of their lunch menu options because they sounded really good. The staff was extremely friendly and I really enjoyed getting to know them.I can’t wait to come back and visit soon."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMVdWWklXVGw0ZUZWMVQzTk1jRE50Wmt0WldXYxAB",
            "text": "We stopped for coffee here and the owner was so kind and welcoming. We had the house speciality which was amazing! Would love to go back and try some of the food items, definitely a neighborhood gem."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdVdrNDVkMG94UkdORVNXVkhibVk1WjBkQ0xWRRAB",
            "text": "DELICIOUS IS AN UNDERSTATEMENT! I wasn’t able to get a picture before I drank it because it was just that good!!! I got a Sorrel iced tea and my girlfriend got a plaintain brûlée iced latte!!! We met Dru and Nanu, absolute nicest people!!! It was a treat to talk and be serviced by them!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQ04ydE9XR3AyV1VwM2JEa3dPVTVsY1RGMlNVRRAB",
            "text": "Some of the best service I’ve ever had! Nanu was so personable and sweet ! She even asked our names :)\nThe food was phenomenal, the presentation was beautiful, and I can’t wait to come back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaloyVllkVEo2TlV0NlIwdFhTek5PV2t0bldVRRAB",
            "text": "Super pleasant service. Amazing eats. And over the moon pet friendly. They asked if my Ellie could have a pup cup and she loved every lick. I enjoyed every bit of my experience. Will be back and highly recommend the whole menu! DJ was amazing too. Staff is 10/10!"
        },
        {
            "date": "2주 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUGMwbDZjVkoyYVhRMldVZFFSVXhUTjJaM1NVRRAB",
            "text": "今まで食べたクリームのうち一番爽やかなものです。スーパーのものを直接に使うではなく、自家製なんで、糖分を控えめにできました。一杯食べても飽きません。"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wZlYwcE9ZbXRTWDBJMU0zRlJibTlVVmpaMmExRRAB",
            "text": "Walking into the shop I felt at home. Comfortable … is an understatement. Chef Erick greeted me with a measure of familiarity that left me feeling as though we’d known each other for forever. And, to say the least, his mastery of drinking making and presenting left me wanting to taste everything, if for nothing more than to see his artistry!!!\n\nBlessed and appreciative."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ScGVYRklMVTlzWDFBd2RWUm5TRFExT1c1SFpuYxAB",
            "text": "Immediately fell in love with this place on my first visit. The owner, Erick, is so personable and his associates are amazing. They also have some of the best cold brew I have ever had. Highly recommend for your PLG excursion."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdlkxQjJNbUY1VG5kSlNHTTNaVGRrVHpneVlWRRAB",
            "text": "Stop by this amazing neighborhood cafe that offers lots of flavors and beautiful treats. Eric is a gem, 10 out of 10 I absolutely recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNlNqbENRMmcxYlV0elkyZDNSbEo1Tmw5dWEwRRAB",
            "text": "Such a fun new place! Vibey and has creative drinks"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0QlZsbERSRGR1TFdwSFdIcEtkVWh6UmtSeFJWRRAB",
            "text": "Eric is amazing and the griot is my favorite"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbGJHNDBNRXhOZEVsd2RIRmZiVE5wTFhWMldsRRAB",
            "text": "Great service and great food! The owners are so friendly, will be back soon"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSk0xSXljR1pOWm5KSVFsWkhNMHRpTnpCaVFrRRAB",
            "text": "Great coffee and snacks, and Eric is awesome"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaFgycHhjbGgyYTBsNk9VeE5aR1JCVmtkdU1WRRAB",
            "text": "I wish you guys the best of luck. Suerte bonne chance"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bWRscFZaSFZXWVZkelRtcHdMWGx3VGtWWVlWRRAB",
            "text": "Absolutely lovely place!! The coffee was so good (highly recommend the plantain crème brûlée) and they were so sweet and welcoming and very nice place to sit and do work. Will def come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNk1sTlpNVFZUVm1relpYSjNWRWRKTmxwa2IyYxAB",
            "text": "I loved the vibe, the owner was super friendly, offered me yuka plaintains just to try.\nThe donut and coffee was ok, would definitely recommend trying the specialty here, don’t play it safe :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKa1VsWjRabGRMU0ZOMlMxSkxSMUZ4WkZkMVoyYxAB",
            "text": "10/10 tostones, yucca fries, sorrel iced tea, plantain brule latte, cuban sandwich. Have to believe everything else is just as amazing! The owner Erik was so incredibly nice!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeFgwNUNRM2R6V0VGR2RqQmFNV281TlVsaVdHYxAB",
            "text": "Great place. Impeccable service. Wonderful and kind hospitality. I loved both drinks and food. The food presentation was very nice. I loved Antilles and look forward to being back soon.  Mesi anpil! Muchas gracias."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMFUxZHFUMnh4TFVZMVJXeFBjMVUyYVVGYVdtYxAB",
            "text": "The coffee was and house made sorrel are both a work of art. I met the owner who brought us out madelines that were scrumptious I will definitely be visiting again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaS1VYcEVaWHBGTjJSalEwTjVUV1ZNTUcxekxYYxAB",
            "text": "My sister said she saw this place on social media and said we had to try it. The owners let us know they were closed however they were kind enough to make us the plantain brûlée latte. We’re definitely going to come back for the full experience!! The drink was great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dWMwdGhYMUpQZVc1SmRVaFdhV0ZGVjFOUmNVRRAB",
            "text": "Great cappuccino"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VGRqSnNlakJ3YkRSZmNrcHJkVWMxVW01UVlYYxAB",
            "text": "This place is incredible! The food is great the drinks are great the service is great! Eric and Drew are so lovely! This is a must try!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVFFqbENjRWd5V1RaSWNqbEdWMlpuY0hjMGRWRRAB",
            "text": "I can never speak highly enough of this place. The vibes are unmatched, the food is amazing, and the drinks are top tier. Somehow the next experience ends of topping the last. The owners Dru & Eric are so welcoming, personable, and you can tell they love what they do. And they’re good at it. Some of the best Haitian & Dominican food I’ve had in New York. Also shout out to the owners for the good convos and the round of Null! Their Morir Soñando is indeed to die for. Can’t wait to come back again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVWRqbDJNRE01T0RSRWJVZDBZVm8wYUhGUWFHYxAB",
            "text": "My friend and I have come here a few times but today was totally different, we had SO much fun. They always treat us well but today we played “Null” with Dru, one of the owners, while we tried a bunch of different wines. We aren’t a big on wine so it was fun to try so many new options. Erick (the other owner!) was so nice and held it down in the kitchen while still being super hospitable to myself and my homegirl. Their food is delicious (like delicious enough to close your eyes and just pick something and be confident that it’ll be good), the drinks are insane, and the wine selection was really interesting. We stayed for like 3 hours and it flew by. We’ll be back for the event on Sept 28th!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKck4wNXhPRkJxUm5KRU9WVlJkelZQWDJwNVZWRRAB",
            "text": "Service was good the atmosphere\nWas chill....If you know, your product is expired, don't serve it.... I had a drink and the milk was coagulated...It tasted very sour. Thank God  I did not get sick."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSlZWaEdkR2xqTTBoS05UbHhVRGhuYUVVMVJIYxAB",
            "text": "10/10 no notes. The proprietor was friendly and knowledgeable, took the time to check with customers and offered us additional plates with our order. We enjoyed our plantain lattes, it was innovative and refreshing, I also had the yucca fries and tostones and my friend enjoyed her Cuban croissant and pork. The cafe is cute and inviting and I will definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRkxUSXdTekowTlVwcmFuUXhYM0UzVlRsWVdtYxAB",
            "text": "Owner was great. Very nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbloxWkZTbWhPUVRWQ1RXTjNOVVpUTjJ4TWJGRRAB",
            "text": "So nice!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONWJqZFpPUzF5T1RWdGMxbGxlVko1WVRWa1ZFRRAB",
            "text": "Wow..what an experience!! We drove from Long Island to check this place out..saw on Tik Tok..The owners Erik & Drew were exceptional!! They both greeted upon entering and gave us the best service! We ordered the Yucca Frites, Morir Sonando and Ginger Sangria and Drew gave us tostones, Plaintain Bruleee and Buillon soup on the house. Everything was DELICIOUS!! The drinks were on point and so were the tostones,  yucca and soup!! My son had the soup, whixh he rarely eats soup and he loved it! Such great guys.. they love what they do!! We had a nice converstion with them as we left.. This place is a a must try and was definitley worth the trip!! We will definitely be back!! Best of luck with your future expansions!!\n\nEddie, Wanda & Josh - Long Island"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGS2JEWmpiVTVyYzBadFVESkxjbEpoTjNaaGVFRRAB",
            "text": "I truly felt at home at this cafe! There is a strong sense of community. The owners are extremely friendly. They ask for your name and remember it! The food was delicious; you can tell everything was made with love and attention to detail. MUST try cafe! You won’t regret it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCc2JXRkRXbmhNU21WRVozWkNkbE4zT0ZvM2NsRRAB",
            "text": "All the food and drinks were truly incredible, and the owners were so friendly and welcoming! Would give more than 5 stars if I could"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GZmFXOTZXblZmTVdkU1NFTjZhR3R5ZG5KclpHYxAB",
            "text": "Antilles Café: Come for the drinks, stay for the vibes, and maybe a chess match.\n\nIf you’re into bold sips and warm welcomes, Antilles Café is your new happy place. The drinks have personality, the service has heart, and Eric? He’s basically the soul of the spot. Someone paint this man a mural, he’s that good. When our sorrel iced tea needed a little sparkle, Eric swooped in like a flavor superhero and saved the day with charm and intuition.\n\nLet’s talk liquid brilliance: the MORIR SOÑANDO and iced PLANTAIN BRÛLÉE LATTE are tropical daydreams in a glass. Creamy, complex, and cooler than your vacation plans. The sorrel? Thanks to Eric, it found its groove and joined the party.\n\nOn our return visit, the food brought its A-game. The SALTFISH BANH MI was packed with flavor and intention, and the GRIOT & PIKLIZ? A spicy, savory knockout. The griot, delicious pieces of pork, deep-fried to golden perfection and served with epis aioli and spicy pickled cabbage. Every bite was a celebration.\n\nWe were also treated to a glass of Haitian lemonade, kissed with almond extract and absolutely delightful. Eric mentioned it tastes even better topped with espresso, so you can bet that version’s on our list for next time.\n\nAnd there’s more: next door, there’s a cozy wine and juice bar that feels like a secret lounge for flavor nerds. Saturdays, the café turns into a chess club hangout, which somehow makes everything even cooler. Sip, snack, strategize, it’s a whole vibe.\n\nWe’ll definitely be back. Antilles isn’t just a café, it’s a mood."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNWJrUTNSblp3VGxsSVQyYzNYME5UTFhKVmJXYxAB",
            "text": "Whatever you do, please don’t let this place shut down!! It is honestly one of the most community based restaurants out right now. The owners still work behind the counter and some of the most generous people ever. Come here on a Saturday for the best vibes and open bar space. Try the food, meet people, really use it as a third space!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weFFXTkJOVWxFVWw5UWRGOTFZWFZrWm5OemVWRRAB",
            "text": "Delicious sorrel iced tea. With a hint of honey. Vibe is great. Erick the owner really friendly and welcoming. I’ll definitely be back soon to try the food and the cream brûlée latte!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOc2NXWlhjR1YwTkZSRFJtNWZWMmxLUzNkZmNIYxAB",
            "text": "Charming and tasty work in progress. Keep an eye on this one, and in the meantime eat the salt fish bahn mi"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RlVraDNkM04zT1V0aVVHUTJhM0pUTkdkS1IwRRAB",
            "text": "Beyond expectations. Had been wanting to visit and finally made it. The owners are incredibly friendly and personable, even asking your name. The saltfish bahn mi slaps. The sorrel iced tea was perfectly tangy and not too sweet. The tostones were tasty and they even offered me a free honey wine tasting at their wine place next door. Highly recommended. I’ll be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFdGJXcGxieTEyVlU5aU1TMU9WME5SY1VoWFkzYxAB",
            "text": "perfect lil spot"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sd1JtcHhWSFZLYjFKV09UQmtObXQzVVZsQmRVRRAB",
            "text": "10 out 10, the service as well as the citronade, yuca fries & saltfish bahn mi were all fantastic. I ordered a plantain creme brulee latte to go which was also delightful. Can't wait to visit again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdlp6RkJibmRaUWxZNE1tWXhNa050ZG10NlEwRRAB",
            "text": "Hospitality and service here is top notch! The specialty drinks and food are amazing. Definitely try the Morir Soñando (Dominican orange creamsicle drink). A great spot in the neighborhood, locally owned and operated with the juice and wine bar Nextdoor. Can’t be beat!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkR2NHeEpjMVYxT0hObVptTm5WVkJPYTFOc1NsRRAB",
            "text": "Saltfish Bahn Mi + Lemonade HOMERUN go right now!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OYWNrZ3dRemhGY1ZOWGRUZHVPRGQzTFVkTFNrRRAB",
            "text": "The food and vibes here cannot be replaced, you always leave happier than when you came in! Antilles Cafe is building such a great community and I’m happy to support. Erick is a sweetheart and I will not stop telling people about this wonderful place!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twc2MwOWlNSFpSTUVWV1dERnlVa3MwYTJaVmQzYxAB",
            "text": "That toasted corn bread is really good. The atmosphere is great. The staff & owner are very welcoming. Overall a great experience. I will be going back to try more of the menu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UGNXcFZVRFEzZUZOdU9WUTNNekZmVEhoNk1WRRAB",
            "text": "First time here today ! Overall great experience . Great quality drinks and exceptional customer service . I will certainly be a returning customer !!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eWVHTkpSRzEyVG5oalpVNXZkblV4VFZSblIxRRAB",
            "text": "Absolutely incredible service and atmosphere! The brûléed plantain latte not only looked amazing, it was some of the best coffee I've ever had 💖 We will definitely be back 👌👌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OamVFNTJTVlpoYW1Wd1Jrb3dlbGhJWm1SeGQzYxAB",
            "text": "this place rocks"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WlduZEpOVEJJTFhWYVVETmFVemRCVm1neVltYxAB",
            "text": "Erick is the nicest person in the entire world. So talented and dedicated and welcoming! My friends and I have been meaning to check this place out for a while! We went and enjoyed it so much we went back the next day!\n\nThe plantain brûlée latte is a work of art! The saltfish bahn mi was incredible. The fish wasn’t too salty and all of the toppings added so much to the flavors. No notes 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wM1lXZzFNMjFLYm5rek5qZGpVVGhtUkhWQ00zYxAB",
            "text": "The food is delicious. I can tell that it's done with love and passion. Eric is amazing! Can't wait to go back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsT1gxOVNlVk5MY1VOTE0yd3pUM2sxWlhKYWMzYxAB",
            "text": "Eric is the most welcoming and knowledgeable king. Walked in with a friend for a quick bite and left in love with the food, service and ambience. We got the griot and piklis and tostones - all fabulous. Will definitely be back!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tveVZtcHZkVU16TjFOQ2ExUmhkMmREUm1saFEwRRAB",
            "text": "A really quaint cafe with excellent service. The staff and owner(s) were incredibly kind and hospitable. Highly recommend, especially for a refreshing “Citronade” on my one of these hot + humid summer days."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeVZGaEJPRkpGZFdwM1RGVllUMmsyWW5Ga01YYxAB",
            "text": "This place is great. The chef partner and operations director, Erick, was working. I came in and got their Plaintain Brûlee Latte. It was delicious! Erick made me tostones y maduros because he wanted me to sample what they offer. I'm here to tell you, it was so so good. They have fun merchandise as well. Cool vibe. This place truly cares about their patrons."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOTVLbEpREAE",
            "text": "The food was so delicious, I completely forgot to take a picture of the Griot (which tasted so so so good). The Plantain Brûlée was a 10/10 looked every bit of good as it tasted. The owner(s) were so welcoming and kind, I would come back based off service and vibes alone. truly can’t put into words how great the experience was!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWmJtWkVWVTVWWkV0d1NXTnFXalV3Vm1wcVUxRRAB",
            "text": "Excellent food. As you can see I didn’t manage to get a picture of the Cuban croissant before I took a few bites...The plantain brûlée latte was insane—so delicious! My boyfriend had the ‘Mazagran’ and it was extremely refreshing. Extremely friendly, good vibes, and a great way to start the day in Brooklyn. Make sure you support if you live in the neighborhood!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNk9lcjd3RRAB",
            "text": "They put saltfish on a banh mi and it was GOOD. Made me feel something.\n\nThe owner, Eric, is the nicest guy and clearly has a passion for his work. 10/10 Highly recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMGZETEdBEAE",
            "text": "Great spot for a quick bite with savory food and drinks! While the menu is small, everything on there is really good 👌🏾\n\nLoved the Iced Plantain Brûlée Latte!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbzd1R3JRRRAB",
            "text": "Latte with oat milk was delightful. Balance of espresso, milk and foam was ideal. Went well with the madeleines. The citronade was refreshing and bright. Saltfish banh mi was juicy and spicy. The pickled cabbage is also spicy and flavorful. Perfect with the pork.\n\nThe cafe owner was very helpful and friendly. I appreciated the descriptions provided for some menu items\n\nCafe atmosphere was welcoming and seems like a good spot to hang out or do work."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcF9fMGVnEAE",
            "text": "I found out about this cafe on tiktok, and I had to come see it, being of caribbean descent myself. Chef Eric took care of me and every patron that came in , in the kindest way possible. The atmosphere is ALIVE here, there is artistry in this story from the ceiling to the ground.\n\nBut the cafe's menu offerings are unforgettable - the Plantain Brulee latte is something you couldn't find anywhere else. Sweet, light, with undertones of cinnamon-y spice and slight tartness of the plantain. The Griot with Pikliz and Yuca Frites were complimented by each other, and by the savory-citrusy sauce they're served with. Couldn't be happier."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBanBIVTVBRRAB",
            "text": "I personally had the plantain brûlée latte and my friend had the sorrel iced tea. Mine was a pleasant blend of sweet and had a hint of cinnamon. The plantain on top was crunchy and a great addition to the drink. Would totally down like 10 of these. The sorrel was light and refreshing. Both are great options. The saltfish bahn mi was soooo good. I loved the crunch of the cabbage inside, and all the ingredients paired so well together. The vibes of this place are great even if the space is a bit small. Amazing music from a good sound system created a relaxing atmosphere. The two owners are extremely kind as well. Definitely coming back here again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNFpDYjRRRRAB",
            "text": "Stopped by to check out the Plantain Brûlée latte which was 10/10.  The owners are so nice and hospitable.  I can’t wait to go back and try the remaining menu items.  Great addition to the neighborhood!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcFlmOEJBEAE",
            "text": "UGHTTT ABSOLUTELY THE BEST! The best yucca fries and Lattes!!! Stopped by today and it was such a cozy, warm, inviting atmosphere. Super sweet :))) rlly cute mocha pots and mini accessories to purchase. You can stop by and sit do your work there inside and outside sitting area."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBZ3NMTUpnEAE",
            "text": "Wow! Amazing! The food was so good. Eric and Drew were so nice and friendly. Highly recommend checking this small business out! I will most definitely be back :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdnNuZnF3aHRqVWRnEAE",
            "text": "Plantain Brûlée Latte was amazing, customer service was great, kind and knowledgeable! I look forward to coming back to try some food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJTzRrTzNKLXE3YTFRRRAB",
            "text": "This place is perfect. I love working from here. Great coffee, treats, WiFi, vibes… what’s not to love?"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ05MaHp3RRAB",
            "text": "Stumbled across this place a few weeks back and it’s my new favorite neighborhood spot. Every single thing I’ve had here is amazing and the owner’s customer service and warmth is the cherry on top. You must particularly try the plantain brûlée latte and the saltfish bahn mi; bursting with flavor! I look forward to my next visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeWNIQ1RBEAE",
            "text": "Antilles is an incredible cafe. The coffee is beyond comparison, lovingly made, and will satisfy the greatest among coffee lovers. Their fresh cookies and glazed bread are also fantastic and pair very well with their coffee. The owners are incredibly talented and kind. I  recommend Cafe Antilles without reservation!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNUxXNzVnRRAB",
            "text": "Amazing coffee with vanilla cinnamon it was perfect on a cold day along with a warmed up chocolate hazelnut croissant. And the immune booster was just what I needed! Super friendly people and an inspiring atmosphere as well"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYZzcyaVlBEAE",
            "text": "Hear me out, as a Haitian American who has never had the guts to touch drugs, the one in this Plantain Brûlée Latte is the one to try! I met the lovely Haitian and Dominican duo, Eric and Drew, and wow what a team. These two have mastered the art of welcoming you home with their food and atmosphere. If you need a new third place and haven’t tried this place yet, vin lakay ou (come home)."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dk5hUjVnRRAB",
            "text": "Impeccable service ! Erick makes the best Haitian Lemonade (Ji sitwon) I felt like I was in Haiti. The BOUYON 🔥 10/10. Super cozy spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYXzllaWZnEAE",
            "text": "Really happy I stopped after a morning run to try this new place in the neighborhood. Eric (one of the two owners) was so friendly and welcoming. The food and coffee were fantastic and special.  Can't wait to come back and try more of the menu."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3X1BESWpRRRAB",
            "text": "One of my awesome friends came across Antilles cafe page on instagram and sent it to me, and immediately I knew I had to go here 🙂‍↕️\nI’m half Dominican and the amount of animosity I’ve heard from random Dominicans online or on the street, have towards Haiti since I was a child has always made me resent so many Dominicans… I’ve put this anger to bed and left it to god of course.\nSo to see this place embrace that same love I have for my friends and respect I have for Haiti in this cafe is awesome so THANK YOU.\nI don’t wanna say too much on the food because the options, chefs kiss* 🤌 the brûlée latte just buy it iced you won’t regret it, 😌 beautiful 🫶 and the croquetas too. Just go here shop Issa vibe mad cute. Highly recommend 💛🙏"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOclZXRjRRbGxHTjBSZldtdEJZamN3YW5wbGFXYxAB",
            "text": "I had the famous plantain latte and it was amazing! The owner was very nice and friendly. I highly recommend!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dk1yeDFBRRAB",
            "text": "The food was amazing and the service was even better. I got the chance to meet Eric, who is so passionate about the place and is just an all around phenomenal human being. Zoe or not, you should definitely support!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNkt2Z3RnRRAB",
            "text": "Lovely cafe; yummy food, great vibes and dope owners. Great addition to the neighborhood!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKajdqYWplanUzdHB3RRAB",
            "text": "The service was excellent, and the Plantain Latte was delicious. Definitely pass by for a refreshing beverage or light snack if you're ever in the area!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcXF0cHZGc3BfTFZnEAE",
            "text": "Their Iced Plantain Brûlée Latte and Morir Soñando are some of the best beverages I’ve ever had…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201alEyOTBaMkpuYkZka1FqUlBTbUpaUTNOTFYzYxAB",
            "text": "Quaint Cafe, with some great selections. Ordered the lemonade and it was fantastic! Definitely recommend, and will be back as soon as I can."
        }
    ],
    "reviews_count": 76
}