{
    "name": "Edie Jo’s",
    "place_id": "ChIJPbxaKMtbwokR6MhWzaWGpfc",
    "grid": "BK9",
    "address": "630 Flatbush Ave, Brooklyn, NY 11225, USA",
    "rating": 4.2,
    "user_ratings_total": 418,
    "phone_number": "(914) 229-3300",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbFMwUmtSV1pZYkROWWRtMHlVMDQyTldGS1IxRRAB",
            "text": "Edie Jo's has it all! Solid lunch and dinner staples with excellent cocktails (especially house made ginger beer!). The staff are all superstars, and karaoke on Tuesdays is unrivaled in the community, especially if you like hip hop and r&b. The decor and ambience are also immaculate, and the large windows make it an excellent place to hang through the afternoon."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJanRpYWZ3EAE",
            "text": "My favorite restaurant in the neighborhood. Good food, good drinks and great atmosphere. Since the pandemic their service has been kinda spotty, forgotten orders, etc. but nothing too bad that I wouldn't go back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWT09HVkZhMVZ4TjNSNVJrZG5Sa016UW1GRFdHYxAB",
            "text": "Went on a Sunday afternoon for a late afternoon snack.  Great hospitality for our big group and menu had lots of all day bites and brunch selections.  Also had good coffee and drink specials!  Would definitely return to this friendly neighborhood spot."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqd3JmZHlRRRAB",
            "text": "A weekend slow brunch in a chill local place. A good vibe"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CT2NHOTJSVlV0VTJKWWExRnBTRFI0ZGpGd05XYxAB",
            "text": "Love the food and the space but the music is too loud. Amazing burgers. Neighborhood vibe. But if you want to have a conversation, go during the day I guess?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeFowRnNTVzVPWDBoek1FSTJWVE5vWlRrM2RtYxAB",
            "text": "I just moved to the neighborhood and decided to try this place. The food was pretty good but unfortunately the service was absolutely awful. We were told to sit anywhere we wanted, given menus and then we just sat there. Eventually after waiting for about 15min or more I decided to go to the counter and ask if we had to wait for a waiter to order and that is when I was told that I had to order at the counter. Apparently, according to the staff she had informed us at arrival but neither myself or my wife heard it. I was asked to leave my credit card if wanted to keep the bill open which made me feel extremely uncomfortable considering I thought I was going to a restaurant and sitting at a table and not at the bar. The coffee arrived and it was fantastic, but I almost cut my lip on the cracked cup they served me. In short. I won’t be coming back, but do think the place is beautiful, food is good and reasonably priced so it got potential. The tall short hair bartender was actually super nice and came to check on us afterwards which was nice."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SmJIVjJlRXRtTXpSaVJHRnVZVTFtUjNveE4wRRAB",
            "text": "Do not order soda here .    It is old and flat every time !!   I eat here at least once a month and every time I forget they serve bad soda !\nThis place is beautiful inside but do NOT have any wait staff , so prepare to order at the counter .   All of the breakfast items are great , but the fried chicken sandwich is why I come here all of the time!!    Crispy ! Freshly cooked! And flavorful !    The decor is beautiful ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWVdreEZXV3RzZUdWUlZsOVdPRmczVlVwaGNsRRAB",
            "text": "Great casual spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMVJITmxhbnAyWXpkeFQzRTJVMlZzV2pSTE1VRRAB",
            "text": "Waited 15-20 minutes for service.  No one came to check on us.  Walked out.  If you are short staffed or busy, maybe you should alert customers.  Will never go there again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dVYxRmlaMWhsUjE5MVJGSk9RbEl4YWtSTk9GRRAB",
            "text": "Great csa location"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wc2FXVlRkVUpJUTJSbmFFczBOVU5ZYVVaMVFsRRAB",
            "text": "Lugar recomendado para desayunar o brunch. La comida es deliciosa y te sorprenderá gratamente. El ambiente es perfecto para conversar y disfrutar de un momento relajado. Una nota importante: debes hacer tu pedido en la barra del local y te retendrán la tarjeta de crédito para el pago final, ya que el espacio se convierte en un bar después de ciertas horas."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSFJqSmthVWhXVVdkRVpEaEdUbVJtVkZGTlZtYxAB",
            "text": "Five stars! I went for brunch and it was delicious. Got the bacon egg and cheese with a side biscuit and I loved it. Good Aperol Spritz. I love the laidback, low stress chill atmosphere. I need extra time to figure out what to order so I love going up to the counter/bar to order when I’m ready. The staff is so kind. The place is quiet, great for catching up. I would happily go anytime!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rdGNtbFdUa1ZzTURoelZrdGtXVUp4UzBaa1FtYxAB",
            "text": "Great neighborhood spot. Nice drink menu with a chill vibe. Food menu is served late & they have nice vegan options. You can get an actual salad!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSM01qVklkMEppVVdwdlZFOVJhRjlTZWkxNVNGRRAB",
            "text": "Overall rating: 4.6\n\nI’m in the process of trying to make this my new neighborhood spot, but admittedly have only been here 2-3x. You order at the bar and I think there are servers but they only give you your meal if you sit at a table. Hard to understand.\n\nOf the few times I’ve been there, really liked! Had the spinach & artichoke dip which was good. Def want to try other items when I have a chance! Also on one of the Friday’s I went, they were setting up for a comedy show too."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTlRIUkhkMVZTUzFCVFZtZ3piRVpLYWpkMU1WRRAB",
            "text": "Second time eating there. Food is tasty and the service is great. Playlist is fire."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aU1NIWTJWR05NWlY4M2RFZHZlVmRWZEZwalFuYxAB",
            "text": "Went there last night unaware that it was Karoake night. We stayed for dinner and left. We were looking for a quiet spot to catch up but it was hard to talk with people trying to sing... LOL\n\nThe food was very good. We had burgers and the hummus plate. Cool vibe and definitely will visit again but not on Tuesdays... the crowd was fun and laid back. All kidding aside, the vibe was cool.\n\nMy only gripe is that you have to order at the bar and they keep your card. We ordered drinks which never arrived until the waiter came with our food and we had to ask him where the drinks were. Seems like they run a tight staff on weekdays..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psYVVqZFFibDlTVTFZdFZTMXVRMFpuY1ZnM00wRRAB",
            "text": "A hidden gem in the Flatbush area! So glad I stumbled upon this spot. Perfect for brunch or a casual coffee date with friends. The food is absolutely delicious, and the vibes and aesthetics are top-tier—cozy, stylish, and welcoming. Definitely a new favorite!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sd2NrUTVVbko1VjFWSGVERk1WM294TW1KdmRrRRAB",
            "text": "Tuesday is Karaoke night 😁 it was a lot of fun.  I got there after 10pm. I guess you don't really get table service at this time because I had to get a menu from the bar and give the bartender my order, which was weird but not a deal breaker. Another uncomfortable thing was the bartender kept my Credit card after I placed my order. She didn't ASK me how I was paying; she just kept the card. That made me uncomfortable but also, not a deal breaker.\n\nThe hamburger and fries were good. Ficchota with olive oil was delicious although not exactly oven fresh.\n\nThe martini was delicious 😋. The buffalo wings were not 🚫 good. The Tres leches cake 🍰 was tasty but no coffee was available at 11pm, bummer.\n\nThere was a person named Marquis, I hope that's how you spell the name, who was an amazing spirit. I summoned them for extra plates (they quickly attended to me), they checked on me and my friend several times and when I got up to go to the bar to pay, they offered to assist and was just absolutely and completely the height of my night ( great energy and conversation) I can tell they work really hard, as I saw them doing a little bit of everything besides cook.\n\nI will probably visit again but a bit earlier."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWFgyZzRaV1ZvVVU1RlJVZDNSMWx5VVRSQmJYYxAB",
            "text": "Terrible service, 25-minute wait for a dish, the dish arrived with a hair, another 25-minute wait for a basic dish, the quality of the food is not bad, the service in general is terrible"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSlREWmZVa1kzUldWUVNrd3llVFpoZUdoRFpHYxAB",
            "text": "We came in for dinner.\nThe butcher steak was terrible.\nInstead of ice cream, the dessert had sour cream in the chocolate fountain.\nI don’t recommend this place.\nThe kitchen is weak."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M1oyNnZRRRAB",
            "text": "Best Guinness in the neighborhood."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJakMxTHEwcFl1LVpBEAE",
            "text": "Terrific experience. Welcoming atmosphere and wonderful food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZmR3dldqemEyLWx3RRAB",
            "text": "Charming place great hummus nice wait staff … beautiful lights. A great little find."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNR1gyc1hXbktxejZBRRAB",
            "text": "Burgers are good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKUHU2czJCbzQzUjhnRRAB",
            "text": "Just wrapped up at the zoo and came here for dinner with a large party + kids.  Service was excellent, food was spot on and raspberry manhattans were perfetto 🤌\n\nLooking to come back asap!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMMmQ1dWVxa3VuVFp3EAE",
            "text": "Immaculate vibes"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPZlN1cEQ1bmEzbWZBEAE",
            "text": "Some folks seem to have a problem with the fast casual service model. I do not. The bartender was polite, welcoming and very clear. I mentioned to him that we were trying to make a 7:30 show in the park and we went to find seats. My cocktail came fairly quickly but the food took a little while. I REALLY enjoyed the Chamomile Old Fashioned and recommend it but unfortunately only one of us really enjoyed their meal...that person ordered the fried chicken sandwich. My wife had the hummus plate and while not \"bad\" it really wasn't well seasoned, needed more then just the few pieces pickled vegetables that were included...and we both questioned what the red sauce was on top of the hummus. It was supposed to be a red pepper \"jam\" but there really wasn't anything \"jammy\" about it. I was disappointed with my butcher steak. While the meat was perfectly cooked and frankly very tasty with the addition of a bright chimichurri, there wasn't enough of it. There were only two pieces of \"tiny smashed potatoes\" on the plate and I'm sorry guy's, I know they can be a pain but you MUST clean the snap peas before serving them. I kept having to pull strings out of my mouth and finally gave up after a few bites. If you want to avoid the extra labor to clean the snap peas, there are plenty of other vegetables to serve in their place...but don't leave it up to the diner to figure it out for themselves."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc3ZMRm9nRRAB",
            "text": "Great Food!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJckp6SVBBEAE",
            "text": "Great place. Even better now that paper menus are back.\n\nThe one thing I have an issue with is that there’s no service in there or barely.  So ordering then, was hard. (Edie Jo’s responded to this and I can see where the confusion is - no service as in cell service when it was a digital menu and yes, you now order at the bar.)\n\nSo hardly any 5G internet. That means NO HINGE, NO TINDER or ordering sacks of cat food to feed your 12 outdoor ferals, fellas!\n\nThat’s fine though, just be in the moment with your pals or if you’re alone, then be alone with your thoughts and enjoy the taste.\n\nThe food is very good. I got their burgers and their sausage and egg samich for brunch.\n\nDo it up. Don’t be a weenie."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMTVHalhBEAE",
            "text": "So fresh off the bat walking in they gave us cups and a water container and expected us to bring it to our outdoor seating. Then I was told that when we’re ready to order that we should go inside to give them our order and nobody came outside like no waiter. I’ve never experienced nothing like this before. But nonetheless the food was really good so I would come back maybe during brunch bc the mimosas were good I had 2"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveU5xQjJRRRAB",
            "text": "One of my top places in the neighborhood, I like the mirror wall decor and the booth seating. Relaxed atmosphere, and great service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNGVIWTJRRRAB",
            "text": "Edie Jo's has such a cute vibe!  They do not take accept reservations and it appears they get busy in Saturday afternoons.\n\nThe staff (bartenders, wait staff and everyone else) was so friendly.   A bit more attention to detail would be great (there were a few drinks mixups and forgotten biscuits).  I imagine mistakes happen often since you place your order at the bar and it is brought to your table.   You present your credit card to open a tab.\n\nMy niece and I arrived just after 11 AM on the last Saturday in March.   It was not very crowded at that time.  We sat at a booth inside, but did see some people dining outside.\n\nI can personally recommend the French toast and the EJ rum punch (please note... this is NOT Jamaican rum punch...  but it's delicious).\n\nMy niece enjoyed her chicken sandwich with fries.  She also highly recommends the Moscow mule.\n\nWith tax and tip, we paid approximately $135.\n\nBathrooms were fine."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LS1la1J3EAE",
            "text": "The vibe was amazing. We've got the chicken burger, and it came so delicious, it is served fresh, the chicken was crispy from the outside and so juicy and soft from the inside, the potato chips was so good too. We tried the dolce de Leche and the lava cake, it was pretty good.\nThe other time, we ordered a French toast, and it was good too."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Z3NpMTFRRRAB",
            "text": "Excellent service and delicious food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNGFhU2pnRRAB",
            "text": "02/10/24 - Would I come back? Yes\n3/7/25 - Would I come back? No\n\nLast vs This Year Comparison - let me just say my partner and I have been here before and the food last year was so much better. More flavorful, fresher, and it was cooked just how you want it (Seems like they stopped caring and only care about money more now). We got the same thing as last year however this year she got steak w smashed potatoes instead of salmon. last year her salmon was medium well and very tasty. The brussels sprouts were alot more bitter this year and not as crispy, the sauce for it wasn’t as sweet as we remembered it to be either unfortunately.\n\nFood - My partner always gets medium well and I get well done, however her steak was cooked medium. Her steak still had a “rawness” smell to it, had visible blood coming from the meat and more pink than she is accustomed to when she had cut it open. She also mentioned it was missing more flavor, she didn’t really enjoy it as much as she wished, 7/10. We took both the steak and Brussels sprouts home added more seasoning and baked it for a bit longer and it  tasted much better.\n\nMy burger was medium well instead of well done. Not to big of a deal for me as I was just happy it wasn’t bleeding or as pink as hers lol, I still enjoyed my burger although it wasn’t as seasoned this year, I just added extra salt and pepper to my liking and the fries were great. 9/10\n\nService - Service was okay, service was also better last year, they had seated us and gave us menus, and were faster in waiting us. This year they let us seat ourself (can’t complain too much about that tho tbh but that was the first indicator of how the rest of the night would go when it came to service. I had to get up grab the menu for us rather it being on the table already or they coming to us this time and handing the menu. They also let my partner substitute the steak meal with the salmon last year however this year they told us that’s not possible and she would just have to order the steak meal & the salmon on the side. (Sounds like they just wanted us to spend more rather than accommodate the way they did last year).\n\nAs for the drinks, they were stingy with the amount, they ain’t full it up to the top as you see in the photo below (last year) but the drinks cost more this year than it did last year (make it make sense, again feels like they’re doing this now so you have no choice except to order more drinks). The rum punch last year didn’t have ginger in it however this year it did (gf not a fan of ginger). Last year they even added a mint leaf and made the drink look more appealing, making it feel more than just a bar and that you are in a restaurant.\n\nAtmosphere - Same as last year, we still like the lights that make it look stars and the candle on the table, like how it feels cozy, however we do wish they would get new chairs as those “school chairs” hurt after a while and don’t really match with the wood bench/ table interior.\nThe restroom for the most part was clean but for some reason they paper towel smelled like shit, I thought maybe they had doodoo water or maybe it’s their soap, but after washing my hands again and smelling the water and soap I realized it was in fact the brown paper towel (can’t say if it’s the actual paper towel or if someone prior took a dump and wet their hands then grab the paper towels or what).\n\nOverall we would rate it a 3 star experience this year compared to 4 stars we gave last year, maybe because we came we the same expectations and experience as last year? Regardless we don’t think it’s worth coming back again.  However if you do come here I would recommend the E&J burger w avocado and fries, got it twice and wasn’t disappointed besides the meat texture being medium well and if you want more flavor you can always add salt and pepper that they keep on the table like I did!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdkw3a3NBRRAB",
            "text": "The cheese burger and fries really hit the spot. The service was great and the list of drinks/cocktails is quite interesting 😋"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeTktdDZ3RRAB",
            "text": "I arrived here on a chilly Saturday afternoon. I opted to sit outside and requested a table there. We came inside to get menus and was told to come back in to order.\n\nWe were given an outdated menu which had food ingredients slightly different than what was on the online menu and some weren’t on the new menu at all. Settled on spinach dip, burrata and Mac/cheese with two drinks.\n\nWe had to ask for heat, which took a while to come on, & then had to request extra heat because it was still cold. It never came on.\n\nThe Mac & cheese i ordered might have been the worst I’ve ever had. There was legit no seasoning and the spinach dip had more cheese than the Mac did.\n\nThe burrata was hard and tasted store bought.\n\nThe drinks were actually the highlight here if they have the ingredients for what you want. We additionally had to ask for water and were just handed a carafe with two glasses on top.\n\nThe service and food were horrid smh. The waiter/bartender/hostess was friendly though which makes me feel bad leaving this horrible review.\n\nI’d think if you offer a dining experience you would be able to adequately provide good or even decent service regardless of where a customer is seated. I’ve managed multiple hospitality settings as well as kitchens & your restaurant is lacking in service and food.\n\nI ate at a better restaurant the same day, and had no issues with food quality. There was only one heater that worked throughout the entire outdoor seating area, it wasn’t even over our table. And i am again sorry to say the Mac and cheese, & burrata were awful. You can see the mac is dry from the photos.  The burrata came out hard & cold.  At the very least get rid of the outdated menus.\n\nPlease work on providing good (decent) food and service to customers at your diner instead of arguing in the reviews. I would never come back here lol. Thanks though and good luck to your business."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbHZIWF9nRRAB",
            "text": "The bartender was a female who thought it was ok to talk to the owner more than take care of her patrons....I had to wave her down for each drink I had....tell customers u don't want there business without telling them....the owner should know better but the worker should as well but I can spend my money other places that I don't have to get the attention of the staff to place an order....it wasn't that busy mind u.....to b clear I was sitting at the bar...."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmb3RXSXRnRRAB",
            "text": "Delicious and surprisingly reasonably priced. Loved the seasonal lemonade & the food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzai02eXBBRRAB",
            "text": "The reason for the low rating on service is that the wait staff doesn't take your order. You have to go to the front counter to order. At least, The food is delivered to your table. We had brunch. The food was well prepared and tasty. The staff were friendly. The restaurant is comfortable.  Other than the problem with the service, I recommend it highly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYazh5cTFnRRAB",
            "text": "Lively staff, very attentive"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOU9Ea3hRRRAB",
            "text": "Really enjoyed a quick Sunday brunch with our friends. The staff is wonderful, the service is amazing, and you cannot go wrong with the fried chicken sandwich! Good house fries too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubksyejJBRRAB",
            "text": "The atmosphere was top teir and the service was amazing! This was a spur of the moment decision to go and the food was amazing!!!! I highly recommend this spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaW9fMUl3EAE",
            "text": "My husband and I had brunch here on Sunday 9/22/24. At our son’s recommendation . They do not offer waiter service as we had to find a table then go back to the register and place our order. Of which I was told they would hold my credit card until I closed out the bill prior to leaving. I was not comfortable with this. No one should be! I paid at the time I placed my order. Was asked if I wanted to include a tip. No, as I wasn’t receiving table service plus I ordered at a register.\nUpon looking at my credit card statement I see the server took the liberty to add a 20% tip. Of which I did not authorize.\nOnce food was brought to the table she never once came back to see if we needed refills on our drinks. Nor check to see how we were doing.\nIf it’s your policy to have people leave a tip prior to any service on your staff’s part because you don’t pay them a living wage. It is not my place to subsidize their income when they have not done the work.\nI will not be returning!\nCynthia"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaXVleTZnRRAB",
            "text": "One more gem in this neighborhood.  Intimate, casual and delicious all around. Great service and I loved the beer selection too. Need to come back for the drinks - looked very promising."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeVlXbmN3EAE",
            "text": "Jesus saves. ✝️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIaVltd3pnRRAB",
            "text": "Great spot, especially for brunch with a larger group. The prices are very reasonable and the food and coffee were good. I got the sweet potato hash and we also enjoyed a few of the sandwiches. Would recommend if you’re in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdmNhNFh3EAE",
            "text": "Such a great neighborhood spot! Never lets me down"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdVlPN2lBRRAB",
            "text": "We like this place a lot - excellent burgers and the atmosphere is fantastic. However, I’m taking off stars for being moved from a booth when it was slow on a Friday. I’m here with a work friend. The booths are comfortable: there was absolutely zero reason to move us after telling us to sit anywhere. We will probably not return after this because we like booths and it was ridiculous of the otherwise lovely server to move us. Other than that strange moment of not feeling welcome in an empty restaurant on a Friday afternoon, lovely."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlLXRfY3FBRRAB",
            "text": "Update: I was here recently, and the service left a lot to be desired. There were no more QR codes but nobody came to take our order. We kept getting up to go to the bar to order, but the bartender kept forgetting our drinks (at one point a half made aperol spritz sat on the bar for twenty minutes until i got up to ask for it again). I think the concert in the area made it busier and they weren't staffed appropriately.\n\nThe food was still great, the drinks were hit or miss, the atmosphere was lovely.\n\nFood was amazing, I especially recommend the fried chicken sandwich. Very cute space, good music.\n\nWe did order coffees to go after and I would not recommend that. They took a very long time and were not particularly good. I am also not a big fan of the order through your phone system, I like to enjoy my experiences phone free."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKLWVXQ2VBEAE",
            "text": "I had a burrata with strawberries salad and 2 watermelon frozen margaritas with dry slices of watermelon in the drink. My partner had  a mixed greens salad, the dressing of it was very special. He consumed his salad with the Paloma drink. We enjoyed the service. We were always very well taken care off. I highly recommend this place, they seem to have options for allergies and their service is there for you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGc3FHMS1BRRAB",
            "text": "Gave this spot a second try after we had an incident with our credit card and I’m glad we did. We came on a Saturday afternoon and the vibe was right! We were seated right away and had great service from a waitress named Brianna (I think) she was attentive and was able to answer all our questions for just about everything INCLUDING where we could be posters for our friends who are running the marathon! The food was good and the hot chocolate was bangin! Prefect spot to chill if you want to drink and eat at the bar, inside or outside seating and I think I may get that wallpaper that was inside the bathroom 🤣"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M2ZpTlFREAE",
            "text": "I really enjoyed my time here! Luckily for us, it wasn’t crowded and were able to find a table without a reservation. The ambiance was wonderful! It felt you weren’t on Flatbush anymore. The service was friendly and fairly speedy. Our food was so good and the portions was of good size. Our drinks were so delicious and really fit for the season."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4c3VxeE1nEAE",
            "text": "My boyfriend introduced me to this restaurant. He knew it well and was versed in the menu and in drinks.\nThe chef deserves a bow down , very delicious dishes prepared with taste and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbTlyTzBBRRAB",
            "text": "We hosted the rehearsal dinner for our wedding at Edie Jo's and it was absolutely perfect! In Brooklyn it can be so difficult to find something that has availability and isn't going to break the bank. We worked with Kit who was flexible with our budget, let us plan the menu to our exact wishes, made custom signs for the food/cocktails, set up a mic for speeches, and more -- she really went above and beyond! The restaurant was so accommodating to our event and everyone raved about how good the food was. And there was PLENTY of it. Edie Jo's shut down the entire space for us for four hours. And even let us take up a few tables to keep hanging out after our event ended. We live in the neighborhood and have been for brunch/dinner many times and it always hits the spot, their fries are the best!!! Definitely recommend for a dinner out, but also want to shout it out as a hidden gem for your next event!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNmF1V29RRRAB",
            "text": "First let me say that the hostess was very welcoming. The first introduction of any establishment always makes the first impression and she made the best. If I'm being honest this place wasn't my first option but it was open and I was hungry. What's interesting about this place is the menu is virtual. You scan a QR code for the menu, order straight from a website and pay through your phone. The French toast was really good, strawberry and blueberries were fresh. The toast had a nice chew to it especially with the maple syrup. The open biscuit sandwich with sunny side up egg, cheese and beef pork sausage was delicious. The patty was thick and has some herbs which were present when you cut right through it. Even though I would have preferred a turkey or chicken sausage alternative, I liked the added twist of maple syrup drizzle. It was still savory enough that there was no need for ketchup. And the fresh OJ was on point. Price wise it averages depending on what you get with similar places in the area. But overall it's a good option in a pinch if you're in the mood for brunch. I would like to see a more expensive menu and substitution options. And one minor negative would be that my table had a cup water stain but I personally didn't see the need to make a big deal about it since it was barely visible and dried up."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNweUlfb3RRRRAB",
            "text": "Great little restaurant. Very cute decorations/mood to it. They host karaoke on Wednesday nights.\n\nThe food is good. I had the cheese burger and fries. There was a nice char on the burger which made me think it’s flame broiled. Nice touch if it was. The fries are identical to McDonald’s. That’s a good thing.\n\nBurrata and strawberries were really good. Wish it came with more. Only two pieces of bread.\n\nDrinks were great. Especially the Parisian Collins. That was really good.\n\nThe Mac and cheese was OK. My partner enjoyed it, where as I thought it lacked some flavor. However It was not bad.\n\nWings were good. Lightly spiced. Well seasoned. Nicely sized as well. Will have to try the bbq option next time.\n\nTheir ordering system is a bit wonky. We couldn’t order as a group? Which in our case was totally fine as I just would pass the phone to my partner. However, I think the intention is to allow multiple people to order on their separate devices. Our initial server even mentioned that it acts up sometimes.\nWe were also told not to pay via the ‘pay tab’ option on the phone, because it apparently doesn’t work? Feel like some improvements could be made on the client facing side of the POS. Besides the initial tiny hiccup, the ordering process is very straightforward.\n\nEither way, our experience here was still phenomenal and we will for-sure be coming back. Shout out to the nice staff!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweG9mZVRREAE",
            "text": "This venue is superb, from the delicious cocktails, exquisite food and views, as well as the professionalyet personable staff. It all made this one of the finest dining experiences I have had. There is real vertical grass growing from the frames, and the awesome bartender kept things lively with his banter and delivered an amazing margarita. This is a must visit if you are in the area."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDM1Bhd2ZBEAE",
            "text": "I’ve passed this place on my bike over a hundred times and never knew it was there until I walked. It’s a really nice discovery. It’s strict about the social distancing and even has a menu that you access in your phone. Outside dining and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybTRTMkJnEAE",
            "text": "Wow. Such good food. Their cold brew coffee is delicious. Burger was perfect and so many french fries. My sister in law got the french toast and it was huge\nShe was stuffed. Easy to order. Not much table service but that’s ok"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMXFDUHFnRRAB",
            "text": "Spacious, clean, and charming spot for tasty meals. Friendly staff,  tables large enough for big groups, and an intimate bar. Nice lighting and big windows for people watching and great natural light during the day. Nice, comfortable, and just slightly overpriced."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVeDZ2a3Z3RRAB",
            "text": "Fun spot with bright, spacious, well-lit interior right on Flatbush and close to the train. Had a great cup of coffee and noted a menu that had many go-to breakfast items and an evening cocktail menu. Lots of tables and room, excellent WiFi, and friendly service. Nice spot."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHd0tpX0lnEAE",
            "text": "Been wanting to come here for some time after hearing good things. Food was good, service wasn’t. Our server asked if we wanted any cocktail recommendations. I said yes, I was just looking at the list - what’s something good? “Uhhh I need to see your IDs” (again, after we already showed our vaccine passports 5 minutes prior) and proceeded to tell me “that’s a very under 21 thing to say.” (I’m 25) What the hell does that even mean? Also took 30 minutes for an iced coffee"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNbnFXemhnRRAB",
            "text": "Had a Guinness and a pork sandwich for lunch today and it was easily the best sandwich I have eaten in a long time.  The pork was amazing and the kimchi slaw was perfect.  The Guinness was also top notch.  Will be back for dinner and cocktails..  I hear their limoncello is spectacular"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrXzR6bmhBRRAB",
            "text": "Staff is knowledgeable and friendly. The space is well thought out mid-century modern style and very cozy. I also love the amount of windows going on in the space. The drinks were really great too. We especially enjoyed the cocktail for…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaGEzZF93RRAB",
            "text": "The food was okay. I had the chicken sandwich and my friend who had the burger said it was better. I liked how you could order online and they would just bring the food to your table. But the food variety was very limited, they were basically only two types of sandwiches to choose from."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab3A2SlVREAE",
            "text": "Awsome brunch spot, the service was on  point and the food was made in a timely manner in which it didn't disappoint. The atmosphere was cool and layed back with the lighting setting up the mood. Overall, it was a great experience with the try."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2c19iRDNBRRAB",
            "text": "Wow!! Came here for brunch with the girls and our server Hazkel made this a wonderful experience. He was very attentive and helpful with recommendations. We tried the Mac & cheese, sweet potato hash, and of course mimosas! Everything was delicious (no food pics, we ate it all up!)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCX2ZqUWRREAE",
            "text": "Super cute and cozy place! We really enjoyed being there!\nThey also have a very nice fried chicken sandwich."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOHJqMGVnEAE",
            "text": "Everything was great! The sevice was top notch. Will absolutely return! The apps and drinks were great!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDcjg3ZzV3RRAB",
            "text": "I never had many opportunities to visit Edie Jo's during my 2 years living in the area, but COVID-19 — and my personal desire to find the best egg-cheese-avocado biscuit sandwich in Brooklyn — helped to change that.\n\nEdie Jo's is a quaint and calming presence in the neighborhood, with a lot of great options for brunch, lunch, happy hour and dinner. A few of my friends who had lived in the area longer had always highly recommended Edie Jo's for all things, and I was very fortunate to go to brunch with one of them prior to the pandemic. At that brunch, I had a delightful meal that made me all the more excited to come back.\n\nUnfortunately, with the pandemic and many businesses having to quickly shift what they needed to do to survive, that took some time.\n\nHOWEVER, as businesses reopened for takeout and delivery and dine-outdoors, I wanted to make an effort to get back. And boy-oh-boy, am I glad I did for this specific sandwich.\n\nWhen you think of NYC, you should think of BEC, the classic bodega breakfast. However, if you're like me, you gotta switch that bacon for avocado, and *really* search for that perfect biscuit. Edie Jo's has that, TO A T. Truly, one of the best ECAs I've had in the city, and what I got myself for lunch as I moved away — you can't miss this, and you should definitely eat it at least once per week, as per doctor's orders :)\n\nI would ask that the restaurant look to include some more vegan and vegetarian options on their menu, BUT am incredibly grateful that I was able to edit this sandwich (originally the Sausage, Egg and Cheese on the brunch menu). Go visit, and enjoy!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNHZmRnBnRRAB",
            "text": "I heard amazing things about this place, but my first time trying theirs food wasn’t. We walk in and order two breakfast sandwiches and fries for take for a park picnic. Not only did we wait 40 minutes for our sandwiches, when we started…"
        }
    ],
    "reviews_count": 72
}