{
    "name": "Akwaaba Restaurant",
    "place_id": "ChIJw1u8XmlbwokRq8_uoYyOEsQ",
    "grid": "BK9",
    "address": "604 Parkside Ave, Brooklyn, NY 11226, USA",
    "rating": 4.4,
    "user_ratings_total": 196,
    "phone_number": "(347) 985-2588",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVE1HeFhSVlppVm5NdFpWRkRTRjk1VEhwTlJXYxAB",
            "text": "Most walk by without noticing this place. This restaurant knows how to set the perfect scene. The taste experience works, service flows naturally, and food quality justifies the cost. Staff combined warmth with good information. This spot should be prioritized."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weVNHSk1aMnRTVUhKSlJIZEZjR2xPY2pkU01HYxAB",
            "text": "I notice every service interaction. Their dishes matched my taste perfectly. I discovered a true hidden gem!!! The employees balance efficiency with real connections. I'll return to give them higher scores."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0blprdE1URll3Y1dSUldXSmtaRUpvU2xsR1FuYxAB",
            "text": "Nice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUFRXbEpTVk5sVWs1NmJYTnhOakF6ZDJkWk5HYxAB",
            "text": "Good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLTGc2X1RidFBHQ0VREAE",
            "text": "This place is customer service CRAP!\nI ordered, asked me to pick up in 20 minutes. When I came to pick up 27 minutes after my call, he was about to get the food ready. And got the nerve to tell me he forgot.\nTheir food get costly and the service crappier."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMTdfaEN3EAE",
            "text": "closed on mondays..cash only..hidden spot..."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveTk2LUFnEAE",
            "text": "I walk 30 minutes just to take an African test, so please don’t disappoint me about trying the food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbUtHUi1BRRAB",
            "text": "Another African restaurant that would blow your mind with their delicious recipe. I was really hungry as I drove past Flatbush. I just had to google any African restaurant near me, that was how I drove to this place. It looked really small, more like it was built for takeout only. But as soon as my jollof rice came with vegetables and goat meat! Hands up 🙌🏽 I gave the 10 stars ⭐️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcm9DemFnEAE",
            "text": "Restaurant is small, I wouldn’t sit to eat there. I really love their black spicy pepper(shito) and kenkey. Can’t say much for the other items on the menu tho."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNk9EVlRREAE",
            "text": "The food here is absolutely delicious!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnek0yUlJREAE",
            "text": "Got the Jollof rice with goat meat. Was very good. Cash only"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBeHQtcWl3RRAB",
            "text": "The food is really good and flavorful, especially the jollof rice. Make sure you bring the cash. Only cash payments accepted.\n."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNl9HM1NnEAE",
            "text": "Papi & Mami,\n\nI wanted to bring in the New Years by giving you all a phenomenal review.\n\nFor years, I’ve eaten from this wonderful family-owned establishment and it truly brings the comforts of Ghana to New York.\n\nWafa - your jollof can rival Epo in Osu (if you know, you know 😉).\n\nI’m a Black American married to a Ga man and while I’ve learned to make several West African dishes, I’ve yet to master okro stew… that’s where Wafa comes in 😉. We moved to Queens and my husband tries his best to go to Brooklyn every week for okro stew 😂. But we don’t mind the journey because every time we go to Akwaaba, it’s like visiting family. The amazing food is one thing, but being in good company is what makes this place truly special. There’s laughter, joy, and genuine love. I can proudly say that I’ve tried everything on the menu and nothing falls short of amazing.\n\nThank you for the kindness and hospitality you have shown me and Jeff over the years. God bless you all."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cHRmdjVRRRAB",
            "text": "My $25 goat dish had 1 edible piece of meat in the whole dish. The rest was fat or tendon pieces. The goat was 98% inedible. The fufu was fine but the okra was so spicy I only ate a little before throwing it away. Disappointing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQN183aExBEAE",
            "text": "Great Ghanaian Food so delicious the owners are great respectful people. I go there pretty often with my toddlers because they love fufu. Thank you for opening a great restaurant may you continue get plenty of customers. FYI They only take cash."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNk9mMG1BRRAB",
            "text": "I immediately got a sore throat after eating from there. The sore throat didn’t go away for days and now have non stop coughing.\nIm afraid the food was contaminated.\nOut of $25 for fufu and okro and got sick of it.\nI would not recommend. So scary"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMEotVElBEAE",
            "text": "Had the fufu for the first time and it was delicious. I was hoping for more vegatarian options but overall the food was really good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dDV6ZmVBEAE",
            "text": "Food is always fresh and authentic. To bad there are no tables to enjoy the food in the restaurant ( thanks to covid ). But so worth coming for meal you can indulge in at home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOOWQ3eVNnEAE",
            "text": "Food was good but a little bit pricey !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1a09QdlJREAE",
            "text": "The food was a good portion, but not especially cheap most things were in the $20-25 range, and cash only. I was in a group that got several things. I myself got the goat with okra and fufu. I usually never have problems with food textures but the texture was disgusting it was like a bunch of sticky slime, and only two small pieces of meat, and a bunch of hard cartilage like stuff. The flavor was ok as in if the texture was ok it would be neutral not good or bad. The smell of the dish was awful it smelt a bit like rotting meat and dog food, everyone in the group I was with agreed it smelt like rotten meat and wouldn’t eat it. Since you eat this with your hands i got some on my hands and then washed my hands after, but later that day and even next day my hands smelt like rotting flesh even after thoroughly cleaning under nails and everything many times. Everybody else in group thought their food was alright with the exception of the other person who got the same thing as me, he couldn’t stomach it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabzdDNlBREAE",
            "text": "Giving three stars because this is a small business. I Really want to give 2 stars.  The jollof rice was on the dry side and some grains harder than others. The fish was tasty. The okra soup was very oily.  Fufu was good. The price and portion size did not match.  I need to try other Ghanian/ West African restaurants."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaeUt5OEFREAE",
            "text": "The food was good. The people was nice. I got my food as takeout , so I can't say what the service was like."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwb2VqWjV3RRAB",
            "text": "I ordered Okra soup with fufu well seasoned good portion and tasty.\nDEELICIOUS..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMk0tS25BRRAB",
            "text": "The okra and goat soup was amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaDZudEVREAE",
            "text": "10/10 Everytime !! Definitely Recommending To You ."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMVpqemdBRRAB",
            "text": "Akwaaba beckons with a warmth that perfectly encapsulates its name – ‘welcome’ in the Akan language. This culinary gem offers an inviting gateway into the heart of authentic African cuisine, taking patrons on an enchanting journey of robust flavors, textures, and traditions that captivate the senses and enrich the palate.\n\nThe Fufu with Goat Meat Peppa Soup stands tall as a testament to the restaurant’s culinary prowess. The fufu, a staple West African dish, is expertly crafted to the perfect consistency, providing a soothing canvas for the peppery elixir it’s served with. The goat meat, simmered to tender perfection, adds a depth of richness to the fiery soup, resulting in a harmonious balance of flavors that is both comforting and invigorating.\n\nThe Peanut Soup offers another peek into the kitchen’s culinary magic. The soup, a delicious mélange of smooth, creamy peanut butter and traditional spices, evokes a sense of nostalgia and homeliness that is hard to resist. Each sip is a reaffirmation of the depth and versatility of African cuisine.\n\nThe centerpiece of this gastronomic journey, however, is the Jollof Rice with Fried Porgy. The rice, a vibrant orange testament to the blend of spices it’s cooked with, is perfectly complemented by the fried porgy. The crisp, golden-brown exterior of the fish conceals tender, moist flesh within, creating a contrast of textures that harmonize perfectly with the bold flavors of the jollof.\n\nEvery visit to Akwaaba is more than a dining experience; it is an immersive journey into the heart of African culture and culinary traditions. The menu is a testament to the rich diversity of African cuisine, each dish crafted with precision, passion, and an unwavering commitment to authenticity. Dining at Akwaaba is not simply about satisfying hunger; it’s about embracing a rich, culinary narrative that continues to shape and inspire."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdG9XdnhRRRAB",
            "text": "The gentleman who took my order was very pleasant, I ordered jollof rice, with goat, okra soup, and pounded yam. When I tell you it was delicious i live in Delaware, when I visit NY again I will definitely go back to Akwaaba. The best African cuisine!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaElQR05REAE",
            "text": "Absolutely 💯 delicious. Akwaaba is a must try for an authentic African meal. My sister turned me on to it. I am already planning my return. It is that yummy.  No atmosphere because its takeout but who cares.... it's so good I'd be willing to eat it in the car. Lmao"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aDZteVBREAE",
            "text": "The service was definitely friendly and helpful. The food was okay while the price was a little steep for more than one person."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N29tWjd3RRAB",
            "text": "Okra Stew w/goat meat and fufu: words can't describe how delicious this was! I've been craving this for over 20 years!! Mission Complete!! Definitely fulfilled my craving!\n\nService: Excellent / above and beyond! Angel sent!!\n\n**Dated a guy from W.Africa in h.s.(parents cooked) and fell in love with the food (aka love potion). Been on a mission for this exact taste for 20 years  (no joke) due to Seattle not having any W.African restaurants.\n\nMy friend and I specifically went on a mission (yes we got lost and took an hour sub to get to this place) to find out they were closed. The owners (I wish I caught their names) felt for us and made sure we didn't leave empty handed.\n\nIf I ever go back to NY this will be one of my first stops!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd2NLd29nRRAB",
            "text": "This is not a seat down and eat place but the food is delicious! I get fufu with light soup and goat meat which cost 20$. It's cash only!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeXVMaTRBRRAB",
            "text": "It’s not really a sit down and eat restaurant because it’s a small diner. It’s best to order ahead of time because the wait time is long due to its popularity ☺️. I got the waakye with Goat meat , it was amazing  had to order a plate to go😊😊 , the jollof was alright. Next time I’ll try the soup."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNXFIWXpBRRAB",
            "text": "Absolutely delicious. Fufu with the okra goat stew was so good. Excellent portion size and friendly staff. 10/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodW9HdEVBEAE",
            "text": "💪"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLWZqMG5RRRAB",
            "text": "The food is good but the service is horrible because of the wait, they have a small place they can't have too many people in there. Even if you call in your order there's a wait!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcE5DeXd3RRAB",
            "text": "They didn’t have anything but okra soup"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCME95NWRnEAE",
            "text": "Came all the way from New Orleans & they closed 🤦🏾‍♂️ caught the train from my hotel just to check it out I’m bummed. Why it said they open…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbjZmbkNBEAE",
            "text": "Great delicious food from Ghana West Africa."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMjgtVlZBEAE",
            "text": "Delicious taste of Ghana in Brooklyn, I had their yummy waakye, fish, shitor, garri talia, hit the spot when I was just back from Accra & needed a fix! I really enjoyed my meal, they also have malt, Alvaro etc."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldGM2a1hREAE",
            "text": "Too expensive for how it taste unfortunately"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlenJ5WDBnRRAB",
            "text": "I would like to start off and say I don’t usually like to leave reviews however when i believe I have received something worth talking about I don’t believe I should keep quiet about it.. This place is I personally believe is a hidden gem. I don’t believe I have the right amount of words to describe the way I feel about this wonderful place.  Very good food and nice people, small place not really for dining in… however my husband and I wanted  went for take out it was Saturday evening and we wanted something different from the usual takeout spots that are around us so we have decided to pay this little restaurant a visit, I have passed here a few times however I never went in, but I did promise myself one day I will come and try their food especially after reading such wonderful reviews about this place and their food.. when we finally decided to go and try it out we were greeted with this little woman just about the same size as me lol, she was a bit quiet but not rude at all I we did not feel unwelcome at all,  there was also a man there who came out from the kitchen who believed may have been the woman’s husband if I am not mistaken, which who also did not have much to say,  but nonetheless also greeted us..  this was not our very first time trying African food however it was our very first time having Ghanaian food, so I loved how the woman took her time to answer our questions and explain to us everything on the menu that we asked about…  I am very pleased to say that this was not a bad first time experience, at all. I can honestly say that enjoyed it very much…. I had Waakye with goat meat and plantains, my husband had the okra soup with assorted meats with a side of pounded yam which he also enjoyed very much , the food was very well cooked and also very well seasoned which made a very enjoyable and flavorful experience , it also had the right amount of spice which is a huge plus, since I and my husband are of Caribbean back ground so we are used to spice in our food, which also help brings out the wonderful and unique flavors of the food.. so I’m pleased to say I believe I may have found my favorite African place to eat. I Will definitely, recommend to anyone willing to try generally African or specifically Ghanaian food for the first time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlb3IzdWJREAE",
            "text": "Very nice people, and very good food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlamNHZWh3RRAB",
            "text": "Amazing ghanaian food although it took a long time to get our order. Loved the fufu and jollof and everything we got"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MGJxVzZBRRAB",
            "text": "Went there twice! Try their Fufu and Okro soup, DELICIOUS!!! The place itself doesn't look like anything.  You'll go there and leave. They don't have a menu, so you pretty need to know what you want ( can check the Google reviews,  and see…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cDRqaGtRRRAB",
            "text": "First time trying West African food and Akwaaba lived up to the hype! We had jollof and goat light soup and both were incredible."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPamVibk9nEAE",
            "text": "Good food"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2X0pfVmxRRRAB",
            "text": "The food at Akwaaba is sooo good. It was incredibly yummy. I just loved my Ghanaian joloff and the shito is to die for. This is definitely a go-to spot for your joloff cravings. The price was also very reasonable. The man at the counter who took my payment was so friendly and charming, we even shared a few laughs while I waited for my food. I will most certainly be going back to Akwaaba whenever I'm in the NY area. I Highly recommend it!\n\nFYI: When I go back I would be updating my picture since the one I posted here had half the food missing haha. I just couldn't find the strength to put my fork down to snap a quick pic of my plate once I started to dig in. I bless the hands that made it. Many many thanks, and see you soon!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNThuWUt3EAE",
            "text": "Excellent..the okra stew with banku,jollof rice with fried fish and wache with fried goat excellent...\nBrought food for my non Ghanaian friend and was hoping secretly that the food would not disappoint and it exceeded my expectations...In the bronx the Ghanaian restaurants food taste horrible."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbDUtV1pnEAE",
            "text": "I got 1 order of Jallof rice with goat and 1 order of light soup with goat ( comes with fufu) . Restaurant does not provide menus. I checked w reviews before I purchased and my two dishes should have cost me $28. I waited for my food for…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHcS1IOEJnEAE",
            "text": "OMG. BEST JOLLOF RICE EVER. Trust me I’ve tried Jollof from different African countries and this is the best."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdklLenFBRRAB",
            "text": "Really cute African restaurant on Parkside Ave, not on a main road so you won't see it unless you randomly pass or search for it. The staff was very friendly and helpful. I had the jaloff rice with beef and veggies. The rice and veggies…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHMzlYdi1RRRAB",
            "text": "Some of the best Waakye I've had, definitely the best in Brooklyn!\n\nI have had a hankering for Waakye since I moved back to NYC from Baltimore. With so many Ghanaian restaurants in the DMV, including friends and family, I've never had to worry when I had cravings. However, I thought I would have to make everything myself after moving back to NYC. Thankfully, I came across this place on Google with good reviews. I travel all the way to from Queens to the middle of Brooklyn for this Waakye, and it did not disappoint! I can't wait  to visit them again. Thankfully they are not close, so I won't order here to much as I am supposed to be on a diet."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4bkp1SjJnRRAB",
            "text": "They don’t have a huge menu but the food is good! My friend who is Ethiopian only has jollof rice once that I made (I’m Nigerian) and she said it was really good. We had jollof rice and fried fish. All that did $15. Well made! Is actually very popular! Definitely come in!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2azVLZGRREAE",
            "text": "Went here to eat before the WizKid concert tonight. My husband ordered Okra Soup and I ordered Goat meat. It was so delicious. The service, the food, the attentiveness. I highly recommended this place. Amazing time!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcE96THBnRRAB",
            "text": "Damn that was good. It's small, and there's no particular menu, but if you ask for a plate of rice and fish and plantains you're gonna be happy.\nI'm an especial fan of their beef. The portions are big and the rice is perfect with the spice. Not much else to say other than it's cash only"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcWVubW1nRRAB",
            "text": "There's no menu, so I suggest you know what kind of food you would like prior to coming. I ordered the Light Soup and Fufu for $13. DELICIOUS DELICIOUS DELICIOUS! The staff was very kind and helped me decide on what to get.\n\nDefinitely going back for more soon^^"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLNnF2aEp3EAE",
            "text": "Best for your take out Ghana select dishes. Call ahead ask about the menu. Great portions. Banku with okro soup! You'll love it!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwemV2THhRRRAB",
            "text": "Always ordered here but lately salads arent fresh and when you ask for fridge salad they give an attitude then state the ones on top are cold but they aren't, they're soggy and stale tasting. Just not kool."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVMnFiRGVnEAE",
            "text": "The food was great. But the place itself was okay. They didn't have a menu so if you didn't know african food, you won't know what to get. It's a little hole in the wall"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJaGJxYjJnRRAB",
            "text": "The food taste like it was three days old even when he told me he was cooking fresh beef. Too expensive I’ve had cheaper and better tasting food. Too small of a plate for $15 dollars. Menumehu"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNna3NYaU9nEAE",
            "text": "Good food. Nice owners. No menu. Ordered waatche and jallof, $13 bucks a plate. Enjoy a cool star beer while you wait, because wait you will, about 20 mins."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeWFiOHVRRRAB",
            "text": "Food is very delicious but not a real restaurant, wait time for food is ridiculous. You better call and order one hour earlier. Parking is another story. I gave it a 5***** for the FOOD."
        }
    ],
    "reviews_count": 62
}