{
    "name": "Red Chaconia Cafe",
    "place_id": "ChIJGXDWOgBbwokR83vUFIvphjQ",
    "grid": "BK9",
    "address": "616 Flatbush Ave, Brooklyn, NY 11225, USA",
    "rating": 5,
    "user_ratings_total": 65,
    "phone_number": null,
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GeGNrZHBZazFZT1dvMU16VkVRbGxZY1dKUVdYYxAB",
            "text": "Perfect brunch vibes!! Happy to have this place in the neighborhood.  It really is a gem. Great menu-something for all and really cute space. Love the music, the coziness, the brightness. They did a great a job with not only the space but really offering good food options. Support this place."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxblJsQk9VMVkxVERkcE1IWnFSMEk0UldoNGRGRRAB",
            "text": "i don’t write reviews often so please know i mean this with all my heart: this place makes the best french toast i have ever had in my life, the coffee is incredible, everyone is so nice, and the vibes are amazing, please come here so i can continue to get this french toast forever"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMU5FUmZjelpGVFV3eFNFRnVNM0p2UVRJd2VFRRAB",
            "text": "Seriously I want to give a big shout out to this Establishment not only There Chai tea , coffee and food is Amazing they Really have some A1 Quality Service. This is a special place. Certainly earned their 5 stars and I’ll definitely be back again shortly. ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObVdreFlTMGw1Vkc5elNsZG1PRFo1TmxCUWRIYxAB",
            "text": "Peaceful cafe with great food and kind owner!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NE1FZHRNMlJNWTBZeE5rbEJkRVpLYjNsbU5sRRAB",
            "text": "I discovered this little cafe today - the food and coffee were excellent and I got a lot of work done as it was so peaceful inside.  Come check it out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OYVVtZHVTMjVxYVMweVR6a3phWFpUV0hsUFJXYxAB",
            "text": "Burrito was amazing and the people are extremely nice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaldWSjJhbE5sVWt4MVRFZHpUVFZETUdOUlNFRRAB",
            "text": "Great, fresh food - delicious. Warm hospitality!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdU0zQjBWV3RmTTNSSWNVVmFaV1JUYlhoUmJVRRAB",
            "text": "Best BEC in Brooklyn, best ambience fantastic service fire cold brew 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eU1WRlNUek5YYW5WNVgzQk9OMVF3V1Vaa1QxRRAB",
            "text": "Dare I say, best breakfast sandwiches in Brooklyn. Even better service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200emVHazRSbGRWZFRobVl6UkhlRk5aY1ZOeGVFRRAB",
            "text": "Great food, refreshing drinks and friendly owner and staff! I got an egg sandwich and it was gourmet tasting for a fair price. They even gave me a free iced drink to try and it was awesome, definitely going back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OS1ZsTkhXVFI0WWpsSlIyRm5hbk01U1VWTWNrRRAB",
            "text": "This place is amazing.\nfood: DELICIOUS.\npeople: SWEETEST."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMeVpvODdRbTdMVjJnRRAB",
            "text": "Exceptionally good food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKS251c3lGeC1yLTdBRRAB",
            "text": "Me and my partner went here for a Sunday brunch and the avocado toast was delicious! The cold brew and chai latte were also exceptional. Everyone there was extremely friendly and warm :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNSzJfcERzd0pUTnlBRRAB",
            "text": "The food is delicious!!! We had the burrito and the croissant, both really tasty. The staff is friendly. Great overall"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPYS1xYUNKM0puTXFnRRAB",
            "text": "Absolutely the best spot ! REALLY GOOD FOOD. Cozy and friendly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeWZDX05REAE",
            "text": "This location is amazing from the atmosphere,the people and the food of course.Alex and Amber are amazing.my go to spot for the last few weeks ❤️‍🔥"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3c3ZldXBRRRAB",
            "text": "Super friendly and welcoming staff, excellent food, great music/vibes for a chill brunch"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM0tpa3VnRRAB",
            "text": "It's always a pleasure eating here, the establishment is artist friendly and pet friendly🤍"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNXFQMlJBEAE",
            "text": "Very cozy. I had the omelette croissant sandwich and it was delicious. Alex is very nice and friendly. Would definitely recommend this spot."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNXJtNlNBEAE",
            "text": "Very cute place, and alex is a good server"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc3VEanR3RRAB",
            "text": "such a sweet cafe, delicious food and coffee, great music, awesome place for breakfast and to work. will be back!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcVA3b3BnRRAB",
            "text": "Stopped by Red Chaconia Cafe had the Burrata Toast and house blend modcup coffee, delicious. Everything was superb, fresh hot and very flavorful. I Definitely recommend this place for coffee and food. Great atmosphere and friendly people in an awesome neighborhood. Thank you Red Chaconia Cafe for being here and providing such great service to our community."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ajVIcjJnRRAB",
            "text": "Beautiful and cozy cafe, the food is incredibly good, and the service very friendly and attentive. Got the pulled pork sandwich and truffle fries. Extremely delicious! New neighborhood favorite."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MktpYXVBRRAB",
            "text": "Thee most sexy cozy quality restaurant in Brooklyn Flatbush area. Lovely ambiance top shelf recipies super knowledgeable friendly staff. Nobody around is making food like this but Red Chaconia. Amazing Chef thoughtful preparation and presentation skills. I felt as though I was in another country. The music was soothing and really great. I love this place and appreciate it so very much. If I can finish my laundry soon I'm going there for dinner it's 3:00 now got to hurry!!! They close @ 4:00!!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaHZuUi1nRRAB",
            "text": "The greatest burger I ever tasted"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQdXJQUnJ3RRAB",
            "text": "The sandwich was fire. Fries were crispy and tasty. Chips are perfect crunch. It was a 10 for me."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNHVLczRnRRAB",
            "text": "I really love this spot. I send my friends from out of town here. My friend who is a coffee connoisseur says it’s really good coffee and the teas are truly special and delicious. Staff and environment emanate really good vibes. A neighborhood gem indeed."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbmZqN05BEAE",
            "text": "Great pulled pork sandwich. Glad they added a lunch menu!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzZ0kyRGNBEAE",
            "text": "The best burger I’ve had in NYC! The flavors are so well balanced and the toasted brioche bun is *chef’s kiss*. I highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudjdyUmxBRRAB",
            "text": "Delicious food, great coffee, friendly service 🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubmFyUmlRRRAB",
            "text": "Omg yum!!! Split the BEC and the omelette croissant with my bf and both were SO TASTY! Plus affordable for the quality, imo. In addition, coffee delicious, nice flower touches throughout the space, and the NYTimes available on the counter!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubmRMZUNBEAE",
            "text": "Amazing little takeaway and sit down breakfast spot. The Coffee was delicious, and B.E.C. and Omlette sandwiches were top tier. Would definitely recommend and look forward to them expanding to lunch and dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeXN6ZlJnEAE",
            "text": "This lil gem has such a nice vibe. Attentive staff, too: they look after the details with care. Plus, big windows for people watching onto the always eventful Flatbush Ave."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibVl5TVp3EAE",
            "text": "This cute neighborhood cafe serving great coffee and pastries is also one of the most solid breakfast spots this side of Williamsburg. It’s a must-stop this side of Prospect Park.\n\nEverything is outstanding, my favorites right now are the supremely fluffy kale waffles, the delicate and creamy toasty egg sandwich, and the stick-to-ribs gooey omelette croissant sandwich. It’s been a delight working through their menu, and I can’t wait until they are open later.\n\nThe space is also lovely, with a large counter and really friendly staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMy1ySFNnEAE",
            "text": "Best cafe ever!!! Emmie gave us the best service we’ve ever experienced <3"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOUpuYTJBRRAB",
            "text": "Eaten here twice!\nOrdered the French toast with side of scrambled eggs.\nBest breakfast around HANDS DOWN.\nThe Kenyan coffee bean is one of the most flavorful in the world 🇰🇪"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMMDYtNDRnRRAB",
            "text": "Neighborhood gem. Amazing food and wonderful service. Glad to have it in PLG."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6c19LZzlRRRAB",
            "text": "The food was fantastic. I visited several times and this is by far my favorite café in Brooklyn. The atmosphere is very intimate and I stayed longer than I thought I would chatting with fellow patrons and the amazing chef K. The Cafe has limited seating but the added touch of providing seats outside with water for pets shows the attention paid to patrons and their fur babies by management."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeVlTMTBRRRAB",
            "text": "This cafe’s food and service is insane. The yogurt and breakfast croissant sandwich was our favorites and the staff is so friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURUenA0LRAB",
            "text": "If you're in Brooklyn, make sure to visit. Great people, great food, cute spot. NYC prices, but you're in NYC, what did you expect?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUazhXR21nRRAB",
            "text": "Possible the Best cafe for vegan options in Brooklyn. They have a variety of freshly prepared food and exotic herbal teas and lattes. I had the avocado toast and the cold brew. Cute place for an intimate brunch/lunch or grab and go. My first time here and I'll be back for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqaVoyN0JBEAE",
            "text": "Great food and atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbnZyT0JREAE",
            "text": "The breakfast burrito is incredible, and great service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMnVMVTRBRRAB",
            "text": "Good vibe, incredible service, and some great pastries"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeUk3OHJBRRAB",
            "text": "amazing food and coffee is insanely good. staff here is amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqZzlIY3V3RRAB",
            "text": "The service was great and the food was tasty. I bought the breakfast burrito and my sister tried the kale sandwich. I took away a star due to the prices of the items. I see these prices in Manhattan. The prices are steep for PLG right now."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMi02aG1nRRAB",
            "text": "Good service very nice brioche breakfast sandwiches and kale waffles which I wasn't sure about but they were good!"
        }
    ],
    "reviews_count": 47
}