{
    "name": "Ocean View Cafe",
    "place_id": "ChIJX9DK2EBEwokRM9kDwjBVtag",
    "grid": "BK13",
    "address": "290 Brighton Beach Ave, Brooklyn, NY 11235, USA",
    "rating": 4.5,
    "user_ratings_total": 1005,
    "phone_number": "(718) 332-1900",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdk5tbHliVUpFUlhJMWRIQnhWVFZ3UkhsbE4yYxAB",
            "text": "This place knows what diners want and delivers it all. They create food that impresses twice. We were acknowledged immediately by friendly staff. A good neighborhood place with flavorful options. The local scene needed this restaurant."
        },
        {
            "date": "3주 전",
            "language": "ru",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxYVptSlRRWGxYTTNOWGRsUnlTakZrTkhORVJuYxAB",
            "text": "Кафе а-ля 90-ые в СССР. Очень вкусно, но лёгкий ремонт вам бы не помешал."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGd2JVNXdlVmR3WmtwR1R6RnpNakZxY2pRMU1WRRAB",
            "text": "My buddy had a craving for borscht while we were on the east coast and with Brighton Beach being little Odessa, thats where we went. I randomly chose this place and when I walked in and saw pictures from the movie Lord of War on the wall (it was filmed here)... I fangirled out!\n\nAnyways, the food... Probably the best Russian and Ukrainian food I've had in the States. The pelmeni was superb, the ground chicken cutlet and mashed potatoes were delicious and filling, and for dessert? A couple of shots of Russian Standard and a Ukrainian beer.\n\nI also enjoyed the atmosphere. Customers came in, ordered their meals in Russian or Ukrainian, and went about their afternoon. Everyone from mom's with their little kids in tow to babushkas gossiping and enjoying lunch.\n\nThis was a meal fit for a Lord of War, no doubt."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ad1V6RmtaRVZLVDA0d2RtSllNVW8zZWpRMldrRRAB",
            "text": "Mucho tiempo de espera para ser atendido a pesar que hay poca gente, pero el personal es bueno y amable, la comida estaba muy rica y era una buena porción! Me encantó."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWb1VsWllWMWRDV2pCbFVEWkpWR1YzWlZoWVZIYxAB",
            "text": "We ran here from DTBK and had a bunch of dishes. The pelmeni with mushroom sauce is soooo good. We also had borscht, golubtsi, potato salad, farmers cheese blintze"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdlZsQjJTRkZmYUhGdVpWQlRXbEp5WTFkUFkzYxAB",
            "text": "I found this great place on Yelp a few days ago. They understand appropriate serving sizes. I appreciate what they offer here. The employees balance professionalism with warmth. We'll visit again without fail."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndDlqbWF3EAE",
            "text": "I dont understand how every time I got here i get $20 of food but get a bill for $40"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdU5XTlVOMDF3VUc1c05XdFZaR1UxT1U1NWNFRRAB",
            "text": "A friend of mine let me inspect the premises, it was completely unsanitary, I heard people in the kitchen insulting visitors, my friend knows Russian and he translated for me, there were a lot of cockroaches, some cat was walking around the kitchen, in general it was just disgusting"
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSlFrZDVibEpWWW1sVlltcFlOR1pQT1ZWUFRFRRAB",
            "text": "Очень вкусно! Все по-домашнему"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNFZVOHlhSHBOWjA5clptTjVjakJKZEMxZk4xRRAB",
            "text": "happy to visit this place because it reminded me of my grandma’s cooking. most of the food is fantastic and fresh, yet it comes super fast. waiter was nice and attentive. drinks were good. patio is nicely set up although loud from the train. bathroom is ok. busy spot but still room on the weekend. love that the patio is dog friendly.\n\neverything was going perfect until we left - my dog has an eye disease (pannus) so she has to wear sunglasses. the chef was smoking outside and started harassing us when he noticed my dog saying “we are blinding her and hurting the dog”. found this really annoying because he would not leave us alone. and again, my dog wears the sunglasses because she literally has an eye disease so i’m prolonging her vision before she goes blind lol"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obFpEaFBhRTl6WTFrNVZHbERhMWszTTJacFQyYxAB",
            "text": "This place had been here for ages and that says it all for the kind of food it serves."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWk9HbHlYMEZvUXpOZlNWWjZhbnBhYmtGWE4yYxAB",
            "text": "One of my favorite places to eat around Brighton."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDMjZXTmpBRRAB",
            "text": "Been returning every 🌞 season for the past decade or so. For a good reason"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSllXRlpWRk5mZG5CelJqZDZhRUpQT0RkU01sRRAB",
            "text": "Buonissimo"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5elJFdHhaMDVXYlZOYWN6RTNRakE0WVdaSE1YYxAB",
            "text": "Attentive service and great food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMlIyUjVRM0JvYkZJNGVtaFpiMnhKTmpKRFJWRRAB",
            "text": "A nice typical Russian/Ukrainian place, cool atmosphere and good food. Don’t take the shush lol, it is mediocre. Home made pelmeni and vareniki are among the best I tried. If you take wine better take by bottle 😂, much cheaper. They played good old rock video from the 90s. I recommend a visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCblgyVlVTVVYyWlVkWFVubG5ZakZEWldwbWVYYxAB",
            "text": "Nice cafe. I came with a group of friends awhile back and we all enjoyed our meal so when I passed by today I got a little snack of dumplings and coffee. Both tastes fresh and delicious.\nIt’s a simple place with nice authentic food."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dmJrTnphMkp2VTJSV2RVcFlha3R1UWtKdU5tYxAB",
            "text": "Очень разочарованы. Пельмени были недосолены и переварены. Невкусно!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMmIwNTBNelp0UW1jMFkzQmFYMmgwZDA1UFJuYxAB",
            "text": "Best pelmeni in the city"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsV1RGVkxZeTFQYzJoeVpUWm5ZVVprUTJoSWRWRRAB",
            "text": "The food and atmosphere were nice, but the American pop music really ruined the vibe. Traditional Slavic music would’ve matched the theme much better and created a more authentic experience"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNGFqQk5jbkExWmpWa1dISlVhVFJMTTNCd1IwRRAB",
            "text": "Perfect Brighton Beach experience. Nasty, irresponsible employees and mediocre food. It used to be a nice place a long time ago. Nothing lasts forever"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dlJtaEtOVk5qT0dKNGJGcDRhMGd4YWxwVFpsRRAB",
            "text": "Hands down the best food on the whole block! We came from Canada and we loved every dish we tried ! The service is outstanding 👏 good job guys keep it up will definitely come back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psd00yOXhUaTEzWjJwa2QwZE9XRkpoWDJWdVFVRRAB",
            "text": "Great portion of Varaniki - perfectly seasoned."
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3d1ZsQkJhSFV0Y0RBdE1tUjJWRUYzTm1sZlRGRRAB",
            "text": "Был в данном ресторане вчера, очень все понравилось"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sZldsUlBUMEZPZERnMVRsTnBXRTVuWDBnNVVIYxAB",
            "text": "Every bite here was better than the last one. It's a cozy little spot with staff who are reasonably pleasant. The staff create a warm atmosphere. These meals display evident excellence. You should schedule a visit to this place now."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMWFUVkpMV2QyWkVWMVJYbDFjSHBHYlZsUldIYxAB",
            "text": "This modest spot succeeds through genuine hospitality. Employees were consistently cordial. They've achieved both class and comfort in their design. Their dishes benefit from fresh items. The price is backed by real quality."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocmVFUlViV3BMYkRkcGFUVlJOVFJXY2pKUE9FRRAB",
            "text": "Has always been the best place for Russian food. Yesterday was different. Karacho (apart from a smaller, than usual, portion) was watery, very little meat. Schnitzel was OK, but overall very mediocre. Do you, guys, have a new chef?"
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsU1luWkNVeTFtVGpOaGNVZDRTMWhzVldzMlQzYxAB",
            "text": "Все было очень вкусно!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVeVZWWktNa3BqWTJwc1JIUjJZekJTTVhSWmNXYxAB",
            "text": "The place is very cute, has indoor and outdoor tables. Food is very delicious. Due to hot summer weather we came to have okroshka and so far it is the best okroshka from many other Russian style food places. The service is extremely fast and nice. They also have their own cat who lives inside the restaurant, he walks around tables, rubs around. I highly recommend this place for authentic Ukrainian/russian food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMmRsUmxNV016TlhkbFYweFZZV0Z0WTBKZmJsRRAB",
            "text": "good quality food and service. loved the liver and pelmeni"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCS1VrcGxjWGQyVW10YWFVazJSRGhrZFZkMFdFRRAB",
            "text": "Staff was very kind and accommodating to my family for our first time there.\n\nFood was fantastic and looking forward to coming back asap!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbFVrdE1aSGRwZEd4TlNWSmpjamxFTkZWcloxRRAB",
            "text": "very good soup solyanka, extremely good vareniki. Portion size for vareniki is full meal size despite classification as appetizer. Dont eat bread if you want the vareniki with something else"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cE1FeGFNR1pyVFZsNmNWWjZNVnBTTmpKUlduYxAB",
            "text": "Best stuffed cabbage! Cash discount, 10% tip surcharge"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJT011TXpicm91UG93RRAB",
            "text": "great location, near the metro and the beach. two guys waiters were friendly and polite. we ordered ukrainian borscht and greek salad. the food was delicious. the compote was also delicious and fresh. the prices are a bit expensive. i recommend visiting"
        },
        {
            "date": "4달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odVVsTkVRblp1VW14Q1JrNUhRVFJqYlRSSlpVRRAB",
            "text": "Cuisine excellente.  Je me suis régalée avec une soupe de poisson et une terrine de poisson purée. Un régal ."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLcUJxS3Vza09IY2pRRRAB",
            "text": "Increíbles varenikes.\nLa atención es excelente igual que la comida. Lástima que tardan un poco en traerte la comida."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS1Z3UE83LUtXMHBnRRAB",
            "text": "I love it! Great food, very friendly staff. Thank you guys for your hospitality and great service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeUxqbEJREAE",
            "text": "Great food, kind servers! We got the stuffed cabbage and pelmeni with mushroom sauce. I would recommend both dishes but they have a large menu with many choices."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcDV2aHNRRRAB",
            "text": "This is my second visit here. I visited on a Sunday evening with my family. Food quality was bad. We ordered the borscht, it was undersalted and nothing else was there besides beets. So it was like a hot watered down beet soup. No meat, nothing.\nWe also ordered fried liver and it tasted like burned carbon, We could not eat this at all. It was left untouched. We mentioned this to the waiter and no apologies, nothing. It was fully charged on my bill. We also ordered 2 compot and only received one. Terrible food. Terrible service. Will not come here again. Will not recommend to anyone. Find yourself another local russian restaurant."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJLV9yVHBRRRAB",
            "text": "Service is always good. Food is made to order and fresh and delivered to your table fast."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJel91SWtBRRAB",
            "text": "Fantastic food. Fantastic vibe."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNHZlX3BBRRAB",
            "text": "Love this cafe"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dE9LeXVBRRAB",
            "text": "Brighton Beach faces a significant challenge, particularly along the street beside the Ocean View Café, where illegal drug activities occur openly. It seems that the local authorities, including the NPD and sheriff’s department, may either be overlooking this issue or potentially complicit in it.\n\nAdditionally, my recent visit to the café was disappointing. When I asked for a simple tissue, the owner displayed an unnecessarily rude demeanor. Such behavior makes it hard for me to recommend this establishment."
        },
        {
            "date": "7달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMDhIUWx3RRAB",
            "text": "Всё супер, место со своей историей"
        },
        {
            "date": "10달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2LU02WkdnEAE",
            "text": "Очень понравилось это кафе. Блюда были очень вкусные, особенно рекомендую пельмени с бараниной. Официанты приятные, внимательные. Цены не задранные. Порции большие. Обстановка в кафе простенькая, но посидели с большим удовольствием. Многие столики были заняты, что говорит о популярности заведения. Обязательно вернёмся сюда!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3el95dVhnEAE",
            "text": "Comfortable, clean, friendly staff. We had the Ukrainian borscht and cold borsch, both were delicious. The Ukrainian borscht was hot and perfectly spiced.\n\nWe had the smoked mackerel with potatoes. The potatoes were amazing with good garlic flavor and went well with the fish. The fish came with red onions which tasted amazing eaten together, the onions and fish flavors blended nicely.\n\nWe then had the stuffed cabbage. This was the best stuffed cabbage I ever ate. I love stuffed cabbage and have eaten it many times. I have had the Jewish style, comes with raisins and has a sweet and sour taste. It is always good but it couldn’t compare to this heavenly dish of Ukrainian stuffed cabbage. Light spicing, impeccable sauce and the meat tastes like veal. It was so smooth - just fabulous.\n\nI can’t wait to go back to try many more items on the menu. This place rocks - go eat here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuM2Y2b0hREAE",
            "text": "Borscht was super comforting especialy after adding the sour cream. As someone that hates tomato this was an exception,\n\nPelmeni w mushroom sauce, was quite heavy for an appetizier but super creamyy and meat inside the dumpling was super generous and thick. I wish its more juicy.. but the mushroom sauce saved it\n\nChicken stroganof, yellow rice was alr good. Flavour profile is very similar to the mushroom sauce for the pelmeni just this one is w/ chicken\n\nAll the flavours were leaning to creamy and  sweet"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfczhTNGdBRRAB",
            "text": "We came with a big company and ordered a lot of different food. The best dumplings were with meat (pelmeni) and mushrooms on top. Also, we liked vareniki with sour cherry. Fried potatoes with mushrooms, dill, and garlic were excellent 👌 Lamb and pork kebabs were good marinated and juicy. Salad with beef tongue was good as well. In addition, I was impressed with costumes service. The waiter was very friendly and attentive. We will definitely come again 🫶"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbzVQa1JREAE",
            "text": "went to this place as my first authentic Russian experience in Brighton Beach after having lived here so many years and didn't realize how much I was missing out. had the potato and mushroom verenikis and borscht, was delicious and very…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cU11aFpBEAE",
            "text": "... Good service in this restaurant. I love ordering lamb kebab here. And some mashed potatoes or French fries to go with the lamb kebab. It’s also good to take beef goulash.\nThere are also delicious dumplings and I ordered delicious dumplings with cherries. The waiters are always polite and I always leave them a tip because I like the way they serve here. The only minus is when someone sitting next to them drinks vodka. I can’t stand the smell of vodka, that’s the only minus but I try to choose a place where it’s in the corner and no one is sitting next to them, they also don’t accept American Express credit cards and they also have dumplings that you can buy and cook at home\n\nтут  снимали фильм Оружейный барон\nThis is where the movie The Lord of War was filmed.\nUpdated 05\\24/2024\n\neverything remained delicious and excellent. But I don’t recommend buying ready-made pilmeni. since they are boiled soft, dumplings with meat are even less tasty..."
        },
        {
            "date": "수정일: 1년 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNzRyMkp3EAE",
            "text": "Очень долгое ожидание!\nПришёл менеджер, принёс меню, но отказался принять заказ, сказал что придёт официант. Но официанта пришлось ждать примерно 25-30 минут!!!\nЕда не понравилась!\nПосле долгого ожидания, принесли еле тёплый украинский борщ в маленькой тарелочке, одесский салат и чёрный хлеб...\nВ счёт включили сразу и налог и чаевые и принесли чек написанный от руки!\nЦена НЕ соостветсует такому обслуживанию и такой еде!!!\nНикому не рекомендую посещение этого ресторана!"
        },
        {
            "date": "11달 전",
            "language": "pl",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQa05QY2tRRRAB",
            "text": "Is this kielbasa lol?\nI am Polish this is shameful, worst thing. And yet the photos on here show a beautiful kielbasa I know and love…\nFood was good. Service was bad. We had to ask for water and bread, other tables were served this immediately. Forgot my kompot. We felt like we were treated differently for some reason. We are Russian and Polish just don’t feel like speaking the language sometimes!\nNie wrócę i szkoda bo jedzenie dobre oprócz tej Kiełbasy, kompot pyszny, tylko żeby kelner nas obsługiwał bez jakiegoś uprzedzenia, dziękuję, спасибо за еду"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVNHNLcExBEAE",
            "text": "My friend and I actually got pretty good service at this place, we came here for an early dinner. I loved the Borscht, stuffed cabbage, and meat vareniki. She thought her seafood pasta was really good. Blintzes with farmer cheese was not our thing. Would definitely come back again next time I'm in the Brighton Beach area"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5aFpxTzRnRRAB",
            "text": "Excellent, unpretentious cafe in Brighton Beach. The Borscht transported me back to my childhood. Highly recommended if you’re in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab05Td2ZBEAE",
            "text": "The best sour cherry vareniki outside my mom’s house. Beautiful vegetable borscht, fresh salads, chicken cutlet, Russian fries (“home fries”), STUFFED CABBAGE, potato salad (“olivea”), and probably everything else. This is someone’s Ukrainian mom in the back, cooking and holding up standards. Five stars all around. A must if in Brighton Beach."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnaFo3YlpnEAE",
            "text": "We went to the Ocean View Café because they had good reviews online.\nOh, don’t always rely on reviews.\nAmbience. I believe they are going for a nautical theme, with all the ships, etc. however, bright screens with food on the wall and Nicholas Cage photos on the walls are distracting.\nAdd a tile floor, white walls and cheesy Russian music in the background, you be the judge. I take one star away for the ambience.\nService. It was ok. All male servers dressed in white shirts looked quite cute, however, if you are not a Russian speaker, you might have some troubles communicating there as all servers are Russian speaking and some of them do not have English skills.\nFood. We ordered three items- Farmers Cheese Blintzes. It is basically a crepe, filled with sweet farmers cheese filling and served with jam and sour cream. It was divine! I ate and kept saying, it Is just the way my mom used to make them. They were soooo good. I would go back to the Ocean Side for Farmers Cheese Blintzes. They were on point!\nWe also ordered meat vareniki, boiled. They were good. Did not love them and did not hate them. They were pretty good. We ate them because we were hungry.\nLast dish we ordered was lamb shish kebab. What a huge mistake! We were served what looked like lamb ribs, shanks on a bone. There was so much fat!!! Well, while I like to have a little bacon fat here and there, I am not a fan of devouring a huge piece of just pure lamb fat. It was disgusting. It was sooo bad. Potatoes that came with it were super greasy I could not eat them. It did not look like a lamb shish kebab, although we were convinced that this is exactly it- lamb shish kebab. It was just sooooo bad, soooooo bad!!!\nNormally I would never, ever go back to Ocean Side Café, however, I cannot forget the Farmers Cheese Blintzes. I would go back just for them. They were so delicious that for me it saved this whole establishment from just a pure bad review. My two stars goes for the amazing Farmers Cheese Blintzes! I take extra stars away for the horrific lamb shish kebab dish!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNXVHN1hnEAE",
            "text": "Today is Valentine's Day. We strolled from Coney Island Beach watching the sunset to here. Ocean View Cafe is a really cozy eatery. The portions are generous; the two of us, adults, ordered dumplings, vegetable rolls, and borscht soup, and our stomachs were filled to the brim, as well as our hearts. The service wasn't top-notch, but it's a family restaurant, so it felt just right. The dining vibe was super chill and relaxed. We've never tried Ukrainian cuisine before, so this was our first time, and we fell in love with it because of Ocean View Cafe. Definitely want to come back for more.\nPs. Compot tea definitely is today’s super star."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCZy0tUTRRRRAB",
            "text": "Great food and friendly service. I’ve been here 3 times, it’s very consistent! My favorite dishes are the stuffed cabbage, shnitzel, and olivier salad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENk12Z2JBEAE",
            "text": "It’s called Ukrainian restaurant, but no one is actually speaking Ukrainian. Not a problem, just an observation.\nPortions are big, nothing to add here. Food is not bad, service is a bit slow, but nice and pleasant overall.\nIf you’d like to try out some Ukrainian/Eastern European cuisine - nice place to visit and do it, if you are in the area.\nYou can also order take away or order food to cook at home (vareniki, pelmeni)\nOverall, I can recommend if you live nearby or in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCOUkzR3FBRRAB",
            "text": "Awesome place.\nThe food was really great and authentic.\nThey have Russian lemonade.\nPrice is reasonable. The price for frozen dumplings is just awesome.\n\nIf you go there be aware that they don't accept contactless payments and Amex/Discover. Take your Visa/Mastercard or cash."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxeXVQcVVREAE",
            "text": "The food was good, although we all ordered the lamb kebabs, but I'm pretty sure it was beef but still delicious. The waiter was nice and friendly."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cV95UzBRRRAB",
            "text": "Great service. Food was amazing. A great place to have a coffee or a beer or some vodka while visiting Brooklyn's most overlooked neighborhood."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2eWFUdURBEAE",
            "text": "The place doesn’t look like much, but the food is absolutely delicious! Both pelmeni and vareniki looked handmade and had great flavor.\nPrices were reasonable. The only reason I knocked one star down was particularly slow service. Place wasn’t necessarily busy and there were two servers so there was honestly no reason they wouldn’t check on me or offer drink refill and such. That said food made the wait worth it"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdjdiV2d3RRAB",
            "text": "What a treat. We went to Brighton Beach to go to Tatiana's but they had closed the kitchen just as we walked through the door so here we are, Tuesday night at 8:30 pm and we decided to find sheeting close by.  Of course you have to be prepared to eat some very rich foods when you're in little Russia. We walked back to Brighton Beach Ave and made our way to BB 3rd Street and happened into Oceanview Cafe. This is not a fancy place but the food and the value in amazing.  Located deep in the heart of Brooklyn's Russian community in Brighton beach, it's a simple place with food tasting home cooking and lots of Russian culture all around.  We were going to Tatiana's but they closed early tonight so we drove down Brighton Beach avenue and happened into this little spot. The beef stroganoff was very yummy and not overly rich. It was the perfect warming meal for a cold winter night.  It seems like every culture has a form of dumplings. These were filled with lamb meat which tasted delicious. Lamb is usually gamey but this wasn't at all. The only bummer is the whole equation was the French fries. I probably should have ordered the mash potatoes. They seemed to be the store brought frozen kind you get in any supermarket. Not very tasty. But on the whole this was a great experience and the price tag was VERY affordable. If you're in Brighton Beach, check out this little piece of Russian heaven."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcnNhTy1BRRAB",
            "text": "Came for an early dinner. Very simple yet clean decor. Long menu of Russian food staples and delicacies. Nothing fancy. Just good cooking and low key yet tasteful presentation."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwM1BTYmdnRRAB",
            "text": "Pretty good food and Good service as we had no idea how to navigate the menu or what to order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyckxELTVnRRAB",
            "text": "Wonderful and relaxing! The young men serving our food were patient and attentive. The steak kebab was the best we ever tasted. Спасибо!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeEp2U3dRRRAB",
            "text": "Came for russian food and wasn't let down. Small and quaint with friendly service.  Straight forward menu with pretty standard Russian food options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6d0tXQnl3RRAB",
            "text": "The food was horrible. I know is Russian Food so i ordered chicken noodle soup thinking what could go wrong. But looks like the put noodles in broth or another thing Chicken. The service is terrible, they staff is very rude"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6LWJLbWhRRRAB",
            "text": "Jared Leto & Nicholas Cage allegedly made my borscht and varenyky (photo) 9.5/10 I expect it from Leto due to his depth and breadth of versatility but Cage plays the same person in every movie. One trick pony. “I’m going to steal the Declaration of Independence” ok, nerd. A wild card though in this lesser known Scorsese flick called Bringing out the Dead, 1999. Phenomenal cinematography. Genuinely good portrayal of being haunted by the ghosts of the patients that either pass before you arrive or while in transit to the hospital as a city medic. There’s a scene sometimes shown at narcan courses where the costar gathers together a crowd at a club and makes them pray to believe that it’s Jesus and not the noloxone reviving the victim. That’s real too. Theres so much religiosity around traumatic death especially. Logic goes out the window in the face of uncertainty and unshakable fear"
        }
    ],
    "reviews_count": 70
}