{
    "name": "Liman",
    "place_id": "ChIJKRjfeXlEwokR3J4oX2oLdOk",
    "grid": "BK13",
    "address": "825 Surf Ave 2nd Floor, Brooklyn, NY 11224, USA",
    "rating": 4.4,
    "user_ratings_total": 1466,
    "phone_number": "(718) 769-3322",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UU1YRm1hR016TWpadE9HWk1hbkZmWjJOVFdtYxAB",
            "text": "I only stopped by to order two soups to go, but the staff were so warm and welcoming that it really made my day! They even offered me a tea while I waited, which was such a kind gesture. Everyone was smiling and friendly, and the soups were delicious. I’ll definitely be back to try more from the menu!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWmQxWjFiMFI0TmpCWk9VZG1RM1IxTXpBeFdrRRAB",
            "text": "I didn’t know this but apparently they used to be in a different location some time ago. Regardless, I loved this location—the atmosphere is super cozy and welcoming. We ended up sitting on the “balcony” (it was covered) which was even better. Everything inside is marine themed but not tacky. The service was fantastic, our server was super friendly. The food was top notch. Especially stood out the fresh salad and the octopus is the best I ever had anywhere. Highly recommend."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OamFraFNWRGhwVURCMUxVbEtkRnBsU1hCRVRsRRAB",
            "text": "Went here for a birthday celebration. The drinks were delicious. We had margaritas and lychee martinis for the table. We shared Turkish cheese rolls, fish cakes, shrimp cocktail and fried calamari for the table. For the main, I had the pesto penne which was okay. There was an overpowering lemon flavor that made it hard to eat but I was full from the appetizers. I added shrimp to my dish and that was okay as well. One party member ordered the grilled fish and he enjoyed it . Majority of the table ordered the surf and turf and they mentioned it was good as well. They spoke highly about the white rice that it came with. The service was exceptional from both our hostess that sat us down and the waiter. This is a great restaurant for a birthday celebration. One of my favorite things was the view. I was pleasantly surprised that you could see the coney island amusement park from our eating area"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SlMxUmZSbDlLWWpCdGJrZFFhMHd6VVdkb01rRRAB",
            "text": "Amazing Turkish restaurant! The whole fish was incredibly fresh, the octopus was tender and delicious, and the salad was bursting with flavor. The service was so friendly, and the ambience was perfect. Can’t wait to go back — such a gem!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGOGYyZnFnRRAB",
            "text": "Great new location very spacious and food still is very good and fresh!!!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4ak9tWVpBEAE",
            "text": "One of my favorite restaurants in Brooklyn! The food is absolutely to die for. I was nervous when I found out they changed locations, but the new place is just as fantastic. I cannot recommend this place enough. It's perfect for date night, family dinners, and celebrations! Just to!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bVpDMVNZMjFSYW5GdWJHeHdURWxGUzB4MVpXYxAB",
            "text": "The valet people are really aggressive and the waiters are also super pushy lately… not coming back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWk9YSkZTMlJmYld0VlVVeExVVmRIVEdobkxXYxAB",
            "text": "Liman is a nice Mediterranean restaurant located nearby Coney Island/Luna Park. With a view right near the coaster, to offers a variety of different dishes, with it's specialty being Fish. It's pretty good, but it's gonna cost a few pennies. I would try it out if you're in the area"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdldITlFaV2hFVmtWaVQwZHNZakZKV1ZoU05uYxAB",
            "text": "Fabulous Restaurant"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVmRVWmhibFl0WVZSNGRWVndVSGwzT0RsRFVsRRAB",
            "text": "Always a must!!!\nAwesome"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWVEyTlVkREYyY2poUlNGTnBiV3hOZGpBM2VuYxAB",
            "text": "This is nice place for fish and seafood.\nMediterranean style.\nI’ve tried a lot of places for seafood in my life and this is strong 4/5\nThe view is great!\nLocation is so much fun!\nI would recommend this place for visiting and dining at least once."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUUxUaGpUakJTY1d4cU5uZGlOSEUxYUhRMk1FRRAB",
            "text": "Excellent Turkish restaurant with great food. The seafood was great, grilled octopus was delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SblNWWnlkbVZOYXpkV2RHWjFMWE5tYzJRMFYyYxAB",
            "text": "I’ll be honest—I had my doubts at first because of the prime location, but Liman truly exceeded expectations. This was probably the best fish I’ve had in the U.S., and definitely the only place I’ve found that serves authentic Turkish-style seafood. The service was attentive, quick, and on point. I’ll definitely be coming back with my parents and in-laws"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKZlVHdzRaSEZwYmt0WFVVMWxRbFJSVTNsVWNsRRAB",
            "text": "I dined here with a group of six for two birthday celebrations and it was absolutely the best choice because of the food, drink and service. The prices are incredibly fair, portions are perfect and the cocktails are delicious. We had a great view of the Cyclone and Luna Park, too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMlNHRlNjV0ZJTUhsVldsUndkMU53Y1dKTWNVRRAB",
            "text": "Everything was very fresh and tasty!\nThe staff also very friendly and helpful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMVZFVXlja3BvWWpsVlpIcE1WbFV5YlZWTk9VRRAB",
            "text": "We where in NY for a vacation, after a walk the at the Coney Island boardwalk we get hungry and where looking for a great fish place ;) We are so happy we picked this place ! The fish was so fresh and tasty! Cocktails amazing and we really liked the desert presentation.\nHopefully we would come back in the future ! Thank you"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVelNGaDNhMHB4U1ZJelRFbDJObU5MU0dkaU1WRRAB",
            "text": "Very strong established restaurant with fresh food and great service.  It's has been here for years and has an amazing outside seating.  Professional service with a yes attitude towards the guest."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSVNYSk5NbHBrYTJOTlNVNUdkR2d5Ukc1SGNHYxAB",
            "text": "Delicious and delectable food! From the bread which came warm to the fish to dessert, everything was excellent!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOa05qUlRjMHc1YjB0TmNVdG1NMDAxV0hOcVlsRRAB",
            "text": "Great place to have a good meal. Waiter was great and very helpful. Would recommend this restaurant ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWT1QwdEJZWGxxVG05cVVVeEdlREpXYmpGQlVWRRAB",
            "text": "Perfect ! delicious food and Excellent Service...."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saGJ6RXpkMEZtUnpOeVdHZzRVWE00VjNOeWNuYxAB",
            "text": "A nostalgic eating experience overlooking Coney Island / Lunar Park. Excellent attentive service throughout.  Beautiful interior space .. couldn't be a more perfect place for this restaurant than there. It brings a level of sophistication and dinning quality to this beach/ amusement strip. This will definitely be on the radar when we are in or passing through Brooklyn. The food was fresh and we enjoyed these menu choices ( diced liver, octopus, cod fish spread, bronzini, royal dorado and flan). Looking forward to the next visit . Much success 🙏🏾"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeFJqQkRUMVpmUmpoelVHaEliMWhSTFdkaWJIYxAB",
            "text": "We overlooked the fireworks on Friday night."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210b2FuWlZaa1kwTFZOVk5sOVdaVTVYTjFkTE5tYxAB",
            "text": "Great location. Fantastic Service.  Incredible seafood.  Go with the Branzini!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaWJXUkJhalpLYkdkTmFuaFhSV3RwUzAxcFoxRRAB",
            "text": "allergy to take away drinks"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscVltMTBkemsxVW5sRVR6RkNVMVZGWkdsNlgyYxAB",
            "text": "First time I been there appreciate for everything everybody is so kind and so friendly   And most important for me he is name Abdurrahman he is so honest    thank you so much 👍🎈❤️❤️"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMVRrWnVXa1V3VFdOTGJGOTZSbkJSYTJwd01rRRAB",
            "text": "Турецкая столовая"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rdGJIVkRVSHB4ZWw5cFZFbFBhak4zVjNCZk9HYxAB",
            "text": "Wonderful experience from the valet parking  in front to be seated at our table.  Service was impeccable."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWFoycEdjVXN6VEZOdldEQklNblJHUVdnNFQwRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nDelicious Food & Cozy Vibes by the Water!\n\nMy husband and I had such a wonderful dining experience at Liman Restaurant in Sheepshead Bay. It’s a cozy, welcoming spot with a calm, classy ambiance and gorgeous views near the water.\n\nEverything we ordered was beautifully presented and full of flavor—from the perfectly grilled salmon with crispy shredded potatoes, to the tender steak with herb butter and colorful veggies, to the spiced lamb cubes that were so juicy and seasoned just right. Every bite felt thoughtfully prepared.\n\nThe service was warm and attentive, and we appreciated how the staff made us feel right at home without being overbearing. This place is a gem for date nights, family dinners, or just treating yourself to great Turkish cuisine.\n\nWe’re already looking forward to going back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdVdWSk5hakp1WTJFNGQxVnJZbEpOYVRsR1VVRRAB",
            "text": "It was amazing experience for me very nice foods , views, service everthlng was absolutely fantastic we got octopus branzino cacik it was fabulous"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKa1dFeHNMVEpYV1cxd1ZYbFRaRVZtV2xCRFJsRRAB",
            "text": "Friendly service, beautiful space and delicious food. Was there for lunch and ate outside, directly across the street from Luna Park.\n\nFood was absolutely delicious!!  Had Liman salmon. Eggplant was one of the most delicious things I've eaten.  Green salad fresh with amazing dressing.\n\nGo and enjoy!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4MnJhWnNRRRAB",
            "text": "Consistently consistent! From the salad to the fish, their isn't a bad dish! 9.5\nFollow me on Instagram @AbiteOUTwithJACK"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WQlZXNVBhMkpMVVRCT1gwcENjV2hMVkc5NWFIYxAB",
            "text": "Dude, EVERYTHING here is great. This is probably the best salmon I've had in my life!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaU4yTkhSVGxqWm5SNmJ6VlhMVFE1UjBwM1NXYxAB",
            "text": "Dinner was delicious - excellent Shepherd’s salad & Lamb Chops."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMlFUQmlXR05TUldkU01sZHJjak5vY1ZsRVlrRRAB",
            "text": "What a treat. First valet parking. The Decor is the first thing you notice. Service is fantastic.  Food even better. Then the view of the Cyclone is great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLeWdzcUg0c0tfZUZREAE",
            "text": "Delicious and amazing food, great service and nice breeze dining on the balcony. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sYVNFMUpNR3h0T0ZwclZqTnNYMjFVT0VzeVQzYxAB",
            "text": "Great place and with very friendly servers. Food is good, but on the pricey side. Will prob recommend to friends and family."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxak9VdEdSMUpOUjFKWlMyaENialJXYldoUE9IYxAB",
            "text": "I've been coming to this restaurant for over 15 years. The overall experience cc perien e has been excellent.  The food is amazing.  I would HIGHLY RECOMMEND going here !!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQV0RvYS1tNzZDX1hREAE",
            "text": "Amazing all around. Tasty food, great service and amazing ambiance. Ps the octopus is AMAZING"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOZV8xNEQyODhtbzl3RRAB",
            "text": "Very disappointed.  I used to love this restaurant when it was on Sheepshead Bay.  I'm appalled that I just paid $35 for 6 very small chicken kebobs with a side of fries (instead of rice).  Chicken was VERY dry.  Definitely not going back."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvMGV1TUlBEAE",
            "text": "Awesome people Awesome food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQQ2x3ZDdVNUpXcmVBEAE",
            "text": "Very good restaurant  with good atmosphere.\nFood was fresh and  delicious!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcy1YdmVREAE",
            "text": "Great food"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNWJHalpnEAE",
            "text": "On a aimé le tarama 12$, le hummus 12$, le filet de flétan 36$, pas de la grande cuisine mais la salle est agréable et aérée et le service sympathique."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdjVTSkh3EAE",
            "text": "Went there for my moms 91st birthday.\nCannot say enough about the food and service.\nEvery thing was 5 star."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvamVURTFBRRAB",
            "text": "Turkish Restaurant at its best... Love this place!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMUw2NEJBEAE",
            "text": "Drinks were amazing! Lovely view. Great service from the server. He was very helpful with all the questions I had.\n\nI was slightly disappointed on the salad, it tasted like if it was washed and not dried correctly and put back in the fridge. Had my partner taste it without saying anything and she agreed. Kinda sucks for an expensive dish :(\n\nOther than that, the rest of the food was delicious! Had never tasted a rice like that and the fish was fresh and yummy. The appetizer was so good too! Maybe if I had said something they could’ve checked it out, or given me another side, but I didn’t want to be that type of guest so I just decided to leave the salad fully."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcnI2eUlnEAE",
            "text": "Liman Restaurant really worth recommending. Very stylish place and clean. Everything in marine accents. Very nice service. Wild Branzino was prepared perfectly I can say the same about Saint Peter Fish. Fish fresh and very tasty. Eggplant puree worth recommending. try Turkish cheese rolls."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c05Dcm1RRRAB",
            "text": "We came to celebrate Father’s Day this past June for the first time and the food was delicious! The calamari was great and the lamb chops were cooked perfectly! It was a bit loud and the servers didn’t really swing by the table to assist as much as we’d hoped but overall the experience was good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMjhiT25nRRAB",
            "text": "This restaurant truly exceeded all expectations and provided a delightful escape to Turkey right in the heart of Brooklyn. The service was exceptional, with a waiter who went above and beyond to make our visit unforgettable. The food was simply divine, with each dish bursting with fresh and authentic flavors that left us wanting more. Even for someone who isn't typically a fan of desserts, the authentic Turkish sweets were impossible to resist. And to top it all off, the stunning view of the bay provided the perfect backdrop for an already perfect dining experience. This restaurant truly offers a little slice of heaven on earth."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcVoyUnlBRRAB",
            "text": "Really great atmosphere relaxing, I was taking there for my birthday.  Best choice, great good, we had shrimp kabob,  mix grill consist of two lamb Chops, two meatballs and chicken kabob with rice. I had the lamb kabob with rice. The mixed salad superb.  An assortment of deserts. It was quite busy, lots of family gatherings.  The service really great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbDhQVUN3EAE",
            "text": "I have been wanting to check Liman for awhile and was not disappointed.  We were lucky to get a table on the water in the evening with a wonderful breeze and bay view.\n\nThe food was all cooked to perfection and the Turkish Cankaya white wine was so smooth and delicious. The staff is friendly and very information when we had questions on some the dishes.\n\nShrimp Shish Kebab had sooo many shrimp and it came with grilled lemons and they were so tasty.  Shoestring veggies with garlic were great. I can still taste it.\n\nFlounder was very tasty and only lightly crusted. Striped bass filet.....it was good.\n\nWide selection of desserts and a great espresso martini."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuakt2dmxBRRAB",
            "text": "I first went to Liman in January for a small dinner with friends. I was impressed by the food quality and service. My then fiance and I then decided we might like to have our Wedding reception party there. I want to give a special thank you to managers TJ and Deniz. The process began in June and we were frequently in contact with both managers regarding food, decorations, organizing the space etc.\nOur party finally happened this weekend and everything went beautifully. The space was excellent, especially at night with the Cyclone as a background and Coney Island lit up in colors. Deniz was there all night if we needed anything and to coordinate the staff. 10/10. Thank you guys for helping us and our guests have a wonderful and fun event!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbmZqdnl3RRAB",
            "text": "I used to come here for years until I moved further away.  I still try to come here when I have a chance.  There are tables on the balcony that have great view of the canal.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLMzd1WHlBRRAB",
            "text": "I was introduced to this place by a curious friend. The outside of the building hides the quant and sea-side vibes. Inside is a upscale atmosphere and waitstaff with constant attention to their customers. My only concerns are 1- the…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcWFMTnhBRRAB",
            "text": "Food and service are really good. But to get to the back of patio, you will need to wait regardless if you make a reservation. They let some people in without waiting in the queue though, I believe they know the owner and have been a…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlM0xXTmxnRRAB",
            "text": "Made a reservation and suggest one is made in advance as the place was almost full. This is a very nice restaurant for romantic, casual or business dinner. Relaxed atmosphere, welcoming and friendly service. We had sea food and fish, both…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6ZzZIanV3RRAB",
            "text": "As someone who does not eat much fish, this is my favorite fish restaurant. I have never eaten at a restaurant that was consistent every time I came to eat a delicious dinner. My favorite dish was the saint peters with their garlic sauce. The hospitality was amazing and I was very comfortable. 100% recommend this to anyone I know. You won’t be disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkcjVfeXd3RRAB",
            "text": "Beautiful location and friendly service.\n\nTheir starter bread was soft and warm.\n\nArugula Salad - Refreshing start to the meal.\n\nTurkish Shepherd's Salad - My favorite salad from here. So flavorful!\n\nFrench Fries - Good quality fries.\n\nTurkish Cheese Roll - Deliciously light, crispy, and cheesy.\n\nFried Calamari - The most tender calamari I've ever had. I didn't care much for the garlic/pine-nut sauce, but they were great without sauce anyway.\n\nMediterranean Sea Bass - It's so nice that they have an option to debone the fish. The branzino was so fresh and meaty. Probably the freshest fish I've had in New York City.\n\nWalnut Cheesecake - It paired well with the chocolate sauce and cream that were included.\n\nTiramisu - Rich, creamy, and subtle.\n\nLast time, we tried their Spicy Turkish Ezme Spread and Grilled Octopus. Both were amazing! I would recommend this place to any seafood lover."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cU9fQUpnEAE",
            "text": "The restaurant is right by the water so you get a beautiful view, just be aware that there was a very noticeable sulfur like smell coming from the water. This is primarily a seafood place and they have a nice selection of various fish dishes. The prices here are pretty high so I would not suggest coming here if you're not ready to spend your money. We both ordered the octopus and I was disappointed that this dish was really mostly salad with cut up pieces of octopus. It's listed in the appetizer section and was $28. Overall I found this place to be overpriced and overhyped."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1ak9yd3ZRRRAB",
            "text": "Me and my family have been coming here for a while now as our most favorite restaurant in the city period! Tho, even tho my family is extremely hard to please and they love to complain, here they are as quiet and that makes me happy. But other than coming here with my family I enjoyed a hell of a time one friday night that i came here with my friends. Food was gorgeous, service is fantastic, tho prices are high but you do pay for quality that makes every penny worth while!\nIn conclusion, if you are looking for one of the best/ THE best restaurant in nyc then look no further than limans! Its a must recommended place especially in the summer time! Me and my friends were sitting close to the shore that friday night that we came and it was beautiful. I am truly in love with this place i might even come on my own just for the food to treat myself."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZ01xSUhREAE",
            "text": "Awesome place. The portions are big. Place actually has enough personnel to be ready to help you right away, not in 5 or 10 minutes and the waiters a nice too. Fried calamari are great, like them more than at Randazzos. Shepherd salad is very good, but that's not the reason you go to Liman of course. Desert is somewhat questionable, I think it's better if they just showed nice pictures, rather than bringing a tray with squashed samples, but it is what it is. Kunefe was tasty."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxc1BDSDB3RRAB",
            "text": "Liman is a triumph. My family and I went here for the first to celebrate my dad for Father’s Day, and we were blown away. The views were stunning - eating by the water felt like we were transported to a coastal town in New England. The seafood was fresh and high quality. And the service was just fantastic (big shoutout to our head waiter who took such great care of us!). If you’re looking for authentic Turkish food, delicious Mediterranean mezes, and lovely water views, look no further than Liman. This was the perfect place to have a summer meal and celebrate a special occasion. Also love that they have free valet parking service. Highly recommend the fried anchovies (it was so good that we ended up getting two orders), the mixed meat grill platter, the grilled octopus, and any of the grilled fish dishes. And the kunefe for dessert!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdk1hOFNREAE",
            "text": "Great food experience here. Highly recommend you make reservations first if possible because they take you to the back with the waterfront view. However, my boyfriend and I came here a bit earlier than usual dinner time, so the waitress was generous to allow us to back, which made a huge difference in our experience (vs. the front patio).\n\nFood was delicious. As recommended by the waiter, we got the tuna tartare with guacamole for appetizer - it was absolutely divine and went very well together! It was my personal favorite. Entrees and drinks were pleasing, well-done, and delicious. Overall, very nice spot in the Sheepshead Bay Area."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDcnBpTE5REAE",
            "text": "This was an absolutely excellent meal. From the food to the service and atmosphere. With the concerns about covid being on everyone's mind during any outing I felt completely safe and cared for. There was adequate spacing and we ate on an…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxa09YaWVnEAE",
            "text": "I just stopped by today for the first time. Food, service and overall ambiance is really good. The complimentary bread is so delicious that it is addicting. My Salmon Special and Watermelon Margarita was great.  I really enjoyed sitting out back and just looking at the water and boats. I will definitely stop by again in the near future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUeHBiaXZ3RRAB",
            "text": "The  new location is beautiful love the nautical theme  very unique dining experience. Not only does it offer delectable cuisine, but it also provides a magnificent view that enhances the overall dining ambiance."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdHBpRzJRRRAB",
            "text": "Excellent seafood. Excellent service. Nice outdoor seating, really feels like you’re in a diff country. Dinners are indeed pricey (about $35) for the main dish BUT portions are huge-mongous and it’s the finest seafood you’ll ever have!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4M1plRzhnRRAB",
            "text": "2024xxxx:: they moved to coney island near IHOP surf ave\n20230212::food was good, fish, kabob, calamari,  bread, banbaganoush.  this isnt my type of eatery, but i wanted to try to see what the food would be like."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNzdieFVBEAE",
            "text": "A Turkish delight…nefis! We came here to celebrate a very special 27th birthday and we were not dissappointed! Highly recommend the zucchini pancakes and branzino. We had a beautiful branzino that was fresh, flavorful, and absolutely delicious. The options were authentic and perfectly executed. GORGEOUS seaside views while eating amazing seafood. The pumpkin dessert was a dream…try it with tahini and you will feel like you were transported to Bodrum. Whats not to love?"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5cDczcDZnRRAB",
            "text": "Good food, beautiful ambience\nWe took the fish cake from appetizers and the meat platter as our main dish both of which were full of flavours and scrumptious. The fish cake I would say surpassed our expectation. The meat platter containing four different types of meat preparation was simply delicious. Don't forget to ask for white sauce and hot sauce to enhance the taste of meat platter. Their complimentary bread was fresh and aromatic. The surprise was their lava cake about which we weren't too sure but the warm lava cake simply melts the vanilla ice cream in your mouth like a pop of magic. In one word the experience was splendid and the food was delicious. If you go during day time don't forget to ask them to give a spot at the back end from where you can get an amazing view.\nWe would definitely go again for their fish platters that we couldn't try today"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQXzYzbWx3RRAB",
            "text": "The food was delicious although the food was late, but the anchovies were delicious, I asked the host for a table with a view but she said no, although there were available tables and not reserved ones also she was talking without a smile, I don't like the way at all, but the staff was friendly, so I hope the manager looks into these matters"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0eEktWmt3RRAB",
            "text": "Second time here, decided to give them thumbs up, good job guys. Food is amazing, salads and desserts are incredibly delicious. Definitely recommend and will come again. From Hershey, PA"
        }
    ],
    "reviews_count": 72
}