{
    "name": "Anvar’s Restaurant",
    "place_id": "ChIJ26Qqz9NFwokRmEbxD-mtDxg",
    "grid": "BK13",
    "address": "241 Brighton Beach Ave, Brooklyn, NY 11235, USA",
    "rating": 4.4,
    "user_ratings_total": 151,
    "phone_number": "(718) 483-8085",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paU2VsUjJjV3RuTFdsSFEwYzBia3QzU1hBd00zYxAB",
            "text": "I'm happy 😊"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseWFFTndaM2x1VDNOWVZqQmpUUzF1WDFaU05FRRAB",
            "text": "Andre was fabulous and we had the best meal. Kebabs, mimosas, the best bread, samsa and the best service. Breakfast in Brighton was a must for us and we were totally satisfied. Will return again!!! Thank you for your hospitality💕"
        },
        {
            "date": "4주 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CT2FFZFRkazFVWTNwTU9DMXFjemQyZFZaa1ZHYxAB",
            "text": "Супер кофе, цена адекватная!"
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWFFtbE5PSEZ5WXpoRk9EQkVlRmxFU1V4NmJtYxAB",
            "text": "Очень вкусная домашняя еда , борщ выше всяких похвал, люля сочный, специи в меру, обслуживание на высшем уровне- молодцы ребята, получила огромное удовольствие !!🔥🔥🔥"
        },
        {
            "date": "2달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRlpIcE9ZbHBGTVZjME5rMXNSWEpFVDFKNE1VRRAB",
            "text": "Sehr frisch und lecker!!! Ich kann es zu 100% empfehlen. Die Preise sind auch besser / fairer als an der Strand-Promenade."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aUliQ0ZnEAE",
            "text": "🇺🇲 A pleasant, calm, homely environment in Anvar's Restaurant.\nDelicious fresh food, and salads.  Attention to each guest from the service staff and owners.\nPleasantly impressed.\nWe will definitely come back and not just once! ☝️🙂\nThank you for holiday at your place from our two Birthday boys and guests.🥳🙏💛💙👍\nI highly recommend Anvar's restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSlJtVjZlamc1YTNsUVF6a3hWeTFOZUZnd1pGRRAB",
            "text": "$30 for a basic burger & fries  is ridiculous for what it was, a small burger( McDonald's size)  The fries are great and the waitresses were nice but There's better spots on Brighton to get a burger"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvd1lWSm1NazFoVGtOMlVYZElSR2hGVlRsaWJYYxAB",
            "text": "Very good taste food was amazing thank you 🙏🏻 atmosphere is the best Anvar Restaurant excellent I recommend for all people welcome try then your feeling good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSmNYaEZNWGQyV21oRU4yUTFTMnhqZDJoUWIyYxAB",
            "text": "Nice food! Elvira is very good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUFkzQlZXWFpuU1dsWE9XdFRWMmd4WVdRelRFRRAB",
            "text": "Very good place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR1dsSTJibEpFT1VWVGIycDNhbFpvV0dOME1IYxAB",
            "text": "Amazing food! One of the best meals I had in a while. The staff is very friendly and attentive. The perfect spot for brunch with friends or dinner. I will be coming back."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zdFJVOU5VRXRDVmpsMlF6TlhjbVZ5VEdwUWRHYxAB",
            "text": "Clean place. However we were waiting for like 30mins for the food and there’s not really other customers during lunch. The dish is small and price is high, which is ok. Which I don’t really understand is that they charge you 10% service fee and the waitress said the service fee doesn’t include tips, that means you pay extra 30% on top of the menu price plus tax. Nothing fancy about the service, in other places, the server pours water/beverage into your cup and here you have to do it yourself."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oT1ZtOHpVVUZXYVVJMlluRlRXVzVrTlhRd2RYYxAB",
            "text": "Very tasty and comfortable"
        },
        {
            "date": "5달 전",
            "language": "uk",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKeVgtdERmZ0pyWXZ3RRAB",
            "text": "Вечеря 2 дні тому тут. Не рекомендую заклад. Кажу як є, офіціант настояв на ліпьошке, яку включив у вартість, але не приніс. Чайові включені у вартість, хоча там ніякого аж такого сервісу нема. Далі, був чек на 50 доларів, я дав 100$, здачу мені 40$. Я це усвідомив коли вже в метро сів. Гарний дизайн, музика та караоке фігня. Don’t recommend! Dishonest service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQLXRzUHJUdUtfVUVREAE",
            "text": "Amazing food. Very nice and personable service. Great new favorite in the area! Must visit!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvenFEZzFnRRAB",
            "text": "We were looking for a dinner spot on Wednesday night and came across this gem. When I called ahead, the staff was incredibly friendly and happy to accommodate us with a 9 p.m. reservation.\n\nThe food was really good — the manty is an absolute must-try! The service was attentive and warm, and the restaurant itself was really authentic. A great experience all around. Highly recommended!"
        },
        {
            "date": "5달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOcVpvTHI4dE8zMXBnRRAB",
            "text": "Салат неплохой, хороший сервис, рекомендую попробовать ребра, вкусное мясо !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeGRTNURBEAE",
            "text": "We visited your restaurant yesterday and were truly impressed! We want to sincerely thank the entire team — the service was outstanding. The waitstaff were very attentive, took all our preferences into account, helped us with our choices, and created a warm and welcoming atmosphere.\n\nThe food was not just delicious — it was exceptional! Everything was prepared with great care, beautifully presented, and full of rich flavor. You can really feel the quality and attention to detail in every dish.\n\nWhat touched us the most was the thoughtful gesture at the end of the evening — we were served a complimentary cake from the house. It was such a lovely and unexpected surprise, and it truly made our night special.\n\nThank you for your care, the wonderful atmosphere, and the incredible food. We will definitely come back again and recommend your restaurant to our friends!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNXZudFB3EAE",
            "text": "Anvar’s Restaurant, nestled in a charming brick building, offers a delightful dining experience with a trendy twist. The interior boasts exposed brick walls, a lush green ceiling, and vibrant floral arrangements, creating a fresh, inviting atmosphere. The open kitchen and sleek bar area add a modern touch, while the outdoor patio with artificial turf is perfect for sunny days. The staff is attentive, and the space feels cozy yet stylish, ideal for casual meals or intimate gatherings. A great spot for those seeking a visually appealing dining setting with a welcoming vibe."
        },
        {
            "date": "6달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2ZieHVRRRAB",
            "text": "Лучшие на Брайтоне! Мясо всегда лучше всех похвал!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdk5mWTJBRRAB",
            "text": "The Best Shashlik in New York — No Exaggeration!\n\nWe visited Anvar’s Restaurant today, and it was an absolute culinary delight. We were served this incredible platter (see photo) — a variety of shashlik skewers. Chicken, lamb, lula kebab, beef — everything was so juicy, flavorful, and perfectly grilled that it’s hard to describe in words!\n\nI’ve lived in Moscow for many years and tried shashlik in many places, but even there I never tasted anything this good. The aroma of the spices, the tenderness of the meat, and the beautiful presentation — it was all top-level.\n\nI truly believe this is the best shashlik in all of New York, maybe even in the entire U.S. Highly recommended for anyone craving authentic Eastern flavors!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMkxXSDRBRRAB",
            "text": "We visited your restaurant and were truly impressed! We want to sincerely thank the entire team — the service was outstanding. The waitstaff were very attentive, took all our preferences into account, helped us with our choices, and created a warm and welcoming atmosphere.\n\nThe food was not just delicious — it was exceptional! Everything was prepared with great care, beautifully presented, and full of rich flavor. You can really feel the quality and attention to detail in every dish.\n\nWhat touched us the most was the thoughtful gesture at the end of the evening — we were served a complimentary cake from the house. It was such a lovely and unexpected surprise, and it truly made our night special.\n\nThank you for your care, the wonderful atmosphere, and the incredible food. We will definitely come back again and recommend your restaurant to our friends!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMTVmdFRnEAE",
            "text": "Anvar’s restaurant is nothing short of a “Wow!” From the moment I stepped in, I knew I had found something special — a rare gem in Brighton Beach, where most restaurants just don’t impress me. But this one? It blew me away.\n\nThe food at Anvar’s is to die for. Every dish feels like it was made just for you, with the kind of care and warmth you'd expect from your best friend’s kitchen. It’s comforting, delicious, and undeniably homemade in the best possible way. I’ve tried many items on the menu, and I honestly can’t pick a favorite — they’re all outstanding.\n\nAnd let me just say this: their home fries are the best in all of New York State. Yes, really. Perfectly cooked, not greasy, and packed with flavor — they’re a reason to come back all on their own.\n\nWhat sets Anvar’s apart isn’t just the amazing food. The staff are warm, welcoming, and genuinely kind. Every visit feels like coming home.\n\nAnother rare and important point: I’ve never felt sick after eating here — something that sadly can’t be said for many other spots around the city. Anvar’s uses real ingredients, and they don’t over-salt their food like so many others do. The result? Flavors that are balanced, fresh, and clean.\n\nEvery time I go, I discover something new to love. If you’re in Brighton Beach — or even if you’re not — make the trip. Anvar’s isn’t just a restaurant. It’s an experience. One you’ll want to have again and again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcnF1NlhREAE",
            "text": "Authentic food and atmosphere that’s true to the neighborhood. Service was excellent and attentive. Restaurant was extra clean and bright. One of the few options in the area open relatively later. A must try!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNHJMWlhBEAE",
            "text": "The food was not fresh; instead of freshly cooked kebab, they just reheated it in a microwave. The taste was disgusting."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMk0ySXp3RRAB",
            "text": "Excellent restaurant. I recommend it to everyone. Today the whole family was there and we ate very tasty."
        },
        {
            "date": "6달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcWRDV0d3EAE",
            "text": "Вкусно, но медленное обслуживание, даже при пустом зале"
        },
        {
            "date": "7달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdVBENTRBRRAB",
            "text": "Спасибо большое за гостеприимство. За музыку, за кухню . Ребята официанты Александр, Хайрулло спасибо вам огромное за обслуживание вы лучшие.  Всем рекомендую."
        },
        {
            "date": "7달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3czkzWGZREAE",
            "text": "Все вроде хорошо.Был банкет на 18 человек.Все обговорили .все вкусно отмосфера хорошая заплатили бил плюс дали типы 200 кеш плюс сервис чардч.Посмотрели  дома чек  выясняется то что договаривались за напитки входящие банкет внесли в счёт а это компот плюс к 5 входящих 13 всего 18 графинов по 15 дол плюс вода минеральная 8 бутылок по 9 дол из них 4 входило в банкет.чай сказали бесплатно тоже сняли.просто неприятно 2 часа выяснения но некуда передавать разговор ужасно . Я не против заплатить за то что мы больше заказали но зачем обманывать.что входит в банкет а что нет.както неприятно.желаю всем счастья  и когда вы отмечаете пари у меня было 18 лет сыну чтобы небыло неприятного осадка.когда вы будете заказывать в что и сколько входит бесплатно фотографируйте снимайте видио  не верьте словам чтобы потом небыло больно!!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3a3MzZnF3RRAB",
            "text": "Nice atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdU15WkxBEAE",
            "text": "The menu looked pretty good, but the actual food was not all that.  Pretty much all of the food was oversalted and when it comes to the meat kebabs nor really a good sign.  Yes the place was pretty packed and it seems like they were short staffed.  While the waiters did try they were still missing things, such as giving napkins, so actually grabbed them ourselves from the bar.  Another thing that found odd was the fact that some of the food that was ordered was brought in from outside and not from the kitchen that is open right in the back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNDdyQmtRRRAB",
            "text": "Cute place love it"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndWRIbG9nRRAB",
            "text": "Perfect place to spend a perfect time ❤️"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBb3F2S19RRRAB",
            "text": "Very tasty cuisine."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOVo2aF9RRRAB",
            "text": "I visited the restaurant on Sunday afternoon. I recommend here to anyone. Delicious food and meat!"
        },
        {
            "date": "9달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcE16WGRBEAE",
            "text": "Самые соччччные люля кебаб в Бруклине! А меренговый торт….просто объедение!\nЗамечательная атмосфера, сервис на высшем уровне! Поужинали всей семьей и получили огромное удовольствие. Спасибо. Желаем процветания вам!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIb3N2UzZnRRAB",
            "text": "That was the best food and service! The food is fresh and delicious. Thank you"
        },
        {
            "date": "9달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfLXRmTnN3RRAB",
            "text": "Обдираловка . А качество остаётся желать лучшего. А ещё какие то сборы на сервисное обслуживание.😤😤😤😤😤😤😤😤😤😤😤😤😤"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfX3F1NkRREAE",
            "text": "My family and I attended a private event held at this restaurant recently. I was not as familiar with Turkish / Russian cuisine, but oh man I definitely am now! The food was absolutely delicious! It was hot and so flavorful. The salmon and chicken kebabs were my personal favorite. Each course came out with such professionalism and care. We loved the atmosphere, and all the servers were so attentive. We will definitely be returning just to have dinner during a normal day in the future. I would say Anvar's Restaurant is perfect for both large gatherings and casual dinners! I highly recommend this place!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdnZqbGx3RRAB",
            "text": "Big selection of sweet and salty treats, the place is very nice and clean, staff very attentive. Excellent for a quite cozy breakfast."
        },
        {
            "date": "9달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaW91MXNnRRAB",
            "text": "КЛАССНЫЙ  РЕСТОРАН, ПЕРСОНАЛ  ОТЗЫВЫЧИВЫЙ, ВКУСНЫЕ  БЛЮДО  ГОТОВЯТ."
        },
        {
            "date": "9달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc3Vfc3VRRRAB",
            "text": "Очень вкусно, рекомендую."
        },
        {
            "date": "10달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aW9DRnZRRRAB",
            "text": "Хочу поделиться впечатлениями о ресторане, который реально покорил меня. Атмосфера там просто супер: мягкий свет, стильный декор, всё такое уютное и располагающее, что не хочется уходить. Это то место, куда хочется прийти и с друзьями, и с родными.\n\nА еда – это вообще отдельный разговор! Блюда выглядят так, будто их только что сняли с обложки кулинарного журнала. Всё свежее, вкусное и с любовью приготовлено. Порции большие, а вкусы... просто огонь! Обязательно попробуйте их фирменное блюбо жареная форель – мясо сочное, нежное, прожарка идеальная. А гарнир так дополняет, что пальчики оближешь. На десерт советую шоколадный мусс – тает во рту, как мечта.\n\nОбслуживание тоже на высоте: официанты дружелюбные, ненавязчивые, но всегда готовы помочь и что-то посоветовать.\n\nОднозначно рекомендую этот ресторан всем: друзьям, знакомым, родителям. Здесь не просто вкусно, здесь реально кайфово провести время!"
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuM2NhdG9nRRAB",
            "text": "Сегодня мы посетили этот ресторан и были неожиданно удивлены  что на Брайтоне открылся такой ресторан. Мы вообще проходили мимо, но снаружи стоял шеф повар который так вкусно рассказывал о том какие блюда мы можем попробовать и мы не удержались и решили попробовать. Меню очень разнообразное , прекрасная обстановка, вежливый персонал, чистота. Шеф повар сам лично рассказывал  и рекомендовал блюда которые мы можем попробовать и мы остановились на \"Салмон  в белом соусе\" и \"Каре ягнёнка с грибным соусом\". Блюда были приготовлены замечательно.  Мы остались очень довольны. Мы очень рекомендуем этот ресторан. На сегодняшний день это наш  фаворит."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib1B2YlNREAE",
            "text": "One of the best Dinner I've ever had in my life. The atmosphere, the ambience, the food, the service, the music, the aroma and then the personal touch by the owner, simply out of this world.\nThe newly renovated restaurant is marvel. If you have not visited it till now, then you're missing a rare gem.\nYou won't be disappointed, I guarantee 💯."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzLXJtRkJBEAE",
            "text": "Just tried Anvar’s restaurant in Brooklyn, and it was fantastic! The flavors were fresh and authentic, and the service was warm and inviting. The staff was friendly and attentive, making sure we had a great experience. Highly recommend the steak and Spanish style beef tongue - it’s a must-try! Looking forward to coming back soon."
        },
        {
            "date": "10달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmb2JYdVZREAE",
            "text": "Ресторан заслуживает высшей оценки! От самого входа встречает атмосфера уюта и элегантности. Интерьер продуман до мельчайших деталей, создавая атмосферу уюта и тепла. Обслуживание на высшем уровне: внимательные и профессиональные официанты, которые всегда готовы предложить лучшие блюда и напитки.\n\nМеню разнообразное и включает как классические блюда, так и интересные авторские решения. Каждый продукт свежий, а презентация блюд впечатляет. Вкус каждой трапезы — настоящая гастрономическая симфония. Особенно стоит отметить десерты, которые буквально тают во рту.\n\nЦены соответствуют качеству, и этот ресторан определенно стоит того, чтобы его посетить. Идеальное место для романтического ужина, деловых встреч или праздника с близкими. Рекомендую всем, кто ценит отличную кухню, безупречный сервис и атмосферу."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybUliLXp3RRAB",
            "text": "I passed by this place a couple of times and finally gave it a try. When I walked in, I was seated very quickly and they offered me some off menu specials. I chose the tuna salad and salmon shrimp plate, it was absolutely amazing. They came out soon after I ordered and I was very pleasantly surprised at how low the bill was. I suggest that if you have the chance try this new place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzLXVXVmpBRRAB",
            "text": "My sister recommended this place and we decided to give it a try. I enjoyed the food, it was delicious and unique. Nice and cozy, very inviting atmosphere with polite staff. If you want to try  juicy, flavorful salmon, this is the place to go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNEtHUHFRRRAB",
            "text": "I had the pleasure of visiting a brand-new restaurant in Brooklyn. The shish kebab was cooked to perfection on real hardwood charcoal. The salads were fresh and prepared right in front of us. The waiting staff were very knowledgeable and created a positive atmosphere. The way they served the main dish with a fire show and perfect music made my day. I definitely recommend this place if you are in Brooklyn. Ask for their tuna salad; it will not disappoint you."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dHYtNURnEAE",
            "text": "My first impression was incredible, the owner and manager Mrs: Rano, very friendly and cordial, the food was delicious.\nI decided that every week that  I  come to Brighton Beach in my beautiful Brooklyn this will be my restaurant to visit and enjoy. On this visit Mrs: Rano prepared me a delicious salmon with white sauce.\nwith pleasure\nNancy Alper"
        },
        {
            "date": "10달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMzc2ckp3EAE",
            "text": "Мы здесь отмечали день рождения и все было идеально! Вкусная еда, отличный сервис! Нас обслуживал Игорь и мы ему очень благодарны! Ребята вы крутые! Всем советую!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIc3VMaWlnRRAB",
            "text": "New restaurant along Brighton Beach Ave, swift & attentive, welcoming uncluttered space with quiet ambiance in an indoor setting, good for groups or solo, flavorful\nBaked trout with roasted vegetables worth trying"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eXVxLXJRRRAB",
            "text": "If you are in New York, I recommend you definitely to go there! Nice place with amazing food and best service. We got the perfect service by  Khayrullo. You are the best guys🙏"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aXM3dWtBRRAB",
            "text": "I confidently recommend this restaurant to anyone who values quality cuisine and a pleasant atmosphere. This place is definitely worth a visit!\n\nThe space is cozy and warm, yet very stylish. The service is excellent. The waitstaff are polite, always ready to suggest something from the menu, and never keep you waiting long. You can tell they genuinely care about the guests' comfort.\n\nThe food is beyond praise! I ordered the shashlik, which was delicious and juicy. The salad was also tasty. I ended the evening with cheesecake — it was so tender that it was hard to stop eating it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OG9ISHNRRRAB",
            "text": "I revisited my favorite restaurant, and once again it exceeded my expectations. The rack of lamb was absolutely delicious and its my new favorite!"
        },
        {
            "date": "10달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2c3FHQ3lnRRAB",
            "text": "Недавно был в ресторане. Все было очень вкусно, особенно шашлыки. Всем рекомендую."
        },
        {
            "date": "10달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmb2JtOG5RRRAB",
            "text": "Ресторан «Анварс» — это место, где каждая деталь продумана до мелочей, чтобы сделать ваш визит незабываемым. Великолепная атмосфера, приятная музыка и уютный интерьер создают идеальные условия для отдыха с семьей или друзьями.\n\nКухня заслуживает отдельной похвалы — блюда поражают своим вкусом, свежестью и изысканной подачей. Особенно рекомендую попробовать их фирменные национальные блюда — настоящий восторг! Обслуживание на высшем уровне: персонал вежливый, внимательный и всегда готов помочь.\n\n«Анварс» стал моим любимым местом для ужинов, и я с уверенностью могу порекомендовать его всем, кто ценит качественную кухню и отличный сервис!"
        },
        {
            "date": "10달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OHJuM1RREAE",
            "text": "Лучшая еда, которую я пробовал в Нью-Йорке за долгое время. Еда просто шикарная. Очень вежливый официант. Хорошая атмосфера. 10/10 я бы постоянно ходил, если бы я жил в этом районе."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeDViRjFBRRAB",
            "text": "I went to the restaurant to get a seat for three people. There were no free seats. I was told to wait 10-15 minutes. I waited for a long time. They made me realize that they remembered about me. After a while, two tables were vacated at once, which can be used separately. I was told that I could not use them because they are designed for 6 seats. In the end I spent 37 minutes and left in a terrible mood. I do not advise anyone to go there."
        },
        {
            "date": "10달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2c3ViMGJREAE",
            "text": "Ресторан просто супер, а обслуживание это вообще не передавать словами, нужно сходить и увидеть. Для Америки это редкость. Сходили вкусно покушали с друзьями довольны. Спасибо всему персоналу. Точно советую всем."
        }
    ],
    "reviews_count": 61
}