{
    "name": "Vis-a-Vis Restaurant",
    "place_id": "ChIJaeRukUdEwokRVbe6Tt9hYBw",
    "grid": "BK13",
    "address": "3100 Ocean Pkwy, Brooklyn, NY 11235, USA",
    "rating": 4.5,
    "user_ratings_total": 691,
    "phone_number": "(718) 333-0003",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeVFXTnRaVUkyU0dsUVRYQkRZV295WVdsSFZYYxAB",
            "text": "Vis-à-Vis is absolutely outstanding! The steak was cooked to perfection — tender, flavorful, and perfectly seasoned. The drinks were top-notch, expertly crafted and beautifully presented. On top of that, the service was exceptional — attentive, friendly, and professional from start to finish. A fantastic dining experience all around — can’t wait to come back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSFpsRlhkR3hmVmxWUVV6UnlaM3BDZUhSMU1HYxAB",
            "text": "They completely ruined my special event. I have made a reservation in advance, came there in person to reserve a table, just to receive a phone call from Anastasia a day before my daughters 20th birthday that the table is no longer available. What an irresponsible business. Do not recommend it to anyone as they are unreliable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMExUZzVhRFZhYzFSdVpqRkNORkl3T0RVeFoyYxAB",
            "text": "Come eat here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4elMybE5RamhyUW5SV0xXWTJXVmRNYkZwclFsRRAB",
            "text": "Place is such a beautiful place to chill and eat and the staff and very respectful and sexy worth every penny"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQmEzaHVRbWg0VDNCR2JHZDZXbVZpUWxBd2VGRRAB",
            "text": "Yesterday I had a really amazing experience by visiting this place for the lunch!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkT1dYQndlVGhYV0hsRVRWZFBlR0ZuUkZsdlRIYxAB",
            "text": "I had the best experience celebrating my birthday at this restaurant.  Food,  service,  music was great.  My special appreciation is to the chef.  Food was absolutely amazing and plentiful. The price is on a high side,  but worth every penny.  Thanks,  guys."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paR1JuaHFVM1IxY1V0MFFYSm9ObkpGYTJoemMzYxAB",
            "text": "It was a birthday brunch.  I loved the food, fresh and really tasty - from salads and appetizers to shish kebabs and sliders and other dishes in between and very fluffy sirniki and fruits for desert. The company was great and we had a great time!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UVNrODNPWGRLYXpaWU4yMUZVM3BDVDFwRFFsRRAB",
            "text": "First the Black Sea Restaurant Was blasting music until 1:30 in the morning. Located in a residential building No consideration for anyone. Now they're out of business.Tonight Saturday I'm hearing the same garbage come from this restaurant.…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJTGRwX3o4dGZQRVB3EAE",
            "text": "Wonderful and special place with amazing food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZm1pc2FZaThucDB3RRAB",
            "text": "Celebrated my 30th birthday here.. everything was outstanding. The service was excellent, we never had to wait for anything, waiters were constantly serving us food, cleaning, and not to mention it was packed in there with every table booked. The vibe is super cute, like typical Russian banquet spots. However I must say, the food was fantastic everything was super fresh and delicious and portions were huge. Compared to the usual south Brooklyn spots like level, wise, etc… this was much more memorable, felt more personable and every one of my guests agreed! Definitely will be coming back for many more celebrations."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKV0VzcERZMGZpckxBEAE",
            "text": "cool"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYlZoNHZOeWJ2Y01nEAE",
            "text": "We recently hosted my daughter’s 12th birthday party at VisÀVis Restaurant with over 120 guests from all five boroughs and Long Island — and once again, this place was absolutely amazing! The service was top-notch, the food was outstanding, and everything ran flawlessly. Not a single complaint from us — and trust me, with a crowd this size, that says a lot.\n\nOur guests were truly impressed that such an incredible venue exists right here in Brooklyn. A huge thank you to the entire staff for their professionalism and warm hospitality. Special thanks to Manager Farruh, who went above and beyond to make sure every detail was perfect — we couldn’t have asked for more.\n\nAnd just to share a laugh: the only “complaint” one of my friends jokingly made was that they never once saw the bottom of their glass, the service was that good!\n\nThank you again, VisÀVis — you’re simply the best!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJckswcldIOGVqZmRnEAE",
            "text": "I celebrated my 55th last with with a group of friends and family. Amazing place, great food and music. The service was truly top notch.  I highly recommend this restaurant to anyone who wants to have a good time. My family and I will definitely be back to celebrate other occasions. Thank you Vis a Vis!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOV2I3cmJWbm9MNGh3RRAB",
            "text": "Best of the Best!!! Always pleasant to come back again and again and again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNWE0yLURra2NYVnpBRRAB",
            "text": "Had such a great time at this spot! The food was so good—we tried the chili-smoked shrimp with celery root purée and the eggplant burrata salad, and both dishes seriously hit the spot. The shrimp had that perfect kick, and the purée was super smooth and flavorful. The salad? Fresh, creamy, and just plain delicious.\n\nThe service was absolutely amazing. Our waiter Alexander was not only super friendly and attentive, but also genuinely made us feel comfortable and well taken care of the whole evening—such a pro! The bartender Anton really impressed us too—his energy, creativity, and attention to detail were next level. I had a mango margarita, and I’m not even joking—it was the best one I’ve had in six months. And I love margaritas, so that says a lot.\n\nManager Stas was incredibly kind and checked on us during the evening, which was such a thoughtful touch. And the hostess Anastasia welcomed us with such a warm, friendly vibe—it really set the tone for a perfect night.\n\nDefinitely coming back. Great food, great drinks, and an amazing team that truly knows how to make guests feel special."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMDZtcGxRRRAB",
            "text": "Denis provided an absolutely outstanding dining experience at Vis-à-Vis. From the moment we arrived, he greeted us warmly and made us feel truly welcome. His knowledge of the menu and wine pairings was incredibly impressive and helped elevate the meal to another level. Throughout the evening, Denis was attentive without being intrusive, anticipating our needs perfectly. His professionalism, friendly attitude, and attention to detail created a relaxed yet elegant atmosphere. Every recommendation he made was spot-on and showed his passion for fine dining. Denis truly went above and beyond to ensure our experience was memorable. I would highly recommend requesting Denis when dining at Vis-à-Vis for an unforgettable experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX1lXY1pREAE",
            "text": "We had a fantastic experience at vis-a-vis restaurant. Our server, Dennis, was amazing — friendly, attentive, and made sure our group had everything we needed. The food was absolutely delicious. The atmosphere was relaxed and welcoming. Highly recommend and will definitely be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdmNQcWh3RRAB",
            "text": "Celebrated a birthday here on a Sunday afternoon. The food, service, and atmosphere were all great. Michael Petrov and his team of servers were super attentive and went above and beyond. Thank You."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2RiTTN3RRAB",
            "text": "Food was excellent but the drinks were even tastier! Had an excellent and kind bartender named Vlad that was so helpful and made the experience much better."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMFkteGp3RRAB",
            "text": "Amazing spot — delicious food and great music. I had the pleasure of being served by Dennis, and he’s by far the best waiter I’ve ever had. He was super attentive and made sure my vodka shot glass was never empty. If you’re planning a visit, definitely ask for Dennis. I’ll 100% be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMGQzT1d3EAE",
            "text": "This place is wonderful and our server Dennis gave wonderful attention to us and made sure we were good. We will be back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMGZHUUlREAE",
            "text": "I had the absolute pleasure of being served by Dennis during my recent visit to the restaurant. From the moment we sat down, Dennis made our dining experience exceptional. He recommended the best dishes on the menu—every bite was perfect thanks to his great suggestions. What really stood out was his attentiveness: my glass was never empty, and the moment I finished a course, plates and silverware were cleared and refreshed without me even noticing. His service was seamless, professional, and genuinely warm. Dennis truly elevated our night out. Highly recommend asking for him if you visit!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvczZyQnpnRRAB",
            "text": "Had an incredible Brunch here today 4/19/2025. The food was outstanding, the service was wonderful and the atmosphere was chic and nice.\n\nWe had the dranik eggs benedict, skirt steak and eggs brunch options with 2 mimosas and coffee and it was delicious. I highly recommend anyone who loves boozy brunches and delicious food to come to Vis a Vis in Brooklyn NY,"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMnNEc1BBEAE",
            "text": "Awesome eats!  Pleased.  Thank you!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3al9XWWx3RRAB",
            "text": "A great restaurant. Came last minute in the neighborhood, wasn’t dressed for the atmosphere but all the staff was very welcoming, nonjudgmental and provided excellent service. Seated right away, all staff was very attentive and the food was to die for. Very pleased and looking forward to returning."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3enNtOENREAE",
            "text": "Great food ,service, and atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRZ1pqNGVREAE",
            "text": "Amazing food 🙏🏾"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnay1UM0h3EAE",
            "text": "Vis a Vis is a class act. Whether you are having an intimate dinner for 2 or having a group dinner for 20 or more people, they seem to find a way to provide quality food and superior service.  It almost seems they have anything you would want to eat. They also have a huge bar of many varieties of drinks. The service is constant and wonderful.  If you have a concern, they find a way to alleviate your concerns. I do not recall any other restaurant that provides this high quality of service. When you request a drink, the bartenders provide high quality glass and picture quality display of your drink. Even their dessert platters are varied and delicious. They even have valet since it's difficult to find parking in the neighborhood.  Going to Vis a Vis is a nice experience that anyone would want to have. If you are also willing to spend on a quality restaurant,  I would highly recommend this place for any occasion!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaElQVjF3RRAB",
            "text": "Amazing food and restaurant atmosphere"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfLVB5N19BRRAB",
            "text": "I had such a great time here! The food was delicious.service is great! Music and DJ were outstanding! The vibe was amazing, with the perfect mix of tracks that kept the energy up without being overwhelming. Definitely a place I’ll be coming back to!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOXZEYk9REAE",
            "text": "We were there for birthday.\nFood is mediocre. Service is attentive. Music is terrible andcDJ is suck, he was demanding $20 for each song that we requested,but even then,he altered original songs and it sounded awful!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeDl5cGN3EAE",
            "text": "Beautiful place, nicely decorated, good food and service, great modern international dance music, from all regions of the world, fun and pleasant atmosphere"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NU1iWjhBRRAB",
            "text": "Came here for a corporate party and it was great! Atmosphere was great, food was amazing everything served was tasty and fresh. The salmon crispy rice was one of my favorite. Service was great and the waiters were very attentive."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M2Ffb0VBEAE",
            "text": "We celebrated Birthday in the separate room. We had excellent service. Dancing floor was nice. Definitely will come again."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvaGJYX3JnRRAB",
            "text": "Excellent food and service.  I would call it more French Fusion than French. But excellent and tasty.\nService has declined as they don't give enough servers for private parties. But the guy(s) they do give you are very nice."
        },
        {
            "date": "11달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQLXBHTF9BRRAB",
            "text": "Приятная обстановка"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQMUstZnVRRRAB",
            "text": "As a First time customer at the Vis-a-Vis Restaurant It was an  Incredible experience. Very friendly and professional staff. The food was excellent, amazing service. I’ll definitely return to this great restaurant."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeWVyaU53EAE",
            "text": "The fare and service are exemplary!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyd2NIVW1RRRAB",
            "text": "Wonderful! I have been to Brighton  Beach many times and never ate at this amazing restaurant. It has a peaceful front door and unless you are looking for this place it is easy to miss. A relative who has lived in the area for 40 years did not know about it.\n\nThis restaurant is French with heavy Russian influence. My friend, who is from Russia knew to order the Salo Borodinsky. If you go here it is a must order for everyone. The dish explodes in your mouth with flavor, spice and textures. It consists of pork which is fatty and smooth like butter while being white not red. It is served with fresh Russian rye bread, powerful mustard and fresh garlic. It is off the charts delicious and for me was the star.\n\nWe shared a Greek salad which was extremely good. I had borscht and for the main course the shrimp scampi. The shrimp was excellent with a tasty cream sauce and wild rice.\n\nFor dessert we had coffee and the napoleon. It was fairly sweet but very addicting. As someone who does not eat sugar couldn’t stop eating it. The flavors were so fun to swish around in my mouth.\n\nI can’t wait to go back so I can try other items. The staff is kind, friendly and thoughtful. The atmosphere is very spacious, fun, elegant and relaxing. GO EAT HERE! It is expensive and worth it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbnBmTld3EAE",
            "text": "I've been performing in the live events industry for almost 25 years. There are few restaurants I would recommend that offer the entire package between great food, drinks, entertainment and atmosphere.\n\nVis-a-Vis is most definitely one of the better ones where you can enjoy a delectable dinner with dancing or host your private event. There are two rooms at this restaurant. One is a private room that can fit about 70-80 people and a small dance floor.\n\nThe main restaurant can probably fit a little more. They have a large screen video wall, TV screens and great music by a DJ.\n\nThe wait staff is attentive and make sure that your plates and glasses are full always.\n\nYou will have to valet your car unless you don't mind circling around a couple times for parking as it is Brighton Beach, Brooklyn. I'm positive you will enjoy your experience at Vis-a-vis as every dish is fantastic and the vibe is just right."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyOU5IYVB3EAE",
            "text": "Vis a vis is a beautiful restaurant with elegant decoration. The food is amazing and they have a great selection of wines. A must try if u are arround Coney Island."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeS02Mmp3RRAB",
            "text": "If the name is French, then at least one servant should be; I haven’t noticed any Julien made of mushrooms/chicken. We celebrated in the nice atmosphere New Year 2024. We arrived and departed by “Uber” (this is taxi). I loved the most duck liver on bread and another fried duck, also I am fond of my native Russian fried potatoes (this restaurant serves with the stewed mushrooms), Spice Tuna Tartare was incredibly nice, as well I liked very much some rolls (I don’t know their name, sadly), the Greek salad was tasty too. I am not a lover of fish, but the fishy dishes were so\ngood, I have been unstoppable, and constantly eating it (I was surprised of myself). Additionally, my company and I were given the tiger shrimps that were nicely fried, presented, and tasted. The wardrobe is available for $5 tips. The servants were quite nice, they poured champagne all along."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2bUpYelF3EAE",
            "text": "Edit 2 years later:\nHappy to report that the cuisine is consistently amazing and creative (not your regular nostalgic ex-russia place), but the service became even more attentive, they really go out of their way to make your visit pleasant and memorable.  The alcohol pour is generous and Alascan crab salad was especially great. Nice mixed crowd, friendly and fun.\n\nOriginal: Fun and delicious restaurant, with international cuisine and russian dishes. Their mushroom potatoes are to die for! The place turns into a club in the night and there are a lot of big parties celebrating bdays, so if you want a quiet time - book a table on their nice terrace and you always can go to the dancefloor inside if you wish."
        },
        {
            "date": "수정일: 1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaGVpNEhREAE",
            "text": "В очередной раз остались в полном восторге от профессионального обслуживания, красивой подачи и вкусной еды, очень рекомендуем Всем любителям эстетики это прекрасное место! Отдельное спасибо Александру за профессионализм🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENU0tTmF3EAE",
            "text": "\"Vis-a-Vis restaurant in Brooklyn is a must-visit for a memorable evening with friends or a date. The food is exceptionally delicious and offers a diverse, eclectic menu. The vibrant atmosphere is further enhanced by an energetic DJ, creating a lively ambiance. Overall, Vis-a-Vis is an outstanding dining destination that I highly recommend.\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINmZ1cWFnEAE",
            "text": "Authentic, a great French restaurant! We will be back again 🤗"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkc05hc2dBRRAB",
            "text": "The ambience and the food are amazing. I had the lamb chops which were cooked to perfection but what stole the show was the Chilean sea bass (it’s a must try). The drinks were great and I will definitely be returning. In a day and age where places just look good and forget about quality of food this was so refreshing. You will not find that here. The food and the decor is top notch & you can even dress up and not feel over dressed because the staff all look very presentable from women in beautiful dresses to men in tucked in shirts and just an all around clean look. I really enjoyed this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxN0p5dml3RRAB",
            "text": "This place is good and has a good vibe. The employees will help you out and there’s a storage for jackets. The food is also very tasty and delicious"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNEtxbW1RRRAB",
            "text": "Came here with my friend for drinks. It was clean and the atmosphere was fun and clean. They open to 12 am on the weekends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdkwtaWF3EAE",
            "text": "Went here for a private birthday party.  The food is always on point.  The raw bar was packed with fresh seafood and caviar.  The rest of the food came out perfect and plentiful.  The wait staff is always accommodating to your needs.  Great place for a party."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNELV8tR0Z3EAE",
            "text": "Very popular and highly recommended restaurant. Went for dinner, 7.30 on a Friday, there were not too many people. Outstanding service, tasty food, seems like a well-run classy place. Beautiful decor. We'll have to try for more like a party, dancing . Decided against birthday party there, was advised will be very crowded and loud.\nWill visit again."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBME95TkNnEAE",
            "text": "Great place, great service (they are proud about it) food is delicious. One of the best until now in NYC. You must try it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0OEl2TUFnEAE",
            "text": "Good food. Very fancy decor. Staff was friendly   No complaints. Bloody Mary was sparse but tasty."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNVA3S1JnEAE",
            "text": "Pros:\nFood was great.\nNice interior.\nCons:\nMusic from 9:00 pm was the loudest I ever experienced.\nWaiters were very attentative BUT  constantly pouring wine from different bottles in the same glass of customers. They have no idea that wine from two bottles of red wines taste differently."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMzZUd3lnRRAB",
            "text": "We love this place,delicious food,excellent service, great atmosphere. Bartender Alisa was amazing, thank you for your great service and kindness!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMb05pSXNnRRAB",
            "text": "The nieces Bat Mitzvah was incredible! The staff is second to none in speed and helpfulness. A glass was never empty, a request was never too small or too big, and the food was amazing, and just kept on coming!"
        }
    ],
    "reviews_count": 56
}