{
    "name": "Azure Lounge Restaurant",
    "place_id": "ChIJzwLrELNFwokRdvgfTw5NO4U",
    "grid": "BK13",
    "address": "3145 Brighton 4th St, Brooklyn, NY 11235, USA",
    "rating": 4.3,
    "user_ratings_total": 143,
    "phone_number": "(718) 814-0500",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKb1VVUktXa2h1Y1ZGQ2FUUkJSR3N0U0ROaE5VRRAB",
            "text": "Honestly a really awesome place with an really awesome view, great atmosphere and vibe and especially the friendly staff that make you want to visit the place again. Great service specially from one of the servers, Ihor whos very supportive and welcoming to everyone and makes sure everyone has a good time. If you going for a walk at Brighton make sure you pass by this place for a drink and snack. The place is even more nicer at night. Cool place and definitely visiting again 💯🙌"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa1JIRk1hMng1WlRGdVREaG1jMWswU1dwVFZYYxAB",
            "text": "Great new spot! The atmosphere is cozy and stylish. The staff are friendly and attentive, and the menu is full of fresh, flavorful dishes — everything we tried was absolutely delicious."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWVdGaFdhMjFJYkU5elpHZEdaVVYwWWpsck5rRRAB",
            "text": "Our experience at this restaurant was very disappointing.\nWe placed our order, but they completely forgot about us — we waited over 45 minutes, and no one came to check on us or apologize. The blanket we asked for was never brought either.\n\nDuring that time, a homeless man and a drug addict came up to our table and started bothering us. What’s worse, none of the staff or management tried to intervene or ensure our safety, even though they clearly saw what was happening.\n\nWe were extremely disappointed with both the service and the lack of security. Definitely would not recommend this place."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdGRVOW1Ua3BDV0Y5Q1JEVjZVMGRDTURSaFVIYxAB",
            "text": "Azure Bar has such tasty food and an elegant atmosphere! The staff are very nice, and there’s a beautiful view of the ocean. 🌅"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOZlQyMVNUV2RzUzNoR1UyTlZjR0pJTkhkUGNVRRAB",
            "text": "Perfect service! So tasty coffee! Truly recommend to visit 🔥"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReGIxVklja0ozT1dOZlEzbGZYeTFxZEROeFdFRRAB",
            "text": "Services is terrible waiting for a coffee more than hlaf hour, very expensive High Sky"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaV1NFRnZia2R5VTFkc2FsWkNZMHRvWWpVeFprRRAB",
            "text": "Beware of false promises\n\nI had lunch with my son yesterday while we were taking in the sites on the Brighton Beach Boardwalk. Although Azure had no lunch specials, we decided to dine  outside.  We both ordered the pork shish kebab. The pork was the toughest meat I ever had. I could hardly cut it with a knife. The sides were good. I had french fries and my son had grilled vegetables. The waiter Was unhelpful and cold. You can imagine my surprise when I got the bill which was $93.33. That did include a Tasteless Cold borsch. Azura added an 18% service charge which they didn’t say anything about on the menu. I strongly urge you not to eat at Azure. Rather go to one of the restaurants or grocery stores on Brighton Beach Avenue and take out something to eat. You wont be ripped off."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcFRXRllOelpWV0ZKSGJ6Tm1lbTlsVWxkRWVYYxAB",
            "text": "Offel Food and No Service\nThey don't care about reviews/or they rating, gratitude 18% automatically included in your bill\nAvoid at all costs!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUGNVeGxVWGhDV1dkamNVZHZSamhXTTBWRU5VRRAB",
            "text": "The food was great, service was terrible, they have overcharged us by at least $200 included made up taxes, and also included tip for 5 people table which is illegal, never told us about it. We didn’t notice and tipped on the top of that. As we returned from the restaurant, we called to let them know we have been overcharged - they replied that we can come back and rip the money off of his servers. It was truly Brighton beach experience! We will be avoiding this restaurant next time and make sure to let all our friends know!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205ck0xTm9hWE00VWtnd1lTMVlUSFZaV1VSeFdYYxAB",
            "text": "The guys who attend are cute, so I guess is extra points 🤷‍♀️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOYVZsQkhTVzVYYnpBMFNGRkxiMnRYWDNWNExYYxAB",
            "text": "The experience here was very good. The stuff is friendly. The best hookah I’ve ever tried, thanks Michael"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVFZreG9MVk5MWTNKRGIyUnRMV2hMV21ONGFXYxAB",
            "text": "Misha great server, he really knows how to make a day perfect service and all the cappuccino is fantastic"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMWNEWjBMVWRQTWxodGRFRm1NRkJaTFVWaGFIYxAB",
            "text": "We were not hungry but wanted to have a drink. French fries was a perfect snack: great portion, it was crispy salty, not greasy. Our waiter was attentive and accommodated our request for cheesy-parmesan fries."
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saWVGVllPVzh6ZFZaaU1VVk1iVGRqYzNseVozYxAB",
            "text": "Отлично"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Sk1qSnhVMG8xU0drd1JWSklTMlpUVVZoV1dFRRAB",
            "text": "Perfect service excellent food\nCosy atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaFpuWmZTMUZyV1cxeWMyTlViVEZ6ZVc1MlgxRRAB",
            "text": "Hidden gem in the heart of Brighton Beach! 10/10 hospitality especially Roma, he makes sure everyone feels right at home and the food is magnificently unique! Definitely recommend!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CM1ZHOXFZMVV0TTFFeVVXSTNjVWRKYjNCaGFXYxAB",
            "text": "Live local and stopped in for lunch. Sat outside on the boardwalk. I was craving a burger but was delightfully surprised by the lunch menu. $19.95 for a full size soup (cold & hot options), a side salad, and a main dish with choice of side. The special is only available Monday-Thursday. I forgot the times, sorry. The portions were great for a lunch special and more than filling. FYI an 18% service charge/gratuity is automatically added to your bill but I totally think it’s worth what becomes $23 for a delicious boardwalk lunch in a tourist area. Take the walk outside of the amusement area. You’ll get better quality food with a better crowd and service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMFR6WTVZMXB3ZGpreE1raHNVRTFGZG1OUFprRRAB",
            "text": "Delicious food, perfectly dressed salad, scrumptious home fried potatoes and the flounder is both crispy and juicy all at the same time, as were the grilled veggies. Iced latte is on point. The service is accommodating and friendly, Misha did a nice job and with this view one can’t go wrong."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VGNuZHJkRk5mVFU5dE5tNXRZbkpUVTFCTlduYxAB",
            "text": "Amazing place, tasty food, great entertainment program ( Max the best!!!)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOZldWZFZiVzVqTTJNM09XZERka3R1VGpocmNYYxAB",
            "text": "Great food and entertainment.  The Borscht is amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQmJISnRlVVF0ZG1OeVRITTVhRGMzTlRoaFRWRRAB",
            "text": "Delicious food, great atmosphere, polite and friendly service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReGVYWTVUbnBZVjBaS1dtbG5WRlJOTFdJeVUyYxAB",
            "text": "The worst food ever!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MWEwTTFZMFoyTTJ0cGNUZGpPR1kyWXpkdmFVRRAB",
            "text": "Definitely must try !!!! Great hospitality. Thanks to all team so friendly atmosphere 🥰🥰🥰"
        },
        {
            "date": "2달 전",
            "language": "ka",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxV2FHbDVUa1JxWkdvMVgyMXNNa0o2YkZBM2RVRRAB",
            "text": "საუკეთესო მომსახურება,გემრიელი საჭმელები და უგემრიელესი მანგო🥰🥰🥰🥰 მადლობა"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4a09UTjVVbWRDWW1WVk1reE1SVFkwY0dObU9FRRAB",
            "text": "100% will be back !!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcVZXNUZWV2gxV2pkYVpqWkhNWG8wZFU0M05rRRAB",
            "text": "Amazing food! Great vibes. Live music."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMlNXVnJTa3BCZDBORWJtazFaVEZOV0RCbGNGRRAB",
            "text": "Ochen horosho guys, very good service 👌🏽\n-MG"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sb1ZTMXFlRjlWWkdoaFVsQnVhVXRxYW1GV1RHYxAB",
            "text": "Thank u guys 🌟 The hostess Yana was amazing, so friendly, food was so delicious. Everything was perfect, thank u. Highly recommended this place🌟🌟🌟"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMFlWZGxVbXB1Tm01M1RsaHllbFJZVW1KWkxYYxAB",
            "text": "Great place for relaxing !!! Food really good stuff so friendly !!!!! 10 out of 10 🥰🥰"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5T1QzbHVUbk0zT0VWQ1V6ZG5Na3AzWVZSaGFFRRAB",
            "text": "I love coming here! Every visit is such a pleasure. The atmosphere is warm, cozy, and full of good vibes — it makes you feel like  home. The staff is super friendly and caring, treating you like family. The food is always fresh, tasty, and nicely made, with big portions that fill you up. I’ve been here many times, and it’s always a great experience. I highly recommend it to anyone who loves delicious food, kind people, and a welcoming place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SalVDMDFWV3hDY3pKM2JuSm5WbE14TkZwWU5IYxAB",
            "text": "Great place, delicious food, very friendly staff. I definitely recommend it and will be back 😁"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCU1NHMTBUa1UyYmpkZmRsTjJMVEZKU0RZeE9FRRAB",
            "text": "Excellent food, very nice atmosphere. I will definitely come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GYVpYRmhNRk5yTVdoSWJYRnlTR3B5WWxaSlVtYxAB",
            "text": "Horrible experience with children, slow to serve, didn't make sense because they weren't very busy, both of the burgers the kids ordered were prepared wrong, the bill included gratuity and they refused to take it off.\nPaying $140 for 2 kids and an adult is outrageous with no alcohol. They charged $5 for a can of coke. Ridiculous.\nWill not be returning!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWWN6Rk9URzlmYkhwaGVsTm5PVmRsWm10RFZVRRAB",
            "text": "I’ve been here several times, both for lunch and dinner, and it never disappoints. Friendly service, tasty food, and a cozy atmosphere every time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213M1NtdDRNMGRvWlcxbWEyWndkSGRxUkdkcVFYYxAB",
            "text": "So cool place. The atention very good! Perfect service and the food is so yummy.Definitely will come back again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeFdsSlZWalJtT0dwYVRITjVhVnBwU21wcVFWRRAB",
            "text": "The service was very good. and the waiter. did his job 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd1QwcDVka2RNWDJ0SGFUQlljRGh4ZGsxSU1IYxAB",
            "text": "Not very good service for lunch on a Sunday. The food was okay but me and my partners meals were brought out probably 15 minutes apart. We also had to flag down the waiter for more water and in general did not seem a tentative. In addition a mandatory “18% service charge which is not gratuity” makes me not willing to go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTVlrNVJhM0F5VUhVelgwTjJPWFZIWTJ0WlpHYxAB",
            "text": "The experience was exactly what I needed to unwind. The staff exceptional, The taste  exquisite & the color of the Borscht was Phenomenal! I would come back again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOZlVpMUpZVVY2T0c1VVJsVklNVmxKWkhSQk1YYxAB",
            "text": "Azure is a true Brighton Beach treasure. Nestled right on the boardwalk, it offers not only stunning ocean views but also an unforgettable dining experience. The food is absolutely delicious – every dish is prepared with fresh, flavorful ingredients that make you want to savor every bite.\n\nThe service is exceptional; the staff is warm, attentive, and genuinely committed to making your visit special without ever feeling rushed. Combined with the restaurant’s chill, relaxed vibe, Azure is the perfect spot to unwind—whether you’re enjoying a sunny afternoon by the water or a cozy evening meal.\n\nHighly recommended for anyone looking for great food, great people, and great atmosphere in Brighton Beach."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U1NHWmtZbUYzV25Kd1IydHpkRU00VG5kT1lsRRAB",
            "text": "The prices are exorbitant, and the food is not worth it. We waited around 40 minutes for a drink or a dish, even though the restaurant was nearly empty. The service fee is 18%, and it’s not considered a tip — you’re expected to leave an additional tip on top of that, totaling around 40% just for service. Additionally, there’s a 3% charge if you pay by card. Terrible experience.\n\nI do not recommend this place to anyone, and I will never come back."
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadU1IaDBTR3hPUmxoS1VYcERZMGg1U2s0NVVrRRAB",
            "text": "Очень красивый вид на океане, вкусная еда"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnME9UaFZUbkZVY0VOMmMwZHRjMWgyWkhvMU1WRRAB",
            "text": "Amazing service, amazing food, amazing host and amazing atmosphere 👌 will definitely come back!"
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGd1RVeE9WR2hHYkZkSU9EUkRjV3QyZWw5aU5XYxAB",
            "text": "Очень приятно провели вечер. Очень понравилась еда , обслуживание - оперативно, быстро. Попробовали много разных блюд- все на «высоте»! Обязательно придем еще раз и порекомендуем своим друзьям!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RmRFWTVjRE0wYTBkU01ucDVNRTUzUkRKNFdtYxAB",
            "text": "Everything was absolutely great! From start to finish, the experience was smooth and enjoyable. The food was extremely delicious — every dish was full of flavor, fresh, and clearly made with care. I would highly recommend this place to anyone looking for a satisfying and memorable meal. Will definitely be coming back!"
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMFdrOUZlWFk1WTJRNU1XdDBOVTl0ZUVWaVpuYxAB",
            "text": "Единственное место возле дома куда хочется вернуться, ( хотя рядом стоят заведения) была там уже 3 раза, отличное обслуживание + хорошие цены и вкусно! Рекомендую от души❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVlNXdFRjMFJCVGxGTFRYcHROREF4WWxaaFQwRRAB",
            "text": "Today was a very sunny day and after a long morning in the beach we were ready for food and refreshing drinks. This place has it all! Views, amazing food. The lunch special is insanely good, we tried the mushroom and the cabbage soup, both were incredible! Its great to always have a taste of different cultures and I never expected to find it right by the beach. White wine was tasty and ice cold, perfect for a this kind of heat. I will definitely make this my lunch spot every time I come to enjoy the beach. Also service was kind and helpful, 10000000/10 thanks Roma and the crew 🫶🏼"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRWJrZEdXa1JuUjIwNGVIaDJaV1F4YUhNMVNXYxAB",
            "text": "We came to Azure on Brighton Beach for breakfast and had a wonderful experience! The service was excellent—attentive and warm from start to finish. I ordered the Eggs Benedict, which were delicious and came with a fresh side salad. The Bellini was a perfect addition to the meal and made breakfast feel extra special.\n\nI was here with a friend who had been to Azure before and recommended it. We had originally planned to go somewhere else, but she convinced me to come here—and I’m so glad we did!\n\nFor dessert, we shared the syrniki, which were served with fresh strawberries, whipped cream, and a delicious homemade blackcurrant jam. Everything was incredibly tasty.\n\nTo top it all off, the staff kindly offered to take some beautiful photos of us. It was a lovely morning with great food and even better service. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Wk0ySnZTREZxUmpNM05FNVhXVFZGTmtOTlMxRRAB",
            "text": "First time at a Ukrainian restaurant and it did not disappoint. I went to Brighton Beach (NYC) and got the $20 lunch special—solid deal. I had the beet soup and it was surprisingly good: filling, and comforting. The staff were super nice as well. Worth it if you’re curious to try something different by the beach"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVlVHdEpNa0V6YWxaQ2QwRldTbmMzWVRaVlNuYxAB",
            "text": "Im very picky with my food and drinks- and that place checked all the boxes and was absolutely delicious - great vibes and they have hookah too- now gotta come back for that too. Igor and Guga are amazing servers and great personalities, can’t wait to be back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMVdWUkhYMmRqWVRjM1JFSnFNM1ozTTJ0elRHYxAB",
            "text": "A huge thanks to Roman and  staff for hosting my baby shower! The food was absolutely delicious, and the service was outstanding. Everyone felt so welcomed, and the space was perfect for our celebration. Grateful for such a wonderful experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNU5VRTJiR2swZUU1U1pYRXdjRmRpUWpScGQzYxAB",
            "text": "The best thing about Azure is its location on the Boardwalk with views of the beach and an ocean breeze. It’s a 5 minute walk from the Brighton Beach subway station. Plus, they were cool with me sitting outside without a shirt.\n\nI had the burger and fries, which were affordable. They were $4 more than the hamburger deluxe at “my” diner in Manhattan, which has a great view of the traffic on 6th Ave. it was about the same quality as a diner hamburger. The big plus was the selection of beers on tap. I had a Hofbrau Haus (HB). filtered.\n\nThere was a large selection of Russian and Eastern European dishes that mostly ran in the $40-60 range for a main.\n\nServe was “leisurely,” which is good if you want to sit in the shade and enjoy the view.\n\nBEWARE of the 18% SERVICE FEE automatically added to the check. There was no mention of this on the menu. (Time to call the NYC Department of Consumer Affairs.) There’s also a small fee to use a credit card. The credit card form has a space to leave a tip in addition to the service fee. I suspect that as the majority of their clients are Russian, they aren’t accustomed to leaving tips. This 2nd generation American was glad he reviewed the check carefully."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SaGQzTnRORWczUWtoall6QmlaMjF3ZFU5SFJGRRAB",
            "text": "My friends and I had dinner at the Azure restaurant in Brighton and I was very impressed. Excellent service, the guys are very attentive and polite. They kept coming up to us and asking if everything was okay. The food was very tasty. I ordered lamb ribs and an eggplant salad. The girls ordered grilled fish and shrimp. And everything was cooked exactly the way we like it. I would like to say a few words about the cocktails 🍸. It's like a work of art. The design and taste were all right. We really liked everything we ordered. The atmosphere in the restaurant is so inviting that you don't want to leave. The live music wasn't annoying, but on the contrary, you wanted to listen to it despite the noise from the street. I highly recommend this restaurant and anyone who hasn't been there yet should definitely visit and enjoy the cuisine and atmosphere."
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKd2RFMXNWRkJHVGpVemVrMHphamhZY1cwM1NWRRAB",
            "text": "Наконец-то появилось место на бодвурке где можно и культурно уютно посидеть.\nСегодня пришли с ребятами покушать.\nЕда очень вкусная. Я пришла специально на устрицы. Они были свежие и вкусные.\nОфицианты показали хороший сервис. Тарелки быстро меняли и постоянно подходили к столику проявляя внимания.\nЗдесь хорошая атмосфера.\nТеперь одно из моих любимых мест."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TVYyeE9WSEpKVVd0Uk5tbDNka3AyZDFWdFRGRRAB",
            "text": "What a Gem right on the Board walk of the Brighton beach overlooking the ocean !! Came to sit at the outdoor lounge bar to enjoy a cold beer and  the view ! Amazing bartender Roman and Alia  werevery friendly and helpful,!!! They  let me know about the Lunch special 4 course menu only for 20$ and 1$ oysters special on a Wednesday ( what can be better then enjoying oysters overlooking the ocean !!!! And for that price!! Also they have live jazz music outside and you can also bring your own bottle  for the small cork fee !!!! This is a place to enjoy any celebrations or birthday party or just a lunch  or afternoon cold beer  and a dinner !! The atmosphere is astonishing !!!! I am definitely coming back there and this time bringing group of friends to enjoy it with me !!!!\nLong over due type of restaurant needed for the boardwalk !!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCR1JGUldaVXhGYUVocWVGQnNhMGhtTVd4amJFRRAB",
            "text": "Absolutely amazing experience! The service was impeccable—oysters served in just 5 minutes, beautifully presented. The atmosphere is vibrant yet cozy, and sitting at the bar made it even more enjoyable. Where Roma is the manager, the quality is always top-notch. I came with my foodie friend, and she was beyond impressed. Not an ad, just genuine appreciation! I’ll be telling all my friends, and we’ll definitely become regulars"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NNVNqaEthSEpoUlVsa2NHVTRSSGcxZG5WbmIyYxAB",
            "text": "Absolutely loved our dinner at Azure Restaurant! The food was delicious and beautifully presented, but what truly made the night special was the incredible service from our server, Igor. Highly recommend💙"
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GeVdpMWFOa2x1VTIxRE4zTlBSemg1TkdzMWFtYxAB",
            "text": "Зашёл просто попить чай. Спокойно. Без приключений.\nА вышло так, что на десерт мне подали… маленький шоколадный вулкан страсти, прикрытый шариком ванильного мороженого, как будто он стесняется своей вкусности. 🫣\nПока я ел — не разговаривал. Я и десерт были наедине. Даже ложка звенела как-то торжественно.\nА шоколадный рисунок на тарелке… Я сначала подумал, что это таинственное послание с другого измерения. Или от повара с чувством юмора. Похоже на зайца, супергероя или призрака на шоколадной миссии — интерпретаций больше, чем у картин Пикассо.\nНо это жираф 😅🎨🍫\nКогда мороженое начало таять — понял, что и я тоже. Где-то внутри.\nВ общем, если вы в Azure и не берёте этот десерт — вы что-то делаете не так.\nОценка: 5 звёзд, одна мята и шоколадный привет с другой планеты. 🌿👽🍨"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SFJtbG1iakV0VG5rM1lrazRTSEZIUldkeVVtYxAB",
            "text": "I had an amazing experience at Azure! The atmosphere is elegant and welcoming, with a great vibe for both a casual dinner and a special night out. The food was absolutely delicious — every dish was full of flavor and beautifully presented. The service was top-notch; the staff was friendly, attentive, and made sure everything was perfect. I highly recommend this place if you’re looking for quality food and a great dining experience in the area. I’ll definitely be coming back!"
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMFRVdHVVRmxqTVMxblRXMVZTVlI0YTA5SFdHYxAB",
            "text": "Хороший ресторан, еда вкусная и локация красивая\nСпасибо большое официантам Игорю , Мише за обслуживание ,\nОчень дружелюбные , вежливые , помогли у выборе еды и напитков\nСпасибо большое 💕"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OV1p6ZDZRMjF0VFhWRllsTkxURmN5WWpaSlNWRRAB",
            "text": "We spend a very nice evening at this restaurant celebrating a birthday ! Special thanks to Roman, Igor and a very attentive service team who took care of our table and any special requests (re: allergies, table decor, menu)! Food was delicious, amazing service, very warm atmosphere! It’s newly open, very clean, great daily and banquet menus, located right on boardwalk with ocean view and municipal parking lot around the corner.  Highly recommend this place for any occasion!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSYVJHMVJUaTA1VTJKSlRUaHhOazB0TjNsblgzYxAB",
            "text": "If you’re looking for a cozy, European-inspired dining experience with an impressive drink menu, this restaurant is definitely worth a visit. Nestled in the heart of the city, this spot effortlessly combines warm, inviting ambiance with rich flavors and perfectly crafted cocktails.\n\nThe menu offers a thoughtful selection of European dishes, each with a fresh twist that makes them stand out. We started with the greek salad and salted trout , which was light yet packed with flavor—balanced perfectly with a drizzle of sauce.For the main course, I couldn’t resist the Asado short ribs, a beautifully cooked meat, served with seasonal vegetables that were both flavorful and fresh. It’s clear they pay attention to sourcing their ingredients carefully.\n\nThe service was attentive and friendly, with staff offering great suggestions without being overbearing. The atmosphere strikes a balance between relaxed and sophisticated, making it a great spot for both casual dinners and special occasions.\n\nIn a nutshell, Azure delivers a charming European experience with outstanding food, drinks, and service. Highly recommend it for anyone craving something a little different yet refined. Can’t wait to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcE5IcElaamxIZG1KblJXUlZWbEZwV2pFMk9WRRAB",
            "text": "Came to Azure to catch up with some friends and honestly had such a great time. The vibe was super nice, not too loud, just perfect for talking and hanging out. The food was really good and the staff were so kind and chill. Definitely one of those places you leave feeling happy and full. Would come back for sure!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPSEJ2NnJaNnA2YVV3EAE",
            "text": "I live nearby and now I come here every day to this place that I fell in love with, where the food is excellent, the service is great and you feel comfortable"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205YVNtNUVZMnR1UVZSdVJtZzNXSHAzV1cxaGVVRRAB",
            "text": "Atmosphere is nice but service is horrible. Waited for the second main dish for 50 minutes... asked the waiter 3 times and he said it was \"cooking\". Not even that busy and when he realized after asking the fourth time and 50 minutes that something is off ,  he finally went to the kitchen to ask (they \"forgot\". Need to better their service"
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOT1U3SkNyX2NTTW93RRAB",
            "text": "Отличный ресторан,очень приветливый и заботливый персонал,очень вкусная еда,получили гастрономическое удовольствие от еды,очень атмосферно и дружелюбно,с удовольствием вернемся ещё раз"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsa2JqZ3laemx0Y0UxclpqUlNOMnBSVlVZMlQxRRAB",
            "text": "Beautifully located restaurant with interesting food on the waterfront. Sadly the service was fine. Sadly the experience was tarnished by obnoxious and loud reggaeton music that did not fit the setting. Salad portions were too small. An original horseradish and beet mix was exceptionally good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnemVVVXlabkJVVGtSMlYyWmxha1pvT0hodVpXYxAB",
            "text": "Recently visited this establishment. Service is amazing, special thanks to Michael and Ihor. Food is unique and tasty. Definitely would recommend to visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaFYwTjBZMnBqU0dabVZXbzFiVkZGU0dWMk1HYxAB",
            "text": "Nice place, food was good and service was very attentive. We celebrated my sister's half marathon here and they even gave us a round of free drinks! Would come again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRU4wUjBTSGxHY1hSTlZHSjNTa0ZOVTBoM1dYYxAB",
            "text": "Highly recommended, the best syrnyki in town.\nPeaceful view and so nice coffee 🫠"
        }
    ],
    "reviews_count": 69
}