{
    "name": "Breva",
    "place_id": "ChIJK3nUPsBFwokRqZf1xtqZtf4",
    "grid": "BK13",
    "address": "3145 Brighton 4th St, Brooklyn, NY 11235, USA",
    "rating": 4.7,
    "user_ratings_total": 312,
    "phone_number": "(929) 470-4133",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taellsVkRRMnBwVXpCS1p6RmhNSGRMVkdST1FsRRAB",
            "text": "We had a fabulous time having brunch at Breva to celebrate my mother's birthday. Oleg was the best! Shout out to the eggplant appetizer with the fluffiest pita bread, the tasty potato dumplings, and the wonderful view. We can't wait to go back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdFlqZDJaSEZOU1doclJEQnZhek50UW1oUVdVRRAB",
            "text": "What a gem on the boardwalk! Come here for the views and ambiance, stay for the food and service.\nWe visited on a late October Sunday for afternoon \"brunch\" and were delighted by the fresh Caesar salad, delicious egg plates (mushroom omelet, avocado toast) and well balanced white wines that we chose (an Albarigno and a Chenin Blanc).\nLooking forward to coming back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205d2QwaHdlbWx2UTB3MVRVaGFlR3AxVVZoSVNIYxAB",
            "text": "The service is good, and the staff are polite. The cocktails are tasty — really enjoyed them. But the food was disappointing: the pizza is too thick, the dishes are not flavorful, and definitely not worth the money. Everything looks nice, but in reality, it doesn’t taste good."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VGJHTjZiSEF5TW5ocExUUmpWRlJwVkhOcWMzYxAB",
            "text": "The food is overpriced and ridiculous.  I don't recommend it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWFdsOTJiVEo1YTI1TFVtSlRhVU5UTVU1c2FrRRAB",
            "text": "Only one waiter was serving. She was in bad mood and acted like she was doing me a favour. I asked for a club soda and she brought a bottle but never even gave me a bottle opener! Has to use my own. Never gsme me a cup. I asked for plates and sh gave them to me but acted like she was doing me a huge favor."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xndFpuZFhRMmhNTVZoc1V6ZDNNRFJhTUdoamExRRAB",
            "text": "Nice place and location but the service and the food are just average"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205U1lUUmpka3BHWDFVMGJqZHlaVzlyTURaUmFGRRAB",
            "text": "The food here is WAY overpriced for the quality."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMFRFOVJUVEJFUXpOYWJYbHlhV2d0V2xOS1YzYxAB",
            "text": "New discovery in our neighborhood and we LOVED it! Feed was fantastic. Atmosphere was relaxing and comfortable. Service was outstanding. We will definitely come back often!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OamFrWnFWV1J3ZERKd2JWaEhSRGQyWVcxalkxRRAB",
            "text": "We had such a lovely time with the girls! The atmosphere was warm and welcoming, the service was impeccable, and our server was particularly kind and pleasant. The dessert for our birthday was absolutely delicious! Thank you for making this such a wonderful experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JdE5reFJXV001VDNOc1prdEJkR2R4WVRaRVkzYxAB",
            "text": "When Breva first opened (not too long ago)their food was EXCELLENT. Their burgers were great. Their tuna salad had fresh grilled juicy red tuna. Recently they changed their menu for worse. We dont know if they changed chefs?\nSuch a beautiful restaurant. They need ro step up their menue and their SEASONING."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRlpqaFNTbEpvT1dodlJtdDBXbTF2ZW5Cb2NXYxAB",
            "text": "Came on August 10th and there was a wonderful jazz band playing. Great food, great music and guitarist, and reasonable prices. Excellent atmosphere and friendly staff.. I hope to come back soon to hear the band again. This is a wonderful addition to the brighton beach boardwalk!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rM1ZFbE9VaTFqY3pjMllXZERPV04zV1RBMllWRRAB",
            "text": "Went to this place twice, about a month ago and last week. Ordered multiple different things to get an idea of the food.\n\nFirst time, I had a double cheeseburger which was delicious, fish and chips which had unsalted fish, but fried well. definitely needs seasoning, a pizza which had really thick dough, so I didn't like it, even though the flavor was good. The fries that come with the burger and fish is very boring and bland. For $30 a meal they could put parmesan fries which they have as a side dish. The fries taste like supermarket frozen fries. Also got the potato dumplings which were delicious. The staff were friendly, and food came out quickly.\n\nSecond time I went it was like an entirely different place. I got the double cheeseburger again, but the bun was different. It didn't have any sesame seeds, and was flat and stale. The cheeseburger only had 1 patty, so I got ripped off there in what is supposed to be a double cheeseburger. On top of that I ordered it medium well and it was nearly rare. The crispy calamari were a bit overcooked but not too bad. I got the charred eggplant which had tahini in it and it doesn't say that on the menu at all. I hate tahini so I couldn't eat it. Awful. Did the chef get fired in the last month since I went?\n\nA friend of mine called them to order takeout once and they said you have to use their online ordering service, but that service has each dish listed at 6-8% higher than the regular menu. I have never seen a restaurant not offer takeout by phone in 2025. They said if you don't want to use the online ordering, you can come in and order in person and then wait for your food to be made, which defeats the whole point of ordering ahead of time. Like, how is ordering by phone any different than ordering in person? Write my order down on a piece of paper and make it. I'll pay when I come in.\n\nAnyway, this place isn't for takeout unless you want to overpay, and the food was much worse the second time I dined there compared to the first."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aelpGTXpUSFpIUjNaM1ZFaFZjSFl5TkV3dGQyYxAB",
            "text": "Beautiful spot right on the boardwalk with an ocean view. Really wonderful vibes, service was attentive and the martinis we had were quality. I had high expectations for the food. I ordered the brick chicken with Brussels sprouts and…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kb1RrTnVNbm95ZUd4TFJHWXdjVkY2ZEc1bmMzYxAB",
            "text": "Everything was perfect from the food to the service. In particular the General Manager Medelin was so outstanding. She is a gem!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTk1VUjZhbTVGY0doYVVXeG1UbEpRY2sxU1lVRRAB",
            "text": "I was excited to try this new boardwalk restaurant, especially since I live nearby. The scenery was lovely, and I appreciated the blankets they offered and the cozy indoor seating. My friend and I shared the crispy salmon rice, but it lacked flavor and the rice was rock hard – not worth $16. My friend enjoyed the juicy cheeseburger, but we both found it too salty. I ordered the lamb and beef skewer, but the grain served with it was inedible, reminding me of public school lunch. The white sauce (which appeared to be tzatziki) with bread was a highlight, though. Overall, the food quality didn't match the price, so I likely won't return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeWJFVk5XSGRXZFRCbVdtaGpZbVpPTVhwR2JrRRAB",
            "text": "I stopped here with friends for dinner on a Sunday after a long day at the beach. The location on the boardwalk and the ocean breeze are phenomenal for outdoor dining and people-watching during your meal.\n\nWe had quite a seafood buffet during our dinner. We ordered fish and chips, calamari, oysters, octopus salad, and pan-seared salmon. The fish and chips were fried to perfection and I thought they were delicious, even as someone who is not particularly fond of cod or white fish. The breading on the fried calamari was unique and added a nice twist to a favorite dish. The salmon was a little bland/under-seasoned but was perfectly cooked, nicely garnished, and served with a yummy brown butter vinaigrette. The octopus salad was definitely my favorite, it had really balanced flavors and the octopus itself was cooked well.\n\nAlthough our server was friendly, our only negative takeaway here was the poor quality of service. We sat for 20+ minutes before anyone came to take our order, and our entrées were brought out before appetizers or even cocktails were served.\n\nOverall, a great way to end a beach day. Would definitely come again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNFdVNVFUamxGZWxKU2JGSktXa2hSUTBKNFVHYxAB",
            "text": "Good-quality drinks and tasty pizza at Breva. Service was friendly, though the Old Fashioned would’ve been better with a large ice cube. Surprisingly quiet for a Friday night. 20% tip is added automatically, guess cause there was a party of 6.  Hope they stick around—worth a visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZeVFqYzVlSEZFY2tSc1JrWk5jbmhIZEZObk1tYxAB",
            "text": "We were seated inside at afternoon on a hot summer day. There were not many people in, everybody wanted to be out on a boardwalk. There was a  beautiful jazz trio performing,  The food and service were impeccable. That was the best day...."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oR2JsbElTR1F5YzJsZmVtVkVNRVZZUmpGc1VuYxAB",
            "text": "Our server Gaby was so warm and attentive! Our dishes were so delicious 😋! If you’re in Brighton Beach definitely this is your spot! The cocktails were well balanced, one of the best I have tried in NYC so far! Definitely coming back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCU2NtUkxURVk1Y25WRFZHRk9Zekp1YjFCWGIzYxAB",
            "text": "This morning, our family celebrated our grandson's first birthday at Breva on Brighton Beach, and it was a wonderful experience.\n\nThe service and food were excellent. Our waiter never hesitated to go an extra mile to please us, even bringing warm blankets for those who felt slightly cold because of the great AC.\n\nBut the most surprisingly astonishing part was the music. The jazz trio – contrabass, guitar, and vocal – was beyond our best expectations. The musicians played great, and the singer was truly world-class jazz. She had an amazing, jazzy voice, with tasteful personal arrangements of each standard piece, and an intelligent performance. A beautiful person overall! We'll definitely try to book a table when they play again.\n\nThank you, Breva, for a memorable celebration!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRll6SkZWSFJ4YTI1Rk1HZFRjbGxoUkRBeVZuYxAB",
            "text": "We walked in here randomly on Sat 8/2/25 at 1pm-ish, just looking for something to eat. We did not expect the food to be SO incredible! We had pizza, salmon, sea bass, potato dumplings and ahi tuna tartar -everything was PERFECTION. Service was a little slow, but understandably, because they were super busy. Drinks were cute and delicious too!\nWe also want to point out that the busser/runner, a young man with an irish accent, went above and beyond, worked so hard and was very polite and nice. He really made the whole experience extra special. We will definitely come back and highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQ05FVlNTRjg0ZVVRMFlWUjRkV3hSVkROYVNGRRAB",
            "text": "Place itself was beautiful. Really nice bar. Service was great. Everyone who served out table was attentive, nice and super friendly. The cocktails were delicious. The food was a let down. No one in my party enjoyed their food. It was bland, presentation was lacking and the burger was not edible with soggy bread. To their credit, the restaurant changed one order and gave us free drinks. But I wish the food matched the drinks."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWVYwZFFXRTh6V1ZobVRGZ3ROMnN4V2xwMk1rRRAB",
            "text": "Favorite neighborhood spot! Have been here several times in the last couple months and each time, the food has been delicious and service has been good too/staff is attentive. Not pictured but the lamb and beef skewer is amazing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RM2VFVkxWamt0Y1V4cFZFZHlXVVV0VjJveVRHYxAB",
            "text": "Delicious deserts and cocktails"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMGIyZFBhMDUwY1dwMVZUUTRVV1pPVWxkNlZYYxAB",
            "text": "Everything was great except for food portions, they have to do something with that. Otherwise no one will come back there again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oR1gzcG1jMGxZT1cxR01YYzFSRWxhZUZoSlFYYxAB",
            "text": "New spot on the Brighton side of the Coney Island Boardwalk with a lovely atmosphere and ambience. Awesome drinks, good food, great service and prices! Will definitely return."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSFVGVnZiWGxmYUVrM1MyMVpSbFZhTW5KdWEzYxAB",
            "text": "Can honestly say the food here is delicious, Service is very good. Excellent vibe on the beach. They usually have live music. Really love this place. Glad I came here today. Will come back.A+ ThoseA+"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNFkzSkpjMHBvWm05b0xVRjZWMWRTZFZsaVVWRRAB",
            "text": "Breva Café is such a great addition to the Coney Island/Brighton Beach boardwalk! The vibe is super chill, think European bistro meets seaside escape. There’s a refreshing breeze off the water, and the light, airy decor makes it feel even more relaxing.\n\nI tried the shrimp cocktail, which was really tasty. The menu says it comes with a smoked vodka cocktail sauce, but I didn’t catch much smokiness or vodka flavor. Still, it was very good. I also had the shoestring fries; they were fine, but let’s be honest, how amazing can shoestring fries really be...\n\nThe drinks were a highlight. The bar crew was constantly slinging drinks the entire time I was there. The hibiscus margarita was super yummy, and the sweet-sour salt on the rim really brought it all together. The espresso martini was fully shaken and very good.\n\nDefinitely a great stop whether you're heading to the beach or just strolling the boardwalk."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TGJHUkJTakJ3UlhWRGJESjZTbFpDWW5KTFkxRRAB",
            "text": "We came for the jazz brunch! Beautiful setting on the boardwalk. The food and drinks were wonderful. Lemon ricotta pancakes, BEC Sandwich was excellent! Poached eggs were great. Service was impeccable. Everything was lovely. All the best finishing touches in this very pretty space.  Bar is really beautiful. We loved the music, and my kid drew their portrait. Can’t wait to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNmRGbEVXRzFGWDAwMmVreHRRazlSU3pBMmEwRRAB",
            "text": "It was awesome experience  with food, drinks, stuff, and music. Definitely will be back for more! Thank you for this new place to come!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNFFVaFZVRU54WmxsaWVUVnlNMDh5YTJkZlduYxAB",
            "text": "Horrible place. We waited about 40  minutes for drinks. The waitstaff were rude and appeared dismissive toward us."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVlkwOXJURkJHZW5vemFsbFVVVFpTYlcxaU1IYxAB",
            "text": "Lydia was amazing!!! Food, drinks, and looking at the beach was fabulous. Would come back here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rd2NsOXhOWEZUUmkwdE1IWlRWbGRPTFdwUWNXYxAB",
            "text": "Great new place on the boardwalk. Came here for an evening birthday dinner, and tried out their jazz brunch (12-4pm on sunday). I recommend the hibiscus margarita and Steak frites. both are very yummy. Their drink menus are SO CUTE. The staff was kind enough to also comp the pavlova dessert during the birthday dinner celebration. The eggs benedict under the brunch menu was SOOOO delicious but it was a small portion, could have used more potatoes. The lemon ricotta pancakes are also yummy but the lemon sauce was way too sweet. Could use more ricotta. The iced coffee they have is delicious. I am definitely coming back here. The staff is so kind and the service is always great !!!! And the overall ambiance of the place is great, decorated so nicely and it’s so clean."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wdFdtOTVYMEpwT1dGcVpUWnhNV0p3Y2xWWFgyYxAB",
            "text": "It was amazing experience. Very happy with food. The service was extremely good provider by Oleg"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VWRHMUtRMHR0WlhrdFdXd3hTR1ZTVjJ4blEyYxAB",
            "text": "We had a fantastic experience at Breva in Brighton Beach! The atmosphere was vibrant yet relaxed, perfect for a summer evening. Our server Gaby was absolutely amazing—attentive, kind, and really made us feel welcome. We started with the shrimp cocktail and tuna tartare, and both dishes were super fresh and flavorful. Highly recommend this spot if you’re in the area—great food, great service, and a beautiful setting!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMloweG9RalJJTVZaWlZHbFFOR3BIZVdGM1JVRRAB",
            "text": "Great experience. Amazing food and drinks. Great service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Zk9VbFFVRTR6YVdZdFYxVk1UbnBMVWpSdWIyYxAB",
            "text": "A beautiful spot on the boardwalk, highly recommend! We had great service from Oleg and will definitely be back to enjoy the elegant atmosphere, great drinks and delicious food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRFoxSjBRekpIWjJwWGMydzNjbDkzVlhOeGMxRRAB",
            "text": "Super friendly staff, lovely atmosphere, delicious food. Loved that vegan options were available. Our server was exceptional, unfortunately don’t remember her name. But can’t say the same about our bus boy. He was very slow and she had to…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMk5uSnVkMHhtUWxOUmRVWldTSE5PWlRsNGJsRRAB",
            "text": "I am thoroughly impressed with this new restaurant. That is an extremely welcome addition to the Brighton Beach Coney Island community. They did a great job improving the inside of the restaurant as this used to be a rundown restaurant called Cafe Volna. The interior can be in Paris or Manhattan. It really is gorgeous. They're very accommodating have excellent food and a large space. Outdoor dining is prime and even inside is lovely. Make sure to sit by the window in the back so you get an ocean view. Really enjoyed the oysters, double cheeseburger and grapefruit juice. The service is excellent and Oleg, our waiter was attentive, warm & did a great job. Bravo, Breva. I wish you all the best & success that you deserve!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbUlUQVlREAE",
            "text": "Fantastic Find!\nGreat Quality food\nSuperb service!\nWe will be back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4M2FWQmZOa1U0YjFoU2VYazBkVU5UVDBGWWEzYxAB",
            "text": "Our Server Gabby was super attentive, kind, and friendly! Manager Madalyn always made sure we were okay. My partner and I had 6 cocktails and they were strong and delicious! A storm hit the restaurant randomly, we sheltered inside and the staff ensured everyone was safe and happy. Towards the end we received this lovely hand written note and free bags of granola! This place was lovely! Highly recommend! The cheese cake was phenomenal! Absolutely delicious, tuna tartare was also perfect. We will be coming back soon!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xalRUbHBaREp3T0hFeGRrNUVOVGN5VmpSUVlXYxAB",
            "text": "Nice birthday celebration , very good business attitude .\nGreat staff and delicious food .\n\nWe are coming for each birthday here\n\nI was a birthday person and did not pay."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4U1JVMWtSR2xmTUdGV2QwRjRUa05XTjJWME1WRRAB",
            "text": "Mickey was very attentive,  great service , good food and drinks, amazing view of the sunset and the beach."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOE9EaDB3RRAB",
            "text": "The food is unbelievable, this is coming from someone that has the utmost experience in all high end restaurant, the service so professional so attentive. I wish I can duplicate it we will be back again and again.\nThe Albanian manager was so nice to us we really felt welcomed and appreciated 😊"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdFRHZzBNVVJFY21wWVJXdzJOV1JYZDNCalRIYxAB",
            "text": "At long last there is a beautiful spot on the boardwalk with artisanal cocktails, impeccable service and live music! Can’t wait to be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMVptcFFlakJGTWtORVJISm5SamhuYlU1bGJGRRAB",
            "text": "… took my Dad out for Father’s Day. Elegant and confident interior paired with a solid menu. Definitely a breath of fresh air for this corner of Brooklyn. Not an easy neighborhood to win over with residents set in their ways but I think ‘Breva’ has a good shot. We split the Burrata, Crispy Rice, Burger, Sea Bass, and the Chocolate Caramel Pie.\n\nGabby was our server and she was super pleasant, polite, professional, and engaging. Highly recommended. Best of luck."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZngzNkNHanFUZm9nRRAB",
            "text": "So long time in this area no American places and here we go! Food and drinks are good! View to the beach is amazing and place inside looks good. Restrooms are clean. Service is fast and everyone is friendly. Also good live hulas music! So I recommend to go here if you’re in this area! Thank you to manager Marika! ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaFpMTDlRRRAB",
            "text": "New spacious place . The location is amazing, looking over the boardwalk.\nThe service was great, our waiter was very helpful, super nice and friendly. I might mistaken, but I think her name is Tamara ( at least that’s what the Thank you card saiid ).\n\nSo as for the food, I wish the menu had more choices , especially for the meat choices.\nAnd few things we wanted to order were not available, the asparagus was not available, the Sunday was not available, and that’s We ordered steak, medium rare, unfortunately was not tasty. And the French fries seemed to be from the package , not freshly made The Brussels sprouts were good., the drinks were good, and the cake was good as well.\nSo overall not impressed"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMT1dvTUhOd2RyREd3EAE",
            "text": "A truly unforgettable experience! From the moment we walked in, we were greeted with warm smiles and the most stunning ocean views. The food was absolutely delicious – atmosphere was really good, food was really awesome we tried tuna tartar and crispy salmon it was super delicious . The service was impeccable. Our waiter, The whole atmosphere was so relaxed and inviting. This restaurant has captured the essence of a perfect beachside dining experience, They also have very good options for cocktails and wine . I can't wait to come back! Highly recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX3JuUlR3EAE",
            "text": "The restaurant has a beautiful interior and the food was great. I would rate the service 4 out of 5. However, I was very disappointed to be charged $30 for a bottle of water that costs only $3 at Trader Joe’s. This feels dishonest and ruined what could have been a wonderful experience. I truly expected better from a place of this level."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOTGVtZURpb1lQaTJBRRAB",
            "text": "I want to share my experience of going to this establishment. I and a group of friends decided to go in for dinner and have a couple of cocktails. At the entrance, a girl met us and said that all the tables were registered, but there were many free tables in the hall and that they would not seat us, then we wanted to sit at the bar, but we were also refused seating at the bar because we did not make a reservation at the bar - what nonsense. We asked the manager to clarify and they seated us at the bar. Then we each ordered a hot dish and drinks and continued dinner. We discussed the situation several times and then we were denied service because we were talking to each other. We called the manager (yaks), but he also asked us to leave the establishment. We paid the bill without any problems and a 20% tip. Also, a 4-5 year old child was sitting next to us at the bar in a drinking establishment without parents, neither the manager nor the waiters attached any importance to this event. In general, there are no complaints about the food and drinks, but complaints about the unqualified staff, in particular the manager Yakov and the hostess who is not competent in her job. So before going to this establishment, think carefully, you may be denied service. In general, the establishment is new and the Brighton rules are still the same."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPek8zSWlLeDVIVHRRRRAB",
            "text": "I had such a wonderful experience at this restaurant! From the moment I arrived, everything felt perfect. The food was absolutely delicious — every bite was full of flavor and so well prepared. But what truly made the evening special was the service.\n\nOur waiter, Oleg, was incredibly kind, attentive, and just the sweetest! He understood exactly what we needed and made us feel genuinely cared for throughout the entire meal.\n\nThere was also live music, which created such a beautiful and warm atmosphere. I left with a happy heart and a full stomach. Definitely one of the best dining experiences I’ve ever had. Highly recommended!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdWJYN3BRRRAB",
            "text": "We went for brunch, had cocktails, appetizers,  salad, burger and breakfast sandwich and it was all delicious. The service was wonderful and the atmosphere was good. They said come summer they’ll have music Friday and Sundays which will be nice with their outdoor seating. We’ll be back again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNDc2ZmF3EAE",
            "text": "Located right on the Brighton Beach boardwalk, surrounded by a predominantly Russian-speaking community, this restaurant feels like a true standout—almost like a black sheep in the best possible way.\nThere were four of us, and we made a reservation just to be safe. Upon arrival, we were greeted warmly and seated right away. I’ve always loved the crisp, fresh vibe of a new restaurant, and this place didn’t disappoint. While I know new establishments often go through a learning phase, I’m happy to say this one already feels well on its way. The simplicity and warmth of the décor, paired with thoughtful attention to detail, made the atmosphere incredibly inviting—we loved it.\n\nNow, let’s talk about the food and drinks. The cocktail and wine options were fantastic, and our entire party was fully satisfied. The food menu looked so appetizing, and it delivered on all its promises. We started with the caviar tots, burrata, and harvest salad as appetizers—all absolute winners, 10/10.\n\nFor the mains, we shared the grilled skewer, the steak & frites and the wild mushroom tagliatelle. Both were exceptional, bursting with flavor and perfectly prepared. Of course, no meal is complete without dessert, and the pavlova and salted caramel chocolate cake were the perfect ending—playful, rich, and utterly delicious.\n\nWe enjoyed our dinner so much that we booked a brunch reservation on the spot! When we returned for brunch, the experience was just as wonderful. Between the two types of Bloody Marys, the breakfast sandwich, and the burgers, everything was flawless (another 10/10!). This time, we tried the cheesecake, which I highly recommend. It’s a hearty portion with a meltingly smooth texture and a delightful touch of pistachios—absolutely divine.\n\nThis restaurant is a true gem, and I can’t wait to return. If you’re looking for a spot that delivers on both quality and atmosphere, this is it. Let’s support places like this so they can keep shining!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfamFmelVnEAE",
            "text": "We went to Breva for dinner, it has a quaint ambience, views of the ocean.  Food was delicious from appetizers, to main dish, and of course dessert (cheesecake and chocolate caramel cake a must).  Staff is very attentive and service was great!  Would highly recommend this gem in south Brooklyn!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJMi03b25hbmFTT0JBEAE",
            "text": "Everything was excellent. The ambiance and food were top notch. Our server Azmat, was very attentive and hospitable. We ever received a complimentary drink from the bar. Will continue to frequent this establishment for years to come."
        },
        {
            "date": "5달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKMjN3TmJRbm9ISDVnRRAB",
            "text": "Утром заглянула в ресторан Breva — давно хотела попробовать их кухню.\nСалат Буррата оказался выше всяких ожиданий, особенно в паре с бокалом белого вина — идеальное утро!\nАтмосфера уютная и спокойная, с шикарным видом на океан.\nОтдельный плюс — вежливый персонал и безупречный сервис.\nЕсли хочется начать день вкусно и красиво — это точно то место!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQbm16TzJ6cHJuR0N3EAE",
            "text": "This Location Used To Be Tatiana Grill But Unfortunately The Restaurant Permanently Closed But For Something Bigger, Better & Beautiful To ReOpen. Breva ! My Fiancée & I Truly Enjoyed Breva ! We Had A Wonderful Experience! & An Amazing Albanian Host That Seated Us & Kindly Explain The Menu To Us.\nThe Cocktail Menu has So Many Great Choices !The Apps & Main Dishes Were lovely 🍽️! The Atmosphere & View Is 🔥. Nothing Beats Fine Dining Next To The Beach With Your Family, Friends & A Beautiful View ☀️🌊😻👍"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdDRyekxBEAE",
            "text": "Breva stands out as a truly special destination on the Brighton Beach boardwalk. With its elegant yet cozy interior, immaculate cleanliness, and breathtaking ocean views, it offers an atmosphere unlike any other in the area. The staff is friendly and attentive, making the experience even more enjoyable.\nThe food is exceptional. The salmon I ordered was perfectly cooked—tender, flavorful, and paired with a rich sauce and cauliflower that elevated the dish. It was easily one of the best I’ve ever had. The  salad was fresh and vibrant, with the playful addition of a Neapolitan ice cream topping leaving a sweet, memorable finish.\nBreva is more than just a restaurant—it’s an experience. It brings sophistication and creativity to the boardwalk, and I can’t wait to return. A must-visit for locals and visitors alike!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPaXRnSWVPbHU2R2hnRRAB",
            "text": "New place. Absolutely disgusting greeting of visitors. At the entrance they evaluate with a glance. When they lead you into the hall, they do you a favor. On the positive side - a rather hospitable bar. The hostess is unprofessional. At the same time, the administration ignores the situation when children under 10 are sitting at the bar. The wait for the manager is more than 40 minutes. The manager is extremely unprofessional."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnME5IQ2VnEAE",
            "text": "Beautiful quiet ambiance with amazing service right next to the beach! Of the small plates we tried, the potato dumplings were a standout—so tender and delicious. Also loved the tuna tartare with housemade chips, colossal shrimp cocktail and crispy salmon rice. The salmon entree was BEAUTIFUL and delicious. Desserts are generously sized—loved the pavlova with strawberry and basil. I think they have 78 vodkas available so def get a martini if that’s your speed!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQMnkyZTdvczhfNDl3RRAB",
            "text": "Love this place, very nice location, great atmosphere, love the music they play in the background, amazing cocktails and fantastic bartenders!! Excellent food and great service ! Food is very yummy, fresh, great presentation and perfect taste. Every single restaurant around Brighton Beach is Russian but this one is NOT and I love that!! Very modern but classy, cuisine, music, interior and bar ! Love the marble tables and counters ! Clean and inviting!Great Ambiente !!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXB2YVp3EAE",
            "text": "Amazing food and not very expensive.Excellent location right on the boardwalk! The staff was super friendly. We even met the chef who talked about his best dishes! Will definitely keep coming back to this place!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdHAzYzJ3RRAB",
            "text": "Breva is a very nice spot on the Brighton Beach boardwalk. The space is modern, with high quality finishes and a pleasant atmosphere. The staff is friendly and attentive. The food was excellent. We had brunch this time and will be back for dinner soon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcy1HTmV3EAE",
            "text": "Delicious home made food. Great service. Light music in the background is nice and comfortable. We will be back soon again. Highly recommended."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPX2h1cmZvakpMSGRnEAE",
            "text": "Despite the bad weather, I decided to take a walk along the boardwalk and stopped by Breva.\nI took a seat at the bar and was pleasantly surprised by the warm hospitality of the bartender, Nick! He helped me choose my meal and recommended a wonderful wine, describing all its qualities in detail.\n\nI had the Rigatoni Bolognese, and paired with a glass of Château Lescalle red wine, it was absolutely outstanding.\nExcellent wine — I highly recommend it! And the view from the window made the experience even better.\n\nI’ll definitely be back — and I’ll tell all my friends about this place!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbUpQM3JnRRAB",
            "text": "Breva is a breath of fresh air in this neighborhood. Not only is the food outstanding, the hospitality is also top tier. Thank you to the chef, cocktail master Todd, Caylin, Martina, and the rest of the FoH staff. Everyone is absolutely lovely. You have a customer for life. Look forward to the summer months and outdoor dining"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcXBLeld3EAE",
            "text": "Absolutely loved my intro into the lovely restaurant Breva. Upon entry I was immediately greeted with warm smiles and seating. The interior is lovely with elegant furniture and natural lighting. Their menu is very diverse and filled with color which I love. I tried the black angus beef burger which came perfectly sizzled and properly seasoned. My waitress Paola made sure I felt at ease, cared for and I even had a wonderful conversation about the entire establishment. The cherry on top was Marita the manager serving pavlova on the house. It was delicious! I recommend everyone runs not walk to Breva."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dzhpN0pnEAE",
            "text": "Amazing Service from Nick!\n\nWe had an incredible experience thanks to Nick, our bartender. He went above and beyond to make sure we had a great time, even crafting a drink for us that wasn’t on the menu! His creativity, attention to detail, and friendly attitude made this visit even more special. If you’re looking for top-notch service and a bartender who truly cares about his guests, Nick is the one to see. We’ll definitely be coming back!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeWZtSW5RRRAB",
            "text": "I often visit this place after work, and I’m always satisfied. Bartender Nick is a true professional, making amazing cocktails and always pleasant to talk to. He’s attentive, creates a great atmosphere, and turns out he’s also a doctor, which makes for some interesting conversations. Waiter Oleg is a real gem of the place. He knows not only the menu but also everyone in the area. His attention to detail and ability to create a comfortable atmosphere make this spot stand out."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bWJyckJREAE",
            "text": "Very impressed by this place! Perfect location, parking is right there, amazing views of the ocean, atmospheric ambience, everything super clean, the food was amazing as well! We are coming back this week for a bday celebration! Cannot wait! Thank you guys for creating this place!\nP.S the dessert (chocolate caramel cake) was out of this world!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aUxUaXd3RRAB",
            "text": "The Grilled Skewer was extraordinary with the wild rice, vinaigrette and tzatziki. The Pavlova was very good as well! The atmosphere and music made the experience even more enjoyable."
        }
    ],
    "reviews_count": 72
}