{
    "name": "Georgian House",
    "place_id": "ChIJfaYuGkdEwokRyG1Po9H2-R8",
    "grid": "BK13",
    "address": "129 Brighton 1st St, Brooklyn, NY 11235, USA",
    "rating": 4.4,
    "user_ratings_total": 630,
    "phone_number": "(718) 759-6555",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcGMwUldNVmxpUm0wdFlsbE5UbFF4VDA1cmRHYxAB",
            "text": "Amazing food,"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ad2NrRkZaa2RsT0VFdFQxVnRVMUZFYVV0WVdtYxAB",
            "text": "Excellent!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNlNXeDNkSHBvZGpOcU9UZDVValJMUm1sZk1VRRAB",
            "text": "I think this was by far my favorite Georgian restaurant I have been to yet! Came here with a Georgian friend of mine and he ordered a few things that were all absolutely delicious.  The khachapuri was HUGE! Beautiful restaurant inside too. It looks like they have live music some nights. Ambiance was 10/10. Parking can be tricky but we lucked out and a spot opened up across the street."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbU4xOTFlRVJCTmpsdFdrbFBYemR4VTAxMGRGRRAB",
            "text": "not really good treat with customers, the woman with the black hair on the front desk didnt allowed us to take a seat after the order was dismissed on Uber by their fault and i paid full amount for khinkali and ajaruli and the tables was free to seat but she said no you taking food away so go away, its completely shock and worst client-orientation act, since that day i didnt go there. In addition there is alcohol abuse customers when we went there before this situation we had a conflicts between guests who drinked alcohol"
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaGVsUXpWRzB3TkhGa1RFMHdWV3BVUm0weVIwRRAB",
            "text": "Приехал сюда из-за того, что было в меню вино фирмы MARANI. В итоге оно нашлось, но выбор невелик. Тем не менее, еда превосходная, обслуживание выше похвал, поистине грузинское гостеприимство! Молодцы"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQ01Fa3RhSEpNU2taNmFWSmFWa3RGT0ZBeVgwRRAB",
            "text": "OMG! The food is fantastic!!!! Love it from the first taste!!!! 💛💛💛"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVM1NVMXpTM2h1VUdSbWJVVmhNbG93VG1reVNtYxAB",
            "text": "The food was delicious and good. I had a great time there. There were great shareable options, so we could try everything. The portions looked good too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGb1ptMU1SR2RNZG5Kd1ZuRTVjbmhJUWt4WlkzYxAB",
            "text": "Good atmosphere...\nBest service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUE5GZEpPV3hqY25aZlVGSlZOVEF4VDNWdlFrRRAB",
            "text": "Good food I recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kM1pqVlZhMVZsY2sxa01WQnpZamxsZVVvME5WRRAB",
            "text": "There’s one of many Georgian 🇬🇪 restaurants that features delicious food and plays live music on weekends."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSVZVdGFha052TlhnelRFdDVVRTVwYVVsR1IwRRAB",
            "text": "Worst place I’ve ever walked into.\nI came in alone, just wanted to have a quick meal, and the attitude I got was disgusting. While I was literally just looking at the menu, some black-haired woman behind the counter rolled her eyes at me like I was a problem. Super rude.\n\nThen when I said I’d like to sit and eat, they told me it was fully booked which was a straight-up lie. There were empty tables all around. The real reason? I was a woman on my own. The whole place was filled with men, and it was painfully obvious that the waitresses were only interested in flirting with them and didn’t want any other women around.\n\nI even said I could sit at the bar and eat fast, but they clearly didn’t want me there. Rude, cold, unwelcoming  just awful vibes all around.\n\nDon’t waste your time or your money here. Especially if you’re a woman. They treat you like trash."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTFdEaFZlbFJUWWtaWk1ucHBlVlZsWTJKR2VFRRAB",
            "text": "❤️love it with live music 🎶"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNVpWcHhUM016WW5GbU1FVnJhVmQ1UTJocVlVRRAB",
            "text": "Excellent food and atmosfere!\nStaff was friendly and all the other patrons were clearly having a great time!\nMe and my wife were probably the only not Georgian people there and the people working took their time to explain us what the different dishes were.\nMusic was great as well!\nWe’ll 100% be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bGFEQkZXR1ZIVlUwd00zZFlNR2hQZG1wWFVrRRAB",
            "text": "The worst Georgian Khinkali ever"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPeW9ob2VNNVBySC1nRRAB",
            "text": "Rude waiters. Pretend like you’re not even exist, answering questions like they doing a big favor rolling up their eyeballs. Food become less tasty after that experience"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZTlpYnVvMl8zTjdnRRAB",
            "text": "Whenever I’m near Brighton Beach, I have to stop by and grab my favorite dish—a piping hot pie of khachapuri. To all the cheese lovers out there, this is a must-try! They also have so many other dishes that look so good, you’ll be hooked before you even take your first bite. The flavors are just as amazing as the presentation—pure comfort food at its best. khachapuri"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJM0Vtdkh2bnJpdHJRRRAB",
            "text": "The food was really good and well-prepared — no complaints there. Unfortunately, the service didn’t match the quality of the food. The waitresses had a noticeably bad attitude and gave off very negative energy, which made the overall dining experience less enjoyable. Hope the management can work on improving the service side, because the kitchen is definitely doing a great job."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKcTk3dGZtLWFmR0tREAE",
            "text": "Came here first time, and because i didn’t speak their language they tried to rip off the money from me. I ordered food for total of 35 dollars(no taxes).When i decided to check out,they said 41,i was like okay,and i see a sticker saying “ 28% discount when you pay cash”. I decided to pay with cash,to get the discount,and lady saying 41 IS WITH DISCOUNT,thats absolutely unacceptable. If you r from around here,be careful,they gonna try to rip you off!"
        },
        {
            "date": "5달 전",
            "language": "uk",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa2RMcHVRRRAB",
            "text": "Все було дуже смачно,\nGmadlobt"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeW91OEZnEAE",
            "text": "Very tasty 😋…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJci1qR2RnEAE",
            "text": "Yes the food is good, but the band… absolutely amazing, I wish I could have stayed for another three hours, I enjoyed every minute of the night. Go when you’re not a rush, order the meat kababs and let the band feed your soul… Georgia, you’re so beautiful ♥️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdXJTcnhRRRAB",
            "text": "Great Georgian restaurant, the Khachapuri is a good dish to share with some friends"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcThQZWZ3EAE",
            "text": "Very long and rude attitude towards customers. We waited 40 minutes for the salad to be brought. Had to refuse one hot dish, we waited 1 hour and 30 minutes, and the hot dish was never brought. We were in a hurry and refused to wait. The salad and khachapuri were delicious"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LXJXQk9BEAE",
            "text": "Amazing Georgian restaurant conveniently located in Brighton Beach and easily accessible by public transportation. The food is full of rich, authentic flavors, and the service is absolutely outstanding. The wine selection is fantastic, making the experience even better. I love this place and will definitely be coming back again! Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcy1lZ2x3RRAB",
            "text": "Очень не гостеприимная официанта . Ждали 40 мин заказ.\nНет хинкалей без Свинины . Это конечно очень расстроило .\nЕда не очень понравилась\nНе советую"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBenZTZE1REAE",
            "text": "Very nice place with an authentic Georgian cousin."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMDdtYml3RRAB",
            "text": "I've eaten here seven or eight times. Food was always very good and service passable, but the last time, a makeup birthday dinner for my dad who I hadn't seen in a few months, the bread wasn't fresh, the chicken on the cirsivi was stale and hard, the meat dish was wrong, and the server indifferent and inattentive, despite being empty. I gave this feedback. They should have comped this awful meal. They lost a customer forever."
        },
        {
            "date": "9달 전",
            "language": "ru",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBemFpSzFnRRAB",
            "text": "Еда потрясающая ,выше всех похвал ! Поварам спасибо огромное и низкий поклон , мы получили огромное удовольствие. Большое НО  к сервису ,конечно типы уже включены в счет и зачем официантам стараться ,правда ? Посуду грязную мы игнорируем и не убираем ,соседние столы ,где гости ушли ,стояли с грязной посудой по 40 минут,мне лично не очень приятно лицезреть  , предложить и рассказать что-то о блюдах не можем , сметану к хинкалям просили повторно ,лед просили повторно ,компот просили повторно . Самое странное как официант ,вроде истинная грузинка ,не знает что такое попсовое вино Алазанская Долина . Уважаемые владельцы ,чем больше ваш персонал осведомлен о блюдах ,тем больше они могут предложить и повысить чек стола ,а также вашей выручки ,задумайтесь ! С толковым официантом в таком вкусном заведении ,мы бы с большим удовольствием оставили больше чем 160$."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcko3R3VBRRAB",
            "text": "One of the best Khinkali…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeDl2cVR3EAE",
            "text": "I like it! 🇬🇪🇺🇲🫰🏻✌🏻"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOEtuTnB3RRAB",
            "text": "\"Disappointing Experience\"\nI was incredibly excited to try this restaurant, but unfortunately, it fell far short of expectations. The ambiance was underwhelming – the place looked tired and dated. Service was incredibly slow, with a single staff member juggling hostess, bartender, and waitressing duties. Despite only six other diners, we waited an agonizing 45 minutes for pastries that should have taken a fraction of that time.\nThe food itself was a major letdown. The overwhelming flavor was salt – excessively so. The dumplings were particularly disappointing, with thick, undercooked dough overpowering any subtle flavors.\nOverall, this was a truly disappointing experience. I wouldn't recommend this restaurant to anyone."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmc2VhVmVREAE",
            "text": "Decent tasty food for a reasonable price."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cmNtVm5RRRAB",
            "text": "Food 1⭐️\nService 000\nMalibu 5👍"
        },
        {
            "date": "10달 전",
            "language": "zh",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cmJIRUlnEAE",
            "text": "malibu👏👏👏❤️❤️❤️❤️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MmZfaG9BRRAB",
            "text": "Very disappointed. My husband and I just decided to come in, but they said we can't without a table reservation. We went out and immediately called if we could reserve a table. They told us we could come in 5-10 minutes. Seriously? Why such an attitude? 👎👎👎👎👎👎raise the rating? You've lost really good customers!!"
        },
        {
            "date": "10달 전",
            "language": "ru",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MmZxQ3dBRRAB",
            "text": "Не рекомендую это место, обслуживание и сервис 1/10. Потому после стали заказывать через Uber eats, раньше заказывали и все было сносно. Теперь все стало слишком плохо, хинкали после морозилки, сварены и лежат как тряпки, хачапури по аджарски так же стала хуже, сыр не растоплен и лежит кусками. Очень жаль, что такое когда то хорошее место стало таким отвратительным!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ejdyVEtnEAE",
            "text": "This place is so fun. It has so tasteful food I really like the area in side of restaurant. And the food the best❤️"
        },
        {
            "date": "10달 전",
            "language": "ka",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ei1xeW9BRRAB",
            "text": "დიდი მადლობა Georgian House სასწაული ატმოსფეროსთვის 👌🙌"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ei1xSWtnRRAB",
            "text": "I recommend everyone to visit. Nice atmosphere and good music"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aEpqaF9RRRAB",
            "text": "Cozy venue with good aesthetics! 👍👍\n\nLove the bar vibe & lounge beer hall as you enter the premise. The arch ceiling lends a sense of antiquity.\n\nThe Ajaruli Khachapuri was a delightful sight to behold. It tasted just as wonderful as a work of art. 🖼️\n\nWeihenstephan available on tap 💪💪. Just this is worth a visit.\n\nMagnificent venue vibes & feel.\n\n** There is a 10% service fee + 3.57% operating fee. I’m guessing they pay the staff extra so no gratuity needed?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydk5PRENBEAE",
            "text": "The food is very good. The khachapuri wasn't as good as other restaurants in Manhattan. The bread seems like it's not real, made with too much oil in the batter.  The appetizer was very good and the first time I had sturgeon fish.  Delicious 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiX2ZUOE53EAE",
            "text": "We were in this restaurant for the first time yesterday. And we were very pleasantly surprised, the food is very tasty, just like in Georgia. Excellent service, very pleasant atmosphere. We will definitely come again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSX1BTVGxnRRAB",
            "text": "Absolutely fantastic. No complaints. Best Georgian food I’ve ever had. Already told a bunch of my friends and family to come try it out. I hate meat because it’s hard for me to like the taste but I went in with an open mind and try chicken…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcXVISXRnRRAB",
            "text": "The food took a bit long to get on the table, but it was very very good. First time trying Georgian food and it did not disappoint. I like all of the things we ordered, but my most favorite dish was definitely the Khachapuri. It came out hot with “boiling” cheese and egg on the bread boat and when you mixed it, it just came together so nicely. The bread itself was so soft but has a crunch on the outside as well.\n\nApart from the cheese boat, we also ordered some Khinkali and beef/lamb kebab and it was also amazing."
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaHRMWF9nRRAB",
            "text": "Очень вкусно, насыщенный аромат всех блюд. Мы брали суп харчо, хачапури (закрытый вид), острое, кебаб\nи компот. Все понравилось. Народу не много, но постоянные покупатели заходят и берут еду на вынос часто."
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNE12Y0lREAE",
            "text": "The best Georgian-style restaurant in New York!!\nОооочень вкусные хачапури и шашлыки!!! Уютная атмосфера, хороший сервис, приветливая официантка. Хорошие цены ( особенно для Нью-Йорка ).\n10/10 советую всем, кто любит грузинскую кухню."
        },
        {
            "date": "11달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNkxlelRnEAE",
            "text": "Приятная атмосфера, очень вкусно. Брали харче и чакапули, мы в восторге. Официантка слегка замучаная и грустная, но вежливая и все объяснила нормально."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsN3JiVkxREAE",
            "text": "Lovely restaurant with very good -- not great -- Georgian cuisine. Live music is performed on many nights. Service for us  was indifferent. Service improved when my wife spoke Russian. The room is very attractive with good space between tables."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbTVEUTV3RRAB",
            "text": "Not cheapest food ever. BUT food is really good. Live music on the weekend!! Be prepare for service fee for that. Waiter forgot to bring one of the plates for us but didn’t forget to put it to the final check even after we point that."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaV83V2N3EAE",
            "text": "What you see is what you get in terms of the ambience. The house hand is loud, the Georgian immigrants are handsome and macho and it seems like you have left the good old USA and are in Tbilisi  where the customs are different and so is the food, but the fact is, the food is so so good, like, incredible!\nDnt leave without trying the Napoleon for dessert and the dumplings and Lula kebobs in the least. This is a fantastic feast. Go! Enjoy!"
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3djVIQ0RnEAE",
            "text": "Решил впервые отведать Грузинской кухни, пришел прочитав положительные отзывы, но зайдя меня встретила хмурая официантка, позже выяснилось что она недоброжелательна, груба и резка, это сделало ужасным все пребывание в заведении. Может это по той причине, что гости были не грузины. Еду взял, харчо, шашлык, хачапури по аджарский и курицу в сливочно чесночном соусе. Хачапури и суп понравились, шашлык был очень крупными кусками и суховат, словно не жарили а на половину парили или варили.\nВ общем надеюсь официантка будет лучше относится к людям. Было все 19 августа 2024 год, около в час дня."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dzlhbGh3RRAB",
            "text": "I was down by Brighton Beach and took the opportunity to hit up this Georgian restaurant. Absolutely amazing!! Had the Ajarian Khachapuri - a delicious bread bowl with melted cheese and egg, dumplings and napoleon cake for dessert. Everything was a hit! I’d make the trip the the end of the Q just for this."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbmJhWlJnEAE",
            "text": "The food was great, typical food for a Georgian restaurant. My friends and I loved every single thing. On a sunny Sunday noon, the place was quiet and intimate. They accept cards, but charge 4% less if you pay cash."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKb0tpQ3VRRRAB",
            "text": "Great food, OK service. 10% \"service charge\" added to the check without being indicated in the menu was a disappointment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcF9QalJnEAE",
            "text": "Very good food. Khachapuri adjaruli was amazing. Khinkalis were good and juicy inside.\nI recommend!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwa1o2cTZRRRAB",
            "text": "This was my first time at this place and I can easily say, I will definitely be visiting this restaurant again. I am not familiar with Georgian cuisine and the water patiently explained and advised what to order. Everything I tried was…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURPbHVkeBAB",
            "text": "Food is delicious but they’re extremely low in personal , they have to hire at least 1 busboy or hostess to answer phones , welcoming people . All tables need something but can’t reach waiter/manager whatever he is .\nFrozen Georgian manti khinkali takes 40 minutes to prepare or worse - Waiter can’t handoff you ready food !\nDefinitely will visit again what’s going on ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPenE2NWNnEAE",
            "text": "Amazing Georgian restaurant! Great vibes in the place and delicious food! The hachapuri is a must!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbDVEYTVRRRAB",
            "text": "Service lacked. I stood at the door for good 5 minutes before I was greeted. My waitress in a blazer kept ignoring me. She even walked out of the kitchen with her head buried in her phone. My table was literally ignored for a whole night and I had to come to the bar to ask for things, which was annoying. Crumbs on the cloth from a previous seating were ignored. I had to ask for water after I got my glass of wine. Her face looked very miserable and her “service”, or lack thereof, almost spoiled the night if not for the music.\nSpeaking of which, the music was great. Musicians are very sophisticated and professional.\nIt also smelled bad there. Maybe seat cushions need to be washed. When food came, it masked the smell but it’s still atrocious, obviously. Speaking of the food, it was good. Just like in any other Georgian spot.\nThe owner and the management need to understand that such poor service and filthiness will steer guests away to dine in other Georgian restaurants."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMDhLUk9BEAE",
            "text": "It's definitely nice and hidden cool restaurant. The server was nice too. a bit pricy for me."
        },
        {
            "date": "6년 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZd3ZDdHJRRRAB",
            "text": "(eng) Very bad space with long waiting. We were alone at the restaurant and we waited for 50 minutes, but they served their family first. Chicken was overcooked. Awful place, who doesn't give a.. About you..\n\n(rus) отвратительное место. Ещё и 18% за сервис, хотя к нам подошли всего 2 раза. ИЗБЕГАЙТЕ ЭТО МЕСТО."
        },
        {
            "date": "5년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNd2EzeDRBRRAB",
            "text": "Вкусно. Относительно быстро. Средний чек на двоих 50-60$. Спиртного у них нет. Можно свое приносить."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXXzgyRjV3RRAB",
            "text": "Warm and inviting atmosphere, the authentic Georgian food was delicious and beautifully presented. I had the Chanakhi which is a stew with veal, potatoes, eggplants and other vegetables. Would 100% recommend!"
        }
    ],
    "reviews_count": 63
}