{
    "name": "Crab House Brooklyn",
    "place_id": "ChIJS6Akdi1FwokRPzZDkOtkDbQ",
    "grid": "BK13",
    "address": "1223 Surf Ave, Brooklyn, NY 11224, USA",
    "rating": 4.6,
    "user_ratings_total": 1023,
    "phone_number": "(347) 462-1934",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMVRFWlFlbVJ5UWtkaU5VVmlObUl3U21ObkxWRRAB",
            "text": "Don’t believe the hype ! Yes clean very clean but the food was nasty they fried the shrimp with shells on it like what!!! The fried rice taste like it been in a smelly fridge it was beyond the three day old rule the garlic bread was served toasted hamburger rolls chopped up to look like garlic cooked a day before and warmed up when people asked ….rolling kitchen just food come out all at once no favor on vegetables at all!! And then they give you these mystery sauces on plate and 495.00 later !! For three people every thing had the same garlic butter sauce and I swear those lobster bites were from Costco appetizers and crab Rangoon nasty place"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxV1EzaE9SRmxPTkhSYU5qVXlNM05WWlhvMlNrRRAB",
            "text": "I'm giving four stars bc the service is great, they get real cute with the birthday stuff, and there's variety/quantity. So if you only liked one type of shrimp, you can eat as much as you want, so you're leaving full even if you're only satisfied with a few things. I heard someone rave about this place and when I went myself, I figured they were impressed bc they're not used to nice things so they think it's the best. By no means is this phenomenal, but it's good-ish. If you don't eat much, save your coin. The whole fish was probably my favorite thing, along with the sauce that the calamari comes with. Yes ... The sauce. Have the lobster cakes with the calamari sauce..... Yum! The strawberry lemonade was also really good (no free refills). I didn't drink any alcohol, I came to eat! I'd come back if someone else was paying but I've had better..... No shade. I also think the crab was kind of overcooked. Either the meat was sticking to the shell or there was no meat. The steak is clutch WITH the minced garlic, otherwise it's meh. I think our fav shrimp was the spicy shrimp, kind of overcooked but the best flavor of all the shrimps we had and the sauce on the broccoli? Hated it. They could add more sides to the menu in my personal opinion. I didn't take a whole lot of pics.... My hands were dirty lol (no gloves. And we did ask so idk if they forgot or don't have any). The cheesecake was also really good (my friend surprised me)."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnd1dYaEJVbU5mVm5Wa1RHTXpVRkJxVUY5bFFsRRAB",
            "text": "We were able to book a reservation for 7 people about 30 minutes before closing. We switched from the NYC Crab House to the Brooklyn location, thinking they stayed open later. Unfortunately, since we arrived close to closing, the food felt a bit rushed and didn’t seem fully cooked in some cases. The flavors weren’t bad, though, so I’d be willing to give them another try—just earlier in the evening next time."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNGJqVk9iVFpUT0Y5dFRGcFRlV3BSV0dOMWNsRRAB",
            "text": "Very pricey, but good food and excellent service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5blYxSmtaM2h5ZFc4MVJUZzVjMFpQZVRjM01YYxAB",
            "text": "This place was amazing ! All You Can Eat for $120 with lobster !! Never seen another place like this !! Super dope , not cheap with their stuff ! It's all you can eat !! Cant go wrong with that . We ordered everything . We had a server/host Fred , he was super nice and knowledge. We will definitely be back or check out their city location."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swd2NWSmhlR3BUYVhsNWRuSkdlWEpZY0RsMWJYYxAB",
            "text": "This is not your average seafood buffet! I went here for a date, and I’m so happy we took the drive to Brooklyn. Not only was the food amazing, but the service was even better. My waitress, Star, was beyond attentive and helpful! She gave me suggestions on what to order, which was very helpful considering I’m a very indecisive person. Her service alone would bring me back here.\n\nThe food was a 10/10! I’d definitely recommend paying for the lobster all you can eat option as it was more than worth it. Honestly, I think they should raise the price because that’s how good it was, and there was so much food they provided.\n\nThe drinks were just as good! My favorite was the scorpion. I’d definitely recommend starting off with that one, it wont disappoint."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdFktQ0d3EAE",
            "text": "Food was good but very expensive"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNGRrNVJVVEJRV1ZOQmNsSnJWWE5FWkhOVFlWRRAB",
            "text": "Love this place! The food is amazing. Ambiance is relaxing and the service is swift!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMWRIVkZkVk5GV0V4M2VWOTViVkZsYlZGNWFHYxAB",
            "text": "This place is 10/10!! When they say all you can eat, they meant it. Everything was very tasty and a nice portion of food per item. I will absolutely be returning"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVVowWjJVVTlEU2pacmNYaHpiRVpYVGtOQlNHYxAB",
            "text": "Star was our server and she was great. Very attentive. Food was good too"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSFZIQXpUbTUzYjFGUFgyNXNSM1IyUkRZMWEyYxAB",
            "text": "The service is amazing! The seafood is amazing! Thanks you crabhouse 💕"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UlExZGFVbHB1TVVwWU1tVnNNbG8yTURSUk1rRRAB",
            "text": "Great food and quick service on the very busy Coney Island!!! I highly recommend!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNllXaENVbTE0VkhWSmRWRTFlamM0U2pkQ2VtYxAB",
            "text": "All you can eat crab,  not something you see every day! So good! :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRmVVb3pXbmN0ZWtGUmJEWjZVak5JY21VNGMxRRAB",
            "text": "Crab House Brooklyn did not disappoint! From the moment I walked in, the host was incredibly friendly. Upstairs we were greeted warmly and seated right away by Fred the manager (awesome guy). We were given the menu and a thorough explanation of how to order, along with a brief background on the restaurant and a fun promotion!! if it’s your birthday and you arrive with four guests (including yourself), you eat free the day of or the day before/after just bring proper ID.\n\nAfter we placed our order, the first round arrived quickly and was incredibly fresh. The aroma was irresistible, and everything was hot and flavorful. The portions were generous, perfect for sharing, with no waste in sight. The staff was attentive, making sure drinks flowed and we had all the utensils and napkins we needed. When it was time for the second round, we never had to chase anyone down the staff were prompt with the menus and quick to clear the table.\n\nAll of the staff seemed happy to be there, and everyone was pleasant. The environment was clean and tidy. The prices are unbeatable for the quality of made to order seafood and the non-seafood items as well, plus the outstanding customer service. Fred, the manager, made sure everyone left satisfied. I would highly recommend Crab House Brooklyn definitely a standout experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NGVUQklUblJvVG05Q1FsZFNObWRrZWs0MlJHYxAB",
            "text": "10/10 service, food, everything was fresh and seasoned, not as expensive as I thought, and definitely again 10/10. And my server Izaya was an excellent add on to my experience so i definitely will be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGS1IzZFBSREU0TVdveVEyaFVhbmRwYlZJd1FWRRAB",
            "text": "Me and my husband came here for the first time for my birthday, when I tell u the food was delicious and they gave us so much food that we had to take some home. The place is clean and the workers are so kind and professional"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMVlsVnNRMGxuWkhkalVHaHliRFIxUld0b2NIYxAB",
            "text": "Awesome!!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdmVXbmFREAE",
            "text": "It's always a pleasurable experience here. They have a great variety of good tasting food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoYVYzaE1jVXB5ZEcwd2JWSlZjbHBqYVc5S1gxRRAB",
            "text": "The food NEVER DISAPPOINTS!!\nAlways fresh, hot and delicious!\nStaff is friendly and prompt. Vibes are chill, good tunes play in the background"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sYVNVb3pjbFZ3WkZveWRHWlNVa1YwVmxNMFIwRRAB",
            "text": "Both the meals and the service exceed what you'd expect. Not expensive. Employees - outstanding - kind and focused. Their food features unique flavor profiles worth trying. Sample their food and make your call."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SR1VuSTRVR3huVDBWR2VWOTFNRE5pVmpkT1MwRRAB",
            "text": "Went to Coney Island location was informed there is a Manhattan location, not an open buffet style you sit and check off want you want from selection which is small and get two hours of continuous eating. restaurant clean our waiters were nice, food was good came out quickly nothing wasnt greasy. place wasnt crowded we got there around 5pm. booth was roomy n comfotable. Place is very organize and detailed, ex. ALL condiments were neatly already on your table. feel like its pricey for the small menu of seafood selection which was crabs, king crab legs, fried/ steamed shrimps with old bay seasoning and one selection of fried fish also very tiny crab cakes.  hardly no vegetable,  they only offer garlic broccoli which was good steamed perfectly couldve used more sauce for flavor, no salads.  Will try the Manhattan location next time was told compared to brooklyn location a little more selection of seafood for price.  Soda and ice tea You pay two dollars extra for. At the manager discretion you might pay extra for any of your left over food if you decide to take home. Overall food was good, service is great food came out quickly after ordering, wish seafood selection was more for the price they charge per person."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVlNEQlJWMkpMYkROVldHTmlibk5HV1d3NWRrRRAB",
            "text": "Although a little expensive, but was worth the trip. Clean facility service was great as well. Food was excellent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poalV6ZzJNelEyUzJVeVIxaG9OVTlLWVZGaVFWRRAB",
            "text": "Crab House Brooklyn is a seafood lover’s paradise! The all-you-can-eat crab legs were fresh, flavorful, and perfectly seasoned. The atmosphere is lively, service is quick, and portions are generous. A must-visit spot in New York for anyone craving authentic seafood with an unforgettable dining experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oT01qbDJiSEoxV0U0eVJWUkJTMlpLU0VOYWRVRRAB",
            "text": "Thank you, Izaya for all the great services and customer service. You’ve given me here today at the crab House, Brooklyn, New York. I’m here visiting New York from Los Angeles, California"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UFZFaGxWbGhSYUd3elExaEpVRW8wWVdNeWFHYxAB",
            "text": "Great food and atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paV05uWTRiVFJxVEhGSVNIVXlZbXhFUW1zMlZWRRAB",
            "text": "great food and good vibes!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGME0xVm9lbWhzYUdkUmNHMXVlakoxZVRWNldsRRAB",
            "text": "The space is nice and clean. Staff is friendly and the food comes out pretty fast. Overall a nice place for a celebration. Ask for Yong. He’s such an attentive server"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNVVGcDNhVkl6U3kxQlJHaHFUVnBZY1ZCVE1uYxAB",
            "text": "Service is great. Izaya was my server. The food was very delicious. Definitely would 100% recommend again will be back for sure."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xblNYUXlYMEZ4YTJsTE0zVkZMVGxLU1RaRFoyYxAB",
            "text": "I had a great experience at this restaurant. Our waiter Izaya was amazing! So friendly and great service. I would definitely come back especially for him!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRVpGY3daMWRTYjNwalVUVkRTVlZuY0VOTk5sRRAB",
            "text": "Our waiter Izaya was amazing. The overall service and food was great!. Thanks for making our first experience at the BK crab house a special one."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GYVJsbGxSWHBEUkdVeGVtUlFMVWRaZWxRMmJXYxAB",
            "text": "Izaya  is a great server the service was great and I really like my time I 100% recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSFJUVnlZbXQxWVhKNk1uVlpWak5xUm1FNGRYYxAB",
            "text": "A1 seafood- I really dont think you have to drive to MD anymore for great seafood. They doing they're THANG"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWlYxbDNSalp4YTFKSE1XUlhSM0ZyYWpCNmJGRRAB",
            "text": "Went here to celebrate our anniversary. It was our first time here. Our server Yung, was great he kept everything moving. The food came out quickly and sizzling hot. Everything was delicious, loved the garlic noodles, salt and pepper lobster and the iron steak. Drinks were also good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wS1JFUTVlVGwyWTE5SVgwMTFiMUJ3VFhSdVdrRRAB",
            "text": "Greatest server of all time IZAYA!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocVNUZHNYM1JaTlc1Uk4xSXpiVGhxYXpacWRFRRAB",
            "text": "The Server Izaya was awesome he  had great hospitality & the food was amazing  i would definitely recommend 10/10 I will be returning"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMlEwNUlSSFIzUlhKclZXWlFVMk5pTUU5U1dGRRAB",
            "text": "Waiter is extremely friendly, place smells good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSeE1raFJMVkppWldSbGVFaFlURmRKYldkSWVHYxAB",
            "text": "The food was NOT great. It was okay."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeXR6RHhnRRAB",
            "text": "Very nice place, fast service & fresh food ! service quick & waiters are friendly !!! DEF A Must GO TO !!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWM1dFTnliMFZQWjNKTGFYZFFMVWR1TW5kRFNFRRAB",
            "text": "Awesome customer service and very polite and delicious seafood"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WFZtcEhSMkU1VkVKT1gwaHJUUzAyYVVsTmRXYxAB",
            "text": "Fred was providing us with immaculate customer service as soon as we sat down. The food was exceptional, very tender and juicy. Will 100% be coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ZlgwdFBWMlZYWDJoSWJYZE9RMUZ3T1hOSVYyYxAB",
            "text": "Fred was my server and he was amazing!! He was attentive and fun energy. The food was great too. Came hot and fresh every time. I would recommend the spicy shrimp 100%. The Mai Tai was delicious too!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSck1uSjBXV2QwUjB0UGIxQkZaM2RqYUdkT1gzYxAB",
            "text": "I came here for my birthday today and Fred was so amazing and attentive. My friends and I had a great time! Will be back for sure :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prd05DMDFTamxOYTI0dFpFUkxlRE0zUjB0U05VRRAB",
            "text": "Amazing service, amazing garlic bread, sauce is saucing, water ice cold, clean environment"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dlRXcElVbGxoZGpSS1gwWjRTVXA2VGtabFZuYxAB",
            "text": "Very nice for Coney Island, food was great and plentiful....I would recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSb1FuQkpOUzFWUW5oNVRVSTVTbmxxYm0wMFRtYxAB",
            "text": "Beautiful place great food smell when you come through the door"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYUstdjZxaXRuRUR3EAE",
            "text": "If you love lobster, this is the place to be. Everything was extremelyfresh. we especially enjoyed the salt and pepper, fried lobster and raw oysters. Everything else was at least eight out of 10. The flat iron steaks spicy  blue crab was 9 out of 10. The service was outstanding. I’m glad I don’t live close to here because I’ll gain 100 pounds. Overall this was a wonderful experience. I’m glad that I came."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Mk1uRjBTVUZqVEdScWNXWXhTa2hUT0RCS2FFRRAB",
            "text": "Went here with friends and the host was really helpful. He was very accommodating and made sure we were comfortable and had enough room for our motorized chairs. Since we were new, he explained the contactless buffet and how the menu worked.\n\nHe combined two tables and left garbage cans to throw our trash away which was nice. The food was hot and beyond delicious. Staff was attentive and food kept coming: Seafood, chicken, fish, steak, rice...just yummi. Even the water was good. Only thing missing was dessert, but since we were in Coney Island, we had options.\n\nYes, the price tag was high but its worth it ($90 seafood, $135 to include lobster) with a 2 hr time limit (it's more than enough). Will definitely visit again. 😋❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOalhnSTZaeS1qY3BnRRAB",
            "text": "This was a great lobster buffet experience. Made reservations so was seated instantly. Everything was good i loved the wine. Great music and my waiter was great fast and knowledgeable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNXR6OHRnRRAB",
            "text": "all of the seafoods were so fresh and cooked to perfection! def a bang for your buck.\n\nespecially loved the raw clam/oysters, spicy seafood mix,  lobster, noodles, crab legs"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kamVrdFJRVTFPWjAxMlFuSkdSVGxDUVVOVFdGRRAB",
            "text": "These types of restaurants always confuse me, so here's how my experience ran - Here we go:\n----------------------------------------------------------\nPlace is right on Surf Ave so be prepared to walk among the crowd of shady individuals to get to the front door.\n\n•Check in with Hostess #1 to confirm reservation.  Next step, take the elevator, up\n•Hostess #2 re-confirms your reservation and finds and leads you to a table.\n•A gentleman hands you menus; One for food, one for drinks, along with a tiny pencil.  He comes back to bring wet wipes, bibs, claw/shell crackers and our water.  During all those trips he makes, he hopes you'll make an order.  •Final trip, he picked up the menu paper that has our choices and took off towards the kitchen.\n•3 minutes pass and a lovely lady drops off Garlic bread and our drinks\n•2 more minutes pass and platter after platter after bamboo steamer after bamboo steamer get brought to the table; More than the table could hold.  We were 3 bamboo steamers high filled with food.\n\n(*Good lawdy, I need a break from all this food!*)\n\nWe start eating.  Crackers in hand, napkins at the ready, butter ready to be dipped in - I'm set to go.\n\n(10 minutes pass)\n\n•A gentleman walks by with a FRESH, NEW menu, to place another order.\n\n(*Lawd Haft Mersey on our souls*)\n\n(15 minutes pass)\n\n•\"Wanna order more?\"\n---------------------------------------------------------\n\nInside of the restaurant is beautiful.  Decór is minimalistic and modern.  Clean.  Bathrooms were spotless.  Ambiance was calm.  Background music playing was \"Easy Listening\".  And most importantly, Cuisine: Super fresh fish.  I am so serious.  This stuff does NOT sit in the freezer for a year.   I don't think this fish gets frozen, ever!  It's crazy fresh, and very enjoyable.  The items on the menu that were NOT \"fish\" (such as the chicken wings, the shrimp and garlic pasta, etc ) were not the best.\nAnd finally, we did not receive everything we ordered.  We marked down on our order list 2 items that we never saw.  If they didn't have anymore of those 2 items, we were never informed.  We were just not served them.\n\nBy the way, YES - You DO have to tip the wait staff a MINIMUM of 10% of your bill.\n\nEnd result:  We WILL return in the future.\n\nLoved the fish, loved the restaurant"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOV9uTFlREAE",
            "text": "First time here! Food was amazing, as well as the service. Our waiter, Izaya, was extremely attentive and made our experience very much worth it. Would definitely come here again!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcThfZWdnRRAB",
            "text": "There’s no excuse this place to be charging this much for the quality of food they serve.\nTo start, the place had us made the a reservation, when we showed up, there was no one there, the place was empty.\nIt is not very appealing when you have all kinds of mess right next to the tables where you sit.\nI used the restroom before I sat, one of the employees was standing inside the restroom on the phone, he rinse off his hands and walked out, no soap was used. I told the staff but I was ignored, I didn’t see him anymore. I heard from the kitchen referring to me as crazy for saying this.\nThai is very important, They don’t tell you until you get there but everyone on same table has to eat the same, it’s ridiculous.\nWe were forced to eat separate after driving almost 2 hours to get there.\nWe requested the see the manager for menu clarification because is not what is advertised, manager never showed up to see us\nFood is subpar and they threat you with extra charge if you don’t finish it without taking accountability of the quality they themselves put on the table.\nService was friendly but not for the price.\n\nDO NOT COME HERE UNLESS YOU’RE PREPARED TO OVERPAY AND BE DISAPPOINTED IN ADDITION TO FOOD POISONING ( yes, my son got food poisoning)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMczVQRUVBEAE",
            "text": "For my Aunts birthday, I decided to bring her here as she loves seafood, and I've had my eye on this place for some time. Everything from the atmosphere to the service and food was top-notch.\n\nWe settled with the all you can eat seafood, including lobster, and man, was it delicious. The seasoning superb. Even the music! My aunt and I were jamming!\n\nThe bill for two was $266 due to all you can eat lobster. While pricy was well worth it. I can't wait to return."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeXR1dVR3EAE",
            "text": "Went to Crab House Brooklyn last weekend and it was such a wonderful experience! Service and food were amazing. Everything came out fresh and well flavored. There are a plethora of options to select from and for the price, it’s worth it to try a bit of everything! I would highly recommend dining here."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcU1ERzB3RRAB",
            "text": "Listen, if you come to The Crab House thinking you’re about to eat “light,” you played yourself. I walked in thinking I’d be cute, maybe have a little crab leg or two… next thing I know, I’m elbows deep in butter sauce, questioning all my life choices.\n\nThe seafood here is UNREAL. The all-you-can-eat menu had me feeling like I was in a competitive eating contest—except the only person I was competing with was myself. Crab legs? Fire. Garlic butter shrimp? A problem (in the best way). Lobster? Don’t even get me started. I had to unbutton my jeans halfway through, and by dessert, I was contemplating a nap right at the table.\n\nService? 10/10. The staff was quick, friendly, and didn’t judge me when I asked for my fifth plate of snow crab. They even kept the wet wipes coming like they KNEW I was struggling.\n\nIf you love seafood and have no self-control like me, The Crab House is IT. Check out my full review on Instagram @iknowaspot.ny to see the damage I did. Just don’t blame me when you roll out of there in a food coma."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIZ1lyOVdBEAE",
            "text": "Went here on a Tuesday night so it was not busy. At the time of this review, the dinner was 88 per person for the non lobster all-you-can-eat.\n\nThe food was mostly good except for the following:\nCajun butter shrimp didn't seem to have much Cajun flavor... it had some other seasoning that didn't tasted... meh.\n\nThe blue crab had almost no meat or fat so it wasn't worth ordering and taking up space on the table.\n\nLobster bacon drumstick weren't drumsticks at all and it's just alright... Not worth the stomach space\n\nWe ordered like 12 things though so overall I think the food was mostly a hit. We definitely didn't eat $88 of stuff but they gotta make money somehow.\n\nI would come back for special occasions.\n\nAlso, free dinner for the birthday person."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQOE82SWRnEAE",
            "text": "A few weeks ago, I had the opportunity to check out Crab House, and everything from the moment I got there was amazing. From the ambiance to the service, everything was a 10 out of 10. The food was delicious. Everything was extremely fresh and seasoned to perfection. They have two menus one that costs $80 and if you would like lobster, the price per person comes to $115. Some of my favorite items were the Seabass the fried rice, snow crab legs, and scallops. I would recommend this restaurant for larger groups or if you're having a celebration such as your birthday or a special event."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdHEyLWF3EAE",
            "text": "Came here on a Wednesday night (2 people), we were quickly seated without reservation. We opted for the $115 buffet with lobster, with which we has 3 lobsters between us. Food came out really fast, and the portions were huge on the non luxury items (luxury items I define it as scallops, crabs, and lobsters). It's family/sharing style. I wish they had explained to me the portion because it was a lot that I unintentionally ordered for 2 people, vs I thought I'd be sampling and reorder on things I like. That said, the lobsters were good, the sauces are delicious, service was good, and the environment is nice and good vibes. I didn't particularly cared for the fresh clams and oysters, I've had better. Is it worth the price? Depends on how big your stomach is, it's not bad."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSXzZTWEdREAE",
            "text": "I went there with my best friend. Once we had arrived, someone came from the elevator to take us to the floor. Once you get off the elevator, the spot is nice. The music was good while eating dinner. The menu is a little confusing, though. We had to ask two people to explain to us how the menu goes. The food was good, and the food is served in small amounts since you have several choices to pick from on the menu. The drinks were strong and amazing. The price is $80 per person."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneC1fMFh3EAE",
            "text": "If you love seafood, Crab House Brooklyn is a must-visit! The unlimited lobster and crab legs are the highlight—fresh, flavorful, and constantly replenished. The variety of food options is impressive, from shrimp and mussels to delicious sides like mac & cheese and garlic noodles. The atmosphere is lively, and the service is great, even with the steady flow of customers. Perfect spot for seafood lovers who want to indulge. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbDdHbFZREAE",
            "text": "It was amazing time and the seafood was so fresh I love the crab Rangoon, and everything it was delicious and good choice to take my family for diner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5ejVxcDVRRRAB",
            "text": "Our server was nice and made sure he kept the food coming. He also bought me over cheese cake and sung to me for my Birthday. Me and my mom had a great time and she loved the place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLVAyZ213RRAB",
            "text": "Nothing but good things to say about this place. Staff was quite friendly, food and drinks were delicious. Everything we ordered had great flavor. Some may say it's a little pricey, but for the amount of food you can eat, I think it's worth it. Will be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsOWNEN0hREAE",
            "text": "The food was delicious! The shrimp hand breaded was AMAZING! Loved everything about the wings. The crab was GREAT! Not as great as yong self service with us! He always checked on us. Made sure our plates were done and out the way. Very informative! Thank you for making my experience comfortable 🫶🏻"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORFlVWjJMVTB0WXpBM2FrdGliR3hoY3paSU5HYxAB",
            "text": "I wasn’t sure id like this location but thankfully it Tastes the same as the one in Manhattan. Everything was delicious and fresh. Will definitely be coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKT2Z6N25famZYSXhnRRAB",
            "text": "Food was very well seasoned. Price was very reasonable I wish I had known they didn’t have to go bowls for the soup. I would’ve gladly paid extra to take it home! Servers were attentive and would offer help as they passed by, I do wish they had given a tutorial on how to maneuver the table as a first timer. You have to cook your own food so I did find it thoughtful that they had a munchies station that we could’ve eaten from before taking the time to cook our food . Parking is hard to get. Be prepared to go to a parking lot!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odVlqQmpYMDFMVG5SbVNWaFNjbDkxT1dkaWVXYxAB",
            "text": "Everything delicious 😋 if you eat very little it doesn’t make sense for you because is expensive. But the service was excellent 5 and food okay 👌🏻 ⭐️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN2NxMm5BRRAB",
            "text": "My new favorite! The manager is friendly & so is the rest of their staff. As for the food and drinks?!? OMG! 🤩😋🔥 Everything was delicious!! We were stuffed by the end of the evening. Everything we ate was oozing with flavor! Will def be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoemNPZjRBRRAB",
            "text": "On the outside it’s deceiving but when you actually take the elevator up it’s a beautiful ambiance. It’s peaceful & great for family, date night, friends. Any type of outting. Everyone was friendly but our waitress STAR WAS WONDERFUL & she has a beautiful singing voice!! The food was flavored! Not too salty. But was good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncXAzODlBRRAB",
            "text": "🌟🌟🌟🌟🌟 5/5 Stars\n\nCrab House is a seafood lover’s dream! The all-you-can-eat experience was worth every penny—fresh, flavorful crab legs, juicy shrimp, and perfectly seasoned mussels, all drenched in delicious garlic butter. The drinks were strong, the service was attentive, and the vibe was perfect for families or a date . If you’re craving endless seafood, and drinks this is the spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURob3VmNmZnEAE",
            "text": "Atmosphere is amazing. Service is impeccable. Our server (Sam) was very helpful explaining the menu to us since it was our first time. The food is absolutely delicious. From the Mac and cheese to the snow crabs. Recommended for all new yorkers to try."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWmJEQXdUVzFWWWpSeWVuSXRWa3hOYUcxc2IxRRAB",
            "text": "Everything came out hot and fresh and the waiter was very attentive with bringing a new sheet to fill out when we were ready for more, the lobster option is pricey but worth it"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleHNLVWNBEAE",
            "text": "All you can eat! The scene is awesome, very calming and chill. The server was nice and professional. Food came out quick. Everything was well cooked and seasoned. The bathrooms were extremely clean. The booth were wide and very spacious. I will definitely recommend this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNMkozc19BZ01mMEp3EAE",
            "text": "Star is a hardworking, pleasant, and sweet individual. Her exceptional service truly made my experience here amazing. She went above and beyond to ensure everything was perfect. The food was also excellent—well-seasoned and full of flavor. I thoroughly enjoyed my visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMTYtMGZ3EAE",
            "text": "I love good seafood, and this spot was it! When I arrived I parked on th3 street nearby. I walked in and was greeted. I sat at a bother was served by a nice server. I started with the red wine. I then ordered many things:\n\nScallop\nsalmon\nfried seabass\nshrimp\ndungeness crab\nspicy Lobster claw\nLobster and garlic butter\nSnow Crabs\nFried Lobster\nspicy shrimp\nLobster cake\nraw oyster and clam\ncrispy flounder\ngarlic shrimp\n\nEverything was actually delicious! I loved the fried sea bass the most! All in all, it was an amazing experience!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMXVTSjVBRRAB",
            "text": "Food was impeccable. First time at any all you can eat seafood place and it exceeded my expectations. Food was fresh and well cooked, nothing old and reheated. Only complaint is the oysters were not edible because they were not shucked properly and had shell bits in them. Other than that was delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdGZTZS1BRRAB",
            "text": "Okay you obviously came for the real review about this place. You know I don't hold back any punches and I give accolades to all places people and locations that really do wish to do their best and present their best. As far as this place, it is not it. Firstly let me start by saying that I noticed through the duration of my meal they played nothing but R&B or hip hop. This is not cool this is not cool because it tells me you're looking to gain and satisfy only a certain ethnicity and that's not cool at all. I thought for sure it was just me until my buddies which were of different ethnicities White asian and Latino they noticed the same thing. And certainly the people who were dining yes they may have been of African descent but some may like Bach! Or Andre Bocello, I got the idea you want to try to cater to the people who you deem listen to this type of music well I'm here to tell you not everybody listens and enjoy hip hop and R&B continuously while they're trying to enjoy their meal and Converse with the person next to them. I didn't like that from the beginning why don't you switch it up why don't you put some pop music? Or are you making a blanket statement that bCuz black folks patron your place they have to love hip hop & R&B? To get inside you have to go through a dingy hallway you'll see the picture it's kind of scary looking actually. Youll take an elevator upstairs now if you're traveling here and you don't know what this place is and you go into this hallway where there's no concierge downstairs or anything during the time I was there. you may become a little spooked. Remember certain parts of Brooklyn specifically around Tourist areas can be challenging to people who come to enjoy the dining as well as just tourism. This does not downplay Coney Island because a lot of great people come out of Coney Island and Coney Island is one of the places wheretourist do enjoy especially when you have kids. Let's cut to the chase when I came upstairs I was immediately asked do I have a reservation. I answered no do I need one? The woman once again asked do I have a reservation I said no as I began to leave she says no come come sit down are you here for the buffet I told her yes I don't know why you're asking about a reservation if one is not needed especially when you have an empty restaurant? Nonetheless getting down to the food don't let colors fool you because the fish was not all that look at it it was DRY they said it was sea bass what kind of sea bass I don't know I go fishing and I've never seen black sea bass look like that even if it's friedhard. The head was just shaped differently. The food was not arriving piping hot.WHY? I don't know because it was early morning it doesn't make any difference the food should remain piping hot if sat on the table for a minute. The only thing that was piping hot was the fried rangoon, the fish wasn't even hot it sat on a black hot plate as you see in the picture it was medium temperature with a steamy hot sauce poured over it. I must admit the crab legs were good a little dry but not the worst of the worst. There were workers who continuously went outside to smoke a cigarettes on the patio this is not good when you have people you're serving. I think the board of health should really check this place out because I witnessed two times the server go outside smoke a cigarette and come back in without washing his hands or going towards the restroom. You're removing a cigarette which has your saliva on it from your mouth back and forth and now you're coming in to touch plates and service tables? This is definitely not sanitary I'm glad he wasn't my server. But as I said more than one employee I witness something should be done about this immediately. The decor of the place was not that great a bit drab. You would want to be a lot more alluring if you're trying to get the ambience. This place shouldn't even get a three-star from me but I think I'm being gracious because I did like the crab. Will I try it again not this place no way Jose."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOGUzaEl3EAE",
            "text": "Cannot say enough good things about this place!!! For any negative reviews- IGNORE! This place is truly phenomenal- I visited all the way from Denver! Everything was fresh, seasoned to perfection, and delicious! Will come back every time I visit NY. Must have the crab rangoons and fried chicken! And the best part was the SERVICE we received!!! 10 star service!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNcURsc19sdmZqYTlRRRAB",
            "text": "This place used to have great service, but today, 05/18, the service was absolutely unacceptable. The server was not attentive without our order nor our needs,  did not provide us any water and sauces, and rushed us to order our food before the last call. The server never came over to ask us if we needed anything else then when we called him out on it, he argued with us because we informed him that we provided him with our order but he was having a conversation with other patrons about the war instead of providing the service we deserve. Prices have also increased from $85 to $90 per person and $118 to $125 for lobster all you can eat and with fewer portions. It is completely unacceptable, and I will not be returning to this establishment."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbXE3RDF3RRAB",
            "text": "I have visited this crab house twice now and the food has blown me away each time. Everything is so fresh, succulent and flavorful. My friends and I felt like royalty being brung food so fast, hot and with great service. I love the passion fruit lemonade/ tea mix. My favorite items were the fried lobster, fried shrimp, calamari, spicy shrimp, crispy sea bass and the scallops. The steak can also be honorably mentioned. If you’re from Philly this location is closer at about an hour and 20 mins without little traffic. This location also has more available parking and better views! I will be returning!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd1BLbFp3EAE",
            "text": "food tastes amazing. service was great! the food came out fast and fresh! i recommend the peach lemonade too! the seafood tastes like an asian fusion cuisine."
        }
    ],
    "reviews_count": 81
}