{
    "name": "Paul's Daughter",
    "place_id": "ChIJZR42yDVEwokRML_1BjiFxCc",
    "grid": "BK13",
    "address": "1001 Riegelmann Boardwalk, Brooklyn, NY 11224, USA",
    "rating": 4.1,
    "user_ratings_total": 686,
    "phone_number": "(718) 449-4252",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trd1NraDRTbE41U1c1bGVrTkJaMUZrYzJoUmIwRRAB",
            "text": "OMG, it’s an AMAZING place! Their lobster rolls… absolutely delicious."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMFFrRm9TVmh0V1RCT05VNUZObU5oUW5KQmNXYxAB",
            "text": "Plants and lighting make this place feel just right. Eating well here doesn't cost much. Their food exceeds expectations. The staff provides outstanding attention. Visiting this spot was a smart move!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNGJqUkZaRmQ2VUc1UU9GWTVVMnRrWlRoaWVrRRAB",
            "text": "We ordered raw clams and fried shrimp.  Great food and very reasonable prices."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tod09WWnJWVWx6ZURCR1ZGbzNaMDFhZGw5U2RtYxAB",
            "text": "Iconic Coney Island vibes! A fun spot right on the boardwalk with a wonderful bartender who makes everyone feel like a local. Great drinks, lively energy, and unbeatable people-watching."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWVIyUkJkM2xCWDNGcU9ISmFaMlp6TlhsaVdtYxAB",
            "text": "I came here because I’m a massive sex in the city fan, but instantly fell in love with the food and atmosphere. The margaritas are to die for and a new staple to my Coney Island experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTFlqQkVXa2xGTlZSdVJIaEdjVmxWUzBaaE0zYxAB",
            "text": "Just an iconic location. Sitting on the Boardwalk having beer and lobster roll on a sunny September afternoon from Pauls Daughter is just the best thing going."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MWVGaFNNSFp3WkRsNlV6TjBWRTFrTkdOS1IyYxAB",
            "text": "Delicious and fresh clams! Friendly staff and fast service. Nice spot on the boardwalk."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTVVrOHpRa2REV0U5VFFXSnpWR1owUm1relJGRRAB",
            "text": "Good ice cream 🍦 !…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tac2JFczJVR2szVUd0cWEweFBVWEJwZGt0UExWRRAB",
            "text": "Amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oc1NEVmtWREJtZGxGcmVVbHRhMFpoTkhSTmVWRRAB",
            "text": "so rude"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQ1V6TkJhVEZRY0V4Wk1VMHdlVlIwUzBKeU4xRRAB",
            "text": "Great spot and atmosphere. Local gem on the boardwalk."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seFVXa3pla0oxVkROUmFIVlhUMkZ3U2s4eGFuYxAB",
            "text": "Stopped by while at the beach for some seafood and drinks. The lobster was fresh and tasty, definitely the highlight. Cheeseburger and fried calamari were decent, and the drinks were pretty good. Overall a nice casual spot to grab a bite and enjoy the boardwalk vibe."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMlZIUnFjRkJGTkZsRE5HaGZTbWt5VVcwMGRIYxAB",
            "text": "One of the best lobster rolls I’ve had anywhere in the world (homer in paris, street food in montauk also incredible). A touch of citrus and chive perhaps contributing, plus the butter grilled roll. $26. Right along the boardwalk/beach. Rest of the menu may not be as good. Burger, fried calamari or clams, etc."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSk1XUXhNbWM0WTJwNE4xWkhYMjFyT0ZKNVJsRRAB",
            "text": "Stopped here for a  cold beer - a Modelo black and Modelo Especial while walking the boardwalk and a strawberry margarita. Hubby tried the raw clams.. his review \"AMAZING!!\". Good play list 🎼🎶..friendly staff!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNVMwZDJhRlYyYjFoVFV6SnBVRzlqUVRGaU5GRRAB",
            "text": "Not only is this the best food in nyc, its\nthe ONLY good food in nyc!!! I travel 3-4 hours per day to stock up on their burgers, clam fries, hot dogs and sausage peppers, i travel and i bring them home to my grateful and hungry family. I do not eat from any other establishment under any circumstances."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nM1YycEJZazV0T1VSaGNtNVJTMEZqV1ZWemJWRRAB",
            "text": "Refreshing fruit punch on a sunny August afternoon. They have plenty of other stuff to try."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMk9HOW5aa2xrYjFoSE5VTnhTVEZzZW10eGRtYxAB",
            "text": "Pshhh one of the better seafood spots in south brooklyn."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGV01HZHFhR1p6VFRoWGF6QXdjM1pzZW5OVmIyYxAB",
            "text": "I go here for the raw clams... Cherry Stones and Little Necks and the beer on tap... Always delicious and refreshing. FYI.. go to the side bar where the tables are at and make your order if the front window has a line..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkT1kzUXhYMjE1TURNeWFHdGtPRk5QWlc5WlgwRRAB",
            "text": "Best lobster roll uve ever had.\nGreat fries and breaded clams as well"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wbk9VTTFTak5ZTm01M1pVNWZTRWREV214MVRIYxAB",
            "text": "Lovely."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRFdGRnNVbGhNUjNodlJEZEdSRVZxUzJjNGVIYxAB",
            "text": "Great place to grab a beer and fries."
        },
        {
            "date": "3달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWVRsVkdRVTkzVlRONU5rRjVhbUpoVHpSdVRWRRAB",
            "text": "Superfreundlich, schneller Service, vernünftige Preise. Gute Qualität - Corndogs & Pommes sehr lecker"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taM0xWbHlPRUpYTjJGQ1NYZzFOMHBZUmxGc1kyYxAB",
            "text": "Pretty good lobster roll but the portion is so small and it’s $26. The meal can go up to $35 with regular fries and a soda"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa1JFVlhPRWRhZVdwSGJrb3phVlF4TFRaaGVHYxAB",
            "text": "Staff is friendly"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVlZYWTNURXBJTkdoMlgxcHpZVmxvVWpjNVgyYxAB",
            "text": "Prueba comida rica en sabor y experimenta lo mejor de Conie Island"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xd2QycHlRMDgwYUU5dE1GUlFVR2haZHpNeFUyYxAB",
            "text": "Crunchy friends and tasty chicken tenders. Good price"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsT1ptNUpNM0JHWDBSVVpHZEpWRXRXVHpSNmRGRRAB",
            "text": "It's the best in very laid-back vibe! The bartenders are spectacular and of course you can't beat The View"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRek1tczJhV3BVVlZWdE0wSmhkWFF0ZW5CUmFXYxAB",
            "text": "🐚 Boardwalk classic vibes at Paul’s Daughter 🐚\n\nStopped by one of the oldest boardwalk gems — Paul’s Daughter at 1001 Riegelmann Boardwalk in Coney Island. This place has been feeding beachgoers for decades, and now Tina (the original owner’s daughter) keeps the tradition alive with those iconic signs and old-school flavor.\n\nI grabbed their lobster roll — fresh, buttery, perfect — plus some crispy fried calamari to chase it down. Nothing goes better with the ocean breeze and a cold beer than this.\n\nWhether you’re craving clams on the half shell, a classic hot dog, or just a piece of Brooklyn history, Paul’s Daughter still hits all the marks. 🦞🌊\n\n#ConyIslandEats #PaulsDaughter #NYCFood #LobsterRoll #BoardwalkStaple #foodieinthebigapple2025"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNGRsaDJZbXhzVEZReGFXSjJUbkZ1TmpSaVZuYxAB",
            "text": "Food was definitely not worth it. Lobster roll was small, tasteless, overcooked  tasted like they dunked it in water then put it in the bread roll. The bread was the best part of the roll. Calamari was tasteless and rubbery, undercooked. No seasoning. Fries had no seasoning and was unsalted. Tenders tasted undercooked. Hamburger was the worst of the bunch, it's like they just heated up the tiny frozen burger patty and slapped it into a bread roll- portion small and taste fully absent. Would not return nor recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSllWQTVWa05GY21OWFVteENibDl6TVV0WmNtYxAB",
            "text": "Fries were great. Fried shrimp wasn’t that good. Nice looking restaurant on the boardwalk/beach tho"
        },
        {
            "date": "4달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210d2FrbHFaa1pRTWxsMFRUQkVkM2cyUmxaQldrRRAB",
            "text": "Très belle endroit sur la jetée de coney island, très typique avec des prix attractifs!\nJ’ai testé le fameux lobster roll a 27$ il est très bon et dans un bon pain bien brioché, mais est ce que cela vaut son prix je ne sais pas.\nJe recommande pour l’ambiance style dinner et le fait de pouvoir s’assoir avec une super vue sur la mer ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVE1YRnJNRzk2TUc5TlJUTmpkVXBYWWpCcVdWRRAB",
            "text": "10.49 for a flatbread pizza. this whole time i could have just went to target"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVFdVMUZOM0pHWVV4TlZYVjVibVZ4Tmtoc2IxRRAB",
            "text": "Best bar in Brooklyn!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdUxXOHRhMjF2VGtwS00ySkRZM0l6Um1WQlZYYxAB",
            "text": "Paul’s Daughter – Classic Coney Island Vibes\nStopped by Paul’s Daughter after a day at the NY Aquarium with my kid—and man, it hit the spot. This place is like stepping into a time machine full of good food, sea breeze, and summer energy.\n\nWe got the hot dogs and fries—classic, no-frills, and fire. That snap on the dog? Perfect. My daughter devoured hers and asked for a bite of mine like I wasn’t starving too 😅. The lemonade? Ice cold and real-deal refreshing. You can’t fake that boardwalk flavor.\n\nIt’s loud, it’s crowded, it’s chaotic—but in the best way. It’s the kind of place that smells like saltwater, funnel cakes, and childhood memories.\n\n🌊 Dad tip: Grab a spot at the edge of the boardwalk while you eat. The ocean view makes the ketchup stains worth it.\n\nRating: 8.5/10\nNothing fancy—but that’s the charm. If you’re at Coney Island and don’t stop at Paul’s Daughter, did you even go to Coney?"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaWVXSlJlRXA2VUVSemFUSTFURmRZVGtSdFRrRRAB",
            "text": "Surprisingly the food is very tasty and fresh"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5T2VVTjJNVWwzUTJsd05VWkJWamRWV2tFeE1YYxAB",
            "text": "Horrible pina coladas"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ad2IwVjRkM2RUZFRkNGMzcEhWMFpDTnpCeVNVRRAB",
            "text": "They have the BEST CHEESEBURGER on the boardwalk bar none.  Absolutely!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacVRYWklRMHhuTFZKRVdrTkdlRVpYT0ZsTVlYYxAB",
            "text": "Those little neck clams with hot sauce, horse radish, cocktail sauce and a squeeze of lemon always a winner. Can't get it wrong."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kR1FVVldlWGt4VDJKWGEwZzJTMU5uTmtGc00zYxAB",
            "text": "Love their knishes are delicious, my family also loved the chucjen tenders."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213eWNtcHhXRUpsVTIxQk1ucE5SRWx1VG5jd2ExRRAB",
            "text": "Can't actually review; hours aren't as posted on the linked menu site or on Google maps; can't correct the hours since I don't know when they're actually open"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMTDdtN3JobWJhV2pBRRAB",
            "text": "This is the only place to find knishes anymore, and they were delicious. Order it with onions and throw some honey mustard 😋 the bartender Gabriel was so nice and the rest of the food was good. There's plenty of outdoor seating, definitely worth checking out!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPX3l0ZlhUX2FtdFZnEAE",
            "text": "Mariscos al pie de la playa."
        },
        {
            "date": "4달 전",
            "language": "de",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQTEgzNGJKcXF6OGd3RRAB",
            "text": "Um Himmels Willen Nein.\nDer Cheeseburger war ungeniesbar und geschmacklos, zudem waren die Pommes kalt."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOU3BySTZJb2FPQ0hREAE",
            "text": "Tasty lobster! Get your food quick. Kinda windy that day and had to hold all the paper plates and plastic glass"
        },
        {
            "date": "4달 전",
            "language": "fr",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQdUh4N0xHMGVfcW5BRRAB",
            "text": "Mon premier hot dog à NYC. Quelle déception, un pain avec une saucisse, cher, et sans le sourire des vendeurs."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVd2FqbEp3EAE",
            "text": "네이선 핫도그 짜서 한입먹고 다 버렸어요. 요기 깔라마리 튀김이 정말 감동적인 맛🙊 여러분 꼭 드세요 꼭이요 😭…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLUx6TEhhcTlPdmdBRRAB",
            "text": "Paul’s Daughter is a family-run spot, now operated by the original owner’s daughter, offers a nostalgic slice of New York beach culture. ￼ ￼\n\nThe menu is a classic lineup of boardwalk bites. Fresh seafood, juicy beef franks, hamburgers, cheeseburgers, and savory Italian sausages. Pair them with hand-cut fries, crispy chicken tenders, corndogs, or a hearty knish. For something sweet, enjoy funnel cakes, fluffy cotton candy, creamy soft serve, and refreshing Italian ices. Wash it all down with a cold beer or a frozen margarita.\n\nPaul’s Daughter exudes vintage charm. The casual, divey ambiance is complemented by outdoor seating that offers ocean views, making it a perfect spot to relax and soak in the boardwalk vibes.  ￼\n\nWe ordered the corndog, fries, and a cheeseburger, each one was absolutely incredible. I’ve never had this kind of comfort food taste so good. Honestly, I could’ve gone back for seconds of everything."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOHZYMXhnRRAB",
            "text": "It’s a great area and vibe to sit down for a quick bite. However, the portions are small for the prices they charge. Our favorite part were the fries but the fried calamari wasn’t battered and was missing that crispy exterior you’d want. Some weren’t even edible and were tougher than a piece of leather. The lobster roll was very tiny for the price we paid. And the drink was in a kiddie cup for $16! The tenders weren’t terrible. I wouldn’t recommend spending money here unless you’re grabbing fries to snack on as you walk. The actual food is just not worth it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJazltUmRBEAE",
            "text": "My favorite restaurant on the boardwalk, as someone who actually lives in Coney Island, I love Paul's Daughter ❤️‍🔥 The staff are excellent, the food is perfect seaside eats and the prices are fair. Come here for the best seafood on the boardwalk 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6X2ZmMGZnEAE",
            "text": "Nice place with tasty food and great boardwalk views! Food is mainly fried, fries were really yummy though! Lobster roll is $24 which we opted out of trying. Overall nice spot for grabbing a bite and a beer while enjoying Coney Island."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzLU5MTTJ3RRAB",
            "text": "Tasty fast food choices on the boardwalk. Burgers, hot dogs, fries, fried clams, more fried food choices, ice cream, and more. Right on the boardwalk, so there is a nice view of the water and amusement parks. Various birds will come to the seating area in the hopes of grabbing a bite. Service was pretty fast to receive food. Numbers are received to pick up the order. I would recommend. This was the only restaurant today on the boardwalk at the beginning of lunchtime. Glad Paul’s Daughter was open!"
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX01XYWhnRRAB",
            "text": "Großes Restaurant mit langen Verkaufsbereich am Boardwalk von Coney Island in New YorkCity. Es gibt einige Sitzplätze am Verkaufsbereich. Gute Auswahl an Speisen und Getränken."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMXRpVGhBRRAB",
            "text": "I have gone to Paul's Daughter several times to get food and drinks while walking on the boardwalk. The service is fast, and the food is pretty decent as far as boardwalk food  goes. The prices are on the expensive side, but that would be expected in this area.  I recently got the Lobster Roll, and it was quite minuscule for what I was paying at $24, but it had a good taste and was juicy. They have several tables for outdoor seating, but not enough for large crowds. They also have a small bar area as well.  Overall, I have never had a bad experience here, so I would recommend anyone visiting to check this place out."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNaVgxY1dCdW92Sy13RRAB",
            "text": "Ok food. The lobster roll wasn’t worth the $26 we paid at all. Nice view to the beach tho"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcWZpS013EAE",
            "text": "The fried shrimp were delicious! I was very skeptical to order them. I usually find fried shrimp overcooked. These were absolutely delicious, melt in your mouth- and it wasn't heavy with oil. My daughter had chicken fingers and fries, both were super tasty as well. Coney Island has a lot of fried food options so if you're going to go for fried food, come here. They also have a raw clam and oyster menu which I'll try next time. Plus, the drinks are reasonably priced (beer, wine, and cocktails)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcV92NlNBEAE",
            "text": "My Go To Bar whenever I’m in Coney Island 🏝️.   Drinks are delicious, lobster Rolls🦞 was great, one of the most chill relaxing atmosphere on the boardwalk , and the atmosphere is friendly and clean.  Definitely recommend Paul’s Daughter bar"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPcEx5NjV3RRAB",
            "text": "I love this fresh clams!! It’s the best in nyc. The clams price are only $17 for dozen. Also fried calamari was great taste.\nWe arrived there at 11:30am, however they didn’t open yet. They opened at 11:40am. Fortunately we could order soon shortly after they opened. Otherwise you will be a long line."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbkxUaHl3RRAB",
            "text": "Always stop by Paul's Daughter for lunch after a walk. Definitely the best Chicken Tenders & Fries on the boardwalk ! They could definitely use additional seating outside since it gets very crowded but doesn't stop us from grabbing a quick lunch !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwak8zZlBBEAE",
            "text": "Title: A Culinary Voyage Through Time at Paul's Daughter, Coney Island — ★★★★★ (5 Stars)\n\nI recently had the pleasure of visiting Paul's Daughter in Coney Island, a beloved institution serving fresh seafood since the 1950s.\n\nI was immediately struck by my table's beautiful views of Coney Island Beach. The soft murmur of the ocean waves and the gentle hustle and bustle of the boardwalk created a serene dining atmosphere.\n\nThe menu at Paul's Daughter is as colorful as Coney Island, but the seafood is the show's star. I savored their large fried shrimp and Cherry Stones clams, which were fresh, flavorful, and incredibly satisfying. These dishes reaffirmed what many Google reviewers praise: Paul's Daughter's top-notch quality, deliciousness, and value for money.\n\nThe service at Paul's Daughter was swift and professional, and the staff was warm and welcoming. Even though they don't offer spirits, their curated selection of beer and wine perfectly complements the diverse menu.\n\nFor those driving in, it's wise to factor in some time for parking. However, the minor parking quest is a minuscule trade-off for the gastronomic and scenic rewards that await.\n\nIn essence, Paul's Daughter is more than just a place to eat. It's a voyage through Coney Island's illustrious past, a canvas of culinary art, and an embodiment of beachside relaxation. Whether you're seeking the finest seafood or yearning for a tranquil spot by the beach, Paul's Daughter is the answer. An absolute must-visit!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPRDNrdjYzd1oyZFdREAE",
            "text": "Paul’s Daughter is a charming spot that perfectly captures the essence of a beachside eatery. The atmosphere is laid-back and inviting, making it an ideal place to unwind after a day in the sun. The menu offers a delightful variety of options, from fresh seafood to classic burgers."
        },
        {
            "date": "5달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMU20wTmZVa29XN0pnEAE",
            "text": "Banchetti di legno all'aperto con ombrellone, proprio sul lungomare del luna park a Coney Island (che purtroppo dirante la settimana era chiuso! anche se google e sito stesso del luna park scrivevano fosse aperto...). Bel panorama, posto carino e semplice, ma cibo OTTIMO! Pollo fritto e fries strepitosi, così come gli hamburgher, assolutamente da provare se siete in zona."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OWJPR3NnRRAB",
            "text": "El lugar es lindo, y lo mejor es sentarse a disfrutar un snack y bebida frente a la playa. Tienen un menú variado, los helados también están ricos. El personal es amable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdTRPbG13RRAB",
            "text": "I sell raw burgers with a raw cutlet, I went up to the manager and said that they are raw, he doesn’t say it’s normal, I say look at the blood in the cutlet, he says it’s juice, I say it smells like raw meat, he says it smells like beef, in general, he gave it to him, he says you I ate half of it, he says, I won’t return it, the fries are normal, this is the last time I ate in this cafe, I’ll tell all my friends and my subscribers. In the end, I left the burger to the manager and left."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGaXE2OGl3RRAB",
            "text": "Delicious lobster roll. Yes, it is $24, but you get a large portion of lobster compared to other lobster rolls I have had. A simple buttered bun really puts the emphasis on the lobster, which shines. Went on a late October morning.  No crowds. Beautiful beach views."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaHNueEt3EAE",
            "text": "In my opinion, their lobster rolls are the best in the city, and possibly even in the world.\n\nThe rolls are packed with succulent, juicy lobster meat, which is cooked to perfection and served with just the right amount of seasoning, so as not to overpower the delicate flavor of the lobster. The rolls are served on a soft, buttery bun, which complements the lobster perfectly, creating a taste sensation that is simply out of this world.\n\nPeople are friendly, view is gorgeous, prices are accommodating. Must visit!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMZnY1WmVva05Eb05nEAE",
            "text": "Its on the beach!! Great atmosphere! It smells at the bar. Like its never been cleaned. Really bad. But its right on the boardwalk and have plenty of seating. Good staff, i like them."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NTZ6S0lBEAE",
            "text": "I waited for 2 orders of fries for more than 20mins. It seems like they skipped my order to do other orders. I asked twice for my order, because they ignored me the first time. This rating is for your improvement. Thank you."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOZkxrYVBSaU5qZnBRRRAB",
            "text": "Venden el famoso sanduche de langosta, que para ser sincera si tenia bastante langosta pero muy 27usd de ahi aros de calamar, camaron frito y demás, también helado y bebidas alcohólicas y no, se pasa bien xq se come frente al mar, pero cuesta."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldTV6a0V3EAE",
            "text": "Paul’s daughter gives you a great boardwalk feel that you can never forget, the food is great but could be a bit pricey after a few bites of different foods that taste great! I would say come here for there corn dogs and fried shrimp!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUMmJ1U3dnRRAB",
            "text": "I loved the options they had but I just wanted a slice of pizza and a beer. It was great. There is a sitting area in front of it or you can eat/drink in the bar. I loved the vibe and I'm definitely coming back."
        }
    ],
    "reviews_count": 70
}