{
    "name": "La Cantine",
    "place_id": "ChIJY3SV72ddwokRP1FK0G3VnG4",
    "grid": "BK4",
    "address": "60 St Nicholas Ave, Brooklyn, NY 11237, USA",
    "rating": 4.6,
    "user_ratings_total": 375,
    "phone_number": "(917) 652-4556",
    "reviews": [
        {
            "date": "21시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweE5HeDZhVlYyVkdFelVVRjZaSFZuT0Y5S1JVRRAB",
            "text": "just no, I wouldn't recommend. prices and take out is crazy once i saw they box the parfait rather than put it in a plastic cup is what made me say this isnt it."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eFRWSjRjblp6Y2tkdlJrdEpSRnAzTmxKMVNGRRAB",
            "text": "UGHHH TOO MANY GOOD THINGS TO SAY! TRY IT, ITS THE BEST. Wait time worth it, trust me. I would eat here everyday if I could!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Jd1h6bDJkVEZ4WVVsM1MwbFZabGRQWkMxS1lXYxAB",
            "text": "Prices are ridiculous and the portions are tiny. These gentrified cafes are ridiculous!! This tiny parfait bowl was $14 and there’s barely anything in it. And a $10 for a simple no frills coffee….and the nerve to have a tip tab for the barista on DoorDash\n\nGo to a real diner or cafe cause this place ain’t it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TU16VkthRjltWkhoTFRrRndhMDkwVDNwdVVtYxAB",
            "text": "Had this place on my list for a while - every day their Insta stories break my heart for seeing what I miss here! And they didn’t disappoint. We ordered the vegan chickpea sando with extra egg and a special: spicy lemon drop + basil chicken cutlet sandwich. Also a tiny raspberry cakey treat and the pecan pie for takeaway. Everything was divine, super fresh, super creative, super colorful and flavor bombs. I wish I could go every day since they have new specials daily! Also the drink menu is not to miss - the date oat milk shake was so goooood. Only downside: it tends to get a little chill since there’s a lot of people going in and out. But it’s a busy place for a reason!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVVkwMUNORWhyUlRKZmIxaERNMVp3Tm5wdFlrRRAB",
            "text": "Genuinely one of the best meals of my life, kudos to the chef."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdVpVMU9hMlpoUjJwd2MzbHVRM2M0ZEc1alVYYxAB",
            "text": "Unassuming corner. We didn’t know what we were getting into… maybe its better at dinner but we went for lunch and it was stuffy, rude staff, and even though you order at the counter they added an automatic 20% tip to every order as if they were serving you at the table. With no discussion. The food was ok. Overpriced."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbU4xVTVkMVZDU1VWeVJ6WmlTREpKVUU1V1JGRRAB",
            "text": "Great food, great company, great memories made here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Nelgya3RaazVaYlhOYVZsOU9lSEYzTTBJd2RHYxAB",
            "text": "This was my first stop for food in NY, I love the goblet dessert bowls and all of the food selections. They were serving raspberry tiramisu this week, and the ribbed corn was to die for. I came here again for one of the breakfast sandwiches but I wasn’t too big on the colder items and pastries that were open for display. Definitely go for freshly prepared items :) This place is perfect for a quick bite. I will be returning when I’m back in NY!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNk4xaGpVRTFtZUdZMVVHOTRSVmRsYTBOalgzYxAB",
            "text": "Beautiful little spot with outdoor seating. The menu changes weekly, but such a cute spot to come to eat and share food with friends. All of the staff are super friendly and the energy of the place is really sweet! The chef Natalie is also the best!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeU5tbDNOVkZxVVVnelFURnVMVWRHYkhOc1VrRRAB",
            "text": "I decided to treat myself to a solo date at Cantine after drooling over the photos that they post on their instagram of their desserts. Truly one of the best meals I have had in a long time. The menu is definitely more ideal for groups of people to share with each other; however , i ordered the fettuccine and it was the perfect size for me! I love how fresh the menu is and that it changes with seasons. This just makes me want to come back!!\nI ordered the pasta and it was cooked perfectly!!! Not too heavy and the tomatoes were delicious. If you don’t order dessert honestly you literally missed the stars of this establishment. I had the stone fruit tiramisu and WOWOWOWOWOW is it insane. I mean how does one even think of such a thing? Divine."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNFRtcDBTazE0VDFwNGFHeGtSbU00YnpCb1YzYxAB",
            "text": "Amazing food and drink selection. You cannot go wrong with anything on the menu. Great portion sizes as well. I cannot wait to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVVZUWk9hRW95YlhVM1dESkhTWEYwZFZsaWRYYxAB",
            "text": "My son and I shared numerous dishes from the dinner menu and they were all divine!  It is our new favorite restaurant!!!  We are going back for brunch tomorrow!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU1RUQTBOelZuWVVkSmVFZHNiV3BPUVdwSE5YYxAB",
            "text": "What a pleasant surprise. A place with a sign that says Brooklyn Grocery. The breakfast sandwich I had was so good that it compelled a review. The eggs were fluffy, the combo of hot honey, onion, bun and egg was delicious. Also had a fig tart that was delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFZqVm1OR3RUVDFWUFUxWjVXV05MUzJvd1pGRRAB",
            "text": "Great for Brunch. No table service, but the food came quickly. Outdoor seating is nice. Cold brew is 8$ but they basically give you a whole jug of it.\nThe food was delicious but uncomfortable to eat. Still 5 stars, cause I liked it but I was struggling with the overstuffed chicken sandwhich and the tiny bread it was on."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNE1UaHRTelZyYVZWMVZIYzRjMEZCY21KcVpFRRAB",
            "text": "This review is based strictly on ordering the baguette sandwiches. We did not have any of the other items. Came here for 'breakfast.' Very over priced for an underwhelming baguette with sliced cheese. Coffee was OK but not great compared to other options in the area. The baked goods looked delicious. The service at the counter was friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ob1FUSlBMVFYyTFdGSVRWQkpUbE5aTjAxSVRGRRAB",
            "text": "Great service and ambience. Food was also tasty and flavorful. Tried their chicken parm sandwich that was recommended and loved it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUlMzWlBhbFpYZVVJM1gwczBhMDlRUjNOblNXYxAB",
            "text": "Terrible customer service. Canceled my order"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMWREbGlObGR6VjA1TExVeDNUMlJGWVdoemIyYxAB",
            "text": "this was $20 lol"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMmJHVTFOMkZxT1ZKUGJVMXlhVFpST0VaMWFtYxAB",
            "text": "such a cute place! amazing food, tried the quiche and one of the chicken cutlet sandwiches. both were excellent, but i was especially impressed by the sandwich (the bread was incredible!). will definitely be back, perfect lunch spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UVJuQlVUbkZJU2tGUlluSmtjRGxIUm01cVJsRRAB",
            "text": "Best Arnold Palmer I’ve ever had"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NGRtUjVjM05vT1dnNVRUWnNVMWcwVmpSek5sRRAB",
            "text": "So unexpected and delicious!\nCame with a friend. Got the biscuit bacon, egg and cheese sandwich. It was sooo messy and so delicious...give me 14 please!!\nAnd the chocolate chip cookie was 🤤"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNWRHdHZVME5LVUd0eGNFVlhPREZoUm1JNU9GRRAB",
            "text": "Best brunch and pastries in Bushwick, hands down. Great sandwiches, great coffee, cute little place, ok sometimes it gets overwhelmingly busy and the servers get a little grumpy. It's ok. I forgive them."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUlpGRk1WbE5vZUcxaGRFMW5Ta2t3YjFCMVdrRRAB",
            "text": "Amazing sammiches"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NVpWZDZPVE5uV1VOdVYxVldNRGRpTFhFNFNVRRAB",
            "text": "The chef and the server who work here are soooo cute and the food is delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRU5ESXlhbUUyZUdzNVNISmFXVGxIU25RNE9GRRAB",
            "text": "Just do yourself a favor and go. Either during the day or at night, the menu is incredibly inventive and comforting. Tapioca bites are to die for. Staff is kind and attentive, one of my fav spots in Bushwick."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWk5VNXpka0V4U1hGbWNFZFdWVzlSTFdsNFozYxAB",
            "text": "Sure! Here’s a shorter version:\n\nGreat vibes and even better pastry.\nFriendly staff, cozy atmosphere. The pain au chocolat was perfectly flaky with just the right amount of rich, sweet chocolate—not an afterthought like most places. Will be back!"
        },
        {
            "date": "3달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTVNsbEZYM1Z4YkVsMWJEUmZka3h6Ym5oMGVuYxAB",
            "text": "店内は手狭でガヤガヤしているけど、外席があるので、天気のいい日に最適。お料理はどれもフレッシュで、重すぎず、フレーバーのバランス、塩気、全てがいい塩梅。シンプルだけれどもなかなか家では作り出せない味わいかと。"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201YWFrdHliRlY2UVhKMmFsbzRjbTl0YVdSeFMxRRAB",
            "text": "Cozy atmosphere with a great menu. Every dish we tried was full of flavor and beautifully presented."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKa1oxQlJVbnBvVVVsNFpHZG5aV3BQTm5WR2FVRRAB",
            "text": "Delicious Chicken Cutlet sandwich"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0VGNYZFJlbU0zWTFsQ1RtSkliM1pvVUVwS09YYxAB",
            "text": "I love the food here! it gets super crowded so I usually just get delivery. but it's so tasty. I love the salads (especially when there are cranberries) and they are great topped with a cauliflower cutlet. I also love the cauliflower cutlet sandwiches and the baked goods. I've eaten at Sunsets like five times and the food was also really good. but it is usually pretty loud in there. also my bf wishes they had regular wine glasses but he is snobby. the staff during Sunsets is really friendly :) highly recommend this place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RFNFMHhXWEo2UjJGdU1XdDFTM2RxY1VKdE4xRRAB",
            "text": "🥰"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RemMzbzFTRFJDUm1RdFkyZGlZVFpYTTJwMFFWRRAB",
            "text": "It’s rare to find such consistency in both food and service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJLS10bzNfbDZ2YXN3RRAB",
            "text": "Food was eh atmosphere was lovely. The raddichio on my sandwich was too bitter and not balanced with anything"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJeWo4TS1vd01EbExREAE",
            "text": "Cute little spot! Loved the coffee and sandwich,  the quiche was pretty good also!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKNkF6c0dobUpxY09BEAE",
            "text": "Most unfriendly staff and it takes 30 mins for them to put a premade salad in a to go box. I came here 3 times this week trying to give it another go and each time really poor interactions."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQ0k3YWZIeDVmeUR3EAE",
            "text": "legit never misses. only flop ever were those green lamp fixtures"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZVJuZEhUb1lyMFpREAE",
            "text": "Probably the best cafe by day, restaurant by night in NYC, no joke. Everything they do is top notch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMTFo0dFRsak5TVVBBEAE",
            "text": "the chicken cutlet sandwich!! I should try more stuff here but I always just end up getting that bc its so good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd3NpalR3EAE",
            "text": "Great place for lunch and dinner for special occasions — pastries, sandwiches, and beverages are spectacular. Chic interior and nice service too, and I really appreciate the seasonal menu, keeps things fresh and exciting every time I visit!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbGRTdDBnRRAB",
            "text": "The food was demonstrably fine, but suffers from the very French problem of too much fuss in exchange for too few calories (especially considering the price).…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeUxIMEVBEAE",
            "text": "Avoid this terrible place with overpriced sandwiches and really hostile servers. When I placed my order, they said there was a 25-minute wait to be served. When I opened my laptop to do some time-sensitive work while I was waiting for the establishment to serve me my food, they said they have a no-laptop policy, even if they are making you wait 25 minutes, and go on the sidewalk in the misty cold if you need to use the laptop. I wasn't occupying a table; rather, only a stool on the side. I had to cancel the order and they didn't refund my tip even though they didn't serve me the sandwich. There are better places around with kind and friendly wait staff."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc1lYQUZBEAE",
            "text": "It's hard to say which is better, La Cantine or their dinner service, Sunsets. Luckily, you don't have to choose. It's always excellent, exciting food, and warm service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3Z3Ftc1l3EAE",
            "text": "The food was just ok. Not a great value. Good people watching everyone was young & beautiful, well dressed and impressively accessorized."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3LUtqVnpnRRAB",
            "text": "La Cantine nails it every time, breakfast, brunch, lunch, pastries that are out of this world. But “Sunset edition” there? A whole different level. The food, the vibe, the energy, just perfect. Huge thanks to Ioana and the team for making it so special. Of course, no pictures we polished our plates and Can’t wait to be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdklMUFlBEAE",
            "text": "Took me half an hour to get a basic sandwich"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMU1uQjdnRRAB",
            "text": "I’ve been to La Cantine many many times over the past few years. The staff is always lovely and on TOP of things. The food is always incredible. Very high quality ingredients and amazing flavor combinations. Tonight I had a scheduling snafu and had to change my reservation to a bit later than originally scheduled (reader, do not do this, it’s rude), and the staff was very accommodating. When we got there our server was an absolute delight even during a busy time at the restaurant. We told them we had booked a reservation post-dinner at Ayat just to get the Earl grey and passionfruit tiramisu (and some wine, of course). They also recommended the forced rhubarb pavlova. We were stuffed, but took their suggestion and were AMAZED by how delicious it was.\n\nI go to La Cantine when I need a solid pick-me-up meal and it never disappoints."
        },
        {
            "date": "8달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX3FmQ0ZnEAE",
            "text": "Belle découverte en se promenant dans la quartier pour le street art.\nCuisine savoureuse, service agréable avec une équipe qui travaille dur.\nDes sandwichs, des salades, des pâtisseries tout y est !\nRestaurant qui vaut le détour dans une ambiance de vie de quartier fabuleuse à découvrir pour s'immerger en tant que touriste.\nSeul bémol, le temps d'attente car l'établissement est victime de son succès."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbTUzekNREAE",
            "text": "Every bite at La Cantine was incredible. Good wine and even better desserts. Their dessert chef is a genius."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOHZybG5nRRAB",
            "text": "The best spot in all of Brooklyn for breakfast, lunch and dinner!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndV9yMzhRRRAB",
            "text": "shoutout to Jessica u served vibes in addition to the perfect tasty lasagna give her a raise 💅"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMXJPOVhBEAE",
            "text": "Always such a wonderful experience! The most amazing and sweetest servers make it so that I always want to come back. Incredible food, my partner and I shared everything and left feeling so full and nourished. Great wine, beautiful ambiance, couldn’t ask for more! A real neighborhood gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib2RlRFFBEAE",
            "text": "This French-inspired food is spectacular. The portions are perfect to try a couple of their dishes and share. The chef will course your meal based on your order. I fully recommend getting recommendations from the servers. Our was wonderful and explained everything to us. Great wine selection!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcGNmS01nEAE",
            "text": "Absolutely delicious food! Everything we got tasted amazing. When we were done with eating, our server felt so bad that their menu desserts were sold out that she sent us home with a slice of orange olive oil cake, on the house. We really appreciated the gesture."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdWVlT093EAE",
            "text": "Cute spot. I came here for a super quick dinner for two. Unfortunately, I didn't have a lot of time to sit and enjoy the menu, but we did love the bread and ramp lasagna. My red wine was good, as well.\n\nAlso, I really liked the staff that night. Very friendly and accommodating when we had more people show up out of the blue, so thanks for that!\n\nWould love to come back when I have more time to enjoy the food. Please keep that earl grey pavlova on the menuuu!!! I need it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENXNQMHNRRRAB",
            "text": "Have only been in person twice but have ordered delivery multiple times since and have never been disappointed! Everything I’ve tried has been phenomenal - the chicken cutlet sandwich, the crispy potatoes, the olive oil cake (orange and lemon flavors), the lavender latte, and the Arnold Palmer. Delicious and consistent in quality. Only started eating here in January and it’s become one of my favorite places already. Plus the space itself is small but they make good use of their outdoor seating, the decor is cute and warm, and they are really patient/don’t rush you out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNk9EbjhnRRAB",
            "text": "The crispy potatoes and jambon sandwich were delicious. We also had the layered lemon cake which was great, especially as the cream on top wasn't too sweet at all.\nYou ordered and pay at the counter, it's first come, first served situation with the tables.\nThere's plenty of outdoor seating too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5ek1tcXdnRRAB",
            "text": "Such a lovely space. Staff are kind and attentive. Have always been a huge fan of their breakfast/brunch offerings, but now blown away by the “Sunsets” dinner series. The food is unreal, and changes seasonally. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeXBhY3dBRRAB",
            "text": "This place is cute and busy, I had a quick stop, with my son last weekend he asked to grab a bite and this is exactly what we did there, we each had the little brioche bun with egg, cheese and bacon $11,50 and black drip for $3,5 kinda ok price.\nI wish there was a slice of vegetable like a tomato or cucumber,  something.....\nUnfortunately their tip request starts at 20% and goes up, relying on you to feel uncomfortable enough!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbVB6bkpBEAE",
            "text": "I came here with my friends on a Thursday evening and it was so incredible!!! The pasta was perfect but most importantly, I fell in love with the warm salad with aged cheese. I’ve never had anything like it before - texture was amazing. Dessert was even better - passion fruit tiramisu ! Service was divine and the servers were very knowledgeable on the cute wine pairings. Need to book this again ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuXzdiOGt3RRAB",
            "text": "How to cook simple and delicious food at the same time? I don’t know but this place does . Plum jam, pistachio mortadella? Yes please. Coming back to try everything."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlX3Bxd2Z3EAE",
            "text": "Omg I stumbled upon this place by chance because I was in the area. When I tell you this is now my favorite cafe ever!! I had an amazing breakfast. I had the poblano sandwich and added bacon, the lemon olive oil cake with strawberry icing and the lavender latte. The freshness, the flavors...talk about my tastes buds having a party!! And to top it off me and my daughter after our meal got two free lavender lattes!! The staff are so sweet and friendly. I wish I could give 10 stars!!! I will def be coming back often."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NTdlOWxRRRAB",
            "text": "La Cantine is by far the best cafe around the Bushwick area!! I’ve gone many times now and I’m always blown away. They have a menu that changes everyday based on what ingredients they have and it’s truly amazing. They have some staples such as the crispy potatoes, egg sandwich, chicken cutlet sandwich, etc. but they have new specials everyday. I love how inventive they are and everything is always so delicious. They really specialize in their cutlets (chicken and cauliflower) and they’re really amazing, served on incredible ciabatta bread. Their drinks are also so good, I love their lavender iced latte and their dulce de Leche iced latte. Also, the vibes of the cafe are so cute!! It’s super 70s modern and it’s a great place to sit and grab food and drinks with friends or alone to do work. Really the best cafe around, check it out!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURub2MtYUVBEAE",
            "text": "This is my absolutely favorite restaurant in all of Brooklyn. Delicious food and warm atmosphere. Just GO! Tapioca croquettes and the Corn Lasagna - make sure you order too much and bring home LEFTOVERS!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcXRlNGN3EAE",
            "text": "Total gem of a cafe. The eats more than match the immaculate vibe here.\n\nTheir specials are always rotating. It’d be a good idea to check their instagram before heading in just so you have an idea of what they are for the day.\n\nWe ended up getting a green curry and cilantro cutlet, Italian special, and the crispy potatoes. All of which were fantastic. The cutlet was saucy and fried to perfection and the Italian special was herbaceous and delicious.\n\nYou must get the potatoes, though. That is a non-negotiable. They are to die."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNzdxSktnEAE",
            "text": "Never had a bad experience here, the service is kind and quick. Their cauliflower cutlet is an absolute must! Love that this winter they have been doing a clothing drive for unhoused neighbors."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cktYX0RBEAE",
            "text": "I got one of their special sandwich - spicy red chili and basil mayo with cauliflower cutlet. Although the basil taste was very subtle, the cauliflower cutlet was battered and fried to perfect, crunchy outside and mushy and juicy inside. There could be a bit wait at prime time and the price is a bit high."
        },
        {
            "date": "1년 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6LXJ2QUx3EAE",
            "text": "サンドイッチが美味しくて、昼はいつも混んでるけれど、夜は穴場。\nワインの試飲もさせてもらえて、丁寧に作られたお料理に感動する。"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkLUptZlB3EAE",
            "text": "Layout/atmosphere\n*Cafe/coffee shop; nine tables; three tables on sidewalk\n\nFood/drink\n*Ciabatta, egg & cheese (organic scrambled eggs, Cheddar cheese, pickled jalapeño & parsley cream cheese, red onion, bacon & avocado) - very good; eggs & cheese melted together perfectly; kick from the cream cheese; good bread\n*Chocolate chip cookie - Good; thin; crunchy exterior, chewy interior\n*Complimentary water cooler"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYc3ZiN3l3RRAB",
            "text": "I got the egg and cheese sandwich with the special house sauce, everything was fresh and delicious! Service was great everyone is friendly and courteous. Highly recommend!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OUx2X0NBEAE",
            "text": "I reviewed cantine a year ago and I’m updating it now - I think the service has improved a lot, and the food IS simple, but i honestly think the simplicity is what makes it shine. The portions are generous and you’re just tasting the great fresh ingredients. The chicken sandwhich is a stand out (I love when there’s a special that puts a twist on it!) and the baked goods are so decadent. It does get extremely busy here but it’s still one of my favorites. Especially in warm weather when there’s extra space outside."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbXZDUThRRRAB",
            "text": "Michael O, terrible service. Would’ve liked this place if it wasn’t for the bad service. This place has been the topic of discussion for the last month or so between my girlfriend and I, we’ve been very eager to make the trip out and try La Cantine. The food was solid but the experience and service was lacking, HARD. Basically forced out of our seats before we even finished dinner let alone had the opportunity to order dessert (which we were most excited for). Michael forced us out mid dinner because he needed the table by 8:15 (Did not see anyone waiting and there were several open tables). He popped up out of nowhere mid bite to tell us we needed to leave and dropped off the check, truly disappointing. On top of the already horrendous experience they had the audacity to call me and complain about the tip!!! Yes I left a very small tip because the service was quite depressing. Tips are earned… stop acting so entitled La Cantine! Safe to say I will never be going back here & I will recommend friends to not waste money at this establishment. Please spend your money wisely."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfanJpTXF3RRAB",
            "text": "Really good sandwich selections with daily specials. Haven’t had any bad food here. The only thing I would improve on is that the food can be a little too heavy sometimes for my taste. The cutlet sandwiches are oily (but really good).\n\nGreat drink selection from matcha to coffee to teas and other drinks. The quiche and desserts are also so so good (I don’t even like sweets).\n\nCute space. Gets crowded though. But always comfortable and pleasant to be in."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOVltbk5REAE",
            "text": "I normally don't write reviews but I just love this place so much. I've gone MANY times for brunch and lunch (amazing sandwiches) and always a great vibe. It can get busy during weekend brunch times, but I've never struggled to snag a table.  Went with some friends last night for dinner and it was a wonderful experience - everything on was delicious, the service was really friendly (and the DESSERTS to die for!) An excellent wine selection as well. Will definitely be back, and again, and again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbGZLZ3V3RRAB",
            "text": "Holy moly! I had the most wonderful experience at La Cantine. The people, both staff and customers, are so damn nice :) and the food is fkn CRAZY good. The coffee is also freaky tasty and I loved it so much. I had the lavender latte (hehe) and the egg/cheese sandwich + avocado of course. We also split the crispy potatoes which were so crispy and delicious. I’m freaking out"
        }
    ],
    "reviews_count": 74
}