{
    "name": "Maite",
    "place_id": "ChIJiyqjDgVcwokRRGqRBulo9kQ",
    "grid": "BK4",
    "address": "159 Central Ave, Brooklyn, NY 11221, USA",
    "rating": 4.4,
    "user_ratings_total": 377,
    "phone_number": "(718) 366-3090",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSFZGSTBVSFF3TUdsQ2VscDVNalF6VFVkSllrRRAB",
            "text": "Some of the best food I’ve had.. The Yuka fries alone have me craving this place. And lovely staff ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TVgwOW1WR1JJTlVsa09ETlhXVzFLTlVOd1VtYxAB",
            "text": "Overall very good but not amazing. I think I was expecting more basque and less burgers and wings on menu. Burrata to me was the best thing I tasted. Limited menu\nThat night when we went. The decor and ambiance I think really adds to the unique experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaWFXZ3lkbTFNYXpORlJIWXpTRUpuZFU1eWVtYxAB",
            "text": "Amazing food and service! Our waitress was incredibly kind and attentive and answered alllll our questions (which were probably a lot)!! Incredible time!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWbDliMXdRRRAB",
            "text": "Perfect place, perfect vibes"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVFdYbGFaMHBqY1ZWdVVrbFhSbkZEUzBWSlRVRRAB",
            "text": "Amazing food and service! Our waitress was incredibly kind and attentive and answered alllll our questions (which were probably a lot)!! Incredible time!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weU1sbzNiMHczTVhacFFWaERVbGx3V2tSMFVWRRAB",
            "text": "This are the best empanadas con ají I’ve had in so long. This is what I called “perfection”"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wck0wMXFMVlEzU0UxTVdqaEtNV0pWT1hacGJtYxAB",
            "text": "Limited but tasty food menu. Hard to call it a Colombian Basque bar, it’d be more accurate to say that they serve bites from different places to reflect the neighborhood. The service was fantastic, for a weekend, and their recommendations on food and drink were excellent. The atmosphere was great, chill and cool. They have a clear voice and purpose and it’s reflected on the decor and space overall. Strongly recommend if you’re in the neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VNSDg0NnpodS02WGFREAE",
            "text": "A beautiful queer spot, but $21 for whipped ricotta and $9 for an extra piece of bread? $30 total—for just ricotta and bread. As a queer Latina, it’s disheartening to feel priced out of a place meant for us. The menu seems aimed at high-income white folks, not the broader queer Latin community.\n\nI’ll come back for the vibe—but only for beers."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOLWNxOFdRMWMtSDlBRRAB",
            "text": "Had burger and carrots with drinks, it was very tasty"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQSHQwcVhrNU5qenF3RRAB",
            "text": "The price of going out was not well spent at Maite…\n\nCome here for a drink — not the food. The only place in the world where you can order a burger for 21 dollars and it doesn’t even come with fries… Is it the tariffs? Could have saved my money on this greasy spoon."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReVppUzV3RRAB",
            "text": "Had my eye on this place for years, moved further away and came back… better than expectations after waiting so long. Great place to go to the bar alone for a treat. Or rendezvous. Lots of details to appreciate."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnZ2NDOTFRRRAB",
            "text": "food was delicious, the empanadita, the gnocchi. the drinks were also pretty good. atmosphere felt lively and the art on the wall had a cohesive theme"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNjZTYmd3RRAB",
            "text": "I love Maite so much, def their empanadas are just my fave and their aji that they pair them with would always be one of my fave condiments ever. Def give Maite a try specially if you love Colombia food and food very guided towards good meat, but thank fully I can bring my friend who are meat less. Their rabbit empanadas just hit the spot in comfort food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcGR5d2dRRRAB",
            "text": "I have been here a couple times and it never misses! The best steak in Bushwick"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYODVXQnBnRRAB",
            "text": "The best, would dine here every night if I lived in the neighborhood. Great drinks, great burger"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubmNEczBRRRAB",
            "text": "Ambitious dishes executed well. Heavy on protein, much like the South American culture it aims to capture. Extremely sex positive decor and atmosphere. Cool, laid back staff. A little pricy, but worth it for the quality."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuXy1QRmd3RRAB",
            "text": "Delicious food with top quality ingredients and exceptional guidance from their amazing staff. Great for sharing with friends or taking a date."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeWJyeWRnEAE",
            "text": "Amazing food at this female owned neighborhood place with great vibe. It’s funky in a good way and all are welcome—no snotty Bushwick thing here. The cocktails and French fries are what hooked me, but try any of the specials or anything off the menu and you won’t be disappointed. Everything is delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cjRPNE9REAE",
            "text": "The food was excellent and reasonable. The price of drinks from the bar were over the top."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURia05UbklREAE",
            "text": "best pf the best staff super nice the waitress at the top super nice I really liked it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibWZxM3JRRRAB",
            "text": "Good vibes. The monk fish is amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyOHFUS3ZRRRAB",
            "text": "Great restaurant for the vibes and the food is INCREDIBLE!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeElhS3BBRRAB",
            "text": "Great fish and chips!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaE1lWWlRRRAB",
            "text": "I like the concept of queer women owned business but the food and the drinks are way too overpriced. $7 for a Coca Cola? $11 for 6 pieces of Yoca fries? Come on this is ridiculous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdzluNW5RRRAB",
            "text": "Good service and atmosphere, but the worst fish and chips I've ever had in my life."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUczhtcWJBEAE",
            "text": "Good food & strong drinks.  Cool ambience & pleasant outdoor seating.  I prefer the yuca fries & burger over the empanadas."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMWJfVUlnEAE",
            "text": "Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdGRXWTJBRRAB",
            "text": "immaculate sunday brunch!! best sweet/savory french toast, colombian coffee, french fries and vibes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURObjdXdWlBRRAB",
            "text": "I don’t know how this place hasn’t blown up yet. It’s an underrated gem for incredible food. We had the squid ink burrata and mushroom raviolis, and it felt like we were back in the quaint, unforgettable eateries in europe. Love this spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNONnEtN2l3RRAB",
            "text": "I came for here for a New Year's Eve dinner with a group of friends and split a several plates. The care of ingredients in food and cocktails was superb especially in the duck egg arepa, which was my favorite.  Though I personally questioned the server's strong backing of the caesar salad, it was delivered on the flavor palette.  I enjoyed the Basque touches on South American dishes a lot.\n\nAs an observer of culture and ambiance, it was fun experience for anyone who appreciates LGBTQ+ community."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOF9YZmdRRRAB",
            "text": "Do not go here. They charged me $30 for each double drinks. Including tips I paid $75 for two. The service was lousy and the atmosphere was that of a merge between a haunted house and an ignorant and mean sorority house. I was harassed by the owner's friend, herself, and her other friend because of gossip and false accusations of me “making other people uncomfortable.\" I asked them how did I make the people uncomfortable and got no answer.\nNo answer! They just said I had to leave and then the owner and her friend made fun of my Versace coat, iPhone, and Versace T-shirt by pointing at them and saying they were used but they were not!!! I bought two women drinks and my final bill that one of them brought to me outside was $69.99!! This was the as previously mentioned, a merge between highway robbery in a haunted ignorant sorority house. I ought to call the police for this overcharging/stealing of my money while harassing me. Don't go here! Unless you want to be haunted and robbed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcU8yQUtnEAE",
            "text": "Really fun spot with excellent food and drinks by fabulous loving caring owners! Recommend anything they offer!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWc2ZQWk5REAE",
            "text": "A very bad experience, won't come back"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWc2QyZHRRRRAB",
            "text": "pesimo lugar  ...."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWNVkzcmZ3EAE",
            "text": "Food is delicious but portions are small for the price and area. The waiter was very rude. To have a real dinner, I recommend Zatar a couple of blocks away, shawarma meal and chocolate cake are fantastic! We went there after having \"dinner\" at Maite.\n\n*EDIT: This review revision addresses the owner's response. Your claim of homophobia is inaccurate; involving authorities would confirm this. Language barrier issues occurred during our visit. Receiving the check without request and the waiter's unhelpful responses were impolite. As members of the LGBT and Bushwick mutual aid communities, it's disheartening to face such accusations."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWcVkzX3VRRRAB",
            "text": "Really bad service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsXzV5ZmtRRRAB",
            "text": "What a yummy gem!! All the food we got was stellar - especially the burger!! I don’t know what sauce they used but it was amazing. Our drinks were also delicious. Service amazing, good vibes. Such a gem - would highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMW9lMHNBRRAB",
            "text": "this is one of the most underrated restaurants in bushwick. i come here all the time… food is incredible, cocktails are amazing and the wine list is a great curated selection of naturals. there are a lot of mediocre spots opening in bushwick that get undeserved hype. if a you want quality food and a really good vibe this is where you should go. chef ella is the best, all bartenders are fantastic"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGejUzN0dnEAE",
            "text": "Probably the cutest, and most welcoming place I've been especially for a queer atmosphere. Our waiter (wish I remembered his name... kevin? john?? matt ? lol) he was THE SWEETEST. I loved how it was an atmosphere for both dates, families, friend groups. The drinks were great, and so was the food! I had low expectations for the salad, but it was incredible -- empanadas too! I enjoyed my time. I admired the walls filled with queer art. I'd love to come back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCLTV2dER3EAE",
            "text": "I didn’t get any photos of the food because I inhaled it so quickly. I will be thinking about the anchovy butter carrots for the rest of my life. The wine selection is also really amazing. Dinner and 2 glasses of wine each for 2 people was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1enRTUTFRRRAB",
            "text": "Really good spot for drinks and a bite. The burger was simple yet delicious. And service was great. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabzZEQ2JnEAE",
            "text": "super cool place. great for a date night where you're both not very hungry. atmosphere is awesome and the drinks are great!\n\nwish we could afford to come here more often! unfortunately there's very few vegetarian options and the meals aren't very big. feels like we need a second dinner at a cheaper place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwc1p2Y1p3EAE",
            "text": "Margot was such a lovely bartender! she gave lots of great recommendations for clubs and things happening close by. Food was amazing. Very cute spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMy16N3lBRRAB",
            "text": "IMO the burger was plain plain and not worth 18$"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbVl6SElnEAE",
            "text": "Great bar/restaurant that can open up their walls! Best decor ever. The burger did not come with fries 😶"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNGN5VFZBEAE",
            "text": "Amazing small local restaurant. Love the interior design. From cocktail to dessert, everything that I had was great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMG96a1BnEAE",
            "text": "Really enjoyed the food and wine at Maite! Top notch restaurant. Mos Def recommend to like minded people."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NHJpMVp3EAE",
            "text": "I absolutely loved this place! The food was AMAZING! My drink first drink, the “Dykeuri,” was soooo good! I didn’t enjoy the strawberry rhubarb margarita as much as I thought I would. Everything we ordered was delicious. That focaccia was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NzlfYUNREAE",
            "text": "Went with a group of friends for a bachelorette party weekend. The ambiance was perfect for us. The food was great (maybe a tad pricy). The empanaditas were fantastic."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NTVmWVBREAE",
            "text": "This is just an AMAZING restaurant and bar. I loved it so much and I will go back every time I go to Bushwick."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtemFyeUx3EAE",
            "text": "So delicious and playful! I really enjoyed every dish with the black burrata being a stand out! Be prepared to order extra bread just to scoop up the amazing sauce. Service was attentive and drinks were yummy too. Happy to support this business!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNteVBiTE9REAE",
            "text": "I went back in June with my cousin and their partner. Best meal I have ever eaten. Textures, flavors, drinks were all perfectly made. The service was wonderful by how helpful and kind they were. The decorations and vibes were chill and aesthetically pleasing. Uniforms were non-bianary. The food was served family style, so everyone can get a taste of everything.  10/10 Would definitely go back again. Love the vibe"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeE1tYmJ3EAE",
            "text": "Maite wins you over with their dim light, late night bat vibes, filled with LGBTQIA+ art and posters. The empanaditas (filled with ragu when I went) were very good. The burrata negra lacked a little oomph, but the focaccia was delicious.…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbXNlY0FnEAE",
            "text": "My first time to Maite was by mistake- and wow was I bewildered and in love by the first bite. The empanadas are prepared so finely that by the second time I came back I was slowly savoring---closing my eyes, yumming and humming aloud. Also ordered the buffalo mozzarella and pizzete. We weren't told the buffalo would come with bread (which was amazing) so by the time the pizzete came I was already full and didn't eat much of that dish. The passion fruit mezcal is super fresh and hits the spot. Our servers were very knowledgeable and professional. This place is a hidden gem of NYC!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvZ2R6RHVRRRAB",
            "text": "Just finished dinner here with my partner. We loved the pork belly. The marcilla sausage arepita was delicious. The gnocchi were very soft. We will have to try the rotating menu again sometime!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwc1luUXlRRRAB",
            "text": "Went here last night and it was amazing! Basque and Colombian restaurant. The food changes from time to time so the server suggested that we take a picture of the menu and the drink menu to share with our party of 6 people since we were on the other end of the menu. We decided to order the following from the attached menu picture: (4) empanaditas (1) duck egg (2) Burrata (1) lasagna (1) pork belly (1) gnocchi with truffle (1) shishito peppers and (2) chocolate cakes (12) drinks and tip included, it came out to $407 for $68 per person. All REALLY good in my opinion but everyone loved the empanaditas. The duck egg was okay but our least favorite. Not bad for a Friday night dinner from 9PM - 11PM. Quick service and great environment."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDaC11cXhRRRAB",
            "text": "Just ok. Food was pretty good, but the prices don't match the quality. Almost all mains were over $30. Food wasn't bad but it should have been priced $10 cheaper. For this price point, there are better options. Service was friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCXzllNllBEAE",
            "text": "Decent enough, food on the pricey side.  Ordered the lamb chops with greenpeppers, $45.  Chops were delish, but fatty.  Yuka fries had a fishy after taste.  Attentive staff, I'd come back with friends for cocktails."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxcHRhNV93RRAB",
            "text": "Incredible food, wine and ambience. Server Ray was incredibly knowledgeable and kind. All their recommendations were excellent. Incredible experience, big thank you to the staff at maite"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNUtqSU5BEAE",
            "text": "superb foods, service, vibes … my son takes me here every visit to Brooklyn . owner-operator from Caldas, Colombia"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcmJUTWtRRRAB",
            "text": "I came here for dinner the other night - great vibe, variance of food quality.\n\nI shared orders of bread, pork belly, lamb chop, and empanaditas.\n\nEmpanaditas: very good! The meat inside was delicious!\n\nPork belly: pretty good, but SO overpriced for the quantity.\n\nLamb chop: not the best, in my opinion, but my partner seemed to like it. Also overpriced.\n\nBread: the bread was actually super good, especially with their special butter spread over.\n\nWith that said, we ordered about $50 of food, but left still slightly hungry. Likely won't come again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyOGMzVTFRRRAB",
            "text": "Maite has the best food.\n\nAs a Latin I hold high standards for Chicharrón and empanaditas and Maite’s are the best.\nSo crispy!!! So tender!!! with fresh ají 🌶\nTheir farm to table magic always surprise with new flavors!  Natural wines only 😍\nYou feel the love and quality  💕  Top service!\n\nBest brunch in Bushwick! 💃🏻💃🏻💃🏻"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dHQyLTZ3RRAB",
            "text": "Incredible meal and service! The chicharon is a MUST - best I’ve ever had."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcXJpemF3EAE",
            "text": "From the first time I went to Maite, I knew I would become a regular here. I've enjoyed many brunches and dinners here, and have not been disappointed. The food is consistently fresh and delicious, the cocktails are imaginative and tasty, and the staff is always accommodating. Chef Ella prides herself on creating a warm and welcoming environment, and on the quality of the ingredients she uses, and that shines through with every visit.\nI recommend the place to everyone I know!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbHNTUHB3RRAB",
            "text": "Precisely and smartly prepared dishes. For example, the cheese flan had a lovely blueberry liqueur that actually brought a scent of blueberry and a fine, almost crispy caramelized bottom."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoeHN6dzdnRRAB",
            "text": "Nice vibe and amazing service. Food was not great and slightly overpriced. Drinks were perfect.\nAs I understand this is a place that has Colombian inspired food and was looking forward to tasting a little bit of home. Went for dinner. I got the chicharrón and it was mostly just the fat and a tiny arepa, some beans, yuca fries. My friend got a really nice vegetarian dish they were able to accommodate so that was great. Maybe my choices were not the best of the menu  and there’s more delicious things."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0cHRDRkV3EAE",
            "text": "The service was fantastic, and the vibe inside was great. The food itself was good, but exorbitantly expensive. The food did not blow me away by any means, and was certainly not worth $100. My girlfriend had a #30 fish plate with morels --…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxcnRPR19BRRAB",
            "text": "OVERPRICED! I rarely write reviews.. but I thought this one was necessary. There are loads of good reviews for this restaurant and that’s why I went, but honestly.. the food isn’t worth it! Really disappointing.. the price doesn’t match…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2anRlc2NnEAE",
            "text": "One of my favorite restaurants in New York. They have a rotating menu of inventive delicious dishes. I don't think I've ever had a dud here and I've gone many times. Everything is unique and delicious. Love the ambiance and staff too. Highly recommended!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjNXVHdFZ3EAE",
            "text": "Absolutely delicious, everything I’ve tried. Amazing burger, yucca fries, cocktails... the list goes on. Used to dine-in BC (before corona) but ordering for take out is just as good! They accepted Venmo payments so even though I ordered…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyOGZIekdnEAE",
            "text": "What an amazing spot. Chef Ella and company deliver top notch food every time. Service is great and on point. Make sure to reserve a table and order what you can because the chef changes the menu often that reflects the farm to table experience maite strives for throughout the year.  Do yourself a favor and go!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwbmFtazF3RRAB",
            "text": "My wife and I went there for our anniversary dinner looking to have a very nice meal in a chill environment. The staff seated us at the table next to the restroom with a loud speaker while there were three huge communal tables open (those tables remained open the entire experience). We asked to move where they placed us in a high top next to the bar. We could barely fit so we eventually waited for seats at the bar. The menu seemed great..we went with the pork belly, mushrooms and gnocci. Pork belly was good but very big for two people since it's so fatty/oily. We were looking forward to the mushrooms (hoping for no something fresh), but they were underwhelming in flavor and again pretty oily. The gnocchi was a nice portion,  but they were in a bed of butter. Maybe we ordered the wrong items. The tastes all blended together and by the end we couldn't handle anymore fat without the flavor. For $150 on three items, we felt more taken advantage of rather than taken care of."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLN2VUcFhnEAE",
            "text": "So far, I have visited Maite for cocktails/snacks and then for a late Sunday brunch.  Both times the servers were friendly, the drinks solid and the food amazing. I want to try everything on the menu.  Stand-out dish so far is the pork belly.  Can't wait to go back."
        }
    ],
    "reviews_count": 73
}