{
    "name": "Tina's Place",
    "place_id": "ChIJjb24TgFcwokR0wxarefXPS0",
    "grid": "BK4",
    "address": "1002 Flushing Ave, Brooklyn, NY 11206, USA",
    "rating": 4.5,
    "user_ratings_total": 1103,
    "phone_number": "(718) 497-6890",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMVNqTXdTbGczWkVaQ2EzaE1jbUZOUWkwNGFtYxAB",
            "text": "The best of the best! This cash only diner serves delicious and fast breakfast and lunch items. Love coming here and getting the simple Tina’s breakfast. Cant beat the prices"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ZmRUTlRUM1p5WmtOT1F6bFNPRGRMYWpoVlluYxAB",
            "text": "I love their food. They only take cash but there is an ATM inside."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaE1YWTFjMFpKTURZM1JFeE5VekpQYkZSSWJrRRAB",
            "text": "Costco mix waffles and microwaved tenders\n\nI threw all this up at the 9/11 memorial an hour later and everyone looked at me weird"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oM1pISkxia2xyV0d4MFkzRmFkWHBhZEhGdFNWRRAB",
            "text": "BEWARE! SAME PLACE - DIFFERENT OWNER .\n\nThis is the 4th time I’ve come to Tina’s Place during listed business hours and been refused service — most recently at 1:45 PM, even though the posted closing time is 3:30 PM. The inconsistency is unacceptable.\n\nOn top of that, the food is not what it used to be — portions feel tired, and the taste is nowhere near as good as it once was. A big part of what made this place special was Tina herself, her warm smile and welcoming presence. Without her, the atmosphere has changed completely.\n\nThe current staff are rude, dismissive, and barely communicative, making the whole experience uncomfortable. A diner with such a long history should treat its customers better. Unfortunately, Tina’s Place has lost both its charm and reliability."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweVRsTTVNR28xVUMwM1JsRjRUSFl6TmtaaFpuYxAB",
            "text": "Great neighborhood staple!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eFJrZG1hV2w1TVZKNmFFVk9hV0Y1U1RZd2VIYxAB",
            "text": "The food was very good and the service was exceptional."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbmMyWk9NRTE1WTFrME4wWTRNbFEwV0ZNM05FRRAB",
            "text": "This place was awesome! The coffee was hot, the corned beef hash was delicious, the over-easy eggs were nice and runny (the way I like them), and the Mexican music was loud!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUFdHcGlZVlkwV0c5SU1rZERVM0ZyWTNCWlZVRRAB",
            "text": "I walked in at 1:45 p.m. they were closing at 3:00 p.m. and they rush me to order my food I was fine with that but when I see another people walk in and didn't get the same treatment I didn't like that"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTWIwVnZTWHBNTkROV01sOHhPRFZRUVhFMlQwRRAB",
            "text": "Just left here for a quick and easy Sunday brunch. Don’t listen to the weird reviews; this is a very solid spot. Not a Bedford Ave, line-out-the-door-for-a-waffle-photo place. Just a great neighborhood diner that is truly and honestly retro in everything from the wood paneling to the $11.50 breakfast. It’s lovely."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUE1rVkdUemxWTFhKTVQwbEdibU5pWVRGcmNFRRAB",
            "text": "Order home made fries with bacon, I told them repeatedly please to make the bacon extra extra crispy. What I got was soggy bacon instead of. When I complained about it I was told and I quote “slow down mister, I have a lot of orders”with a lazy nasty attitude. I would never order from here again and definitely don’t advise or recommend anyone to eat here. If I could rate 0 stars I would."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcmJ6VlRURFJqWW5NNE1FMTFVVzA0WVRoTGIyYxAB",
            "text": "I liked it. Breakfast was cheap. I got the simple breakfast. If the hash browns were less soggy and more crispy, this would be my favorite diner."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoaVRtZFRObFZIYWt0NWVuaFpTblJwTkd0WU5rRRAB",
            "text": "I came here because my wife said this was the spot to come to. What she didn't know is that it had different owners, same name. Eggs had a funny taste. Home fries tasted watery and not what I usually get for home fries. Bacon tasted like cardboard. Sorry, but not sorry. I am honest in all my reviews."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRWNUaFJUbEpxVTNKTGNuTkdZVU50TlRGVllYYxAB",
            "text": "Food used to be so get and affordable.\nBut today I ordered the service was great but the food was meh blueberry wasn’t so great home fries absolutely no taste or flavor what so ever highly disappointed. The waffles where so good but the chicken with waffle definitely not worth it 4 mini chicken wings like you’ll give it to your dog"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMWVuTnVPRkJGTmpaWlpUbHRRemgyUkZWaldGRRAB",
            "text": "Food underseasoned."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwN3NyYVJBEAE",
            "text": "Tina’s is a go-to, whenever I’m in NYC. Love the place!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWGJFWXdUbk40U1hJelptTmhSakJyY0ZRMFJYYxAB",
            "text": "Good local food place. Been in the neighborhood a long time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNGVYWk1WVzlhYWpaTFdVUjVWM2xPZDBWdVMxRRAB",
            "text": "Food is ok, solid and good flavor for the most part. The host was so rude to all the customers. Ruined the experience for me. Servers were very helpful and nice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJTFF0THU3dnBXWnVRRRAB",
            "text": "One of the few real diners in the area."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdXh6ZDZFNEpUZ253RRAB",
            "text": "Love Tina's place, it's a really good value diner in Bushwick."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJaTV3TS1aNmRuQWpRRRAB",
            "text": "I’ve been coming here for years and all I got to say is when Tina and her boys were there it was different: the new staff charged me 1$ for each to-go container: grabbed the bill and changed the price right in front of me after I packed it myself; 48$ for corn beef hash coffee and waffle deluxe w a muffin is just crazy to me for the service and ambience. We don’t even get any bevs so 50$ for two basic meals? we left 60$ but won’t be back ."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaTZYdVR3EAE",
            "text": "Tina's Place has always been constant in the neighborhood, good comfort diner food -- you can't go wrong with anything you choose here. I always order way too much...! Sometimes I order a corner muffin to go, but not this time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveDVubFJBEAE",
            "text": "It was great, I stupidly didn't know it was cash only but there was an atm. The food was good and the place was clean, prices weren't too bad either."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdWFXRTdBRRAB",
            "text": "Good food, good service...nice quiet atmosphere.."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MVBxWjl3RRAB",
            "text": "Super friendly service and huge portions!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bWJlMlRBEAE",
            "text": "Food and service is always good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NnRIU3dnRRAB",
            "text": "Keep Tina’s how it use to be!!! Tell my why 2 coffees and omelette and a Tina’s simple breakfast was a total of 40$ before tip."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbFpfOXZnRRAB",
            "text": "Food was really good and staff very attentive."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbk5hY0NBEAE",
            "text": "Got charged one price on the phone and another when food was delivered."
        },
        {
            "date": "8달 전",
            "language": "sv",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc2FPbEdBEAE",
            "text": "Mysigt och trevligt bemötande. Vi tog en club sandwich och en platta med hamburgare ägg stekt potatis och toast. Smakade gott och vällagat"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncXFTZDZ3RRAB",
            "text": "10000000/10\n\nMy happy place ❤️\n\n(cash only but ATM there)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM2FyX1N3EAE",
            "text": "Really goood!! Highly recommend it. Their shrimp taco is insanely good"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndEplaFlBEAE",
            "text": "I’ve been a loyal Tina’s customer for 20 plus years and since Tina has left and sold the buisness food quality and service has been awful. I’ve been several times since ( trying to give them a chance)and have found hair in my food on multiple occasions (no one wears a hairnet/hat), eggs often come back raw, paid for extras without getting it, prices have increased/more charges for less food and the costumer service needs improvement! This use to be a staple in the Bushwick community, with a welcoming family/at home feel for generations and it’s sadly declined, it doesn’t feel as welcoming as it once did. This was one of the few places that “ old school Bushwick” had left and a true sense of community. Unfortunely after several attempts to like this new place I will have to look for another breakfast spot. MISS YOU TINA!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncG8ySWFREAE",
            "text": "Amazing homey atmosphere, quick service, and great food for the price. Recommend getting here before 11, as it fills up quickly on weekends!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBamF2N2tRRRAB",
            "text": "This is a fantastic Mexican restaurant with a warm and inviting atmosphere.\nThe food is authentic, flavorful with a great variety of dishes to choose from.\nThe staff is extremely friendly, attentive, and always ready to make you feel welcome. Whether you’re here for a casual meal or a special occasion, the excellent service and delicious cuisine make it a great choice. Highly recommended!🥰"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMXF6RHJBRRAB",
            "text": "Best diner in Bushwick. Whomever is cooking the food is fast as lightning."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMEppWmxRRRAB",
            "text": "My favorite diner."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZ05IdmZREAE",
            "text": "I fking love Tina’s so much. It’s literally like one of my favorite places in the city, bc it’s feels like home. It’s just so cozy and the atmosphere is perfect for a classic diner. The service is great and the food is incredible. Best breakfast food / diner food out there!! ONE THING, bc it’s so great there usually is a wait on weekends. But it usually goes by quickly and it’s definitely worth the wait :) 10/10 I love Tina’s"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdk1IS0JnEAE",
            "text": "Amazing"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmM01uZnBBRRAB",
            "text": "Cozy spot, cash only. Enjoyed the waffle"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmai15cTNBRRAB",
            "text": "Great spot for the classic American style diner. Staff was so friendly and accommodating. Prices were right and the portions were big! Can't wait to go back again."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2anRiNGhRRRAB",
            "text": "They need to use /buy better quality eggs and give more food"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNGJQTWlBRRAB",
            "text": "Legendary greasy spoon, perfect hangover spot… don’t judge… like someone else said the locals & the transplants here all mingle and it’s great"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuOTRPZjZ3RRAB",
            "text": "The only food place that got my money more than twice in Brooklyn. Meals for less than $12"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMWIyX2lRRRAB",
            "text": "Excellent service. I was blown away. They seem like great people"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOG9PdnV3RRAB",
            "text": "Ein toller Ort, um günstig lecker zu frühstücken"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcExhS3hBRRAB",
            "text": "Typisch amerikanisches Frühstück."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubmN1OTlRRRAB",
            "text": "This is one of those classic diners you hope never goes away but are always afraid they're gonna get priced out. They are dirt cheap and they deliver exactly what you'd expect out of a diner. Just get your basics and enjoy a simple life for a moment."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzOEpLU0R3EAE",
            "text": "A great place for an American breakfast. A little family run business which has been in Bushwick for the last 50 years. The place is quite busy but service is very fast and efficient. Prices are very cheap, they have great breakfast Menus.\nThey have a very big variety of omelets, pancakes, waffles and awesome fresh orange juice. The place is simple but has a great vibe, the perfect place to fill up your batteries before you head out.\nWill definitely come back when I am in the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkekktNVR3EAE",
            "text": "Proper local diner / luncheonette, Tina’s place is full of locals and a few Bushwick hipsters and it’s been there for decades. Great vibes. Food is delicious American diner fare, would highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwb3VXSnJ3RRAB",
            "text": "This place has the feel of an old school diner. No frills diner with good food. Corned beef had seemed like it was from a can but still good. Potatoes cooked with onions, bell pepper, and a tomato sauce need salt but that was a minor fix\n\nServers were very attentive and did well.\nNot bad for the most important meal of the day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0bnNEX1lBEAE",
            "text": "A perfect diner: kind people, simple menu, great service. I also enjoyed the hometown ambiance. Hot chocolate was a nice surprise with chocolate chips ❤️"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvMlpfQnFBRRAB",
            "text": "This place is absolutely fantastic. It opens around 3am and closes at about 4pm. The only diner-style breakfast place in the neighborhood. Tina herself is pretty much there every day and she keeps the coffee coming. A standard breakfast…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnb2Q2MDRRRRAB",
            "text": "Needed a cheap breakfast to nurse my hang over from a crazy Brooklyn night and Tina's was perfect!! It's a tiny little diner but very personal. The food I would compare to a home made Dennys. Could have used more seasoning.. But was still…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbTRLQzl3RRAB",
            "text": "One of the old school dinners that still got left in Brooklyn.\nEverything is exactly the same like it was 20 year ago, basic food , burn coffee, the hall thing .\nIf you like old fashion dinners, you'll love this place , just don't explain to anything fancy.\nPrices are really cheap, but the service is really slow, so be patient and take your time .\nEnjoy !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bGNxTkhREAE",
            "text": "Omg the best breakfast I had in a while. Been going here since I was young and the food is still consistent. Will return asap."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteE1QczZ3RRAB",
            "text": "Tina’s place is an awesome no-frills spot that has an old school feel. The staff are friendly and the food is very solid. It’s cheap and delicious. They have classic breakfast staples on the menu and the vibes are great. Cash only, but there is an atm inside. The bacon is great and everything was perfectly cooked. Love this spot."
        },
        {
            "date": "수정일: 5년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwbkxiYm13RRAB",
            "text": "El servicio es bueno , la comida está más o menos , los precios $$ , la cantidad que sirven podría ser para compartir , los platos le quedan chicos a la cantidad de comida que sirven .…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNHVQamdBRRAB",
            "text": "Layout/atmosphere\n*Greasy spoon diner (in a good way); wood panel walls/wooden benches; eight seat counter; 12-13 tables; one table out front on sidewalk; cash only\n\nService\n*Good\n\nFood/drink\n*Mexican Omelette (Avocado, tomato, jalapeños, pepper jack cheese) with potatoes & toast - good\n*Pancakes (short stack) - good"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMmJPd05REAE",
            "text": "Je pense qu’on a fait l’erreur de prendre des burgers qui ne sont probablement pas le plat de référence de Tina’s.\nLes assiettes de brunch me semblent bien supérieures en qualité."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhOTRlY1F3EAE",
            "text": "Absolute staple to the neighborhood\n\nWhether you’re here after going out all night or you’re wandering in early morning for a good affordable breakfast with hood comversation...this is the spot!  Been visiting here for 7 years now and it never skips a beat"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuZ2V1YTdBRRAB",
            "text": "Cash only! Bang for your buck and a killer breakfast platter. Absolutely a perfect neighborhood diner"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVemZQaEpREAE",
            "text": "A great neighborhood gem with cheap prices! Be warned weekends are PACKED. Otherwise the people are nice plus free coffee/tea/juice with your meal before 11AM"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaVl1WEd3EAE",
            "text": "the staff is very nice! I didn’t have cash with me and the boss said that I could bring the money another day ❤️ he also didn’t let me leave hungry\nGod bless your business 🙏🏽"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxblBDR1pBEAE",
            "text": "Nice diner. Good food. Will be back.\nFYI - The breakfast special prices went up."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNbF9takhREAE",
            "text": "Classic diner that’s been there more than 40 years! Food is really good and the service is quick! Everyone is nice and you feel like you’re part of the family. I would go here again for breakfast all the time. Make sure you bring cash as its cash only."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMklXMmFnEAE",
            "text": "Very delicious diner food. We loved the crispy yet soft butter toast! Very friendly staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M19qRVVnEAE",
            "text": "I know Tina's for 15 yrs. Till today, No Tina's anymore. You not gonna  see her, now is 15$per 2 eggs w toast and home Fryes.  Terrible coffee.  I can paid 15 for see the pic...."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeHByTWx3RRAB",
            "text": "Auténtico bar en el centro de Brooklyn con servicio de café! El plato \"Peinao\" con tortitas estava espectacular!\nDesayunar aquí es toda una experiencia americana!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1Nl9xUC1nRRAB",
            "text": "Tina’s place is my Father’s favorite place for a traditional breakfast!  I am happy to be here with my Father today.  Celebrating Life!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dmYzbHdRRRAB",
            "text": "I’ve been coming here regularly for a while because of the lightning fast service, amiable staff, and consistent food. Def not the place to get adventurous (i.e. I got the meatloaf this past time; don’t) but an utter joy for diner staples, especially breakfast. A great choice in a pinch or with limited time; you can conceivably wrap up here in <20 minutes, start to finish."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4OTlDS05REAE",
            "text": "Tina’s screams mom & pop shop. Really cozy breakfast spot something you’d see in an old mob movie lol. The foods pretty on point I was hesitant on the coffee but the guy convinced me to get the iced coffee and that was also great.…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdDlPSkxnEAE",
            "text": "I know that the economy is bad for everyone BUT $14.50 for this is a bit much for 3 CHICKEN STRIPS and soggy fries ! I wish Tina had never sold her place 😔"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaHF2dEF3EAE",
            "text": "An absolute hit every visit. Food, service and atmosphere is ALWAYS consistent. Easily our number 1 breakfast spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNweF9lY2x3RRAB",
            "text": "Very reasonable, delicious, classic diner food. Tasty meatloaf but the omelette is the real deal."
        }
    ],
    "reviews_count": 74
}