{
    "name": "Maloya",
    "place_id": "ChIJma2fX15dwokR4N39k_xbPIY",
    "grid": "BK4",
    "address": "983 Flushing Ave, Brooklyn, NY 11206, USA",
    "rating": 4.8,
    "user_ratings_total": 184,
    "phone_number": "(718) 290-9925",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bFVXRlhWVVpUU0V4emVFbzJkamxWYkhVek1YYxAB",
            "text": "About as mediocre as can be. It's like going to the home of someone who can cook enough to follow recipes but not enough to think, \"Is this good? What does it need?\" There's no vibrancy."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQ00yZFVTRzE0ZGkxUk5reGhUMUV5V1RSWWMxRRAB",
            "text": "Everything was solid and reasonably priced! Definitely among the more unique restaurants in the neighborhood. The flavors and vibes were cozy, hearty, and comforting. Particularly well suited for a NYC winter.\n\nStandouts were the salted cod balls and unexpectedly the lima beans!\n\nI took a star off because even with the rather limited menu, three of the dishes we wanted (an app, main, and dessert) were not available for whatever reasons. Given that there were only two other customers at the time and we went only an hour after opening, to me, this speaks to some mismanagement. I don’t know if this is usual or not but would be willing to give this place another try."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMmRVRjJUMk51WTNwMFkxUnZTSGhNWjFKc1NrRRAB",
            "text": "Absolutely incredible! Food is delicious, fresh, and I think I found my new favorite cocktail in the world here!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sd2JHcGZhRGRPTURkSWFqTllObTV3WVZFMFluYxAB",
            "text": "My favorite restaurant in the city. Get the coconut vanilla shrimp. Unbelievable. Also, the cocktail menu is very creative, unique, and full of great options.\n\nI love Maloya"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cVFXdGlabU5HYmxaQlNVdzFWRlpPU0VwYVUzYxAB",
            "text": "delicious aand nutritious! daaaamn dat lamb was the jaaam! will definitely be back! also highly recommend getting the salad with goat cheese as a starter. ps: looking forward to trying the chocolate&goat cheese dessert!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTVVHbENkVTloUzJoeVowMWthV2s0UlRGcmVVRRAB",
            "text": "The shrimp and lamb were delicious and tasted very warm and homemade. Don’t skip on dessert, the corn cake was very good with some of the freshest ice cream I’ve had. The service was also really good, I recommend this place for a casual dinner!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3M1JubDVNWFYyVEVaV1JUbFljREJ0TFdsWVkzYxAB",
            "text": "Extremely good food feels home cooked. Also the cocktails/liquor are very unique."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STlZWRXdOa3RhWWw5MWQxSnZkbEE1Tlc5a1dHYxAB",
            "text": "My boyfriend and I are visiting from Portland, OR, and the friends we're staying with pointed us in the direction of Maloya. Our meal was absolutely superb. From the moment we sat down until the moment we walked out the door, we enjoyed our experience. The food was excellent and the service was personal. We got the appetizer platter (don't skip the salt cod fritters) and the braised lamb, which was spiced and cooked to perfection. We wrapped up our meal with a pineapple corn cake situation topped with homemade ice cream. I would have uploaded photos, but we demolished our food before I got the chance. Maloya is certainly in the top 3 meals of our trip."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnM1JrcEdVME13TW1oUGVGVk9OR3B4Tnpka0xVRRAB",
            "text": "Giving this place 5 stars for the FOOD - everything we got was tasty but also quite unique and memorable French creole cuisine. We loved the samosa app dish, and the pork belly / coconut shrimp entree. The food legit took over an hr to be served which given there weren’t that many other tables busy was really a excess long time"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTmJ6UjBOVVJzYldnNWJXSk5jV0UxZEVsZllXYxAB",
            "text": "I held my daughter’s baby shower here. Samuel exceeded my expectations! The food was served family style at every table and it kept coming till everyone was totally full. The staff walked around with Mimosas and soft drinks so effectively no one had to ask for a drink. I highly recommend Maloya for dinner\nOr a special occasion you may want to celebrate. You will be pleased!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dGQxRlBha0pqUjFaeU5tOWtOVTlYUm1sMWVHYxAB",
            "text": "Excellent spot with great vibes and good friends, would recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUlNXczJObGRNY1dSdVQxWlZjRmQxYzBkdGRIYxAB",
            "text": "The food is outstanding!! The owners are so kind, all of the staff is remarkable. A true neighborhood gem."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNlRtSXpSM0JrUVhOUFFqVTRWMkphZDFsVllrRRAB",
            "text": "Kindest people, amazing food, wonderful drinks my favorite spot in the neighborhood"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UVltazVWa1ZzWTNGb1JtZFZkREZ0Umw5MWJYYxAB",
            "text": "Maloya was my chosen spot for a birthday gathering for me and my party of 8. We called in advance for a reservation with no trouble and got seated right away once we arrived.\n\nThe interior of the restaurant transports you to Reunion Island, away from the hustle and bustle of NYC! The walls are adorned with landscapes of islands and mountains that you can find in the vicinity of said island which added to its calm and soothing ambiance.\n\nService-wise, the restaurant seemed a little understaffed as it took about 20-30mins to get our orders taken, with waters following soon after. We ordered drinks first and then food, a bit worried that our large order would be taking some time. However, we were pleasantly surprised to have our food and drink served not too long after placing our order. Unfortunately they were out of the pork belly and the stewed beef dish.\n\nThe appetizers and entrees were all delicious! We got one of each appetizer, the shrimp, swordfish, sausage, and lamb leg entrees. The swordfish was nothing short of fantastic, with great flavor and savoriness. The sausage and shrimp were tasty as well, with the sausage having a mild yet deep flavor. The lamb leg sauce was yummy as well, but the meat proved to be a little tough and overcooked. Appetizers were delightful as well holding perfect crisp and crunch. A small note is that the entrees could have been a bit hotter, as they were near cool when they arrived at our table.\n\nOverall, while my party and I enjoyed the food and atmosphere, I think this place is more suited for small parties as the portions are not exactly family style. I recommend this as a good date night spot or even a quick stop in for some nice cocktails!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT1lrRmtURGRvVGt4ZlIxWjRhbTQwTjNwRWVVRRAB",
            "text": "What a find! Incredible flavors from La Reunion. A true gem. Grab a seat at the bar and transport thyself."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMmJsWnRXa2hKZGpWd1pIUmxWMnBMTFdOc1NHYxAB",
            "text": "Best food ever!!! The service was top notch!! Will be going back for more sorbet 🙂‍↕️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OS0xVaEtaVzVWY1RjM1oxZEdTMVpHYzB0eFFVRRAB",
            "text": "The food was absolutely amazing!! The service was great! Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNk9FRTVZbmR3Tmt4MVYwMUhTakpET1Uwd1JGRRAB",
            "text": "Had the best time here! The food was amazing & the ambiance was cute. Will definitely be returning."
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4T1QzRnZTREpKTW1SUWRucHJSVUZ0VEVwNmMyYxAB",
            "text": "Ça faisait bien longtemps que je n'avais pas mangé des bons samoussas pays comme ça! Il ne restait malheureusement plus de samoussas porc/combava, mais ceux au thon, les bonbons piments et les boulettes morues étaient délicieux. Une super étape tropicale dans le fameux quartier de Bushwick."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUVEzQm5ZWFZvZVU1TldWcHRibGxqV1haNWNYYxAB",
            "text": "I wasn’t familiar with a lot of the dishes on the menu, but I decided to take a chance, and I’m so glad I did! Everything I tried was full of flavor and absolutely delicious. You can tell the food is made with care and tradition. The spices, the textures, the bold flavors, it all came together perfectly. Whether you’re new to Creole cuisine or a longtime fan, this place is worth checking out. I’ll definitely be coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnM1FYWlRaV05EWjNBMmRGOVlaRWwzWlhRMlpGRRAB",
            "text": "You'd be hard pushed to find a better restaurant featuring the dishes of Reunion Island than this one in Brooklyn. But it's also just excellent in general. Great rum drinks. May have had one too many."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMlYycHZUSGhKVXpseWRucGpOa04zVW5BeGNWRRAB",
            "text": "Loved this place! The food and drinks were delicious. Aesthetically pleasing, with great French afropop music playing in the background. Réunion has been on my bucket list to travel to, so it was exciting to find a place that offers some insight into the music and food of the island."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLSFA5TnJ4Nk52MUlnEAE",
            "text": "Shrimp was amazing & shared apps were a great deal"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbUFpb1NCczlIZWd3RRAB",
            "text": "This is a hidden gem in Bushwick. The restaurant is named after a style of music and culture found on a French Island deep in the Indian Ocean. Food is unique and spectacular. Not a single bad thing on the menu and I tried just about everything on my visits! Do not miss this!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMmVqSkZjR2hMZDFJelJFUTJUMVJpUVRKaFRrRRAB",
            "text": "I come from Reunion Island and I am always so glad to come to Maloya to find the true flavours from home!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNck91Y1BVbU9uMmVBEAE",
            "text": "Amazing food as always"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdkJyTkxDeDhqMFRREAE",
            "text": "Really great food and great rum selection."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJemxtcXpraGZyckRREAE",
            "text": "We (table of 4) came here on a weeknight, with about 4 other tables that were seated when we arrived. We waited a long time for the food, and in my opinion the service wasn’t all that great. We asked our server if the food we ordered was enough. He said “no,” but didn’t give us any recommendations on what we should order and we just decided to stick to what we had. I also felt that the mango mocktail was mostly coconut water, and was really really sweet. I had to ask for more limes to balance the flavor. Anyways, on to the food…\n\nWe got the tuna samosas, the espadón, the camarons, and the watercress salad. The samosas were tiny and didn’t have a lot of flavor. The watercress salad ($14) was mostly watercress, with no dressing and the mango on the salad was very minimal. The espadón ($24) was very salty and over/spiced, while the camaron ($23) was sweet but kind of just tasted like canned coconut milk with no depth of flavor. Each of the entrees came with a side of rice and beans that we found were decent. Overall we found the plates unbalanced, and although we were still hungry, we were disappointed by the taste, wait, and price that we decided to pay and take our leave.\n\nWe won’t be returning"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaUthMU9nEAE",
            "text": "Food was fine, but overpriced—especially for small portions. Mid at best. Took a while to get our food, and it wasn’t even a busy night. I came here since I saw the rating was high, and left confused since my experience did not match at all what I expect a 4+ star rating restaurant should have—great food + great service. Personally not recommending this place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcGJ2NnVRRRAB",
            "text": "Been here a few times at this point, and it’s always been great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM0x5MXhRRRAB",
            "text": "Flavors are so good and chosen carefully! Drinks are delicious! Service is great!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvemNMekZBEAE",
            "text": "really delicious! especially enjoyed the coconut shrimp dish and the appetizer platter. quite filling :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJZ01PX2lnRRAB",
            "text": "Homey food, not over powering, which I enjoyed. It is type of a restaurant that you would appreciate to have in the neighborhood. Easy-going with good vibes."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LWNDZTNBRRAB",
            "text": "Awesome concept and well executed. The rum list is extensive and the drinks are flavorful, strong and varied. We had the lamb and the shrimp. The shrimp was sweet and plump, two things I didn’t know I wanted shrimp to be - cooking inspiration! The restaurant is beautifully decorated."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bHRla2lBRRAB",
            "text": "Great food! The place is cozy but too crowded"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdXBLaDJRRRAB",
            "text": "I am from Reunion island and I can vouch that this is authentic Reunion traditional dishes. Great food. Great service. Great vibes."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRN1BHSWFREAE",
            "text": "Fantastic cuisine and great atmosphere. Both the swordfish and the shrimp were excellent."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndk4zQ1ZBEAE",
            "text": "needed to find a last minute change to our valentine’s day reservation and maloya had a table open - divine intervention!! it was busy when we got there (naturally for the day it was) but the host was super kind and helpful and we were seated shortly thereafter. our waiter joe was so great!! brilliant service!! and absolutely lovely decor, so thought out and truly like being transported to reunion.\n\nthis was our first time trying the cuisine of reunion and it was mind-blowing. being brazilian, many of the food combinations and textures felt so familiar to me with the convergence of african & european influences yet with a unique twist of south asian flavors i adore. incredibly unique experience with delicious drinks (the saffron, thyme, and ginger drink was my choice) & infused rums. we had the coconut shrimp and the pork belly & jackfruit, both killer. plus the DESSERTS!! the chocolate and goat cheese tart is an all timer!! cannot recommend enough"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnblB1a0ZREAE",
            "text": "My partner and I went for Valentine's Day. There was a fixed menu which was pretty good for the most part. The appetizers were a highlight, but the saltfish fritters were too salty. The main course was the swordfish and lamb leg. Both were a bit too salty, but still delicious. The desserts were below mediocre-- mostly dense and dry (the almond rum cake and corn cake). The flavors were great, but they need to refine the desserts. They were also obviously cut earlier that day and put in a fridge which probably didn't help their consistency. Overall, the meal was pretty good and it was exciting to have cuisine from Reunion. I think there's a lot of potential, but they should refine their sodium levels and the desserts. I also didn't love the fixed Valentine's Day menu because it is definitely more expensive with less food versus if we went a normal night, but that's expected. Pretty good overall and I might give it another shot! Also, friendly service!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMjhPLTZnRRAB",
            "text": "Absolutely delicious! Highly recommend - nice relaxed neighborhood vibes"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBczluMmJnEAE",
            "text": "Loved the ambiance and food! The addicting fromage samoussas, homemade sausage, and deliciously creamy ginger lime ice cream were the highlights for me. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmd2Nia2lBRRAB",
            "text": "At first we were hesitant bc it seemed like it was really slow at the time we went, but to be fair it was a Monday so it made sense. Glad we stayed, because the food and drinks were unbelievably good. We had the spicy tuna samosas, the cod and potato fritters, and the boneless wings to start and all three were amazing and settled it for us to stay. We then had the lamb, beef, and shrimp and once again, to die for. The Shrimp was made to perfection and the coconut + vanilla sauce were refreshing and light, the lamb was cooked phenomenally and the lentils/rice/ and Lima beans were such a good pair for the entrees. The beef was perfect and the sauce and carrots made everything so rich and savory. Ultimately I hate leaving reviews but I sat up at night thinking about the food and had to make sure other people knew what a great experience it was to eat here. Our server was so kind and helpful there was literally nothing bad about this place. 10/10 will eat here again"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNk1malVREAE",
            "text": "We got shrimp (vanilla shrimp mild flavoring and well cooked )  and beef bourgninon (ok -doesnt seem super different than what we have had before) .  Seemingly like others here they also seem to be consistenly out of the meat. Strange"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2emZHTGV3EAE",
            "text": "Yumm restaurant highlight for me was the rum cake and ginger ice cream!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M09yak53EAE",
            "text": "Such a great restaurant!! So good, so nice and so interesting to try creole food 🤩"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzLWVHTnJnRRAB",
            "text": "We came here for a special meal when I was 40 weeks pregnant, and we’ll definitely come back with friends. I really appreciated the creative mocktails, and the cocktail menu looked great. The place is decorated really well. I loved the food. The French, African, and Indian influences made the food delicious and unique."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMTlENXZnRRAB",
            "text": "Lovely food and amazing ambiance"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbDhqTHFBRRAB",
            "text": "Food is wonderful. Drinks too 🙂 100% recommend this place"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb3FyNU5BEAE",
            "text": "I was taken aback by this place! I was nervous about getting some friends together for dinner and wanted us all to have a good experience…and we ended up loving this place! The design, atmosphere, music and lighting were amazing. Food was incredible. I personally didn’t like the drinks but my friends did. We got the samousas and lamb dish amongst ourselves, ice cream sorbet and cornbread with ice cream (?) for dessert. Food felt healthy yet fulfilling. Left feeling like it was a wonderful way to spend a Friday night and would definitely come back in the future!\n\nUpdate: Went back for a second time and was very disappointed at how lacking the menu was! The menu is tiny to begin with - to be out of stock of all of the meat dishes (which I believe are your main dishes) was astounding. Had to order something I did not want just because we had already traveled so far to get there. I got the shrimp dish and my friend got the swordfish. The sauces on both were good but the dishes were not filling. As last time, I got the cornbread ice cream for dessert, which was heavenly. My friend got the sorbet and didn’t even get her choice as they were out of several flavors here as well.\n\nOverall I do like their food but don’t think all the travel is worth the risk of another “out of stock” on their main items."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOTZLWVpnEAE",
            "text": "Food is amazing!!! Super traditional with a rustic country charm. The flavor combinations are terrific and exciting for the palate. The rhum was strong and cocktails are mixed very well. Dishes priced well!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOLVBhS0R3EAE",
            "text": "I have never had creole food so I was a little hesitant to try this place but I was so please with how great the food was. We had beef Bourgogne and the lamb and wow! The food was so cozy and the perfect thing to have on a cold winter night. The Bourgogne was definitely the stand out of the night. We also had the corn cake dessert and it was perfect. Not too sweet and the ginger ice cream was so refreshing.\n\nThe service was so nice and a joy to speak with. I’m excited too see the restaurant expand the menu. I’d be excited to see if they have seasonal specials as the seasons change."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcnJqQ1BBEAE",
            "text": "The ambiance is warm, with clean and crisp style, and a tasty menu. The drinks, food and decor are creole inspired from a little island called Réunion.\n\nThe samoussas were little bites of goodness - nice golden crispy outside and a delicious cheese filling that pops and then melts in your mouth.  I had the pork sausage ragout, which was delicious and really gave you an elevated level of that home cooked feeling. I got it with rice and a variety of sides - you could taste the authentic and warm flavors of everything.\n\nDrinks were delicious, well-balanced and give you that fun island vibe, but presented with all the care and detail you’d expect from a proper classic NYC cocktail.\n\nOverall- absolutely love this place. It does a wonderful job hitting that balance of food that makes you feel like your own grandma made it for you while also giving the elevated quality that you’d expect from a modern Brooklyn dining establishment. A nice respite from all the loud music, pretentious too cool for themselves spots in the area. Great whether you’re there for a date, just hanging with a few friends, or want a delicious quiet drink by yourself in a warm and relaxing environment. Will be going back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkb2Z1OFZBEAE",
            "text": "As a Mauritian 🇲🇺 I gotta say that Maloya is the closest place in NYC I can call home. The food tastes like it comes from my grandma’s antique pots, The cocktails flavors are the most exotic around the city and the ambiance is just ecstatic. The owner Sam is such a handsome laid back dude and his partner is an absolute master of the kitchen! Im so thankful to them for sharing this French-Creole cuisine experience with us ! I"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkenRLdWF3EAE",
            "text": "Celebrated a friend's birthday here last night and WOW, what a wonderful new fav. The cuisine melding of African, Thai, French, and Creole flavors was amazing and so refreshingly NEW. All the food was delicious - get the appetizer platter. I loved the spices and wide range of flavors. All the braised meat dishes are fantastic but don't miss the tartiflett creole side dish of the most indulgent and delicious potatoes with bacon, camembert, and creme fraiche. The house infused rums are incredible and the entire vibe of the restaurant was laid back but comfy. The service was impeccable and we couldn't say enough great things about this place. Can't wait to return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURULU4tZUJBEAE",
            "text": "Incredible! I came for brunch on Saturday (tried both macatias and the Saint Leu galette, as well as the Ispahan mimosa) and left full and happy. The salmon inside the galette was the best I’ve ever had. Everything tasted great, service was impeccable and the staff was super friendly. I will definitely come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNWNXZnN3RRAB",
            "text": "great new place! loved my meal. the hospitality was great. everyone should check out this place! opened 3 weeks ago and killing it. spicy sauce was nice and citrusy. really added to the overall flavor! love the decor and location. will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6amZMNWFnEAE",
            "text": "Food is soooo good. Me and some friends tried the fish dish, one with beef and the coconut shrimps. Everything was gorgeous we all live it. It’s so nice that plates come with lentils or beans and rice.\n\nI came back here and tried the Spadon Massala myself and I remake loove it.\n\nI hope this place will be here for a long time because it’s an amazing food option in the neighbor. thank you so much !!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcU5IdGd3RRAB",
            "text": "This is probably one of the most unique restaurant in New york. Maloya literally brought a little piece of Reunion Island into bushwick brooklyn! A flavorful mix of french, indian, african, chinese cuisine. Everything on the menu is delicious. Sam makes great cocktails with traditional reunion island rhums😇♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybXJyZnR3RRAB",
            "text": "Incredible atmosphere! A lot of thought and passion went into the decor and the ambience and it really shows. I never tried reunionese food and this was a great introduction to it! It was so good we even came back the next day. Thanks Sam!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid1BELUh3EAE",
            "text": "Very authentic Reunion Island cuisine, executed to the perfection. Everything is homemade and tastes exactly like in Réunion Island. I would recommend the samoussas and the rougail saucisses as a must try. Congratulations to the team from bringing the diversity of reunion island  cuisine and ingredients to NYC."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbEt1eXNBRRAB",
            "text": "Ambiance : On s’est retrouvé à la Réunion en plein New York\nService : Excellent\nDécoration : Incroyable case créole, des fresques extrêmement réussi\nNourriture : le rougail saucisses était excellent (il fait lui même ses propres saucisses!), les samoussas porc combava tout aussi bon et la glace combava très bonne\nJe compte revenir souvent !!!"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNTRqT0tBEAE",
            "text": "Étant originaire de l’île de La Réunion et  en voyage à New York depuis quelque jours, je suis tombée par hasard sur une publication de Damien Clavé !\n\nIl présentait ce restaurant Réunionnais au cœur de Brooklyn sur sa page Instagram,\n\nNous n’avons pas hésité une seule seconde pour réserver au Maloya ! Il y a la possibilité d’appeler ou de réserver via le site internet notamment si on a pas de numéro de téléphone américain, il faut savoir que cela fait 5 jours que le Maloya vient s’ouvrir ses portes !\n\nAccessible à cinq minutes à pied de la station de métro  L « Morgan Avenue » où en prenant le bus.\n\nEn arrivant devant, j’ai reconnu les trois tableaux de Damien Clavé représentant les trois cirques, les fruits (ananas victoria et letchi), la décoration est magnifique est représente les petites cases créoles, on se sent comme à la maison.\n\nNous pouvons parler anglais, français ou même le créole Réunionnais !\n\nPour le moment il y a des mocktails ayant des noms originaux, qui sont excellents ! Nous avons pris « le paille en queue », « pour les pompistes » et « Ispahan ». Le combava est relevé, ainsi que l’ananas, le fruit de la passion et le letchi… Des bonnes choses qui rappelle notre enfance et là d’où on vient…(Oubli pa ou sa ou sort’ !)\n\nPour manger, nous avons choisi l’assiette créole avec des samoussas thon; porc combava; des sarcives; des bonbons piments; ainsi qu’un cabri massalé; un rougail saucisse accompagné de lentilles; riz; brèdes choux de chines et un rougail dakatine également délicieux et préparé avec amour, comme si on mangeait à un repas de famille un dimanche !\n\nPour le dessert, nous avons goûté le gâteau tisson, qui était très réussi !\n\nCela nous a fait chaud au cœur de retrouver notre île sur le territoire\nAméricain ! Je vous recommande le Maloya si vous souhaitez goûter les plats et les bonnes saveurs de La Réunion 🇷🇪\n\nNartrouv’"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROb3F6Y2xBRRAB",
            "text": "Been dying to try for a while … the rum was great but the food is disappointing. The vegetarian options were minimal to begin with and they were out of 2 veggie things on the menu. We also never got some of our order :/ the food we did get to try was filling and nice but nothing too special.\n\nDefinitely not a vegetarian friendly  place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMTZEVzd3RRAB",
            "text": "Highly recommend the Cabri Massale (Lamb shank) with pickled veg.\n\nGateau Nantais (salmon rum cake), Tuna sammoussas, and Pour Les Pompistes (mocktail) were also great.\n\nSuper friendly staff and really good vibes. Would make a nice Bushwick date spot. Spoke with the owner for a while. Wishing them all the best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOeVl1X0xREAE",
            "text": "This new spot opened near me and thought I’d give it a try - so glad I did!\n\nThis is my first time trying food from the Reunion island and it didn’t disappoint - I got the Cabri Massale aka braised lamb leg. It was so flavorful - if you like a good subtle kick from spices, definitely give this a try.\n\nAnother thing I tried and I’ve been dreaming of is the ginger ice cream - it’s so refreshing and really just hit the spot after the hearty braised lamb leg.\n\nHad a great meal here would definitely be coming back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREX1BqWDdnRRAB",
            "text": "I had an amazing time at Maloya. It’s authentic reunion food. It was excellent 10/10. I loved it. And the staff so friendly. Thank you"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWOXZ6YnR3RRAB",
            "text": "Love this new spot! Food is delicious and the atmosphere is very cozy. They are not yet serving alcohol I believe they’re waiting on a liquor license, but the mocktail I had was very good. Welcoming this new neighborhood addition."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxMW9MUTdnRRAB",
            "text": "Came for apps and drinks on New Year's Eve before a party nearby.  Got the sampler, a side of bok choy, and two cocktails each. We wanted to try more, but we had food already paid for at our next stop.\n\nThe food was all well-prepared, distinctive yet approachable, and of course delicious.  The drinks we had were all well crafted and surprising - veering from the more common taste profiles without feeling \"weird\".  We had the Tes Yeaux Verts, le Bushwick (x2), and Dai-Cari. Who knew rum could be so versatile?\n\nThe space was super inviting with a cohesive and distinctive design. Bold and tropically evocative without getting gaudy.  Good mix of seating, not overly tiny but still felt intimate.\n\nService was friendly, thoughtful, and attentive while remaining unobtrusive.\n\nPricing felt very reasonable.  Looking forward to going back for a full meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibWVmU1hnEAE",
            "text": "My partner and I shared a delicious meal here tonight! The shrimp was magical and the dessert menu was also really impressive. Definitely a real gem. We loved the ambiance and relaxed atmosphere. 10/10 food and experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NkpxdXpBRRAB",
            "text": "Absolutely divine. We dined here for my sisters birthday and from beginning to end the experience was top notch. Samuel has created an environment of love, music, excellent food and a brilliant bar menu to allow you to dive into the La Reunion culture. It is a culture to be appreciated and we are lucky this spot has found a home in Bushwick. Run don’t walk to Maloya! Some of our favorites: the lamb, swordfish, coconut vanilla shrimp."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicE0ya0tnEAE",
            "text": "I cannot say enough good things about this restaurant!! From the moment I entered to when I left, it was a perfect dining experience. The hostesses/server is so kind and friendly. She made us feel like we were eating in someone’s own home. The food is incredible, the cocktails are expertly made (and the cocktail menu is really unique and fun), the dessert was so delicious. I’ve never had this kind of cuisine before, but I loved every bite! By the way, even if you don’t eat ice cream for dessert, do yourself a favor and try it. It is not just regular ice cream out of a box; it is something special! I’ll tell everyone I know to go here. You will absolutely love it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0eXVYcFlnEAE",
            "text": "One of the best meals I've had in a long time.\n\nOur server was super friendly and knowledgeable about the menu, he gave great recommendations and was very kind during our meal.\n\nThe cocktails were outstanding. A rum forward cocktail menu that isnt all bright colors and grenadine. Real cocktails, some pulled from the culture and others as a rum inspired flip on a classic cocktail.\nI usually don't like Martinique style rum, but they used such quality ingredients, I loved it.\n\nThe food was really excellent. We got the sampler plate and got to try a lot of the menu that way. The salt cod fritters were my favorite, but it was all awesome.\n\nWaiter recommended the vanilla coconut shrimp and the lamb stew. Both were absolutely amazing. The shrimp were cooked just right, not over or under. The sauce was very interesting and delicious. The lamb was bursting with flavour. Everything else looked awesome\n\nMenu had great looking options for V and GF patrons as well.\n\nI can't recommend this restaurant enough."
        }
    ],
    "reviews_count": 72
}