{
    "name": "Sweet Anaëlle",
    "place_id": "ChIJ1Zkzvp1dwokRqaMB0202cwo",
    "grid": "BK4",
    "address": "97 Jefferson St, Brooklyn, NY 11206, USA",
    "rating": 4.7,
    "user_ratings_total": 243,
    "phone_number": "(347) 240-2288",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdWJGcG9TM00zTFhaQ2NrUTRWek5LZDNkcGJYYxAB",
            "text": "We went here to Celebrate one of my friends birthdays and let me start off by saying the staff was great, very polite, the ambiance is cute.  However I dont know if they was unprepared for a party the size that we had it was about 12 of us but the food was not good.  All of our food came out at different times some people received their appetizers after their food, some people was done eating their dinner when someone else's dinner was coming. It just made everything a little bit hectic and then the portion sizes are extremely small for the price you pay.  We came hungry and left hungry. But I will say whatever complaints or needs we had they was polite about fixing what they could.  It just didn't meet our expectations."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200Mk9IaGFaMkpCZVdoSWNURlZaRkZWVDE5b1RrRRAB",
            "text": "Delicious food, Delicious drinks, fun vibes, fun playlist ! I love the garden in the back and the Elote on the Cob"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNFpGZGplbkpaUTJabGNIQm5SelpuV1c1dU0yYxAB",
            "text": "Great experience and lovely team."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTVdFYzJaMGREYm1GdGVUbEdOblU0UnpKUWIyYxAB",
            "text": "Lovely, cozy, and welcoming restaurant.\nI went for happy hour but was advised to sit at the bar to be able to participate. It seemed a bit odd to me, but this was redeemed by the great service from the bartender.\nThe food was a bit bland and small in portion, but the margaritas were exquisite. I will definitely be going back for the margaritas. Also! If you're on the shorter side, the bar is a bit uncomfortable haha."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUmRrSmhaVEJGVGt4cU1FSjNZa3MzWTFBNFUwRRAB",
            "text": "Had such a lovely time at Sweet Anaelle! The food was amazing! Highly recommend the Shrimp Ceviche. Drinks made to perfection. Everything arrived in a timely manner and the service was wonderful! Will definitely be back my next visit to Brooklyn! Thanks for a wonderful time!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQ09WazFOWEZLTjNWeGVXdzFVUzAzZG5CSVEzYxAB",
            "text": "Amazing food! We ordered a few appetizers and drinks. Everything came out delicious, especially the Muchines De Yucca and Shrimp Ceviche which I highly recommend. Atmosphere was welcoming, staff was incredibly warm and friendly. Great experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTlZuRkpOa3g1WmpKWWMyVTFlREZmYzNRd1owRRAB",
            "text": "I don’t normally write reviews but my experience dining here was amazing! Fast service, amazing food, and an overall good atmosphere to come and dine with friends. Would absolutely come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTE4zRkNNREpNVTBkbWF6RnpVV3B0UmxCdlMwRRAB",
            "text": "Came in this weekend, it was rainy and gloomy but worth leaving the house. Esspresso martini was really good, my girlfriend had a purple mimosa. Really good food and drinks and our waitress was very sweet"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5b1QzUlpUVGhhUkRGalptbDFaVVo2WldSTkxYYxAB",
            "text": "I don’t usually write bad reviews for places but this was something special. Every step of the way was terrible.\n\nIt took an hour for all our drinks to come out with half the order being wrong.\n\nThe food took over an hour too, and half of it was cold. Portion sizes were tiny.\n\nWe had to repeatedly ask the waiters and the manager for our food. It’s like they completely forgot about the giant party of 8 in the main dining area. The worst part is the food DID come out slowly, about one plate every 15 minutes after minute 30. By the end, half the table had eaten and everyone else was starving and annoyed\n\nThen at the end they charged us 18% gratuity and it took one of our friends going up and asking them to take it off for them to do so.\n\nDefinitely would not return"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRFVHUnVTMFphT1c1RU4zQldUeTFCTURaMlJsRRAB",
            "text": "Really really bad service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscFFqVjJTV3hOVlRSbldWaERhbk5NY1doVFkzYxAB",
            "text": "Very good food and service . Very pleasantly surprised ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poelZrVlBaREJmU0RaSk9GaGFZMmhEY25WQ04xRRAB",
            "text": "Go here tonight. Everything is so good. The elote is to die for."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMlNVWkhkbGx4YW1oalQzTXlVRTFxVHpWdU9XYxAB",
            "text": "i come here all the time, the espresso martinis are the best iv ever had. this place also started my yucca fries obsession lol. It’s a perfect vibe to chat with some friends and the outdoor section is awesome"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oT2RHdDNTbmRDVjNVeU1rTlphbkJNVFRjelNYYxAB",
            "text": "Honestly it was the most boring food and drinks I've ever had. Maybe I got the wrong things, maybe it's Maybelline. It was super cute tho."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV01VZG1SWFJOTWpKMWJWbHdXRlZWT0VrMVgxRRAB",
            "text": "The service was good. The food was great! We had the steak (which came with arugula salad and delicious fries), octopus, basil pasta (with optional chicken or shrimp), and chicken arepas. Good place for drinks. However, the fish dish wasn't available on the already-limited menu, and the server did not bring out our complete order (was missing the sweet plantains covered with cheese). I would NOT recommend the dessert. The tres leches looked/tasted like it was frozen and was still defrosting, with condensation. The volcano cake looked exactly like Domino's lava cake."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OT04wbDViMUpQYkU5bGRVVnNZUzFRWVdZM1gyYxAB",
            "text": "This restaurant was such a surprise. We experienced the brunch menu, which was absolutely perfect as it enabled us to share a bunch of different dishes. Being Chilean, I couldn’t not order the Pisco sour and it was a dream exactly how I remember them when my grandma used to make them. It had a beautifully casual vibe with spectacular food to match. I highly recommend it for a girls night out or brunch with friends!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeWF6bFllVkUwWDJacU1FbFVjR1Z4YldkeFYxRRAB",
            "text": "Nice place, delicious huevos rancheros! Good service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaVFuWjVhemhKVDNsTVRFUnRORVZGVmtGUFgxRRAB",
            "text": "Super lovely and helpful staff. Great place to sit as the vibe is upbeat and the place is clean. Food and drinks were great also"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OeldtTnBTVlZKVXpOTlZEVjJhVmMzTlROblIwRRAB",
            "text": "Went on a Saturday- True brunch place. Piña colada wasn’t blended 🥲 Service was disappointing for auto gratuity for a party of 2."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aek1WRlNlV1JTYlV4U05XVnllRUZETkZsaFRGRRAB",
            "text": "Awesome  seater diligently helped make a last minute reservation foʻó⁹"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUFRGTmhVQzAwVDNWeldGbENZMDl1VUc5bWVGRRAB",
            "text": "I have had pretty much everything on the brunch menu, and I enjoy the food here. I have eaten at the restaurant on multiple occasions, and I have always had a great experience. The drinks are good as well. I had the Bad-eh-go, and I had the Evergreen drink. My children always enjoy eating here, and we will definitely be back again to try more of the dinner menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMlduaFdhVU50V1VoYVVFWnhUMVo2UW5FNVpHYxAB",
            "text": "Stunning food in a lovely little spot. Service impeccable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeldsRkRTM1JzT0RSSVYwTXROM1pxTUV3MmJGRRAB",
            "text": "Great spot for brunch."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNVZFVm1iVzlMZGxSZmVFZGhhM1V3T0ZSeGFGRRAB",
            "text": "Love love love love this restaurant everything is delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwT2NXZGxXVE5hYkVkWFFrSkJSVE5IZVRsdk1VRRAB",
            "text": "Such a cute spot with amazing food and drinks!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TldVRkRSMmwzWDBzM1NWQjNWQzFFTjJweWVWRRAB",
            "text": "Really loved this spot. Food was great and the bartenders were really nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQS0NrLTJXeDlHSlZnEAE",
            "text": "Sweet Anaëlle was an unforgettable experience! The empanadas were the perfect start, crispy and flavorful. The pasta entrée was fresh and comforting, and the dessert made from bone marrow was truly unique and absolutely delicious. The service was warm and attentive. I can’t wait to go back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOellzLVdONk9hX05nEAE",
            "text": "charles was honestly the best server/bartender ever! He took care of the whole restaurant by himself and still managed to have amazing customer service! His playlist is also immaculate! I cannot wait to come back and see him! literally a doll :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdFMweHVUMVl3VTJSdWQxWXRlbWg0UkUxM04xRRAB",
            "text": "Charles is the best!!! come here just for him"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPVGlyNGF0NWRiNFJREAE",
            "text": "On Wednesday 28th I visited this place for a meal. While the food was good, the service left much to be desired — the staff was barely attentive, and I struggled to get anyone’s attention when I needed something.\nWhat really disappointed me was that they added an automatic gratuity to the check, even though I was dining alone. I understand if this applies to large parties, but adding it without informing me beforehand feels misleading and unacceptable.\nIt left a bad impression, and overall, I wouldn’t recommend this place based on my experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNem9yNjIxckthZnpBRRAB",
            "text": "Went with a group. Very good food. Oysters were thr best I have had in a while. Service was attentive and the owner even came to say hi."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZVAtS2ZYdnBuSUV3EAE",
            "text": "This spot was a truly enjoyable experience. I haven’t had that much fun brunching in a while. Sam was our server and he was so kind and helpful. I went with five other friends and we will be coming back. I had the huevos rancheros and it was the perfect meal. I’m a vegetarian and the veg options are endless. I can’t wait to go back and try all of the other options. Highly recommend this restaurant. 10/10. Also get the prosecco lol."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOaV94SW14bFBtUGhRRRAB",
            "text": "I have been wanting to stop by this place for some time now and it absolutely did not disappoint. I did a Sunday brunch and shared the steak and eggs and the French toast with my boyfriend. The food was ahhhhhmazing. I fought him for the last piece of steak (his hand lives to see another day!) The atmosphere was beautiful and the patio was the perfect setting for the nice weather outside. Sam, our attentive and wonderful server was the cherry. At one point the place filled and we could tell he was extremely busy but he made sure to constantly check in and handled everything with ease. We were never left wanting. I can’t wait to come back and try something new."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZm05TUgzMWMyRVlnEAE",
            "text": "Enjoyed having brunch here over the weekend. Great patio and an even better wine list. The chilled red was amazing! Do yourself a favor and grab a bottle with some oysters!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMSHl4cl8tdTdPbjBBRRAB",
            "text": "I went with a group of 6 and sat out in the patio on a beautiful day. Sam was our server and he did a wonderful job answering any questions regarding the food and drink menu. He was very attentive to us and made the atmosphere very enjoyable. The oysters were amazing, as was the crispy chicken sandwich. I loved the espresso martini and Prosecco was amazing. My friend loved the steak and eggs and we all will be coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLakF1SjJ5MXV2bDRBRRAB",
            "text": "Spotted this behind my apartment and it looked so inviting. Visited for Mother’s Day with my family and wow it made our day. Food was perfect, vibe was top tier, and the staff were super welcoming."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VObmhyOXV1eXFxNmt3RRAB",
            "text": "Leaving a review so I can remember this place, Sweet Anaelle. It’s a great happy hour spot, especially for gluten intolerant people like myself. There were several, clearly marked GF items on the happy hour menu and all that I tried were delicious, especially the shrimp tacos. Service at the bar was great as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNUGs3NEM0bXVPZTFBRRAB",
            "text": "Sam was our server, and was the epitome of a helicopter server. As a retired server this is a pet peeve and completely ruins a dining experience. He paced back forth past our table the entire time we were there. He should’ve just sat down at the table with us, that honestly would’ve been less annoying"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbmJpZDZnRRAB",
            "text": "I have been here before but this time my experience was made better because I had Theana(I don’t know if this spelling is correct) as my server! She was so incredibly kind and answered every question. She truly made my day. The food was also amazing as always. I will be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2FiRWpBRRAB",
            "text": "Dinner is underwhelming… I think my Branzino was really Talapia… Automatic 18% gratuity for a party of 2… very tacky… Gratuity should be earned through great  food and service… that’s not what I experienced."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dnN1T25nRRAB",
            "text": "Great spot in quiet area of Brooklyn but close to everything. Sat at the bar, single coverage with bartender running the floor as well. Sam made some great wine recommendations, and even better food. Civeche was very good, and some great oyster service. Will be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNS1IbEJ3EAE",
            "text": "The best place in the neighborhood by far."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcXYteUJBEAE",
            "text": "The food was delicious we got the oysters, steak and eggs, chicken salads. Also the drinks were amazing."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndll6RnN3RRAB",
            "text": "Food was fine, but not very \"Latin\""
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMDUyc0pREAE",
            "text": "Great place"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNXEyNWZREAE",
            "text": "I came in 2 weekends ago with my cousin who was visiting & my roomie cause I’ve been wanting to try it for so long after it came highly recommended from a client! Such a beautiful atmosphere, delicious drinks (you already know we had to do more than 1 round), the food was SOOOO good!!! And the service so was so so lovely, made sure to give our compliments to the chef and they gave the love right back! 🫂 I’ll add what dishes we had below so you can give it a try, gonna be a new fav neighborhood spot 💋 also plz get the avocado toast (we got no egg)! Music was bumping too 🎶"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbk1tSzlBRRAB",
            "text": "Excellent food! The place was packed, so the service was a bit delayed, but overall, it was great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcGF1NzNnRRAB",
            "text": "Steak & eggs ordered medium came super well cooked and over easy eggs, the thing was fried😂 but didnt want to just share my food experience. Both older waiter and bartender were either having bad day or a very pessimistic attitude. The way the gave the plates like almost throwing the damn thing and turning around to leave with little sassy attitude didnt check up on us. Horrible service the atmosphere is awesome but wont be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNE95SHFRRRAB",
            "text": "Such amazing food and Sangria here! Definitely coming back here!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfd2I2eHJnRRAB",
            "text": "First time having Brunch here, the drinks were fantastic, the Steak and eggs hit the spot! I like the decor and will definitely be back for more dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNlpXX0ZnEAE",
            "text": "Had brunch here with family while visiting Brooklyn.  The atmosphere was very pleasant and trendy.  The food was absolutely delicious.  I had the breakfast burger 5 stars in my book, my better half had the avocado toast, also an amazing choice. A definite most visit if your in Brooklyn NY. I highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3OUxfSi13RRAB",
            "text": "We visited Sweet Anaelle for brunch, with a group of seven.  Even though we arrived separately,  they sat us as we arrived.  We were greeted by Edwin, Sr., who is the owner, and that's how our amazing experience here began.  Ashley was our server, and she was amazing-attentive and friendly.  The food was delicious and brought out fairly quickly. Edwin, Ashley and even Mariel, Edwin's wife, checked on us regularly, and did not intervened with our great time.  Overall,  it was a great experience with great food and service.  Definitely going back and wish everyone whi visits has a similar experience!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eXBPUFJnEAE",
            "text": "Very cute spot with super friendly staff. Came for brunch on a Sunday and got seated fast. But the place does fill up and I don’t believe there are reservations.\n\nFood wise ever was pretty good. Maduros were tasty. Empanadas were interesting; they’re small and a light bite. Got the avocado toast and the serving size was really good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsa2Fyd3FnRRAB",
            "text": "What a lovely experience! The entire staff was so wonderful, from our kind and informative waitress, to even the bartenders and chef who checked in to see if we were enjoying everything. The food - incredible! You can tell the culinary staff is top notch. The knife work was precise on the ingredients, everything was extremely fresh, and each flavor and dish was cooked with care evoking many deep nuances of flavors. Additionally, we learned the owner works in design and construction - and you can tell with the ambiance. The restaurant is beautifully laid out, with tons of natural light, and thoughtful details throughout. They even had an All Gender Restroom which is greatly appreciated as a non-binary person. I’ll come here again in a heartbeat!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MjU2Yk1BEAE",
            "text": "We stopped by Sweet Anaelle after work during Happy Hour last Friday. First thing 1st, the Food was Very Good!!! 😋 We had the Sweet chili wings which were flavorful & Nice & Crispy. The Chimi burger (chimi sauce-New I like) with fries (those fries were everything....crispy & not oily at all Soooo good. Drinks: I tried the Mango margarita, Prickly Pear margarita and The Porn Star.\nIndoor & Outside seating available.\n\nThe Staff at Sweet Anaelle are AMAZING❣️They are very attentive and Truly care about their customers' feedback regarding food.\nWe Need More Establishments like this.\nI TRULY APPRECIATE THAT.....\nP.S. Thank you to the owner.🥃\nUntil Next Time!!! 😊✌🏽"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NnZMWFV3EAE",
            "text": "Wow, what an incredible dining experience! 😍 From the moment we walked in, we felt a warm and friendly vibe. The staff were not just helpful, but genuinely made us feel like old friends.\n\nBut the real star of the show was the food. I can’t even put into words how amazing the dishes were. The flavors were out of this world! 🍽️ And the drinks, oh my, they were a perfect complement to the fantastic meal. 🍹🥂\n\nI can’t wait to share some photos to showcase the mouthwatering dishes we enjoyed. If you’re looking for a place with great food, drinks, and a welcoming atmosphere, this is the place to be. We’ll definitely be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1d3R6TVlREAE",
            "text": "Sabroso! I went to dine at this restaurant with my wife, and without a doubt, it was a fantastic gastronomic experience thanks to Chef Michelle. The menu she designed is based on Latin flavors with a prominent Peruvian touch. The dishes she presents are full of flavor and have an impeccable presentation. The portions are suitable, whether for individual dining or sharing. In both cases, they are ideal. We tasted almost the entire menu, and everything was delicious. The cocktails at the place offer a good variety of flavors and have an attractive presentation. The restaurant itself is charming, with a unique atmosphere and a lot of Latin vibes. I undoubtedly highly recommend it and celebrate the talent and dedication of Chef Michelle."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6eE5tYmJnEAE",
            "text": "Sweet Anaelle is the type of Restaurant that has a little bit of everything with them. Let me start by saying the food is delicious. Very different concept specially if you are someone that enjoys flavors in food along with a variety. I know french Fries Seem like an easy task but Let me tell you I loooovedd their French Fries with the chipotle mayo....OMG! Cant never have enough of them. Their steak its Juicy made to perfection soft and tender. I almost have every dish and they are all amazing. Ambience is great and the service is above expectation. Ricky its my favorite and I do appreciate the rounds from upper management/Owner ; they really make sure that you are happy while your enjoying delicious drinks and vibe. They do have a patio and they are pet friendly. Prices are reasonable for the quality and quantity of food. Great for celebrations, Dates and or just maybe grab couple of drinks. Definitely recommend giving them a try...❤️ Dont Forget about their happy hour specials. Follow them on Instagram @sweetanaelle.bk"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMX0pUS3Z3RRAB",
            "text": "This is our fav happy hour place to go to. They have a wide selection of happy hour appetizers along with variety of drinks to choose from. We love the cocktails here.\nNot to mention the service and vibe of the place is also amazing. Def try out this place if you wanna go somewhere for happy hour."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGdTZDUXBnRRAB",
            "text": "This a place is a hidden gem, I can’t wait for more people to realize how spectacular it is! The Food is exquisite, with every bite I just wanted more, my husband and I tried a few plates! The shrimp ceviche was my favorite and my husband was the tuna sashimi, but we also love, the corn ribs, the grilled octopus….Just about everything!!!  Go check them out!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaks3WE5nEAE",
            "text": "We had a great meal and drinks at Sweet Anaelle! A fantastic addition to the neighborhood. You can tell that the owners and staff really care about what they serve. We tried their happy hour menu and can’t wait to come back for dinner. Highly recommend the mango margaritas, chips & guac, pizzeta, and crispy shrimps! So good we had to order more."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdWN2MjFBRRAB",
            "text": "Awesome new spot in the neighborhood. Cool bar and a nice outdoor seating situation. A little on the nicer end compared to what’s around and a little pricier, but you get your money’s worth. The menu is mostly small plates, so you’ll need to order a few things.\n\nTheir version of a dirty margarita, the Barrio Bravo, is incredible."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMS1DZkNREAE",
            "text": "We had the best time at Sweet Anaelle! Visited our daughter and enjoyed her company and her friends’ at this Williamsburg restaurant.  Great food, amazing cocktails and the best music and service.  Great meal and night at this lovely spot where they accommodated seven of us on short notice and made us feel special and at home, all at once.  Jonathan and Al were fantastic.  Can’t wait to go back!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeTdfMGxRRRAB",
            "text": "We don't deserve such a beautiful experience in Brooklyn. The food tastes like it should cost 5 times the price. The servers are humble and polite. The drinks are art. Art! I could cry. I'm so glad I passed by this place, by chance. And I'm so scared that we're going to ruin it. I'll visit as much as I can before then. Special thanks to Chef Michelle and the barista Monica! This was literally a healing experience. I will be back, weekly.\n\nUpdate:\nThings have definitely changed since they opened. But I'm grateful for my first experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdnZiZm9RRRAB",
            "text": "Very cute small restaurant/bar. There was a lady singing live which was very enjoyable. The food portions are mostly appetizer sizes besides the burger and the steak. So order as needed if you're going for dinner. We were recommended as a drink, the Prickly Pear. The Prickly Pear was absolutely wonderful!! Super tasty. It's a Margarita on the rocks, you won't regret it.\nWe ordered oysters, chips and guacamole, the chicken (which comes with 5 pieces nugget sized but very tasty) sweet potato fries, and 3 burgers. All were seasoned delightfully and cooked to perfection. At the end we enjoyed the chocolate lava cake which was the best way to end our night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxN1AzR3l3RRAB",
            "text": "I’m so happy I stopped in! We happened to drop by during happy hour and had prickly pear margaritas ($9), yuca fries and a burger. I have not had a burger this good in a long time. For dessert we had the chocolate volcano cake and it was the perfect end."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaDVxdzh3RRAB",
            "text": "Food was so amazing I forgot to take photos. We had the branzino, steak, shrimp ceviche, tacos, and a couple of the special cocktails. 10/10 amazing. Will be coming back for more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudmN1aHZ3RRAB",
            "text": "I love this place. The food is amazing, and the staff is the best. Jonathan makes the best drinks, and is super nice. It's my neighborhood spot everyone should check it out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMlp1em9nRRAB",
            "text": "Absolutely loved! The food is delicious I’m telling you right now they have the best shrimp ceviche in Brooklyn hands down, and the corn ribs are top tier. Lovely staff and great atmosphere! One of my new favorites places to frequent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidUppdVlnEAE",
            "text": "I truly think folks are sleeping on a wonderful happy hour and space here!\n\nShould be packed to the gills from 5-7 but we’re always able to grab a spot to enjoy some food and drinks. Oops, my bad for spoiling our secret-ish spot. 😅\n\nMargs are great in all flavors, particularly prickly pear and watermelon. And the happy hour bites never fail to impress. The yuca fries, wings, and elote were particular standouts. Thanks for your business, Sweet Anelle!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMEt2OXNRRRAB",
            "text": "Super nice ambeance and wonderful food. We had the octopus, tacu tacu, elote and cheese yucca. Everything was delicious including the cocktails. Good music and attentive servers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdEtMQnV3RRAB",
            "text": "So delicious! Top notch. Ordered the French toast and the crispy chicken sandwich. Both meals were absolutely delicious, and the fries were also fantastic and flavorful and wholesome!\n\nAshley was a delightful server, and the atmosphere was great inside as well. Music was not too loud so it was very easy to have a conversation, but it was also loud enough to create a nice environment.\n\nFood came out very quickly, would definitely return to try their dinner menu! Also love how simple and no-frills the menu is. It’s just one page!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdm8zaHZ3RRAB",
            "text": "The food is pretty good and the service is excellent. They are dog friendly too! It was a great experience. However, on the pricy side in terms of portion size."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaHZfRFBREAE",
            "text": "This was the best brunch I think we’ve ever had. The atmosphere was incredible. Feels like you’re in a green oasis of plants in the restaurant and patio.\n\nThe service was fantastic and attentive. The food and drinks were unmatched. We shared the avocado toast and French toast and both were 10/10. We had cocktails as well getting the signature barrio and penicillin.\n\nCan’t wait to try their whole menu. Everyone should make this their first choice for brunch!"
        }
    ],
    "reviews_count": 74
}