{
    "name": "Tabaré Bushwick",
    "place_id": "ChIJ80WOzERdwokRXjGSASkDZxk",
    "grid": "BK4",
    "address": "1006 Flushing Ave, Brooklyn, NY 11237, USA",
    "rating": 4.7,
    "user_ratings_total": 480,
    "phone_number": "(347) 318-3885",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMmFFNDFaVVZhYmxGWk1FTTVTSEl0UWtKcE1FRRAB",
            "text": "Best time ever, great food, and amazing host Flor!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rdExYQnhRbVZGTkRWbVZVeDVXazVJU0ZOVlRtYxAB",
            "text": "Amazing ambiance, great steak and our server Flor was so attentive, knowledgeable and fast with everything. The best!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dUxVUjZVRzV2UWxaUFZHNXNjMnRmTTBreWIzYxAB",
            "text": "What an incredible and authentic experience. Everyone was friendly, food is delicious and the restaurant is inviting. Tabare is just fantastic. I highly recommend this unique gem."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Rk1GaGtWMGR3T1cweVlqWjBPVmcxT0cxdmEyYxAB",
            "text": "Amazing staff and service. Delicious food and cocktails with a fun and chill atmosphere. You will feel like you left NYC. And don’t miss the flan for dessert… the best in the world!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UU9YaEtWa3BQUkhaeVkxQnpZVVpwVG5SWGNuYxAB",
            "text": "Had a great time here! Came on a Saturday for brunch. The staff was super nice and accommodating. The food was delicious 🤤"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNlgwbG1SMjl5VFZkNlVsaEVlSGQ0UWxOWGVVRRAB",
            "text": "Food was good, inattentive service"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQ2RXVjJPVUl0VTFseVNtUlJRMWh5Y21JdE5VRRAB",
            "text": "Fuimos un grupo de 8 y todo divino! Su gente, el sabor de la comida y el lugar… todo espectacular!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTmVuZ3paM1pVUTNsTWNrZG9aWEpZYjJkS2VuYxAB",
            "text": "Amazing service and real authentic Uruguayan food so delicious, staff very kind and professional highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aExVSkZTVEpCY0ZCeVp6UnFTazR5VGtSRVJXYxAB",
            "text": "THIS SPOT IS A MEAT LOVERS DREAM\nWe ate this over two visits. The place is really cool. They have been in Bushwick for 6 years.\n\nRamiro is the owner was very gracious with his hospitality as were his staff.\n\nThank you to Chef Alejandor, our server Jovany and Rachel the host.\n\nBig thanks to my friend Claudia for putting me on to this spot. She's from Uruguayand said I had to try this spo\n\nThey have a 2ndlocation in Williamsburg, which has been around for 16 years. I did not know\nI'm going to be a regular here.\n\nThe Dishes\n\nGRASS FED 12OZ URUGUAYAN RIB-EYE\nThis was awesome!\n\nCHIVITO COMPLETO  my new favorite sandwich!\nUruguayan grass-fed filet mignon sandwich, black forest ham, bacon, provolone,  caramelized onions\nroasted red peppers, bibb lettuce, beefsteak tomato, olives, aioli and topped with an egg\n\nPARRILLADA\nSkirt steak, chicken, chorizo, blood sausage,roasted peppers, onions and chimichurri..wow what's not to like on this platter.\n\nBurger\nPrime beef, rib and chuck blend, provolone, bacon, caramelized onions, lettuce, tomato, solid burger! And those fries werw great!\n\nEmpanada\nHandcut beef and olive\nGruyere, fontina cheese & onions\nThe beef empanada is definitely one of the best in NYC!\nI wasn't too carry about the cheese empanada but my firend loved it.\n\nDessert\n-Flan was perfect.\n-Alfajor rustico: Layers of crisp homemade cookies, dulce de leche,\nchocolate ganache, sea salt caramelized walnuts. Not in the traditional manner but a unique take on it.\n-Torta de chocolate negro\n(Flourless dark chocolate cake, berries)\nWe liked this. Not a berry fan w chocolate but this works.\n\nDefinitely going back.\n\nTheir NA cocktails werw really good as well."
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeldGRkpSa2d5TkdWaWNsYzJZek4wTlUxa2RGRRAB",
            "text": "Magnifique expérience !!!"
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scVFXVlBXa1JPUkVSUVUyWnJjbkJOYlhSRGFXYxAB",
            "text": "En visite de Paris, jai visité ce super restaurant par hasard. Très bonne ambiance et menu.  Le meilleur à été le flan au dulce de leche."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WblpYWmhRbDg1ZUd0UGJGTldUalp5VVZkMmJWRRAB",
            "text": "Ba aware CASH or AMEX ONLY but is ATM next door.\nWe had the skirt steak and fish of the day, the Whole branzino, which were excellent but can’t wait to try more next time!\nBeautiful ambience and extra friendly staff, Love it we will be back!\nHighly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SmJUWlJNSE0yZEhCVlYwUmpRbll6YzBacFRFRRAB",
            "text": "A server with long hair and beard. HORRIBLE HOSPITALITY. I have been to the place multiple times +10 since I moved to the neighborhood with my family. I’ve paid multiple times by Visa Card and this guy didn’t allowed me he wanted me to use cash and directed me to their ATM they have inside. This is about the hospitality and the clientele you can’t treat like this someone just to make extra $3 that cost me have my ATM money. YOU LOSE CLIENTELE"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMFJtWTVXbVF6VkZoc2NVWlpaRUkzVlRsdmNVRRAB",
            "text": "Hoy visité el restaurante la verdad que para los uruguayos que sabemos de carnes este lugar no sirve la atención muy mala la manger vio que tube mala comunicación con el mesero y no hizo nada la respecto solo hizo una broma pedí una parrilla para uno y parecía una broma dos céntimetro de entraña un cuarto chorizo y un cuarto de morcilla horrible, lo que estuvo potable fue el chivito al plato que lo tuvimos que cambiar dos veces porque el mesero estaba en babilonia. No volveremos"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWc0xVSXhSRGN6Uld0c1FrcHdMVGR0WmxsYVZWRRAB",
            "text": "Tabaré is such a great vibes, great food, and great service! Definitely one of the best places to eat in NYC"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UGVHRkhVVlkzTmpGdWNsRTJkR0pPVDNrMlpWRRAB",
            "text": "It’s so beautiful inside! we ate outdoors bc the weather was lovely, But it’s a busy street and can be pretty loud. The food was great and an asado for 2 with a beet salad fed 3 and we were all very satisfied."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdFpFdHZibXBWZUdSWmEwRkpSM0F6VFdGMFJYYxAB",
            "text": "Amazing food, pleasant staff and traditional atmosphere. I love this place."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdGN6ZHpjMkpJYzBscldXVTVTWE40VmpoVlVFRRAB",
            "text": "Delicioso, muy buen ambiente"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Q1RFOTVURkZFVTBwSU5HRkxNVGRKTFhoSExVRRAB",
            "text": "They changed the bunch menu since maybe last year which I'm quite sad about. The menu options, the price and what's included.\n\nIn any case, the bloodies (and other drinks), empanadas (chicken, cheese), mussels and steak are delicious. Strong coffee.\n\nI think brunch ends at 3pm."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toa1pqVlZjM0JSWjJKd01XZDRlbk5QZW5Ock5HYxAB",
            "text": "Just awezome experience, people was so kind!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNFZUWnFaRlpQYUVreldITldTVE0wV0ZodlIwRRAB",
            "text": "It was an amazing atmosphere and presentation. The dishes were extremely well portioned and brought out quickly. The duck fat potatoes and pear salad with goat cheese were standout,  also would recommend the empanadas"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVWVYRkNVRXBDWjJwSGJuRm5WWFpOTkdOdGMzYxAB",
            "text": "Some of the best food I’ve had in NY."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdE5IRXdSbFZsTjFSblYyeDJVMEp5V2tsWlUzYxAB",
            "text": "Amazing experience, the food was so good definitely try the empanadas and the steak was perfect. 10/10 service everyone was very kind. Thanks so much!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WE1DMWxPRFpMTkRKU1FXRXRaV055VkZGbVVtYxAB",
            "text": "Cómo argentina, de los mejores restaurantes de carne de nueva york"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWd2JGVXRPSE5zY0ZaZlQzVk1jSFJLUVdwSGQwRRAB",
            "text": "Tabaré is a total gem. The atmosphere is cozy and inviting with a cool, rustic aesthetic that fits perfectly in the neighborhood. Every dish we tried was full of flavor. The grilled octopus and the Uruguayan empanadas were standouts. You can tell the kitchen puts care into every plate.\n\nThe staff was friendly and knowledgeable. Our server took the time to walk us through the menu and gave excellent recommendations. The cocktails were also top-notch. Creative, strong, and very well balanced.\n\nThis is the kind of place that works for a casual night out, a date, or dinner with friends. I’ll definitely be back soon. Highly recommend."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS2Z3OUxkOGRUel9BRRAB",
            "text": "an absolute pleasure we had here. My wife had a pasta dish and I a skillet steak dish with fries. Everything was excellent. It was recommended by many who live in the area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSWJWQjJkVUkzVnpCSVltVXdaMlpPT0ROUE5HYxAB",
            "text": "Great authentic Uruguayan restaurant! Amazing Chivitos, Burgers, Steak and cocktails!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaWRtcHBkRWRSWVZkMU5uSnJSRGxPYjB4SFVWRRAB",
            "text": "(Photos are from two separate visits.) We’ve been to Tabaré for Dinner and now Brunch and both times were a great experience. The food is always fresh and flavorful! The portions are a good size and the drinks are delicious. The service is also exceptional. We went for brunch to celebrate our anniversary and the staff were extremely attentive without being intrusive, friendly and elevate the overall experience. This spot has definitely become a favorite!\n\nMeals photographed (Brunch): Churrasco a caballo x2, torta de chocolate negro (partially eaten). The drinks we had that weren’t all shown were mimosa, Hendricks, champagne, and coffee. (Dinner from previous visit): Mejillones a la provenzal, Churrasco x2, Alfajor Rústico. The drinks we had were La Sombra and Hendricks.\n\nThe next meals I would like to try are: Croston con Morcilla, Farro Salad, Chivito Completo and Caserola de pulpo & habas."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbjR5dmJmcDhteERBEAE",
            "text": "Low key gem 💎…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPUFkwcWI3a3UzUTd3RRAB",
            "text": "Great food, phenomenal service, awesome people! The food is delicious and aesthetically pleasing, the manager works with the staff on the floor, everyone is so attentive to your dining needs."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjNFV6Rm1NMmxhY0MwMVdWaFBPRGRUVGxZdFNVRRAB",
            "text": "BEST juicy steak and chimichurri and fluffy flavorful empanadas. If you like meat, these people KNOW what they are doing. Also the homemade chimichurri is divine and I always ask for extra. One of my fav spots."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVGtvT0xZNnItaTh3RRAB",
            "text": "The food, vibes and staff are all amazing! I love this place, it is a staple friends night or date night spot for me. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcW5pWUhhaWJUY2FnEAE",
            "text": "My new favorite place in NY."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKU0l1SmJWbzV2MnJ3RRAB",
            "text": "Best mussels ever! The cream sauce is brilliant! My favorite flan ever!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPeTgwN3FrN1pxdnl3RRAB",
            "text": "fantastic food, great service. The drinks are excellent - extra round of applause for the verde drink. Skirt steak was seasoned to perfection. Branzino was tender. The Dulce the leche flan was so rich and delicious. Can’t wait to come back and try their sandwiches."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNalJrS0w1N0tXa1JBEAE",
            "text": "It’s a good restaurant"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYlZpdG1uMjhTN3JBRRAB",
            "text": "My favorite dish Milanese de pollo , so good , delicious ,I love this place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPam83ZDZCX2JXRjd3RRAB",
            "text": "Tabaré is the kind of place where duck in and you think, maybe this will work. We ordered empanadas at the bar, belly to wood, hot pastry in hand, chimichurri dripping onto the plate. It was the first time seeing each other dressed up—whatever that means now I don’t know.\n\nHe said he preferred to sit on the other side of me and I wasn’t sure if it meant something or just a better angle to the door. He ordered orange wine, so I followed. It tasted like holding something in your mouth you’re not ready to swallow. He talked to the bartender. He was good at it. I watched him turn toward strangers with ease and wondered if I was the stranger in that moment too.\n\nBut the empanadas were excellent. Kale and corn. Crisp, warm, honest. They didn’t perform. The chimichurri cut through the softness like a truth you couldn’t avoid. I liked that.\n\nTabaré was beautiful. Maybe the date was too. Or maybe it was just almost."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQSEt6YXY1N3RITW9nRRAB",
            "text": "Great food. Good drinks. The front window is on a really loud street tho"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMDkyMkxBEAE",
            "text": "The hostess who greeted me was warm & jovial. The restaurant philosophy provided on the back of the menu was a welcoming and grounding bit of history. The food was carefully made and portions were just right. I would highly recommend, particularly the \"Chivito Completo\" and the \"Parrillada\" from the specials."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNVA3U1FREAE",
            "text": "Hoy nos atendió Natalia muy amablemente! Es un placer visual el lugar, cálido, con muy buen servicio y la comida es de lo mejor que probé en Nueva York. Recomendable 100 por ciento!!!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveEtHdlZREAE",
            "text": "Excelente propuesta en Tabaré  2. Natalia una crack, súper bien atendidos. La comida espectacular, buena bebida y los postres para terminar algo sublime. Gracias Ramiro por tu invitación y sugerencia de este restaurante en Bushwick. Saludos y buena Vida."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN3RTWDR3RRAB",
            "text": "This place is 10 out of 10, what a gem! Vanessa was so kind! The branzino, crispy in all the right places, and flavorful. The steak cook to the right temperature!!! Oh the sweet potato, chefs kiss!!! So fresh so supple !! And the price is worth it! There is no incentive to write this review, it is just that good. The vibe and ambiance is really nice as well. Tuesday and Wednesday are really good days to come if you don’t want to hit a crowd."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcWFmY25BRRAB",
            "text": "I love the decor of the place. The staff was friendly and welcoming. My friend and I enjoyed lunch.  I would definitely be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRX3VlY3l3RRAB",
            "text": "Lovely little cozy restaurant. The staff is very gracious and welcoming and the food is delicious and quite reasonably priced. Be sure to order the empanadas."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ0xpZHdBRRAB",
            "text": "Absolutely favorite restaurant in the area the steak is soo good always cooked to perfection and so flavorful"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncGNpb2RnEAE",
            "text": "Good deal for brunch"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnX3FqR2ZnEAE",
            "text": "Such a gem! Food was sooo good. Get the Churrasco and Flan!\n\nImportant to note: it's cash or Amex only. But they have an atm in the restaurant."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaDZhWG9nRRAB",
            "text": "This is one of the coolest restaurants. Love the Uruguay decor floor to ceiling. Cash or amex only. That chivito was beautiful tonight a perfect sandwich. Also love the parillada & milanesa. Good drinks too. Man thought chocolate dessert crazy even better with tawny porter"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bVpudXNnRRAB",
            "text": "Everything we had was phenomenal! I came with a reservation for a weeknight dinner since we had a large group. The cocktails were all delicious; I particularly enjoyed the Verde. The Kale Caesar is a must-have; it was honestly the best Caesar salad I have ever had. The pate was another delicious starter. I shared the mixed grill for two and it was definitely a great value, with chicken, steak, ribs, sausage, and blood sausage. Overall I would definitely come back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfamRPZWhRRRAB",
            "text": "What a pleasant surprise!  I only had Uruguayan food a few times in my life and I remember how much I enjoyed it.  Tabaré held up to every expectation. First of all the atmosphere was cozy, eclectic and romantic. We ordered an excellent wine the El Enemico.  My Argentine girlfriend wanted to try one of the assortments of empanadas so we picked the kale and corn which I never had before and it was simply delicious.  She wanted an octopus dish (see photo) which was so uniquely different and juicy.  We split the Civito Completo which I would select over a hamburger any day. It's a grass-fed filet mignon sandwich with a fried egg, bacon, provolone, ham and other tasty additions.  Loved it! Finishing our wine we had the Dulce De Leche Flan for dessert.  Also the waiters were so pleasant and helpful.  The restaurant is not close to where we live, but it's definitely worth the trip.  We shall return!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXNIcGt3RRAB",
            "text": "Recently came to Tabaré for dinner and loved it so much that I came back the next day for brunch as well!\n\nThe atmosphere is excellent - cozy and modern vibes. Great lighting, decor, etc. Bar seating is really nice as well.\n\nFood - most everything was very good. Empanadas, filet sandwich, fries, scrambled eggs, and chicken cutlet were all delicious! The two exceptions were the coffee (both hot and iced were very bad) and one cocktail that tasted very watered down and flavorless.\n\nService here is mostly good, though some inattentive staff can make you wait around for longer than your hoped. What caught me here was some inaccurate/inconsistent pricing. The menu online reflects different prices than the in-restaurant menu. Not by much, but enough to notice. Too, the sign outside the restaurant advertises a $20 brunch (main dish, one drink, coffee/tea), but the menu offers a $8 brunch add on to any main dish price. So most brunch options will be above $20 (some significantly), despite being advertised as such.\n\nOverall, a great experience. Would definitely go back (and am interested in trying the Williamsburg location)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bi1yVXZnRRAB",
            "text": "The place was amazing—the food was good, and the atmosphere was great. Initially, I was thinking of giving 4 stars, but my experience with the service made me reconsider.\n\nUnfortunately, our server forgot our order twice. When the check arrived, I left a 15% tip, which seemed fair given the service. The server, however, became upset and insisted on 20%. This led to an uncomfortable back-and-forth that put a damper on the entire experience. Because of this, I decided to give 3 stars."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcTg2cFFnEAE",
            "text": "We had a wonderful dinner this evening. The food was fabulous. The service was on point and the atmosphere is very cozy and warm.  Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYLXJuaHJRRRAB",
            "text": "My favorite spot to take friends! An amazing meal, beautiful ambience and friendly staff. Start with the empanadas. Get the burger or the steak and you won’t be disappointed! Their pasta is always really delicious. It’s moody and chill which makes it a perfect date spot."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtaUwydGpnRRAB",
            "text": "Tabaré is an awesome hidden gem in Bushwick. Their menu is fantastic and the ambiance of the place is wonderful with dark/orange lighting and as beautiful bar. The cocktails were delicious and the food was amazing. I highly recommend the octopus casserole, seafood pasta, and whatever meats your heart desires!! Everything was absolutely delicious and they have great prices on bottles of wine. Our waiter was very friendly and we had a wonderful dinner, highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBa2ZxdzZBRRAB",
            "text": "The food and ambiance here are amazing! We enjoyed the chicken and cheese empanadas as well as the churrasco and everything was delicious. I would definitely come back, but please note that they only accept Amex and cash!! We wish this would have been posted somewhere beforehand or that we would’ve been informed when we made a reservation so we didn’t have to pay a fee at the ATM in the restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCazctMnp3RRAB",
            "text": "This place is great. I enjoyed the atmosphere and the service. We ordered the ribeye steak that was on their specials, a clam chowder soup, the beef empanadas, the Branzino and desert. It was all pretty good with the exception of the ribeye. I like my meat medium rare or at most medium. I asked for medium rare and got it well done. I’m not the type of person to complain so just dealt with it. Other than that it’s a really good place. I’ll be going back. Oh and the El Gaucho drink is sooo good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMzRYV2xRRRAB",
            "text": "First time having Uruguayan food. Loved it! The ambiance was incredible especially the lighting, and the design elements. Service was excellent. Loved the recommendations from our friendly waiter. Food was amazing. I recommend the Empanadas, the Chivito Completo ..one with meat and one with mushroom option. Looking forward to visiting Tabare soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdDd5bE5BEAE",
            "text": "Amazing food and great atmosphere for a date or to bring family. We’ve been there for dinner and lunch, great lunch special for drink entree and coffee. Every dish is delicious but would recommend parrillada, chivito completo and milanesa de pollo. Friendly staff - cash only or Amex."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOFoyQmFBEAE",
            "text": "📆 2025 update: $20 brunch is gone, new pricing is: plate price+$8 for brunch. Same delicious food.\n\n🗓️ 2024 review: The food, service, drinks are always so good here. I need to come back more often"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdHFxcmNnEAE",
            "text": "We really like this place.  It's cozy, warm and inviting.   The food is very good and the service is great.  The portions are just right and the service makes the prices worth it.  Go and try it!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzN1l1Qmt3RRAB",
            "text": "Can’t believe this gem is not popping with full house!! Come for brunch and pre fixe menu has the best value, a drink + a course + coffee for $20! Food is absolutely delicious, service so friendly and attentive, will give six stars if I can!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyMktlLTlRRRAB",
            "text": "Super cute place. Wonderfully decorated and not super packed in like some places.  Great for a romantic night out.\n\nService was top notch.  Drinks and food came quickly, hot and fresh.  Proveleta was delicious, salty, cheesy goodness.  Skirt and ribeye were cooked just right, coulda used a bit more flavor on the ribeye but otherwise delicious.  We skipped dessert, the choices were too limited anyhow."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMF9QTElnEAE",
            "text": "Was charged $11 for double meat on a $17 sandwich and the meat was thinner than the bacon.\n\nThis use to be my favorite restaurant, to the point where I would come here (og location) about 3x week. Ever since they opened this location the quality has been on the decline.\n\nEven though I moved out of NY, I still come here every time I’m in town. Last month I took my boyfriend to the original location after talking highly about it for weeks, he asked for a ribeye MR and got WD. I had the Chivito with double meat and it was packed with meat for $6 extra.\n\nI convinced him to try the new location since ownership puts more work into this one. We both asked for Chivitos with double meat and after the server asked the kitchen if they would do it, he came back and said it would be $10 extra but never said if it would be $10 for both or each.\nI got my sandwich and pretty much paid for bread. You couldn’t taste any of the fillings let alone the meat.\n\nWe got the check and saw $11 extra per sandwich. Had I known I would be getting bread for $28 I would’ve ordered something else.\nIt’s not about the price, it’s the principle."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUczVPUElBEAE",
            "text": "This place has the most amazing food. Every time a friend comes to visit New York, I have to take them here, the interior is so unique and lovely to look at. The food is absolutely delicious, we always get a couple of appetizers, mains, and drinks. I never have any complaints. It’s also really affordable and filling for the amount of food you get."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXbGN1V0FnEAE",
            "text": "I really enjoyed this restaurant. The decor and  dark settings give that place a very nice vibe. Stake was delicious and there are plenty of signature drinks for everyone. Will definitely be back for more."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPanFXem93RRAB",
            "text": "I loved this restaurant! The cocktails were amazing and I really enjoyed the empanadas!\n\nSecond time back and my experience was even better than the first. This time I ordered the churrasco entree and mussels appetizer. The food is so delicious and flavorful. This place is a must try for ambiance, food and drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdXBTdGFREAE",
            "text": "I’m not gonna hold you, we stumbled upon this place and it did not disappoint! The drinks and food were delicious. The service was amazing and the food was hot and well seasoned! Yall did what yall had to do. The flan and cookie was also delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqd1l1NHJnRRAB",
            "text": "Amazing food & drink in a cozy space with good vibes all around. (*Good to note that it’s cash and Amex only. There’s an atm inside the restaurant by the bathroom.)\nOrdered “La Sombra” cocktail, the beet salad, the sirloin, and the manchego for dessert. Food was well seasoned, fresh, and came out super quickly.\nService was very kind, warm, and attentive. The hospitality was felt from everyone who touched the table making it a great experience. It was starting to get busy and staff was hustling but always managed to check in, including the manager- so thoughtful!\nAlso, I shouldn’t have enjoyed dessert as much as I did. The manchego, quince, and walnut was a delicious bite. Paired with an americano it was a great finish to a lovely dinner experience. Can’t wait to go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMS1xM3dRRRAB",
            "text": "Had a late night dinner here recently. While the atmosphere and service was good, the food was very middling for it’s price. Would not return, unless it’s the only option.\n\nThe Chivito Completo is a brutal and excessive sandwich that makes me sick just thinking about it. Unclear what makes it Uruguayan outside of the little flag and olives.\n\nThe empanadas were delicious while also being the smallest and most expensive empanadas I’ve ever seen."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDZ3BURzFnRRAB",
            "text": "Absolutely delicious Uruguayan food in a beautiful setting with the most welcoming people and experience. The food is mouthwatering, diverse and beautifully presented - everything from the appetizers like empanadas, pate, provolone to main…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMk0zZVNnEAE",
            "text": "Very attentive service, the food was excellent. Make sure you inspect the specials menu. My favorite items are on that menu. I cam here with my dad and he loved it. We had La parrillada for 2 and it was excellent. But my favorite part was the service, From the bartender, the runner and the server, everyone was on point. Reading every facial expression. This is one the best services I've had in my 20 years dining in NYC restaurants"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIN2ZDM0hnEAE",
            "text": "I'M PISSED...we didn't find this place sooner. Only came for brunch but will be back for dinner. Service and ambiance were awesome too. Had the skirt steak and milanese which were excellent but can't wait to try more next time! Soo many good brunch choices for prixfix. Run, don't walk!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpNHNqUWNBEAE",
            "text": "Food Delightful\nDecor Impressive\nService Great\n\nEverything about this place is so enjoyable I went the next night to see of it was a one time fluke, NOPE!\n\nI've now been four times, I love it here!\n\nCome for happy hour, stay for dinner!🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0N182VG9RRRAB",
            "text": "i must say i was impressed at first. very nice ambiance between the music and the happy hour drinks. i very much enjoyed the wine as did my friend. she also enjoyed her beet salad and empanadas. unfortunately, that’s as far as it goes.\n\ni made up my mind on the tabaré burger before i arrived to the restaurant. one would think that a burger with the namesake of the restaurant would be stellar, right? wrong. the burger was flavorless and unseasoned. i actually spit pieces of it out into my napkin because it was so bad. at that point, it didn’t seem reasonable to order anything else because what if those items also tasted extremely bad? i will say they were nice and asked if i would like to order something more, but i declined. i would like to say i would try tabaré again, but i think i would be lying to myself. would the williamsburg location be better? who knows."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxaGJtZjBRRRAB",
            "text": "Brunch prefix is only $20 and comes with an entree, coffee, and and alcoholic beverage. Totally worth it. The food was amazing, the staff was super nice and very efficient, no wait at 3PM.…"
        }
    ],
    "reviews_count": 77
}