{
    "name": "Ayat Bushwick",
    "place_id": "ChIJt3CDMwBdwokRDr_4LWE_M48",
    "grid": "BK4",
    "address": "242 Knickerbocker Ave, Brooklyn, NY 11237, USA",
    "rating": 4.6,
    "user_ratings_total": 969,
    "phone_number": "(718) 766-0635",
    "reviews": [
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oU04xUlVYeTEzWlhVeGRuZFpVWEpDZDJKWVkwRRAB",
            "text": "The food and service service was great!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oS05tRnBZMk4wUmtaRWNWWmlMVVZCWVRSMFFrRRAB",
            "text": "Fast service incredible food!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTFpIaHRkWFZmWlhGUFIxUTFXbkptYWtWNFZVRRAB",
            "text": "This place is phenomenal, the food is so flavorful. Would definitely come back, shout out to Sam for quality service!! 10/10"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORFZHVlpaVFYyV1ROa1lWVkZOME51Vm5CMk9HYxAB",
            "text": "10/10 - our waiter Liz was great, knowledgeable, and very tenative. I cannot reccomend coming here enough the food was incredible!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGd2VEUXRObXhWV25aRFMybEhURWhNVjJsUFlXYxAB",
            "text": "Good was amazing! Liz, our server, was the most kind and tentative server! The food was very warm and comforting, we loved the BYOB aspect and the people were amazing and kind! They knew how to explain the dishes well and were personable."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNd1ZYQnRXVVEzU1VkS2VWUk1ielEzYkRoMVlYYxAB",
            "text": "This was the best meal I have ever had, Liz was an incredible server with a lot of knowledge and hospitality. I cannot recommend this place any more!! 1000% must visit and will come again."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSemJHNWhORXMxZEVWbVpsaG5RMFpVVG14b1dYYxAB",
            "text": "Great food and staff!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTFFUbHJZbHBCWDFac2JteHpMUzFIUm1kRFlsRRAB",
            "text": "Food was great and the staff also!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJelQyVTJRMk15WmtaTGJEVklXWGM1ZDJscVEyYxAB",
            "text": "Sam was our waiter and the best! Such good food and service! So happy I could come and support a Palestinian restaurant!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TGQxRldjR1JRY0RsU2JsQnpiRkZYWDJ4RWNHYxAB",
            "text": "Delicious food, very friendly and nice atmosphere. Food was so hot and fresh and the qahwa coffee was such a nice coffee experience"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweWNqQmxVR1o0YjJ0TmVXbDRTVkkyU0dsU1NIYxAB",
            "text": "Amazing piece of Palestine  in Bushwick.  Was pleasantly surprised. :5 stars"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreVZEaDZRVVJqWkY5aU9WTktURzlqUW5BelNtYxAB",
            "text": "I love the service, always checking up on my table , made everything clear and understanding."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reVFWZGZlVE54ZFZabWVEWkxiUzF2TURZMlVtYxAB",
            "text": "so I ordered this online out of curiosity a few days ago and it was phenomenal! So I decided to take my lady here yesterday and sit down.....\n\nwhen I first walked in I noticed it looked a little un-tidy, like it needs to be swept.. the food was good so I didn't let that stop me. me and my lady were seated near the back of the bar, and upon further examination i noticed that it was debris from the ceiling which is open with foam insulation exposed..\n\nI mean it's EVERYWHERE .... big pieces small pieces, and dust particles, all over the table and plates, floors, EVERYWHERE....\n\nso unfortunately we left, that debris from the ceiling can't be good and there is absolutely no way it's not getting into the food.....\n\nI will definitely be back once you guys take care of that.... good luck"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SFN6RlNRVGR6T0dGRE5WWm9ka0pNTm04MlFVRRAB",
            "text": "Alejo is the best ❤️❤️"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdk5sVm1Oekk1TVZkME5XaEROSEZPZG5Wc1lXYxAB",
            "text": "Do not eat here if you have an allergy. I’m so sad to write this review because I was so excited to rave and share about this resturant and what it represents. I came here for a surprise birthday for my boyfriend, I wrote on my reservation I had an allergy to walnuts and pecans specifically, I even called as well and when we got seated, I told the server before he rang in the food, as well as when the food was dropped. He reassured me it was just almonds (which I’m not allergic to). I was excited and started eating, and halfway through noticed my throat was very itchy and getting a lot tighter. As time went on I started to panic, so I went upstairs to ask him if it had walnuts, he told me “no just almonds”, he reassured me maybe 3 times but I told him there has to be something in there because I can tell I’m having an allergic reaction. Then he proceeded to tell me there was walnuts, and almost make it seem like he told me in the first place. I freaked out and asked the host if she had Benadryl which she didn’t and she offered to get some. I said it was fine and I ran across the street to buy some. If your someone who has an allergy, especially one with a throat reaction, you know it’s best not to eat or drink after because it can irritate it more. So I wasn’t able to eat the rest of the night, the server never once even said an “I’m sorry” or “are you ok” never checked up on me at all, never did anything about the situation. The host was sweet and asked me how I was doing maybe an hour later but that was it. They didn’t even bring out any sort of dessert when I specified it was a birthday, no manager ever came over to talk about the situation, and there was no care at all. As a server myself this upset me so much because of the negligence of the situation in so many different aspects. Overall such a poor experience and I’m so sad about it because I was so excited. I wish this place continued success but would not recommend to someone who is allergic to anything."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUGMyWnpObk01VGpOeGNtcDNSMDV4V0VKWmNXYxAB",
            "text": "Great restaurant albeit crowded"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbVpFTkROamsxVVVaMWFERnFSMHBFUlVKQ1MzYxAB",
            "text": "For my first experience here at Ayat, I have to say it did not fail my expectations. My server SAM from first entry was warm and welcoming and throughout my dining showed what real hospitality and good food can make you feel like."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZeWQzbGxMVkpGVFRJNFZubzBkWEJoYkV4cGVYYxAB",
            "text": "Pizzaswarma was really good"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSFVsUjBWREkzWlZvdFZVWkVlazg0Vm1SNmJrRRAB",
            "text": "Came to this restaurant because I heard good things and wanted to treat my mother for her 50th birthday. Upon walking in we were completely ignored for a good five minutes, not even acknowledged with a hello. We assumed they were just busy and kept waiting to be seated, until a white couple walked in behind us and were immediately greeted and given a table.\n\nWe gave the benefit of the doubt and assumed they had a reservation, but the couple told us they didn't— we were just blatantly being ignored and treated like we didn't exist. We told the waiter that we were there first and he said we still had to wait for him to seat them first. The couple felt so bad they even came out to apologize and offered us their table. The restaurant was not apologetic as all. Just plain racism. Insanity."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcFgwaHlhRzFQTW5ORlltcE5jRVIwYW5sWlgxRRAB",
            "text": "One of the best restaurants in NYC"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKR1JGSTViSFJUY0hwdUxWVTBUVmRHVm1wU00yYxAB",
            "text": "The food was decent and the portions were generous, though the service left room for improvement"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNjVEa3ZBRRAB",
            "text": "They finally fixed the long wait time for delivery"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGaFdXTXlhVE5SWmtkQk0zbGpURFZ4TTFwUU1WRRAB",
            "text": "Always\nYummy\nAll the\nTime"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRk5rVm5jbUpmT1ZSc2EyNHRlbVpOU3pCd1JXYxAB",
            "text": "Taylor was a delight, one of the best servers I've ever had. Food was phenomenal and the music was nice too, but mostly Taylor was killing it and deserves a raise."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMVpYWmpXVUZwZG1GQ1JtVk9jelpKUTA1T1VsRRAB",
            "text": "Taylor - 2 weeks in & she’s the star of Ayat. ALSO the food was PHENOMENAL"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTlFUUmFOWEJrVWxVMVVsWnRWMDFzYkU1amJIYxAB",
            "text": "Taylor is the goat - first experience and one of the best restaurant experiences + the fool is phenomenal"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRWMxUldSWFF3WTNsSVUwSjJURjlmZEc1bFJIYxAB",
            "text": "Such high quality food and huge portions. Miguel was a wonderful server! Thank you for a great experience we will be back! The hummus was one of a kind."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVGJYRXdjakUzZFhscFdsWk1RVFJrWDFselZIYxAB",
            "text": "Great food, great service, great atmosphere."
        },
        {
            "date": "1주 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVldXVk5ORlphTUZBM1dEbE1WRlJPT1dkUFJVRRAB",
            "text": "Mansaf 羊肉饭很好吃 - 酸奶酱里加了羊肉汤，拌在肉上饭里，羊肉香味浓郁到让人吃的停不下来。"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeWVVMVNhV0pFUkhac1IzbFlNVlo1ZGtsbVNIYxAB",
            "text": "Truly outstanding absolutely delicious"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSVp6ZFdRbFJyU1hSZlRHSkJTRkIwU0VsYU1IYxAB",
            "text": "What an unfortunate situation — this restaurant was on my bucket list. Unfortunately, the experience was spoiled by the less-than-professional behavior of Natalia.\nThat said, the restaurant itself tells a wonderful story, backed by an amazing menu. The atmosphere truly reflects and supports the spirit of the people of the land.\nSpecial thanks to Susan, who made things better for us.\nConstructive note: Please avoid serving Arabic coffee in a glass tea cup — you know the culture better than that"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQlJWOVJVMFZQTFdwQlQwUk1RV3RHVVdWcloxRRAB",
            "text": "Went for a birthday dinner. Service was accommodating and friendly. It was BYOB and we brought a bottle of wine and there was no corking fee. Food was good across the board. Lots of vegetarian/vegan options. We got: baba ghanoush (smokey), fried halloumi, vegan platter (too many good things to list but especially liked the zahir and wara dawali), and the grilled salmon salad. Reasonable prices. Will definitely come back again"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNE5UQm5RVFpRYlZWTFVGRlBVakIyZDNSbGFVRRAB",
            "text": "One of my favorite restaurants in New York."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMExYUXRUVkpWUWxoWlZuTlNhVzFXYms4eVRHYxAB",
            "text": "Very traditional yet innovative\ncan’t beat the prices\nFood was very tasty\nGreat service\nPopular in the neighborhood\nLook for the tree in the restaurant\nClean bathroom"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWeFZEaDFjV2d0VVZoTFpqZGpSMTh0VVdKTllXYxAB",
            "text": "Seriously awesome food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pST2ExUjZTamRYYlRFdFJFZElaVVZ1TjIxZldXYxAB",
            "text": "Very delicious food, great quality and big portions and reasonable prices.\nStaff are very polite and helpful and service 10/10\nThey take a little time to prepare the food but all the food is fresh and hot."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnakxTNEx3EAE",
            "text": "falafel was so incredible i almost cried\n\nedit: steak salad is not good"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeVRUZzBkbmx5YUhSRlVVeFFWRkZ5TTBkZlVtYxAB",
            "text": "The place and atmosphere are beautiful. We had their fired-oven pies, which were extremely delicious, highly recommended. Overall positive experience, little pricey though"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSVVHcDZZMWRTUTJoQ1UxSnFXR1phVWtvdFRYYxAB",
            "text": "Ayat, can only be described as a euphoric dining experience. This restaurant has quickly become a favorite among friends in the city. The atmosphere is incomparable, cozy enough for conversation but busy enough to hear the laughter and joy around you. The food is indescribable, beautifully seasoned with unforgettable flavor. The staff is also incredibly kind, and very thoughtful in their service.\n\nSome menu highlights were the halloumi watermelon salad (truly life changing), the Pistachio Paradise Pizza, and the Chicken Shawarma. All dishes were amazing, but these were each unforgettable. Ayat is the spot to go if you want a unique and outstanding experience in a homey environment with beautiful ambiance. This is a must-try restaurant, I’ll be taking every visitor I have!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSU9EVktlVk5aY0hWclMzWm5XVzFoWmpSSVgxRRAB",
            "text": "Had a great meal, good food, generous portions, waitress Sam was very kind"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQldYRTJaWFpQUnpsVVFXWm1VMkowZEdsSlFrRRAB",
            "text": "Sam was such a great server!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neVJHRTBZVWxJYnpSUFVuTkdWVXhITUZaVFMwRRAB",
            "text": "I've always been happy with the food, but I feel inclined to leave a review about the fact that they removed Sides from their delivery menu on all platforms. I used to order delivery weekly, but now I can't get extra shawarma portions, so I've stopped ordering. I miss it! I thought it might be temporary, but it's been this way for a few weeks now. I see they still have sides available for pickup on their website, but that's not usually feasible for me. I'm hoping that maybe it's a mistake that can be fixed soon.\n\nEdit: It looks like they fixed it! Yay"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMWEycHBaWE5CV1dKWWRtZDJUVTFqTlVNd1VXYxAB",
            "text": "Wonderful place with very friendly and helpful staff. Yulisa was particularly helpful and friendly and made our meal experience a splendid one. Food was so tasty and interesting. We eat a lot of salads being on keto therapy and these were interesting and flavoursome."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neU5rWkdkalZ5UzA5MWFYWTJlRXBNVDJ4bk1XYxAB",
            "text": "Excelente comida , sabores  muy típicos de la región sutiles y naturales ingredientes  lo recomiendo"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WlEwSmtVM1JvVW14S1UxWnhhVVJSWWtWNVpsRRAB",
            "text": "Great food! Sam was awesome."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVME4wNVRaRGhRT1Mxc2IzbG5XbXRXZEc4eWJIYxAB",
            "text": "Beautiful restaurant with delicious food! Sam is great! Super attentive and nice. Will definitely be back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUWJHOWlTRTVmUlVkeVlraHhkbTFUT0hFdFRrRRAB",
            "text": "Sam is great! Attentive and gave suggestions. The food was delicious!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kYWJXYzBNMXBZUW1OYWEzWjVlWEZxZEZGSWFtYxAB",
            "text": "Here visiting New York and stopped into this place, such a delicious meal! The eggplant and Sahlab were soooo great. Sam was a kind and attentive server, couldn’t say better things!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkZlRtZHFWVE5xWkVaWVpXZzJjekJoVVhBM2VHYxAB",
            "text": "this was awesome, definitely coming back, Sam was an amazing server!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rdFlUWjROSFJDUjNORGVYaFBPRGhLTlZWNVFYYxAB",
            "text": "We had a wonderful time at Ayat. The food was delicious and came with free-flowing pita. The service was excellent (Shout out Sam for being so tentative!). And the restaurant was nice and spacious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toemJXOXNNbEYwUmxkQ2VHeGFibUZQVmpKUVZVRRAB",
            "text": "The service from Lissette was excellent – very kind and attentive the whole time. The food was delicious and different, full of flavor and beautifully served. I loved the pita bread, so soft and fresh. I tried the Hibiscus Margarita (the purple drink with mint) and it was amazing, super refreshing and unique. My dish was the Mixed Platter, a perfect combination of chicken, lamb, yellow rice, and veggies – everything was spectacular!\n\nDefinitely an experience worth repeating. 💚"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aE5qVlRSSEpFU0VwTldqRnFUMFYwU1ZoV1JGRRAB",
            "text": "I had such a wonderful experience at Ayat! The food was absolutely delicious — full of flavor, fresh, and beautifully presented. The atmosphere was cozy and welcoming, perfect for both a casual night out or a special dinner.\n\nOur server, Yulisa, made the experience even better. She was so attentive, kind, and knowledgeable about the menu. She made great recommendations and checked in at just the right moments without ever feeling rushed. You can tell she really cares about her guests having a great time.\n\nI’ll definitely be coming back soon — everything from the service to the food was amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbU1YWkNYME5FZWxoYVUyWkpZMnAzWjJGU1ZXYxAB",
            "text": "I’m very picky in a way that I know enough about ingredients and cooking techniques so  believe me when I give them a rare 5 stars from me. Top quality ingredients, hummus was silky smooth you can taste every subtle flavors because they use good chickpeas, spice, and olive oil. Then the mixed grilled platter with lamb chop/ kebab were outstanding. Juice clean fat and well cooked.  Desserts are pretty but too sweet in my opinion. Wonderful service our Ecuadorian waiter was excellent!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKU09YaFVjMHRXVG1KSFowczBMVGxXVm1kbloxRRAB",
            "text": "I absolutely loved dining here. The cuisine was delectable. The staff were lovely, especially Suzan. The live music tied everything together. This was the perfect birthday experience. I would definitely recommend everyone come and visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQ2MwbFZNMjk2YWtSM1ZqQlVUVEpKZUhwcWNuYxAB",
            "text": "Place is gorgeous! Food was alright. Service was alright as well.\n\nDon’t get the spicy chicken kebabs - subpar at best! The chicken sumac dish was good - very mild taste thou.\n\nI’d go back to try other dishes. Didn’t love what I had.\n\nThe pita and hummus was great thou!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQlUzRTNlV0o2VlRsTVExUk1XSEJVUlVoQmFuYxAB",
            "text": "Honestly everything was phenomenal. We got the Mezze Filistini, the Makloubeh platter, the Watermelon Haloumi salad, roasted cauliflower, and the Baklava Sundae. All the dips in the Mezze were stunning—best tabouleh I’ve ever had. And a huge shoutout to that watermelon haloumi salad, it was revelatory. Like, I didn’t know food could taste like that. Really nice atmosphere, overlooking the park with open concept, and also it was a Saturday and they had live music!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNFZrSlpkekZyYjFVeGNIcDJlREZzY0ZsV1RGRRAB",
            "text": "We celebrated our friend’s birthday here and had such an amazing time! The food was delicious, the drinks were on point, and the place has such a great vibe. Definitely recommend checking it out. Special shoutout to our waitress Suzan she was the sweetest and made the night even better. Thank you for the great service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcFJ6Tm9aVmRyZHpaVU4xUnhVMnRpTjNKRVUzYxAB",
            "text": "Bushwick branch of the Ayat Palestinian restaurant network in the NYC region. Was pretty crowded already on an early Friday evening. The location also opens a small patio facing the Maria Hernandez Park so you may want to target that.\n\nFood:\n- at this location at least, not that amazing. Pita is flaky and thin, and nicely flavored. You can have better in the 5 boroughs area, sure.\n- hummus: my dinner companion is bit of an expert and according to her (I concur), it was heavy on the tahini and lacked bite (traditional Palestinian hummus can be a bit creamier than other Levantine recipes so this may well be true to design). It is nicely presented in a traditional earthenware bowl, as is most of the food.\n- Shawarma platter : we got the mixed grill version. The rice and toppings were generous and the meat was flavored though not excessively\n- Fattoush: nice and lemony, with a good helping of fried pita chips\n- We asked for kibbeh, and only after 15 minutes of waiting, were told that they had none!\n\nOverall: not the best nor the worst Palestinian food you’ll have in the region. Service is a bit klutzy.\n\nOrdering tip: the shawarma platter is pretty large. Can satisfy two people (with a starter like hummus) if you are not ravenous.\n\nPhoto of mixed shawarma platter, hummus, and fattoush attached"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCS2FsVmFXRWxzTW1GS1pFdDVaWHBZYTFoS2FXYxAB",
            "text": "Hands down one of my new favs in the neighborhood. My friend & I shared the hot appetizer mix and mix shawarma. It was the perfect amount to share and we had ample leftovers for later.\n\nAtmosphere? Lovely. We had lunch on a nice summer afternoon & they had the windows open. It was nice to hear the hum of Maria Hernandez while enjoying your meal.\n\nGreat place for an afternoon snack, date or just a yap session with a friend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVFgwZDBURXhrWm5CSVVscGlTWE5RU0ZsUWFXYxAB",
            "text": "We received complimentary pita bread fresh out of the oven such a nice touch! The hummus was delicious as an appetizer, and the lentil soup might honestly be the best I’ve ever had. I also really appreciated that they don’t go heavy on the salt, but my cucumber and tomato salad ended up way under seasoned  it definitely needed a pinch more.\n\nAs for the service, our waitress seemed kind but very out of it. She looked tired and sad, like her body was present but her mind was elsewhere. She kept forgetting things, tripped over her feet a few times, and even dropped the dressing. Service felt a bit off, but I genuinely hope she’s okay. It left me a little concerned."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseVRFWm9RMHRvVDA5bE1YWlJiVzl1U1cxRGIxRRAB",
            "text": "My friends and I stopped by Wednesday night.\nThe space is beautiful and calm.\nThe wait on the other hand was not calm. We were starving and waited over 40 minutes to be seated - (no reservations).\nService was sllloooooooowwww.\nThe waiter was not friendly , slow and challenged me when I asked to remove coffee from bill.\nThe Arabic coffee was awful. We literally had to ASK for milk for the coffee. They didn’t have creamer.\nI had the spicy beef , it was good.\nMy friends enjoyed the Hummas.\nMajority of the food can serve 2.\nNo chance I get I will ever return.\nWe spent about $36 per person."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GblVtVmlVQzFIY0VwYWJFWldZM0p5Y0c4NVRIYxAB",
            "text": "Phenomenal, fresh and delicious food! Came here for brunch/lunch with friends and we had a lovely time in the gorgeous space too. Very friendly service. An honor to enjoy so many Palestinian dishes! ❣️🇵🇸🫒 ah the olives and olive oil were my favorite!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKR1dVcFFTVlZFTTJsc1p6UnpZMXBzVVVFdGRYYxAB",
            "text": "This spot is always a 10/10. Informed and educated waiters and staff, delicious food with huge portions, and it’s BYOB!\n\nThey also have different atmospheres, outside, inside, and downstairs - each with their own vibe."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNVRFcGhhblJCU0dkcVpFNHdjazFJYTFFMGJVRRAB",
            "text": "Everything we ate was absolutely delicious!! The service was great, the aesthetic was really nice and the staff were so welcoming (shout out to Suzan). Some of our favorites were the Mezze Filistini, the Za’atar Margherita pizza, Lamb Kebab, the Fattat Jaj, and the WATERMELON AND HALLOUMI SALAD!! 100/10 would recommend 🙌🏾🔥"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVGJqVmllazR5UmpkVlpYSjRTWEJPWkZsblFXYxAB",
            "text": "I wanted to come to this place for a while and finally had the chance to dine in! So happy with the food, the atmosphere and the service! Our server, Sam was amazing! Looking forward to coming back 😊"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OeVlWZG1ZVGhFT1hGQk1rZzFVbEZJVlVaSlFXYxAB",
            "text": "Had a great night at Ayat! The food was delicious, the atmosphere was warm and lively, and the live music added a nice touch. Our server, Senua, was fantastic—friendly, attentive, and made us feel right at home. She gave us great recommendations that we really enjoyed. Looking forward to coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOT0xYVjFjbTQ1ZVVGb1RXUXhZelJFYTNaZmVsRRAB",
            "text": "A bit underwhelmed by my experience mainly due to the food. Environment was beautiful. The service was fine but the food itself, a bit bland. I've tried the Ayat in Industry City years ago and loved the food. This time around, not so much. I got the Pizzawarma and it was very mid. I mistakenly thought it would be closer to a pizza but it was more so a dry calzone."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdFdqUkdTekZFU21kaGVYaHlYM0ZTVGxKYU5XYxAB",
            "text": "A bit underwhelmed with my dinner at Ayat. The atmosphere was nice, but the food could use more seasoning. The lamb kebab was so tough, I couldn’t finish. The cigar roll appetizer and the hibiscus mocktail were the stars of the night, but everything else needed salt. Some flaky salt on the hummus would set it off. It was also hard to hear the waiters, but they were nice enough. All in all, aesthetically pleasing but that’s about it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4elJqRnRlaTF5YjBzMGNqSkdNMDB5YkVaVFlrRRAB",
            "text": "Amazing people. But the food was not worth it for me at least. Ordered the lamb chops and it came out too dry.\n\nPro tip: don’t load up on the bread even though it might be so tasty and tempting."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMk1IbGZVV3d4YWtoU1lWOW1OSEJtTVdkZlVYYxAB",
            "text": "100/10 Food was absolutely delicious, big portions as well. Yulisa was amazing super attentive & quick. Definitely coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeldUSXdlbEY1TFZCSVUwMVFTemRNZUdjeU5YYxAB",
            "text": "Great food! The watermelon salad was a 10/10! Everything came out so fast and fresh! We got to bring our own wine; it was the most wonderful date. The star of the show was our sweet server Yulissa, who was so kind and attentive. We will be back :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLZWRwcXFLODRYd2F3EAE",
            "text": "10/10 no notes!\nAmazing food.\nGreat service, even though there was one waiter for Sunday brunch service he held it down with the busier!\nBeautiful restaurant and a breath of fresh air on Knickerbocker Ave.\nThis place is also BYOB!!!\nWe will definitely be back. Go here!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQQzRtYTNVdGV2Y2xRRRAB",
            "text": "Excellent food and atmosphere. Service was lovely and I’m so glad I stumbled upon this spot while walking around. I wish I had others with me so I could try other things but the falafel, spicy chicken, and baklava were all delicious!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dnRDcEtnEAE",
            "text": "This place has so much potential! Came here with my partner ordered a salad, an appetizer and an entree. The wait time was pretty hefty salad came almost 30 minutes after order was placed and entree came maybe 20 minutes after & after we were done we finally got the wings haha. Rice was room temp not even warm!! Meats were dry but well seasoned! Usually I can appreciate a good wing, these were too smoked almost tasted burnt. Salad was the best thing about our food that night. However like I said definitely has so much potential!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeVoxbG9VMnBrYzBSWWNUVkhWSEU0UmtFemQzYxAB",
            "text": "Suzan was a great server!! She gave insightful recommendations on the menu, was very attentive throughout, and was overall very nice and sweet. Will definitely be back and recommend to all our friends!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twR2VtaElibWxZT0hCaVdrMXdVMmRrYjB4UVExRRAB",
            "text": "The Halloumi & Eggplant plate was delicious!!! Loved the tree inside the restaurant and the mint mocktail was very refreshing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYTdfOVh1di1mU0VREAE",
            "text": "Recently went to Ayat Bushwick for the first time. It came highly recommended and I wasn’t disappointed. We had the Labneh, Cheese Cigars, Chicken Shawarma and Fattat Lahma. The chicken shawarma ranks as one of the best I’ve ever had! Our server, Senua, was excellent and helped us make some menu decisions. I will return in the near future."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRU5GaG5VMWxmZWtkYVFsWk9TSE5EZWpodU9HYxAB",
            "text": "We had such a great time celebrating my friend’s birthday here! The food was delicious, the service was excellent, and a big biggg bigg shoutout to Levis and Suzan for making the evening extra special🩷🩷🩷. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sZmFYSlVOVVpzY1hJdFR6Tm5jakZwVEZKdVRrRRAB",
            "text": "This place is magnetic and the food is so flavorful, tender, and fresh. The restaurant is so precious and well designed and the plates make it such a high dining experience!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMFRESlBRbTlXVlU1ek5ucHZVaTFKYkRaSldtYxAB",
            "text": "Tasty food with large portions. Great atmosphere.\n\nService was good. Food came out quick."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMllVMDJaelpqUkdnNFRIVnhhekJqTkVaZmEyYxAB",
            "text": "The food here was amazing, we scarfed down everything we ordered! Senua was spectacular, so sweet and helpful!! Will be coming back very soon <3"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNlEyRmFkV1F3ZEVWcVowMU5aR1YwU2tobFpsRRAB",
            "text": "I went here for my birthday on 7/20 and had a terrible experience all around. I’ll start with what I did enjoy:\n\nAtmosphere: The architecture of the restaurant was really pretty. We went on a Saturday evening and they had a live band playing downstairs. 8/10\n\nWait time: We made reservations for my birthday, so we were seated almost immediately. However, the wait time for the food was TERRIBLE and I cannot stress that enough. Server said the kitchen was “backed up” but they kept seating people!? We waited 2 hours for our entrees. At which point we weren’t even hungry anymore because we also ordered apps and drinks. Our server also lied, but we’ll get to that. Completely unacceptable. 1/10\n\nFood: It all tasted rushed. We felt this way before the server even told us about how backed up the kitchen was. Palestinian food is usually flavorful, dynamic, pungent. Our food was bland and overly dry. 2/10\n\nService: Our server was truly terrible. I don’t even remember her name, but she had red curly hair. Forgetful, misinformed and disorganized. The food runner brought a hummus to our table that wasn’t even ours. 10 mins later, our server removes it and gives it to the correct table.\n\nShe was also deceitful. We asked her if the family platter (entree) would be enough for 4 people (all women, one being a teenage girl), and she rejected “Oh nooo, you’re definitely going to need to order for 5”. So we listened. We ordered an appetizer platter and drinks in the mean time. 2 hours later, she brings out a tray that feeds 10 people!!!! The table next to us even gave us strange looks because there was NO WAY 3 adults could eat all of that!!! We believe she intentionally lied to get us to spend more money. The food was wasted! We couldn’t even eat it! Considering that Palestinian children are being starved, this is completely unacceptable!!!!\n\nWe expressed to her that we were upset and she said “I’ll see what I can do for you.” She ended up comping $30 worth of drinks off the bill but even still, the damn bill was $430 for 4 adults!!!!! This is absolutely ridiculous.\n\nI came here on my birthday to have a nice night and support a Palestinian business. I ended up leaving feeling taken advantage of. I will be contacting you all and I DO NOT want to speak to a manager. I want to be directed on how to get in touch with the owner, because there is just NO WAY that anyone could be proud of this experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdVZtTXhVSEZyYWtVM01uQjFOMUpYVEU0MVZuYxAB",
            "text": "I like to support the businesses in my neighborhood, I've always been curious to try the food at this restaurant, this time I got the courage and tried an orchata as a drink which was good (a little too sweet for my taste), and I ordered a chicken shawarma with extra garlic sauce which was my favorite part, the fries were cooked to perfection, I asked for my check and went home happy, I just have to try the dessert, I will return with my family and leave my review again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnb2Ffbzl3RRAB",
            "text": "Ayat had amazing service and food. Rahim was our server for the night and was very accommodating. The place itself is beautiful and plenty of seating is available. The food was amazing- we ordered the pizzawarma, chicken kebab and beef kebab. The artwork and presentation is very thoughtful. I would recommend this to everyone who visits New York."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeFZtdGhVVk5HZDJ4bWJGZFhVRk50T0VkdFVtYxAB",
            "text": "Portion was HUGE and very good.\nThe yogurt sauce can be a bit heavy. I will continue to come back!! So good!!!\nSAM is a good waiter!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMFlWTTVORlUwTkV0eFVsSTNkbWwyVTNGSFpsRRAB",
            "text": "Dropped in around 8:30pm and it was the best decision. It was an amazing meal and my friends and I enjoyed our time. The staff are kind and friendly & the music and atmosphere is very cute."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WT0xUWlZWWEJTTWpSM2MyaENXRWRLVVZaWFpIYxAB",
            "text": "Kristina was absolutely amazing. Her recommendations were so flavorful and made the experience a 10/10. I’m so sad I don’t. Live here because this would be a regular spot <333"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBX3RYWlp3EAE",
            "text": "The best service I’ve had in a long time. The food was fresh and so good! The atmosphere was beautiful and love the attention to detail including the menu which gave us some historical facts. The prices were amazing! I left with extra food. Def coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLcWJfSmJnaThDRmhRRRAB",
            "text": "had the most DELICIOUS meal here with super personable service. fresh pita, fresh drinks and the baklava was unreal. thank you!!! will be returning"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfa1B6U0JREAE",
            "text": "Chef Ahmad is spectacular. His service, food, hospitality, and warmth is so beautiful and contagious. I loved every part of the experience and the food was cooked to perfection. I thoroughly enjoyed it and as a palestinian the food really hit close to home in every way.\n\nUpdate: came again, had such an amazing time, Suzan was so good and made us feel so special."
        }
    ],
    "reviews_count": 90
}