{
    "name": "Yia Yia's Taverna",
    "place_id": "ChIJD11mXA9dwokRPfxG_khL2vs",
    "grid": "BK4",
    "address": "1035 Flushing Ave, Brooklyn, NY 11237, USA",
    "rating": 4.5,
    "user_ratings_total": 718,
    "phone_number": "(718) 821-5900",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQ1oxUlNVa2R3YUhCeVNXUndabG80V1ZGaVdtYxAB",
            "text": "SO AMAZING, really chill atmosphere not really packed, food amazing- simple yet so delicious- all food is not prossesed- French fries = real potatoes 😋, also prices are great too !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1a2RXOXdOVGxMTVdaeVpGZENOMk5xZUV0c1ZtYxAB",
            "text": "I’m hungry, having a busy day and needed something quick to eat. I’m thinking okay this looks like a fun little spot. It’s nice and cozy on the inside but I got my food to go. I got a chicken gyro. How can you mess up a CHICKEN GYRO for crying OUT LOUD!!!! It was dry, tasteless and had literally two pieces of chicken in it.. SHAME on you people!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbk5HSlFjSE5oVW5kWGJpMWlRbFpDVTBaVmNYYxAB",
            "text": "Terrible customer service. Rude staff, especially the Latino in long hair, with deep voice. Short and stubby."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdmN5MVJSbUV4U0V0VmQxaFVSelp4WkVKTVMxRRAB",
            "text": "Bad customer service, and this isn’t authentic Greek food. Everyone inside is Latin. Mexican in specific.\nNot one Greek person inside."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRlRuVkxOSHA0Y0Vad00zTktRVGg2U1VkS05FRRAB",
            "text": "Got the lamb gyro + moussaka for 2 people to share & it was the perfect amount of food. Stuck to basic dishes since it was our first time here and glad we did - this was one of our favorite moussaka’s outside of Greece, makes me happy I don’t have to travel all the way to Astoria to have authentic tasty moussaka. Service was friendly and outdoor seating was perfect on a summer evening."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNFRsaExjRWhRZW05T2RWQTFNVWQ1WVV3MFEzYxAB",
            "text": "Best moment ! Thanks you Rebecca"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWmEycDZVSEpDWkhvemVYQTFPRmsyV0VkR01WRRAB",
            "text": "This place understands what customers want. Their dishes arrive at the right moment. This place delivers on atmosphere, on food and on everything else. Staff members handle special dietary needs carefully. The area is better with this addition."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbXQ3Unl3RRAB",
            "text": "This is our third time visiting here and honestly can’t get enough of this place… Absolutely incredible each time!  The gyros are to die for “lamb and shrimp” and you can’t beat $4 house wine.\n\nManagement had changed this atmosphere like 180... they dont acknowled the signs out front"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNeVMyOVdRbE5TUlZaWVUySjRSeTFoTFhJeE5YYxAB",
            "text": "Most misleading and lie\n\nDoesn't exist...only full price, after traveling all this way"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jM1VXdzRjbXd6T0U5a1ExTktXWGxVUlRod1UwRRAB",
            "text": "A Truly Authentic Greek Dining Experience\n\nAs a family from Athens, Greece, we’re often skeptical when it comes to Greek restaurants abroad—but this place absolutely blew us away. From the moment we stepped into the beautiful yard, we felt right at home. The atmosphere was warm and welcoming, with stunning art on the walls that added a cool, creative touch.\n\nThe service was exceptional—everyone was incredibly friendly and attentive, making sure we were taken care of throughout the entire evening.\n\nNow, the food… every single dish was a hit with our entire family. Everything tasted unbelievably fresh and flavorful. The grilled octopus was a standout—cooked to absolute perfection with the ideal texture. That was my personal favorite, although honestly, it’s hard to choose because all the dishes were outstanding.\n\nThe lamb was another highlight—juicy, tender, and deeply flavorful. My family couldn’t stop talking about how impressed they were with each bite.\n\nThis restaurant truly delivered an authentic Greek dining experience, and we left feeling both full and happy. We’ll definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWE1WZFNTMnROYURaa09GRnhWMTl2YjBZeFlsRRAB",
            "text": "En varias ocasiones y buscado pedidos al restaurants y la persona que atiende me trata de mala manera, no solo ami también a otras personas, muy mal servicio"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twM2NFcHFXakJSUnpOM09XVnBWSFpxTVZOT2FHYxAB",
            "text": "Unfortunately, this was a very disappointing experience. The food lacked flavor entirely, and the lentil soup was nothing more than plain lentils with sauce on top. The staff gave off an unpleasant vibe — they seemed dissatisfied, and it reflected in both their service and demeanor. The music was loud to the point of being irritating. Prices were unreasonably high considering the poor quality of the food. Aside from the music, there was nothing here that truly reflected an authentic Greek restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMllrdE1WVlZvVTBOaFltdFJTVXh5U0ZoeE1FRRAB",
            "text": "Bad service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RlZYUjJTREpzVTBSbWJXRnJOSGd5VWw5WWNGRRAB",
            "text": "Good healthy food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pablRHNUpRMjlwZVhWRlpIWjVaVXhVV1ZWQ2VYYxAB",
            "text": "My experience depends on service quality. Their service team handles everything expertly! I was blown away by the quality of this place! My food choices were flavorful. Yia Yia's Taverna has me planning my next reservation."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTU1sSjViMnhUZFdabU5FczVPVkpNU1VJeFRXYxAB",
            "text": "Great food but was charged more than the amount I wrote in my total."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWWRGUkpOMW80ZVVkQmFsSkRaek00TkVveFkwRRAB",
            "text": "Очень вкусно"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FdFl6ZGlSVFZ1T1dFM2RYbEJaMU5yVFdaVlYwRRAB",
            "text": "Best Turkish coffee and chicken platter I’ve maybe ever had"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsS2JESkJWRE5LTUVseFNGcFJUMGxPUlVkcmMwRRAB",
            "text": "Happened upon this lovely little restaurant after thrifting in the neighborhood. What a wonderful meal we had! Service was quick and friendly, food was absolutely delightful. Flavorful chicken kebabs, a light and refreshing salad and delicious home cut fried potatoes. We ordered the famous frappe to go, and it was awesome on a hot summer day. We will definitely be back to this gem of a Greek restaurant! Street parking at meters."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUlltbFpNMEpPY25FNWQwUmhWVlZrYzNCNFJWRRAB",
            "text": "Excellent Greek food in a lively tavern with a covered back patio. There is a happy hour for cheaper wine/beer. Highly recommend the grilled Kalamari."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdmEzbHNVMjVxU1VsUGFWcGliR0l5Y0RSR1RGRRAB",
            "text": "A chill and almost hidden spot in Bushwick ( the Disney land of adult life in NYC). If you are craving for noncommercial Greek food, with a hint of authenticity, it will be a great spot to start."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYk1qcG10M0s3TTRBRRAB",
            "text": "First time and everything was perfect.  From drinks to the main course. The staff checked on the table quite often, even got a wine refill on the house.  Warmer months request the patio.  The Branzino fillet was more than expected and worth the price! Oh and the side order of rice is plenty for more than 1 person."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOcV81ZXlic0pqcVpREAE",
            "text": "everything was so delicious this was my favorite meal ive had in a very long time"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKemI2TzdyM0w3VzFnRRAB",
            "text": "The food tastes of the love that made it. The owners care so deeply about where/why/what/ they are as much as WHERE THEY CAME FROM ((u can’t make these plates in ur apt.)) Thats why u come here. To their home for you.\nIf u meet the chef ask them about their necklaces and might I suggest the grilled octopus and the lemon potato"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKeU05Wm56eDdXMXR3RRAB",
            "text": "The place is embarrassingly dirty. Cushions had hair, crumbs, stains. Hard to sit and hard to enjoy the food. Believe me the photos don’t show enough. Surprised this place has 4.5 stars as it looked really sad."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLWhzZHJLN3RTcWdBRRAB",
            "text": "Great grilled calamari!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa3ZMZmRnEAE",
            "text": "The grilled calamari is amazing. Horiatiki salad and tzatziki were also very fresh. The large salad was more than enough for 2-3ppl. Only disappointing thing was the lamb slouvlaki, which was very dry"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMU1XY3FBRRAB",
            "text": "I wanted to try this spot since I work food delivery apps and pick up here frequently. The day I order and pick up some guy pulls up in his suv and goes to the basement and whips out a hose and starts to spray his car down with no regard to me and another delivery driver. I was told to wait outside by the lady inside maybe she thought I was a delivery driver. That is no excuse in 30°F weather. The guy washing his car did not say a word to either of us and proceeds to splatter us both with recoil water. He could care less if we got wet. I don't know who he is but clearly he works there. Suffice to say I will not be going back witnessing firsthand how this person treats a paying customer and delivery drivers."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaXAtVWxRRRAB",
            "text": "Behavior so bad"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvZ0lfcWxnRRAB",
            "text": "Delivery so late and don’t have a parking outside of restaurant , longer wait time outside"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMy1IS1BnEAE",
            "text": "I went here for date night and it was a great experience. 10/10 would recommend, the food was great, the service was welcoming and the music was fire. The staff was attentive and went above and beyond when they noticed my boyfriend was not a fan of the galaktoboureko, as he tried it for the first time. His review is not valid bc he’s a picky eater lol. But they came over and handed him a different dessert to try which definitely hit the spot for him. Definitely coming back when in the area!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbjgyWFVBEAE",
            "text": "They are stuff is not good and delivery food make so late and they are don’t have Parking place outside,"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbjhYV1dnEAE",
            "text": "The food quality is not good, employees behaviour not good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbjdDNU1REAE",
            "text": "employee Behavior not good. Delay in food delivery. no parking. The food quality is not good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNzkyWUt3EAE",
            "text": "employee Behavior not good. Delay in food delivery.\nno parking . The food quality is not good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNy1uejR3RRAB",
            "text": "bad implement"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaVBEVTNnRRAB",
            "text": "Me encanta siempre son muy amables y la comida es deliciosa"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJXzRMNUVnEAE",
            "text": "For 5 years now, I’ve willingly have traveled over an hour to dine at Yia Yia’s and it still remains as the best Greek culinary experience in all of NYC. As someone who travels back and forth to Greece, I know my Greek food and this is one of the best there is. Not only is the food amazing, the service here is unlike anything you’ll experience elsewhere. The warm and caring hospitality from the owners and staff is truly exceptional, making every visit feel like home. From the perfectly grilled octopus to the hearty chicken souvlaki platter and the comforting moussaka, each dish is fantastic. This place is one of my favorite eateries in all of NYC because they have it all - food, drink and service, which keeps me coming back, again and again. Trust me, make the trip. You won't regret it.\n\nMust try: Home Made Sangria, Grilled Octopus, Afelia, Chicken Souvlaki Platter, Moussaka"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cDU2alR3EAE",
            "text": "This place is excellent!!! The food is amazing in the staff is extremely accommodating, the owner is also so friendly and helpful. They have great options for all dietary restrictions including vegan, gluten-free, Etc.  They also make their own wine which is so so good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbnAtR0NnEAE",
            "text": "Serving up all the classics, just like your yia yia used to make. While the pastichio was a little cold when I received it, it was still delicious and full of flavor. Good authentic Greek food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbnZpVU1BEAE",
            "text": "I have never had a bad meal here! House wine, which is only $25 a liter during happy hour (5-7) and house sangria are great.\n\nI had the Arni Kokkinisto, which is lamb braised in tomato sauce with orzo and it was amazing. The lamb was tender and it was the perfect meal to have on a cold winter day. The lamb came with a side of lemon potatoes and was only $23 for a huge portion.\n\nFor dessert I highly recommend the Loukoumade-little dough balls fried and drizzled with honey."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbHJieWx3RRAB",
            "text": "I've been here several times with friends over the past few years and we come back because of how consistently good the food is. The service is friendly and music is not too loud. There are great food options and pitchers for sharing. I recommend the outdoor seating in the in the warmer months."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbk1yWUtnEAE",
            "text": "have eaten here so many times - paphos salad, doner gyro sandwich, calamari grilled"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNDZXQlNnEAE",
            "text": "Absolutely love this place. It has something for everyone, as a vegan person I’m able to have plenty to choose from here (the baby eggplant imam dish is my fave and the potato garlic dip!) so it’s good to come with omnivore friends who enjoy their dishes as well. Plus the owner and staff are always friendly and helpful. Really feels like you’re in their home. Thank you Adan and friends at Yia Yia!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfemZLZU9BEAE",
            "text": "The atmosphere is warm and inviting. Perfect for a first date, friends, or intimate dinner with family. Good is delicious. Highly recommend the pulp and the shrimp combo platter… heavenly seafood. It is all HOMEMADE recipes and left me full but not bloated… that’s when I know it’s quality and not oily. Owner is very compassionate, generous, and puts so much effort into every detail. HIGHLY recommend!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmd3NfUkdREAE",
            "text": "Me and my girlfriend who is vegan visited in Saturday night. We're both from Athens. Great selection of food, genuinely authentic recipes and great portions all at a reasonable price. Highest rec. If I had to nitpick something they go a little too far with the decor and branding."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOW9tSHNRRRAB",
            "text": "I would have given this 5 stars. But when I went to put my salad in the to go container I noticed the bottom of the wooden bowl had some type of silicone messily placed, as to cover some type of hole or leak maybe. It was also coming off into\nMy salad. Had I known I would have never eaten this. Seems very ridiculous to serve something in a bowl like this especially for human consumption. Like what is used to caulk a bathroom. I’m sure the health department would love this. I ordered a bowl of salad, not a bowl of silicone plastic in a wooden bowl. Mind boggling. And gross. Never again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmck95WDF3RRAB",
            "text": "Had the lobster Mac and Cheese,  it was awesome.  Met the owner briefly, he was a nice guy,"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrejk3eHFBRRAB",
            "text": "Great Greek place! It was our favorite for 3 years that we lived in NYC. Service is amazing and we felt like a member of the family. Food was delicious. We visit on every trip 😉"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQcVlMVlF3EAE",
            "text": "Congratulations"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCajZiUlNnEAE",
            "text": "After visiting Greece and traveling on the islands and then returning back to New York I really had a desire of Greek food with so many restaurants.I decided to stop at this restaurant.\n\nFirst of all customer service was Excellent The owners very attentive. He takes his time, talking to everyone and each table. You can see he really cares for the food and for the people visiting. Very humble man and a great staff.\n\nAlso, the food is very quick, but the most important thing is the flavors and the food was on point . They have many options from seafood platter to meat platters, and also vegetarian option. I really enjoy the salad and the seafood platter the most I shared some photos so you can see the beauty . a picture can’t describe how delicious everything was so I highly recommend that you show up.\n\nI have returned a few times and haven’t been disappointed yet and if you haven’t been in Greece , this is a little taste."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dE9ENmNBEAE",
            "text": "We were impressed by the great reviews Yia Yia’s Taverna has so we decided to give it a try. The decor is humble, clean and cozy with lots of seating both indoor & patio.\n\nThere was a great variety of options on the menu and we had a hard time making up our minds. We got Cold Appetizers, Grilled Octopus, Fried Calamari, Falafel and Yia Yia’s Mixed Grill Platter to share with a group of four. The portion was great enough with a reasonable price.\n\nThe food was overall delicious, especially the octopus and the meatball in mixed grill platter. The octopus was grilled perfectly,which was juicy and tender. The meatball was flavorful and satisfying.\n\nWe were extremely full, so we didn’t get a chance to try their desserts but plan to visit again shortly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNUlib013EAE",
            "text": "I ordered delivery from here earlier this week. I got the shrimp souvlaki sandwich and the horiatiki salad. The sandwich was good but I was a little disappointed with the salad. The tomatoes weren’t very good, and since it’s a major part of the salad, it ended up being my least favorite part of the meal. The prices for this place are affordable and right in line with what you’d expect. ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNjUtbjZBRRAB",
            "text": "There's not a lot of Greek options in Bushwick but Yia Yia's holds up on many fronts, flavor, price point and appetizers. We had a couple things here and they were all good. To our surprise the best thing we had was \"eggplant rolls\" they looked like egg rolls but instead were full of cooked eggplant with a feta jalapeno dip that was crazy good. The green meatball sandwich and lamb souvlaki didn't disappoint either. From the looks of it their happy hour goes off too."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvbDdLOUlREAE",
            "text": "The food was simply delicious. The portions were more than we thought they would be. Would definitely say if you like Greek food you will enjoy this place. Can't wait until the spring and summer time, they have a outdoor seating area 😁😆 the service was great too and the manager/owner was very attentive to our party of 8.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpN0lXcER3EAE",
            "text": "The space is perfect for a girls/date night. All dishes tasted amazing, the waiters were kind, the owner stopped to introduce himself, and the service was efficient! I went with two girl friends and my husband. We called in advance to find out the kitchen closed at 8:30pm and we made it a few minutes after but they still sat us and gave us time to check the menu. We ordered 5 sides/appetizers including the lemon potatoes, saganaki, salad, octopus, and lemon potatoes. My husband never likes octopus but he enjoyed this one! We also shared two entrees, the chicken souvlaki with rice and the lamb souvlaki with fried sliced potatoes. The potatoes are delicious! We also had the house red wine and it is delicious. We are about to ask if we can buy some to take home. We sat in the back and were warm with the heater, covered by a tent, and with a lot of ventilation."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZeXNfclRnEAE",
            "text": "I would actually come back here again for either lunch or a bunch of friends to try more dishes. But coming here for a quick lunch on a slow day ,it is not a bad idea.\n\nLunch special comes with a huge portion which I think enough for two if both are light eaters. I order a lamb sandwich and boy it has everything in there. Packed with lamb, veggie and topped with some fries Greek style, i asked for mustard sauce but they don't have. Everything comes up just below $15 for a sit-down lunch.\n\nThis place isnt that pack during lunch hours with about half of the place filled for the whole duration I was there. The wait service is quick and on point.\n\nI have to say something about their Greek fries. It's actually really good with lite seasoning. The shape is actually better than the usual McDonald's style. I would ask for some of their ranch sauce to dip in."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2cWRQY2tBRRAB",
            "text": "Hands down the best Greek food in Brooklyn. We had the octopus, lamb chops, cheese balls appetizer (forgot the name), and Greek salad. And I am\nnot exaggerating when I say the octopus and lamb chops will melt in your mouth. Absolute perfection.\n\nWhat made this place even more special with the customer experience. We were lucky to meet Adan, the chef and owner, who went above and beyond and even treated us to dessert.\n\nWe cannot wait to come back here. Don’t walk - run and go to Yia Yia’s!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXN3VXeUNREAE",
            "text": "My mother and I had the best time here. As soon as we walked through the doors, we where greeted by Adam. He is an amazing host who cares a lot about his service. He always checked up on us, came by the table. We got to know him a bit more. Spoke to us about his background with the back story of the restaurant, he also has a great story to tell of him self, along with a great personality. I recommend everything on the menu. The one thing I didn’t have was a desert because I didn’t have room for more! I am definitely coming back for it. I had grilled octopus as an appetizer, then ordered the lamb kabob with fried potatoes. The meat was nice and soft. My mother had the lamb chops with lemon potatoes super soft and tender, I definitely recommend it here! It’s my new favorites spot!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvbUtQRjRBRRAB",
            "text": "Amazing food, big portions, super friendly staff. All the ingredients are extremely fresh and every part of the dish is home-cooked. The fried zucchini and eggplant was not as crunchy as I had imagined, but was delicious nonetheless. One gyro plate plus one entree for 2 is more than enough."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBeGY3Uk5REAE",
            "text": "We stumbled upon this place while walking around the area and discovered a gem. It was impeccable food paired with wonderful service. The donair is not processed meat but a combination of lamb and beef which is often not found. The garlic…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bWNQZTJRRRAB",
            "text": "Very delicious salad. Solomon is also good but the salmon is a bit over cooked. Staff is very friendly. Feels like a family owned cozy place to eat by yourself."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwbjlEWmxBRRAB",
            "text": "Delicious Greek food with a warm atmosphere. The grilled seafood was perfectly cooked. The gigantes beans and lemon potatoes were so flavorful. The tzatziki was full of creamy garlicky goodness. Can’t wait to visit Yia Yia’s again!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJLWJ6UU13EAE",
            "text": "The hidden gem in NYC Brooklyn/ Best VALUE FOOD IN NYC!!!\nBeen there now three times and as a somebody who loves Traditional Greek food and lives in Greece, I can guarantee authentic Greek Cuisine! As soon as you arrive, they serve water and being delicious grilled pita bread with olives. This place is GREECE in a nutshell...simple, tasty and incredible value for money! You have Greek radio playing in the back ground, service is fast and very friendly. The google ratings are really well deserved!\nHave tried most of the Greek restaurants in NYC over the years including the “top-rated-overly expensive ones” but nothing compares to Yia Yia’s Tarverna (Grand Mother’s Tavern) ad the food is cooked with passion!\nEven if I never take a mixed grill, for 27$ we ate so much and still had to take the rest home!  The area where the place is located is very vibrant with loads of little resto’s and bars in the hood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3emIyQk9BEAE",
            "text": "Flat bread is really nice.\nFried chips crispy.\nThey know how to cook!!!\n\nAffordable weekday lunch sandwich!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaWN1amFREAE",
            "text": "The food was amazing and the service was even better, our waitress, Rebecca was so sweet she recommended a wine to us and also she gave us a free sample of sangria the food itself was 10 out of 10. We would definitely come here again and would recommend to anyone looking for an authentic Greek restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNILU43LXB3RRAB",
            "text": "Seafood supremacy 🙏 idk what else to say i love seafood and so are my friends so we were fed and happy. Everything was fresh i really like the fish…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3akpIbmFREAE",
            "text": "Definitely a great experience trying Greek food at this restaurant. Very nice environment for a dinner date with friends, family or significant other and such a beautiful decor all around. Their attention to detail when it comes to taking…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5cWVyZkZ3EAE",
            "text": "Run, don’t walk! Our first time doing outdoor dining since lockdown — really appreciated the spacious private back patio. Service and safety were top notch. The manager/owned was so kind, and you can tell he really cares about you having a great meal. Food was delicious (generous portions!), will definitely be going again."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdF83WEVBEAE",
            "text": "Nos pedimos un chicken gyro sandwich y unos calamares, estaba todo espectacular! De postre yogur griego, por supuesto buenísimo también. El personal que nos atendió super amable. La cuenta fue un poco menos de 50$."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdUxPWHRnRRAB",
            "text": "Fantastic food - we had the Calamari (must try), falafel platter and the special, which was a grilled seabass. The sangria was delicious too. Wonderful service & the lovely boss even gave us a free dessert (not pictured). Would come back!!!!!! Also here’s a cat"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bzRhQmlBRRAB",
            "text": "I placed an order for delivery - flavors were really good but portions were comically small. 4 small skewers of meat on top of a big bed of rice for $19 seems like robbery. Probably won't order again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3a2FUZXFBRRAB",
            "text": "Best Greek food in Brooklyn!!!!!! I never write reviews but this is too good!! Nicest people, cute backyard, delicious home made food. They deliver too."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzMnVmUnBRRRAB",
            "text": "I found this gem of a restaurant on Google and was very intrigued by the high rating and great reviews. After my first visit, I can say from personal experience that those reviews were ON POINT!\n\nIf I could give Yia Yia's more stars, I would.\n\nThe place is casual but beautiful. The staff were super friendly and attentive. The food tastes fresh and delicious. My Sangria was satisfying and served in a cute way.\n\nI was visiting with a friend and we both loved the experience and plan to bring our spouse's and family here.\n\nCan't wait to go back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaGZmcUhREAE",
            "text": "The food was amazing!\nbig portion,good deal.\nThe staff was so friendly\nWe definitely come back here！"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5b3RIMWJnEAE",
            "text": "Whenever I get octopus at another restaurant I think to myself, \"not as good as Yia Yia's.\" The Poseidon platter is a must try.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMlo3MF93RRAB",
            "text": "Delicious authentic greek meals! Everything we tried was fresh and well seasoned.\nGood table wine. Increadiblely nice and helpfull staff. Highly recomended!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhcWRYVURBEAE",
            "text": "What an amazing Greek restaurant!!!\nService was great and food were so unbelievably delicious! We will definitely come back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5MTdLM2J3EAE",
            "text": "beautiful day on the patio. great relaxed vibes, fantastic service. amazing food. highly recommend the vegetarian moussaka and greek coffee!!!"
        }
    ],
    "reviews_count": 79
}