{
    "name": "Nowon Bushwick",
    "place_id": "ChIJCzyNLENbwokR-lXh5FtzU70",
    "grid": "BK4",
    "address": "436 Jefferson St, Brooklyn, NY 11237, USA",
    "rating": 4.5,
    "user_ratings_total": 403,
    "phone_number": "(718) 971-9636",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabFVHeDFRMDlYTkVjelEzTkZXbmhWV0ZZdFRWRRAB",
            "text": "The burger is the real deal. My son thought the pizza was a little spicy for him, but I thought it was delicious. My least favorite dish were the honey tots.  The espresso cocktail I had was great. That creme brulee was also on another level. The little bit of salt they added elevated the whole dish."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNFZGOUdXRXhVT0ZZMFp6RXhXVzFDTkZjNVdXYxAB",
            "text": "Very solid Korean fusion"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeGNsaGtOM00yZEY5bFdIWTRlV3hHVVVOSmRtYxAB",
            "text": "Very cool interior and fantastic food. Legendary burger is aptly named."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSU1WY3dWVlJLTm5WV1QweEpPR0pHUm1Sc2RrRRAB",
            "text": "Best burger in NYC, periodt. Also service & ambiance is great."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMVNUazFObFJsT0ZCcWNUVk9OMkphVDJKSWQwRRAB",
            "text": "Had the most amazing night at Nowon’s Bushwick location! Chopped cheese rice cakes & burger were to die for. Sat at the bar and had the most attentive server (Robin, pictured) who made our night 10x better."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWmJGcDRSVlUzYXpGaFdFdDZVM1JqTlhST1QxRRAB",
            "text": "Yo…\n\nSo this this one of those places where you can’t go wrong with anything on the menu. You have the allergy? Take the L the day you come here and don’t be afraid to try something (unless it literally will kill you).\n\nThe highlights at Nowon are the two burgers, but the tots go crazy. The chopped cheese rice cakes also are insane.\n\nWhat I’ve named are personal standouts but the burger is objectively out of this world. Bring friends when they come to town to visit. Go for a date. Go alone. You won’t regret it. The vibes here are fire as well with the music selection and lighting."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saGFUZDBRbTVaY0d0dFNsWnVkVzVKUjFaNk1rRRAB",
            "text": "Stopped in for some drinks and appetizers with friends before a concert around the block at Elsewhere. Wife had the Yin Yang cocktail and I tried the Golden, both were delicious! For food we ordered the Ricotta Toast, General Lee’s Fried Chicken, and plain tater tots, everything was really good, def plan to go again! Service was super."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbVNtOU9MVlp6WTNkamNqWk5XblJxU1Y4MmIzYxAB",
            "text": "Damn, damn, damn on the burger. 💯🔥🙏🔥🔥🔥🔥💯💯🔥🔥💯💯🔥🔥"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRVkxa3hPRkYwVkd4bmJsSlBWV1ZrVVRaNWJXYxAB",
            "text": "Rude staff. Dead to me"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WVprSjNka3QwV0RGUmJrSmxaSGxvUTBWV2FuYxAB",
            "text": "Party was 4 adults and 2 kids (high chairs) and we all had a great time. We had the tasting (classic mixtape). Appropriate timing for food/drinks, thoughtful service, and everything tasted great. I hope to get back sometime soon!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcjgyb213RRAB",
            "text": "Great mix of food, cultures, and music by DJ Kdotlim / Kevin Lim"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKQmFuWnJZV0Y0UVdaRlJsbG9SbFo1UlVZMFdIYxAB",
            "text": "The truffle burger is very highly umami. The legendary is a really good smash burger, the kimchee sauce gives it a unique take."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5elFYVXhURGhuY3pWb0xVZFlaamhhY3kxQ2EyYxAB",
            "text": "Incredible dining experience. Service, food just next level. We got the mixtape and Just Wow. Every bite was better than the next. Burger is top 3 thank you!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wT2NqQlBVaTFuT0MwdGFWVkZOWFJUY1ZKM01YYxAB",
            "text": "Yes tastes good, sure. But they charging as if they serving omakase. Burgers and pizzas guys. Come on where are u getting those prices from. Rices cakes?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xST2RHOWZWVzlFVDA1NlZIUlliSGxHTmtsck1GRRAB",
            "text": "Got the burger and it was delicious. So good! My gf got the chopped cheese rice cakes and that was also really good! Great vibe inside. Server forgot our drinks but she eventually got them to us and then she gave us free shots so that was nice. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMlgxVXRWSEU0YjBFeGVuTmpXVkJOVGxOZmVHYxAB",
            "text": "I can't say enough great things about Nowon Bushwick!\n\nFood first: I almost always get the Classic Mixtape, I love too many dishes there not to.  Anything I can't finish, I take home anyway.  Broccolini, Whipped Yuzu Ricotta Toast, Grilled Lamb Skewers, General Lee's Fried Chicken, 'Chopped Cheese' Rice Cakes, The Legendary Cheeseburger are all crave worthy and would come back for any of them!  I also love both the pizzas!\n\nFor drinks: their cocktail program is lowkey amazing too, I always get the Yin Yang miso tequila cocktail, don't sleep!  Friends love the KCBC x Nowon Beer collab too.\n\nService: Stellar!  Friendly and attentive (but not overly).\n\nVibe: This place really shines for groups, birthdays, any celebratory occasions. But would easily come here to solo dine or impress a date.  Roomy and vibey, just can't find a better place with all of these elements."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSmJGb3pPRTgzV2w5NFZuVlpSVFF3Ulc5UmRFRRAB",
            "text": "pretty average korean inspired cuisine, had the rice cake, toast, pizza and rib fried rice - portion size are tiny (fine for sharing), nothing really stood out to me. also they use way too much sodium on the pizza\ncocktails are average in taste but pretty basic  and unimpressive"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wV2RVSm1aV05pVHpsb1VEUlFSbTVLWmt4RVQyYxAB",
            "text": "Legendary status not achieved."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ZmVtazRkWFZVYjE5b1UxVkRTM2hhU2pCMGFuYxAB",
            "text": "Good- omg. Prices are a little steep for my taste. A burger that’s over 20 dollars and doesn’t come with anything hurts… but when I say it is a TASTY burger. Sheesh! The chopped cheese rice cakes also are insane"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKV1NFVXRjRU5ZZWxaaFVXTnJUbTB5TmxCdWVWRRAB",
            "text": "We had the soju and beer happy hour combo which was a great deal! It was our first time here and our waiter, Jack S, suggested the original Mixtape which we ended up getting and it was amazing! Great way to try a little bit of everything. All 6 tasters were delicious- especially loved the rice cakes. Kind of a lot of food for 2 but we got to go boxes! Great service and food. Would definitely come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRFdWRk9SbGxETlZCMFRHNXpUM1pxWWtwMFdVRRAB",
            "text": "Genuinely some of the best food I've ever had. The burger is absolutely killer and you should eat one. But the real MVP as far as I'm concerned is the chopped cheese sticky rice cakes. Words cannot express how unbelievably delicious those things are. They're pricey (as everything on this menu is), but trust me they are worth it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMGJXeFZhRkpXZG1kYVIwaFVUVjg0T1VSWFVIYxAB",
            "text": "Cannot emphasize how great our night became thanks to the head bartender Mikaela (and Evan helping at the bar was also very kind!) Mikaela had a friendly demeanor, was knowledgeable about the food and drinks, and all the dishes she recommended with the alcohol \"pairings\" were on point. She was mixing 2 different drinks at the same time while cracking jokes with us, and speedily getting everything poured while attending to new people arriving at the bar.\n\nThe dry-aged burger was amazing, as was the \"chopped cheese\" tteokbokki. We felt the salad was over-dressed, but it still fit the identity of the menu (bold flavors), so it was not a deterrence at all (just a suggestion if anyone prefers lighter dressing to make note of when ordering). Wish we got the name of the worker who came out from the kitchen with the food; He made a personable impression with fun banter, albeit brief.\n\nOverall, came here to say the food was solid, drinks hit the spot, and the workers (Mikaela especially) made the experience lovely and memorable. Only heads-up would be, if coming with a group or on a date, it may be hard to hear each other talk if you were sitting further in as the music was a bit loud at night (but fit the vibe of the space)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUVMwcHZkM05mVVdoTGNVMDFSRjl4U1hCdVpIYxAB",
            "text": "Ah this place is so good! I love the menu’s creativity. The brunch is so different! I’ve never had a bad meal here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNk56RlVVakV4VUUxRFJWSXRNMGhVUkhJNVNsRRAB",
            "text": "Nowon is delicious and the ambience is super fun. Great for a hangout with friends or a chill date night. Try out the 7 course meal if you can (not all captured). You get a bit of everything. Also the pizza is to die for, my favorite part of the meal (not part of the course meal but better)."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRFZDMWpiRFp1Uld4b01WVjJkMnhLVFRGNFgzYxAB",
            "text": "The chopped cheese tteokboki is my favorite thing on the menu but their fried chicken, pizza, and burger are all really solid choices, as well! Quite a loud atmosphere but service is friendly, they don't rush you, and seating is suitable for different groups sizes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTVJHNDNZVEpCU204dGIyOVVVV2xGUzNCWWFtYxAB",
            "text": "Great chill spot for drinks and bites. Loved the dry aged burger and the creme brûlée was really special. Highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMTDVuSmItMGVLaHhnRRAB",
            "text": "I had the chicken bun served on a regular burger bun. It was sweet and decently spicy, brought to me fresh and hot. I had the honey garlic butter tots that came with pieces of seaweed on them, the sweet sauce was on the bottom of the plate.  I wasn't a fan of the tots.  Too many flavors. My favorite thing would have to be the black sesame creme brulee. I was surprised by the size of the dish (big) and the sugar on top had a specific flavor that brought out a nuttiness.\n\nThe music was on point, all late to mid 2000s hip-hop and R&B, and I was absolutely a fan. I danced in my seat while I ate and so did my friends. Speaking of friends, we were there to celebrate a birthday and the staff brought out a mini chocolate type cake with sparklers and played Rihanna's Birthday Cake for my friend. That entire part was really nice.\n\nI didn't really like the menu options all that much or that the sharing items were limited to two people minimum, but then still needed the entire table to participate in ordering other shared plates. We were seated directly under the AC and it was a bit chilly.\n\nThe establishment is open pretty late which was nice as we just came from a figure drawing class that was about 5 minutes away (walking). I probably would only come back to get the creme brulee to go, and that would be it.  The neighborhood is really nice though."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrdFJXTTNVQzFzV1RkaWJXUlNOa2hYUzIxZldHYxAB",
            "text": "We’ve been to this restaurant before and had great experiences, but this time was completely different and unfortunately, it was by far the worst dining experience we’ve ever had.\n\nWe came to celebrate our anniversary and left feeling frustrated and disappointed. The host had a noticeably poor attitude and seemed uninterested in helping or acknowledging that anything had gone wrong, even when we voiced our concerns.\n\nIt took over an hour for a burger to arrive, and when it finally did, it was lukewarm and bland. It definitely did not taste like the dry-aged steak burger we’ve had here in the past it felt like a basic burger thrown together to rush us out.\n\nTo make matters worse, our entrees were brought out at different times, and the appetizer didn’t come out until after one of us had already finished eating. It made the entire meal uncomfortable one person was eating while the other just sat and watched. The timing was completely off and killed any sense of enjoyment.\n\nWe had high expectations given our past visits, but this time, the service, food, and overall experience were incredibly disappointing. This was supposed to be a special night, and instead, it was ruined.\n\nWe won’t be coming back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTGVEQm5ZV0ZNYWxwWlUxUjZOWGRXZEZkVGRrRRAB",
            "text": "Tried the Korean-inspired margherita pizza at Nowon and was seriously impressed. The flavor was bold and unique, with just the right balance of savory and umami. The dough was absolutely perfect—chewy, airy, and clearly made with care. On top of that, the service was warm, professional, and attentive without being overbearing. Definitely coming back. A real gem!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPcmp3SURSOE5YbmJnEAE",
            "text": "Great burger. Friendly staff. Get the tots"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMSGhxLTZidnBxTjV3RRAB",
            "text": "TLDR: A Korean American gastropub, same one from the East Village but much easier to get to if you drove. Gotta get the cheeseburger, chopped cheese rice cakes. They have set menus to make things simpler with their best dishes.\n\nI'm a fan of Nowon. I tried the EV one a long time ago but Bushwick is so much easier to get to for us.\n\nI'd normally just go with the EP but we did a la carte this last time. The caesar with the black sesame is great. It's refreshing, especially because most of the mains are on the heavier side. Nice textures, especially with the panko crumbs.\n\nIf you're getting one thing, it has to be the Legendary Cheeseburger. Toasted sesame bun, double patties, kimchi sauce. It's tangy, juicy and a perfect burger. The tater tots are awesome because who doesn't like tater tots. I'd stick with the honey butter garlic.\n\nI also love the chopped cheese rice cakes. It's like a Korean/NYC classic with chewy rice cakes, cheesy sauce. It's very satisfying to bite through.\n\nI'd stick with the set menus if it's your first time. The wood-fried pizzas are also very tasty too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VNYXdfUF82bHRYY1N3EAE",
            "text": "I hate leaving a bad review especially when it seems that so many people love this place! I was stoked to try it but damn, it was unbelievably overrated for food quality and price. Had the eggplant focaccia which was totally fine. The shrimp Mandu was the best part of the meal, flavors were the most coherent and the dumpling texture was great. The kind of Korean margherita was okay but so soggy / oily, we were all a little grossed out by it by the end. I see a lot of others have left similar comments.  The chicken bun was also super soggy and the chicken was so chewy I couldn’t finish it. I agree with someone else who wrote before me that it was an absolute texture nightmare. 😩 and for the price? It’s hard to believe.\n\nThe best thing I think we had was the garlic honey butter tots but honestly, it’s kind of hard to mess up tots. Overall, everything we ordered was just a little to oily and a little too sweet. The vegetarian options are limited (we couldn’t get the mixtape options because they all had meat and we had mostly vegetarians in the party.)\n\nThe hostess must have been working her first shift because when we got there, it was practically empty but she looked very concerned / overwhelmed / had to go to the back to ask if she could sit us at one of the many available tables outside.\n\nThe overall vibes inside were fun. Love the branding and the ambiance. One note is that the music in the bathroom was unreasonably loud—every single person in our party was disturbed by it and made a comment when they came back to the table. To me, this is an accessibility issue for those with autism or sensory sensitivities. So often hip restaurants are inaccessible to those with sensory sensitivities and a clean, quiet bathroom is a respite from a loud restaurant. Here, the music was intentionally louder than in the restaurant itself. Nowon, if anything, please address this.\n\nI would try anything twice but I will definitely be lowering my expectations."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLMkRuTlhKbDZINWlnRRAB",
            "text": "Love this place! Super kind and good food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJV3k0N09hanFYTTVBRRAB",
            "text": "We were in Bushwick for a concert and stopped by for a quick drink and bite. Unfortunately, we were there at a weird time, so they weren't serving their full dinner menu yet. Nonetheless, the deep fried tofu sandwich and the General Lee's Chicken were both delicious and super flavorful. It's also a great place to try flights of soju - I tried the Classic flight. It was very interesting to try them side by side.\n\nWith that said, I just want to say that the service at Nowon is really amazing. A special shout out to Tiffany and the hostess (I'm so sorry that I didn't get a name) who worked on the early evening of 5/24. Both of them really went above and beyond to make our dining experience enjoyable and memorable.\n\nSadly, we don't live close, but I hope to go back one day to try things from their full dinner menu!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLelBtdkQ5N01LMWV3EAE",
            "text": "Very good diner with a twist. Great food. We really enjoyed our dishes. Very friendly place with good service. Good music"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYUMtOWl1M0xldHVRRRAB",
            "text": "The menu could have more options, but overall, the food was great and the ambiance were great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQeTZvUERYMS12WWR3EAE",
            "text": "The food is AMAZING!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdmY1Ykw2cXA3MV9nRRAB",
            "text": "Got the classic (7 course) and was able to try a bit of everything I wanted. Would highly recommend so you can try a bit of everything! The chopped cheese rice cakes were the bomb! Great burger as well! The food was delicious!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNmVqclZBEAE",
            "text": "This burger was absolutely delicious.  The patties had a nice crust and the Korean flavors were a bomb.  I would've liked a little more sauce.   The fried rice was also delicious.   Highly recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMUsyX1J3EAE",
            "text": "Love this place the bartender McKayla is amazing!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMk5uRWp3RRAB",
            "text": "Absolute gem! The vibe, the flavors, and the energy is the kind of place that leaves a lasting impression. The Legendary Cheeseburger lives up to its name, and the honey butter tater tots? Unreal. But what stole the show for me were the chopped cheese rice cakes, next-level creativity, and flavor.\n\nWhat truly elevated the experience, though, was the hospitality. Makayla was phenomenal!!! Welcoming, attentive, and genuinely passionate about creating a great experience. You can tell she loves what she does, and it reflects in the way she treats every guest. She made us feel like VIPs from start to finish.\n\nBetween the food, the music, the chill yet electric atmosphere, and Makayla’s outstanding service, Nowon has easily become one of my favorite spots in the city."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcUxfSFJREAE",
            "text": "Had the Legendary Burger very delicious. I was told that the Dry Aged Burger was also a really good Burger as well. The extraordinary tots were rich and crispy, which is a plus. The staff were very attentive great customer service. I've been to this location twice, and I will definitely revisit again to try other dishes and great music as well. 5/5"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNi1uc21BRRAB",
            "text": "Chopped cheese rice cakes and ceasar salad only really solid item. Cool vibe inside.\n\nEverything else was bland cause it lacked salt. (Yo cooks, salt makes shit taste good). We got the classic tasting thing plus a pizza. The tasting set up was ok at best.\n\nEverything took forever on a slow Monday night, charged us $20 for two rounds of seltzers from a soda gun. Pretty whack to nickel and dime like that.\n\nPretty mids all around. Maybe an off night but no real reason to return for poor and slow service with  bland food.\n\nWho ever manages / owns this place should really get on it. Vibes where clearly autopilot and it’s too competitive out here  to be missing like this."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM2FDUTVBRRAB",
            "text": "The chef course is worth it, a lot of filling food and it’s delicious! I didn’t think I’d ever say this, but I wish it had more veggies in the course. I’m so full off of the carb heavy courses"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvellyeDVBRRAB",
            "text": "Some of the best value you’ll find in the city, Nowon blends takes classics to a new height and does it all exceptionally. The small tasting menu is so worth it, a fresh take on Black Sesame Caesar Salad, wonderfully cooked General Lee’s Chicken, genius Chopped Cheese Rice Cakes that paired perfectly with delicious tater tots, and finally the creative take from the Legendary burger to finish it off. Additionally we also got the Kinda Korean Margherita pizza, their simple additions like chili oil lee this pizza a tasty staple. And finally a Black Sesame Crème Brûlé that was very satisfying."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaFpLbXNnRRAB",
            "text": "Had an amazing time celebrating my friend’s birthday, and it was definitely made better by this lovely place with the loveliest staff!!!! The food was so so good, with dishes that I’ve never had before in my life.\n\nIf you’re a group of 6 or more folks, I would definitely try their Mixtape menus. Our table all chose The Classic (a 7-course meal that splits a bunch of entrees up amongst everyone on the table), and the chopped cheese tteokbokki and shrimp mandu were definitely my faves — but it doesn’t discount the fact that the other 5 dishes they served us were also so good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMFl1dE1BEAE",
            "text": "So delicious. My sister and I shared the classic course meal, much food to go around (could have used an extra person). Each course was better than the next, our favorite was the rice cakes. Our server and cool bartender Caroline was great and made the night special. We will be back and recommending the spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvenZPZUx3EAE",
            "text": "Wow this place genuinely took me by surprise. The food is unbelievable. Yes, it’s expensive, but wow it’s worth it. Highly recommend the chopped cheese rice cakes and the honey garlic butter tots, which in particular were the best tots I’ve ever had. Truly hard to explain the level of refined flavors in them. 11/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX0llSi1RRRAB",
            "text": "Decent food. More about the image than the taste to an extent. Service is okay. The atmosphere is top notch. But to be honest I felt they took some stars away from the food and service to hand it to the atmosphere. But the food isn’t bad. It’s just not five star."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdk95SVR3EAE",
            "text": "The food ! the service ! the ambiance ! Was amazing ! I think it’s Super cute that music videos are playing off a projector. The lighting was just right and the service again was amazing !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbVBuUEtREAE",
            "text": "Came here to celebrate my birthday. Super cool vibe inside. We did the 5 course meal and my favorites were the rice cakes and the burger. Apparently this menu changes, so I wasn't able to try their ricotta toast (cries). Our waitress was really nice and she brought out a little dessert at the end."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d0syUGRnEAE",
            "text": "I've been to the Manhattan location of Nowon and enjoyed both. The food is delicious and goes down nicely with a drink!\nWe were excited to try the pizza here and it did not disappoint.\nI shared one of the burgers with a friend as it was too much for just me.\nThe place is pretty large but was really bustling on a Saturday."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvM09LUUFREAE",
            "text": "Everything I ate here made my tastebuds so happy. The Black Sesame Caesar was a perfect balanced of all flavors and ingredients involved. The Chopped Cheese Rice Cakes??? OH MY LORDT- DO YOURSELF THIS FAVOR. I’m still dreaming abt them thangs! The Legendary Burger was good and typically gets rave reviews- I want to try it again to give a fair and well rounded review. The ExtraOrdinary Tots were pretty tasty, had the honey garlic butter ones, which was not something I ever expected for a tater tot!\n\nDrink wise, I tried the Peter Rabbit, which is a bourbon based cocktail w carrot juice, aperol and cilantro. The bartender told me imagine V8 as a cocktail and he was right. If you’re a spirit forward cocktail lover, you may not enjoy this. But if you’re down for some adventure, give her a try! My friend has the Serpent Spike mocktail, which, I don’t usually care for matcha, but this lil drinky was yummers!\n\nNowon will absolutely be seeing me again :)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2azQydDNnRRAB",
            "text": "It lives up to its reputation! The burger was by far the best part, had that special spicy flavour that sets this place apart from other burger joints. The tater tots were the second best thing, such a good fry on them and the flavour matched well. The fried chicken was forgettable, garlic buns quite dry and the rice rolls lacked flavour (small portions too). I would just order the burger, forget everything else."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcGJ2X1BBEAE",
            "text": "I love this restaurant. The combinations with hot honey are perfect. Definitely get a pizza there.  I've been here twice and tried different things each time. The flavor combinations are complex. The textures and flavors are layered perfectly. Every bite is multi faceted. I've had the chopped cheese rice cakes, hot honey garlic tater tots, cheeseburger, master P pizza, hot honey garlic knots - I loved all of these!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX3BESkxBEAE",
            "text": "Food is consistently amazing here—this was my second visit, and it definitely lived up to expectations. You can't go wrong with the rice cakes, tots, and the chicken, which is absolutely fantastic. The Legendary Burger is a must-try! Since this location also offers pizzas, we gave one a try. While it could use a bit of improvement, it’s still worth trying. The French toast from the brunch specials was also a highlight."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aThmR0FREAE",
            "text": "DEFINITELY THE VIBE !!!\n\nFood was better than expected and we expected it to be good. Staff was 👍🏽.  Didn’t realize It was a Monday night which is why it seemed a little mellow even though music was on point. Chopped Cheese Rice Cakes, Garlic Butter Tatter Tots, Garlic Soy Fried Chicken, Legendary and Black Truffle burgers .. oh and Master P and Margarita pizzas…!!! All official 👍🏽👍🏽👍🏽 (party of 4 .. with 1 beer and all this food $220/w tip)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaGVISElnEAE",
            "text": "Nowon is a mixture of comfort food and pure bliss. Each dish is a perfect mix of cuisines and it is hard not to keep going back for seconds and thirds without filling up. The rice cakes and ricotta toast are the best of an already amazing menu set. We ordered a bunch of dishes to share including the kimchi pizza (not included in the prix fix menu). Dessert was a sweet potato pie and a flan. Go for the pie all day everyday."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmOXRtSEJnEAE",
            "text": "The food at Nowon is great!\n\nThis was our second visit, and I’d say we nailed the order this time. Over two visits, we’ve tried bunch of dishes, and our favorites are the chopped cheese rice cakes, tater tots, and legendary burger. We also ordered the French toast from the brunch menu—it was very fluffy and delicious.\n\nA big shoutout to Audrey for her excellent recommendations and attentive service—it made the entire experience exceptional!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcWRidlVBEAE",
            "text": "Excellent food with lovely staff. I recommend the smash burger but only due to preference. Another day and I would prefer the dry age and its meatiness over the smash burger and its caramelization. I also highly recommend the tater tots as a side. The broccolini was a great appetizer. And the pizza holy hell. You can't make pizza AND burgers that well, right? Well these cooks can.\n\nFor the pizza we got the excellent margherita where the gochujang elevated the tomato sauce. Next time I'd get the Mister P just to try more stuff.\n\nFor the burger seriously they're all good. If you have analysis paralysis get the smash and you'll be happy. If you love mushrooms go truffle. If you love rare steak get the dry age. All are excellent."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNHEtNFJBEAE",
            "text": "Honest Review – No Fake Foodie Hype\n\nI decided to check this place out because the food looked good online. While the food itself was decent, it simply wasn’t worth the price. I ordered two dishes priced between $18-$21 each, a wood-fired pizza, and three Sprites at $5 each. My total, including tip, came out to $93.84.\n\nThe ambiance is nice, but it felt imbalanced—almost like a clash between a loud club vibe and semi-fine dining dishes. The menu was also a bit confusing, lacking variety, and the options available weren’t properly explained.\n\nComfort-wise, the small, heavy wooden chairs weren’t great. Service was underwhelming—the server didn’t ask if it was our first time, didn’t offer recommendations, and didn’t even explain why there was a tube of black plastic chopsticks on the table. We had to assume that was our only utensil. They also don’t offer still or sparkling water, which felt odd for a place at this price point.\n\nAnother issue was the noise level. The music was loud, but I could still hear the bartender using a machine that made an unpleasant screeching noise while I was eating. It was distracting and took away from the experience.\n\nWould I come back? Honestly, no. Everything was just okay—nothing wowed me, and for the price, I could’ve had a better dining experience elsewhere. The aesthetic is nice, but that doesn’t mean much when the experience doesn’t match the cost. In the end, the food carried the weight of the bill, but I still left feeling like I could’ve spent that money better elsewhere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydExlbDN3RRAB",
            "text": "Good food! Yummy bites! Loved the chopped cheese rice cake. The Honey Garlic butter tots were crunchy and delicious! Legendary cheeseburger was everything! Flavorful, juicy, cheesy goodness. The Lychee keen cocktail was okay. Service was okay, could’ve been better. There was a long wait for us to get our entrees. Then there was a mix up where we were served nuts and the server was made aware of is all nut and soy allergies beforehand."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dWRtSDJRRRAB",
            "text": "I like this place - a lot. Been here 3 times and the vibes and staff are always great.\n\nIf you come for the course meals, it is completely worth it. Each course was really good, with the star actually not being the burger, but the whipped ricotta toast for me… AND THE DESSERT. However dessert portion was odd imo, since I came with 3 people and was only served with 1 portion of dessert.\n\nAlso I think the burger is kinda over hyped, but it still is a good burger nonetheless.\n\nAlso the pizza was also pretty good, not sure if I’d pay almost $30 again for it, but I’d recommend if it’s your first time. We had the Bushwick Buldak and the Yearly tradition. Def a bigger fan of the Buldak, but it is quite spicy. The pizzas also come with a chili oil dipping sauce!\n\nThe pricing is excellent with the course meal and honestly I’m not sure what other restaurants are this generous with the amount of food you get for $50.  You will leave stuffed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcU9majR3RRAB",
            "text": "We got the 7 course menu which is a great deal in my opinion. $49 per person and you get to try all the favorites on the menu. Broccolini, ricotta toast and the burger were very good. The smoke show pizza was unfortunately underwhelming. Inside is a cool atmosphere with club music. Would recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaS1MWS1nRRAB",
            "text": "The food is amazing, such a great play on traditional Korean dishes with a nice New York twist. Nowon Bushwick is a nice vibe. Not too flashy or loud, just the right amount of calm and creativity.\n\nI came with a friend to check JaQuan the Chef out, I've been dying to try this place out!\n\nWe started with soju! Tiffany was so sweet in bringing me a sample of the sweet vanilla rice soju. She was very good with recommendations for the table and knew what we were looking for in taste.\n\nWe ordered the mixtape classic, which started out with the broccolini .... Sooo good!\nThe ricotta toast, chopped cheese rice cakes and honey butter tots... what great dishes!\nThe Korean fried chicken, our lovely waitress paired with the cool sauce that helped balance out the flavor.... Which was great with and without!\nThe legendary burger was fire! Well cooked I might add.\nThe chef specifically made a chicken and matcha mochi waffles for us. WHOA... matcha mochi waffles... a taste I could never forget.\n\nThank you NOWON BUSHWICK for a phenomenal experience. I can not wait to come back! CHEERS\n\n(Might I add, I haven't left this place yet and I'm leaving this review! )"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ek1uUE1nEAE",
            "text": "Korean-American spot with lots of unique and interesting dishes. Everything we represented incentive flavor combinations and tasted great. We opted for The EP menu sampler to get a variety of their popular/signature dishes. The stars of the show so far are definitely the chopped cheese rice cakes and the legendary burger.\n\nTreat this place like a tapas spot - good for those times when you want to share small plates and have conversation (their kitchen brings dishes as they’re done and it may not work for your party to get all orders at once if eating individual dishes). Overall Nowon makes the trip to this part of Brooklyn worth it! Make sure you get a reservation, especially on busy weekend nights."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aUoyUjBRRRAB",
            "text": "I recently visited Nowon Bushwick and had a great experience! The food is Korean-inspired, with delicious burgers and pizzas. The drinks were really refreshing and tasty. The pizza takes some time to cook, but it's worth the wait. The staff…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ck56eXd3RRAB",
            "text": "The legendary cheeseburger is very good. The charred broccolini is also good. Tater tots with curry spice are okay, would’ve preferred if they had regular ketchup on the side. Pizza is kinda soggy but good enough\n\nGood music and atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdi1QQTFBRRAB",
            "text": "Nowon Bushwick offers a lively Korean-American dining experience. I began with Roaring Tiger Lager and enjoyed dishes like Bushwick Buldak Pizza and the Legendary Cheese Burger. While the food was average for my taste, the standout feature was the stylish place setting and decor. The ambiance is inviting, making it a great spot for innovative takes on classic dishes. Overall, it's a nice place to enjoy fusion cuisine in a beautifully designed environment."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa195NkNnEAE",
            "text": "Out of this world. Can’t recommend this place enough. Super cool atmosphere. Vinyl albums for sale. I had the Shakshuka (?) and it was insanely good\n\nBut the best are the cocktails. Jackson the mixologist is brilliant and super friendly. He made me something off menu with kimchi which sounds ugh but was delicious!\n\nGo go go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMnEyWDhnRRAB",
            "text": "Been to Nowon Bushwick 3 times and I can’t recommend it enough. I absolutely love the food & atmosphere here. I’ve done the pre-fix twice, which is the best $40 you can spend on food in Bushwick. The tater tots are excellent, the chicken is amazing and the burger completely delicious. This past visit we went ala carte so I was able to try the chicken sandwich which was very tasty (although the patty was alil small) & and the gojuchang chicken and rice cakes pizza. While it wasn’t the best pizza I’ve had, it’s definitely a totally unique and flavorful pizza that I’d definitely recommend. The staff is attentive and friendly and the music is always on point. I’ve already booked a table to go back again in 3 weeks and I can’t wait. You should do the same!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYXzViU1VREAE",
            "text": "One of my favorite restaurant to eat at in Bushwick, Brooklyn. The food and service is GREAT! It has a very hipster vibe and I mean that in a COOL WAY!! I love the brick oven pizza! Honey butter tots are amazing too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwX2IyUERREAE",
            "text": "So excited to have such fantastic Korean fusion in the neighborhood. The legendary cheeseburger is a must for burger fans - an instant favorite in my opinion. Drinks, pizza and apps were all excellent. Highly recommend and I will be back very soon"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdnItdnhBRRAB",
            "text": "Nowon Bushwick was consistently good. Good atmosphere, good food, good service. Nothing bad. Fairly expensive place compared to similar options. Overall, a good spot to come with friends and dates.\n\nSalads, marinated cukes, sweet potato pie, and sticky knots stood out as particularly flavorful. Would go again for the food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaU1mZmVnEAE",
            "text": "The drinks are really really good as it looks. It carries into the vibes of the place. I had hibiscus non alcoholic. Beautifully presented (see pics) Bathroom was lowly lit and not well kept hence minus 1 star but it had outdoor seating. Try at least the tater tots with special sauce...SOoo good ! Not big portions but good for 1."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqc1lXZEhBEAE",
            "text": "For an American restaurant with a kinda Korean influence, this is the spot. Burgers, appetizers, pizza, and etc., all in a western menu type with a Korean twist.\n\nA must get is the bushwick buldak which a pizza with rice cake and fried chicken pieces. The sauce is included with Korean spices that take it to the next level. Tots not pictured are also a great get and you can’t sleep on their fried chicken which is really juicy with tons of flavor. If you can handle a little spice I’d try toe gochunjung over soy garlic, had both, but think the gochunjung is a bit more unique.\n\nFun fact the dough made by all the pizza was from a starter that the previous owner of the spot Faro used and sort of pays homage to them, which is a cool story to tell.\n\nThe vibes are cool with r&b and hip hop playing in the background, fun place for a dinner with friends or a date.\n\nStaff was friendly and bathrooms clean. Will be coming back to try the burgers soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMUxuQXFnRRAB",
            "text": "Did the 5 course tasting menu, it did not disappoint!! I had to tap out tho and am eating my leftovers a day and a half later bro this burger is STILL HITTING!!!! Trent was super helpful with service and it’s definitely a vibe in there aesthetically as it is. Only thing I thought was silly was their name tagged on the wall in different graffiti fonts that could’ve been real graff (felt like a missed opportunity)but there’s a beautiful tiger mural at the front. Honestly the food is all full of flavour I really appreciated the tiny crispy anchovies in the broccolini cesar dish too! They serve portiond accordingly too truly worth checking out imo"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabmZ5dmVREAE",
            "text": "Drinks are good, food is overrated.\nTL;DR\n\nI was so excited to try this place. I saw some tik toks and I wanted to try fusion Korean American food in the neighborhood.\n\nDecided to come on a Friday night which was my first mistake. Got here at 7pm and asked how long the wait was. The hostess said about 40 minutes and to make sure I was nearby because they wouldn’t hold it. She suggested to stay at the bar for a drink so I could get seated right away. We decided to leave and came back 35 minutes later. Was told that they still had a little wait so we got drinks.  After an 1.5 hour wait, we decided to just order take out cause I really wanted to try the food. Honestly, I should have just left then.\n\nAfter I ordered, the hostess said she’d expedite my order since I was waiting so long, but still waited long  time for my order. When I finally got my order and tried the food, I was underwhelmed.\n\nWe ordered the soy garlic fried chicken, Bushwick Buldak pizza, the chicken sandwich, the legendary burger & whipped ricotta toast. Everything was just fine. The burger and chicken sandwich were just okay. The soy garlic chicken were boneless and just fine. The Korean pizza was good, but nothing to write home about. The whipped ricotta was probably the best, but very small portions. Honestly, I feel like I should have just ordered from Abe’s Pagoda. Wait less time and had a better Friday night dinner for less.  Now that’s a burger and chicken sandwich to write home about.\n\nI did give 2 stars because the bartender was great. We ordered some drinks (frap star, crazy rich Asian and sparking rose)  when we waited the first hour and he was super nice and even gave the rosé for free. He also checked in on us after a while and said he would check on our order.\n\nRegardless of the wait, the food wasn’t worth the hype. I won’t return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWMl9mU2NREAE",
            "text": "Creative use of Korean ingredients in more Western dishes. The elements here make this very special, with uniquely flavored and textured experiences for everything. The burger, first and foremost, is exceptional and the best burger I’ve had. Juicy, messy, creamy, with delicious pickles. The pizza was unique and very special - exceptional crust, burrata."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbV9hbTFnRRAB",
            "text": "Can’t even put in to enough words just how AMAZING the food was! Topping it off with the vibe and great service. Ugh! My milennial self was loving the playlist and got me singing r&b and hip-hop to my food. The Classic Mixtape is SO WORTH IT. You’ll be satiated in your taste buds and your tummy. The non alcoholic turmeric passion fruit drink was a hit as well. Bravo! Update : the pizza is phenomenal!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaU43a1lnEAE",
            "text": "Great new spot in Bushwick. They just opened up to the public yesterday, and it was a great first experience. Everyone was working hard to deliver the best service. The food was on point and drinks were tasty. Also love the vibes. Live dj and all. Can't wait to make my way through the menu, but the dry aged burger was a banger."
        }
    ],
    "reviews_count": 81
}