{
    "name": "Cafeteria Bklyn",
    "place_id": "ChIJCaz6FI9dwokRC3_fyzRQ57U",
    "grid": "BK4",
    "address": "1153 Broadway, Brooklyn, NY 11221, USA",
    "rating": 4.4,
    "user_ratings_total": 207,
    "phone_number": "(718) 484-4061",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQlJqQnFObUZxUzFCV1pIUXlkVTQyV21kRE4zYxAB",
            "text": "Best chicken and waffles ive ever had!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSYVIyUm1UemxSWVRaM1RsQllaRjlKYUZoeFMwRRAB",
            "text": "Really loved the food and atmosphere"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWkxVaENlVXd3Tm04Mk0ySlpiRTV0ZVdveVMyYxAB",
            "text": "10/10 recommend ! You come in hungry and leave feeling like family. The food/bevs were spectacular and the service was excellent. Lovely little corner spot with good views for ppl watching and decorated in a fun way that creates ambiance. I couldn’t believe how reasonable the prices were. It seems like all the employees are good people which translates to the atmosphere of the place. Thanks for helping my mom’s trip down here end in the perfect way. We’ll be back !"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trd1N6UjFZbGxzUmxjeWRUaGtlamx1TW5WV1dtYxAB",
            "text": "Best tres golpes I’ve EVER had. I’ve tried mangu in different states and in Dominican Republic. This place is my favorite everything is so fresh and perfect. The portion is filling and customer service was great."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacU0xbDZUMU5zUnpJMlZHVTNSVkpWWTA1NlZsRRAB",
            "text": "Todo estuvo excelente. Son super rápidos con su servicio, la comida llegó fresca, bien presentada y con un sabor espectacular. Los pancakes estaban esponjosos y deliciosos, la hamburguesa con papas perfecta— la carne estaba tan fresca y jugosa!!!!!  y la bebida 🥰 me encantó — la empacaron súper bien para que no se derramara ni se dañara en el camino. Además, me encantó que no le ponen hielo, así no engañan con la cantidad y uno mismo puede agregar su propio hielo en casa. Se nota que usan frutas naturales y que todo está hecho con mucha limpieza y cuidado. Sin duda volveré a ordenar. ¡100% recomendado! Dios bendiga 🙏🏼"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMlR6RjVWbFZLU3pkM1RsUnRhREJwTjJkd1QwRRAB",
            "text": "Me and my boyfriend have been ordering from this spot for months with no issues . However ordering today , we found two roaches within our order . One was on our delivery bag which maybe we thought maybe from our dasher or outside . But then my boyfriend orders coffee and drinks it down to the bottom and his very last sip he feels something and spits it out and its a full blown grown ROACH! This is very disappointing and disgusting to see ! We have got our refund thankfully through DoorDash , and we called the place to let them know and they said they don’t know how this could happen and they have construction happening but try to check things good , however obviously this was not checked good if this order came with not ONE but TWO ROACHES ! Safe to say we will not be ordering from here again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WmNsbEZlVVF0ZWxsUGVYVktUMkptYkZOd2RWRRAB",
            "text": "WHEN I SAY AMAZING ON ALL FRONTS, FOOD COOKED TO PERFECTION, JEANETTE HAS WONDERFUL SERVICE SKILLS. ALWAYS A PLEASURE TO TALK TO AS WELL. THE PLACE CLEAN AND COMFORTABLE. MY FAVORITE PLACE FOR BREAKFAST AFTER A LONG WEEK OF WORK."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWlluVmxhRU50UjBjMU9UTlljblZZWWpZNVdFRRAB",
            "text": "Excelentes zumos de frutas, buenos desayunos,  buen precio y servicio. Muy recomendable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTVVqVmhkRWxwU0RKQ2FEaHdNV3B6VVVWTVRIYxAB",
            "text": "Order the Mangu con los tres golpes, BEChedder cheese sandwich and Morrir sonando.\n\nMangu- wouldn’t order again, taste too vinegary for me, the color of the plantains threw me off but I’m guessing it’s because of the onions and the color coming off it because they soaked the onion in too much vinegar, and the salami Kona of look like a mixture of spam and sausage and don’t taste like the salami I’m accustomed to making when I make plátano y salami. 2/5\n\nBECC - would order again, tasted great. 4/5 p.s. no pic of the sandwich cause I ate that thang down!!!!\n\nMorrir sonando - needed a little bit more milk imo but it was great I’ll order it again. 4/5"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMmRVNXBaazh4UVdSM1JWRkhZa1JLWW05b1RVRRAB",
            "text": "Best Breakfast & Brunch Spot in NYC — Period. When you factor in price, flavor, and quality. There’s simply no other spot that beats it.\n\nWhat makes this place unique is that it’s not your typical all-American brunch, which for me can sometimes be on the bland side. Here, you’re getting a true Dominican-American breakfast and brunch experience — sazon, flavor, and soul in every bite. If you enjoy savoring your food, this is a match made in heaven.\n\nTheir mangú is smooth, creamy, and comforting — not the stiff, heavy version you often get elsewhere. I ordered the tres golpe and my girlfriend had the dos golpe with pechurrinas (Dominican chicken tenders). The chicken was crisp to perfection, seasoned beautifully, and mixing it with the mangú is next-level. To finish, I ordered a papaya milkshake that was amazing — rich, refreshing, and the perfect balance.\n\nThe flavor here is what sets them apart. If you’re Latino, or if you just love food with seasoning and depth, this is the spot. Too many brunch places in the city are bland — here, every bite has sabor.\n\nOn top of that, the service is excellent. Our server Jeanette was attentive, funny, and welcoming — exactly the kind of energy you want when you’re hungry.\n\nAnd let’s talk about price. In 2025, when everything feels overpriced, this spot is a blessing. Most dishes are $5–$10, nothing over $25, and the quality is unmatched even compared to restaurants charging triple. You get your money’s worth every time.\n\nThe only downside is they’re not open for dinner — but for breakfast and brunch, Cafeteria Brooklyn is unbeatable. If you want food that’s flavorful, affordable, and satisfying, this is where you need to be. I’ll definitely be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbFlqbHpXblp4TWpSb2NEaG9lbVZTVDNkaWNXYxAB",
            "text": "Nice place for breakfast, the food is good value for money. The staff is very kind."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WeWRuTlVZbkJZVWtWSE9HTkhUM0J1YTNsek5uYxAB",
            "text": "3 golpes 4 ever"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SWJGVjNaMlprYVV0c04yUTRkazlCYm01MVEwRRAB",
            "text": "Excellent breakfast sandwiches, juices, and coffee. Great for a quick sit down or to-go. Staff is very friendly and helpful."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQ2VXOWlRWFpGZWtKT05GQmpVM2RqYjE4eFYyYxAB",
            "text": "Muy buen lugar para pedir tus desayunos favoritos"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMU1rWnJXbGMzZEU5bk1qSjZiMU5ZTm5ZeFQxRRAB",
            "text": "You can't get a better deal. Next time I'll focus on different menu sections. Remarkably personable staff members here. This spot creates an intriguing environment. The restaurant offers dependable meals."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSVZIQnFTelZKUXpaS1lWQjZTV05DTTFGNlQzYxAB",
            "text": "Honest review- I’ve tried to give this place 3x because it’s so close to my house and I like the vibe.\n\n1. The service is TERRIBLE. They just talk to each other behind the counter and you have to hunt them down for the check but expected to tip of course.\n\n2. The food is OK, nothing to write home about. I had the pancakes, omelette and hash browns. The hash browns were NOT EDIBLE.\n\n3. The juices are great!! I would do takeaway for the juices\n\n3. It’s a nice vibe, good music mix, and spacey but there was a smell near the window seat"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFM2FqSm9jbVZ3VmpkQ1lrZzNSVGM0YW5kbFNVRRAB",
            "text": "I just left New York this morning after visiting from Florida and during my trip, I stopped by Cafeteria BKLYN multiple times within a three-week span. Every visit was a hit! My mom and I came in once for breakfast, another time I brought my boys, and I even went alone. No matter the day or who I was with, the food was always fresh, flavorful, and made with love.\n\nCafeteria BKLYN is a Dominican-style spot that offers pickup, sit-down, and delivery. It’s cozy but full of flavor and they even have fresh cold-pressed juices that were the perfect touch with every meal. The staff is friendly, the service is fast, and the taste is unforgettable.\n\nWe’ll definitely be back the next time we’re in the city. Highly recommend to anyone looking for authentic Dominican comfort food and fresh juices in Brooklyn!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReWFXTkpNeTF6ZG1SeFN6UlhVR2xxTjA5T2NrRRAB",
            "text": "FIRST & LAST !! I see you gotta go there in person cause they send what they wanna send if yall don’t make FRENCH TOAST take it off yall menu , don’t false advertise and than make pancakes . I called the restaurant and the employee trying to tell me what i did on my phone like i can’t read and comprehend i found yall number to call yall so im pretty sure i know what im doing give the people what they ordered period"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wb2FDMTZWWGMzY2xKWFIwaHFTM3BWVGt4R1NtYxAB",
            "text": "Every one was so nice and had a great sense of humor, everything tasted freshly made and the pancakes were so fluffy. Definitely a great place if you’re trying to eat some good breakfast if you’re visiting or traveling New York.☺️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4R1UyVk9MVGhOWWpOWFVsazFibmwwTW1RdGJGRRAB",
            "text": "i stopped here for lunch during work. got the pernil with rice and beans and a can of soda. plus a tip, it was about $15 for a generous portion. the pernil was excellent. i planned to eat half and save the rest for dinner but it was so good i ate the whole thing. this spot great value for money in the area; highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oM1dFNXZOMmhJYXpCV1NtRkJWRFI1VGxSa2NYYxAB",
            "text": "It’s hard to be a patron at a store that closes 30 minutes before its closing time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSFVHbEZRbVp4YjNCalNuZEllVWQzWWpSeWJIYxAB",
            "text": "Air condition seating area, pleasant staff. Great place for breakfast and lunch/brunch. Most of all, the food is tasty; I mean real tasty, finger licking, tongue wagging, tasty 😋"
        },
        {
            "date": "4달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkT05rZ3hVRGx3VHprM1RVczBTbFU1TTNCT2JGRRAB",
            "text": "Super endroit, la cuisine domenicaine et américaine au top, vraiment pas cher"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdFk3VGl3RRAB",
            "text": "Delicious breakfast options, good service &  reasonable prices. Just the music is a bit too loud to have conversations."
        },
        {
            "date": "4달 전",
            "language": "de",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMWIzbFNaV2Q2ZURoRE5rSTVlbTFoVEZKTGMwRRAB",
            "text": "Essen war lecker und die Getränke auch.   Was wir nicht verstehe, ist, das wir unsere Bestellung zusammen gerechnet haben und wir dennoch fast 20$ mehr bezahlt haben. Personal aber sehr freundlich."
        },
        {
            "date": "4달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQS1hndGpwaVp5THlnRRAB",
            "text": "Excellente adresse, si je l’avais découverte plus tôt dans mon voyage j’y serais allé tout les jours!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210clZVeExaR2xuVVcxZlMwUXljMHRDVDNZdGNtYxAB",
            "text": "Food is great! Service is a little slow, but still totally worth it. It’s my favorite spot for breakfast in Buskwick"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNbnkyS2I1OWVLQ3ZRRRAB",
            "text": "Horrible service, if you’re a family, do not eat here. They will charge you extra just for being a father and eating with your family. No one mentioned anything about an 18% added gratuity because we were a party of 4. I received my food late because they messed up my order and I still tipped an additional 15% and didn’t find out about the added gratuity until after I paid. I hope the added gratuity and lack of customer service was worth the 1 star."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOc1UwaEJYMlJTZGt4NVZUSTFkM1JvTlVKdWFGRRAB",
            "text": "Eat there several times. Workers are not friendly rarely speak and I will never eat there again. Today was the last straw. Ask for tea with one sugar and milk it looks like whip cream and she had an attitude so I ask for my money back. Never said I will make another one. They can kick rocks and the manager is worst 👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOT1gxSTVNVlF0V0dWQ2JEVXRVVUZ0TUcxRFNIYxAB",
            "text": "big plates and nice iced coffee, shakes, juices for good prices. good energy and nice music"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMQ1htNC1oMEpqSmt3RRAB",
            "text": "Delicious food right off the j train. Clean facility. Friendly fast service. Also serves healthy juices lots of choices. Great prices.!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOX2FxOVBCaHZHZmV3EAE",
            "text": "Randomly ended up here when the place I wanted wasn't ready to serve breakfast. Pleasantly surprised to find a great breakfast spot. Spacious if you want to dine in. Great service and food. So many good options I had a hard time deciding what to eat."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJLXRnOUNsMW9LSld3EAE",
            "text": "Had 2 fresh juices and the turkey sausage breakfast sandwich and French toast. It was delicious! The French toast especially was amazing - sweet but not dowsed in syrup at all! Prices are super affordable too."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNTR2eG13RRAB",
            "text": "Hands down best Dominican spot in Brooklyn."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLVpDeG1BRRAB",
            "text": "I don’t normally give bad reviews but it pissed me off that I paid extra for chocolate chips expecting them to put them in the pancake, but instead they just threw a melted mound of them on top of the french toast. I ordered through Uber Eats so it was all in one small container and the eggs were entirely covered in chocolate while the sausages, bacon, and home fries were half covered in it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ2FlU0lnEAE",
            "text": "Very rude \"service\" won't be back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ1lYdlBnEAE",
            "text": "Excellent food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc1p6OU1BEAE",
            "text": "Was here once and the food was decent. But came again today an hour and a half before closing time (both on Google and on their web site) and it was already closed. If you're gonna run an all day breakfast spot, you gotta stay open the hours you advertise."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOExQWlNBEAE",
            "text": "This place really hits the spot at an affordable price. Whether it's breakfast, lunch or dinner, they do not disappoint with value, service, and most importantly FLAVOR!  This place in one of the best good eats in Brooklyn. I HIGHLY RECOMMEND."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcjV6RWlRRRAB",
            "text": "We love it..friendly,  food good n music awesomeness...waitress was nice."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeWVLSUF3EAE",
            "text": "Food is good but the music is way too loud"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aWJDOVFBEAE",
            "text": "If I could give a ZERO I would.  This is the worst restaurant I have ever been to. The cook mess up your order and blame you for it. The service is horrible. I would never recommended this restaurant to anyone."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cEpPcVBBEAE",
            "text": "Excelente atención al cliente, pedí, tres golpes y estaba muy rico."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReGVPVV9RRRAB",
            "text": "Great food! Great prices! Great service! You will not be disappointed!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNW9DLXJRRRAB",
            "text": "Review for La Cafeteria BK\n\nI had a frustrating experience with La Cafeteria BK that I feel compelled to share. I placed two orders through Uber Eats, and both times they forgot my sandwich. The first time, I was told to place another order so they could add the missing sandwich, which ended up costing me more money—both to them and Uber.\n\nThinking it was just a one-time mistake, I ordered again. Unfortunately, they forgot my sandwich once more and this time, my fries were burnt. When I called to address the issue, they suggested I place yet another order to add the sandwich. At that point, I realized it was just a scam to get more money out of me, so I asked for a refund instead.\n\nOverall, it seems like they have a serious issue with fulfilling orders correctly. If you order delivery from them and they forget something, I recommend just asking for your money back. It’s hard to believe that this could happen twice in a row without it being a deliberate oversight. I won’t be ordering from here again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnb3BTLUlREAE",
            "text": "I ordered the bacon cheeseburger. It was bland. The breakfast was better than the lunch(pancakes or waffles)."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBaV95VUJBEAE",
            "text": "Service was bleh but the food was good and well priced"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNWFyNnlnRRAB",
            "text": "Excelente atención, comida y ambiente"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmN2FhZWx3RRAB",
            "text": "Good prices for good food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2LTgtRm9RRRAB",
            "text": "Good food and friendly staff"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSX0pXYlpnEAE",
            "text": "Bomb! Delicious, quality and everything you’d expect from a good breakfast spot.\n\nWe enjoyed a quick breakfast at Cafeteria BK and the service was fantastic. Our orders were taken with no problem and served in a very reasonable time frame.\nThe grill area is open which is fantastic to be able to see your breakfast being safely cooked.\n\nAfter not knowing what to\nOrder since it all looked so appetizing I ordered home fries  with sausage and eggs over easy. My partner enjoyed the split decision and boy was that a plate in itself. The heavy plate consists of home-fries, French toast, pancakes, egg, cheese, bacon, link sausage and patty sausage all for $12.00!! That’s unheard of but totally worth it.\n\nThe natural juices are legit! Super fresh (ask for the orange) and perfect for these warmer days approaching.\n\nOverall it’s a wonderful ambiance, good food, great service and fantastic prices.\n\nOfficially our new favorite breakfast spot."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aUttZHRRRRAB",
            "text": "We visited a new spot in Bushwick, Brooklyn! And hello hello! Is AllFunNewYork from instagram again!\nwe had an amazing brunch at this spot in Bushwick! Everything was delicioso.🤤😉\n@lacafeteria_bk food was amazing! The Croissant delight sandwich was just insanely delicious! The pancakes with berries were freaking soft and fluffy and all that with their signature Tres Leches Latte! Sooo yummmmyyy!! 😏\nThe staff was friendly and accommodating. The prices were reasonable and everything was yummy :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOOTktc193RRAB",
            "text": "Gave this place a try a week ago and it was pretty good. Nothing we had was what I would call \"ground breaking\" but it was pretty solid for classics. The pancakes were very fluffy and fat but held good flavor too. For some reason I just had to try this places chopped cheese (my local bodega stopped selling food and switched to weed) and yea I've had better chopped cheeses but it did scratch that itch when you're craving one. I got the energizer juice also which was on par with others no notes. All in all the place is studry it sells what it's good at and seems to have a following of customers that appreciate that."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaFk3RzFRRRAB",
            "text": "When I was in Brooklyn for a week, I went here almost every day for breakfast. Once waffles, once pancakes, and my highlight the French toast with cinnamon and strawberries. And a coffee with a good deal. I will be back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoc3RmX2NREAE",
            "text": "Super impressed.  This place is nice and bright and clean.  It’s so well lit that you can see everything and that’s a good feeling.  You can see that they care about cleanliness and appearance.  The staff is so friendly and welcoming.  I am so glad I found this place.  I want to try everything!  I got the sausage, egg and cheese sandwich, which is one of the BEST breakfast sandwiches I’ve ever had.  I don’t normally take photos of an egg sandwich, but I had to share.  I will be back for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMd29uWl93RRAB",
            "text": "Our server Jeanette was absolutely lovely!! Coffee is really nice here, and I go to a new coffee shop every weekend - it's a good strong coffee and they have dairy free milk options.\nThe bacon was well-done...perfect... Eggs over easy made perfect and all was an outstanding, affordable price!\nI also seen they were attentive to others coming in and also good at quickly cleaning away tables. Would definitely come here again and recommend anyone to visit!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNnFIb0tBEAE",
            "text": "We visited Bushwick for a week recently and ate every breakfast at La Cafeteria six of those days. The atmosphere is cheerful and clean and the young men who cooked and served were fabulous and friendly . The food is very reasonably priced and tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaHZuc0p3EAE",
            "text": "La Cafeteria\n\nLayout/atmosphere\n*Spanish luncheonette setup/steam trays; 11 tables; six seat window counter\n\nFood/drink\n*Turkey sausage, egg & cheese on plain bagel - good; toasted the bagel on the sandwich press (liked that)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScFpXMDRRRRAB",
            "text": "First time here. Great experience. Food was fantastic; authentic and homemade. Everything on the menu is reasonably priced as well. Will become a regular without a doubt. Thanks again!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeTg3QS1nRRAB",
            "text": "Always fresh, always delicious, mucho sabor, it gets really busy on weekends for brunch especially on Sunday. The folks working there are bustin their back to deliver that proper Dominican goodness. You'll see it for yourself. I'll get back to eating my mangu and home fries now, thank you very much."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbFlxc0JREAE",
            "text": "Cozy spot for some good filling breakfast! As soon as you step in you are welcomed by the friendly staff. Quick bites, Delicious food, fresh juices and coffee! Definitely a 10/10!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4d3E2M3JRRRAB",
            "text": "Got the french toast combo, was super tasty. Great price and good portion sizes. You’ve just earned a new regular!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNTd1OGhBRRAB",
            "text": "If you are craving good diner breakfast, come here! Super high quality and delicious food. Had the Split Decision which was pancakes French toast hash browns sausage bacon and eggs. I left feeling extremely satisfied and happy"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdXRxQy1nRRAB",
            "text": "Great and clean place…. Great people ! Great food …. But only on the home fries TOOOOOOOOOO MUCH Seasoning…. (Not a seasoning lover)Everything else great…"
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSc1pTQ3pnRRAB",
            "text": "Super bonne adresse à Brooklyn, service super, endroit propre et chaleureux. La nourriture est excellente et pas chère du tout, le petit déjeuner est super.\nFoncez sans hésiter 😄"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eGFhdlNBEAE",
            "text": "Love this place! A great casual spot to enjoy breakfast food. This is a good option if you want to take your time to dine; they’ll never rush you to close out and pay. We love the vibes and atmosphere. It’s always very clean. The owner is very friendly as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqa3FPZUd3EAE",
            "text": "Unfortunately I received someone else's delivery order. The eggs with cheese were good, but the hashbrowns were super oily and the silver dollar pancakes (which I did order) were not good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudS1pWjhRRRAB",
            "text": "I am a firm believer in positive reinforcement and in reviewing great experiences and great food. I am a manager in the area and quietly come and go at this establishment. Each and every time, the service is great as is the food! I am big on aesthetic and it is always clean with sanitary food handling conditions. This has secretly become my favorite destination for the day. Everything is fresh and well priced.. This is a neighborhood gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdjZqQWxnRRAB",
            "text": "Fantastically affordable prices\n\nFriendly and efficient staff\n\nMangú and M train sandwiches were solid\n\nGreat juices: Detox Madness was light, bright, refreshing, zingy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaM0p6SUFREAE",
            "text": "What a cute breakfast spot!\nSo many delicious options. Would recommend and come back again."
        }
    ],
    "reviews_count": 70
}