{
    "name": "TORA NYC",
    "place_id": "ChIJ39bSFABdwokR05BHt42BmR4",
    "grid": "BK4",
    "address": "242 Himrod St, Brooklyn, NY 11237, USA",
    "rating": 4.9,
    "user_ratings_total": 209,
    "phone_number": "(929) 554-4996",
    "reviews": [
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMGRsbGlUMVF0YmtkSWRsVnVkMGRNUTNCbVZWRRAB",
            "text": "Fantastic food, beautiful atmosphere, and excellent service!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxamRIaHROR1J4TFdwWldYSTNNbVZyVWt0SlRIYxAB",
            "text": "Sadly took me two years of living in Bushwick to find this spot. So freaking to have good Japanese food this close to home 👌👌👌👌…"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNWVHWlhiVk4yY1VrM1RtOTBRVzlTVTNGQ2FFRRAB",
            "text": "Had a wonderful meal at this Japanese restaurant\nThe sashimi was super fresh and flavorful"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4emIwbHJkamRTYURoTllWVXpielZyVTA1dVJGRRAB",
            "text": "The taste is very delicious."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MVduQTNabU5MZDBkQ00wUlhWVWx0WmpGYWVIYxAB",
            "text": "Nice place to go. I was very pleased, good staff. Everything tastes well. Highly recommended if you’re nearby. Clean tables and awesome lights, my order have been done fast tho."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReWFFczNTSEI0YmxJNFYzcFZMVVJVY3pkNWNYYxAB",
            "text": "Great spot in Bushwick, very cozy, good for date time! Really good food!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Fd1dYSlpiMXBPVkcxdmVGSkphVmR1TWkxT05GRRAB",
            "text": "I came here several times. I always have a good time and the food is phenomenal. Kumamoto oyster and sashimi plate are the best!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSZmFFZEJhbXh0Wm01cFoxcHFVbWRJV2taWFFrRRAB",
            "text": "This is a review specifically about the Ikura don. I love ikura so was super happy to see that they have ikura don on the menu! I also got the chirashi don, which was great. But as for the ikura... why is it so sweet? The ikura is marinated in a very SWEET sauce.... that I could hardly taste the special taste of the ikura itself. I just wanted to let the management know that that marinade sauce for the ikura is WAY too sweet!! Please highlight the taste of the ikura itself. 🙏🙏🙏"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcWNVWkJUbXhqTFVwTVozcGlSRGswVmtNek0zYxAB",
            "text": "Not bad for a local spot. Scallop carpaccio was decent. Cucumber salad was refreshing. Corn ribs were good! Gyudon and Mentaiko pasta were crowd favorite. Salmon lover was just okay. Chicken thigh and short beef skewers were tasty. Service was attentive. Ambiance screamed gentrification but expected. I would go back to try other items on the menu if I’m in the area."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wblkydEtUVzh6WmtGSk5sOU1PVFp2WDJ0SE5YYxAB",
            "text": "Food, cocktails, service, and ambience were all excellent.\n\nSo happy to have this gem in the neighborhood. Will be going again soon."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxU2RUZE5jWGN6YXpoT2VGTk1UR3hsU1hCMmQwRRAB",
            "text": "Best dinner I’ve had in a long time and incredible service! Very cute spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0elkxWjVOakV4ZW1SNlNWZ3RNbTVWVlRabGVVRRAB",
            "text": "Absolutely incredible surprise of as space. We had almost given up on local eateries after years of local dining (with a few exceptions). This was great food, impeccable service, fantastic drinks and the space itself is small yet perfectly utilized. We went for some staples we enjoy elsewhere, and now we can’t wait to venture out to their other options."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aV1RsYzFUMDlqVEVsWlZGTm1iMjFPZDFoTU1XYxAB",
            "text": "Tora was anything but disappointing. The tuna crispy rice was probably the best dish we tried on the menu, and their mocktails were also incredibly refreshing. Both of the signature rolls we ordered were delicious. It’s a lowkey spot, so it’s not too crowded which is a bonus. If you’re looking for a place that is casual but also fun, this is the spot!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RVRITXRjMlpKWTA4M2FrTlBXRTVwUzFscldXYxAB",
            "text": "Get the neki toro bowl and the mentaiko pasta. Im a fan."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ka2NXeDJZVkZrWW5kV2EzRllWMjlhUkMxT2FrRRAB",
            "text": "I’m honestly short of words to describe how much I love this place. I came for the first time and was blown away by the fish tacos and crispy tuna—the flavors are incredible. Their ramen and corn ribs are also amazing, I’m completely obsessed!\n\nNo wait time, super friendly service, and such great attention to detail. Absolutely no complaints whatsoever.\n\nI live in the neighborhood and can’t help myself—I end up coming at least three times a month. Do yourself a favor and try them out, you won’t regret it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRVkzSXlabm80ZUVST1FuRXhiV2RUTkRsQlUzYxAB",
            "text": "I have lived in nyc for over 12 years and in that time had maaany meals. This is by far the best meal I have ever had in my entire life. It almost doesn’t feel real because every course was so perfect and expertly prepared. To start we had the grilled squid with a spicy citrusy sweet sauce, the vegetable tempura, and the oysters which were topped with yuzu vinegar and some fresh salmon roe (what a bite omg). Then we had the mentaiko pasta with crispy bacon which was so creamy salty and unctuous and also had the tora Don (raw shrimp, raw scallop, king crab, Ikura, uni, and a little bit of caviar) which was the most mind blowing bite of the whole meal. I will definitely be coming back to try more stuff. It’s insane that this place is tucked away off knickerbocker. Might be the best Japanese food in the whole city. Just the absolute best dinner I have ever had ever ever."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTmFUaE9ZbXhYT0hkTmFuVnphV2RRZVVwdVpWRRAB",
            "text": "One of the best restaurants I’ve been to in bushWick so far.\nThe ramen was delicious.\nI got the tomato ramen and added pork.\nSo sad I couldn’t finish it. Me and my boyfriend left in a food coma.\nTheir egg was one of the best I’ve ever tasted.\n10/10. Will be back again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSVVIQm5RWFZyVEhSb1ZIcFpPRjgxV2xGVE5rRRAB",
            "text": "Ploy was fabulous, the food was divine! Will be back 🩷 highly recommend the Crispy rice tuna and the Bushwick bay cocktail!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVmFHdHRZemRFTUVVMGRrRkxiRU5GYTJ4NFJtYxAB",
            "text": "The restaurant is spotless and well-maintained. The service was outstanding—attentive and thoughtful, with the server taking time to explain each dish. Every bite was delicious, especially the sushi and sashimi. The drinks were great too. I’ll definitely be coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUE4xQmlZVFpXVWtoV1pqRjZTVGhFVmpNeVozYxAB",
            "text": "hey max, thank you  . you truly know the meaning of the word hospitality, see you soon . the food is fantastic, see you soon"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNFNVVlhSMWw0TjNKMUxVWnFORTVET0RoWlZuYxAB",
            "text": "Great food and accommodating. Will definitely recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVVZYSjNOVVJHTjBGT2NHRlFNWHBITkhCU1duYxAB",
            "text": "An excellent restaurant! We ordered the sake don and this fish was so fresh! The katsu curry was also amazing, I loved how the curry was almost like a gravy. We had a great time and enjoyed greatly the hospitality."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaFNFTXhObEp5ZUhoRVdGUXhhMkUxUWxwVWMwRRAB",
            "text": "10/10 experience all around. By far the best meal I’ve had in a while. Highly recommend giving this place a try. Some stand outs for me were the Tuna Crispy Rice (Incredible), the Tuna Tartare, Surf and Turf Combo Roll, and the Chicken Thigh Skewers. All paired with the lovely white rice. Will absolutely be back for more! My friends loved the soup, as well as the various chicken / pork jowl skewers too."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oV1RraGxhMDV4Wm5SQmNVcExYMmRDVUd4Wk5HYxAB",
            "text": "I went to Tora NYC last night for the second time, this time with my girl and my cousin, and once again, it was an unforgettable experience. The vibes were spot-on—elevated yet welcoming—and the food absolutely blew us away. Every dish was a treat for the palate, masterfully prepared and full of bold, satisfying flavors.\nWhat truly sets Tora apart, though, is the incredible team. Max, Len, and the rest of the staff are not only professional but genuinely kind and passionate about what they do. Their energy and attention to detail make you feel truly taken care of. It's rare to find a place where the service feels this sincere.\n\nWe’re already looking forward to coming back—again and again. Grateful for the consistently amazing experience every time we walk through those doors."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbWF6RnRSbWsyUkZwbGVVMWpjRVJxV1RreVkyYxAB",
            "text": "So fresh and flavorful\nTHE BEST Japanese food in Brooklyn! Friendly service and amazing quality. Can’t wait to go back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNVJqUTRiRXhrWTJSRVlVWkZaMVZxWkMxVFdYYxAB",
            "text": "Always have delicious food here and great service. The beef, pork, noodles, oysters, and drinks all are fantastic. The beef is a standout"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsblNqRnlOVVJQT1Y5NlQwWllPVTAxYTNwVldIYxAB",
            "text": "I love this place every thing perfectly"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTFVFSjJSSEJOVFZKQ2FWZG5OR1l6Um1OSVdFRRAB",
            "text": "Great food, positive atmosphere, and a wonderful team."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UWFFWmZkVXhRTVd0a09ITlBSVFpUV0ZaNWRtYxAB",
            "text": "Exquisite 👌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25saFdIUk9NSEkyYTBaaGNWbzFNRTF6TTNORVZFRRAB",
            "text": "The food was extremely fresh and delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReFQyUnpOV0pxYjNweFYyVlRSWFJIV2s5WmVWRRAB",
            "text": "I love this place! Food made with love !\nGreat service and great food.\nThis place is really good Japanese restaurant.  high quality."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONFRWSlBRMHh5YWt4aVZtdEZNSEZyYWtjeFNHYxAB",
            "text": "Delicious food authentic Japanese dishes fresh ingredients great quality of their fish I have the Japanese tacos and the salmon lover yummy"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdXA2VGtBRRAB",
            "text": "Tors is officially our favorite spot! This is a great addition to the neighborhood! Food is AMAZING! Service is great! 100% recommend as it is by far best restaurant in Bushwick."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMWJHWmhSWFJSVldjNGFEUkxZWFZJWjJ4dWIyYxAB",
            "text": "This place was AMAZING!! Food was so amazing they have such a good variety of different dishes, it was fast and the service SO good!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaVZVMWtNVVZFYjNCUmVrYzJiR3Q0YUZCTllXYxAB",
            "text": "Hidden gem in bushwick"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVVVHdENSMjF4Y0hSbllYSldSbVpaVTJzNWRtYxAB",
            "text": "The food was amazing. One of the best sushi spots in nyc. You need to check it out. The service was also amazing. Beautiful interior nice and quiet."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNVlUTkxYelJ2Tmw5cVpscEdWWGREZUhGZlRIYxAB",
            "text": "Hidden gem spot in Bushwick!!! I tried multiple things and tbh i come here for Oysters but didn’t expect that all the foods here are awesome plus the service is on top. I have Server under name Billy and Glen they’re super friendly and attentive. Atmosphere is also nice . I def come back for sure and if s/o looking for izakaya spot in BK I totally recommend to come to Tora Izakaya & Bar !!!!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aVF6SkhaMWx6Tmxsa05rUjVaRmg2YzJ4UmJYYxAB",
            "text": "If you looking for authentic Japanese cuisine TORA in Brooklyn NY is one of the best restaurants I’ve been…good food , good cocktail, good people, good place . Very cozy , good atmosphere. Highly recommended …"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUFJEaGpPRTVqU0dWak9VVkNkV3d3Vm5OdGFFRRAB",
            "text": "Tora is Authentic Japanese cuisine.  Food is amazing. Ilike the taste and presentation of the food and drinks 🍸 specially the cocktail was so good ... place is cozy,  people are friendly.  It's good atmosphere... you must try it . It's highly recommended 👌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNFpVZFpURWRLVjE5TGRHRnVhelU1UVRjMWQxRRAB",
            "text": "The spot is absolute gem. The cocktails are exceptional, my favorite was with vodka and wasabi. Food is amazing, fish is so fresh its just melting in your mouth. Worth every dollar you spend there. Service was top notch as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taYU5EQktSR0p0TFVGR2RVbHFZbGwzVUY5ZmIwRRAB",
            "text": "I had such a great experience at TORA. The vibe is cozy and stylish, and the staff were super friendly and helpful. Everything I ordered was fresh and full of flavor—especially the sushi. You can really tell they care about quality. The bar has such creative cocktails.\nI’ll definitely be coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMlpqbDNPR0pHUTJ4UGRVTkhkMmx4VVhFMmNXYxAB",
            "text": "been meaning to try this place for a while and was not disappointed! Came for lunch and got the mentaiko pasta and sake bowl. they both come with fried vegetable gyoza and salad. everything was very carefully assembled and thought through. the pasta (udon) noodles were perfectly chewy and I liked the flavor. the salmon was very tender and it came with 8 slices. was not sure how good quality the fish was but it tasted good. loved the crispy things on the salad. overall really enjoyed and price point was okay. the aesthetic of the place is quite nice but not sure why the restaurant was completely empty at the time (prob just a hidden gem)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSWFUaGpWRWN3TFVGaVQzVjFNbWt6V2tsNlgzYxAB",
            "text": "A cozy nook to get my meat & beer fix. Service was great and this place was super clean and well decorated."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdlRrODVURzh5TFZSZk1XZ3lialV0YVdwT1dVRRAB",
            "text": "Maybe I caught the place on an off night, but man, I was underwhelmed. The kinoko mushrooms were fantastic; aside from that, everything else was pretty mid.\n\nJapanese tacos were stale and the sushi didn't seem terribly fresh. The shrimp tempura in the surf and turf speciality roll was a bit soggy. The house hot sake was the worst house hot sake I've had at a Japanese restaurant. Wanted to try more food, but after the pork jowls and squid yakitori both failed in the texture and flavor departments, I decided to bail.\n\nI will say, the service was incredible. The earthenware plates, sake bottle, and sake cups added to the dining experience and the modern-chic-fusion ambiance the establishment seemingly  strives for.\n\nMight come back to give one of the noodle dishes and the yokan specialty roll a try because I really want to like this place. The Japanese dining scene is full of strong options; I was hoping to add this one to my personal list of go-to's. Whether I end up giving this place another try and adjusting my review up a star, I doubt it'll hold the esteem I hoped it would earn."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPNkNnYWVhdkpIMjlRRRAB",
            "text": "Amazing spot for oysters, sashimi, and more. Friendly service. Will be back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VObU1fSlMyMzhySXhnRRAB",
            "text": "Stopped by TORA for a quick lunch. First time there, blown away by the service and quality. Spicy salmon roll and vegetable gyoza were delicious. Can’t wait to go back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQQ0V5cEhYeVpUQXZBRRAB",
            "text": "Thrilled this restaurant finally opened in the neighborhood--I couldn't wait to try it!\n\nI started with the appetizers, and the tuna crispy rice was a standout--perfectly crispy and topped with fresh jalapeños. The yakitori set, paired with a draft beer, was wonderfully marinated and full of flavor. My favorite dish was the mentaiko pasta; it was rich, creamy, and simply delicious. The beef sukiyaki had a comforting sweetness, and the yakiniku wagyu hot stone was a unique experience, letting you cook the tender beef to your liking. Overall, the food was fantastic, and I'll definitely be back to explore more of the menu.\n\nAs for the cocktails--they were just okay."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNaUE2TVA1MjRiZ0ZREAE",
            "text": "Food is incredible. The crispy rice is so good and Momoya is my comparison. The salmon zaab is so good. You can’t go wrong with any of the dishes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcjc3TmU5bzQyQWdRRRAB",
            "text": "the food is fresh & good quality"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYmo3ckRTNkphSjhBRRAB",
            "text": "Fantastic food and services. We got shishito peppers, skewers and donburi. Everything was amazing 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYM3JxVEdREAE",
            "text": "Absolutely loved Tora! The mentaiko pasta is a must-try – rich, creamy, and full of flavor. The crispy tuna rice was fantastic too (prob our favorite), with a perfect balance of texture and taste. We also had the crispy seaweed salad, which was light and refreshing, a great start to the meal. The drinks were excellent as well, though they recently changed their happy hour times, so be sure to check before going."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc1pUczJBRRAB",
            "text": "Perfect food and favor full. Don't miss out kumamoto oyster. Service were great. Must try Japanese taco. Food here are so fresh!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMZ1llY3dRRRAB",
            "text": "I came in with my friends a couple weeks ago, and the place is amazing. The food is so pretty and tastes great. It was a large party so we ordered a lot and got to try a lot of the items on menu. Highly recommend the scallop carpaccio, the tempura, the salmon zabb, and the corn ribs. For the dessert, the top layer was a little too sweet, but the bottom tasted great. 10/10 Definitely coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuay1PY0Z3EAE",
            "text": "OMG! This place is unreal. One of the best new restaurants in NYC, no doubt. Talk about fixation food. My wife and I ordered 6 dishes because we couldn’t decide, lol. We already cannot wait to go back. We were in Japan 2 weeks ago and it was like being right back. Amazing service, vibes, and the food was next level."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMHJYVmRREAE",
            "text": "This spot is amazing! And a great addition to the neighborhood. My husband and I went for a late lunch. I got the Sake Don and my husband got the gyūdon lunch special. Both can with miso soup and vegetable fried gyoza. We also share the sashimi plate.  Everything was so beautiful it was almost difficult to take a bite, so it was a good thing the food tasted as good as it looked!! Absolutely delicious!! You can tell the owners have taste, everything seems intentional, from the design of the restaurant, the presentation of the food, the music, the bathroom, and they even had their own branded chopsticks. We can’t wait to go back and try more things off the menu. I think this would be a great first date spot or lunch with friends. I hope everyone enjoys the place as much as we did, and I wish Tora all the success!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbmRtUm53RRAB",
            "text": "Such a great new place all around!\nThe food was presented like art on a plate and tasted amazing. The atmosphere is sleek yet fresh and cozy. Definitely worth stopping in to try and if you are like me, you'll be back for more 🤩"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MmZfUVp3EAE",
            "text": "Everything else I order I was great except the salmon and the fried chicken. The salmon did not taste very fresh and was covered with all these holes. It was super soft and mushy. The fried chicken was super dry on the outside. I had to use both hands and my mouth to tear the chicken apart. Texture was like jerky. Proabably fried too many times. I ordered through uber eats"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNUltZE1BEAE",
            "text": "A Delightful Fusion of Flavors: A Must-Visit Spot!\n\nI recently dined at this cozy spot and was blown away by the delicious fusion of flavors! The men taiko pasta was a perfect balance of creamy and savory, with a rich umami kick from the mentaiko that had me savoring every bite. It’s definitely a dish I’d return for!\n\nThe cocktails\nwith mezcal were equally impressive—bold, smoky, and perfectly crafted. They added a unique flair to the meal and paired wonderfully with the food.\n\nBut the highlight for me was the grilled skewer from the izakaya section. Everything was cooked to perfection, juicy and tender with a zesty, spicy punch that left my taste buds dancing.\n\nIf you’re looking for a spot with inventive dishes and a warm, inviting atmosphere, this is the place to be. Highly recommend!\n\nPlus, the non-alcoholic selections are beyond I personally love Matcha with coconut highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbnBXVU5REAE",
            "text": "Cool & Hip Japanese restaurant in Bushwick. One of our instant favorites.\nI like spicy and tangy food so my favv are salmon zap and tuna tartare. But honestly everything was good. I will come back to try the other out. The drink was great. Simple yet creative and delicious. Kind and friendly service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eUl5aXRnRRAB",
            "text": "Unique fusion Japanese food such as Salmon taco made with crispy seaweed instead of flour, Corn Rib with parmesan on top, and fresh Mentaiko pasta with bacon. Although small, the restaurant offers indoor and outdoor seating with stylish bar. Service was prompt and attentive. Restaurant was clean and loved their mocktail and tea selection. Convenient location near subway with adequate free and paid street parking option nearby. A good place to come hang out, grab drink and bites in chill comfortable setting!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX0xlUk9nEAE",
            "text": "Had dinner here and the staff was extremely attentive, the food was so flavorful and came out relatively quickly. Would come back and try more dishes in the future. We just moved here and will 100% be back often!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aHVpRnN3RRAB",
            "text": "TORA offers a cozy Japanese dining experience with well-balanced and fresh flavors, as well as some fusion elements like chili crisps. I enjoyed the salad and gyoza that came with the lunch special. The scallop carpaccio was a standout, and while the toro wasn’t as fatty as I expected, it was still good tuna.\n\nThe gyudon was a bit dry but decent overall. The surf n turf roll had an amazing smoky undertone from the wagyu, and the shrimp tempura was fried perfectly, though I wish there was less mayo and sauce.\n\nOverall, a solid meal with exceptional service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOZUxuZmJadTd1dDZnRRAB",
            "text": "Found this little place, highly recommended fresh ramen, the basil lemonade so refreshing will definitely go back to try new dishes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cmNhdkpREAE",
            "text": "A new and exceptional Japanese izakaya and bar has opened in Brooklyn. The skewers offered are incredibly delicious, leaving a lasting impression. It is highly recommended to visit and experience this remarkable establishment, with plans to return in the near future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuX2ZDb0NnEAE",
            "text": "Yummy food !! I love Salmon zaab and Mentaiko Udon ♥️ Cocktail hits the spot 🍸🍸service was good. Highly recommend :))"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNGJxNC1nRRAB",
            "text": "Wow!!!\nThis place is a phenomenal new addition to Bushwick.\nThe sushi is SO INCREDIBLY fresh and tasty. The staff are all so friendly and lovely. I really loved the ambience, the decor is cool and I Shazam’d every song they played on a cool club kinda soundtrack.\n\nAlso I didn’t think you could perfect an aperol spritz but somehow they have.\n\nI can’t wait to go back here and hope it becomes as big a hit as it deserves to be!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNlB5VTZ3RRAB",
            "text": "Highly recommended!!!  We went to TORA. We ordered many things, everything was perfect and so delicious.  Thanks to our server and made us to special weekend❤️❤️❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMVBlU2xBRRAB",
            "text": "Yakiniku Wagyu Hot stone is the best. Also they are limited order just comes and order them first. I love the cocktail and also mocktail love the song and vibe here. Nice service Definitely come back again!"
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZelBEOWJREAE",
            "text": "Sehr gutes Essen, japanische Spezialitäten und haus-erfundene leckere Coctails. Glänzend saubere Räume und Einrichtungen."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUM3FqNTFRRRAB",
            "text": "Great foods Good drinks with cozy atmosphere, the staff very friendly I visited them 2 times in a row Love these place, this is the one spot gem you should try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa3V2RHFRRRAB",
            "text": "Had an amazing dinner.  Such a cute date night spot and haven’t found a sushi place like this in Bushwick for a while.  Ended the night with a complimentary dessert 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNHFLOUNBEAE",
            "text": "we came at lunch and had the lunch special. Tuna and Salmon combo and Mentaiko pasta, then ordered the tacos to try as well. The miso soup and veggie gyoza come with it. I love that the gyoza is fried. All of the food was delicious. We had green tea pot and a beer. Great proportions. Service was easy and hospitable. Space is airy and gorgeous. We are so happy they have come into the neighborhood!!\n\nOnly add on.. Would love if they added the non alcoholic Asahi beer non drinkers."
        }
    ],
    "reviews_count": 72
}