{
    "name": "The Wheelhouse",
    "place_id": "ChIJ60Ws1ARcwokR_iOeFDzEHPA",
    "grid": "BK4",
    "address": "165 Wilson Ave, Brooklyn, NY 11237, USA",
    "rating": 4.3,
    "user_ratings_total": 373,
    "phone_number": "(718) 483-9970",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WVVGTm5lbk5IUmkxdlUxWlFNMmxoYkdsNU9XYxAB",
            "text": "The food was very  good  service was great  The place  looks very cool  The bathroom is clean"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWclV6WkNhbkZ1YVdGbFJGZHNNMTlMZDIwNFpGRRAB",
            "text": "Sandwiches and tomato soup are 💯💯💯. So delicious! I love the chill vibe of the place and the staff are so friendly!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sclNrZEdVbWxMVTJablFXMDFVUzEzVFRkSE9GRRAB",
            "text": "Just incredible food and service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eVduVmFRV2x2V0VsQldscExVRE51Tm5Oa01WRRAB",
            "text": "Oh my Lordy it’s perfect! I got the Philly cheesesteak melt but on sourdough and it was soooooo fire.\n\nTheir house salad is dope, it has mandarins, red onion, carrot, and a light vinaigrette. Perfect.\n\nYou can tell it’s family owned and family vibes.\n\nWe had nice beer and played dominos while we waited for our food. Would definitely come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMGJEQm5TakJ2VkdoWlpYVmxVR3R6TkhJNVgxRRAB",
            "text": "Sandwiches are top"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWS05XVmZRM2s1WjIwNGFEVnVaV1J2VmpkdVlXYxAB",
            "text": "If you're looking for the best spot in town, this is it! They serve amazing sandwiches, but what really makes it special are the owners, Philip and Susana. They are such wonderful people and love chatting with customers. If you can, definitely choose to dine in – it’s the best way to enjoy the atmosphere and the food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocExXMWZMVEZWVVRaMlgwUXplRmRUU21welZHYxAB",
            "text": "The tomato soup with a gruyere grilled cheese oh my gosh ✅"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa2NFbEpYMjlSU0dsR1YxQjFWMGxGTkdwc2RIYxAB",
            "text": "OMG…. The Pastrami Breakfast Sandwich is absolutely amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRlNFbFJXamszYldVeWRHSnFVMHB1Y2xOYVdFRRAB",
            "text": "My favorite tomato soup ever. Been coming here for years, used to be every week when I lived closer. Good sandwiches, good sides, friendly service, chill vibes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMWFuVlJSM3A0WHpCNE4xRmZlVWMxTUZwNE1tYxAB",
            "text": "I ordered bottomless mimosas for nah our and they did not disappoint! The beet salade to die for. Loved very much and so close to the house. Adding to my weekly rotation"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTE16WTFSWFo2WWtzMmJrcFBhM0Y2V21KQk9WRRAB",
            "text": "Thry are too much slow."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGZk9YQm9lakZ1WVhOc2NITmxObFprU2tsaWQxRRAB",
            "text": "The Wheelhouse has some of the best food in Bushwick and the staff is so so kind and hard working. I eat here every week and it never disappoints!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOYU9IRlFZbVkxUWxSSWMyVTROVzFrYmxSMGNrRRAB",
            "text": "The staff did a great job of keeping it entertaining."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoaVNFMVhVbFk1ZFRsblIySkpjMUJHVDA5V2JYYxAB",
            "text": "Delicious menu with many options for all! Great service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKWDN0dHYxOWZ5Q2pBRRAB",
            "text": "We were seated immediately. It was trivial game night. Had cavitelli and short ribs with garlic bread. Delicious! Good service. One of group had Tornado sandwich. Enjoyed it. Worth the visit. Good prices."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLckdnc1dfcU4zSjFRRRAB",
            "text": "I just ordered broccoli cheddar soup and they literally gave me a cup of liquid with nothing inside. Extremely disappointed."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveS1fczVBRRAB",
            "text": "I’m reaching out regarding a disappointing experience I had at The Wheel Heist. I placed an order, but when I got home, I realized the tomato soup I ordered was missing from the bag. I drove 20 minutes back to the restaurant to resolve the issue, expecting a simple reimbursement or at least an apology.\n\nInstead, I was met with unprofessional behavior, particularly from Brandon and possibly the chef. Rather than acknowledging the restaurant’s mistake, I was treated with disrespect.\n\nThis kind of treatment is unacceptable, especially when the error was on your end. I hope this matter is taken seriously and addressed appropriately.\n\nThank you."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdUxqeTdBRRAB",
            "text": "As a Bushwick native, I can’t believe I’ve only been here once. The menu looks very nice, I plan on coming back to try some new things. I came for brunch and I was very satisfied with my meal. I got the avocado toast with eggs and sausage on the side. Next time I come, I’ll probably bring a group of friends. The ambiance would’ve felt nicer with people to share it with."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJZ05pSDRnRRAB",
            "text": "Best Mac and cheese ever with the most affordable prices! My friend and I went because we were craving something new and this spot did just that!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOEtIV1VnEAE",
            "text": "I was not prepared for how good the food would be here. The Deluxe Breakfast Sandwich was honestly one of the best breakfast sandwiches I’ve ever had. The avocado, runny eggs, blackened bacon, red onion, and melted cheese was a sublime combo. Even the tater tots were perfect. Washed it all down with some mimosas for the perfect brunch."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ajZyUDFBRRAB",
            "text": "Wonderful place!\nRecommend everyone."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NjRuR3ZRRRAB",
            "text": "Very very killer Cuban sandwich!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMU1mRTB3RRAB",
            "text": "Delicious food and excellent service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNna3ZIQ2RREAE",
            "text": "cute local sandwich spot that seemed quite pricey for the quality of food. their soup was good"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdjh5OGxBRRAB",
            "text": "i don’t often want a jazzed up grilled cheese but when i do. i know exactly the spot (it’s here). also they have pretty good mac and cheese and brussels and tomato soup. i’m going later"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOUs2TTZRRRAB",
            "text": "Sooo dang good! My go to neighborhood sandwich spot for sure. Great variety and everything I’ve had so far has been delightful! Fries are also nicely seasoned and pairs well with their chipotle aioli. Gotta try the jerky boy sandwich!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaU1ES2p3RRAB",
            "text": "One of the best grilled cheese I’ve ever had."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMya01HRmxBRRAB",
            "text": "Great sandwich shop"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMDk3ZllBEAE",
            "text": "Great food, great staff. Super courteous, has fresh water outside for pets / strays which is so sweet. Never seen that before, warms my heart. Tomato soup 10/10 also!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubmJUdXhnRRAB",
            "text": "This place nails the basics a meat-and-potatoes fella wants. But what's really remarkable is that when there was a hiccup with my order *the owner himself delivered the food to ensure it all worked.* They seem a bit dysfunctional, but the owner cares with all his heart. There is real potential here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcE1iZUpBEAE",
            "text": "Seriously obsessed with this place. The mac and cheese is fire (so are all of the soups and vegetarian sandwiches), the ladies who work there are incredible, and overall its just so lovely."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcWNUdURnEAE",
            "text": "I've come to really enjoy the short rib ciabatta sandwhich"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicl9xaWJBEAE",
            "text": "I’ve been to The Wheelhouse a couple of times, and it has yet to disappoint. This was the first time I’ve remembered to take a picture of my food before indulging. Also my first time trying their breakfast, and the deluxe breakfast sandwich was amazing. Price, service, and atmosphere is always fantastic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNDZYYVF3EAE",
            "text": "The food is incredible"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaExhemNBEAE",
            "text": "Grilled cheese and tomato soup is amazing and it actually delivers well!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyazlMSGJBEAE",
            "text": "Hidden Gem. More than just a ‘sandwich shop’. Great prices, great food & atmosphere. You won’t be disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyanFUNS13RRAB",
            "text": "If you order crispy foodi like grilled cheese sitting in a container, they will get a little soggy. I'd usually pop it into the oven, not microwave, to heat it up."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaXIzWjVnRRAB",
            "text": "Considered becoming bulimic after this meal. Greasy, randomly expensive, not worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMOWFQSjNBRRAB",
            "text": "Stumbled upon this place and we were all very happy we did! Food was fantastic and this coming from the chef. We had vegetarians and gluten-free people with our group and all of them were well satisfied with the selections that they had. I would highly recommend this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMMW9HSTRRRRAB",
            "text": "Great service. Food was delicious. They were very thoughtful to my needs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaE15VXBnRRAB",
            "text": "The atmosphere is kinda weird in here. Soggy not crisp pickle, but the sandwiches were so good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNFlyZ3RBRRAB",
            "text": "Maybe this is just because I ordered online, but the sandwich was soggy and greasy. I ate maybe half and felt nauseous afterward. I spent nearly $18 on it, and it didn’t come with sides—I wish I had just cooked at home instead."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqLVAyMTJ3RRAB",
            "text": "Different sort of review here. I never did receive my food that was ordered on UberEats. A driver was never called, just a human error. But in this digital age restaurants don’t care. And seems like we have all forgotten the human touch.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREanBXb1pBEAE",
            "text": "I’m in love with braised short rib sandwich. The best sandwich ever! I’ve been there 3 times now and will definitely come again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeXU2cWt3RRAB",
            "text": "Brussel sprouts tasteless and not “crispy” as the menu implied in title, bitter, lemonade was average. Not for the cost at all, nice waiter. Clean environment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENk8zMnd3RRAB",
            "text": "Came here once to charge my phone since I had lost power. Bartender was very helpful in getting me charged up. Food was pretty good too. Would come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd1BUWUdBEAE",
            "text": "Had the short rib sandwich and it was amazing. My partner had a Cubano and it was somehow even better. Definitely give the fried brussel sprouts a try too. Going to make The Wheelhouse a regular stop."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5cnJLTnNRRRAB",
            "text": "The food here is so good! I love a soup sandwich combo. The Cuban sandwich is SO GOOD!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dHI2dW93RRAB",
            "text": "I'm from England, so I know what a sandwich is. But even for American standards--an extremely low bar--this was an absolute joke. To be clear, two thin, soggy strips of cardboard I would hesitate to call \"bread\" with a congealed stratum of processed \"cheese\" barely the thickness of a pencil is NOT a sandwich. This barely qualifies as food, and certainly not for $10.50. I was hungrier after eating it.\n\nThe garden salad was nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MUppY3p3RRAB",
            "text": "The food was delicious... me and my company was greeted warmly and we went with a BBQ pulled pork sandwich and a braised short ribs sandwich with 3 cheese mac and cheese appetizers.. both was delicious. Its reputation is well deserved and I would come back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwek03cmt3RRAB",
            "text": "A nice restaurant that sells a variety of grilled cheese sandwiches and other things like. Tater tots, salads, soup and Mac and cheese. Service was great I had the New York Sourdough Reuben. I ordered some tater tots for my 18 month old daughter to try. We both enjoyed it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoXzhYZ3RnRRAB",
            "text": "Love this place. One of my absolute favorites in bushwick. They have such good options for lunch. They have a brand new menu with even more options to choose from. I got fish tacos which were so good. You can’t go wrong with their sandwiches. This is what they are known for. The pulled pork is a favorite. Their max and cheese is soooo good. Highly recommend checking this place out."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNk1xMXVBRRAB",
            "text": "Cool staff and tasty sandwiches. I recommend the build your own grilled cheese. I will say that the decor is laid back and nice and the drinks are a bit lacking. I had the eggnog and it was very watery but the grilled cheese was amazing! It’s totally worth a try if you’re around and want a solid sandwich!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzcXRLRVJ3EAE",
            "text": "This place ROCKS. Seriously, maybe the best cubano I’ve ever had. The atmosphere is very inviting and the staff are so nice and friendly. I’m very glad to have happened upon the place and highly recommend any of their sandwiches. I will say…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURReThIdUZnEAE",
            "text": "Great fulling food. The taste of the tomato is sweet but sadly for my taste buds and tart after taste. All off the grilled sandwiches are large and have a great taste. You can substitute didn't proteins for what you like. I'm sad no liquor but the mimosas are made to enjoy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNloyX3hBRRAB",
            "text": "We were in the area and wanted a tasty bite. This place did not disappoint with flavor! The Mac & cheese was hearty, filling and flavorful. The short rib sandwich was great! Sourdough bread was toasted perfectly and the bite was very…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaX0tiTFB3EAE",
            "text": "Downright scrumptious sandwich. I got the Panavia Tornado. Very rich meal. I’ll be full until late tonight. Wonderful server. “Everything is made with love,” Sue, my server tells me. It’s clearly true!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMEtlaVJ3EAE",
            "text": "Had the burger and the Cuban sandwich…the Cuban is good but the burger was way better tbh….it was trivia night the day I went. The prices are cool and I sat outside. The service was awesome and the Brussel sprouts were also amazing.  Worth a visit for sure this summer. Cute spot"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaGItaXBRRRAB",
            "text": "I got the grass fed burger. I called the restaurant directly because I live close and was paying cash. They didn't ask how I wanted it cooked and I didn't specify. I like my burger a little pink on the inside and it was fine where it was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMnZXdEJ3EAE",
            "text": "I come here about once a month, and they never let me down. My go-to is the Braised Short Rib sandwich and a large tomato soup. I actually dined in for the 1st time, and it was a pleasant experience. I've always gotten my food to go, but today I had some time and ate in. Great food, great service, and very filling.  Thank you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNObnRlNzV3RRAB",
            "text": "Love The wheel house! The music is great, cozy vibe, delicious food. Highly recommend the PanaVia Tornado (award winning sandwhich!!) and tomato soup."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhanNQcnNBRRAB",
            "text": "The Grilled Cheese was one of the best I’ve ever had in my life, would’ve been the best if there wasn’t a hair\non my sandwich. The tomato soup is God awful with that fake processed cheese…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBb19DM3dnRRAB",
            "text": "Amazing bar in Bushwick to grab a quick bite with friends or hang out for beers on a 90° summer afternoon. Quick service and delicious sandwiches. Nice rock music on the background and helpful servers. Thank you Danny."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdEpTS0R3EAE",
            "text": "It was a hot day. We stopped in for a quick bite. The food and drinks exceeded or expectations. We had a stroller and our server was more than accommodating. If you're up for a milk shake, go for it, they're worth it.\n\nBonus: they have a TV and board games"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhenVyOHZBRRAB",
            "text": "Really good food with a nice outdoor seating area.\nI didn't have my Vax card on me so I didn't hang inside for too long but I'll be back in no time, the food slaps"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdE83ZldBEAE",
            "text": "This is a Bushwick true hidden gem; can’t emphasize how good the entire menu is; family owned and without half the shenanigans of NY hospitality that doesn’t add to the food; here is all about the taste"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRc3NMZzBRRRAB",
            "text": "Delicious food and great atmosphere! The staff is friendly and attentive, and the beer selection is great. The hakuna burrata and fried Brussels sprouts are my favorites! Tuesday night Geeks Who Drink Trivia is also a blast."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlM0kzN2ZREAE",
            "text": "2.5 Stars. Perhaps my expectations were too high. Braised short rib sandwich lacked flavor which isn’t what I was expecting. Ordered potato leek soup but got tomato and it was simply not good…Quite disappointing overall, I would not return or recommended."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLNHZ1Z01REAE",
            "text": "The new outdoor seating is dooooope and the new michelada and new spritz is good :). Happy hour from 3-7. They have brunch on the weekends now and I am obsessed!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNN3Uzc2ZnEAE",
            "text": "The best sourdough sandwich I’ve had in Brooklyn. Crispy, savoury and juicy. I highly recommend if you need a good hearty Sunday meal."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzb1BPcXRRRRAB",
            "text": "Amazing find in Bushwick! Loved the vibe in the place great for a date night. Happy hour til 8pm with $5 wine and beer. I like the Pinot Noir a lot. Ordered the smokehouse turkey sandwich with the signature tomato soup and my favorite Grass fed burgers was so juicy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKc1pyV0p3EAE",
            "text": "The Wheelhouse has recently changed ownership after nine years, and is now owned by a warm and friendly husband and wife, while retaining the same kitchen staff. They have kept some of the old favorites on the menu but have also included new selections.  Indoor and outdoor seating is available, and we elected to eat at the cozy bar.\nMy daughter ordered the braised short rib sandwich with tomato soup, and I decided to try the pressed sourdough Reuben.  Everything was delicious and nothing disappointed!  The food, atmosphere and owners were all delightful and refreshing.   Definitely worth a visit, or two!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxM3RHSHRBRRAB",
            "text": "I mean……… free hair with watered down tomato soup(delivery)? This place went through quite a downgrade in quality coming out of the pandemic ngl… sad, but true. SMH"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aGN1ajd3RRAB",
            "text": "Pretty good sandwiches but a little pricey for what you get.\n\nI’m editing this review after going there several more times.\n\nThe food is great. The sandwiches are tasty. I’ve made my own and had the brisket sandwich. Both are really good. The brisket sandwich is actually pretty incredible especially if you get the tomato soup and dip it. Soup is really good. They have the best tater tots I’ve ever had. I don’t know what brand they use or if they make their own but they are super crispy and the mince on the potato is so fine that they melt in mouth. Salad is also really good. As far as the price it’s pretty average at this point. (I guess I’m getting used to food inflation). I like that you can add extra sides to your meal for only $3 a piece. That’s a steal. The sandwiches already come with a side. I’m going to go back to try their entrees. The pasta looks really good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaZ012RDRRRRAB",
            "text": "The food here is excellent! We get it delivered all the time. If you like Buffalo Wings the Buffalo Chicken Mac and Cheese is amazing!!! The reuben is excellent. Sandwiches and tomato soup - excellent. Never had a bad meal here. Tater tots with bacon and cheese. OMG. If you're in the mood for this kind of food this seems to be the place."
        }
    ],
    "reviews_count": 75
}