{
    "name": "Carmenta’s",
    "place_id": "ChIJcwh59ARcwokRH_Ew6Plj6Qk",
    "grid": "BK4",
    "address": "50 Starr St, Brooklyn, NY 11221, USA",
    "rating": 4.7,
    "user_ratings_total": 466,
    "phone_number": "(718) 676-5003",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscFNGbzRiMDFYTFU5NE1sbDZiUzFNUkhKUVNuYxAB",
            "text": "Carmenta’s: A cozy spot known for its warm ambiance and hearty comfort food. The menu features a blend of traditional and contemporary dishes, with an emphasis on fresh ingredients and bold flavors. Service is friendly and attentive, creating a welcoming experience. Popular for its flavorful entrees and well-crafted cocktails. Ideal for casual dining or small gatherings. A solid choice if you want good food in a relaxed, inviting setting."
        },
        {
            "date": "수정일: 2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlM1BuT0p3EAE",
            "text": "Update: 11/3/2025\nIn response to response - this has nothing to do with price. I didn’t even notice there was a price increase. So I will clarify, it didn’t taste good. You fell off on the TASTE of the food.\n\nUpdate: 10/1/2025\nI can’t believe I’m saying this but….they fell off. I could always count on this place to have quality food even when delivered. I got the fennel pasta and I’m so disappointed. Cost does not live up to the quality anymore. This is so sad.\n\nOriginal:\nI tried a pasta dish from this place once a couple years ago and didn’t forget about it since. Ordered the rigatoni and the ragú a couple weeks ago for a friend and I on Uber Eats. Food arrived fast, HOT, and delicious. An adventure of flavor worth spending a few extra bucks on. The portions were good, bigger at some places but that was the last thing on my mind because the pasta was so good. 10/10 would recommend and I will return."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcWJ6bDBTMEphYVdwaVlWZFpVbG8wWjFWd1NHYxAB",
            "text": "Delicious sandwich!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poa05IaFBia05HV1RsRk1qazNURzVPY1VRd09VRRAB",
            "text": "This place is special.. great food (phenomenal bread), cool owner/staff… hit it!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNVh6TjVOMHQwV0dwUlZuZEdUR3hhZFRaSlNtYxAB",
            "text": "This shit so good i’ve never told anyone about it. Say less."
        },
        {
            "date": "4주 전",
            "language": "la",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbVYxTmZWRlZzWWpKSWVtRmpaM1ZyUkZobFluYxAB",
            "text": "Great rigatoni"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRd1FVaDZha0ZCZFdSc1dYZ3dRMjFmVFVSNE1YYxAB",
            "text": "Absolutely exceptional subs and one of best Tiramisu's I've ever had. We can't wait to come back and order another!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wd05FOXNORzlxUTJrNGNEaE9kaTFtVkhWWlRXYxAB",
            "text": "My friend Sabine from local area brought me here, my first Meatball sandwich ever. It was absolutely amazing. Coming back from the UK asap for another one :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdWQyUlpSSFkwU1Y5SWNUQXdkaTFmVG5sTFFXYxAB",
            "text": "Randomly checked this placed out on a spontaneous walk and now it’s my personal favorite. The aroma of garlic and herbs takes you in as soon as you open the door. The pasta is fresh and the sauce savory and rich. This place lit me up enough to write a review, because something this good should be well known. Authentic and amazing quality. You will definitely see me again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa1NsZHJPVlF3UkZSNGFVMVllR3BUYVhoVFUxRRAB",
            "text": "Omg first time there,,,fantastic, great great sandwiches, another level,,, u will not be disappointed , owner really nice guy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSldEWnBkV2MwY2pGb1JHZHRUakp5UTJWRGVIYxAB",
            "text": "Stopped in for dinner and it was delicious!\n\nI wish the seating situation was better, its more of a deli atmosphere than a sit down dinner spot, which is fine but I wasn't expecting it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaFVTMVVja1poVFVkWFlVaGhSVTlsVVRWRmRGRRAB",
            "text": "It’s worth it, every time."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkU1VXTnhWSHBmWjJSNk5UTlhZMUl3VXpaeGQzYxAB",
            "text": "the food is AMAZING, but guys why must you put hot pata on top of a salad box for delivery, and then on top of that throw the dressing container INSIDE the salad box ?!?!? Like what??? Do better"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padFJqbHlUWGRGYWpONVltSTRiak50YTE5UlMyYxAB",
            "text": "so far, so great! Jose special was delicious, definitely heavier on the meatballs than the eggplant which is.  how you’d want it! Definitely makes me want the spicy eggplant parm tho….. I’ll be back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWb1dWQTNWVXhNTkVSZllqRXRNRkppUjNGYWMxRRAB",
            "text": "I love Carmenta’s so much I had them cater our wedding and it was perfect. Every single guest was overwhelmed by the greatness of these sandwiches. And while I would have liked my guests to stuff their faces with more sandwich, I was not unhappy to go home with leftover Dom G, the platonic ideal of an eggplant sandwich. I ate Dom G for four days straight. I loved Dom G. I saw Dom G in my dreams. I became Dom G and I feel no shame. My wife and I are already planning on renewing our vows to do it again. Thanks Carmentas!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSYU1HTk9kV3BIZUMxNVMzUnVjRmx5Y2xKNFYwRRAB",
            "text": "A memorable dining experience worth repeating."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeE5FVlBRa3hJVGt0ME0zRlRXVVI1UTNsSlJIYxAB",
            "text": "The turkey salsa verde sandwich is so incredibly bomb"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWVJURnFaVkpETlV4NlVpMXZNRE5SYTE5R09YYxAB",
            "text": "I've been multiple times and all of the sandwiches, pastas, and side dishes have been delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUFJreEZRbFZ5ZUMxNE1IVllXR3BwVjNSbGNFRRAB",
            "text": "Simple menu, tasty sandwiches, not much seating but it works."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTmRVVmtSSGxQYTBacGVrSnhRbUpXUm5SME9YYxAB",
            "text": "What a great little place, food was delish, music is on point . I walked in and it was empty with in 10 min it was standing room only.  Perfect little spot to get a awesome sub and a side dish. Reminds me of when I was younger working in the deli .  If you want good, tasty food with no bougie attitude and keeps things real then step right up and try and grab a seat. I feel prices are fair to what is going on every where with pricing , always enjoy this place, I had the turkey sandwich with a gigante bean salad  and was dunkin my sandwich in the salad to soak up all the dressing !!!  The Tiramisu is on point only one better was my grandma with her gift of cooking but this place is number 2 for me .  Just go and try it and enjoy it , and not just the tiramisu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOR1RqYy1MOWN5dzB3RRAB",
            "text": "One of the best spicy rigatoni i’ve ever had. The sandwiches the garlic bread the meatballs. The workers are amazing!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMX1p2NzdkZ0xtS3BnRRAB",
            "text": "Awesome food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVDgtdV95eGN5c1BBEAE",
            "text": "Tasted like we got teleported into someone’s Nonnas kitchen. I’d procrastinated going for ages because I couldn’t figure out what I’d like from the menu but the person taking orders was super helpful and there’s seating which I could never tell from the pictures"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNU0VfUFBmMllYdlZBEAE",
            "text": "Incredible meatball sub!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQaUwzb0dPX1B6VjJRRRAB",
            "text": "THE BEST Italian sandwich I’ve eaten in New York.\n\nGet the Dom G sandwich on garlic bread, you’ll thank yourself you did.\n\nOh and don’t forget the golden beet salad, man it is refreshing and so damn delicious.\n\nWe also got the Radiatore, very healthy and delectable.\n\nI am shocked not enough people know about this place. I wish I knew it earlier.\nSuper cute spot and great service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQanZxYUwtaTdyRHl3RRAB",
            "text": "It’s hard to find a place that cooks eggplant right. Look no further than Carmenta’s. One of the best spots in the neighborhood"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNQ083S3U3OUxIOTFnRRAB",
            "text": "Forget grace. This is not a church. It’s a hunger. Let yourself be devoured too. By the sauce, the moment, the beautiful person across from you. The one who saw you lick your thumb and didn’t flinch.\n\nOrder the eggplant parm it’s a wreck. Sloppy, collapsed, sinful. Oily like lust, like something you shouldn’t eat in public or maybe at all. But you do. It’s the kind of meal that ruins your shirt and your sense of order.\n\nThe pasta comes out like a dog flopping into your lap. Enormous and happy to be here. It’s got that bite. Al dente but emotionally, too. Like, don’t forget me it says.\n\nYou sit in the window like a fool on a date with someone whose teeth you’ve memorized. You want them to like you. You want them to get it. And then the sauce is all over your face, your fingers, it’s in your laugh and they’re laughing too and it’s over. And you know it.\n\nEat like it’s the last thing you’ll do and the only thing you ever got right. Like the food knows your name. Like you were born with a fork in your heart and this is what it’s for"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJWEdsUEdDMU10MhAB",
            "text": "We got delivery from this place and it was absolutely fire.  Highly recommend.  Hard to get delivery pasta right.. the marinated artichokes tho!?  Thank you!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKUEQxdi11cEwzeFZBEAE",
            "text": "the best! you want a hero , this is the spot"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKT1dfOXFleXV6dFNBEAE",
            "text": "I like some stuff here but the pasta will only wow u if u can't cook at all and im sry but this sandwich bread is just not good... It's either couple days old or just mid to begin with. Their sandwiches might be good if they found a new bread vendor or stopped using yesterday's bread"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJejR3OXFPblp2R2FnEAE",
            "text": "So yummy!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbndfUDNGNFl1anJRRRAB",
            "text": "Love this place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQWDIzY2FWci15WkJBEAE",
            "text": "since there's not many Italian spots nearby, I wanted to try it. I got two pasta dishes.. they were both mid... but not horrible."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeFlUNVZREAE",
            "text": "I love chicken parm. My favorite desert? More chicken parm. Wanted to find the best in northern Brooklyn for my birthday. Holy crap this place was incredible. I’m coming back again and again. The $3 garlic bread upgrade was totally worth it. Bravo.\nGet a seat if you can, but to-go is just as good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNGZMMDBRRRAB",
            "text": "Carmentas on speed dial. no one does it better"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMHJhaTV3RRAB",
            "text": "love this spot for every reason"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ3ZlNmdBRRAB",
            "text": "Really wonderful pasta and sandwiches for if you want something low key but a little bit gourmet. Only a small indoor dining area--maybe get a sandwich and take it to the park?"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeU1LcU93EAE",
            "text": "Me and my boyfriend came here today on out last day in NYC.\nThis was hands down best meal we ever had since in NYC.\nWe were served by Carlos he was amazing and food was top class.\nWe will be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNTR2S1NnEAE",
            "text": "great food! I love the spicy eggplant parm sub and the caesar salad! one time I face-planted in there when it was raining and the worker was worried about me ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcDgyQm9BRRAB",
            "text": "Absolute favorite. Everything is so delicious, guys are so sweet. I love it here so so much."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJamNEcGlRRRAB",
            "text": "Incredible prosciutto sandwich. Flavor. Texture. Quantity."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NTQyeEtnEAE",
            "text": "Best sub in the neighborhood!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NmV6bzJnRRAB",
            "text": "Was a huge fan of this place and frequent customer but unfortunately this will be my last time giving them my business. I ordered delivery from them and I opened my door when the food arrived and the delivery person would not hand me my food saying he wouldn’t because I didn’t tip him through their website and asked for cash. He was extremely aggressive about it and was tapped his foot impatiently while my boyfriend went to grab cash for his “tip.” I don’t appreciate being held up at my doorway it was extremely uncomfortable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OE1qOVFBEAE",
            "text": "Goodnight food 🥑🥝"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eFlMU013EAE",
            "text": "Have been here three times and have been overjoyed every time. Everything is delicious and made to order!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aGFURkhnEAE",
            "text": "My favorite is the chicken parm sandwich."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NUlhRWVnEAE",
            "text": "This is absolutely one of my favorite places. The crispy potato’s are godly!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NElUdVhnEAE",
            "text": "I ordered pastas from Carmenta’s and they were just amazing. I am writing this review while enjoying them (🤤🤤). Will define tot try again at the counter."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdC1iOElBEAE",
            "text": "Went here for lunch first the first time and I was very pleased.Had a chicken cutlet sandwich with broccoli rabe and fresh homemade mozzarella . Bread was great broccoli rabe cooked perfect. Than I tried a meatball and rice ball and was amazed. I have to tell you I grew up with authentic Italian food and I was impressed and will be a continued customer from now on!! Definitely recommend this place and if You havent tried it yet I suggest you get there and try it for yourself!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbDhIaTFnRRAB",
            "text": "I can still taste the pasta, so good! I definitely want to go back and try more from the menu. It’s a great spot for a nice bite, though not necessarily a quick one. The pricing is straightforward, either you want it or you don’t, but no complaints. The food is well prepared and served in a reasonable time."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnXzh5TXlnRRAB",
            "text": "Summary: Warming with Great Food\n\nCarmenta’s is a great place for food but specifically their sandwiches. This small but inviting cafe has a warm, welcoming vibe the moment you step in. The intimate setup, with the kitchen right in front of you, makes for a unique and personal experience. The staff is friendly and attentive, adding to the vibe of the place.\n\nWe tried two sandwiches, the meatball sub and the Dom G. While both were excellent, the Dom G was the standout. As a meat lover, I was shocked at how flavorful and satisfying this vegetarian sandwich was. Every bite was packed with rich, balanced flavors that left me perfectly content.\n\nOverall, Carmenta’s is an outstanding experience with great food and a cozy atmosphere. Highly recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcHFtOHlRRRAB",
            "text": "It’s the best pasta I’ve ordered. I had to tell the staff that it was absolutely delicious. I ordered the Rigatoni with some kind of sauce that I forgot the name and an order of Rice balls… it was perfect, the cooking time in the pasta was spot on, the salsa was just perfect… the staff is very attentive and friendly. Will be back for sure. I recommend this place 100%"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbjVHUDF3RRAB",
            "text": "Solid food! I got the spicy eggplant parm on garlic bread. I never get the vegetarian option, but I didn’t realize they had the same version with meatballs. I will definitely be back to try that version as well as Italian combo hero. Fresh and hot!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncW83S3JnRRAB",
            "text": "Delicious little sandwich shop with excellent sandwich. The bread in particular was superb and I would not sleep on the specials - the Italian ham and mustard is the best sandwich I’ve had in NyC in the past two years."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkOWJLUEpBEAE",
            "text": "I think life just makes more sense with a  sandwich, and thankfully there are places like this to make that dream come true. A very solid place in a cool area, I got a spicy eggplant parm and can't wait to come back and try it on their garlic bread (which I would recommend because if life presents you with an option like that you shouldn't let your fear of talking to people get in the way of making that happen). The people working there were all very nice, helpful and speedy, my sandwich was ready in no time at all. My amateur photography skills don't quite capture its glory but it was delicious and I highly recommend checking this place out"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieWQyc2dnRRAB",
            "text": "This is my third time ordering from carmenta's and this I'd the worst thing I've  order. I was craving a caesar salad and was in the area, so I decided to try one at carmenta's. I was skeptical about the price being $14 and asked about the size I went against my better judgment and bought the salad. It was done in under 5 minutes and the bag felt extremely light but decided to be optimistic. When I reached home and opened the box the lettuce was not properly cleaned or chopped and when I tasted the croutons it taste burnt. The only \"saving grace\" was the dressing. Def no love in this salad..long story short do not be like me and buy this overpriced excuse of a salad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcTU2WC13RRAB",
            "text": "Was craving pasta and Carmenta's came up in my Google search! Gave it a try and I'm so glad I did! I got the rigatoni in vodka sauce with chicken!! It definitely satisfied my craving! It was the best pasta I have had in such a LONG time!! Definitely a place to go back for Italian specialty dishes!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaeGR5T05nEAE",
            "text": "Ordered food from here and we both had awful sandwiches. Mine had “roasted red pepper” that had the skin on it still filled with seeds (see photos). My husbands sandwich was so saturated in grease and oil it was inedible. By the time it made it to us the entire wrapper was drenched. We both agree it was the worst sandwich we’ve ever had and I am shocked because the reviews are so high here. It wasn’t cheap either…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMd3RqeThBRRAB",
            "text": "Best pasta I’ve had in nyc. Also some of the most affordable! Counter service, seems to be a big focus on takeaway, but also a few small tables inside. I think my dish was $17. I don’t know for sure if the pasta noodles were homemade (didn’t ask) but it sure tasted like it. I asked for a recommendation, the employee said the rigatoni was the most popular (also recommended his personal favorite the penne with chicken). My sister got the penne with meat sauce which we also adored"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcV9XSVVREAE",
            "text": "Go to spot for quality pasta and sandwiches. The Italian sub here is my favorite in Brooklyn. Good ratio of meat and cheese bread and not dry. All the pasta we have tried taste fresh with good portion sizes, and the pesto pasta here is particularly great. They also have daily sandwich and pasta specials (such as the rigatoni pictured) which are delicious. There are few tables and chairs to eat inside, but the takeout quality here is still great and consistent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcXZ2ZEZREAE",
            "text": "absolutely insane chicken ricotta pesto sandwich and was. Everything made fresh. Can’t wait to return here for some of their pasta, the vodka sauce looked amazing"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDNTVmOGd3RRAB",
            "text": "Really nice little Italian restaurant where all the pasta and the ingredients are made from scratch. Most of their entrees are special that look and do taste pretty good. They seem to be authentic italian food and definitely would recommend it to anyone who enjoys italian food. I had the braised lamb and pork pasta."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5aWRxRnl3RRAB",
            "text": "One of the best Italian spots in Brooklyn!!! My dad & I come every single time we are in the area. We both order pasta dishes and Caesar salads, which are the best we've ever had. The owner & the staff are always so kind & the food is delicious!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxd2RTYWx3RRAB",
            "text": "my sister and I ordered a chicken parm on garlic bread for $2 extra each, and it took maybe 15 minutes. we ate there and it was piping hot and delicious. they absolutely don’t skimp on the garlic and the fresh whole basil was refreshing in each bite. definitely recommend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOXVYT193RRAB",
            "text": "A real gem in Bushwick. I hate I didn’t come here sooner. The chicken parmigiana sandwich is done to perfection, saucy but still crispy when dine in. Woah. The PAPPARDELLE is bomb, flavorful. Great for sharing too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNnMteEdREAE",
            "text": "Italian deli located on the corner of Starr and Wilson creates elevated sandwiches and pasta staples. The style and preparation of the sandwich though.. reminded me of Harry and Ida’s before they closed in the east village. Very high quality ingredients, attention to detail like the ricotta and pesto. Fantastic bread. A must try! 🥪🇮🇹"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzdXJyNnJBRRAB",
            "text": "Great Italian spot in the hood. Sandwich was great my bf is 100% Italian and he loved it! The rice balls is crunchy outside and soft inside. I love the pasta and the Raku sauce. 5 stars from us! Definitely come back!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDdk9IVTBnRRAB",
            "text": "Great handmade pasta, made right here in Bushwick! Also some delicious sandwiches made with fine ingredients and love. They also have the best in-house delivery crew, so tip well to get your food hot and fresh! Order via ChowNow so you won't get hit with extra delivery fees from grubhub or seamless."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVNktmU1VBEAE",
            "text": "Meatball parm is amazing, personal favorite. Italian combo and the turkey are my second go-to's. I havent tried all the pastas yet but impressed by the ones I have.\n\nRigatoni vodka sauce and the Mafalde with Pork Bolognese have to be the most popular pastas right now.\n\nMenu changes with the seasons and specials are updated and rotated constantly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKM1BhTDlRRRAB",
            "text": "Best pasta in bushwick, delicious texture, I LOVE IT. Slightly pricey but worth every bite. My favorite pasta 🍝 here is the pappardelle and oh, their lemon 🍋 yard is also one of the most delicious I’ve ever tried. 💯 recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdE5TenVBRRAB",
            "text": "Seriously insanely good! This was my first time here and I plan on coming back to try every single sandwich on the menu! Really cool space, great service. I definitely recommend ordering ahead, there was quite a wait when I went!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMN2RtT3FnRRAB",
            "text": "Amazing food, nice service and came out quickly. Forgot to take a picture of the other half of the sandwich because it was that good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtanNtTkdREAE",
            "text": "The rigatoni is DELICIOUS! I don’t like the smoky pork flavors of bacon but the pancetta and guanchale aren’t smoked so I took a chance and this pasta wasn’t smoky at all! It just tastes like tomato sauce with cheese and umami. This was the best pasta I’ve ever had!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdFl5Y1pnEAE",
            "text": "This place is decent but not great. For an $18 sandwich I expected it to be amazing but it was just ok. Ingredients are fresh but there is very little room for customization, the staff weren’t super friendly and it was overall just mediocre for the price."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvOTYtUEVnEAE",
            "text": "Such a good Bushwick gem. A little on the pricy side but definitely worth it because you’re getting super fresh ingredients. The staff seems really nice and the atmosphere makes for a good spot to come solo or with friends. We ordered sandwiches and added sweet peppers, but the pasta also looks incredible. Casual but still special."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMzRUSW1nRRAB",
            "text": "The Rigatoni was incredible! Just the right kick of spice and pasta cooked perfect!! The lunch specials come with a can of Budweiser as well!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdTd1am13RRAB",
            "text": "You’re messing up if you haven’t eaten here yet. Tried 3 of the specials, and now I feel special."
        }
    ],
    "reviews_count": 77
}