{
    "name": "Taqueria Al Pastor",
    "place_id": "ChIJVxxLjhhdwokRljQPK_XWGzw",
    "grid": "BK4",
    "address": "128 Wyckoff Ave, Brooklyn, NY 11237, USA",
    "rating": 4.5,
    "user_ratings_total": 812,
    "phone_number": "(718) 269-7538",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSM1p5MDNNV2xTVW5aeFdIbGllREY2WWxST2VVRRAB",
            "text": "their tacos are so good, i think they have healing powers"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200d1RqaHJTMVZPWjNkQ2NUaHZORVZ3VGxsc2JYYxAB",
            "text": "No words needed. If you love Mexican food, go here. The world's best quesadillas and burritos await you."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTFJWQlJXbG81YTFaaFlXVndhV2d6YkVoT1dsRRAB",
            "text": "Jamaica water tasted like dish soap, this place went from 14$ a burrito to 17$  in one year and the burrito became smaller than before, this place is not what it used to be\nNever coming back"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabGN6ZGZkWHBTTkZvNGVrSnBOMnhFYWpkTlozYxAB",
            "text": "Cute place, kind service by lovely people, incredible al pastor. If you live in the neighborhood, lucky you. If you don’t, make the trip! Next time I’ll try happy hour!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNk1EZFFOVzEwYVVWaGFGSTNlWEJYVFc1NVRFRRAB",
            "text": "Excellent tacos, fast and friendly service, good prices. What more could you ask for in a neighborhood taco joint? I had the carne asada and al pastor tacos. Both were excellent. Perfect for a quick bite. I liked that they cooked the pork for the al pastor tacos on a rotating vertical spit!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MWRqTk9aMUptTXkxdk4xRjRUVTFETWpoVVFtYxAB",
            "text": "Good but wish the rice wasn’t sticky and watery…"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRE9VZHJUVzAzUmtWaE4xY3RialZLVlhCTVVXYxAB",
            "text": "Taqueria Al Pastor delivers a dining experience that balances authentic Mexican flavors with quality execution. On my visit, I tried the Carne Asada Burrito, an Al Pastor Taco, a Carne Asada Tostada, and a Horchata.\n\nThe Carne Asada Burrito was hearty and flavorful, with tender grilled beef marinated in citrus, garlic, and spices a classic northern Mexican preparation known as carne asada, or “grilled meat.” Wrapped in a warm flour tortilla with rice, beans, pico de gallo, and guacamole, it delivered both comfort and balance in every bite.\n\nThe Al Pastor Taco stood out as a true highlight. Al pastor, which means “shepherd style,” blends Mexico’s street food culture with Lebanese influence, using spit roasted pork marinated in achiote, chilies, and pineapple. Served on a soft tortilla with onion, cilantro, and chunks of sweet pineapple, it was vibrant and layered, the sweetness of the fruit perfectly cutting through the rich spice of the meat.\n\nThe Carne Asada Tostada brought another dimension to the beef, served on a crisp fried corn tortilla topped with beans, salsa, onions, and a creamy avocado sauce. The interplay of textures crunchy, creamy, smoky showed how Mexican cuisine thrives on contrast and freshness.\n\nTo pair it all, the Horchata was smooth, cool, and lightly spiced with cinnamon and vanilla. This rice-based drink, a staple in Mexican dining, balanced the bold flavors of the food and provided a refreshing finish to the meal.\n\nPricing is higher than your average taquería, but that’s reflective of the neighborhood and in this case, the flavors, portions, and quality make it worth it. Service was warm, attentive, and made the experience even more enjoyable.\n\nTaqueria Al Pastor serves a slice of culinary history with every dish. From the smoky carne asada to the sweet-savory al pastor, it’s a spot that celebrates tradition with flavor that justifies the cost."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVmJGSXlNMGxOTVZKQ1RuSnRTVTlxWmtSZllXYxAB",
            "text": "Buenísimo! The food was amazing, tasted very genuine and fresh. The volcan was THE BEST, the manager was great with us too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWk5qbGZVMlZDVEZGTk4yeHpNMlJOU2toQ2RVRRAB",
            "text": "yummy yummy nopal"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NFJEWTVPSEJ0V0ZCb2NtRllTRko0Y1dsVFkzYxAB",
            "text": "This is my absolute FAVORITE place in Bushwick for Tacos and Burritos.  I've been coming here for years!!!!  I will continue to for now, however, I just post this as a WARNING to ALL and to shame them for their disgraceful behavior.  If you go there and are getting a to go order and you don't tip them, they automatically put the tip on your card.  They are SHADY.  So if you don't pay attention and catch it, they've thrown 20+ percent tip on your bill.\nI do tip there on occasion, however, it's usually in cash in there multiple TIP Jars, but when I literally go in there, on my way home after now drinking for one chicken taco, I don't  always leave them a tip. I prefer to leave the tip in cash and not on my card.  WOW I wonder how many times they've scammed and robbed me without me knowing on my card and I've still left them cash.  So now, they've gotten a card and cash tip.  SCAMMERS!\nGood thing for me I was paying attention, but the sad thing is is so many people are going in there after being out drinking late at night and aren't paying attention and they're being robbed. Yes, robbed by this establishment and these shady cashiers.  Is the management aware of this? Does the management know that these cashiers are ripping off their loyal customers?!  They oughta be ashamed of themselves and it's disgraceful that they're doing this. I actually witnessed them do it to a guy last week and he got upset and made the manager takeoff the tip, but I thought it might've been his error until it happened to me tonight.  So now going forward, I will be damned if they ever get a tip from me again they'll be lucky if I even go back in there.  It saddens me because  I've been a patron of them for years and it's a shame if I don't go back."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWVJXUmpZbDkxU0dsaGVFTkZNWFJVWHkxR1ZtYxAB",
            "text": "I really like this spot but the price is increased significantly over the last year or so. $18 dollars for a steak burrito is not competitive to the other options around."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213eFoyRmpNRU5hYjNGMlVYbGFhR0l5TVRWdFNuYxAB",
            "text": "Good tacos, fast and tasty."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OcVpucHRlVTR6WVRaWFlsUkZXRTlMVVVoVk1FRRAB",
            "text": "Delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOa1dVa3dOVVJ4VTA4NVZrOWliRWt4WWxGd2FYYxAB",
            "text": "Amazing food !!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKeGRGRlpVVzh6UW5wTFlWbEdkV05QWVVGbVJuYxAB",
            "text": "Pricey! But hit the spot. Carne asada was juicy and deliciously garlicky, with a generous scoop of guac on top. The real star was the gringas al pastor — I have had the taco Al pastor before and like it okay but the cheese takes it over the top. Super unctuous, perfect bite. Next time I’d just get the gringa, very filling"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUWRtYzVNVEpxU0hKQ2JtNUlkSFZ3Vm5WblRGRRAB",
            "text": "Very good tacos. The rice and beans even I received the wrong beans it was still good."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUFRrbDVSV2REYjJKUVJXTmFaMlV6VFVOUWNrRRAB",
            "text": "Perfecto"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcVRIUjVUbWhrY0Y4MVpFYzVObWhSWTNaa2JFRRAB",
            "text": "Food is amazing but they don’t follow customers instructions, second time ordering a no beans no rice burrito and they seems to don’t care!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNFozRXRSazgzZW1GNmIxVTFUR1JLWlY5RVFYYxAB",
            "text": "had the pastor tacos -- it was pretty good and not lacking in amount of meat, but it is pricey at $5 per taco. Not bad, but I think you might be able to find others equally good at a lower price"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQmN6ZEdjM0pGTTI5emRISlZkekJCTm5keExVRRAB",
            "text": "Solid"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4S1ZHeFdPR2RRYVhCM1lscFpSWEIzYm1wblJWRRAB",
            "text": "Good burritos !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQ1ZXSTNTVnBtU0hwNGRub3hPREZtVEc1a1EyYxAB",
            "text": "The best taqueria around! The food is always delicious, and the service is great. I called them to mention a missing item from a pick-up order, and they took down my address and delivered it to me with some extra guac and chips!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNE5IRjJjREZHU0Voc1RIZzFZV2xNTW5GVldGRRAB",
            "text": "Fast and fresh. One of my favs in BK"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdmFIZG5lVFpMTW05TlN6WmFXRVZLYW5GRFluYxAB",
            "text": "Delicioso, 100% recomendado, muy buenas atenciones."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMU9UVlVUbWRoV0VacGQzaHlValowVjAxVlNHYxAB",
            "text": "Picked up myself to eat at home 7 minutes later. Tortillas were cold. Really wanted to like it but can’t get over the food and tortilla being cold. One of the taco’s tortillas broke while trying to eat it.\n\nServers were nice but need to have the taco together and hot/fresh."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVWNGQnhYMU40ZUZSeWFVZG1Ta2xTVGs5amFGRRAB",
            "text": "They give you a lot of meat here — and it’s seriously delicious! Everything was juicy, flavorful, and cooked just right. If you're a meat lover, this place is a must-visit. Great value for the price too!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVFdsUmpjR290VVhCeU5EYzFiVVk0ZGxZMGNVRRAB",
            "text": "Amazing tacos, service was excellent, thank you to the chef for encouraging me to try new things in my first taqueria in US and outside :) the metal and Mexican music was iconic. Thanks again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcVpTMHhZVGgzY0MxaU5sODVkSEZyV0RONE9GRRAB",
            "text": "An incredibly racist experience at this place. I ordered a steak quesadilla to go, even tipping on top of the already pretty steep price. She asked if I wanted everything on it and I said yes.\n\nHadn’t been in over a year so I wasn’t familiar with the topping system where you communicate with the maker about your toppings. He calls out to ask who ordered the steak quesadilla and I come up. He starts talking to the white woman who is waiting  behind/near me, and I’m a bit confused wondering if this was her order even though I saw she came in after me, and this was my exact order.\n\nMy confusion was quickly dispelled because it turns out the employee was simply racist. I told him that the steak quesadilla was mine and that I wanted everything. “Steak quesadilla?” Yes. “You didn’t order chicken?” No. “Not chicken, steak quesadilla?” Sir, I am telling you exactly what I ordered. “You didn’t order the chicken?”\n\nI kid you not he asked me 6 times if the quesadilla I (over)paid for was mine. He then proceeded to *call over* to the cashier to confirm with her whether this was my order.\n\nEven the white woman looked embarrassed at the entire exchange! It was evident that he thought I was either completely lying about it being mine and stealing someone’s food or had sneakily paid for chicken and tried to swap for steak. Either way it was incredibly racist and I can not believe an employee would approach a customer like that.\n\nI will never return to this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdFZURnRUMk5ZTlhka01VWkRMWFpDYkhWUFltYxAB",
            "text": "The carne asada tacos, wow 🤩 the salsa amazing."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sYWJGaEVNbW8yWWtadU1IVkNUM0ZLZWtsalgzYxAB",
            "text": "Me esperaba más 😞🤮"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poS2NYVkxkVmMxYzFWaVZUQkphVEZRWTJaeldVRRAB",
            "text": "Coming from a Family where we have been 50 years plus in the food industry tacos al pastor are the best"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VmVGSlNjSFp3YjFoU1p6Sm9iVkpPYVhwU1NuYxAB",
            "text": "Solid burrito! Al pastor bomb with a pineapple salsa they put inside"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VllUaE1aRmxhU21jMVprZFNWa0l3YlU5QmVYYxAB",
            "text": "Great tacos. Some of the best I've had in Brooklyn. Will definitely return regularly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQ1IyWmtRVFZLUVRka01WZHVkbWR2VURSR1gyYxAB",
            "text": "So so so so good. I just wish the prices were a bit cheaper"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWk1VSnFhV05XWmtoMVZIaHFRalIxWWpkdllrRRAB",
            "text": "The food's great the service is good the people outside the hipsters they make it hard for you to enjoy food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQ1lWVnNTRlZpT0ZCSmJVRmlTVEUxYlZVMmIwRRAB",
            "text": "Really really happy with the chicken burrito. The chicken had some char on it that added a lot for me. I grabbed mine to-go, but there was some open seating looking out a window, and a few seats outside. Solid lunch spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKQ3d4WURldi11cmxBRRAB",
            "text": "First it’s too expensive for a taco $5 bucks for one you could get a big meal somewhere else for the price of 3 and it’s not filling, not worth it imo\nFood is decent"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOVGRxZDNBOXVuelZnEAE",
            "text": "Excelente lugar!!!! Los mejores tacos NY..😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VNN0s4dEdXanJ5X1RnEAE",
            "text": "Tacos al pastor had a strange organ-y flavor and were severely underseasoned.  Horchata was sickeningly sweet. Vibes pretty fun and staff was nice though."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYnQ0YW1jOTRTd193RRAB",
            "text": "I dream about the Volcan Al Pastor more often than I’d like to admit"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMak9fN3JDdF95WHV3RRAB",
            "text": "Excellent and sensational tacos. I got the chicken, steak, and fish and they were all perfect. Great atmosphere as well, and lots of thought put into their interior design."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZLW9mMTBBRRAB",
            "text": "Food was great and super nice, casual spot! Carlos made some great margaritas!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMHU2REhREAE",
            "text": "Good"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMU03UVhnEAE",
            "text": "Une excellente cuisine mexicaine: tacos, Quesadillas, burritos,  un service très sympa et authentique. Des prix raisonnables pour New York. Une adresse à ne pas rater dans le quartier de Bushwick."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcU9qaUNnEAE",
            "text": "Muy mal, yo no recomiendo el lugar,\nAdemas de tener un precio muy elevado,\nHay mejores lugares, con un mejor sazon y un precio mas razonable,\nNo ponen servilleta en las entregas a domicilio, una sola tortilla pequeña  que incluso se rompe...\nMuy pesimo y desepsionante,\nNo recomiendo el lugar"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveGVTelFBEAE",
            "text": "Good food, good service"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNWFHSWpRRRAB",
            "text": "Son muy ricos pero casi no tienen nada de carne y los tacos deben llevar doble tortilla el cual es excesivo el precio 6 usd un taco para solo una tortilla y nada de carne en teoria son super pequeños"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva2E2UFB3EAE",
            "text": "The worst delivery food I've ever had. The food was damaged n they forgot the drink."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdDd5eXFBRRAB",
            "text": "Tacos were cold with super small amounts of ingredients. No utensils were provided and no sauce on the side."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaTVlRWtBRRAB",
            "text": "No place to wash hands after eating tacos, might as well just try taco trucks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNILXJyMnh3RRAB",
            "text": "Best tacos Al pastor in Bushwick, but TRY THE VOLCAN!! Crispy shell with fresh fried cheese filled with toppings 🤤👌 The people here are very kind and master's of their craft. Conveniently located just outside the L station at the corner of Stanhope and Wycoff. Been here several times already and plan on coming back many more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaG9tR2ZnEAE",
            "text": "Best darn taco ive ever had.\nI got two and went back for another.\nFor only $5 each these are incredible.\n\nI recommend the chickens tacos no onions ;)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaN0p5R0p3EAE",
            "text": "One of the best authentic al pastor tacos in NYC which tastes super similar to the tacos I've had in Mexico. The pork is flavorful and well cooked and the tortillas are supple and tasty - they literally make it from scratch behind the counter. Horchata is good but super sweet. Also very well priced - highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cmZlUlB3EAE",
            "text": "On the better side of tacos in the area, tortillas and made fresh and are delicious. Only reason for the 4 stars is that the food was underseasoned. Will some again!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxZ0tfUnd3RRAB",
            "text": "The experience with the Quesadilla Al Pastor left much to be desired as it was perceived as dry and lacking in flavor, falling short of expectations, especially considering its $17 price point. The noticeable absence of sufficient cheese further detracted from the overall appeal of the dish. The seemingly overpowering spice used in this particular dish prompted an uncomfortable sensation, causing breathing difficulty, intense heartburn, and an unpleasant lingering spiciness within the chest region.\n\nConversely, the Torta, while not exceptional, fared better, offering a more satisfactory dining experience compared to the quesadilla. It managed to garner a moderate level of approval.\n\nThe Burrito, priced at $18, delivered an experience classified as \"MID,\" implying it possessed an average, somewhat typical taste profile associated with burritos. Despite being palatable, there was a longing for a more pronounced and invigorating spice element to elevate its flavor profile, which was unfortunately lacking.\n\nIn summary, while the Torta garnered a moderate level of approval, the Quesadilla Al Pastor's dryness, lack of cheese, and overpowering spice levels detracted significantly from its appeal and value. Similarly, the Burrito, although acceptable, didn't fully satisfy expectations, particularly considering its pricing.\nThe Horchata stood out as a highlight of the dining experience, offering a notably enjoyable taste. Its commendable flavor and quality added a positive note to the overall meal, showcasing a pleasing and satisfying aspect amidst other mixed impressions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dnJYSl9nRRAB",
            "text": "The steak is among the best in they city for tacos, the namesake al pastor I thought was a little bland but the chicken was low key excellent as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdk1HWURnEAE",
            "text": "Great taco place! This is 100% authentic tacos. They have a lady making the tortillas by hand. The meat's are well seasoned with all the fixings and salsa. The only bad thing is the pricing. 1 taco 🌮 is $5 each."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdU5DVDJBRRAB",
            "text": "very good al pastor tacos. personally, I think they are on the pricier side in this neighborhood, but you get what you pay for. The horchata was far too sweet though."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0eTU3QWpBRRAB",
            "text": "Awesome awesome tacos. Loved the pastor the most. Cactus tacos, never had them before, they were delicious too!! Very cool place. Definitely give it a try if you're in the area. Parking is easy to find nearby."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucEpiSGJ3EAE",
            "text": "Me gusta el lugar , aunque admito que antes era más rico . Aún así siempre he sido cliente de ellos ,pero creo que deberían tener más cuidado con sus preparaciones, me salió un pedazo de plástico en mi burrito . Por cierto si uno paga una orden , mínimo espero que me den salsas sin estar pidiendo y estar pendiente si las pusieron . Me ha pasado muchas veces que llego a casa y no tiene salsa , entonces para mí no es bueno comer sin ellas ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbmNyZEVBEAE",
            "text": "Best Tacos in Brooklyn! They make yellow corn tortilla right as you order. Soft and delicious tortillas! The meats are also freshly prepared and marinated every day (according to the Taquero!). Basic and simple as a real taco should be! I only ordered 2 because I just wanted to taste them but I ended up ordering 3 more because they are so delicious! I have tasted a lot of tacos all over NY; these are definitely the best I have tasted so far."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdXVXZVZnEAE",
            "text": "Best pastor tacos I've had in NYC hands down. Standing room only with some outdoor seats. Great counter service and unparalleled rotisserie."
        },
        {
            "date": "수정일: 5년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzeXZ2TmZBEAE",
            "text": "Mal , me toco mala suerte o que ???.\nRealmente se merecen 3 , pero espero que mejoren.\nEl arroz de mi burrito estaba super batido , no se distinguía, parecía una masa…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLcl83Q2xRRRAB",
            "text": "I ordered 2 tacos, pastor&chicken with everything, and both really spicy! Also overpriced, you can find better tacos in the area. I came here because a friend recommended it. My husband really enjoyed the burrito."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuN0piVmJREAE",
            "text": "The flavor of the meat seems good to me, but the portions are too small for the price they give. I looked at all those comments on tiktok, but it seems to me that the portion is terrible, and they don't give you sauce or napkins."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodDZTLTRRRRAB",
            "text": "This place definitely deserves a spot in the upper echelons of NYC taco joints. No frills space but they definitely deliver on the food! Served in homemade yellow corn tortillas all the meat fillings were tender and packed with flavor. They don’t have as many options as some other taco places but you can’t go wrong with their namesake Al pastor or the carne asada. I’ll be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ZzVxX3pnRRAB",
            "text": "My favorite taco place for an after bar or after work meal. My go-to order is Gringa de Pollo and it is perfect every single time. They cook the meat extremely tender and flavorful. Besides their Burritos and tacos are also very solid and delicious. All the ingredients and Guac feel very fresh all the time. Their service is fast and friendly and can be relied on 100%."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhOVpTV3VRRRAB",
            "text": "Best Tacos & Burittos i have tried in Nyc or Brooklyn. Meat is perfection. Service is friendly and so nice. Fast even for NY standards. Discovered them totally accidentaly as i exited train station of L train. And came back so far 5x and many more :)\n\nHINT: after 10:00pm tacos are 3$ each. Same size as 4.50$ during a day\n\nTake carne asada or al pastor (marinated pork)\n\nEnjoy 🤤🤤🤤"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbE1XZWJREAE",
            "text": "Really delicious tacos. The al pastor tacos with pineapple are heavenly and grilled chicken was perfectly cooked as well. Cactus (not pictured) was a lil too soft for my taste but great vegetarian option. I always appreciate when there are fewer options as you know the chefs then make it extraordinary. Saw them cooking fresh chicken while we were there. The staff were also very friendly and nice.\n\nThere are some tables to sit outside and in their little tented area. Didn’t have to wait on a Sunday afternoon.\n\nOverall 10/10"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbDRxbm13RRAB",
            "text": "This is the best Al Pastor I have ever had. The meat is extremely juicy, flavorful, and tender. I had to turn to my friend and tell him how amazing this food was after every bite I took. The pork gets perfectly juicy and crisp on the giant spit that they roast the pork on. The Volcan is particularly delicious, with the crispy tostada on the bottom, melty cheese, and incredibly flavorful Al Pastor meat and pineapples. I haven't tried most things on the menu but I'm sure you can't go wrong as long as you're getting the Al Pastor meat. This spot is extremely small and underrated. It is very fairly priced, and they load up the meat on the dishes. I'm extremely impressed with the quality of ingredients they use here, everything tastes fresh and extremely flavorful. They also have a great, cute outdoor setup with a roof covering for eating a quick bite. The service was very quick and the staff are nice. I highly recommend this amazing spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcnBfcm1BRRAB",
            "text": "Love the horchata and the al pastor is fresh and flavorful 🤤"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzaEpINl93RRAB",
            "text": "The best tacos al pastor in NYC. Go and try it! The salsas are amazing!! It's a little piece of Mexico in Brooklyn! 🥰…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaTVMclJ3EAE",
            "text": "Friendly service the tacos Al pastor are flavorful and the tortillas are handmade will definitely be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHal8tR3hBRRAB",
            "text": "I just paid $24 on my card and tipped $3 for 3 tacos a small side of beans and side of watery “guacamole.” BEWARE OF THE $4 guacamole all I got was a tiny drizzle on top of my tacos (pictured). Carne asada at the counter menu says $4.50, but actually is $4.75. I feel ripped off >:-/"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMHJDOER3EAE",
            "text": "This is the best taco I have ever had!\nI found it to be pricey, the item here is $6. I am used to Tacos going for half of this price but it was absolutely delicious. I think to be full you need about…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzN0xUOVRREAE",
            "text": "Stumbled into this new spot in the neighborhood and WOW! The tacos here melt in your mouth with a blast of flavor and spice. Don’t think twice and come here!…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlc3EtUUxBEAE",
            "text": "I have high expectations for al pastor as someone coming from the west coast. These were solid. Although a little pricey, everything tasted fresh and delicious."
        }
    ],
    "reviews_count": 77
}