{
    "name": "Sobre Masa",
    "place_id": "ChIJmeKSwPFdwokRZ--71Rq0GBY",
    "grid": "BK4",
    "address": "52 Harrison Pl, Brooklyn, NY 11237, USA",
    "rating": 4.6,
    "user_ratings_total": 435,
    "phone_number": "(347) 844-2343",
    "reviews": [
        {
            "date": "3시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRlEyMXpXSFpqWkU5NmFrWnhWRVo2ZW0wNGNFRRAB",
            "text": "Sobre Masa is an upscale Mexican restaurant known for its modern take on traditional flavors. The dishes are artfully presented and made with high-quality ingredients, offering a refined yet authentic dining experience."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNlRqQmhVVXBDVTFvNVVFeG9aSHBPVjNaNGFXYxAB",
            "text": "Terrible experience. I went to leave and bartender said wait don't go stay 5 minutes I'll play your favorite song. I told him my favorite song that was meaningful to me and he mocked me to the other patrons saying that he wants to slit his wrists to it while holding up a knife. So deeply disrespectful and visually violent.  Wrecked what would have been a decent experience. If I wanted to talk to a clown I would have went to the circus."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTVZHd3lRVXAyUzFkWFRFODFSVkZQYVRJMVRuYxAB",
            "text": "Fantastic food. High level cuisine. Food in Bushwick is incredible."
        },
        {
            "date": "수정일: 6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NThpc0hBEAE",
            "text": "Wow! Banging. Seriously. Bushwick food is just killer, generally. This is Michelin-level food. The attention to detail and obsession for ingredients is so elevated."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4clpEUjBiVzEyVkdNdFlqVndWMmxDUW5WdGVuYxAB",
            "text": "Very authentic inventive Mexican cuisine.  Enjoyed the experience.  Sat at the bar since we didn’t have a reservation but still had a great dinner.  Not cheap, however"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRE9UTmFWMHRMTTFZdFEzQnJiMUJ5VEd3emRWRRAB",
            "text": "Agreed with others. Service at these prices could be better. Brocolini mole was tasty, but olives were a strange choice? Really deep flavor from the almond mole. The lamb Barbacoa was phenomenal. Rich fatty, spiced lamb belly that just falls apart on an in house tortilla. Gosh, so tasty. Almost wished I didnt have to share it. I could demolish a single bowl myself, but could use a bit more pickles to cut the fat. The flan was a showstopper. I swear there is a fermented dairy product in there somewhere, but was told there wasnt. Crazy."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVk5GbExORlIzWlc1TlRDMUtTWGxXWVhaUVZHYxAB",
            "text": "Coming from  New Mexico, thought I had eaten the best Mexican. Not so. Sobre Mesa was absolutely outstanding.  From the first small plate to dessert. Service was also impeccable, warm, and guiding. Highly recommend."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saU9YcDVjbEJtVUhWV1kyZHZjVEUxZWxscmRGRRAB",
            "text": "This place is awesome. I'm not sure where else in New York you can get this kind of bang for your buck, especially when it comes to Mexican food. We basically asked them to pick dishes for us based on how hungry we were, kept the cocktails flowing, and had an amazing time. Bonus points for the nostalgic Latin pop they were playing all night. Just go!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sU2NWbENXRmxmWlZCYVJUUm5VMkpWZVhGVVdIYxAB",
            "text": "Let’s be honest, Mexican food in the USA, and especially “contemporary” Mexican food in the USA, sacrifices its culinary soul in an effort to pander to the weak and undeveloped palate of a clientele raised on a soulless corporate culinary diet. Contemporary Mexican, in the USA, has no similitude with contemporary Mexican in Mexico. Places such as Maximo Bistro, Pujol, and Quintonil celebrate their culinary heritage and elevate it into an extraordinary experience that can bring you to tears of joy. The only thing that contemporary Mexican food in the USA has in similitud is that it will also bring you to tears, but they will be tears of sadness. It is a dialing down of all of the extremes to fit into a narrow and limited palate so as not to take anyone out of their comfort zone. How can you truly experience the food of another culture if you aren’t taken out of your comfort zone?\n\nIn short, I was saddened by my visit to Sobremasa, not by a lack of basic quality but a lack of authenticity. By the blatant compromise of their culinary heritage. To its credit they do work hard to highlight quality corn. For which I’m very grateful. But they remove any and all spicy components. And yet chile is the foundation of so much of mexican cuisine. How can you make a mole that has no spice when the base of the dish includes at least three different kinds of chiles? Mexican restaurants should take a quick lesson from Indian restaurants that learned long ago how to provide spicy and less spicy options to their varied clientele.\n\nOverall, I’d say I’m simply an idiot with unrealistic expectations who should stop trying to find authentic Mexican food in NYC. Obviously as a business owner you have to know your clientele. And this city’s clientele want to feel open minded and cosmopolitan without having to step foot out of their comfort zone. They want to feel that New York is the center of the culinary world, which justifies their exorbitant rent. They never have to travel more than five minutes to eat “authentic” international food. And at the end of the night, they want to go home feeling the same as if they’d just polished of a burger and fries at Five Guys or devoured their favorite slice in a drunken stupor.\n\nFluke aguachile\nIt’s tasty with strong and pleasant maracuya flavors but it lacks any chile. Should really just be agua not aguachile. The fluke had nice texture but was cut too small to feel substantional and had little to no flavor\n\nMole almendrado\nThe broccolini is a bold choice but doesn’t necessarily pair well with the mole. Would likely pair better with a ripe fried plantain, but can’t be too traditional if you want to be contemporary. Too much lime on the top over powered the mole. The mole was not particularly strong but had balanced flavors. However it lacked any spiciness. How can you make mole (based on chiles) and it come out with no spice?\n\nLamb barbacoa\nPleasant flavor in the lamb. Cooked to be soft but extremely moist and flavorful. The tortillas are quality. However they accompany it with a “green salsa” that tastes like pure tomatillo and lime. Not an ounce of spice. I asked for spicy and they brought me salsa made with chile de árbol. Good flavor but only lightly spicy.\n\nMil hojas\nThe chunks of pineapple are nice but the overall dessert lacks any complexity. It’s sugar on sugar. An attempt to mix textures but comes off in a haphazard way that doesn’t challenge or excite the palate.\n\nTejuino\nSlightly salty and a bit thick. Very nice mocktail"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVWJHOU9MV0pmTkdFd1VIVjJjMGMzVVdSNVMzYxAB",
            "text": "Excellent good and fantastic ambiance. The main room is very cozy. I loved their salsas and that they have many interesting dishes on the menu."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMFRVZGZiSEJhTlZVMFlVOU1Wa3R1Wms1alRGRRAB",
            "text": "Incredible food and vibes! i loved the pork shank and also great drink options. Would totally come back here I would recommend this place. The only thing that I didn't feel very comfortable with was the bartender's attitude. He seemed annoyed and created a weird tense energy at the bar. He was rude to the costumers and staff. The other bartender and the rest of the staff were all really nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMVVHVlJRM0ZmTm5wWmMzVTRPVVF3VUhSQ09YYxAB",
            "text": "they put their own twist on the menu items - the selection of salsa is a great way to start. we shared menu items so we could try more items. We had the guacamole, the chicken polenta, the mole, barbacoa and arrachera. For dessert we shared Rika's chocolate cake. The server was attentive and helpful with ideas. We loved the ambience and the decor of the dining room. Definitely returning here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRGExOUdSREF0WkVwb1NYcHRlRFZKUzNwUFpWRRAB",
            "text": "Excellent excellent food. We would happily return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBdE5tcFVMVVp3ZVZGeE9GbGpRVFJpUmxCblpuYxAB",
            "text": "Great Mexican spot.\nTry the tuna tostada\nAnd get the salsas."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeGREbDNkVkJ3ZVhNNFRscFFSVUpKTm1oR09FRRAB",
            "text": "Ambiance is great and the staff are super kind and attentive. Portions are small but packed with flavor. The tune tostada was fresh and had a great combination of textures, and the flan was delectable. The gordita was tasty. Location wise, it is a little out of the way for me, but I would go again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeldHY3pWRVJwTFc1WmEwdG9PRFJpVjNjME0xRRAB",
            "text": "I want to give a special shoutout to the amazing staff who took care of my party and me—Alejandro, Sana, and Daniella. They were incredibly attentive and hospitable throughout the night. The food was absolutely delicious, as always, and their prix fixe menu is worth every penny. Thank you all for making it such a memorable evening. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWak5VeEdOblJXWmsxRmVrTkdWbXBvUkd0NFpWRRAB",
            "text": "The food was very delicious but the service needs work, in my opinion. The biggest 'ick' for me was that the person responsible for garnishing drinks (with limes, etc.) that bartender just finished preparing was grabbing it all with bare hands instead of special tweezers. And that is right after touching menus and clearing dirty plates of tables."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUGJXbDZjMDk0U1RWT1dGaDBiVVZIUlRWelZHYxAB",
            "text": "Food and cocktails are both delish! Servers are also very attentive and understanding of dietary restrictions and allergies."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwT1RtNUtURVpNYnpGdUxXdEdhVXhtWWxORWNtYxAB",
            "text": "rlly good! loved the fried cheese"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSFkyUkdjRlpVY25oVGRVOVBNalJEYjNOM2RYYxAB",
            "text": "Deserves all the recognition it can get for the elevated menu"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSV01YaEhiRXQxUmpOb1EzVTJlSGh0Y1VJMmFtYxAB",
            "text": "Outrageously good meal. Not a single dish I didn’t love, I will be back again and again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbVdFRXlla2hKV1ZZeFIzbExUMGw2V1ZCRGIzYxAB",
            "text": "Ate here last night with my friends and had an amazing time! The food is mind blowing, the drinks are tasty, and the atmosphere is really nice! The service is a pretty lack luster in personality but they are attentive. I’d highly recommend the pork shank and the chocolate cake!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxV1gwaFROV1IzVEdRMFdrSjNjREZtYlZoWmQyYxAB",
            "text": "Best tortillas and sauces!!!!\nThe food here is delicious\nThey have different types of mezcal that you need to try out!\nShout out to the bartender he do an amazing job and treat people like family!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMTEFxZFBzdDVTdkdnEAE",
            "text": "Great authentic Mexican food. Everything placed on our table was delicious. A lot of flavor in the salsas and food. Guacamole and chips were super tasty. I’d go back, a few more menu items I’d like to try."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJMzZnSmEzMnNyWVFnEAE",
            "text": "Total gem of a restaurant. The lamb belly barbacoa was flavorful and tender, the flan was excellent, and I loved that they had toum as one of the sauces. Every dish we got was honestly great. The grilled queso is also a must grab with some extra tortillas."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdGNDbVR3EAE",
            "text": "Amazing salsa flight and ceviche and strip steak were amazing. They supply corn tortillas to all the Michelin star restaurants in NYC. A hidden gem."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJN3ZnNlNrazVEQnNnRRAB",
            "text": "Great place, very high-quality Mexican food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOVGI1b0hxb3B6LW1RRRAB",
            "text": "Had a great time with my friend here. The pork was phenomenal, the drinks were tasty, I had the naked in bushwick drink. Will definitely go back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdmxycDJ3bk4zR3FnRRAB",
            "text": "Service and staff was amazing. Food the same! I can recommend it and liked the whole experience! Ceviche was amazing!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VONnR5bzZmajdqeEt3EAE",
            "text": "Mind blowing food, lovely staff, warm atmosphere. Best dining experience in a long long time. The polenta was one of my favs, so light and delicate. The carnitas were impressive looking on the bone and so generous almost two could share.  I never write restaurant reviews so that’s how good it was. Thank you we’ll definitely be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbUliUDJBRRAB",
            "text": "flan that will change your life, hurry become a new you now"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbDVHX19BRRAB",
            "text": "Very expensive for what you get. We started with guacamole and chips, which were excellent. Most of the plates are \"small plates,\" even if they carry big plate prices. One of us had baked shrimp in a cheese sauce, which was excellent. A second diner had a chicken cutlet, which was a thin, pounded breaded chicken breast. I had lamb barbicoa, which was very gamey and rather dry (for barbacoa). Dessert was a wonderful flan. We each had one cocktail and 2 sides of refined beans, which were 1/2 cup each. All told, the bill came to $240 and the dinner was really nothing special."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbmN2N1JBEAE",
            "text": "First and foremost, the food was totally out of this world. It was creative, uses of chicken, liver pate on a tostada, it was innovative, pork shank with fall off the bone, fat and meat. Everything they’re doing is creative and culinary and delicious. The vibe was fun, funky fresh, and the service was great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvemZfRE1REAE",
            "text": "This place is unreal! Food and drinks are both 👌"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbjhmZzBRRRAB",
            "text": "Overall rating: 4.6\nPrice: $61.38 per w/ tax & tip\n\nIt’s very rare for me to see fancy Mexican. So I was very excited to try this place. I got a reservation around 7, but it definitely isn’t needed & a walk-in is easily attainable. The restaurant is absolutely beautiful and reminds me of my time in Mexico City. This is a weird statement, but I’m obsessed with the bathroom. It’s so welcoming and warm and it smells lovely. Really good job.\n\nI came with a new friend so when I saw bar seats available I immediately took them vs going for a table. While the restaurant is rich in culture, around the corner of the bar was what felt like storage or trash. Since it’s a fancier place, they should consider hiding that in a closet or in the back versus next to a bar.\n\nWhat got me here is watching a TikTok talk about how & how long they make their corn tortillas. So when I learned happy hour is until 7pm & it includes a free steak taco, I was very excited. Unfortunately it was hard and not good. I can do simple items when the seasoning is there. But it wasn’t. Extremely disappointing. Should add an avocado crema or something.\n\nWe ended up only getting guacamole & the tuna tostado. The guacamole was big and a great portion. The tuna tostado was very tasty and a nice redemption. But I definitely want to come back & try other items before a fair review. Also just noting there was only one waiter and one bartender. The bartender additionally acted as a waiter and the waiter also acted as a hostess. It’s a big place, so was a bit surprised they didn’t have a 3rd person."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaVozdWh3RRAB",
            "text": "Place had a good atmosphere, nice for a date. Service was good too, but the food was just okay.\nFor the price point, I was expecting more depth in flavor. We shared a bunch of small plates: the tuna tostada, pollo with polenta, mole with broccolini and the shrimp. The tuna tostada was the winner, although a tad too salty for me. I don’t really understand seafood with cheese, but my wife enjoyed the shrimp. The rest was underwhelming. The pollo had absolutely no seasoning, we were really surprised since we were told it’s one of their top recommended dish. The tortillas tasted good, but texturally wrong as in tough to bend and chew. We were looking forward to the mole, but that too was disappointing.\nAll in all, I wouldn’t go back again which is a bummer since we like to support the local spots in our neighborhood. Sadly, this is yet another place that can get away with charging a monstrous amount for food that isn’t bad but nothing to rave about."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJLXNydDN3RRAB",
            "text": "Had an incredible meal here. Truly a gem in Bushwick. Our Server Dannie was very attentive and took such great care of us. Every dish we had was flavorful and unique. A  must visit. Thanks again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZ0x2YlB3EAE",
            "text": "I’ve been there more than ten times and it is fair to say some dishes are incredibly great and some are just okay. I love their salsa and carnitas tacos. Never felt disappointed with their cocktails."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbi0zR3FRRRAB",
            "text": "Authentic Mexican restaurant with very nice crafted dishes. Best tortillas in the city. Excellent food quality"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d0luRVJREAE",
            "text": "when food brings you unexpected happiness 😊 when it comes to Mexican food I am quite picky. Sobre Masa knocked it out of the park. So lucky 🍀 to have such amazing restaurants in our backyard. Highly recommend. Service was meh but the food was yeahhhh! 5 stars for food ⭐️⭐️⭐️⭐️⭐️\nWe ordered:\n• Guacamole & Chips + add on salsa flight 🥑\n• Fluke Aguachile Verde 💚\n• Tuna Tostada 🐟\n• Queso Asado 🫕\n• Pork Shank 🍖\nDrinks: non-alcoholic ginger 🫚 soda (don’t recommend - $8 for a very skinny glass with huge ice cubes ❌)\nPasión Comiteca (do recommend ✅)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OGZxVkNBEAE",
            "text": "Sobre Masa has so much fun with their dishes that they all exceed what I could’ve expected. My favorite fish of night was the Tuna Tostada, which perfectly hits that nostalgic tastes of Chilli Cheese Fritos blended with amazing fresh tuna. Followed strongly by the Shrimp Cazuela, this was simply incredible. For mains, both the Barbacoa and the Carnitas are great options. I loved this spot and would easily return if close to the area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3enJ2anZBRRAB",
            "text": "This place is the real deal"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURROWNxcGx3RRAB",
            "text": "Current residents of Bushwick should be overjoyed because Sobre Masa is yet another gem of an eatery in their neighborhood. My friend told me about this place over a year ago and he was raving about their amazing fish tacos. The memory of those fish tacos is what drove us to go check out Sobre Masa a few days ago.\n\nWhat we soon found out, was that the menu changes frequently and the fish tacos were no longer on it. This was only a slight bummer, because everything we did end up having was absolutely great! The highlights for me were their guacamole (and accompanying sauces), lamb belly barbacoa, and the passionfruit/carrot juice.\n\nThe guacamole was the most seasoned and flavorful guac I've ever had. No cap, no exaggeration. Some may find it on the salty side but it never crossed that line for me. The tortilla chips were perfect and strong. They won't fold under pressure and break when you go for that scoop of green goodness. A little toum, green salsa, and either red or orange sauce for some spicy kick on that chip is the way to go.\n\nIf the lamb belly is on the menu, it is a must try! Pro-tip: save some of the guac and sauced to have with your lamb belly tacos and get creative. The lamb belly is juicy, flavorful, and a perfect protein to go with their delicious tortillas.\n\nThe passionfruit juice is the base agua fresca for one of their alcoholic cocktails. While it may be a little pricy to some for juice, it was so refreshing, perfectly sweet, and I enjoyed ever last drop.\n\nThe restaurant just has a great vibe to it. Nice lighting, not loud or noisy, friendly staff, quick service. I was blown away and will absolutely be returning."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRZ3I3bUVBEAE",
            "text": "Muy rica Comida especial la de carnitas . Te Dan el hueso de cuche 😬…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNktmQ3lnRRAB",
            "text": "We had the Carnitas, Guac with salsas and chips, Gordita, and the mole with broccolini, cocktails and beer.\n\nWe felt the food was only OK. The flavors were good but not incredible, for the price point we expected better flavors and quality. Our favorite dish was the carnitas tacos, the tortillas were freshly made but were served lukewarm, and the carnitas were perfectly fatty and flavorful with the toppings. We were excited to try the fresh, home made chips but they were a bit stale, they may have been made earlier in the day or the day before. We were expecting piping hot out of the oven chips with a lot of crunch.\n\nThe restaurant could work on perfecting their flavors and improving the serving quality (increase the food temperature). The experience was short of our expectations but again the food was not bad, but it was only OK. Ambiance was good. Service was incredible - kind and warm, and attentive to our needs."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMzgyVHJ3RRAB",
            "text": "The food was amazing, staff was great and owner was very kind! Very cool atmosphere, will definitely be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbHNmRzJnRRAB",
            "text": "The chicharron gordita with blue corn was amazing, fresh ingredients and authentic Mexican food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc3JLMVhnEAE",
            "text": "Don't go there if you are hungry.\nAverage food, super small dishes (they are actually serving food on 4 inch plates), ridiculously high prices."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndUlpeTZRRRAB",
            "text": "Best meal I’ve had in two years. Being in the industry for 10+ years in incredible restaurants,  find it harder and harder to enjoy a meal. Server was excellent, attentive but with reservation. Food was perfectly seasoned, lots of acid and salt not afraid to pack flavor. The Salsas great. The warm tortillas reminded me of grabbing them with my abuelita in Mexico.\n\nFlan was delicious.\nFirst time enjoying one since being a kid.\n\nExcited to come back. Don’t walk. Run.\nSupport this incredible team."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaU9qNWh3RRAB",
            "text": "Tuna tostada and fried queso was great. The lamb and chicken tasted strongly of warmed over flavor and the portion sizes were very small which would have been a problem if they actually tasted good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2ekl6ZFpnEAE",
            "text": "A Hidden Gem of Mexican Cuisine in Brooklyn!\n\nAt first glance, you might be tempted to judge this restaurant by its exterior or the surrounding area – but don’t make that mistake! Once you step inside, you’re greeted by a warm and inviting interior. The décor is simple, yet filled with charming Mexican accents that set a promising tone for what’s to come.\n\nThe staff here is exceptionally friendly and attentive, making you feel genuinely welcome. It’s not just about great service; it’s an experience that makes you feel like you’ve been taken to Mexico.\n\nThe menu is thoughtfully curated – not overwhelming, but with enough variety to offer some truly unique dishes and creative combinations. Every dish I tried was absolutely delicious, and, without a doubt, among the best Mexican food I’ve ever had.\n\nAnd the best part? The prices are quite reasonable, especially considering the high quality of both, the food and service.\n\nIn summary, even if you have to travel a bit to get here, and even if the area doesn’t initially seem appealing, the exceptional food, outstanding service, and fantastic drinks make it all worthwhile. A huge thank you to the chef and his team!\n\nThis is a place you’ll want to return to, again and again.\nI wholeheartedly recommend Sobre Masa – give it a try, and I promise, it won’t be your last visit!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdE9EQ1ZnEAE",
            "text": "Stumbled across this place on a late Thursday night, but so glad I did. The food blew me away. Absolutely delicious, fresh, and authentic. The fluke ceviche was so good, the tacos went down easy, the seasoning on the shrimp was perfect, and the the steak was super tender and excellently cooked. Considering I'm not a huge fan of mole, the enchiladas were my least favorite, but still good enough to eat my half. If you really like mole, you'll love them. Bartender Lalo was great and easy to talk to. Will be coming back for sure."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcE8zQ3NBRRAB",
            "text": "As a 🇲🇽 Living in NY it's always a treat to try mexican places! We went for brunch on sunday (mi husband ordered the barbacoa) and i ordered the chilaquiles! the chilaquiles were so good!!!!! he said the barbacoa was good too! as a little note: they don't have hot coffee ☕️ but they have cold brew! the chilaquiles were missing some beans but they were very tasty! good amount of 🌶️ nothing crazy but full of flavor!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMbm8tckJBEAE",
            "text": "Tacos came out cold. Unseasoned mushrooms in the quesadilla - had to dump all the salsa on the food to give it any semblance of flavor. The tortillas are decent. The concept of using nongmo corn is great. Pretty overpriced for the flavor/whitewashed Mexican food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQOWM2d1hBEAE",
            "text": "The place has a casual feel to it. The service was outstanding. The food quality was great and everything was cooked perfectly. The empanada was pretty bland. The flan was incredible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENXRLejZnRRAB",
            "text": "What a find! My fav restaurant in NYC.  We sat at the bar where the service was impeccable and the cocktails on another planet. Tried 3 and all delicious . The food is absolutely on point - the shrimp and the lamb belly particularly good. Oh and amazing desserts are dymaite and the place has such a vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyOWVUNE9REAE",
            "text": "I had a fantastic experience at Sobre Masa! They truly go the extra mile by making their custom masa flour, which really sets their tortillas apart – they taste rustic, delicious, and homemade. The standout dish for me was the milpa salad. It was well-balanced and absolutely delicious. Thank you Sobre Masa!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMd09YcmhRRRAB",
            "text": "I saw a few YouTube videos about this place and as a lover of tortillas, I knew I had to come here. I was very excited to try some fresh corn tortillas. The food itself was good though I feel overpriced. We got an app of guac, cauliflower tacos, mushroom quesadilla, and coconut custard. The total was approximately $80. The service was good. My only gripe was that I prefer when the server offers something that they let us know that it's an extra cost which they didn't do. The atmosphere is nice albeit a bit dark and warm/humid. I think it was worth trying once."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKc09PQk1nEAE",
            "text": "Some of the best Mexican food I've had in New York. We made a reservation on short notice (Friday night) - there's a lot of seating. Service is very attentive and helpful!\n\nWe ordered the Milpa salad, Tacos de coliflor, Lamb barbacoa, Carnitas, and Tres leches for dessert. Everything was absolutely excellent - you can tell everyone pays great attention to detail. Our favorites were the Milpa salad and the Lamb barbacoa. Oh, and their corn tortillas are so, so good.\n\nWe also had a few of their inventive cocktails, including their Espresso martini - which may be my favorite in the city.\n\nAmbiance could elevated by simply removing some seating. I wouldn't say it feels intimate - but, you probably won't care because the food is so good!\n\nIt's worth the trip. I'll definitely be going again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3eWYzNlJREAE",
            "text": "Do yourself a favor and eat here before you will no longer be able to get a reservation.\n\nChef Zach, his wife and their crew have brought something very special to the States via Oaxaca. The tradition of hand made corn tortillas crafted from heirloom ancient corn strains imported from Mexico.\n\nI felt truly blessed to have had the opportunity to have one of the best meals of my life at Sobre Masa"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYM3Q3dnpnRRAB",
            "text": "This was definitely worth the walk from downtown Brooklyn to Bushwick!\n\nThe main thing I was excited to try were the tortillas. They are made entirely in house, from soaking and grinding dried corn, to pressing and cooking them. The care and dedication to craft shines at this restaurant.\n\nWe ordered the tacos al pastor, carnitas, frijoles, and chocolate cake with sal de gusano for dessert.\n\nEverything was beautifully seasoned, the frijoles had a great level of spice, everything else was mild, but the flavors were fantastic!\n\nThe sal de gusano offered a very smoky and bright flavor to an otherwise deeply rich and sweet dessert.\n\nThis is a place I would definitely recommend checking out if you're in the area!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MmFyT193RRAB",
            "text": "This is restaurant that offers small plates with incredible food and drinks. The quality of the ingredients was apparent. Food was so flavorful. If you’re going to have apps, entrees, and multiple drinks (which you must) definitely closer to $100 per person. Staff was friendly and provided excellent service. I highly recommend this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsb09iM19nRRAB",
            "text": "I loved loved loved this spot, and was so surprised. It’s tucked away on a side street in Bushwick and I half expected a usual latin spot, but you step through a gateway into a very modern Mexico. You leave Bushwick entirely with how beautifully its decorated with south western vibes. I love the warm, spacious atmosphere. Staff was equally as warm from the hostess to the bar tender to the wait staff I passed on my way inside.\n\n🍹🌮 Okay important stuff:\n\nYou must start with a soursop martini. One of the bartenders, Alejandro, calls it his love potion. It’s DELICIOUS. The guacamole and salsa sampler is also amazing - the garlic aioli is out of control good!!! We also enjoyed the camarones a la plancha (garlic shrimp) - sooo yummy. Pro tip: make sure you get the bread with it. The carnitas were falling apart in my mouth. And lastly the tres leches is yummy as well and big enough for 2 or 3 people. Soooooo happy and will be returning! 😋"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtN3BiSjFnRRAB",
            "text": "Food was great, really fresh. Flavors were overall really authentic, quality of ingredients is top notch, and everything was seasoned well. Drinks were good. Atmosphere is kind of strange— really industrial, like being in a concrete box. I was wearing sneakers and kept sliding on the floor, which was bizarre. Food is worth the trip. Service is excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1czhyZW1RRRAB",
            "text": "Great experience for their chef Quan Ngo collaboration! The food was amazing, their staff, the bartender and the drinks and fantastic! Also don’t miss a chance to take some of their house made tortillas to go."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtLUtTZExnEAE",
            "text": "A great hybrid of authentic and “new”. Also proves that you don’t need a long, crazy menu to impress. The Al pastor tacos are definitely my favorite. The different sauces you get are all unique and great. Love that the cocktails are parallel with the cuisine, all Mexican/Latin inspired and some really fun surprises on there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbnBfbjhRRRAB",
            "text": "Absolutely delicious brunch spot with some great vegetarian options (not vegan) and really fresh, premium ingredients! This is probably one of my favorite brunch spots in Bushwick.\n\nThe chilaquiles were SO delicious and filling! The empanada was really good. And my partner loved his Sunday special carnitas (only offered on Sunday for brunch) with blue corn tortillas. Cocktails were really unique too! Will definitely come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3akpqVTZBRRAB",
            "text": "We visited Sobre Masa for my birthday celebration.  We had a reservation, and they sat us at the bar until our table was ready, which turned out to be about 10 minutes.  The bar was very hectic, and it took a bit for us to get drinks.   Once our table, the service was improved and our server and the rest of the staff were very attentive.   The plates are small and they arrive fairly quickly...the food is delicious!  Among the plates we had was  the lamb barbacoa, and it was phenomenal! Fresh, delicious, and tasty, I only wish the portions were larger!  The tortillas are also out of this world, and even the guac here is exceptional!  Well-worth the trip, and visiting them real soon!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHcU1xck1nEAE",
            "text": "Simply a must-visit. Delicious Oaxacan cuisine/coffee/cocktails with great hospitality. Love the decor, really unique layout and a great place to bring your friends. Lucky to have this gem in the neighborhood!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcUlMMnBRRRAB",
            "text": "The tortillas are pressed fresh here from heirloom corn from Mexico. The flavor is phenomenal! Incredible tacos with the best salsas! If you like tacos don’t miss the gem!! Six out of five stars!!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNFppNHFRRRAB",
            "text": "I love this place. I come here regularly, bring friends. Food is great. But I had an unpleasant experience today ; I walked in, and placed to a corner at the bar. As soon as I sat, I felt the strong blow form AC. And I've been told that they are aware and they are going to fix it. I said ok. But after a while it started add up and became too much, I felt like I could get sick. So I kindly asked the server with long hair \"may I move to another seat on the bar?\" he said \"we are expecting a group\" in a very dismissive way and I was thinking of leaving felt quite rude, then Alejandro the bartender jumped in and said \"i ll take care of it\" and he moved me a few seats further, he is the best. I also took a picture before I left, which you can see there are many seats empty, never filled. It's wednesday night. And my request is related to a known, accepted issue.\nThis initial response felt lazy and rude. It's just baffling to see this kind of behavior in the neighborhood. I hope you put this into consideration and be a bit more mindful to your guests. Don't let these attitude overshadow the rest of the beautiful experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OTgyRERBEAE",
            "text": "I stumbled upon this place while in the city and was pleasantly surprised by the upscale feel in the neighborhood. I had a drink at the bar recommended by the bartender which was tasty and ordered wings togo. The food was extremely spicy even the extra sauces I ordered on bc the side. It’s worth the visit for a quick meal n cocktail."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MjVqSEtnEAE",
            "text": "Absolutely delicious from the margaritas to the mole.  Fresh juice cocktails crushed it , Super crafted salsas, beautiful tortillas, and really great service.\nThe house potatoes chips are insane excellent balance with chili vinegar &salt.  I’d love to see a couple entrees that follows those inspirations   Well Done"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXZ2RQbVB3EAE",
            "text": "WOW. Very unassuming from the outside but it’s a chic party inside. Simple menu but explosive flavors. Best Al Pastor tacos I’ve had on the east coast! The flan is divine. Drinks are well made. Service was attentive. Great ambience to have some quick bites and awesome cocktails to start your night!"
        }
    ],
    "reviews_count": 74
}