{
    "name": "Amaranto",
    "place_id": "ChIJn85R-Qj7ZUAR8ozeRAybcbY",
    "grid": "BK4",
    "address": "887 Hart St, Brooklyn, NY 11237, USA",
    "rating": 4.6,
    "user_ratings_total": 627,
    "phone_number": "(718) 576-6001",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUGNGVXRRMWhZVlhKSVp6TnVVMlp0VEhJM2JtYxAB",
            "text": "Exceptionally delicious food with vivid flavors. It’s amazing and fully gluten free too! I had the chicken enchiladas with the yucca fries to start and everything was perfect."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUU5XUktTRGRuZWxrdE5YZENWMWhqTkd0dFkxRRAB",
            "text": "So good! Love this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNGVFUjNkMnBSTFdOZlVFdElkMUZxVUVaa1VtYxAB",
            "text": "I've been ordering from here for years and have consistently been impressed with the quality of their food. In my opinion, it's an underrated spot in the neighborhood. Phenomonal fish tacos and short rib quesadilla"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Q2JXdzNSbWxNUm5Cd1NWSkJiMGxqYjNSSGQwRRAB",
            "text": "They were very rude for no reason."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tod2IyUTJWSGwyV0RkQ2REWkhjbEZZVlRSM1JWRRAB",
            "text": "One of the servers gave me a nasty attitude and didn’t really understand what I was saying."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204dFlWWTJNell0VldORWJGcGxjV0l0VVV0SGIzYxAB",
            "text": "Super nice staff. Tasty drinks. All the food is delicious. The salsas are divine. All entrees, tacos, and small plates have hit the spot. I am lucky to eat here often!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcWJFeDBUVXRmWW14QlpUSkdSWEJqYTB0V2VtYxAB",
            "text": "Food was good, service was lovely."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bG9URTN3RRAB",
            "text": "I love this Mexican restaurant and eat here often. It has the best chicken empinadas with mole sauce! The Chicken Adobo is delicious as well. Everything there is delicious! There is a beautiful mural on the wall and the restaurant has warmth and intimacy. There is a bar.\nI highly recommend the experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRFlsWkRjWEIwV25BeFluRlVOREpHYTBvNFNsRRAB",
            "text": "Great short ribs and hibiscus tea! All menu is gluten-free!\nUnnecessary loud music.\nIncomplete-like interior."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVWFqbHdSbWhrUVVKUE9IUm1iRkJpTFZOSWVIYxAB",
            "text": "Awesome tacos, friendly staff, and good margaritas."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWV1NrTnRSMFo0WVdOaVRqWlpZWGMzY1RKcVozYxAB",
            "text": "My wife and I really enjoyed the shrimp tacos and the fish tacos! The service was excellent and very friendly. We will definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacmNGRm9WR1JxVkRsVFowSXdNVVpwU1VaSWVHYxAB",
            "text": "My favorite restaurant in Bushwick! Moving out of BK and I will miss the fish tacos and salad more than any other food in the area. Trust me on the salad! The bigger menu items like the steak, vegetable main, and enchiladas also stand out if you’re hungry hungry. Cocktails are phenomenal as well.\n\nGreat place to sit outside with friends or on a date. Esp if you have a gluten free friend! Full menu is gluten free. Close to Maria Hernandez if you want to take a walk after eating :)\n\nThis is a QUALITY restaurant that I can tell you will quickly become one of your favorites. Go once you want to keep going back. Thank you Amaranto for the best meals!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNX1FrSl9kX3Q3LUt3EAE",
            "text": "Delicious and they even had corundas!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GQ2RYWmxlVVp4ZFRBdFdqTkxhSGx3WDI1V1pGRRAB",
            "text": "The food here is unbelievably good and it’s ran by a husband and wife team who are the sweetest. Some of the best Mexican food we’ve had in New York. Can’t wait to come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aE4zRlVhVE5DU1cwNFdFcFdURU56TkVOelFXYxAB",
            "text": "The portions were just right — not too big, not too small."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcTF3S0RVa2NEMU1nEAE",
            "text": "Amaranto is a gem in Bushwick. I popped in for brunch and was unexpectedly delighted by the food, the reasonable prices, and the sweet staff. The esquites are delicious and flavorful - chilaquiles and huevos rancheros were richly sauced and generous - coffee was strong. I may become a regular here. This place deserves more credit and patronage, go out and support it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNLXZoN3o0Mm8yTUdBEAE",
            "text": "I'm a big fan of this place. Excellent Mole..deeply flavorful ...on a noisy lil corner spot just down from the park...and so worth it"
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNWNMTmFnEAE",
            "text": "Molto deluso. Non hanno rispettato i prezzi del menù."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMzd2cURBEAE",
            "text": "Authentic, soulful Mexican food with incredible hospitality.\nI sat at the bar and had the enchiladas verdes—perfectly executed, flavorful, and generously portioned. You can tell there’s real heart behind the food. The owners themselves were running the show, and their warmth and attentiveness made the experience even more memorable. It’s a rare combination of authenticity, hospitality, and honest pricing.\nLooking forward to coming back and exploring more of the menu. Amaranto is a gem."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveUptWXBBRRAB",
            "text": "Everything I’ve had here has been great. Truly a hidden gem of the neighborhood. My faves are the fish tacos and pork tacos."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMDRxRWVBEAE",
            "text": "Crab tostada is a must. My short rib mole was a fantastic birthday dish."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdGNTS21BRRAB",
            "text": "The tacos tasted like they were made in Mexico City! Tortillas are incredible"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeTV2SGVnEAE",
            "text": "Welcoming and delicious"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cElUVExBEAE",
            "text": "We love amaranto! It’s truly a neighborhood staple. The quality of the food is high, and it’s a family-run business so it feels great to support them. Their sangria is also to die for. I’ve never had a bad meal there, ever!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRel9yUjBBRRAB",
            "text": "Cozy spot! I love the chicken burrito and La Mixteca (guanabana cocktail). The burrito is the perfect size to be satisfying without making you feel uncomfortably full. Food is fairly priced, especially for this area."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReEtHVER3EAE",
            "text": "Me pareció un local muy acogedor .\nLa comida es muy buena por cierto cada plato es sorprendente y muy buenas porciones pedí la quesadilla de carne de res y me pareció muy buena sus ingredientes…"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNWZ2dnZ3RRAB",
            "text": "Buen servicio  buena comida"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNnFXeWN3EAE",
            "text": "Everything about this place is great. The staff are nice. The bar is smooth and the service is quick and catered to what you want. I recommend for dine in, take out anything really."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMmFMb0VREAE",
            "text": "Chicken Mole enchiladas were delicious and hearty"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeVpPMDBRRRAB",
            "text": "great neighborhood spot with great service ! favorite part of my meal was the white sangria I ordered during happy hour. Guacamole and tacos are pretty good as well!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMGRyRWd3RRAB",
            "text": "Delicious food at a good price with a warm cozy vibe. Loved it."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaW9YakR3EAE",
            "text": "100% a must eat place. Atmosphere, charming, warm and welcoming. We had the Carnitas and chicken burritos.  Rich with flavor and juicy. Super recommend this place food is made with love."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMDU2RV9BRRAB",
            "text": "This family owned place should absolutely have lines out the door. I felt like I was back in Mexico City. Everything they served here was made with care from handmade tortillas to classic cocktails. We dove into the spicy guac, multiple tacos (steak and shrimp weren't skimpy and perfectly seasoned) but the stars of the show were the chicken enchiladas mole and daily tamale. The mole wasn't too bitter or too sweet, very smooth that I wanted to put the sauce on everything. The tamale featured tender mushrooms and also had a stellar sauce - they could jar up all these\nsauces and I'd take them all.\n\nIt was a bit sleepy on a Thursday night and they run a lean operation with maybe 3-4 ppl in the fam running the tables, bar and kitchen. Please give them some love if you're in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNkluRnNnRRAB",
            "text": "Really tasty tacos and margaritas"
        },
        {
            "date": "1년 전",
            "language": "ilo",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbXZMRUZBEAE",
            "text": "Gorditas and flautas unbelievably good, tacos great too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYc3VXczdRRRAB",
            "text": "One the best if not the best Mexican food in Bushwick.  The food and drinks are amazing. I’ve been coming here for 8 years and everything on the menu is crafted to perfection ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMFBEcXRRRRAB",
            "text": "We had most of the appetizers and the margaritas. Everything was excellent! Thank you so much"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcW9YUzJ3RRAB",
            "text": "Food and service fantastic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINjdEajN3RRAB",
            "text": "Casual Mexican in Brooklyn with great tacos.\n\nThis is a casual but tasty Mexican restaurant, close to DeKalb subway station. We’ve had pork and ribeye tacos. They were both delicious, but ribeye one was a little heavy and the pork one was a little spicy.\n\nTortilla chips with guacamole sauce was a very good appetiser if you need nibbles before your main."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dk5faDl3RRAB",
            "text": "Friendly service and delicious food. Super!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNmFhMm5BRRAB",
            "text": "Amazing food! Have tried three items from the menu and my friend and I keep coming back for the same exact three items because we can’t stop talking about it! (Street corn, crab tostada, guacamole)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOGU2REZREAE",
            "text": "Went with a couple friends on a Saturday night and it was a great experience. Not too busy we were able to walk in and get a table. Atmosphere was intimate, staff was friendly however service was a bit slow. They didn’t seem to have any type of system when it came to checking up on each table. Food was really good. Especially dessert. I thought the prices were pretty fair. Would recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaXE2RV93RRAB",
            "text": "this place is super expensive for basic mexican food. they got me twice never again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcWUzbVhnEAE",
            "text": "Lovely atmosphere, attentive service, yummy food and really great margaritas. Probably best margarita I have had in Bushwick. Nothing extra just a really good quality meal. I hope people come and support this restaurant!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcFAtaHpRRRAB",
            "text": "My partner and I went for a second time in two weeks last night. And honestly they were incredible again. Very cute vibe inside.\n\nBetween both visits we’ve had: NY steak, 4 types of tacos, enchiladas, amazing margaritas, crab tostada, braised short ribs. Every person that ordered at our different tables loved every dish.\n\nWe left last night talking of how we can’t wait to come back!\n\nHighly recommend to anyone!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdUxxbE5BEAE",
            "text": "Quiet and friendly. Best gluten-free quesadilla I've ever had. Amazing service, 10/10 would love to come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6OF9Pa3JBRRAB",
            "text": "Hands down the best Mexican food in NYC!  Great food and service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdjhyd3F3RRAB",
            "text": "Overall Phenomenal!\n\nSome of the BEST mole I’ve ever had, very rich and flavorful with depth and spice!\nYucca fries were crisp on the outside side and warm an fluffy like inside sooo good!\nI tasted the shrimp taco and it was seasoned to perfection!\nI had the tamarind drink, it was a great balance of sweet and sour and it was STRONG.\n\nThe espresso ice cream with a blackberry compote (I believe)over a churro was  yummy the ice cream taste like espresso not coffee which was differenttt the compote was tart and the churro was slightly sweet and crunchy. The walnut Tres Leche cake was moist, nutty and not overly sweet.\n\nAll of the presentation is superb and the photos prove that; I would highly recommend this spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdTQ3b0FREAE",
            "text": "Cute spot with outdoor seating. I had the guacamole and chips, I thought it also came with salsa but apparently not. They charged me $4 for 2 small salsa samples."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdHRIT3RRRRAB",
            "text": "Really lovely experience with great beef tacos (4/5) and really great and packed gobrenador tacos (5/5). The $11 Margaritas are also very strong, but otherwise the food is pricey. The mole (4/5) was also tasty - very creamy and smoky with well cooked chicken."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaDZ5UWdBRRAB",
            "text": "I love ordering takeout from them. Great Mexican food, delicious tacos, burritos and enchiladas.\nFood to go is always nicely wrapped and packed.\nOne of my favorite spots to order take out in Ridgewood since they are always reliable."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHME8yNjBnRRAB",
            "text": "Food was full of flavor! We had multiple dishes from the appetizers to main course. The guacamole was delicious,  it had some unique flavors with some type of beans sprinkled on top. The tostada was crunchy and every bite had different…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dDhIYTRnRRAB",
            "text": "This is my new favorite spot in bushwick! Read some reviews so I decided to stop in for lunch. Such a warm and cozy place. Felt very welcomed soon as I entered! I ordered the spicy guacamole and the Short Ribs With Pepian Verde!\n\nBoth were tremendous!!! Full of flavor and a wondering presentation.\n\nI will be a returning customer Forsure!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyeWZXRS13RRAB",
            "text": "Fresh, warm greetings. From mamma, to all the staff, you could tell they were all working together to make it wonderful. Our group was large, we were able to sit outside. We all had margarita of some sort, nice size on the rocks. Most of us had tacos. Presentation quickly lead to consumption,  all plates were clean.. I'd go back in a heartbeat 💓\n\nDelicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqak0yNW13RRAB",
            "text": "It’s hard to find a place like this in the area. Whatevevyou doc DO NOT forget to order some s flautas as an api  Definitely recommend it! The margaritas are awesome (try the mezcal ones. fiiire…) Staff and ambiance were on point and we don’t have much to say other tan, Thank you"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNGJTMnpRRRAB",
            "text": "Amaranto is the best Mexican restaurant in Bushwick.\nThis time we got two drinks. (Very generous with their mezcal and tequila)\nWe shared the chorizo empanadas, which was crunchy and had two empanadas with extra sauce so a good appetizer to share.\nWe tried a few tacos and shared a burrito.\nEverything was tasty and full of flavor.\nLove this place!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwaXF2WGh3RRAB",
            "text": "Wonderfully flavorful Mexican food - so fresh and well plated. The crab tostada is heavenly. The staff is warm, attentive and friendly. Highly recommend this spot!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3dS1QTTV3RRAB",
            "text": "My husband and I have been coming back to this restaurant for the last 3 years. The food is always beautiful and entirely delicious. We always get delicious Mezcal based cocktails as well, which not every bar does well. The chilaquiles…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLaFotVnJRRRAB",
            "text": "They brought the food very quickly and it was good! The salsa in the chips and salsa side could be better, only the green salsa had a tasty flavor, the others were a bit plain. I wish there was a small chips and guacamole for single diners, the appetizer looked too big for me.\n\nI enjoyed the chicken mole enchiladas although I wished there were avocado slices on it with the lettuce."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtLTRYVWJBEAE",
            "text": "Pleasantly surprised by how good their food was, even though the place looks unassuming from outside! Delicious and big portioned, and the people there are really sweet. Got the lamb and the seafood rice. Yuca fries really hit the spot too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1ai1xdWdRRRAB",
            "text": "We found Amaranto on line based on reviews and it was such a good find!  The restaurant owners were welcoming and the service was prompt and friendly. We had margaritas- which were fab and then a good range of dishes.  The Short-Rib was my choice and it’s possibly one of the best plates of food I’ve ever been served.  The mole roja sauce was so packed full of flavour and the beef fell apart.  Another standout dish was the fish tacos.  Highly highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtd2NtWE9REAE",
            "text": "One of the best restaurants in the city... Amazing food, all fresh and delicious, amazing host, very cozy and very good prices.. order the chicken abodabo... The best!!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwX0piTlV3EAE",
            "text": "I'm going to claim this as my new go-to Mexican spot. The food reminded me of homemade dishes. Everything tasted freshly made from scratch. We had the ceviche, chorizo burrito, mole enchiladas with a bowl of beans and rice for the kids.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtb3ZETTRnRRAB",
            "text": "I had the chicken adobado and it was really good. The portion was great for the price range. The place is small but very welcoming. good service fast the enchiladas are also really good  n the drinks are pretty good too!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNFbThLZmRnEAE",
            "text": "Delicious food. We tried steak and chicken tacos and steak burrito. It was super tasty. I would suggest putting two pieces of bread for the tacos because it melts easily.…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzal9peUd3EAE",
            "text": "Very cute place, lovely service. Delicious steak and short ribs. A real neighborhood find. So good! Recommended 💯…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZNk15WEdBEAE",
            "text": "Finally checked this place out and it was amaaaazing! I hadn't seen brunch options on their website but they had an awesome selection. Margaritas were perfect - simple and super solid! Can't wait to come back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNzdpbGF3EAE",
            "text": "Delicious food. Highly recommended. Being Mexican born and raised is great to find places with authentic Mexican main dishes and flavours in NYC. I can tell they’re dedicated and great with their seasoning and presentation. Also I received an excellent friendly service by their staff. I’ll be coming back"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2aS1tRENREAE",
            "text": "Food is amazing but really horrible service.\n\nRude waiter and very unhelpful staff. The owner was really nice but she was the only nice one. Such a shame"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhcU9LLVVBEAE",
            "text": "I took quite a drive across Brooklyn to try this place out because of their Google rating and I am not disappointed. We ordered guacamole and shrimp ceviche. Both were super fresh and as cold as they should be. Next, we ordered grilled…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabVBtRnNRRRAB",
            "text": "Can't say anything wrong about this place, I came to eat around 2 PM, wasn't busy at that time, fast service, and delicious food, only the rice I think is very commercial.\nVery clean place ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMFlmOUpnEAE",
            "text": "Came here on a mission to find good chilaquiles, and they definitely didn't disappoint. Really good portion sizes and flavor was top notch."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3N09HWDRnRRAB",
            "text": "My daughter liked her burrito. I wasn't much of a fan of my shrimp soup. I felt it wasn't authentic Mexican food which that's what I was hoping for. The drink I had was great which I wish I remember the name. The guac with the pumpkin seed was awesome."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvMy1DRmlnRRAB",
            "text": "My daughter and my niece and I loved our meals.  The chicken taco, the pork taco, the steak taco and fish taco were all delicious.  We tried them all.  Shayla recommends the pina colada.  Ava recommends the avocado toast and eggs for veggie folks.  Uncle Dave recommends the guacamole app, it was delicious."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnczc2M3VRRRAB",
            "text": "I had an unbelievable lunch with a good friend. The seafood was cooked so well and it tasted so great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5c2I3SkZBEAE",
            "text": "So lucky I got to try this place. I could hear my salsa's being blended up fresh with each new course. The prices are extremely fair for the filling portions and I felt clean and healthy even after a significant feast! Service was attentive, kind and fast and the space was very clean."
        }
    ],
    "reviews_count": 76
}