{
    "name": "Ops",
    "place_id": "ChIJl3Fhlh5cwokRQEja9nTWRv4",
    "grid": "BK4",
    "address": "346 Himrod St, Brooklyn, NY 11237, USA",
    "rating": 4.6,
    "user_ratings_total": 839,
    "phone_number": "(718) 386-4009",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWGJHbFVNbmxvUm05M1dFZFBNVkZIUkV0TE1IYxAB",
            "text": "Every day i dream of an ops pizza and a glass of wine"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaS1dVUmZWVFJzWVZKcFpIcE9ZVFpWVFdwNWVrRRAB",
            "text": "Jacob took amazing care of us. The seasonal calzone special and the Mama Pizza were a return worthy choice. Go and eat with reckless abandon. We. Love. Ops."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbFJuVjVZVmhFWkZoQ2JFUkdRbUZvTmpONFNrRRAB",
            "text": "Very nice tast different to other pizza’s"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OV1RYWkdTa1Z6T0dkU1lqSklibHBST0haWWFFRRAB",
            "text": "pizza portals to heaven except camo shirt guy was not so awesome… attitude out the wazoo"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jdFIzcHdWRlZvTm1OQlp6TTNZVEZhWVdsM01FRRAB",
            "text": "No complaints! Phenomenal sitdown pizza and prices aren’t completely exorbitant. Sourdough crust hits the spot when you’re craving it. Drink and desert programs punch above their weight, too. Lovely vibes for a weeknight date night."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMGFtZFBSemxUYzA5WFZIRjJWMkprVW1SSE5GRRAB",
            "text": "Daily specials are a 100/10 every time. A true gem in a city with a million pizza spots. Must-try"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSlFtaGlWME5YWjFoVWRtVTJjMWh0ZDBKb1VGRRAB",
            "text": "Brought a friend from out of town and it was a hit! The sourdough crust is scrumptious and quite special. We ordered the Pops and customized a margherita.\n\nOur favorite was by far the margherita pizza with added pepperoni and mushrooms. I’m especially impressed with the waiter we had on Sunday at 5:30. We unfortunately didn’t get his name, so I can’t give him a shout out. He elevated our meal from great to special. We originally ordered a marinara pizza with pepperoni and mushrooms. Somehow he knew we wanted cheese and came back to check with us after we ordered. We indeed preferred the margherita, which is now one of my favorite pizzas to eat in NYC.\n\nFYI, the table space made me feel like I drank an Alice and Wonderland grow potion. I found it cozy, but some may find it cramped. Just come with a focus to eat good pizza and you’ll have a great time! Also, it’s great to have a good pizza place that takes reservations!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdVN5MDRNbEZFWkhoR1owTlJTWGx4ZGpsbVpHYxAB",
            "text": "Ops! You were disappointing tonight. I have been coming here sooo many times and I always love here. The servers are fantastic and especially sitting at the bar and watching the guys- who make the dough and prepare the pizza- always great! But tonight- I don’t know who this person was kept touching his cellphone and his nose-prepared all pizza doughs !so bad. If you would eat the pizza if I do the same good luck with that. Unfortunately I need a break to come to you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cWNtUTROVEExUWxOblUxaHpTV2hPY3paMVRWRRAB",
            "text": "Spectacular date spot, but also totally a vibe if you need to bring your parents to a cool restaurant"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tab2F6TnlWRlpDZUVZMmNsVlFPRzVGVG1OR09YYxAB",
            "text": "Muy lindo me gusta"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGS05FcHZiM0JNTlhSaldWbFlkemxDYTFwdU1rRRAB",
            "text": "My daughter and husband eat here frequently and wanted to host their baby shower here. I live in California so I thought it may prove difficult to plan it from 3000 miles away. However, from my first email inquiry and ongoing communication with Mike, to the day of the shower was super easy. The staff, Cedric and Gaby, were amazing and helped to make everything happen so smoothly, the shower was a great experience. All of the staff were great, too many to name. The food was excellent and the atmosphere was fantastic. If you want to host a gathering that’s great in every aspect, this is your place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMGFrZEJObXg2V2twMlQyZ3hVblZTYlU5bFRFRRAB",
            "text": "I came here on a date, my partner said that they had gluten free pizza here and that they liked their regular pies. I was excited to try another pizza place with a gluten free option!\n\nAlas, it was one of the worst GF pizza's I've ever had. And definitely the worst I've ever had in a restaurant. It was brown (they must use buckwheat in the flour blend or something) and was soggy. The crust had almost no chew. The flavor wasn't terrible but wasn't great. The flavor wasn't as bad as the texture but it was all around a bad experience.\n\nThankfully when I told them that I didn't like it they took it away and didn't charge me for it when I said I'd get a salad. The one redeeming thing I had here was their butter beans, those were yummy and well flavored. But I don't want to eat a meal of just beans.\n\nApparently the dough is not something that Ops makes there, but they get it from a company called Knead Love. I've never had their stuff before but I think they Knead to go back to the drawing board with this recipe.\n\nIf you are Gluten-free, don't come here. The vibe is nice and it seems to be popular, so maybe if you can eat gluten, its worth coming."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xad1ZsZzRNMHMyUzFCaVkwSlJUa2RzVGtWelozYxAB",
            "text": "Very strange place, with a bro vibe. We felt uncomfortable from the time we walked in (where we were told to go outside to the host) to when we were unpleasantly seated.\n\nThe food review is specifically for the gluten free pizza. The regular was really good the atmosphere was the only let down. The gluten free pizza was by far the worst gluten free I’ve ever had. Please pleas please just remove from your menu. It was just the worst. Gluten free people just don’t go here. I spent $30 on a pizza I threw out that was 8inches."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkc1drNVdaVlJtUVdkck5tRlRNMjV1ZDFaWmRsRRAB",
            "text": "Best pizza ever tried!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MUxXcDRjRzFpVXpoTGFGVTBTa280TkdKb00yYxAB",
            "text": "It’s a great place to enjoy the most meaningful friendships of your life! Went With my sweet heart and also my best friend, Walker and Manny. My heart! And the best pizza"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCc2VsaE1Sa001UTJKUFVrWTFUVmgwUTJoMWQzYxAB",
            "text": "I recently checked out a local pizza place known for its wood-fired sourdough pizzas. Since I'm a big fan of sourdough, I had pretty high expectations going in.\nThe atmosphere was great — cozy vibe, good music, and super friendly staff.\nThe pizza was fresh and tasty, but I do wish it had been served a bit hotter. I feel like that would've really brought out the flavors even more.\nSince it was my first visit, I'm giving it 4 out of 5 stars.\nLooking forward to going back and trying more from the menu!"
        },
        {
            "date": "3달 전",
            "language": "da",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBdE9VVlZlbXgwWWxvd0xVOVVZMnAxU0U1blMwRRAB",
            "text": "fav 🍕 fav 🍇 liv laf ops…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVWFrd3llRWhpTVhWRFMzaGtSRWxTZURSV2NrRRAB",
            "text": "Love this place. Definitely a weeknight go-to. The staff is always friendly, and the special pies never let down"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VFZucGlOMWR4TFRWRlptUjBURTFSYVhOa1pIYxAB",
            "text": "Good place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SelUwZFdObmhSVFhSZlRUQnpjVlJEUkdjdGRrRRAB",
            "text": "Pretty good neighborhood spot, great atmosphere in the joint when I walked in to pick up a few pizzas. Pizza was great, crunchy and not too floppy. The  Mama and Papa are tasty pies, but the onions are a little undercooked on top for my liking. To each their own!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRlF6SllZMk5zWTBocmRXMXBSWE5CVHpOU2NuYxAB",
            "text": "really tasty pizza! I love the square pie! also my friend got a pizza topped with 1000 onions, it was crazy! she loved it! I recommend making a reservation :)"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUldDMUZSRVZxUlcxbFZ6VmZMVWxzVWxOT05HYxAB",
            "text": "Muy rica pizza y con ingredientes frescos."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNNzB5OERXdzdtTDJnRRAB",
            "text": "I hate the ops but I do like Ops. Their pizza is very solid, but I thought their beans were just okay. Not making any huge waves, but a really nice neighborhood spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUk9GTmtRWE50WXpGYVUwdHpNVWxCWjNNNWVFRRAB",
            "text": "One of the two pizzas we got was definitely tastier than the other, but neither was crispy—both were soggy, the square one too much dough and overall just mediocre.\nSave the $16 from the cocktails, not worth it!\nGet cocktails else where."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMclJoYm5ZaWJUREhREAE",
            "text": "simply awesome"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQdjFwUEw5eU1PdF9BRRAB",
            "text": "olives fell right off the bone, the green in the salad was good, but the purple was bitter (not bad just bitter). Cocktail was good. Pizza was fresh. Didn’t get dessert. Service was fine. Thanks!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKWGRwLVNaN0xmaHh3RRAB",
            "text": "Pizza is truly exceptional, possibly the best in the city. Somewhat of a Neapolitan style but crispy enough to hold shape with no flop even with toppings and has an incredible sourdough flavor. Absolutely delicious. Highly recommend the mortadella and meatball pizzas.\n\nFront of house staff is weirdly cold and  unwelcoming bordering on condescension but back of house is very kind."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKRG04NHV1MDlhNk5REAE",
            "text": "great spot highly recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLclVxZGpXdTV1UUt3EAE",
            "text": "We had such a wonderful evening here - the staff were so friendly and accommodating and the food lived up to expectations!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQX1lvSUNvOGZ2N1JnEAE",
            "text": "Had a really yummy pizza (the square pie). The staff were very nice and gave me wine recommendations. The red I had by the glass was awesome. Ambiance is fab. Will be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHFpSzRnRRAB",
            "text": "Chill and neighbourhoody upscale pizza place that doesn't come with the attitude that that sometimes entails. Has a thoughtful wine list which is a big plus."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMzVHZnFBRRAB",
            "text": "Disappointed and won’t return. Came in to try the pizza after seeing good reviews, but the experience was off from the start. Waited several minutes without being acknowledged, only to be met with a rude gesture from the bartender. A couple that arrived after me was being seated immediately, and when I pointed it out, I was dismissed with attitude. Unprofessional and disrespectful. To top it off, the place had an unpleasant smell that made the atmosphere worse. With so many great spots in the neighborhood, this was a major letdown."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeXJhaHFnRRAB",
            "text": "That dang calzone. I’ll be dreaming about you…"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIc01LVkdBEAE",
            "text": "retried after a while much better"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dzlXNHF3RRAB",
            "text": "this place is kinda tacky. I showed up at 530 on a Thursday with a party of 3 and was told I have 90 minutes to eat because they need to give the table away. the place was completely empty when I got there. I'll probably just go to Decades next time they have bar seats available always."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3c2FlWHBBRRAB",
            "text": "I’d heard about this place for ages and finally went and it did not disappoint! The service was incredible, our server was so friendly and knowledgeable and attentive. We got the special of the night and the regular square pizza and the Juno and mamma to go. They were all so good and I’m usually not a crust person but the crust here was delicious! The wine selection was also great!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aElhdi1BRRAB",
            "text": "Incredible experience all around—the service was attentive and genuinely curious about their guests. The atmosphere felt like I was at a wine bar in Paris. As for the pizza, it was exceptional; the sourdough had a deliciously distinctive tang and perfect texture, truly memorable."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3c1lHcXJ3RRAB",
            "text": "So delicious, and the chef is so handsome."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRN05LeFFREAE",
            "text": "Full of good-looking people eating pizza"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnb05QLUtBEAE",
            "text": "don't skip the flourless chocolate cake!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMW9DWUNBEAE",
            "text": "Been here two or three times and gave them the benefit of the doubt for the poor service. Tried again tonight and I think it’s just a wrap. Too pretentious for what it\nis. I feel bad for the pizza guy and the designer because they’re doing their thing, but front of house staff makes the whole experience feel unwelcoming from the jump."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbHJlWGRREAE",
            "text": "Food is excellent but many times I’ve walked in at non-peak hours on a Sunday evening with a half empty restaurant and got turned away by the host who didn’t even look at his reservation system and quoted a 3.5 hour wait. Better pizza and hospitality at Roberta’s, Santa Panza, etc. Go if you want to eat pizza at a place that doesn’t really want you."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMHF1NWd3RRAB",
            "text": "One of the best pies in the city. Amazing atmosphere and service. Was deciding between 2 wines and she let me try both so… yeah, top notch.  Been here 4 valentines days in a row and it never disappoints."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdl9qZU1nEAE",
            "text": "i love ops i never make a reservation so i normally end up at the bar but that damn pops pizza is so good it’s 9am and i’m writing this review because i’m thinking about it. also, the salad they do is delicious, they use like a dill dressing and it’s unmatched. vibes immaculate. mwah"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfZzV6NjJ3RRAB",
            "text": "Go to date night spot in bushwick! Great atmosphere and really tasty pizza!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbzl1Y1JBEAE",
            "text": "35 minute wait with a reservation , very passive aggressive host as others have mentioned, no ac or ventilation, overpriced , dirty , very loud(no sound deadening) , food is ok."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeGNfNGxnRRAB",
            "text": "like whoa"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbzV6c0F3EAE",
            "text": "The quintessential Brooklyn pizza place! Cozy, warm, friendly, with excellent pizza on a house-made sourdough crust. Try to focaccia too omg."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOGNYdGVBEAE",
            "text": "delicious pizza, cute spot"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMnAzS1J3EAE",
            "text": "Solid place with sourdough pizza def worth a stop and very affordable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieDRTY1JnEAE",
            "text": "This joint truly embodies Bushwick. Great ambiance, great drinks and spectacular pizza however fell short of 5 star review because our experience felt rushed. No longer than 30 seconds after sitting down without even looking at the provided drink menu we were asked if ready and 2/3 through our pizza we were asked if we like to look at a dessert menu. I understand you need to turn over each table but c’mon. Not like we sat for hours but mere 35 minutes.\n\nI sincerely hope this is an isolated incident because really dig this spot and will be back soon for that five star review."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQN3JUaFJnEAE",
            "text": "Top pizza spot in Brooklyn. You really can't go wrong with this place if you want a pizza fix. Due to its popularity reservations are recommended. The ambiance is great with a semi rustic look and lighting. They make really good cocktails, looks like they change them around every once in a while. As for the pizza, we got the Margherita pie with half sausage, the Squarewith no olives, Marinara and the Juno. The Juno was our least favorite due to the over abundance of broccoli rabe but over all the pies were really good! They were small, easy to share a the texture of the crust was superb! The mozzarella plate was a good app to get which came with sourdough and mushrooms. Overall I would rate this an 8.5/10 for pizza spots in NYC but must visit nevertheless."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUZ2QtdThBRRAB",
            "text": "probably my favorite pizza in town, definitely the best calzones and the way they handle veggies is so spectacular in flavor without having some lavish plating style. it’s truly the comfiest environment to grub good. servers are super nice and overall very efficient and fast service. love this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREczdMdEhREAE",
            "text": "Cozy pizza joint with a few tables in and outside and ample bar seats highlighting a simple menu of delicious Neapolitan style sourdough pizzas from out of the wood-fire oven. The classic margarita is delicious (great marinara sauce!) but also try their white pizzas! Additionally, they also have a good selections of natural wine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSenNMNVpBEAE",
            "text": "Came to Ops for an early dinner on a beautiful evening! We had no reservations but very easily got a table outside. I like their outdoor seating—spacious and on a quiet block. We got the special salad, the salami plate, and the margherita and special pizzas (tomato sauce base with mushrooms, salami, garlic greens, and sheep’s milk cheese). All very good! Their house tomato sauce is tangier than I’m used to, but I found it balanced the toppings well. Crust erred slightly too charred for me. I love love love their sister restaurant Leo, and think the pizza at Leo is better tbh, but this was still a great meal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdklIWmJnEAE",
            "text": "Solid pizzeria in Bushwick, I enjoyed the sourdough crust on the pies and the Margherita pizza was a delicious Neapolitan slice.\n\nThe square pizza wasn’t bad but not worth the price. While the calzone was soggy and stuffed with minimal toppings would not recommend that dish"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5NXB2aXVRRRAB",
            "text": "The decor of OPS is outmoded with vintage style. There is only outdoor dining available currently.\n\nWe had a salad, Marinara Pizza and Iron Age Pizza to share with a group of four. The pizza was amazingly delicious when it was served warm & fresh, especially the dough, super tender and soft.\n\nHowever, since there is only outdoor seating available, the pizza is easily cooling down with tough texture in low temperature. We highly recommend to do a take out order or eat in a hurry."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrMzlPMFJnEAE",
            "text": "Ops was on my pizzas to try list. Finally got the chance to go here tonight. Probably not best nights to pick (friday). There was an hour wait, but they were very accommodating especially with our 5 year old son with us. So lets get to the food!! We ordered the margherita with onions & the square pizza minus the olives, added the onions. So i like the sour dough crust. It is light airy & doesn't feel so heavy. But it can be a lot for people that are not fans of sour dough. The sauce was just ok for me. I've had much better tasting sauce. Cheese was fresh & in good amount. I liked the crust on the square pizza more. It was nice & crispy on the edges. But I dont think it's worth almost double the price of the margherita. Drinks are good. The tip included in the prices is definitely  a nice addition. The service was great btw. The decor is nice & chill & not overly hipsterish (sorry BK I represent Queens!!). Overall good experience. I would definitely recommend people to go there if they are into sour dough."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjcnUyNGJ3EAE",
            "text": "Very very very good. Can't give it a 5 because at the end of the day, it's not roberta's or a handful of others, but 100000% worth going. I did the margarita with pepperoni. The dough is PHENOMENAL. The pepperoni was great, but they should…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNTZ6WTd3RRAB",
            "text": "Good dough.\n\nMochi bite, certai rise height;\n\nI think I did a good job guessing what’s on the table for each dish;\n\nGlad we tried the spot out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUci16TXF3RRAB",
            "text": "Cute spot, deliciously chewy sourdough pizza with simple good ingredients. Some of the servers seemed a little stressed and were not particularly nice. But overall still worth going."
        },
        {
            "date": "2년 전",
            "language": "zh-Hant",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNU9icTZ3RRAB",
            "text": "環境非常漂亮！這次朋友決定點的是square pizza ，但個人沒這麼喜歡這種的，因為他餅皮很厚咬起來就是吃麵包，整體味道跟口感就會降低，有機會想試試看披薩。"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXa2JfVzJ3RRAB",
            "text": "Great place! The place's vibe is amazing. Reasonable prices. We had Margarita pizza with anchovies. The dough was light and crispy. We order a side of marinated feta which was delicious. The wine list is also remarkable. We order a bottle of natural white wine from Alsace.  Their list of natural wine is very provocative.\n\nMuy buen Lugar. Precios razonables, la pizza increíble y la entrada de feta muy buena. La lista de vinos es muy Buena! Vinos naturales de muchas partes!  Muy recomendable. :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWNDVIa3VnRRAB",
            "text": "I used to consider this one of my top 3 pizza places in Brooklyn. Been here a few times over the years and always thought it was solid. Maybe the wine was a big factor in the experience in my previous visits (I'm sober from alcohol now). Verdict: previously 5 stars, now 3.\n\nThe dough is really good, so Ops does have one really strong thing going for it. The calzone was also solid when I had dinner there in December '23. Unfortunately, the lettuce & radicchio salad was under-seasoned and disappointing. The pops pizza was sopping wet, difficult to eat by hand. I had to pick the (nearly raw) onions off the slices too, as those really distract from the pizza experience IMO (yeah, I guess I should've asked for no onions up front but I was hoping to trust the menu choices). The vibe is pretty nice in the restaurant, but I think I'll be going elsewhere for this style of pizza next time..."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVZ0xxQkZREAE",
            "text": "The pizza crust is light and airy and just the tiniest bit tangy. The toppings on the pizza were fresh and delicious and a perfect combo of flavors. And pizza aside - the salad and dessert were also total delights. Try the house salad and…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLOHYtaWp3RRAB",
            "text": "The sourdough crust here is *chef's kiss.* I tried the Pops and the Iron Age pizzas as well as an appetizer of the marinated feta. The chili oil on the side of the pizza is pretty dreamy. Their outdoor setup during Covid-19 is great too. Props to the staff for being so friendly and professional. I'll be back to try more of the menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMTZMWXRRRRAB",
            "text": "The server was really sweet and gave us great recommendations. We got a Margherita, half pepperoni and sausage and the square pizza. We also got the calzone which was amazing! Definitely recommend try this place out. If you are driving you may find street parking. We went later and found parking right away."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dk5mYzV3RRAB",
            "text": "Cozy pizza joint, very busy, but still good service. Focaccia bread and sausage margherita pizza were great! Chocolate and amaro cake for dessert delicious as well."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3M2QyX3VBRRAB",
            "text": "Pizzas are delicious. Stay away from the sides, they're weird and unsatisfying. Because of the hispster nature of the place, don't expect silverware, unless you ask for it. As others have remarked, the dough is very good and memorable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5d2RfMnpRRRAB",
            "text": "One of the best Neapolitan style pizzas I've ever had!\n\nWe decided to come here before going to see a show and it did not disappoint. We started off with the regular margarita pizza and it was amazing. The crust was my favorite part but the sauce was so fresh and the cheese and basil were perfect. Next was the rojo which was a spreadable cheese, pickled peppers and mortadella on top. I kind of wish the mortadella was a little crispy but still a very unique pizza and glad we ordered it. For dessert we had the olive oil cake. I would say the cake was a little dry but the marmalade and cream on top were delicious. Next time I want to try their white pizza or the square pie!\n\nDefinitely recommend for you to check the spot out if you're in the area."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3M2JtV213RRAB",
            "text": "My friends live right around the corner from this spot and we turned here after Nicandra's was full. The square pie is incredible - make sure you order this pizza! It does take longer to cook so keep that in mind. We also ordered the Juno…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdFBHTmZREAE",
            "text": "Had previously been to Leo so wanted to check out their original place. Great atmosphere and vibe, a bit more laid back. Service was great, friendly and attentive. We tried two pizzas, both had a really good flavour. The dough was excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCX1luSTBRRRAB",
            "text": "Cute little place in Buschwick. Tried the calzone special of the day, the Cicero pizza, and the margherita. Also had generous pours of wine, a tasty house soda, and aperitivo. Delicious food, nice service, and cozy dark atmosphere. Pizzas are around $18-20 each!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtaFlTVFZBEAE",
            "text": "Sit down pizza restaurant in Bushwick, specializing in Neopolitan and Square sourdough pizza.\n\nThe seating inside is cozy and the tables are a bit tight. It’s ideal for a group of 2, maybe 4. There is also an Unheated outdoor patio and bar. The food Definitely enjoyed the evening here.\n\nOpted for the square pie as, neopolitans tend to all taste the same for me in NYC. You can definitely taste the sourdough, which I enjoyed. The square is definitely on the smaller side, my wife and I had no problem finishing it. On the pricier side at $28, but if you figure $14 pp, not terrible. There was a nice crust, the middle was a bit soupy, maybe some time on the oven floor would’ve benefited this pie. Sauce was fresh and sweet. Good tang. Nice cheese coverage. I recommend giving it a try.\n\nAlso had a salad, simple lettuce, apple and a dressing. They have a wine list and some simple cocktails."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENzdMSkRBEAE",
            "text": "If you’re reading this, just go! This place is so good. The pizza took me back to Italy. Loved the panna cotta. It’s also very cute, the drinks are delicious, the wine list is extensive. Run don’t walk"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtazRmNGxRRRAB",
            "text": "Ordered to pies to go and they were delicious. Neapolitan style pizza with perfectly cooked, crunchy dough and great toppings. Definitely going to eat in since the place look very cozy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0X29QTUZBEAE",
            "text": "Real cozy pizza and wine bar. Really enjoyed this place, I think I would order differently next time, but that doesn’t mean I didn’t enjoy the food. The crust is really special honestly. Some of the best I’ve had in a long time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMa09xN3h3RRAB",
            "text": "Amazing pizza and vibe! Our waitress was kind and gave great recommendations. Crust was perfect. We ate half before remembering a photo :)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyMTlpNy13RRAB",
            "text": "We came for early dinner it was pretty empty but it seemed like you needed to make a reservation after 7 pm. We had the onion pizza and butter beans. The beans were a great choice for our 15 month old son! Yummy 🤤 wines and always a bonus for us they had a high chair."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZdW95TjZBRRAB",
            "text": "Very strong pies. Mostly Neapolitan, but there's a vaguely Detroit style square pie that I quite enjoyed. Crust is soft and delicious, and the toppings are quite tasty. Also, excellent service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeC1YYWhBRRAB",
            "text": "Ops never disappoints. Whether coming for date night or stopping for a quick bite, the ambiance is eclectic and unpretentious while the food is absolutely superb. We’ve typically opted for the specials, which are always mouth-wateringly delicious.\n\nPro-tip: get the bud + amaro with a splash of lime."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZaWRMcVZnEAE",
            "text": "The pizza here is worth hitting up this restaurant. Ordered the square pie, which was absolutely delicious, and also tried their special white pie, which was also quite good. This place also has a pretty good selection of cocktails. Nothing really negative to say. Service and the decore and mood of the place were both great."
        }
    ],
    "reviews_count": 82
}