{
    "name": "Chiangmai Diner & Bar",
    "place_id": "ChIJWZltv6tdwokR_tPaTI2sANM",
    "grid": "BK4",
    "address": "942 Flushing Ave, Brooklyn, NY 11206, USA",
    "rating": 4.7,
    "user_ratings_total": 601,
    "phone_number": "(718) 673-8848",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMFdXRkNOMUV4UlhKdWFrOVBTRTVIUzNaQ1luYxAB",
            "text": "Came back for the third time and had yet another wonderful experience. Bibi, our server was so welcoming and helpful with suggestions. We ended up ordering the spicy  Thai basil fried rice and khao soi Chiangmai and lychee that ice teas and of course had to order mango sticky rice. Definitely the cozy meal I was craving for this perfect fall evening!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJdFdHTlNhMUJIUXpabFNUWnBhRTl2Y1V0QmRHYxAB",
            "text": "I though this place was very good. I have been here a few times and everything is wonderful tasting. The drinks were great, a little expensive but not anything that is out of range for the area. All of the food was great! So much flavor. I have not hated anything we got. All has been wonderful. Come here, eat family style, try all the dishes."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdFdsZFNTazk0YUdoWExWQXhaM0ZXWHpWRlJFRRAB",
            "text": "The food is incredibly authentic. Every ingredient is fresh and is one of my favorite Thai spots in BK. Forrain was our waitress and she was incredibly attentive and even taught us some Thai. Will definitely come back."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbmVFaGFhMUpyVjFSc05tOXBlakp6V2pCT1oyYxAB",
            "text": "Our server Forrain was very attentive to the table's needs and the food came very quickly! Everything was really tasty and the atmosphere is warm and inviting."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OemJtcGFabmRQVDNNeFVsUkhOVGRJYkhsSVZGRRAB",
            "text": "What a find! We’re seeing music at The Sultan Room and stopped in here randomly for a bite—so glad we did! The atmosphere: Tiki bar meets Thai restaurant; the food was spicy, flavorful and perfectly sized; the service was just right—Forrain was engaging, made just the right suggestions and always knew when we needed something. I’d come back again for sure! Thank you, Forrain :)"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOallYQkpUVk40UW5CaFZYZEROWEJaV1dzdFZWRRAB",
            "text": "I came in with some friends and we were helped by Milo. He is absolutely amazing! I will ask for him every time I go there. Thank you for the great service and food."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Jd1Z6TkZlR1ZDVFhoRmNWVlJTemxCY0ZsdVRYYxAB",
            "text": "Excellent experience.  All of the staff was super pleasant, upbeat and polite.  Very relaxed atmosphere.  Had the Beef Pad Thai and a cocktail.  Everything was delicious.  10/10 would visit again!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeE4wOXJWM2xFWTFaR1dIRTFUMEoxU2tocGVVRRAB",
            "text": "Went here for the first time today. Had lunch with a friend. We got two appetizers and then the lunch specials. The food is UNREAL. Veggie dumplings are a hit, Roti Massaman is a must have. My entree was Kra Praw Khai Dao and it was delicious and not too spicy. The soup was wonderful on a fall day. Service is great. Loved our Server Bebe!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNU9XeFFWM0V6UjNwMk4wbHlNa3Q2V1VaQ00yYxAB",
            "text": "I always love coming to Chiangmai. It’s so consistently delicious. The service is excellent, specifically our lovely server today - Bibi! I almost always get the Tom Yum soup with tofu. Today we had the massaman roti to start and it was SO delicious.\n\nI try to visit at least once a month it’s that good. Cannot recommend enough!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeVRVVjBja3BMUW5ndGVWaEdXa05HWjA1YVQzYxAB",
            "text": "Food outstanding. Bibi did her thing👌"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MVJuVkVaa3cxWkdWVFpVVkhaM0ZrTkcxSE0wRRAB",
            "text": "I love this restaurant - as good as in Chiang Mai, Thailand ❤️ have tried a few things, I really liked the Gaeng Hung Lay and the spicy sausage. Definitely get one of the special northern Thai recommendations, they’re all very good. Thank you Bibi and all the other staff for being so friendly too."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGZlREZGFObGxLTVZwamFqWlJjblZGTkRjMWNrRRAB",
            "text": "Has to be in NYC Thai food podium. My favorite Thai spot in Brooklyn."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ZlQxSlpiRlJ4TFdscVJHbzJZV0Z5TTJ4TlQwRRAB",
            "text": "Got the braised short rib. :) Delicious and wonderful hospitality from Bibi and the other servers!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wck5tTXRNR3h3ZWkxUFMzbDJlamQ2VmtsaU4xRRAB",
            "text": "One of the BEST food experience in our visit to New York. So Kind and professional Bibi."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNVNtSjJXVWhKTkZBNWNFeE5URlZMT1c0MlpGRRAB",
            "text": "Thank you so much for an amazing lunch, our server Noon was amazing helped with recommendations and guided us to an amazing meal. The food it’s to die for. Just such a delicious the combination of flavors, is like anything you’ve experienced before. So congrats also to the chef! 100 percent recommended. Thank you also to ploy for being great host."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseE5qbEJWVUZ4WDFWNVNsWjNlRzlEYzE5T1ExRRAB",
            "text": "Nun & Bee"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMGRETmZRVUZ4VG1WcFRURlFhVlJTYjAxd05rRRAB",
            "text": "So happy to discover this beautiful spot in Bushwick. Some of our fave food from one of our fave parts of the world. Our server, Patty, was fantastic and very sweet. And they took a big swing on the Halloween decs. Will def come back soon!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVVlWWlhVbU5zUjB0NlZWQjJXRGxmTFdOc05XYxAB",
            "text": "patty nune hooked it up - just like thailand"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdExXcFZMWE5hYjB4ek9VSXRaSFJEZFUxMFpHYxAB",
            "text": "Patty and Poy were amazing! Service was amazing. Food was great!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JME1rNUZSV0o0UmxWeWNGSkxZVGQwV1ZaQ1RuYxAB",
            "text": "Patty my wife is the best"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTVYzaHRUMmczZEhaYWVISkRkMVI1YjBsM1YxRRAB",
            "text": "Patty was so great! We had a great dinner here with friends and loved every dish. The lychee cocktail was our favorite."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cWQwdHNPVlkwV201NlZqVlZibEpxVEZKd1JIYxAB",
            "text": "Patty was a great server! Food was great really good, the Khao Soi was awesome"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRU1FdFVWVVV6TlRCbFJHZDVlVVJqWVd4dlRuYxAB",
            "text": "Milo was the best he gave great drink Recs and  brought a special sauce to the table!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZelZGZGxWbEZWU0c1alZuTlBTME5RVkdNelNWRRAB",
            "text": "Great ambiance + food, friendly service, and not to mention some of the best cocktails the city has to offer! Thank you Patty for the amazing service and making my experience so memorable."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMFZFeEZhVzV0V0d0cGVEUlNiRVZVTjFsTE5WRRAB",
            "text": "Food is good, service is not nice. Been here numerous times with a group. We get out of a meeting around 9 but a few months ago a hostess said they needed each one of our party guests order an entree. This seemed a bit of an odd request considering they're a diner and bar?! Some folks just want a drink or an appetizer, and their water is pretty much self serve - they leave the table with a few carafs and ignore you unless you get their attention.\n\nSince then we were seated closer to the door and we've been more \"compliant\" with each person ordering dishes. But again, the host said each person must order at least $55! When we questioned this, she said each person must order an entree... but this attitude or request is not something I've encountered my whole life in food service or hospitality. The service continued to be passive aggressive. However, they let a giant dog in the establishment to dine with a couple and it was an unpleasant smell. What? These folks don't know how to turn us away because they want the money but don't want to provide the service except to shove food at us, take our 20-25% tips and turn on the lights at 10pm.\n\nSpread love it's the Brooklyn way... but this place is not that. It'd be better to be turned away - it'd be better to be at a real bar or a real diner or real Thai street food spot... not some hipster garbage joint. Unless it's daytime, the hospitality is a facade, and the mask falls off after 9pm... just close at 9:30p, brah."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRVdXMXFNblJyZUY4d1YyZHpibVJpVlROM1NVRRAB",
            "text": "I go here almost every week and this restaurant never fails to hit the spot. Absolutely love the staff too, they’re super friendly and attentive, and ensure a great vibe!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dllURktRMTk1UXkxQmNXUmhRMWxRTnpkVFNHYxAB",
            "text": "One of the best Thai spot in Brooklyn and Patty our server is really sweet. 100% recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tST1FVMVRWR3hHTWtsT1VqQlVXa2Q2VUcxV1VsRRAB",
            "text": "Patty was a very kind, caring, and generous server. She shared very nice dish recommendations as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0blFrZGhUbGhsWjNOc1QyOVVRMmcyVG5SSWFIYxAB",
            "text": "I absolutely love this restaurant! I have been here serval times and today they have earned my review. This place stands out as a Thai Restaurant with amazing food and even better service. The star of the night was our server Patty, who was such a delight. Overall I look forward to the next dinning experience and their large menu to explore."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VM2JHaFVTREIwYTE5S1RuVktYMGxpYkZoMVYyYxAB",
            "text": "Really solid food, seems like you can’t go wrong ordering anything on the menu"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoU1dUYzNjRTlCUkVnMFUwWXhORTF4Ukdwb2NXYxAB",
            "text": "Never go wrong with Krapow Khai Dow here !!! After 10 day’s trip back to NYC , I am so craving for real Thai food and real Krapow !!! This is home away from home welcome food !!! Love it !\nPs. 2 fried eggs this time !!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUGVHaDVRMWRMWVdoa1dGaDRabFF6YzFsVVVFRRAB",
            "text": "I’m half Thai, and this is my favorite local spot. The food is authentically Thai, and the service is always impeccable. Petty, in particular, offers exceptional care in her service. Love this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cVkwTldTRXd6VDFaNk0wNXRibmN3VWxsVGMyYxAB",
            "text": "Patty was the best server ever! Restaurant was great, food was delicious, and excellent service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWVJuaHJkbkZVVTFaNk5uRlpTakpyVEhrd1JtYxAB",
            "text": "Food was great and Patty (pattina) was an amazing server - she gave us great recs and told us about Thailand 🇹🇭"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUlpFVldhWEJVUzFKa1VYaE9lRTlRTVRCZlIyYxAB",
            "text": "The lunch special was delicious\nPatty our server was fast and accommodating\nTruly one of the GOATs"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCd09VYzVVM0F5VDNKSFozcHpUbkJhYmxKNlZHYxAB",
            "text": "Food and atmosphere was great. Phu ping cocktail was delicious, and the food was very authentic. Nack was also very attentive with service. Would definitely come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNWRWSlNOSFZ1UlZScVgxRmxhSE5EVEhSTlFuYxAB",
            "text": "Everything was great! Nack was very attentive and sweet!"
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVlUyZDJNa0ZXT1ZKalIweDBOMmhCWkdWMVIzYxAB",
            "text": "Très bon resto Thai sur NY. J’ai pris le curry rouge au crevette qui était très bon. Les portions sont généreuses et les prix très corrects"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdVgySkpjREZCT0VaVFUwaDFjMEZzYUZoaE5VRRAB",
            "text": "Absolutely my favorite place in the world!!!!!!!!! Thank you so much GAO!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMFVWaEdVREpLVGpZMmVsZ3RRVFUzT1hvelRrRRAB",
            "text": "Crab Fried Rice will make you remember God existed. Shout outs to Gao."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poR2FtOWtTVTFqYjFGeFQwSmFSVTlmWWpSbGNrRRAB",
            "text": "The food at Chiangmai Diner is pretty tasty, but the staff unfortunately took away from that experience. Just be prepared about 2 minutes after they take your payment and TIP as well before trying to be kicked out, barely giving enough time to pack your leftovers. If I would’ve known this was the case I wouldn’t have tipped as well, did not feel great being kicked out nearly immediately after payment and leaving a tip for service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMVlVUXdaRVF4VmxwcUxXbGxibDlOWjA5eGVGRRAB",
            "text": "The food and atmosphere were excellent, especially thanks to the server who took care of me — her name was Patty."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FelkyUnBMV1ZZU2pBdFVsVlZlSGxTZUdreFdsRRAB",
            "text": "The food was amazing! The staff gave great suggestions, and Ploy’s service was excellent and she was really funny."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONGNrcDFNRUkyYWpWb1JYRmhNMTlaY1U1NlZWRRAB",
            "text": "really a good bite to eat with amazing ambience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NU5GSldhakJWUVRSWllqZFlaVXRVVVhCUGVWRRAB",
            "text": "Great food, the place is beautiful and with a lot of space. The food was on point. The service was ok, they seemed in a rush to clean our table but otherwise friendly"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tod2MwcE9NV0pxV1RBd1RtY3ljbGRaZVZwaFRYYxAB",
            "text": "Order take out Krapow Vegan Shrimp and add fried egg recently at Chiangmai Diner, so good 10 out of 10. Bold flavors and tasty meal . Very happy with this menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWVNGbzRUMlJVVmxKWGJHdzVRVGx0ZDJOQlZsRRAB",
            "text": "Absolutely delicious! Would definitely recommend - great ambience and even greater food! Joy was amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWmRVOWlkRmgyTWs1dU1FdFBka2sxTFdKNllYYxAB",
            "text": "I love it here and the food is always outstanding. Ploy is a great server and every time I come back I have a great experience. The curry in particular is super flavorful but I havent tried something that I havent liked yet tbh"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4alJrRnpWV1ZoZG05dWJFMHlaR05FWDBwT1dsRRAB",
            "text": "Food Delicious OMG\nEverything Great.\n\nLove you June 🥰😘"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcU0wb3hVSE13WTFwMGJsRjNiWGhPU3psdWNsRRAB",
            "text": "If you are vegan or vegetarian stay away from this place. They claim to be veg friendly but staff do not communicate and you can order something that says vegan right on the menu and be handed a plate of meat. Poor service and lack of care unfortunately."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NTlLYjNBRRAB",
            "text": "가게 인테리어가 예쁘고 깔끔하고 음식도 맛있고 서빙하시는 분들도 친절합니다 😊…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeFdsOUNWMk5EYlhWZmRWRnNhRlJCVEU0MVNuYxAB",
            "text": "This place was great! My wife ordered the short ribs, and I ordered the ribeye steak. The short ribs are one of their most popular dishes, comes in a Northern Thai curry sauce that is really freaking good. The steak came with a side of Northern Thai salsa that was unique and paired well with the beef. They were both really delicious, and the staff was lovely. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMk56bG9TVVpDV2tjeFFTMXNRazlHVkZkVWJWRRAB",
            "text": "This restaurant is tucked along a cute little corner street in Bushwick, offering a lot of seating inside and outside. Chiangmai delivered comforting Thai bites, entrees, and a variety of refreshing cocktails! My favorite dish of the evening probably had to be the curry with shrimp, which was very succulent, and the sauce had a kick to it which was a pleasant surprise. I also encourage everyone to order the truffle fries with salted egg yolk. The flavors SLAPPED and will have you hooked and wanting more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYd1AyZ253RRAB",
            "text": "Chiangmai Diner & Bar is a welcome addition to the neighborhood, offering a truly authentic Northern Thai experience. The menu is impressive, with a wide variety of dishes that are sure to please any palate.  The atmosphere is also top-notch, with beautiful decor that creates a truly immersive experience.  While our waitress was new and still learning the ropes (our food took a while to arrive and there was a minor mix-up with our order), her friendly attitude made up for it.  I'm confident that with a little more experience, the service will be as excellent as the food and ambiance.  Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPR1J2Wm1Ia2NDZHlRRRAB",
            "text": "Amazing food. Amazing drinks, quick service and the aesthetic inside and outside the restaurant is amazing. Clean bathroom and friendly staff. Favorite Thai spot so far"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVdGFHTkNibVJTUVdsME4yY3paR1ZyZHpGdlVXYxAB",
            "text": "Overall rating: 4.8\nPrice: ~$60 pp\n\nWOWOWOWOWOW. Must visit. Sooo pretty. Never been so happy I got introduced to this place. I went with a group of 7 or so & we had to split it evenly. They only take 2x cards. So I don’t think my price is a true representative of the items I ordered. But sharing below:\n- Lin-Ping: 3/5 so sweet. Not good.\n- Wai-Jai-Dai-Ga 3/5 nothing special\n- Curry Puff: 5/5 delicious! Very affordable too for the quantity.\n- Chicken Satay: 4/5 the peanut sauce is sooo good. Make sure to ask for it in a to-go container. They are really weird about it. Comes with lettuce & is a great eat.\n\nThe place is absolutely beautiful and feels hidden. It’s sooo large. Best for parties or a cute date. Not sure if I’d come here solo."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcko2amp3RRAB",
            "text": "Excellent Thai food with specialization in Northern Thai food. The food is delicious and  taste very authentic. As I a craving for Thai food, everything on the menu looks so good. They even have some Northern Thai dishes that interesting and new to me. The restaurant has lots of seats and they do filled up on the weekend. The atmosphere is hip and fun with lots of young clientele. Ask the servers for dish recommendations, they are pretty good. All the dishes they recommend are so tasty."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcklqYml3RRAB",
            "text": "There is a wide variety of food, all of which sounds really good. We enjoyed the dishes that we ended up getting. Walk-in was easy before 7pm on a Friday night, but it does get busy after that."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbmZqS0ZBEAE",
            "text": "I’ve been to Chiangmai Diner & Bar three times already—and in NYC, that says a lot! It’s rare for me to go back to the same spot, but this place makes me feel like I’m right back home in Thailand. The flavors are authentic Northern Thai, and the presentation is always spot on.\n\nThe staff are super friendly and welcoming, which adds to the warm atmosphere. Whether you’re Thai and craving something familiar or new to the cuisine, this is a must-visit.\n\nShared some highlights on my foodie page @nycthaiguyfoodie (Instagram and TikTok) — check it out if you’re curious what to order!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TWIzUnRMVmc0ZG1SSk5qRmpXbHBSWmxSQlYyYxAB",
            "text": "Chieng Mai Dinner in Brooklyn is such a lovely spot for authentic Thai food. Every dish is bursting with fresh, vibrant flavors that feel like a warm hug from Thailand. The cozy atmosphere makes you want to stay all evening, and the service is absolutely heartwarming. Our server, Nack, took such wonderful care of us with a kind smile and thoughtful attention. A perfect place to enjoy a delicious, soul-comforting meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FdGVVUktSSE41WnpGTFUxZzFUakpDVEdWMmJXYxAB",
            "text": "This place is legit (I’ve traveled to Thailand and the flavors are very similar). Great lunch specials too for those who live in the area and want a tasty, affordable and quick meal! Don’t sleep on this spot!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKeW82Nl9xX0ozMk9nEAE",
            "text": "One of the most underrated thai spots in town. You will see a number of less popular thai food than other thai restaurant. Nevertheless, you wont disappointed with the taste! Their fried rice and fried fish are fire! Both interior and decoration of this place are beautiful"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUlRtaGxlVmRJTURoRWFXUkZZM1JwZEVWemVsRRAB",
            "text": "Came here for lunch; I absolutely love a place with a thoughtful vegan menu. So good, service was great, and while the food is not cheap, it’s high quality and nicely presented."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbnBlMFdREAE",
            "text": "This is a northern Thailand restaurant with authentic Thai dishes. We got the roti massman, the curry puffs and fried salmon belly balls for appetizers and the Pad Siew flat noodles with chicken, spicy beef stew as entrees. The food was delicious and the service was fast and courteous. The ambiance was relaxed and upscale."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKRFp0dWF4MjQtLTNBRRAB",
            "text": "This place has amazing ambiance and food. I eat thai food atleast 2 times a week and this place had the best service I have experienced. I want to assure special shout out to PATTI. She was extremely helpful,  charming and accommodating."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRU0yOW9aV3BmY0ZCeGMydHdMWFZqWlZsRWVXYxAB",
            "text": "I love this place! The Northern Thai food is full of authentic flavors — rich, aromatic, and perfectly cooked. The service is the best: warm, attentive, and welcoming. Our server, Nack, made the experience even better with his friendly and professional service. On top of that, the environment is beautiful, making it a perfect spot to enjoy a relaxed and memorable meal. Highly recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MU5XamJnEAE",
            "text": "Stunning dishes. The space is large and open. The lighting is pretty dark in the back which made it hard to read the menus. Great place for large groups. Can easily accommodate large groups (10+ people). Definitely try their drinks as they are strong and well made. The service is great and attentive. Plenty of free nearby street parking."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieWRiY2NBEAE",
            "text": "Some of the best Thai food I've had. Skewers were out of this world. Curries were all good and the cocktails were nice and varied.\n\nGreat interior with space for large groups unlike Most cramped NYC establishments. Recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSFVESkRWV2h4ZG14a05qSlhPVTU0U2xCblowRRAB",
            "text": "Very good Northern Thai-specializing restaurant. They have options over the Thai spectrum, but it seems to be a Northern focus. The sour flavors are prominent, and the proteins are well cooked.\n\nI actually do not know what Northern Thai food means at all, and I am guessing purely based on the menu and what I ate.\n\nGood vegetarian and vegan options and nice cocktails. The ambiance was really good especially in the back room."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwc1Rtb3hTM3B3U0ZaaGJteGxRV0ZCWlZrM1dFRRAB",
            "text": "Wow, the moment you walk-in feels like the Thai-Style Garden meets Thai Street Food, this is CRAZY🇹🇭Let’s start with some amazing cocktails to start my night 🌆\n\nLet’s start with Wing Zaab, tossed in a magical, spicy and zingy seasoning 🧂 always is a great starter. Wait 🥵 the spicy dream lover dream come true at @\nOMG, the “Bacon Larb” my favorite smoke favor. Yep, the traditional Thai dish featuring deep fried Branzino in a complex texture (Spicy & Sour Curry) REALLY FLAVORFUL 🔥\n\nWow, I’m still dreaming about Khaosoi Beef, is a rich, creamy, coconut curry noodle soup from Northern Thailand. This is SO DELICIOUS 🤤 “Prikkhing Moo Grob” wow 🤩 crispy pork belly is one of the most popular Thai dish perfectly balanced of savory, sweet & spicy favors.\n\n4 hours stew beef made the meal to the NEXT LEVEL has a deep, savory-sweet favors, as a popular Northern Thai Dish. Yep. I can’t say enough good things about Chiangmai. Absolute is your must-stop place in Brooklyn, NY"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONFNsaDJOWFJVU1ZocE0zazVObHBCVlRGZmRVRRAB",
            "text": "Everything tasted fantastic! I can’t wait to return and try more items. It was so good I forgot to take pics until it was almost too late."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bDh6Mkh3EAE",
            "text": "Nice and spacious place with great food and service. Fun space in the back of the restaurant with picnic style tables and lanterns.\nThe fresh shrimp spring rolls were plentiful and the sauce it comes with is great. Khao Soi was hearty and flavorful. And the mango sticky rice was a great way to end the meal. Food presentation was also very nice.\nHighly recommend."
        },
        {
            "date": "1년 전",
            "language": "th",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6dktiV1pBEAE",
            "text": "Top list for Thai Food & Specialist in Northern style Dish in Brooklyn NYC\nบอกเลยว่าถ้านึกถึงอาหารเหนือต้องมาที่ร้านนี้ครับ หรือจะเป็นอาหารไทยอื่นๆก็สุดยอดไม่แพ้กัน​ ทุกจานจัดได้ว่าจัดจ้าน บรรยากาศร้านทำให้หายคิดถึงบ้านกันเลยทีเดียว​  และสิ่งสำคัญ เหลืออื่นใดก็คือในส่วนของการบริการที่เรียกได้ว่าสุดติ่งกระดิ่งแมว​  ดูแลดีมากๆ​  พนักงานคนไทยบริการได้เรียกว่าไม่แพ้ชาติใดในโลกอยู่แล้ว โดยเฉพาะน้องผู้หญิงชื่อการ์ดดูแลดีมาก​ ๆ​ ให้ความเป็นกันเอง​ คุยสนุก​ ให้ข้อมูลเพิ่มเติมได้เยอะมากๆเลย​  ขอบคุณมากๆนะครับ​   ใครผ่านมาบรู๊คลินบอกเลยว่าต้องแวะมาโดน​\nI will come back to dine in again for sure."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQMXZuY1J3EAE",
            "text": "I was really looking forward to trying Chiangmai Diner & Bar based on its high reviews, and the cozy atmosphere was a good first impression. However, the experience quickly fell short due to poor customer service. No one greeted us when we arrived, and despite the place being empty, we waited for a long time before I had to flag down a server.\n\nThe drinks were visually appealing, but the Pad Thai lacked flavor, though my friend enjoyed the spicy basil fried rice. However, the service was the biggest letdown. The server never checked in during our meal, and when we finished, they immediately brought the check without asking how everything was.\n\nTo make matters worse, as I paid, the server stared me down while I left a tip. I also noticed that the default tip on the receipt was set to 18%, which felt a bit off, especially given the lack of attention we received. While the food and drinks were decent, the overall experience was tainted by the poor service. I work in hospitality and know how much a little kindness can make a difference, so I’m truly disappointed and won’t be returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bUxMaXdRRRAB",
            "text": "It’s very rare to find the authentic Northern Thai foods in NY and finally we found one in Brooklyn. Definitely will be back and so happy with everything that we ordered today. Very spacious and friendly environment that perfect for party or celebration. Ambiance 10/10 and service was 10/10"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJX0Z1S2Jsay15ZXV3RRAB",
            "text": "Exceptional country style Thai cuisine in Bushwick very tasty and fresh food with great service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxNlBmcHpnRRAB",
            "text": "Very cute place! Delicious and super flavorful food. The spicy chili fried rice and the shrimp and chicken dumplings were my favorite. I tried ordering the spicy fried chicken from the vegan menu but it wasn’t available as a heads up if you are vegan."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcjRQLWpRRRAB",
            "text": "Food was good from start to finish! The shrimp and chicken dumplings, chicken satay, jungle curry & crab Rangoon were phenomenal!! Crab fried rice was amazing! Drinks were also made well. Atmosphere was a good vibe- dog friendly outside area, good music playing with cute lighting/decor. Tried 3 other Thai restaurants in the near area- this one was by far the best."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ejVPYjRRRRAB",
            "text": "Highly recommend their coconut shrimp as an appetizer. Loved the service, they were super sweet and even gave us background information about Thai food and traditions. Mara was the best hostess. She was so sweet and made us feel welcomed from the moment we stepped into the restaurant up until the moment we left (after closing because I wanted to get pictures in the mirror lol and they weren’t rushing out). Highly recommend for big groups to eat here for birthday dinners. Cheesecake was amazing. They even sang happy birthday to me when they brought it out. As for drinks, they were all amazing. The ambience was absolutely amazing. The interior decor was so cute and made the whole place a vibe. The room we were in was all the way in the back but they have a bar in the front and a few smaller tables. This was an amazing addition to the neighborhood and I will definitely be returning here😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMUtqeUVnEAE",
            "text": "We had an amazing time here! The staff is incredibly friendly and offered great recommendations for the dishes. It made the whole experience even more enjoyable!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4XzU2SHdnRRAB",
            "text": "The food is a delight, I will come back many, many times!! The restaurant is very beautiful and cute, the servers were so kind and friendly, they even have a back area with little lanterns hanging from the ceiling for bigger parties! Great for both an evening with friends and a date night. Thank you to the team from Chiangmai for making a Monday evening so wonderful!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQdU5rN0h4eVlMOHhRRRAB",
            "text": "You are insane. comfort food. it feels like cozy tropical summer night, such a delight after walking thru flushing ave 🤪🤪🤪, too lowkey for ur taste, BIZ SHUD BE BUSSIN ♥️♥️ love the people too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bDVyVjJBRRAB",
            "text": "Delicious and authentic Northern Thai dishes! Great service and vibe where it is not too low key and not too uptight. The restaurant offers different style seating from table, booth, bar seating, to benches.\n\nHighly recommend Larb Kua Chiangmai and Sai Oua (Thai Northern style sausage) combination. Not hard to find street parking nearby."
        }
    ],
    "reviews_count": 83
}