{
    "name": "The Buren",
    "place_id": "ChIJc2jNtKxdwokRkvIgjHbILiI",
    "grid": "BK4",
    "address": "1223 Broadway, Brooklyn, NY 11221, USA",
    "rating": 4,
    "user_ratings_total": 360,
    "phone_number": "(718) 684-3023",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScVFVczNXVE0zV1Y4d1dqSTRhVWhUUkZwa1ZtYxAB",
            "text": "My girlfriend loves the salmon avocado toast and has become a regular. Definitely recommend trying it if you stop in. The staff is super funny and friendly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQ1RVaHhjWHBYY0hwbVZGTkJURVJaTmxCMFlXYxAB",
            "text": "This is a decent place to go and work with a laptop, but I don't think that's very nice to do if you don't want to order anything.  And the food that I got I cannot recommend to anyone.  The chicken and waffles was $18 for an extremely embarrassing meal.  The chicken itself was very tender, but unseasoned and bland.  The waffle, however, was clearly a frozen waffle and not homemade, which would be fine at a $10 price point but not at $18.  The worst part though was the syrup which was corn syrup and not maple, despite saying maple on the item description (false advertisement).  The staff was very friendly and the space is kind of nice but the fake plants give off a very weird confluence of discomfort and comfort."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbFpsbFRhMGh1VW0xUE9FcG9abWRhWlcxUFlsRRAB",
            "text": "Chicken & waffles here were so good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYVExWnpjRE15TTJSamVXcDVURTh6TlRkWVkyYxAB",
            "text": "sorta got scammed by the taro latte which doesn’t have coffee but is just taro flavored milk? I asked about it and he was like “oh yeah but it tastes great with espresso” and I was like “wait but isn’t it a latte” and he was like “latte means warm milk” lmaooo, I got it iced so it was doubly confusing. anyways I never do this but don’t get scammed by the taro or ube lattes like I was!!! I hate being deceived AND gaslit"
        },
        {
            "date": "수정일: 2달 전",
            "language": "pl",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSVdHSTVjVVV6WkcxTWVrWmZlVXhxTWtVelluYxAB",
            "text": "pyszne jedzenie i kawa, miła obsługa\nale porcje małe i wysoka cena"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbldVdDVaVjlVVVc5TWVYaEZTbFZsYlRCaE0wRRAB",
            "text": "Honestly impressed by the BEC on a bagel — thanks to whomever cooked it to perfection! Coffee ok. Folks were very nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gd01qUTVUM2RRT1VKRmNDMDVRMkpoTWpSek4xRRAB",
            "text": "Food is great customer service could be better\n\nThe day time male manager is extremely rude and aggressive. I used to live on Greene Avenue and I used to come here for two years straight never had a problem I use to buy food and eating here all the time which is why im surprised. I recently came back in the male day remembered me. So I usually just sit down because you know at most cafés you sit down with laptop and you start working especially once you build your relationship after being there all the time. He comes up to me and asks me if I’m going order anything so I kinda got the gist that he didn’t want me just sitting there so I told him to give me a second. I decided to just leave and not stay since I didnt want to buy anything.\n\nThe manager proceeds to follow me outside and tell me never to come back and that he is  “tried of my ways”. Talked about how I leave plates (please keep in mind. This is a restaurant with tables) Which is confusing I would dine in and also tip very nicely.\n\nHe then proceeds me to call me a victim and a slur and I thought that was very strange. Again, I didn’t even feel this coming because I never had an issue with him. But to be honest, I had to write this review because I do not feel like he should’ve talked to me that way and It was extreme. Keep in mind when he told me “never come back” i said it very calmly “ok no problem I wont come back” The reason why I’m writing this with so much passion is because I’m genuinely confused why he did that because I usually am very considerate of people to be spoken to like that. It’s just a little bit weird maybe he was having a bad day but I will definitely not be coming back. Please proceed with caution since this person\n\nThe food is good 👍🏼"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYmVnOFR4M2FDVDFBRRAB",
            "text": "Super cute place!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveXYyWmxBRRAB",
            "text": "First time there, the açaí bowl was delish ! Definitely coming back to try other foods & drinks 🤗."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbnZEZmtBRRAB",
            "text": "Sooo yummy! Smoothie, waffle, and almond croissant! Def will be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNDZEVHhnRRAB",
            "text": "A nice cozy neighborhood spot. Jorgo, one of the owners, is always kind and provides great service. I recommend the beef rice bowl, lumpia (called “spring rolls” on the menu), sausage/egg/cheese sandwich, coffees, and ube latte. It’s so nice to have Filipino food in Bushwick!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bGRlalBBEAE",
            "text": "The Buren\nEst. 2018\n\nLayout/atmosphere\n*Coffee shop; tables; counter area; three TVs; funky art on walls; two enclosed outdoor dining structures on sidewalk\n\nFood/drink\n*Ube Latte (hot, regular milk) - Good; sweet\n*Nova Scotia (Nova Scotia salmon, cream cheese, capers, lettuce, tomato, red onion) on plain bagel - solid; stuffed with ingredients; not a fan of the bagel style"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NXJfM3NBRRAB",
            "text": "Good food and coffee!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQemUyb0hBEAE",
            "text": "I had a quinoa salad with chicken, it was delicious super fresh and great combination of ingredients. Service was excellent super friendly as well. definitely will go back to try more food. Happy costumer 🌸😊"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaWJPVEZREAE",
            "text": "Good place to see art and have a drink and some food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcHFlVnBnRRAB",
            "text": "Overprice bodega food. BEC was forgettable and dry. Coffe was bad as well. There’s probably a reason this spot is always empty"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNTdQMy1RRRAB",
            "text": "Vibey chill spot with the bomb rum punch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaDhQejRBRRAB",
            "text": "Literally my favorite mocha anywhere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuczlLYVFBEAE",
            "text": "We just stopped there for coffee. The staff are sooo friendly and the coffee the best we've had in such a long time. We will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucHRqYVRnEAE",
            "text": "Great selection of food and drinks! The staff are seriously nice. A great place to just chill and hangout with family or friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuLUxfcjl3RRAB",
            "text": "The food is fresh and absolutely delicious. Highly recommend the Ube Latte, chicken sandwich and rice bowls."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOTlxaGJnEAE",
            "text": "Get your matcha in the morning, your lunch at noon, then hit it for happy hour. The Buren is the choice spot any time of day. Service is great, cuisine is delicious and prices are affordable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3M3JTS053EAE",
            "text": "Nice experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bnJYOENREAE",
            "text": "Dont Like, many reasons can not describe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidlpESkxREAE",
            "text": "Service is great\nFood is amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNTRUY0hnEAE",
            "text": "One of my favorites Brooklyn cafeteria the have really good quality on everything and the staff it’s really friendly also they play the important sport games"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbmNHeDBnRRAB",
            "text": "Racists? 6/29/24 review.\n\nI want to be clear: the gentleman with the accent working the front bar was EXTREMELY unwelcoming to me, a Black person. He greeted every other customer with enthusiasm and was standoffish. He wouldn’t give me the WiFi until my card cleared as well. Very strange. Disappointed that I spent money here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMZ2RiSEpBEAE",
            "text": "Scottish egg is the best!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNk9qcmh3RRAB",
            "text": "Excellent food and atmosphere.  The owner is great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NGVHY0FREAE",
            "text": "I ate here with my wife and brother in law, the food was horrible and viciously overpriced.  The food left me with a bad case of food poisoning. Wouldn’t recommend this restaurant to my worst enemy!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUbWJtZ2p3RRAB",
            "text": "Amazing!!\nTaco Tuesday karaoke was dope!\nThe Host were amazing!\nThe food didn't miss!\nThe drinks didn't miss!\nHookah didn't miss!\n\nI'll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENVlleENREAE",
            "text": "Fake advertisement of bottomless mimosas.\n\nThey have a sign on the checkout saying “bottomless mimosas for 90 minutes” I went there and 30 minutes in they said it would end in 30 minutes because it reached 3 PM (that’s not what they said on checkout. Be careful, these guys are trying to trick you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeVpQZGNnEAE",
            "text": "Nice quiet spot for breakfast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dXR6Sm5RRRAB",
            "text": "Pretty good! My friends and I were hungry on Sunday and didn't feel like ordering in or travelling very far for lunch, so we decided to check out a local spot. Overall we enjoyed it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxaktMcGlBRRAB",
            "text": "Owner is rude and doesn't value the customers, don't go. Orange juice tastes like water with food additives, and the brioche bun was hard and not soft at all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWbHBYMGhBRRAB",
            "text": "It's a quiet spot, so it's okay if you go by yourself... The waffles are really good!!\nI do recommend it!"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWeW9DN2tBRRAB",
            "text": "Bestes Café in New York!\nEssen mega, Getränke toll und immer nett. Danke George für unseren täglichen Café und die tollen Gerichte.\nPreis-Leistungsverhältnis passt und es ist nicht so überrannt wie in der Stadt selbst.\nA place to enjoy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsdWI2X1FREAE",
            "text": "Love stopping by this place! They have the best sandwiches in the area that come with fresh chips and a seriously delicious homemade hummus. I always order the chicken sandwich when i’m feeling naughty. My only wish is that they stayed open later! Highly recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1bk1YMXJBRRAB",
            "text": "'23/10 1st time customer (from California) & review:\n-- Easy to find on busy corner. That said, no real parking to speak of, so be prepared to bike/walk.\n-- Yes, dog friendly.\n-- Hip music enjoyable, though combo of music and noisy kitchen can be challenging for hearing impared.\n-- Great food.\n-- Wrapped dessert case and jello shots.\n>> Bottom line: give it a try."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwejZHUVl3EAE",
            "text": "Omg!  I just found my new favorite spot for breakfast! The food is high quality!\nI really loved the waffle which was really delicious and nutritious with purple yam, and berries. I’m so happy that I found this place!🤗❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOV9lYmhBRRAB",
            "text": "This place is great! I stop in for coffee in the morning and they’re speedy. I ordered the bacon egg n cheese on a croissant and it is delicious"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtZ2M3aHZnRRAB",
            "text": "Don’t let the photos fool you. Street bodega quality at twice the price. I live around the corner from this place and visited frequently. The dirty Buren will charge $9 for a juice and cut it in half with tap water (photo below). The chicken sandwich is one of those stiff breaded chicken breasts made on Monday and left in the fridge to serve throughout the week. Best to save your money and go somewhere else. This is not really a place to grab a quick coffee or a beverage unless you have cash on hand due to the hefty card limit. Beware that the menu is not as pictured on Google (different prices & dishes), the tables are dirty and the owner is a bulldog, no refunds, no exceptions, deal with it. Good luck. Update: I noticed a comment from the Buren on this post. It is misleading. During my last visit I made several attempts to kindly rectify the fact that the orange juice I was given was clearly half tap water. No amount of stirring would change that fact. Either way, the flavor was heavily diluted or the oranges were expired. The owner/manager began screaming at me when I asked him about the ingredients, I thought there was a simple mistake and it wouldn’t be a problem. He reacted by screaming and was visibly angry, I remained calm and I kindly asked for a refund on the juice or a replacement. He threw me out. This is extortion not customer service. He kept my money and gave me sour tap water with pulp on top. I stand by my original post. Best to avoid this place, there are many great alternatives in Bushwick that will not cut corners to try and cheat you. Stay away."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwc2ZfNWZREAE",
            "text": "Gorgeous place with great food and drinks"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKc0lhUlVREAE",
            "text": "I just didn't like it. Overpriced breakfast Meal. 17.00 for a platter? The server was nice, I just didn't like it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKZ05DT1RnEAE",
            "text": "This is near my son's new apartment and such a great find, good food, service was quick and very friendly"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLWIzaHhBRRAB",
            "text": "They offer filipino rice bowls which I love and its a nice quaint place on this part of Brooklyn. Not crazy expensive too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOV9iTzhnRRAB",
            "text": "Truly a great space to brunch, work, grab a coffee with friends, or grab drink after work. The vibe is just very cozy. The bacon, egg, and cheese was a real winner along with the latte. There are also some great out door both for good weather days. Definitely check it out!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaGJpMFdnEAE",
            "text": "I’m glad they have healthy-ish options on the menu. I came here after working out and it was pretty good. They use just a little bit too much oil, but the quinoa salad was yummy. The advertise that they serve La Colombe coffee, but the iced coffee I got was definitely not La Colombe. It tasted the same as a deli iced coffee. So perhaps only some coffees on their menu are La Colombe. Overall, a nice space with lots of outdoor seating and wheelchair accessible.\n\nEdit: after reading other reviews, it seems my positive experience was abnormal so I have removed a star. I won’t be coming back."
        },
        {
            "date": "수정일: 3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJaHFqc1FREAE",
            "text": "El vecindario ha cambiado mucho , de este lado de Broadway, lo más popular era la tienda de 99 centavos , sólo había terrenos valdios , ahora hay muchos edificios nuevos y con ellos los nuevos negocios, el otro día caminando , vimos a the Buren\nprometimos regresar y aquí estamos , el lugar es muy bonito junto con sus mesas,  sillas y decoración que lo componen, su menú es muy variado, y cierran a las 2 de la mañana, son amables , aunque el servicio tarda muchooo, en mi primera visita pedí un te que estaba muy frío,  yo  tuve que pedir miel o azúcar , ellos no me ofrecieron o indicaron en donde estaba, quiero suponer que era porque estaban ocupados , la comida estaba bastante bien y el pan se sentía fresco , los precios $$$.\nEs sábado en la noche y regrese me tomé un capuchino estaba frío,  pero muy frío,  pensé que la primera vez fue un accidente pero creo que no ."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjc1BYQmRREAE",
            "text": ". It was my first time there and for sure not my last time.\nThe espresso was really good and tasted like an espresso from Europe, with a bitter end and sour.\nI had the Avocado toast - it was good and tasty, but nothing special.\nThe music was super chill and fun and so is the service.\nReally nice spot"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeDdLcGVREAE",
            "text": "I order from here all the time. I love their Greek salad, sandwiches, and acai bowls. The owner is always there, and offers incredible hospitality. This place is a neighborhood gem and too often overlooked."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MS1TV3NnRRAB",
            "text": "Relaxing ambiance, excellent food, great place for coffee in the morning or a drink in the evening. Greek salad with grilled chicken is my go to. Freshly made juices are a plus too. George was very welcoming and remembered us and our order; that just shows you the customer service at this place. We’ve become regulars here!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNveExtSWVREAE",
            "text": "This place is pretty decent, went here with a couple co workers  in the dead of the afternoon. The place had a nice even crowd, good energy, nice comfortable seating a few TVs and small bar, great tasting mamosa a good lunch selection, I had fried eggplant with veggies on top. Was okay.. nothing amazing just a good daytime spot"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyN0szSFJnEAE",
            "text": "This place has the best bagels I have ever had in my life, it was crunchy but also soft, unbelievable! Also the ambiance here is so homey and cozy. Can’t wait to go back"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4cWFQRWFREAE",
            "text": "First time there and did outdoor seating with friends - food and drinks were really good! Definitely will be returning soon"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2cV9hNW1nRRAB",
            "text": "Terrible experience by the server told us we had an hour to leave or he’ll call the cops just because I complained my eggs weren’t cooked. Wouldn’t recommend, as a business owner myself , I recommend them   to over look their employees and correct them."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4ajZIVlRREAE",
            "text": "Nice outdoor dining, my chicken sandwich did take 20+ minutes to arrive and my friends were nearly done with their meals at that point. Drinks were good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2bVB6RE9BEAE",
            "text": "I went to the Buren a few days ago and I'm still bothered by the experience I had. When I went into the cafe, I immediately ordered my food and sat down. I then asked for the wifi because I work from home so I decided to support a cafe in my new neighborhood and get some work done instead of being stuck in my apartment. When I received my greek salad I was told that I can only sit there for an hour. I was very confused because it was noon on a Friday and the cafe was empty (picture attached). Myself and another customer were the only two people in the cafe at the time, so I didn't understand why I would have to leave. I asked her and she said it was COVID protocol. I've never experienced this at a cafe. At restaurants I understood why there were usually a 90 minute sit down limit, which is understandable. I was then asked if I was vaccinated (which I was ,and showed her) but why would you ask me after I already sat and ordered. It's unfortunate because I've ordered from this cafe on uber eats twice already but now I will no longer support this cafe. I really wanted to return my food but instead I still ate it and observed that she didn't say this to anyone else that came into the cafe besides myself. Being a black woman and experiencing a situation like this left a bad taste in my mouth and I will be sure not to return. A piece of advice for the cafe is to have a sign or advise your customers that there is an hour sit down limit prior to them supporting your business."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDX2UzWlpREAE",
            "text": "Very nice, trendy cafe to enjoy an Americano and BEC on a Brioche bun. Incredibly fast service and great staff."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNk5tR1dREAE",
            "text": "Over priced bec. They up charge you for an ok brioche bun. Cold brew was weak. Like total was $13. Not worth it. Walk farther to a better spot."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5aVB1SGFnEAE",
            "text": "Excellent authentic Filipino food and innovative outdoor booths that afford a lot of privacy and protection from the elements. I highly recommend this tapsilog."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXZ3QzNmhnRRAB",
            "text": "6 bucks for a matcha latte ok... But they are cutting corners this latte was mostly oat milk and ice. Then there was a ten dollar card minimum, so I added on a four dollar croissant, that was dense and hard. What a disappointment"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4LVl1aml3RRAB",
            "text": "Solid food and flavors here. The chai tea and fresh juices are tasty. Definitely will stop by when next in Brooklyn."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpMExTWHNnRRAB",
            "text": "High quality lattes ✔️\nNice outdoor seating ✔️\nFriendly staff ✔️\nCreative cocktails ✔️\nAvocado toast & smoothies ✔️✔️"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3Mkt6Q2VREAE",
            "text": "Very cool vibe! Great to work from or have meetings. The bar is open all day and their coffee is great!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLb1A2SmdnRRAB",
            "text": "Over $50 worth of food here.\n\n$13 for acai “bowl” (1st cup on far left). Paid $3 for peanut butter that didn’t come with it.\n\nRip off"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvdS0zRE1BEAE",
            "text": "Super cute place and the owners are lovely, but food is way overpriced and just ... not good. Great coffee though!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJNU1IWWhnRRAB",
            "text": "The place is fairly new and I wandered past it by chance and decided to give it a go. Inside the place feels very welcoming, clean and comfortable.\n\nI was with my family and we ordered a couple of coffees, a donut and fruit bowl. The coffee was great, nice strong americanos. The donut was absolutely massive that I couldn't finish it all. They had a variety of pastries to choose from, as well as a small hot breakfast menu. The fruit bowl was very nice and simple. All fresh fruit cut to order, which was honestly a nice change from some of the other establishments that tend to over prep.\n\nThe staff were very friendly but the place was quite quiet, which was a shame considering how good the service and coffee was."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4N2NEc2tnRRAB",
            "text": "Aesthetically pleasing that’s one reason, interesting latte menu but falls flat when I come to flavor. Customer service was ok manager seemed on edge the whole time me and my partner where there. If you’re not Hispanic you won’t feel too welcome here."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURteElTZXdRRRAB",
            "text": "I like the vibe of The Buren but I can't justify paying $6 for a latte when the service is the way it is. There were plenty of open seats available when I went today, so I picked a larger table. As soon as I had settled in, the employee told me to move to one of the smaller tables. He didn't explain why. The only option with a plug was a small high table, which was wobbly and less comfortable, and when my friend came we didn't have room to comfortably fit our laptops. Another group was also told to move from the larger table they chose, and then they were allowed to move back once they ordered food. If that's the rule then there should be some sort of sign near the tables that says \"reserved for customers ordering food\". There were two larger tables available the entire time I was there, so it's not like I was hurting business by using a larger table. They also randomly close earlier than the posted time, which is annoying especially if you buy a drink and want to sit and work for a couple hours. There are better local options that let you sit anywhere in the cafe (I recommend Cup of Brooklyn on Gates). I won't be coming back anymore.\n\nP.S. After reading that POC customers are asked to leave after an hour, I'm even more disgusted - I am white and have never been asked to leave unless the store was closing. Gross"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJaXRpWkhREAE",
            "text": "This cafe is one of the rare cafe’s in bushwick that has all of the best characteristics. The cafe is very chill & rustic. It’s really clean, kept well, and all of the staff there are very friendly and helpful. Most importantly, the food is…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMmR1S19nRRAB",
            "text": "I have had nothing but good experiences in this place. The staff is nothing but friendly and accommodating.\n\nSure, the food is more bodega-like, and perhaps a little overpriced, but the reason I like this place and I plan on continue to visit is because they offer various drinks I can actually have, not just coffee and not just variations of the same caffeinated drinks."
        }
    ],
    "reviews_count": 72
}