{
    "name": "La Isla",
    "place_id": "ChIJLXOTfxlcwokR721degLQfxQ",
    "grid": "BK4",
    "address": "1439 Myrtle Ave, Brooklyn, NY 11237, USA",
    "rating": 4.3,
    "user_ratings_total": 1450,
    "phone_number": "(718) 417-0668",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWVYzRXdhVkp1V0RaMmVXc3lURXBRT0U5cU1XYxAB",
            "text": "I literally have been sitting here for 15 minutes and other people dont get service or tended to but other people walk to the back and get their orders faster than those who are eating in. HIGHLY UNPROFESSIONAL. They dont acknowledge anyone and it wasn’t busy AT ALL. Fix this service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGME1HTlNPVTFJYldKSGVVUmFZa0prWXpaMlpHYxAB",
            "text": "Reliable and cheap."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeFZVWk1kV1V3T0ZwaVRYRTRSRVpvUmpZMlJXYxAB",
            "text": "This spot gives me my old Brooklyn nostalgia and Puerto Rican food fix. I always get the pernil and rice+beans. Great selection of cuchifritos and juices, too. Bring cash and come hungry."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeU5VZEdNa2Q0TldOaWNuZGtRbmwwYkhkNlkyYxAB",
            "text": "not good i waiting 1 hours"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scFMzRlBZbGhMTVdaUWFHZFdiaTFHU3psdlNYYxAB",
            "text": "I'd been wanting to eat here for ages, and it was worth the wait. The ambiance suggests aims. Warm, inviting, accommodating, qualified. Every dish shows the same level of care. The restaurant has secured our return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJNVNHNVhORnBxWkVkcExXdHdTbGh1VEhWMGRXYxAB",
            "text": "After many years of eating at this restaurant.  The food was dirt.  The new employee {man}cross contaminated all the food using the same dirty food and not cleaning up the cutlery or cutting Board .. tge drinks in machine was fermented and i took the guy.. took my friend to eat and she is very sick from the food .. think 🤔 i should call the Department of health . Hope the owner reads this"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UVJIVXhlbWhaWVdWa2JWaGtTMDF4ZGtkeVFtYxAB",
            "text": "The kitchen here works at a level that deserves recognition. The team was dependably good from beginning to end. The dishes satisfied completely and cost less than expected for such quantity. La Isla serves incredible food. The restaurant surprised me completely."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVldUTjVjVmR1TW5OUlptUndSVEl0Y2pNMGNHYxAB",
            "text": "Food is amazing here. Me and my friend Jeffrey always come here to eat. We love this place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVlJrNVJWbTVpVkd4MmVtMXpVa000Y0VkcU1XYxAB",
            "text": "I have been coming here for over 15 years. I still love it. The empanadas, chicken rice and beans are delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OZlRISldXbUZSWkVad1gxTlVPSGhDTldKdmIxRRAB",
            "text": "Always great comfort food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVNVdrMUVlR1JRYjA5cFlsZEJaRFpKWjAxTGEwRRAB",
            "text": "The location is ideal. The food is amazing and well prepared. You can tell the chefs love cooking and you taste the love in the food. Staff was friendly, precise a d patient with my language barrier. Locals recommend and I do to! Thanks for an amazing meal, every time! 🙏"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xab2RVSnpNR3BoYWxnek16ZGZSV1ZCTFRkV1YzYxAB",
            "text": "The best in town"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMlFqQXplbHBzUlVkdlVIQTRXR1JzWkRFME1IYxAB",
            "text": "Great spot with Quick service. It’s Open 24 hours and the food is always solid. Price is fair too considering all."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaFNFSkxOMjVYU0dob1dVc3RiVzFOVmtKcFgzYxAB",
            "text": "\"I love my Puerto Rican food, but this food does not taste like it. I asked for bacalao, but I got mofongo instead. The alcapurria had about a teaspoon of beef, and the relleno de papa had a teaspoon of beef as well. I am very disappointed!\""
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKamFIUktOVEZaY2pSU04zQm5kbVpVT0hGeGIzYxAB",
            "text": "Buena comida siempre hay que hacer linea"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ST09VWlhOekk1VVZNMllYcE1WbUppUkZodFdGRRAB",
            "text": "Food is very good, I'm a frecuent customer however not even once I've have been or seen people as you walk in and sitting being at least acknowledge specially by a tall woman with a face she doesn't want to be there and a elderly men at the counter, as minutes go by they continued their business with the take out line, and you actually have to call them out or use hand gestures to get their attention, hellooo you are sitting in front of them, sitting service really careless and deficient, there's no ac not even a fan, so when is 80 degrees outside inside feels like a 100 you dripping, also beware of the homeless people at the door begging for change, best its just grab and go."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbXB5NW1BRRAB",
            "text": "Very delicious food 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMGRFOTVUREpPWTJwVE9YZENlSGh3WWpSWVVWRRAB",
            "text": "Alcapurrias and  the rellenos de papas tasted like flour.  There was nothing authentic in them....what a disappointment."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bWVWOVRjRVZZY25kMFdFUktSSE5SVEdSbVEzYxAB",
            "text": "What a waste  People spend your money else where this a dive i bought baclaolitos and man i take them break window with lava rocks i should throw threw back what waste of money the place was nice before"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MWNtZGFTbXhhZG1wVmR6aHJZV1ZhVW5BNVFWRRAB",
            "text": "goated establishment, nothing more to be said . 24 hours it is always there foe you. pro tip they let you mix aguas frescas"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaFYwTkZNazlXTlY5V1psbGxSRUpUVFVFelYyYxAB",
            "text": "Sabor BORICUA en Nueva yol."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVd1psOXdVVUoxYW1WSk1XbzVRbU4yYkZaa2VGRRAB",
            "text": "Me encantó el pernil con arroz y habichuelas"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRFRYcEZMWGN3V1RJelJubE9hbDh3Wm0xcVEyYxAB",
            "text": "If you wanna wait 30 mins to be served food that’s already done it’s great! Terrible wait time good food. It’s literally cooked already and they take years to serve you it’s insane"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTE9UUkhNVkZmYkhwRVNqZGtVR1ozU1hCTFRWRRAB",
            "text": "This spot has gained attention on social media for being a 24-hour go-to with great food—and while that may be true during peak hours, my early morning visit told a different story. The menu was noticeably limited, and the food didn’t seem as fresh as expected. It’s possible that the best time to visit is earlier in the day or during busier hours, as late-night or post-dinner visits might leave you with slim pickings and less appealing options."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pod1lXTktjR1UyUVZsM2NFOW1ibFpIY21WSGRrRRAB",
            "text": "Hay comida las 24 horas,"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VME4zVmtkV2RoU0RCNFNFNXBkMnMwZWtKbk1VRRAB",
            "text": "Food was good the pernil had flavor but certain pieces i was given was a bit dry and no flavor but the rice and beans were great the older guy there had a bit of an attitude when I kept asking what kind of Alcapurria they had overall 4 stars"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVGEwaEpSelZoY3paRmNXcDNlRWhMVnpGUVMxRRAB",
            "text": "Wow the food last night was so good! We came in late around 1AM and there were still so many options to choose from. The guy working the counter was super cool also. Didn’t feel rushed and felt welcoming as a non-Spanish speaker where a lot of restaurants will treat you different if you speak English. But really felt like a local spot that wanted to take care of you.\n\nThe prices are also amazing! A HALF chicken, yellow rice, and beans for $10\n\nIf you’re in the area I HIGGLY recommend giving this place a chance. You won’t be disappointed"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVllWWlpVR1ZST1dJeVVqWnpWbWcxVUVoa1RYYxAB",
            "text": "I had the chicken mofongo, fried yuca and the plantains. The food was incredibly delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbmJWbHJjazFQYWpoMVkzTXhYMGx1T1ZVdFYwRRAB",
            "text": "unimaginable ，Their portions were pitifully small, so I ordered takeout of yellow rice and pig trotter soup for $11 Dollars I can't figure out why ? The pork is so cheap, why do they only give two pieces of meat and a slice of sweet potato in their soup, and never go back"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLajZXdUFnEAE",
            "text": "Take it to go and run 🏃‍♀️ out of their to many ppls in and out and ppls come in there in a rush other than that if u can handle poor service and craY 😜 ppls u can take a chance and dine in on a hard stool.but food is still worth the experience . 😜"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMmF6QnZUalJRVFVKeGVYcGpRelo0WjI1UFpuYxAB",
            "text": "The food here was phenomenal. I initially came in because I saw the high Google rating and I was not let down by the Google reviews. The Pernil with the rice and beans was great. Overall, highly recommend stopping here at this restaurant. Will be coming back again in the future."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOajk3cUMtLU4tTjhnRRAB",
            "text": "Son muy lentos"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKRF8xWWlNNVpxTUN3EAE",
            "text": "The best food in Bushwick! Staff is always courteous and helpful. Come be patient,wait in line, or eat in!! Well worth it, enjoy because I love La Isla\nPS. My go-to caterers"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMGRlV3FBRRAB",
            "text": "Honestly it's a good place to grab a bite if you have time but when it comes to service they are horrendous, been a customer for many years and would honestly say food is alright would go to another place though because of the half an hour wait time just for take out. Honestly would take my business elsewhere 😞"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMFktUHVBRRAB",
            "text": "This place continues to stay consistent throughout a period of time consistent with its flavor serving our comunity,  thank please keep it up , you guys do a great job giving the circumstances of limited space and the current times will continue to review soon again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaS1hU0hREAE",
            "text": "I will definitely ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJek5fUVRREAE",
            "text": "Great feed"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MWRHVnlnRRAB",
            "text": "Trash! Rice was hard, beans were watery, Platano Maduro was hard boneless chicken was burnt. Not to mention no silverware or napkins.... Never again. Total waste of my money and I'm left hungry."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc3UtclpnEAE",
            "text": "One of my favorite places for blood sausage, alcapurrias and juices."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OFBMdGlBRRAB",
            "text": "Steak was uncooked the chef was laughing about it server offered to fix it I didn't trust the chef to do better and it was already a 20 minute wait. I wouldn't blame anyone either. I was so hungry and waited with. Friend for a while for a disappointment so uncomfortable and awful from the moment I came in I was being looked at weird and had to ask for help multiple times and even go out my way for someone to notice me when I'm next in line the food was awful they have my friend a bad piece of chicken and it wasn't tasting old and it was weird looking chicken. Sad"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NFBQZmJnEAE",
            "text": "I forgot to take pictures before devouring it. I went twice in the same day lmao. The food is delicious and plentiful. Enough to share or eat twice. And the service is quick, professional, and kind."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnamZxWFJBEAE",
            "text": "Ordered seafood mofongo, i ended up tossing it in the garbage"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBN3FMUE93EAE",
            "text": "Decent Puerto-Rican food open 24/7, however sometimes there are sketchy people hanging out there."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbzVhenBBRRAB",
            "text": "Delicious sancocho!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycDRQNXJRRRAB",
            "text": "The pics aren’t very good but! This was the best comfort food to get delivered. We got a special that came with ribs, rice and beans and salad that we split. The beans are off the chain! I probably would have been happy with just the rice and beans they were so flavorful but the ribs were tender and tasty - not over seasoned so I used a little hot sauce because I’m a salt freak but they’re great on their own. Their soup was truly a delight - I got their house soup they had that day which was like a stew with big pieces of chicken, carrot and potato. The broth was so savory and silky with a nice amount of lime or some citrus making it extra flavorful. Last but not least - their chicken pastelillos were insanely tasty and you should order extra in case someone tries to eat yours… because they will."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYc0xiTldBEAE",
            "text": "Convenient location right next to the subway. Very casual- everyone sits at the bar or take-out, there isn’t any table service. The service was good and the food had great prices. Haven’t tried their fruit juice but it looks popular. Atmosphere was nice, the inside is clean.\n\nI had the shrimp mofongo. It was fresh, came out hot and with a side salad which was nice and refreshing. It also came with a side of sauce to add. A lot of food, I came close to finishing it all. I like that all mofongo options come with pork regardless of which protein you pick. Sometimes that’s hard to find, but I found the pork pieces throughout the mofongo were either not fresh or just not prepared properly like chicharron (crispy). Nonetheless, the flavor was good, not sure if there was any actual shrimp throughout the mofongo, just on the side. If I return I’d like to try the chicken mofongo. My food was prepared surprisingly quick, this is a busy spot. But, many of the options are already pre-prepared."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeU1tSjl3RRAB",
            "text": "This is \"buen sabor\" good flavor.i had the mondongo soup (tripe) with white rice.plus an alcapurria.the soup was well seasoned and tops most other spots. 230 am we pulled up at LA Isla for some excellent dine in food.the place is clean and smells good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eF83UlJnEAE",
            "text": "Rico Rico Rico! Hands down the Best Puerto Rican food in Brooklyn and Probably the Whole City. If you want Flavorful Authentic Island Food come here. This Place will have you craving it and not only that the prices are phenomenal.\nRice, pernil, chicken, Pastillo, relleno de papa, alcapuria 10/10 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cXN5cUlnEAE",
            "text": "This place is not what it used to be like about seven years ago or 10 years ago. For those of us that have been around the block for very long time know that they’re known for their arcapuria, Bacaladahitos and other finger food.( if you know you know) ! Today mannnn I spot by to get a taste of the good old days ! Those finger food was drenched in oil, you couldn’t even taste the flavor. You only tasted the oil which defeats the purpose The plastic bag, they usually give you the finger foods was full of oil.  I don’t who’s cooking back there but we need some Puerto Rican seasoning and soul put into these finger foods for those who know what I’m talking about to bring back those memories of our youths ."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRLThTRVJREAE",
            "text": "Love this long time, beloved neighborhood latin \"cuchifritos\" style joint. Food usually fast, fresh and always authentic at an affordable price. Not gourmet fare, just delicious and satisfying. Staff always busy and usually great. Frequently a short wait, but worth it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5dHI3SlpnEAE",
            "text": "Cash only. They don’t take credit cards. Juice is fake. Alcapurias are really good. Empanadas are greasy and very little meat. Not impressed even for the area."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZMHZMM0ZREAE",
            "text": "I can't express to you how great this place is. Super cheap authentic Spanish food & it's open 24/7. You should really just stop reading this review & get a plate. Only con is it's cash only."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBejhTMUVBEAE",
            "text": "I almost don't even want to post cause it was so good and I don't want more people coming in. 6.50 for a big bowl of stew plus a huge plate of hot rice and beans. Im little so I ate half which meant I just got lunch for tomorrow too. I loved the service and the food was just freaking bomb."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNneXRDc1lREAE",
            "text": "It offers the best Puerto Rican cuisine in Brooklyn period. Food is cooked fresh daily.. best cuchifrito spot thus far .."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2N1piblNREAE",
            "text": "This is my second time coming here, and I am beyond disappointed. The service was absolutely terrible. I decided to dine indoors for the first time, and for 10-15 minutes, I was completely ignored while sitting there waiting. No one brought me a menu, and when someone finally acknowledged me, they didn’t even bother—they just asked, \"What do you want?\" with no effort whatsoever. The food is okay, but honestly, the experience has ruined it for me. This is unacceptable, and I doubt I’ll be coming back."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBenNyeWVBEAE",
            "text": "Un lugar  delicioso con personal muy amable y eficiente  comimos la cena y tuvimos que volver para el desayuno  😁…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dlBxY3hnRRAB",
            "text": "It’s not what it used to be years ago. Their  frituras are tasteless and stale. The filling of the alcapurrias and empanadas are black and have a weird taste like artificial meat. We got sick from them. I dont advise anyone to buy from there at least me and my family will never step a foot in that place again. This is nothing like authentic Puerto Rican food . For some great tasting alcapurrias and empanadas go to the marketa in Graham."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMVotY3F3RRAB",
            "text": "A huge disappointment the food was horrible. I ordered pastels, and I ended up getting pastels from a cook is not Puerto Rican for sure and the cook doesn't know what the ingrediencies is apparently. The pastels had a nasty smell when you take that first bite.  I mean horrible!! Puerto Rican Pastels is what I ordered and got something else. Horrible. The smell and the first bite of the pastel and the meat I think wasn't fully cooked. Im sick This was a waste of my money! awful. Never again. Learn how to make Puerto Rican pastels."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldXNqQ0NREAE",
            "text": "Me encanta la comida se parece mucho a 🇩🇴🇩🇴🇩🇴… es la segunda vez que voy a este lugar muy eficientes!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjX0k3dVR3EAE",
            "text": "I love the food from here. Always so good 😊👍🏼…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMweXBLVHdBRRAB",
            "text": "Amazing dominican food for an extremely great price. The waitress there was especially nice too. Service was better than some other fancy restaurants. Overall, great experience, even if you are not famillar with the cusine."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNWN1T2pBRRAB",
            "text": "Not only did the food smell bad, it had me throwing up the next morning. Now I feel like I have food poisoning.. don't risk your health here, go to qdobas across the street."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudU9ybDBBRRAB",
            "text": "This place has undergone remarkable changes and is truly a part of local history. My father-in-law, a Puerto Rican, grew up in the neighborhood and gave us a fascinating history lesson. As an Asian, I fell in love with the food—it opened the door to a vibrant cultural experience. Brooklyn is home to some amazing spots, and this is definitely one of them. We used to drive by at night, drawn in by the inviting energy.\nThe staff here is fantastic—polite and helpful. Although I don’t speak Spanish, I’ve learned the names of the dishes. The Sopa de Pollo, Sopa de Salchicha, Arroz Blanco, and Alcapuria are all excellent choices. Eating here feels like coming home, as the food evokes memories without needing to know the full history.\n\nI encourage you to stop by and be patient with the line; it’s a testament to how amazing the food is. Enjoy the neighborhood, and take a moment to sit down and savor the experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeFBubFVBEAE",
            "text": "Very small place and gets crowded, but the food is awesome. I always take mine to go, and I try to phone the order ahead of time. There is no place to park your car except crowded streets, so it always helps to have someone with you to stand by while you go in and get some of their awesome tropical flavors of juice. The coco flavor is great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeVplSThnRRAB",
            "text": "Tried to get pollo but they weren't ready/out of stock. Order pernil and bacalaitos instead. Pernil came with quite generous portion of rice and beans. Both tasted great, can't complain with the prices of both items. Dine in can be super hot in the summer."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfXzd1YUtnEAE",
            "text": "I grew up eating here and I can definitely tell you the food here is different and not made by a Puerto  Rican. The only things that taste the same are the drinks (Thank god for that)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwM2FmdUp3EAE",
            "text": "Usually, during weekends, if not holidays, there's literally a line outside of this place like they were selling concert tickets on a busy strip. It has a home cooked traditional atmosphere where the portions are large with respected pricing. My \"go to\" place if I wanted to share my order with someone or if I'm extremely hungry and haven't eaten all day."
        }
    ],
    "reviews_count": 67
}