{
    "name": "A-un Brooklyn",
    "place_id": "ChIJF-b7DGRdwokRQ86k2XAopKk",
    "grid": "BK4",
    "address": "156 Knickerbocker Ave, Brooklyn, NY 11237, USA",
    "rating": 4.8,
    "user_ratings_total": 245,
    "phone_number": "(718) 678-6628",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRk9XUnVWbmxEUXpGdFpUQktlazUyU1ZCWlZWRRAB",
            "text": "This place is absolutely amazing. Every dish is so authentic and the fish is so fresh, I could not recommend it more!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NVdVOXpWMjB6Um5sdkxYZ3hVMmx5YVRaT1MwRRAB",
            "text": "The food was phenomenal!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcVdsbEZia3BsUVZWamJ6ZDZZeko2Wm0xSFZHYxAB",
            "text": "💗"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JelZIQjJTMFpqYm1kME5GSmFaVXRyTlU1bWMxRRAB",
            "text": "Great value, great food, great service. Bushwick gem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa1QxTm1UekZZVVU4dGVIaHdOblowT1MxSUxWRRAB",
            "text": "The food here is incredible - some of the best Japanese food in Brooklyn. However, the service can be quite slow depending on the night and the menus are a bit complicated to understand at first. There is a lot going on in the menu and the formatting is not consistent which leads to a lot of back & forth when navigating the menu.\n\nThe first time I visited last year there were absolutely no issues and I had a fantastic experience. However when I visited again a few weeks ago, I had to wait over 20-30 minutes just to place my food order and another 15-20 minutes for the food to arrive (but this is understandable given it is a small kitchen dealing with many orders).\n\nThe restaurant was busy but there were still several empty tables, but there was only 1 server. The server helped me to my seat quickly, but then started cleaning and doing other random tasks and chatting with others for a long time before even coming to me to ask me what I would like to order. Maybe it was just busier night than usual or this server was a new hire, but it was quite frustrating having to sit and wait for so long before even getting to place my order. The server seemed to be more concerned with cleaning tables for potential customers (who did not even show up) instead of the paying customer waiting right in front of him for so long. I even saw another customer literally have to get up from her table and walk up to the server to ask him to come to their table and place their order.\n\nAnyways, the food was still really incredible and I had no issues once it came out, but the server seems to have completely different priorities instead of the paying customers who are actually at the restaurant. Maybe if he had some more assistance or if I came on another slow night he would not be so unfocused. But to his credit, he was apologetic about the wait at the end once I paid my bill.\n\nI would definitely recommend the food here (the Veg Croquette Curry, Fried Garlic Chicken, and Chilled Ramen were fantastic), but this is not a place for a casual dinner as you will likely spend over an hour here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdFRteENTME51V0hwWmJHZDFjMHRzT1c5VU0wRRAB",
            "text": "Simply delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MGRXVXhNQzE0VTJ0blYySTNZbk5CT1VoaVRVRRAB",
            "text": "You guys don’t have your takoyaki on Grubhub 😭"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsS1RXY3lORE5qVTBRMWNFOWhjVGhxZUZKaVJFRRAB",
            "text": "Food was so authentic.  It took me back to some of my favorite spots on St. Marks back when Japanese Restaurants were kind of hole in the wallish and actually owned and prepared by Japanese.  Tonkatsu was super crispy and moist.  Udon was clean with a true Japanese flavor not flavor packet garbage some restaurants are passing off these days. The curry udon was amazing.  Chirashi was delicate, flavorful and fresh.  Great staff.  Loved it all.  Will be back and soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eVltVTRTRWhRYjBzeFNXZ3dOMVJmV2tWTlUzYxAB",
            "text": "The best japanese curry I’ve had in NYC, maybe even the USA. Just get it - you won’t regret it. It’s so good that I don’t want it to end 😂 It has me scraping the plate clean - I would pick the plate up and lick it if it was more socially acceptable LOL. The fried oyster bao is also sooo good. They’re really good at frying things perfectly here. The service is very sweet and friendly and the atmosphere is cozy. They also have a nice selection of drinks too - the rice lager is super easy to drink and refreshing. Haven’t had anything I didn’t like on the menu thus far!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaa2VsUjJjbFU1YTFOcWVEbGpURlk0UTNSVU5WRRAB",
            "text": "So so so good! This has become my go to neighborhood spot! High quality fresh sushi, incredible saki selection, great service and sweet little touches that make you feel like you’re in Japan. This place is a Bushwick gem!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RmMyTjBZbkpZWkhOYVNFMDVkMlZtTWtRMWJsRRAB",
            "text": "This place doesn't make sense. I walked right in, got two amazing and inventive steamed buns (including a fried oyster bun with spicy sauce that blew my wig off,) a Sapporo, and two shots of delicious locally-made sake, in a serene and quiet unpretentious atmosphere with wonderfully warm service..... For $30.\nIn Bushwick.\nHelp me make that make sense. I cannot WAIT to get back here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVzdsc1RZXzRlZ1d3EAE",
            "text": "Such a delicious place! Neighborhood gym. Don’t skip out on this spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPNi1tNDJ0a2YySjlBRRAB",
            "text": "Diverse menu, really good and affordable"
        },
        {
            "date": "5달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKNkp3NEtYa1AzUF9BRRAB",
            "text": "ワインソムリエの資格を持ち、長らくレストランビジネスに携わるオーナーと、名店での実績もある料理長が手がけるおすすめのお店です。"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLM290Y09Zbk9qQWpBRRAB",
            "text": "It's such a nice little spot, the perfect combination of Japanese classics and some more unique little dishes. Mix and match to make your own little entourage.\nThey also have some surprising gluten free options! Like the Japanese fried chicken(kaarage)."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZUUyNldqbE9UMVFREAE",
            "text": "thoughtfully prepared authentic Japanese food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQN2l2WTNGd00zNUh3EAE",
            "text": "Excellent food with an expansive menu!"
        },
        {
            "date": "6달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdkxld0NBEAE",
            "text": "Bubumla sushi yedik burada. Shrimp tempura muhteşemdi."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveXBPOFBnEAE",
            "text": "Nice and cozy. The food was good. Nothing special. The drinks were tasty, but there’s no hard liquor. Mainly sake. I’d go again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaGRQb1VnEAE",
            "text": "Favorite sushi in the neighborhood, and the miso soup is perfection"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJZzZIS2xnRRAB",
            "text": "Excelente restaurante de comida japonesa. Pequeño, silencioso, ideal para familia o pareja, o simplemente platicar durante la comida.\nSushi pequeño, pero de buena calidad. El ramen delicioso."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdFB5Z3NnRRAB",
            "text": "Great service and delicious food. Would definitely go there again 😊"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN19EQ3BRRRAB",
            "text": "Cozy little place to sample all different sakes! The garlic chicken wings on the seasonal menu are SO GOOD"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncEthSmRBEAE",
            "text": "Great sushi. Mellow vibe. Exactly what I wanted."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcmZmX3lRRRAB",
            "text": "Super chill and very delicious"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2a0tlT2NREAE",
            "text": "I got the shrimp tempura udon and it was delicious!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OHVXaGd3RRAB",
            "text": "Just ordered rolls, they were good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LUlxeGNREAE",
            "text": "it was super cozy, the staff was friendly. udon was delish and edamame was salty."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaXE3bGpBRRAB",
            "text": "Wonderful experience! The dishware is cute. The eel & avocado cooked sushi roll is amazing, as is the fried garlic chicken appetizer. Totally recommend!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdm9ESGR3EAE",
            "text": "Japanese curry is one of my favorite foods and I feel like it’s hard to get it just right - but A-un does! Their curry is the perfect thickness and spice level, and they give you plenty so you are’t left with more rice than curry. Seriously, the best I’ve had in NY and at a great price point with excellent service and ambience! Definitely returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeE1XRkRBEAE",
            "text": "The food here is incredible. Definitely comparable to Japan, good portions, high quality fish and affordable!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYajdYbXNBRRAB",
            "text": "Very good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeGF1dzBRRRAB",
            "text": "Amazing!  Feels like a small great delicious place you’d find in Japan!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNYbDdrbBAB",
            "text": "Outstanding. A gem of a place. The garlic eggplant appetizer was incredible; the curry rice sublime."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOXE3Nl9RRRAB",
            "text": "Small great place\nMy place when I want the real deal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaThYTGZREAE",
            "text": "Everything I’ve had here has been incredible but I especially love the sashimi."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMUwyQkFnEAE",
            "text": "Their food is incredibly good, fast, and reasonably priced. 10/10 will visit again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dFlfRUdnEAE",
            "text": "Service was great, food was delicious, great options. I got the chashu udon and it was excellent. The broth was a little too sweet for my liking, but the pork was tender and the noodles texture was good. I enjoyed it despite not loving the broth. The miso soup was also pretty dang good. My friend got the wagyu curry and she enjoyed it. Afterwards we got a desert… tea jelly…? Anyway, it was tasty <3"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieDZLWmF3EAE",
            "text": "Best unagi Ives had since living in Japan. Also the seaweed salad was fantastic. Would highly recommend, they know what they’re doing."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkcUx5QmlnRRAB",
            "text": "The food is top notch japanese taste. Brought me back to my japan memories.\n\nThe pork curry was amazing to taste and the sushi was refreshing. Slightly pricey sushi but I think that’s the general costs for having good sushi!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiM0ppcFVREAE",
            "text": "Wonderful hidden gem. Our waiter, Jorge, was absolutely amazing and gave the best sake pairing recommendations."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiLVBTaURREAE",
            "text": "Ridiculously loud, couldn’t hear myself think. male server had no idea what he was doing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNDh1U0RnEAE",
            "text": "HAD A BATHROOM THANK U SM 😭😭"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyLVBELUhnEAE",
            "text": "I have walked past this place a thousand times and did not expect it to be a culinary destination. The chef truly impressed and the whole place was understated for the quality of food we got. Also, I was a sushi chef for a couple of years so I'm not so easily impressed"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaeEx6aEZ3EAE",
            "text": "Excellent sushi, sashimi, ramen, service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMZzdEVlpnEAE",
            "text": "An instant favorite from the first bite!!! We tried the Corn Agedashi, Wagyu Beef and shishito pepper bowl, Wagyu bun, and pork bun. The Corn Agedashi was beautifully presented and had a creamy texture with a great mix of flavors and textures. It's tucked away and the exterior is unassuming, but the food was surprisingly impressive. The Wagyu beef stole the show — so tender and flavorful, with just the right balance of savory and sweet. The fluffy rice, pickled veggies, and peppers made this one of the best I've had around here. Don't be fooled by the low key decor; you're in for a delicious meal that's clearly made with a lot of care and attention."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbzV6aFN3EAE",
            "text": "The brunch bento box was a treasure box of gastronomical gems.  You get a variety of texture and taste with delectable side dish of egg, salmon roe, and delicately fried vegetable alongside with the main entry.  The owner was attentive and gracious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6Z3ViV3pRRRAB",
            "text": "This restaurant is amazing. Japanese owned. Hiyashi chuka and agedashidofu were SO good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcVBPazRnRRAB",
            "text": "Everything was excellent. The katsu with curry and sushi and matcha IPA were on point!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUXzdIYXVnRRAB",
            "text": "Not going to mention service and give them benefit of the doubt because maybe they were short staffed and our waitress was kind. I'll also say the wagyu beef dish was decent and the most enjoyable part of the meal. Next, I ordered a sashimi appetizer which came with 3 different cuts of fish which didn't taste very fresh and the tuna was almost mushy. The crunchy salmon roll was my other dish and it felt very lazy as it is just a salmon roll with spicy mayo next to the roll topped with tempura flakes, and basically only finished it because I was starving.\nI was excited to eat here from seeing the reviews but i probably won't be coming back. If you do eat here, i recommend getting anything other than sashimi."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoanBMQlNBEAE",
            "text": "Enjoyed every dish here. The pork buns were very memorable I like that it doesn't rely too much on sauce. Shishito peppers were exceptional. Enjoyed our rolls and junmai! Service takes a hot minute though, but an otherwise great experience. Will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OTlYLWR3EAE",
            "text": "A-un was fantastic! From the service to the food, everything was authentic and amazing. We got a sake sampler to start and it was fun to try. For appetizers we got the vegetable tempura and karage (fried chicken). The vegetable tempura had many varieties.\nFor our main, we had the chilled ramen and the sushimi chirashi box. The chilled ramen is cold and soupless but the sauce it was in was really good! It's the perfect summer food without the hot soup. The chirashi box had really fresh fish and even real wasabi?\nOverall, this place had amazing food and very authentic."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OHA3MU9BEAE",
            "text": "TLDR: decent Japanese food, but wouldn’t recommend to a friend as it was sub-par at best, not to mention the slow service and sticky humid and seemingly dead interior\n\nTakoyaki: 7/10 - slightly chewier than other takoyaki I’ve tried, lacked crispness on the outside but the quality of the fish inside was good as it tasted fresh\n\nSashimi “chairashi” box: 4/10 - for this price point, I would’ve expected better quality fish. I’ve had grocery store sushi that tasted better than this. However the salmon roe and salmon pieces were decent (the 4 points)\n\nShrimp tempura udon: 5/10 - nothing special here, thought that the outer coating of the shrimp tempura lacked crunch\n\nCorn agedashi: 9/10 - the only dish worth trying. Liked the corn pieces as they were very crunchy and delicious. The corn batter tasted like fluffy egg almost and was quite delicious!\n\nService: The workers seemed very kind and like they cared, however that didn’t translate to the best service. One of the servers brought us the wrong dish, and then proceeded to give the same dish (after setting it on our table) to the other table. Observing other tables, dishes would be left on the table for a long amount of time, preventing other customers from being seated. They loaded the dishes clumsily, and I saw silverware, napkins, etc. fall at least 2-3 times during the duration of the dinner. It also seemed like there was no hostess and one of the guys working was at the bar and waiting tables. If there was more time invested into the service that would make this restaurant more enjoyable experience. But because the service is so bad for this price point, I wouldn’t recommend it to a friend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNTluRkFREAE",
            "text": "This place was good. Prices were fair if not below the average. The service was quick and it was very clean. The only issue is during the week they are only open for 4 hours so weekday dinning can be tough. It’s worth it if you do catch them though. We had the buns, the udon noodles, and sushi all of which were great at or above expectations."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkaTZPaE1BEAE",
            "text": "The restaurant itself is a bit bare boned, but oddly it reminded me of Japan. It was quite empty, and it seemed like they do more with online/take out orders. Server was nice, but a bit pushy with sake and specials. Food was pretty good; we enjoyed the shishito peppers and garlic karaage as starters. Tonkatsu Ramen was great and sushi tasted fresh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcWM2YUJnEAE",
            "text": "For a low-key izakaya homie spot in bushwick, this is the spot. Simple decor with some art hung, this place is nice and cozy for a date night, or small gathering of friends (max 4).\n\nThe food is great, with a homier feel than other places that may try a bit harder. The wagyu bbq beef bun was flavorful melt in your mouth meat, and the spicy curry ramen hit the spot without being too salty but with some mild heat that kept me wanting more. The garlic chicken was also nice and juicy. Sake prices were reasonable with some local breweries included.\n\nStaff was friendly and bathroom clean.\n\nSad no matcha pudding, but will be back to try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNC1YcDlRRRAB",
            "text": "I tried their omakase \"kaiseki\" course. You need to make a reservation in advance by email or phone. The first dish was seasonal fruit and tofu with sesame paste.  When this dish was served, I could sense the uniquely Japanese culture of enjoying seasonal ingredients. The second dish, Uni Lover with Osetra caviar, was fantastic: fresh uni from Maine and caviar with homemade uni chips and sauce were so wonderful together that I can't wait to come back for more. Tempura of lotus root, fluke, and sea eel were served one by one, and I was impressed by their attentive service and freshly fried tempura. The main course was turkey egg omelet with black truffle & grilled black cod. The main menu is said to change with the seasons. It was also nice to have authentic \"Chawanmushi” in Brooklyn. The last dessert, green tea matcha pudding, was handmade by a tea ceremony master.\nI have been to other sushi omakase restaurants in New York, but this was different. You can experience an authentic Japanese omakase course in Brooklyn. The menu seems to change with the seasons, so I will definitely come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabVBfX3pnRRAB",
            "text": "The food is delicious. I had the kitsune udon soup- there were layers of flavor in the broth alone. The tea was fresh, the fried oyster bun was so good & everything had a beautiful presentation. The bathroom is exceptionally clean & it's not too loud inside. Service is polite & quick. I came from out of town & it was such a gift to stop here to get out of the rain."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0b1pUTF9RRRAB",
            "text": "Warm, cozy restaurant with delicious food. My son and I enjoyed everything. The curry has a smooth, slow burn. I'll be visiting again sometime with the rest of my family."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadUlid1B3EAE",
            "text": "My friend and I were in the area and decided to stop in. The waiter was nice, and the place was cozy. The food is okay, nothing to write home about. I had yellowtail roll, spicy salmon roll, eel and avocado roll, and spicy tuna roll. My friend had the lunch bento box with salmon. She enjoyed it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbWFxVTVBRRAB",
            "text": "Such a great Japanese spot in the neighborhood! Been here multiple times and never disappointed. They have everything ranging from high end tasting dishes to super affordable sushi rolls. Great sake selection too – definitely recommend the $18 for 3 shots sampler."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyel9tSkpREAE",
            "text": "I couldn’t help writing this review. The best Japanese bar ever!!! The chef was chosen as one of the 5 best New York chefs and the bartender is the expert of sake and other liquors. The food is great, so many kinds of rare liquor, you can have the best experience here. I highly recommend a-in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsd2NiZmJ3EAE",
            "text": "In the area looking for ramen, I found this spot that does sushi and udon. They also do tonkotsu ramen! I ordered a bowl  with extra chashu, and a beer. Everything was delicious! My total was $26 before tip. Would definitely come again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdGEyMjZBRRAB",
            "text": "Excellent shrimp tempura udon - all components of it were well done. The shrimp was done exactly as I love it - not in the slightest bit overcooked. The matcha pudding had great textures and flavors and was also pretty. Attention to detail and perfection was seen and tasted in both dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0OTZHZW13RRAB",
            "text": "I was tired and wanted a nice meal and was pleasantly surprised by this restaurant! The food was amazing, good price, nice service, good atmosphere. I would highly recommend it! I ate the salmon roll, spice salmon crunchy and shrimp tempura."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoM19tRmRnEAE",
            "text": "A Special Forces Master Seargent  once told me, “we do basic stuff, we just do it really well.” The menu here is mostly all the usual suspects from the realm of American Japanese restaurants, but the execution is high level. Real wasabi,…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MVB1cjhBRRAB",
            "text": "The food's very affordable, and the quality is exceptional.  I got katsudon with a side of curry, and a spicy crunchy tuna roll that I ate too fast to take a picture of.  They were all exceptional, especially for the price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaktIZ21nRRAB",
            "text": "Was in Brooklyn last weekend and stopped by this place twice. Service is top notch and sushi was great. Almost any sake you can order hot and they'll heat it for you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dDhMTGNnEAE",
            "text": "Can’t believe this was my first time trying this place in my neighborhood. Restaurant is tiny and quaint. My friend and I sat down at the bar for dinner on a Saturday evening. They have a wonderful sake selection and do a good job of describing the flavors of the different sakes on their menu. It was really fun to try different types!\n\nFor dinner I got a BBQ Wagyu bao bun as an appetizer and the charishi box for my main meal. Both items were so delicious. The sashimi was excellent quality and super flavorful. I was watching the server bring out the soups to other customers and they looked so good. I definitely will be back to try it.\n\nOnly complaint was that service was a little slow. We weren’t really in a rush so it didn’t affect us. This is definitely a more laid back restaurant. Just something to keep in mind."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSazh5YTh3RRAB",
            "text": "It was my first time to try this Japanese restaurant in Brooklyn and I found it incredibly unique. As an aperitive, I tried chocolate flavored sake which was not sweet but with strong flavor of chocolate. Sashimi was very fresh and delicious accompanied by traditional plain sake. As side dish, I tried shishito peppers and octopus' skewer which tastes like Japanese \"oden\". I regret that I did not try the soup which should have broth coming from octopus as well as sausage. Next time I will try it and other dishes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcnN6d2x3RRAB",
            "text": "Clean and elegantly simple restaurant. I tried their sushi platter and miso soup (picture attached) as well as their chicken bun. All of it was extremely good. Washed it down with a beer and some sake. The staff there is very quick, attentive, and pleasant. Very quiet inside, I don’t even think they play music so you can focus on the food. I can’t wait to go again soon!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlLUlhZVVREAE",
            "text": "Amazing experience here on a Monday night, table for two, around 9p . My girlfriend and I ordered a miso soup, fried shrimp and vegetable tempura, and the a-un sushi box. Everything was delicious. Made with care, professionalism, quality…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydDRHYVNnEAE",
            "text": "This is my 4th visit, i truly love this place. All the Food is consistently delicious! Here’s some pics from my last visit. And today im having Ramen and Gyoza."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtNjRMOXpBRRAB",
            "text": "Just look at that ramen broth 😍\nWe had a great time here; really cozy atmosphere and great food. Really glad to have an authentic, high quality Japanese restaurant in this area.\nThey have a cool selection of drinks for the bar too.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyeExENzFBRRAB",
            "text": "Delicious food! Sushi tasted super fresh and the yakitori was juicy and flavorful. Chef/staff very friendly and fast. Presentation was beautiful too. Will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZzlQejRBRRAB",
            "text": "An absolutely wonderful dining experience. The ambiance was nice - minimalist Japanese decor, wood tones, and music that you didn't have to scream over. The food was excellent and not too pricey. I went with a group and we ordered a bottle of sake which came to us in a large ice dispenser for the table which was a surprise and delight (not to mention we got to pick out unique sake cups for ourselves). The wait staff was friendly and informative. Will definitely be returning"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aXV2QzZRRRAB",
            "text": "Food was decent and fairly priced. But if I be honest the service was super slow and the atmosphere felt so dead. Maybe I’ll make take-outs and instead of dining."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREXzR5OFBREAE",
            "text": "I happen to be walking in that area of Bushwick and was hungry so figured I'd check out some of the food establishments down that way as I'm usually not down over there anymore. This place was a pleasant surprise. Small welcoming place. I was greeted by two servers that were two of the nicest people I've ever met. I love Japanese food but unfortunately have some food allergies that prevent me from fully enjoying it. So I have to ask lots of questions. They help me navigate the menu and find something enjoyable that I could eat and showed genuine concern. Everything very authentic. Very fresh . They're a little pricey but portions were well worth the price. Excellent place to go on a date, with a small group or on your own. I will gladly wander my way down to that end of Bushwick to dine at their establishment again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMy1iTkRBEAE",
            "text": "Absolutely fantastic experience start to finish. Easily some of the best dumplings and sushi rolls I’ve had in a very long time, and the sake selection was exquisite. The immaculate restaurant and charming server ( who was the owner!) made it a perfect evening. Right down to choosing our own sake glasses from a cute box, felt very Indiana Jones and the holy grail moment. Definitely going back to try more items."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMi1iZFNnEAE",
            "text": "It's a perfect low key local Japanese spot with excellent food, charming touches, and good service!\n\nWe loved the Agedeshi Corn, Chashu Pork Bun, Garlic Eggplant, Spicy Crunchy Tuna Roll & Mushroom Tempura Roll. Great sake selection and you get to pick your sake cup! Reasonable prices! Fresh and high quality ingredients! Loved it! will def return!"
        }
    ],
    "reviews_count": 80
}