{
    "name": "Father Knows Best",
    "place_id": "ChIJwZHjAzxcwokROh4zFWUlWlE",
    "grid": "BK4",
    "address": "611 A, 611A Wilson Ave, Brooklyn, NY 11207, USA",
    "rating": 4.5,
    "user_ratings_total": 1182,
    "phone_number": "(718) 975-6840",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWk1VWnZMVVUyWW1sUGRuTTFWMFpFUTBabmNYYxAB",
            "text": "Amaaazinggg food, drinks, and service. I bring friends and family from out of town here and they always enjoy it. I come here to do work during the daytime and the food/drinks always hit. Service is always great as well, especially Jim and Benji always a great time with them!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NGFIQlNabVUyY1dST1NDMVdWVlJwUWpONlNrRRAB",
            "text": "The happiest place on earth!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRVNEaDRkbTUwUTJSd2NqVnNWSEpaWVhreWFFRRAB",
            "text": "Best spot in bushwick! Great food. Amazing service. Free wifi."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUmFqbFNRWEZvV25wWmFrMVFSVk5LZW5wNlJIYxAB",
            "text": "Food was okay but the service was so bad. Everyone always looks hungover lol"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kZk1IVk9jVUY0VG14d1puZGFkRUppTTI1a1dFRRAB",
            "text": "Good"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MFl1aWNBEAE",
            "text": "Neighborhood spot for the day and night.  Nice backward patio. Friendly but  untrained staff. Shotty service. Seems like it needs better management."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSWFVUkRPR0V6TFRsU1JTMXdlQzAyWTBkQ1pYYxAB",
            "text": "My favorite place to host parties! Always a breeze!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WmFWWjJVVEJ6YmpKMFVHMVdibU01VFUxUVZGRRAB",
            "text": "Favorite local place for coffee, food, and even a quick beer in the evening. Lots of themed nights throughout the week. Some outdoor seating in the back with cool mural art on the walls.\n\nThe staff is always attentive, and very allergy-conscious (I have a peanut allergy). The fried chicken sandwich is one of my favorites. And the grilled cheese and tomato soup is essential."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VWMzZExjbXAxYm5BM1dHUkRjMWhLUjJGcFlsRRAB",
            "text": "Delicious drinks! Super taste tomato soup and grilled cheese! The bar staff were very friendly!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdWJuRkpVR1JKZFVOZlVWOWxjSFpKZFVsWVVWRRAB",
            "text": "very disappointed with the bartender there. incredibly rude and has believes he's god whenever he's bartender.\n\nthe food is cheap but i would rather spend and extra 2 dollars for an actual good burger"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKZmR6UjVRbEJKTkdKc2VYcHliMmxUU1UxT1VHYxAB",
            "text": "awful bartender. threw my of-age friends drink out and accused him of being underaged even though he showed his id. classic middle aged bartender power tripping. avoid this place. overpriced dry burger too"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdVkxWkZka2hOUzNWclQzWkhMVU4yYVV0U2JFRRAB",
            "text": "The music was too loud. Open mic night I think but everything else was 🔥! Going back soon"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWU0zUXliM1JoVGkwd1dYZHhTbnB2VFRCRExXYxAB",
            "text": "The food was reeeally good! We got the “dad’s breakfast,” the “cheesy biscuit sandy,” drip coffee and a turmeric latte.\n\nBeware, we thought they were bees but they were yellow wasps flying around constantly outside, they were attracted to the sweet things on the table.\n\nOur waiter seemed kind hearted but just did a couple things we didn’t think were professional. We didn’t hold it against him, he seemed to be taken care of the outside seating guests all by himself."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1ZmRHMWxPWE4zWXpCYU1FUk9NSHB0VmtSRmJVRRAB",
            "text": "Consistently mediocre. The food is so “nothing to write home about” that I decided to write it here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUVJFTkxhVEZuYzFoVVptRTVhbHBzYldkVU5sRRAB",
            "text": "Absolutely the best spot for food, drink and vibes in the area. Always fresh, awesome Customer service, and the best Apple Fritters in town!!! I love this place!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dFZFSm5RMGw2Y0dOTk1sTkxhbkk1VkRSdVEzYxAB",
            "text": "I've been there before, Is a trendy spot at the area. Nice vibe, food is ok and is not expensive.\nYou should visit this restaurant. 🗽"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwM01rYzVRMnRoVWxSc1NXSTVhR1J6VGpCYVlVRRAB",
            "text": "Me and my fiancé's favorite regular brunch spots! Great food, great cocktails and great vibes!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201ck5VbE1NazkxYVU5c2RIWkxOWE4wZEhoUGNFRRAB",
            "text": "It was rush so I def understand the struggle. But the service was just really bad and it’s insanely loud inside the restaurant. The server/bartender kept throwing/smashing stuff behind the bar and was just kind of loud as hell. We were notified after we were seated that the food would take 40 minutes and we had already ordered drinks so didn’t really have any option but to stay. Food took over an hour. There def needed to be more servers on the floor."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUmIwRnJjMWR6Um1sVVYydHRjVWhqY0RKalVsRRAB",
            "text": "Best Bloody Mary I’ve ever had hands down. 10/10 service vibe and food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxd00zQjBhVXRmTkdZNU5GRXhibEJ0VWtsMVZtYxAB",
            "text": "This is legitimately the best breakfast burrito i have ever had in my LIFE. I consider myself a connoisseur of breakfast, and this burrito looked at me and i heard a choir of angels singing. The first bite gave me new life, and the second bite made me forget my old one. Service was great, Jim was very funny and friendly and everything came quickly. Genuinely this place is so lovely and nice, with FANTASTIC food and incredible service. 10/10 recommend. I’ve included my licked-clean plate for reference."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SVVWUnhUV0Z1ZUhaVWFXVXpiV2hzV1V0dU4xRRAB",
            "text": "Solid brunch, nice people. Great cold brew $4."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UVZEWTRjRkUzUTFKMGIxRmlkblIwVW5wVFkwRRAB",
            "text": "happy hour drinks were nice"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sc1dUZHlPR0ZzUkRKVk5FUnRWbVp0WjBSWFQyYxAB",
            "text": "Such a special spot with great food and drinks. They always have something fun going on at night and it’s a great place to work from during the day. Bartenders are super friendly and knowledgeable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kblMyTmZiVFZNYkRVMFR5MHhZbFk1YVhSek5YYxAB",
            "text": "We got such sweet service from Jim!\nDrinks: passionfruit & lychee lemonades were sooo tasty. Food: cinnamon roll, (soft and full of icing), cheddar biscuit sandwich, and reg breakfast (eggs, toast, bacon) ALL delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMlRIZGxjRGRFZG1NeFNWUjFjR2R5ZHpKR1MyYxAB",
            "text": "Solid 3 stars. Their food has no flavor, the service is just alright BUT their coffee is sometimes a hit. Depends on the barista.\n\nTheir donuts are amazing though. They haven’t had as much in the past couple days BUT they’re the best in town. $3 for one. lol 😂."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUGNuSjNTR05UYkRsMFgxOXhlWHB6U0ZwVGJFRRAB",
            "text": "best brunch ever!!! jim was absolutely delightful and the cinnamon bun was best thing i’ve ever inhaled"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMGNGcDVOMnB0U1UxbFQzRlVWMDVTVlZSYVNIYxAB",
            "text": "I can’t believe we found this spot! It’s such a cute bar, offers varieties of food and late night menu was great. The have a backyard were people can smoke it’s a bit annoying if you are not smoker but want to just eat and have a drink. They offer board games to play and karaoke. The vibe was amazing. I will be back for a brunch to try.\nThe food we got was delish!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWS05tVnFNVXhDUkhKellYUmlkbE4zVjBOSVIwRRAB",
            "text": "I ordered the cheesy Biscuit Sandy and it was SOOO GOOD! Great customer service as well"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20welpVMXhUVWRCY1Voblh6UTJXVEZXUzJOck5rRRAB",
            "text": "Food was great! Friendly staff! Would definitely be back❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKM1dVbzViWEJsTjFaZlExOUpNamRGUjJOMk1XYxAB",
            "text": "Classic spot. Honestly everyone is good energy, sweet, welcoming, went today yet again and two new employees LJ and Jim were just as accommodating. I come here for my cappuccino, work and no one bothers me, love it"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa1NXbFdORFp1VldvM1UyaFZSV2hDYmpSRk1WRRAB",
            "text": "Omg this place is amazing! Benji is the best bartender who will make you exactly the shot you need with the side of personality that you always want! I love it here and I hope you will too 💕"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRFFqWmtlamRLUlROQmVsWlNhR1owZEVvelJXYxAB",
            "text": "Cool little spot to grab a drink and burger"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOYWVrTjROVmxxY2paZk0zSmpVRms0VWxReWQxRRAB",
            "text": "I live close by and Father Knows Best is my go to spot! Their brunch is delicious and they have a cute backyard that’s not too busy. They also have good drinks and fun events at night. It really feels like a community spot and everyone who works there is super nice. I went for brunch on my birthday and they gave me a pastry for free. Try the fried cauliflower and whipped ricotta….ok but also the cheddar biscuit and the hash…..also the chicken and waffles. God I love this place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ST01UaEdOM0ZWVUZvM2FWWmFVR013Um5OSVJuYxAB",
            "text": "Jim our server was so nice! Very helpful and we swapped recommendations for hair care products too!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNU5uZDNXazFJVFVaaE5tVXhiSEYzTVUxdVpVRRAB",
            "text": "I have to say, the staff here are phenomenal!  They were very sweet and offered great service!  The manager Chelsea was so helpful!  My friend lost her air pencil in the patio and we thought it was lost forever.  Chelsea came over like an absolute QUEENN!!!  She got the pencil back in like 3 minutes!  AMAZING!\n\nThe food is great, the vibes are immaculate, and the staff couldn't be better!  I love it here, and I WILL be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJV2E1NHpueU5YeThnRRAB",
            "text": "I can't express how much I, like other 20-somethings in the area, wanted to keep Fathers as my FAVORITE bar and default spot to set up permanently. I've been coming here long enough to see the entire staff and schedule turnover, and could not be more understanding of times being stressful, understaffed shifts, and one-off miscommunications as I have worked and grew up in the hospitality industry my entire life as well. I don't know if it's because I stop by here by myself or what, but I have excused the bad service that I get here intentionally since stopping by brunch on my birthday in 2024, also getting bad service. The past four times I have come here, I have waited 40 minutes for one menu item with no update whatsoever. Today, in a time crunch, I ordered the simplest salad they have on the menu while the bar was virtually empty. Just simple watermelon, feta, and pistachios on a salad after having literally just a can of cider that I liked. After giving as much grace as possible that maybe they were prepping something fresh at the last minute, something else possibly being fixed behind the scenes, and re-confirming that the bar was still empty and I was still waiting for one simple salad in a spot where everyone could clearly see me still waiting, with my order number on my table... I got up to cancel my order and take the loss, if there was no update from Father's staff, considering I ran out of time to comfortably eat before going go work. A minute later, I'm told that they never started making the salad, but not offered a refund. And after 40 minutes, I received my watermelon, feta, pistachio salad, with not a single pistachio, the wrong dressing, and no F's given by anybody. I get work sucking, but as a chronic over-tipper that has dealt with the worst of all of these jobs, I can't waste my money here anymore."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCLUphSXhRRRAB",
            "text": "My favorite go to spot in the neighborhood. Cozy lil spot with friendly staff. Pablo, Santi and always make me feel welcome.  Everything from the food the vibe and the amazing drinks and staff\n\nTry the chicken sandwich fried, trivia on Weds and drink the papas draft."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNmg4dXEza3NXc1ZREAE",
            "text": "loves this place the food service and drinks are amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKUG5fSVNNemFDeE1nEAE",
            "text": "Had a pretty poor experience here today. Most importantly the mushroom hash was tiny, much smaller than it used to be. $15 for a plate of mostly arugula. They didn't add the pickled veggies to my bloody mary (as it is described on the menu). I asked the server who said she'd look into it, and never got back to me. My partner burned her hand on a skillet delivered without any warning it was hot. We had to ask for utensils, and the food took a very long time to be delivered. All things compounded, one of the worst dining experiences in recent memory. Its a shame, as I have fond memories of this spot from several years ago"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VOblotdlhyeS1LcVhREAE",
            "text": "Good overall, but the menu prices aren’t accurate and they’ll charge more when you pay. Check your bill."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLT3J5NnZoNUttenB3RRAB",
            "text": "Id say it’s a pretty solid brunch spot. Also a place to go to do work, I like it more at night I think."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOUG9uSVBmaC02UXJnRRAB",
            "text": "Bartenders are rude.\n\nMusic too loud to talk, not to mention the low quality speakers.\n\nBad vibes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLYUFzNWI5b3VES2RBEAE",
            "text": "The coffees great and the staff is super nice and friendly. I have occasionally come to have brunch with some friends and that’s where I start having negative experiences. Every single time I’ve ordered food to dine in, the food takes 45 minutes to an hour to come out. It ALWAYS gets to the point where my friends start asking me why it’s taking so long because they’re hungry. I reached the end of my patience with dining in here when my friend and I ordered scallion cheddar biscuits with coffees for dine in. We were waiting at our table for 40 minutes for biscuits that are already premade, so I really do not understand the delay. I ended up going in and asking for it to be packed up to go because we were starving and didn’t wanna be there anymore."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJekg2S0g1LU9tSXNRRRAB",
            "text": "Loved the food. Great time at brunch, affordable mimosas and great options to eat. Veggie burger was DELISH. Justin was a great server and felt like a good friend even though we just met. Love this place! Could be here all day."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdVFqTlhYemZhUHdnRRAB",
            "text": "Great food and people. Justin is awesome!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOMkt3OURILUxXMXF3RRAB",
            "text": "Lovely brunch experience. The food was really good, and the service was excellent. I would definitely return"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYmhfOHJabk1QS3dBRRAB",
            "text": "The food is great, especially brunch specials and the outdoor shack is so laid back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPLWE1T2pjd3JXU2p3RRAB",
            "text": "Overrated!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNN0xtcGFhbWJhOHZBRRAB",
            "text": "Not just a great all-day cafe/bar, but also a great community space!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaTlqd09REAE",
            "text": "Cool local spot where people hang out, work, and enjoy a good coffee. We stopped by in the late afternoon and ordered a burger and fries- it was decent.\nWe also had some cocktails, and the lovely staff even surprised me with a custom drink using my favorite ingredients, which was such a sweet touch!\n\nWe sat outside and enjoyed the relaxed, queer-friendly vibe. A nice place with good energy. Would definitely come back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dU5tUEpnEAE",
            "text": "Long been a main breakfast spot in Bushwick \"Father's\" has weathered the turbulent times of covid and came out the other side. Though I will says prior to 2020 I thought their menu was much more exciting they still being the heat with the whipped ricotta on rye toast and their breakfast menu. This place always has a great vibe if your into that bohemian aesthetic and at night it has a great cocktail menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPM00tQy1BRRAB",
            "text": "I heard about this spot from one of the managers, I am super excited to have a spot that opens at 9am that has exceptional service and spectacular food!!! I met Bree and Mikey (hope I spelled correctly) they held it down just the two of…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwamEzNUJnEAE",
            "text": "Nice low key calm setting. The staff is friendly and attentive. The drinks were pretty good. The food wasn’t the best, kind of dry and lacking in flavor."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OV9qN2ZREAE",
            "text": "An OK place for drinks.\nBrunch food is just mediocre.\nChicken & waffles: Dry. 1/10\nFeta salad: 7/10\nCauliflower Wings: 3/10\nBushwick deserves better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNULTRqUnJ3RRAB",
            "text": "Love this place! There is always something going on here. Drag shows, live DJs, speeding dating, paint and sips, and many more! You can come here for a date, girls night, large group (might want to reserve ahead of time. Especially the weekends and events.) Food is amazing, drinks are drinking, and the staff is awesome. Front patio, indoor, bar area, and back patio"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1aVlxeWd3RRAB",
            "text": "This is definitely a neighborhood gem! The atmosphere is warm and welcoming, and there's an excellent patio in the back when the weather is nice. It's an all day cafe, so you can come in the morning for a coffee and get a little work done, stick around for lunch, or grab a drink and bites/dinner in the evening. They have programming too, so you can check out the events they host. Food was excellent and the staff is amazing!"
        },
        {
            "date": "2년 전",
            "language": "de",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabUxTWm5nRRAB",
            "text": "Das Essen war sehr gut, jedoch ist der Kaffee für europäer ein bisschen Sauer. Auch der Orangensaft war geschmacklich nicht so der Hit."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1Nks3djZBRRAB",
            "text": "Absolutely wonderful place! The service is excellent! The food and drinks are amazing! This place is just so very nice and pleasant! Love the vibe! The best of the best! 100% recommend this place!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRMU5pSVZnEAE",
            "text": "Our server Stephanie was informative and quick! We were one of the first people on the early Sunday morning, but regardless the food and drinks came out quick. We all got pancakes that were awesome! I love soft pancakes, not rock hard;…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyXzgtQkJnEAE",
            "text": "Absolutely the worst food I’ve ever had in my life. Ordered the chicken wings and they were the most sour thing I’ve tasted that I gagged so much. When I asked the server is there’s a way to replace them, they had a condescending attitude and blamed me for not ordering the sauce on the side. We also poured water for ourselves, and there were no cups available nor forks. The waiting time was also extremely long. The waiters were micro-aggressive towards me and my friends, which didn’t sit well with us. The tomato soup itself was great. I will never come back to this place ever again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwLWQtcGVBEAE",
            "text": "Went here on a whim on a Sunday night. Had the pleasure of hanging out with Justin at the bar. The drinks that we had: Hibiscus margarita, lavender collins (highly recommend), and father’s old fashioned were all strong and flavorful. This place has a lot of different events throughout the week to check out like drag bingo every other Thursday (will be back for that). Definitely check it out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Nl9tRGVBEAE",
            "text": "Best Bruch in Brooklyn!!!\n\nSo much variety when it comes to food very and tasty vegetarian/ vegan options. Super friendly and helpful staff! Great atmosphere at night as well I always visit when I’m near by! 10/10 ★★★★★"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRLVk3eHp3RRAB",
            "text": "What a cute homey little bar restaurant. The cocktails are great. Menu is limited but good stuff. I like the Mac and cheese. The backyard and soft music was great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNEwtczFRRRAB",
            "text": "Ordered the Mushroom Hash sans eggs and it was delicious and the coffee met my expectations. The back patio is delightful (small and cozy) but is a smoking zone, even during the day, and that's a bit of a bummer.\nOverall, a good experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCaW9Qc2RREAE",
            "text": "This is the third time I’ve been to this place since I moved to the neighborhood and every time has been lovely. It feels like evenings are a bit more laid back which I love. Perfect for brunch and perfect for a drink. The bartender Pablo was super kind! 🤙😩🤙…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeTR1ZXVBRRAB",
            "text": "I’ve passed by this bar many times but never came in. I finally decided to come in one day and give it try and I’ve been back at least 4 times now because of the customer service Justin from the bar has provided. He always goes above and beyond and shows amazing attitude.\n\nI will always come back because of his services.\n\nOh and the food and drinks are great as well."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRODZpbWNREAE",
            "text": "I went here with my husband today because the food and drinks looked pretty promising. The food was pretty good, I got the rosemary chicken wrap and my husband got the smash burger. My main issue and concern about the place was the bar. It looked very dingy and dirty, not very well kept. Their beer was awful, didn't even have any foam and wasn't cold. The cocktail was way over poured and didn't taste good, I took one sip and couldn't finish it. The female bartender also grabbed the orange with her dirty hands and put it in my drink, totally made me not want the drink anymore.... I wish I could've gotten a refund for it because it was so bad. That same bartender was taking shots with customers and was clearly intoxicated, she then was hanging out with her friends outside after and gossiping which we found extremely unprofessional. The outdoor patio is super nice though. If this place can get their bar in order then it would be better."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLeHQ2Y2VREAE",
            "text": "A “go to” for meeting friends for brunch on the weekends (or any day, really, come and do your work solo at the bar). Vegan friendly staff and menu AND Bloody Mary’s. Be sure to try the dank pancakes and potato hash salad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdmNhcGRnEAE",
            "text": "Highly recommend the fried cauliflower. It is flash fried and lightly breaded so it doesn’t feel too heavy. Drinks are well priced as well and the backyard is very cozy."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnODdPVnFnRRAB",
            "text": "Went in for their brunch on an early Wednesday afternoon. Not a lot of people. Many tables to choose from. We sat by the bar and our orders were taken immediately. The coffee was a bit expensive for the quantity but the expresso packs a…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdDVpV3VBRRAB",
            "text": "Absolutely love this spot. Have gone for brunch a few times, but this was the first time I came for dinner, and I absolutely adore the nighttime vibe. Gigi was so nice and the drinks were SO good (especially the lavender collins 😍). I…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSellmV2dBRRAB",
            "text": "Had dinner here tonight with friends have to say the space is very welcoming (perfect for any occasion) and Dakota and Justin were super attentive and knowledgeable with the questions we had. The smash burger was delightful and the smashed…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMXB6ajVRRRAB",
            "text": "Review for Father Knows Best\n\nI stumbled upon Father Knows Best during a work trip, and it ended up being one of the highlights of my time away! I spent the day working there, and it was the perfect spot—comfortable, welcoming, and with a great vibe. As the day turned into night, the place transformed into a lively bar with karaoke, adding a fun twist to what started as a workday.\n\nThe food was fantastic! The smash burger was juicy and flavorful, and the fried pickles were perfectly crispy and tangy—a great combo. The staff were super friendly and made me feel right at home.\n\nIf you’re looking for a versatile spot to work, eat, and unwind, Father Knows Best is a must-visit. It made my work trip so much more enjoyable, and I’d definitely come back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bWRqQWlBRRAB",
            "text": "Definitely need some improvement in the timing of service, but everyone was friendly and Bia especially was so nice and communicative about the waiting. Food was GREAT. definitely coming back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXJ2Mm1BRRAB",
            "text": "Very friendly staff and great atmosphere. Music was good and food and coffee were great too. Very cosy and welcoming."
        }
    ],
    "reviews_count": 75
}