{
    "name": "Queen",
    "place_id": "ChIJ_____xxcwokRvgheZgxjWtk",
    "grid": "BK4",
    "address": "247 Starr St, Brooklyn, NY 11237, USA",
    "rating": 4.5,
    "user_ratings_total": 712,
    "phone_number": "(929) 227-3474",
    "reviews": [
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMGJqRjVUMk55Y2xWS0xVRTBNR1JwUWxCTkxXYxAB",
            "text": "Waited a hour for food, its like everyone in bushwick all came at once and ordered"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVE1GWnZaVGx6T1dsRWFWaEpTVGRYWW1wR1lrRRAB",
            "text": "Had a fantastic time at Queen! The ambiance is warm and inviting, the staff is super friendly and accommodating. And the food? Absolutely divine! The hummus was a highlight - creamy, flavorful, and utterly addictive. We'll definitely be…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWV1RFeFhjMDVaUVdkRU5UZzBXbWRoVkhSM2RIYxAB",
            "text": "Beautiful went here with my gf after our concert date food and vibes was good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSFRGb3dlRWR6TkZVMlRUTklaRU5YY25ScVJYYxAB",
            "text": "This is consistently delicious! Always a table, sweet staff, and conveniently located. Perfect casual lunch or dinner spot for friends."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZelZHUnJiV2RTVFRST1N5MUhMVEYxVDNKaE1VRRAB",
            "text": "Delicious cuisine and friendly, wonderful service. Atmosphere was cozy and a lovely vibe. Will be back for sure!"
        },
        {
            "date": "1달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMlgzbERkbGR5TTIxQ09FVnlhV0pwUTBvd05uYxAB",
            "text": "Excelente! Uma super agradável surpresa com ótimos pratos de inspiração árabe, ótimas bebidas e ambiente aconchegante"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSblVqZzJkVjlpVUdGbE0xOVdaakZYTWpNNFpWRRAB",
            "text": "bruna was the best server ever, had the best experience here and the food is to die for. GET THE HUMMUS MEAT. just trust me\n\n10/10 would recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVE1UZGtkRVpsVWpCV1pXZG9OR0YxZEdsbmMyYxAB",
            "text": "The food was soo good and fresh! You can tell it’s authentic Mediterranean food. I WILL be returning"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUVFYZFlka1V5TldNMFNFMXlZMnA2YjBkM1VYYxAB",
            "text": "I had the most amazing experience this restaurant! The food is absolutely delicious—my favorite dish is the hummus with meat, it’s perfectly seasoned and so flavorful. The atmosphere is warm and welcoming, and the service made it even better. Our server, Bruna, was the sweetest—attentive, kind, and made sure everything was perfect for us. I’ll definitely be coming back and recommending this spot to all my friends!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVlJIaHpNVFpxUTA5Tk5FTXpNRGR4YzJwU2QwRRAB",
            "text": "The best chicken shawarma I’ve ever had"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxclR6QmxlRFJUVUZsQ1dGQkpXa2t3VEZwWmVYYxAB",
            "text": "Not bad"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMFkwZHZjVEp3V1hsc2VGaFZObXRXUjNSWGFHYxAB",
            "text": "Great food and quick service. The Website makes the restaurant look huge and fancy but it’s a laid back neighborhood spot and worth a visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TmVtOVNOV05OUkZCM2NVOHdZMFo2ZFhGTmVGRRAB",
            "text": "Delectable bloody marry and omelet combo. Do not forget to order the hand cut fries w aoli"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcE4ybHVWR3RDYW10aU5taHhVbXRaTWxaNFRtYxAB",
            "text": "Best food in bushwick!!! Shawarma sandwich was 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNlFYTjVZMWhXVTJaWmJqbGxXWEZMY1VKYWIzYxAB",
            "text": "Used to be great, now bad and overpriced"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1V1EwNVdRUzFpVmpKVmExazFkbEl4VkZKcWJGRRAB",
            "text": "hummus 😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WVRrUnRMV05wWDNCTGQyMXVRa2w1U1hKQ2EyYxAB",
            "text": "IT WAS THE BEST FOOD IVE EVER HAD I LOVE THIS PLACE"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201QmRreERUbXB5UjFOb2VuZHNUV0l4Y2tGV09FRRAB",
            "text": "Delicious food. Quick and polite service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUGNGaEpXRGN5YUV0d00zUkxiakl4WjFvNU9WRRAB",
            "text": "Great food, nice service 👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaE5uUlZPVUpIVjJWeUxXdFVSa0ZtWDJWNE9XYxAB",
            "text": "Simple menu with great food and drinks."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSYVZWZHlSamwzZEZFM2VuYzVTRzF0V21sUlZsRRAB",
            "text": "I think this place has the best Mediterranean in the area, but the menu is basically the same couple of items served different ways. I wish they had more variety. Acceptable service & atmosphere, nothing special."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeFRFNDBaMUpzTTJsUVYzcFpVbE53WXpKTGVGRRAB",
            "text": "Amazing place, love it so much"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVFlrbFFVRWwxZFdNMVVubEVWMjFrTjFRd01tYxAB",
            "text": "Great lunchtime stop. Authentic style Middle Eastern Food.  Great atmosphere. Loved the decoration."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbWIwYzFRbEpNUzJsaVJHWkZSRzR3UTBSb1gxRRAB",
            "text": "I really liked the food here. The atmosphere is good too. The sandwich I got was tasty. I would go back. It's a bit expensive for what you get."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU2MwOWtiMEpWTW5Wb2ExazBXbU5CWTJNMWMxRRAB",
            "text": "Such a cute vibe my friend and I went for a quick late night munchie just get the baklava and ask for extra honey for the full experience they were close to closing but the staff was so kind"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcmJpem9RRRAB",
            "text": "This restaurant is awesome! Their customer service was great and the staff is friendly. We had a wonderful time there. I love their unique decoration. We went for a late lunch and the restaurant wasn’t so busy but you can see the customers coming in and out."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQcXR2TTJvN2VXNWxBRRAB",
            "text": "Asked for labneh side today to go - they container lid wasn’t tight or covered properly and I was traveling with it upright most of the olive oil came out anyways… also asked for extra cucumber which was not put in there! Money down the drain honestly"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcmJnNGI1aEtMWFdnEAE",
            "text": "Great service, great food, can't ask for more. Came here after some pretty lousy service at Ayat and I'm glad I did."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKNld0b09QOHRTRlpREAE",
            "text": "The food is delicious, but the portions have decreased in size! This used to be our go-to takeout spot for groups, but sadly no longer."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNGRtSXZ3RRAB",
            "text": "Came by right before closing and not only were the staff lovely the food was amazing! Had dreams about it! Will return!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcTdXMWVBEAE",
            "text": "I’m sad as this is just one of the many examples - I used to eat here since it opened in maybe like 2019. It’s not anywhere close to the falafel I remember having anywhere in Berlin but still good enough to come back. I always ordered the middle eastern plate.  Which was a big portion for one person actually better to be shared including pita bread for like 14$.\nNow the portion is smaller! but you have to pay 17$ and pay extra your pita bread 1.50$\nSo 21$ for 1/3 cucumber, 4 small falafel balls a cup of rice and some tahini in freakin Bushwick.\nIt’s just crazy! Never coming back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcS02anV3RRAB",
            "text": "Very tasty middle eastern food! Humus and labneh were great, schwarma is flavorful and fries were crispy. Service was great!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveTlmQmRBEAE",
            "text": "The most delectable meal you’ll have in Buschwick!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN29YbUJnEAE",
            "text": "Good prices, it’s a very good option if u r looking for healthy food!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvLVltMmZBEAE",
            "text": "The hummus plate with sautéed mushrooms was tasty, but it’s grossly overpriced at over $16 after tax, especially given the small portion size and minimal chickpeas. The menu is also misleading—it suggests the plate comes with both falafel and mushrooms, but it’s actually one or the other. Definitely not worth the price."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOGJxcUhnEAE",
            "text": "Love the hummus and Labne and all the mezze really. I always get the schnitzel sandwich which is perfect every time, they also have great brunch options. A really cute place and welcoming staff, tasty drinks and a fun playlist!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaXQ3d2RREAE",
            "text": "Very tasty and service was friendly and quick"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc3B1d1dBEAE",
            "text": "Amazing food even as delivery, so fresh, real food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJajdIeV9BRRAB",
            "text": "We came here for lunch with some friends and our infant son, and they were so incredibly kind and accommodating. I tried both the hummus and the baklava and they were great, my wife really enjoyed her shakshuka. We will make sure to come here again when we are in the area next!"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNF9Ua0VnEAE",
            "text": "Très sympa les plats sont simples et l’accueil Top !\nBon rapport qualité prix et le quartier est très sympa 😊 je recommande !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdFpHOXlBRRAB",
            "text": "We walked in here to a sour faced host that barely even gave me a second of his time. When I asked if we can sit in a small table because we only had our little girl with us he barked no at me.\nNot worth anyone’s time"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbGRuNFR3EAE",
            "text": "love the gem salad with herbs and schnitzel"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJelBMZFhnEAE",
            "text": "Très bon restaurant et rapide. Nous avons pu manger en moins d'une heure en lien avec notre tour en bus des quartiers de New York. Carte courte mais efficace nous avons pris des sandwichs et assiettes complètes et tout était très bon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNktMbWVREAE",
            "text": "Staff is friendly but will say portions are small for the price and chicken shawarma is not actually shawarma imo and has WAY too much grizzle in it — had to spit out a bunch of pieces 💀💀💀💀…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMzZ2V05REAE",
            "text": "So good! Had the chicken shawarma sandwich and was 10/10. Will def be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdkk3QXRRRRAB",
            "text": "Needed more seasoning"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaXJidmtBRRAB",
            "text": "Came in here after a spot me and my friend and I originally wanted to go to was packed....glad we did!\n\nVery cozy, welcoming atmosphere and delicious food! I was pleasantly surprised with the food. Everything was super flavorful. I really want to come back spon to try some more things on the menu."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXBTaUtnEAE",
            "text": "I’ve been eating here since it was a “hole in the wall” (old location, 6+ years)\n\nLately, every experience has been a painful one—Dine-in & take-out. From long wait times to increasing prices, I think I’ve finally hit my wall with the Queen.\n\nToday the price for a side fries has increased to $5 and the actual quantity of fries has decreased, so much that I’m writing a review about it.\n\nWhat’s bugging me is that they only increased the price of a “side” (from $4-$5) but if you look on the printed menu… an order of fries remains $7.\n\nThey’ve up the price of a “side” so much, that it only makes sense to upgrade to an “order” and this feels… not good.\n\nIt now makes sense as to why the bartender “threw in a free side of hummus” … to go along with my literally (15) pieces of fries… -__-"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMktXOUpREAE",
            "text": "Buena comida"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfanNqMGxRRRAB",
            "text": "Great place for good food at a reasonable price. I love the lentil soup and the Caesar salad so much I haven’t really found any other restaurant make those dishes as well. Definitely a go-to in the Bushwick area. They have a really nice variety of drinks as well from teas to juices.\n\nThe restaurant itself is not bad either. Even though it’s a small space I’ve never felt crowded in there or cramped into a corner. Seats are comfy and the staff are nice too."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2N0ptTmZnEAE",
            "text": "Amazing food and special drinks! Beautiful and cozy space with friendly staff. We enjoyed everything we ordered. Their portions are pretty good too! Their hibiscus lemon honey is the best non alcoholic drink I have had, and their lentils soup is great! They have a great bar as well. Highly recommended!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEalpHVDlnRRAB",
            "text": "Staff is lovely, ambience is very nice but the cutlery was not clean.\n\nFood was average. Didn't taste that good.. but maybe that's what Mediterranean food here is like? I was comparing it to London. Nothing like it. However, it was freshly made."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeHVxa1dREAE",
            "text": "It’s quite a small place with a few tables but food is excellent with everything tasting fresh. Service was quick and atmosphere is neat and pleasant. The pita bread was nicely toasted, hummus and labne were flavorful with just the right amount of dressing. Would visit again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmejcySnhnRRAB",
            "text": "Great little place right next to the subway station; cute decor and cozy atmosphere; great food (we had little gem salad and Middle Eastern Plate), pita bread greasy and addictive, charred beets sensational!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbGZyYmtnRRAB",
            "text": "For a cozy middle eastern brunch/dinner spot in bushwick, this is the spot. With cozy vibes, this spot is nice for small gatherings 6 max, no reservations either.\n\nThe food was great and reasonable priced. The falafel was flavorful and not too dry. The fries and Brooklyn brunch sandwich was also a must try! Tea was okay, but lemonade was not too sweet. The shakshuka was also not too salty and really hearty! The baklava for dessert was a great way to end the meal.\n\nStaff were friendly, bathroom was clean. Definitely coming back to try dinner!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzeHJ2ZFpnEAE",
            "text": "Best hummus I’ve ever had. All the dishes are fresh, full of flavor, light and lots of aroma. The shallots and fresh herbs on the lentil soup gave it an beautiful presentation  as well as delicious bite. And the beets, so clean and lovely. Everything is visually and tastefully done!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMWFMUDF3RRAB",
            "text": "I'm quite shocked by the high rating of this restaurant. We visited as a group of three and all agreed that it was a straight-up bad food experience. I mean, the service was bad from the get-go, but the sandwiches we ordered were all tasteless. Also, the lentil soup was really bad.\n\nSo I'm not quite sure what criteria others used, but this restaurant was nowhere close to the quality of the other places I have visited in NYC."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXb3RUNFBBEAE",
            "text": "First time ordering for delivery from this place and I love it!\nI got the Caesar salad with cauliflower and egg, falafel and hummus plate, and the hibiscus lemonade .. everything was delicious!\nWill definitely order again - one of the best hummus and falafel in nyc 😍😍😍😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNWU2MHNnRRAB",
            "text": "Queen was a rec from one of my co-workers and it did not disappoint. Came for a late brunch and the food was delicious🤤 I got the Brooklyn breakfast sandwich which had eggs, labne, cucumber, tomato, onion and herbs. It was absolutely incredible. I didn’t have a chance to even set it down. We also got the malawach with scrambled eggs, veggies and a light tomato sauce. Also 10/10 and the malawach was sooo flaky. Our server was super friendly and attentive. Which we had a Queen closer to our house!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXaUk3M1hREAE",
            "text": "Outstanding little spot in Bushwick with Mediterranean cuisine. Pita sticks and hummus were delicious. Servers are very attentive. Decor is quaint. Wonderful spot to grab dinner before seeing a show at the Sultan Room."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuZzl6eGN3EAE",
            "text": "I love this place!! One of the best restaurants in New York!! Flavors are so good, the cocktails are fun and unique, and the staff is super nice. My favorites are the za'tar fries, the mezze, and the schnitzel. A must try spot in this neighborhood!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMVBlZ1V3EAE",
            "text": "The food hear is amazing, well seasoned, flavorful, fresh, balanced tastes. I had the Mediterranean Plate and it filled me up. The sauces which are made fresh daily, are a perfect compliment no matter what you’re eating. The roasted eggplant is a unique dish that really lets that veggie shine. I hope to get back here soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURKXzZkXxAB",
            "text": "Amazing falafel and fries. The portions on the fries were huge, I didn't even end up finishing it. The people here seem really nice and weren't stingy with people using the bathroom. Love seeing kind businesses. If in the area, will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMlo3ZTRnRRAB",
            "text": "We came here hungry at like 9:30 pm and had an amazing dinner! Shakshuka, hummus, baklava and watermelon margarita was soooo yummy! We really enjoyed the food,atmosphere, music here. Waiter was also a very pleasant and polite guy!🩷I’d come over to “Queen” again for sure"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaGV5QkVBEAE",
            "text": "So good!! The harissa aioli is great with the fries. I loved the falafel sandwich!! The hummus and pita are super delicious- the pita is super fluffy, if you have a couple people I would get an extra pita. Would love to try the drinks sometime. Delivery was fast!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2LWFicWdBRRAB",
            "text": "I didn't have any complaints. I had the baba ganoush and shakshuka. The baba ganoush was nice and smokey with the pita bread, but the shakshuka was great and spicy! I love spicy food and was worried about it being a bit mild, but I think it had a decent spice level while being palatable for people who are a little more sensitive to spice.\n\nS/N: My friend ordered the other dishes pictured. She really liked the yogurt appetizer and thought her entre was okay. This has no effect on my rating though."
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dWQtSXdnRRAB",
            "text": "J'y ai déjeuné un samedi midi pour un brunch. Quelques tables sont présentes dans ce restaurant. La décoration est cocooning, on se croirait dans une maison de vacances. Les plats sont copieux et de qualité. J'ai particulièrement apprécié le houmous !"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpckpfWXlRRRAB",
            "text": "Chicken shawarma platter is really bland tasting with no flavor. The only decent part was the cucumber salad. The chicken was burnt to the point where it was carcinogenic.  It was definitely not fresh either. Tasted very stale. The soup was…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnZ0xUNWhBRRAB",
            "text": "Great hummus! Looking for special humus in NY? This is a must! Try control yourself when eating and don’t do what i did: ate too much! And felt sick 🤒 🤪. It is so yummy that I wanted more and more haha (sinner!). Great spot if you’re a HUMMUS BEING 💃🏻…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJLV9QTkFREAE",
            "text": "Great place to visit for a quick bite if you're into vegetarian foods. Staff are very friendly and patience, prices are moderate,  Food tastes great and fullfilled my appetite. It's literally the best kept secret on the block. My palletts get moist just thinking about the Backlava desert. It's a hole in the wall literally and figuratively.  It's great if you're ordering to go or with a small group of 5 to ten individuals. The place is quite small, I literally passed there for months without recognizing it. But I hope my photos will help you get to said location.  Yes I admit I am a foodie so enjoy and thank me later.\nTip: service is amazing and don't forget to tip."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdVAtdFNREAE",
            "text": "We came to this place last night for dinner and it was really good. The service was great and the food was delicious. We saw that there was a bklyn breakfast sandwich and came back this morning to try it out and the service was really disappointing. The server did not understand the menu and was charging us for sides of fries even though the sandwich said a side of fries was included. After pointing this out, the server reluctantly removed the additional charge of fries. After we got our food and went to eat it in the park, we realized we didn’t get any fries. We really enjoyed this place but now we won’t be returning since we got charged for items we never received and the overall unpleasant experience this morning :("
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdVAzR09REAE",
            "text": "We decided to visit Queens on the weekend for lunch and were pleasantly surprised by the quaintness of our experience. We walked in without making a reservation and were seated immediately. During busier periods (e.g. dinner) I'd suggest making a reservation. When it came time to order I chose the schnitzel. The plate itself was larger than I expected which made me feel I got value with the choice. The staff here was attentive but service was slightly slow given how busy the restaurant was. I'd come here with a friend or date for a casual dining experience in Bushwick."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzMHBDN0F3EAE",
            "text": "Love how quaint and warm this place is. Came here on a Saturday night around 9 and we absolutely loved our meal. We ordered the babaganoush to start and got two sandwiches; the falafel and chicken schwarma. I must note that these are my…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dmMydkhnEAE",
            "text": "Food was excellent. Extreme unity of flavors to create a divine culinary experience. Mint iced tea is the best ive ever had. Highly recommend the shawarma platter and the shakshuka. HUGE bang for your buck. Highly recommend. Also, gorgeous atmosphere"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MkpuN2JBEAE",
            "text": "Other than a bit of confusion on whether or not I would be dining in the food was really good. I enjoyed their take on the Falafel Sandwich, the crunch of the falafel with the pickles was a very flavorful experience. The hibiscus tea with honey balanced sweet and tart very well. Spent a bit more than I am used to for Falafel though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1em91ZW5RRRAB",
            "text": "Queen is a great place to stop in and grab a late night snack when you're out and about in Bushwick.  They're open until midnight on Friday and Saturday, and they keep pretty busy, but you can usually squeeze in and find a seat.  Their falafel, hummus and fries are all on point.  This is an easy win if you're in the neighborhood."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaGN2d0tREAE",
            "text": "The food was great sooo much flavors. We got the chicken sharwana and the hummus special . Sunday’s at 12 pm is the drag queen specials. Drinks were really great too."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBa3RUbjJ3RRAB",
            "text": "This little falafel joint is a diamond in the rough nestled on the corner of Wyckoff Avenue near the Jefferson Street L train. Friendly staff. Quick delicious eats. Very inexpensive. The sauces are very tasty and the ingredients are always fresh. Queen of Falafel never lets me down when I’m craving middle eastern."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNFpqVzFRRRAB",
            "text": "AC was kinda low. Table was sticky. Food was basic. The girl who served us wasn't friendly, and she took my dish away while I was fixing my makeup for a second. That was rude. She should learn more about hospitality and communication."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUQ2OFlBaBAB",
            "text": "Came here at 10pm on a saturday and the service was still A1. Tried the caesar salad, falafel pita, frito misto, and fries and recommend ALL OF THEM. Dare l say the best mediterranean in all of new york??"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsN3BhTHlnRRAB",
            "text": "This is strictly for the delivery reviews. I’m extremely disappointed with the food I received from Queen tonight. I always get the lamb kefta plate (have been for at least a year now) and tonight, my food was extremely rare/borderline raw. It has NEVER been so pink in all my times getting it. The inside was soft, mushy, and so pink that I can’t eat it. I don’t care that the food was cold by the time I got it—that I can understand. But for food to be severely undercooked when I know how this place has prepared it in the past? Unacceptable"
        }
    ],
    "reviews_count": 81
}