{
    "name": "Bushwick Taco Company",
    "place_id": "ChIJMQCrgztcwokRczHnAB9FuAc",
    "grid": "BK4",
    "address": "839 Knickerbocker Ave, Brooklyn, NY 11207, USA",
    "rating": 4.3,
    "user_ratings_total": 657,
    "phone_number": "(718) 676-5305",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVlMwODNZekJJTlcxU1lUQnFTVzlIYnpCWFdFRRAB",
            "text": "If you don't give them tips\nThey will not guve you sauce lol"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4T2VUSk5jMnN6U0cxblNsWXdkUzFqWTFoM2NXYxAB",
            "text": "Terrible server"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dE1XaG1YM0JGUTFkQlJUQldaVTAxTmxKZmMwRRAB",
            "text": "Terrible service\nDidn't gace me sauce because i didn't gave her tips\nLol"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VdGVpMU1hRTVCWlV4dlQzbFlaVk5TYW5abE1HYxAB",
            "text": "Great steak burrito"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xab1UzbEtURUl3VkRFelRsZDZPRXB1V2pSMFRuYxAB",
            "text": "I love it here people that are very respectful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMGNGUmxOemd0VmtOa2RIcFRXa1JuT1RWYWQwRRAB",
            "text": "Get the Birria"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWVdWaEhSVlZuZUVSZmVXRkVUR1psVG1GaE9HYxAB",
            "text": "The service could’ve been better. I’ve been to this location a few times and the experience was never like tonight. The cashier kept wiping her nose with her bare hand. The cooks that’s supposed to be cooking, found something so funny to constantly look in my direction, found a picture in his phone, showed the entire team whatever the picture was and talk amongst each other in Spanish. I’m the only customer in the store by the way. From a customers perspective, that was very unprofessional and uncomfortable. Customers are taking the time to come to your establishment. Train your staff to understand providing an experience for your guest and do better!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214clkwMUpWVGRITUZVeVdtcDFaMFpGT0ZoS1drRRAB",
            "text": "I'm notoriously picky about Mexican food, especially tacos, and I've been disappointed by a lot of the NYC/east coast offerings. I was ready to say that the west coast is just universally better at Mex food until I went here.\n\nHolyyy hell, Bushwick Taco Company knows what's up! Everything is fresh, delicious, and well-seasoned. I try something new every time I come here and have yet to try anything less than excellent. Only complaint is that I wish they had more/more comfortable seating. Otherwise, big fan!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMlRWaGxVVmxZZFZwdVNIZHBZbDlCY2pkelQwRRAB",
            "text": "The food was hella delicious! I highly recommend redolent. Customer service was also super friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVlVFaDVVV0pOV1ZKcVZqWkdXRVkwYkdFemMzYxAB",
            "text": "As a taco connoisseur....don't.  Order 1 taco the way you like it to test it out ...it'll be almost bland. They try tho!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zd1NEVlJlVjlvVGxVMmNXdE5aa0oxVVVrNFNuYxAB",
            "text": "No compren aquí, pedí una quesadilla de camarones y solo llegó con dos camarones"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSUVQyZFNlVXh0UTJkblJrODJZV0Z2UWtnMWVGRRAB",
            "text": "The food is very delicious (the chicken nachos are my fav)!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VVpHUXlVVTFTZFV3elNUWTRVRzlLUlVsa1FuYxAB",
            "text": "Loved this restaurant to fill the need for a quick and easy Mexican dinner. The nachos were awesome and the chicken rings burrito also hit the spot. It’s not going to be knock your socks off great Mexican cuisine, but it will do the trick if you’re in a bind and want some solid Mexican cuisine."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRFFXMXZNMHQ1ZEZVdGRtNVVUMTlaVjJoNVJVRRAB",
            "text": "It tasted like chemicals. Like they didn’t completely rinse the dish they cooked/served it in. Couldn’t finish it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaFVrMWxaMGRmVEdjeWRrSlBUelZrYUhOUlUyYxAB",
            "text": "Stopped in with my adult daughter and my husband upon her recommendation. Food was absolutely delicious. I had the chipotle chicken quesadilla and it was hands-down the best I ever I had. Can’t wait to go back! We all cleared out plates and the service was wonderful!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaVIyTjFiVTVNV1ZsT1IzUjVRa1p3ZGpCNFkwRRAB",
            "text": "The food and frozen drink are amazing! This is my Taco Tuesday spot. Real authentic food!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeE1GRXpjMUUzY1dSV01DMUZRMTlQU20xalpuYxAB",
            "text": "Food is amazing!! And always delivered on time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VlYxWkVUVGwxZG5OVGRrNU9USFZVVVRGM0xVRRAB",
            "text": "We had a chorizo quesadilla and a carnitas enchilada, and both were excellent!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRk0zQldSbmw1U2pOQk5VZ3hTM0ZIYVRoNVVWRRAB",
            "text": "The food is very tasty especially the quesadillas and the burritos"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdWs2cTZJNmVEQS13RRAB",
            "text": "Good tacos and even better customer service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQeXkwS2pJMmJmZjVRRRAB",
            "text": "Steak tacos and henny colada.... you absolutely cannot go wrong. Great food, great service, great prices!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPNzN0TWpCd295QllnEAE",
            "text": "Solid food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc2RlbTNnRRAB",
            "text": "Very poor packaging -- my three pork belly tacos were no longer in taco format, but taco salad format. Didn't matter much anyways, because they were awful. Not sure how you dry out pork belly, but they managed to do it. May have been edible…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLWFXMXNBRRAB",
            "text": "Gave this place another chance but the food was still bland and the margarita was awful."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdUkybUFnEAE",
            "text": "I’ve been getting the BTC special burrito with carne asada for years. The best burrito I’ve ever had. I don’t even live in the area but every time I’m here I have to get it and it never disappoints."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcjZPaXB3RRAB",
            "text": "Buenos tacos"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJekkybE5nEAE",
            "text": "One of the best birria places in the city. Try their birria and cheese empanadas."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMWQ2anN3RRAB",
            "text": "I ordered chicken quesadillas. i was charged an extra dollar for sour cream but did not receive the sour cream. Also, the quesadillas was soooooooooo greasy it was almost inedible. 5/10."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcVAzZFhREAE",
            "text": "It's a small place but comfortable. The food which is Mexican style with a little Dominican touch is very good and different."
        },
        {
            "date": "7달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NE1XU0JREAE",
            "text": "Tout est excellent et le personnel est d’une amabilité qui donne envie de revenir. Nous sommes venus 3 fois au cours de notre séjour de 10 jours. Jamais déçu, toujours un délice.\nMerci pour l’accueil, pour votre gentillesse et vos excellents tacos et burritos !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bjlpTW5BRRAB",
            "text": "Delicious food! Always my go to spot when I’m in the area! I love their burritos and nachos the most. But they also make amazing bowls as well."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbzhLMW1nRRAB",
            "text": "Having recently moved to Bushwick, I’ve been looking for some tacos like my mama would make. I know I’ll never find anything quite the same but Bushwick Taco Company is pretty good. Meat is well portioned and seasoned. Salsas they serve you are delicious and have heat. The one thing I was perplexed was that they add lettuce/cabbage (I’m not sure which one) to the taco alongside then usual cilantro and onion. Staff was friendly. Seating area is small so not suitable for large parties. 2 tacos and a soda came to around $13. I’ll have to come back and try more of the items as I only had a small selection of their extensive menu."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdUp2MDRnRRAB",
            "text": "The tinga bowl hits the spot 😮‍💨 Horchata is delicious too, thick and cinnamony, not watery like some other spots. Plus, prices are great for the neighborhood and the portion was on the generous side.\n\nThe spot is on the smaller side, more of a pick up and go type place with some small tables and a counter to sit at."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdDl2bW9RRRAB",
            "text": "Enjoyed the food & friendly service. Definitely would order food from here again. The queso-birria taco 🌮 was delish and the tres leches was super soft and tasty. They also have premade margaritas and frozen drinks"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMy02WUlREAE",
            "text": "Best tacos in brooklyn!! Everything we got was delicious and fresh."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfajlDME53EAE",
            "text": "the food here is absolutely delicious! the foods better than chipotle honestly lol, especially the steak burritos. my mom went recently off of a recommendation and she also said that everything at this place is amazing, 11/10!!!👏👏"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbzVIci1RRRAB",
            "text": "Un sitio para comer tacos perfecto en Brooklyn. La gente muy amable y el trato perfecto. Lo recomiendo."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNS1LNTdnRRAB",
            "text": "✨✨✨✨✨✨✨"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmeHVYbE1nEAE",
            "text": "I was waiting in line for pickup next to be called she then calls the dude who came in behind racist much yes"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OG92XzJ3RRAB",
            "text": "Love this place"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LU5yUnB3RRAB",
            "text": "I ordered a burrito for take out and waited 30 minutes for them to finish it. After I got it it was cold and soggy. Save yourself the trouble and stay away from here"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzb0xMYml3RRAB",
            "text": "Absolutely incredible"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzODhXSEJnEAE",
            "text": "This review is strictly for the knickerbocker location. The customer service at this location is horrible. The woman at the counter is rude and unwelcoming. Although you greet her she is reluctant to respond. She is very uninterested in assisting with your order. I will not spend a dime here and will support another business that values your business."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMza2NiQmVREAE",
            "text": "Ordered birria from here last night and forgot that I’ve ordered from this restaurant previously and was disappointed. Meat had a lot of large chunks of chewy fat- didn’t seem like the meat was slow cooked at all. They may have sent steak tacos instead of actual birria."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueTh6ZkxBEAE",
            "text": "Very good tacos 🌮🌮"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMk9PUGx3RRAB",
            "text": "Quick pick up place for traditional & Americanized Mexican food. The elote comes refrigerated cold. Mole is delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3d3BMaGVnEAE",
            "text": "The food is so sogood; the delivery person is so so bad. He refuses to leave his vehicle to deliver food and expects you to come meet him if he sees your tip is \"low\". He repeatedly texts you until you give up and go meet him. I used to order twice a week from here, and haven't in weeks after my final straw with this delivery. There's a reason some of us select \"no contact\" on apps. Enjoy the covid I likely gave you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiN0xETG53RRAB",
            "text": "Everything on the menu tastes fresh and flavorful. Nice small seating area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMmQ2Z2lRRRAB",
            "text": "A hidden gem in the neighboring!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbnZ2b29nRRAB",
            "text": "Very delicious food and drinks 🍸 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOcWJxY1d3EAE",
            "text": "Probably the best tacos I’ve had in New York. Ordered 8 tacos, churros and chips with guac for ~$50, and service was also great. Location is also pretty great, around a 10 minute walk from the L stop. Would definitely come back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycExydVlnEAE",
            "text": "Till date the best Mexican food i ever tried!! Very authentic food and local Mexican staff!! I ordered a mushroom and spinach torta (sandwich). I wasn't sure what to order but the staff was nice enough to guide me with everything. The sandwich itself was very delicious and perfectly cooked! All the ingredients used were very fresh, even the bread was amazing. They provide green(less spicy) and red (very spicy)sauces with it. Excellent packaging. They have dine in option available too for around 10-12 people. Overall very good experience, will definitely go again to try different things!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNka1Bmdm5BRRAB",
            "text": "This is actually beyond’s insane, i ordered from uber eats and the size is crazy for the price. I’ve had better food for a reasonable price and more product than this. 9$ guacamole and the amount they give is crazy. Now i dont really mind because i understand how expensive it is to make but the SAME CUP AND LESS AMOUNT for the consommé is insane  ….. filled up half way in a tiny cup for 3 tacos????! everytime i get birria tacos takeout i get a coffee cup size, plus the birria dosent taste/look  authentic. No cheese it is placed like a regular taco dipped in the consommé."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLdXUyU1JBEAE",
            "text": "We came here for a quick lunch as we were in the area. We decided to eat-in. The restaurant was empty but, they had a steady stream of deliveries and takeout orders. The restaurant had 3 tables with two chairs each and a hand sanitizer bottle by the entrance. The table service was non-existent. They took orders and dropped off food and the bill. They didn't check in and they forgot items when we ordered. They two women spent most of the time chatting among themselves or handling customers that came in.\n\nWe got an order of guac and chips ($7.50) to share. The chips and guac was okay but, nothing noteworthy. We noticed that the chips seemed homemade but, they didn't add any salt to them. When added green and red sauce to the guac and it made the guac more flavorful.\n\nLittle Ram got an order of goat tacos for $13. They thought it was okay but, they were hungry after consuming the tacos. I felt for that price they should have included a small side.\n\nI ordered the chicken tinga bowl for $9 (not including additional add-ons). I added in sour cream and guac which cost extra. Personally, I felt that this bowl was lacking for this price point. The flavor was decent but, I felt like there was more lettuce than rice and sour cream shouldn't be extra. I honestly felt like I was eating a salad and not a rice bowl.\n\nJammy Jam got an Al Pastor bowl for $9 (not including additional add-ons). They ordered guac and fajitas veggies for $1.50-ish for each add-on. They said the flavor was lacking but, that it was tasty. They said there wasn't anything that was noteworthy. They felt that Qboda has better flavor and value for the price point.\n\nWe also ordered horchatas ($2.75) and it was okay. My friends remarked it tasted like weak tea. The churros for $8 was okay. I am not sure if the churro had a filling or if it was under cooked. I thought it was okay but, Little and Jam enjoyed them. I found the chocolate dipping sauce to be very rich and strong.\n\nI am kinda torn. I like that this is a cute neighborhood spot but, I felt that the flavor was lacking and not noteworthy.  There was nothing that made this spot stick out from other places. The prices are affordable but, quickly add up when you add in extras like onion/peppers, pico de gallo, sour cream, and guac. I felt like some of these items should be included in the cost of the bowl because the bowl itself seemed a bit meager by itself."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4X3ZLaEhREAE",
            "text": "Great spot! Loved the Chipotle Chicken burrito. The burritos are a great size and a great price. The horchata wasn’t too sweet which is fantastic. The staff were really nice and FAST! Would come back for sure."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwN3A2enpBRRAB",
            "text": "They're good days and  bad days.\nSometimes you get your food hot some days its cold.\n\nUpdate 8/2020\n\nMy guess is I didn't learn my lesson.\n\nI found a piece of thigh bone in my chicken burrito bowl. My rice was in heavy clumps, the lettuces was wilted, and my patience is thin.\n\nMy guest ending up eating my meal.\n\nThe only thing that I liked was the shrimp 🍤  tacos for some reason that is always on point but today they forgot to put radishes\n\nThe earlier post done a week ago about the employees sometimes wearing mask is disappointing and disturbing."
        },
        {
            "date": "수정일: 6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwLXZ2cEZREAE",
            "text": "Encontramos en @BuswickTacoCompany , una pequeña taquería,  en donde el servicio es amable y atento , los tacos son bastante buenos y bien servidos,  yo me comí el burrito de espinaca y hongos , bastante recomendable, lo mejor fueron los…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCLVBXLURnEAE",
            "text": "Ordered takeout this food was nasty the birria is def not the best in town not flavor at all it was bad and the tacos were so small and barley got any soup less than half in the container ! Adding pictures for any one in question to see . Do not order these !!! If you want a real Birria taco experience"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NHNQSVpBEAE",
            "text": "No idea how this place gets more than 4 stars. We just ordered out, two pastor tacos, two beef, one enchilada and a chicken burrito. I can’t even explain how there was literally no taste or seasoning in any of the items. Had to bring out the salt and sauces to overcome the otherwise tasteless food.\n\nTacos were mediocre, the beef was over cooked in steam.\n\nThe enchilada was disgusting, had like a few bites and noticed how sour everything tasted including the sour cream.\n\nBurrito was alright.\n\nThis place is just trash, if you want Mexican food please go elsewhere. I wouldn’t even want to feed this to people I didn’t like."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyLXVPTFl3EAE",
            "text": "Hands down one of my favorite places to eat/order takeout in Bushwick! I’ve ordered here a couple times but just recently ordered the chicken enchilada with verde sauce, and the chips and salsa. The salsa is insanelyyyyy good & the enchilada/rice/beans all had so much flavor I was so impressed, I didn’t want to stop eating it. Most times chicken enchiladas at other restaurants are so dry but however they do it here is done perfectly! The lady working the counter was really nice also! **I took a picture of the food after I had started eating because I was blown away by how good it was haha"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHaDlUbUtREAE",
            "text": "It’s only authentic to the hippies that go there. Should have went to the taco truck instead. The Al Pastor tacos flavorless. The tortilla weird taste. They add the green sauce on top of all my tacos. Any real authentic spot would give it…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoaUxpMzBRRRAB",
            "text": "Super yummy! Relaxing and just great food and drinks."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcXFhV0NREAE",
            "text": "No complaints about the service. But the food had no flavor, they tasted weird, like it wasn’t well cooked. Just order from somewhere else if you want real Mexican food. Couldn’t finish and had to throw it away."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaDR1RVJ3EAE",
            "text": "My son took me here for lunch. Everything we ordered was delicious. We had buffalo wings, loaded nachos, a steak burrito,  a steak bowl, & a frozen passionfruit margarita, which was full of flavor. I just thought it needed a little more tequila. I will be going back for more. My son loved everything as well. Two thumbs up. Keep up the great work guys‼️ Our server was so attentive & friendly. Such a sweet young lady."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReEl1dmZ3EAE",
            "text": "I miss my husband and home....then walking one lonely night I saw the gleaming lights from their sign! It was like the clouds cleared and nostalgia hit me with some good food from back home. I’m used to tacos being small since that’s how…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbnF5OGh3RRAB",
            "text": "This is supposed to be carne asada, we ordered extra protein. It was so burnt that it was inedible. Beyond charred, like stringy and dusty. It was disgusting. Waste of money. Took a few bites of rice and threw it out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNzhhZXlnRRAB",
            "text": "This is what they call falafel - I would give zero stars if possible - this is nyc if you don't know how to make falafel hire someone who can"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpb2NySkVBEAE",
            "text": "Ordered churros and got nachos which were horrible and 3 milk cake that I dnt even eat and would never!! Oh yeah and I overly amount of utensils which is just a waste. Never again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREM3Fyc2hBRRAB",
            "text": "Food was bad quality, ordered a veggie BTC burrito it was only rice. Not joking the entire inside was just rice, waited 20 minutes for a pick up order that the app said was ready. They were slammed so that was understandable but the burrito was unacceptable, it was a bummer as I was excited to try this spot. The energy is nice and lively probably good and busy Friday night bite"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsc05EWmNREAE",
            "text": "Very good steak taco, a little chilly when the door opens! Small place. Coladas are strong 😌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUMmZIc3lnRRAB",
            "text": "Price and portion was good, food was ok."
        }
    ],
    "reviews_count": 71
}