{
    "name": "Bake & Things",
    "place_id": "ChIJr7J3n01bwokRzY07n8OQXjw",
    "grid": "BK14",
    "address": "1489 Flatbush Ave, Brooklyn, NY 11210, USA",
    "rating": 4,
    "user_ratings_total": 696,
    "phone_number": "(718) 434-1080",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RWEweFNNRTAzZWxWMFRsRjVXWFpxWkZsUWFIYxAB",
            "text": "Stopped by and grabbed a bake and saltfish which was amazing. The bake was nice and fluffy yet crispy and slightly sweet. Saltfish was cooked perfect with no bones at all. I would definitely stop by again if im in the area!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKblVFaHdTSEJIYVMxbE56Y3hSRFEwZVU1U1VrRRAB",
            "text": "I recently went here with 2 family members. I was boasting about this place for several days. We were coming from out of town and I refused to eat anything until we went here first.\n\nI recently moved to Florida and was missing the food from here for a while. Needless to say I was highly embarrassed. From the time we walked in, the line was unorganized.\n\nSeveral people walked in, shouted food orders over us, and got their food before me. Including several patrons who were already in line in front of us.\n\nWhen I said something, the workers only responded, they are regulars and they already know what they want. After a 20 minute wait, I finally got to order. The most unprofessional thing I've ever seen. You can't do that at McDonald's.  Why can't I have the same respect in my Trinidadian community and my Trinidadian restaurants\n\nWe finally got a chance to order. Got 4 large meals to share. Which were all great. When I get to the last bite of my food, I feel an unfamiliar crunch in my bhaji (spinach). I spit it out and to my horror I see a large Red Lantern Beetle.\n\nI was immediately horrified, disgusted, and sick to my stomach.\n\nThe next day I went back to show them. I don't ask them for a refund. Was just showing concern as a loyal patron for many years. (Over 10 years).\n\nTo my surprise I was matched with hostility. I was told it must have came from my house.\n\nDon't ever get food from here. Unless you like curry cockroaches, because that's what I ate for dinner."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdmVsOTZXblJ3VWpOMFIxaERlV1UxYVROWVFWRRAB",
            "text": "Delicious food. Tons of variety. Tons of food as well with your order. And very friendly, helpful people behind the counter."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pab1pUWXdUME5PZDNSbWFtVlJiR0pwTUVaUE9XYxAB",
            "text": "If you know, you know! 👍🏾"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVE9FdEdjSE5uWlZaSWNEbDBTbXhLTmxsWmVGRRAB",
            "text": "Sadly, the food I ordered today was awful.  Curry chicken, white rice, pumpkin and okra.  The Curry chicken had no flavor, no curry taste or seasoning at all, yuk!  The okra was tasteless and under cooked. Each piece had hard strings I had to spit out so not to choke.  I threw it out.  I asked for extra gravy, there was none.  I should have went to Golden Krust."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMVlrZEZjazExY3poWmVVaENVRWd5VXkxWllWRRAB",
            "text": "Taste wise food was delicious but 4 Pieces of oxtail in a large plate is just ridiculous"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ZlZFcFZUMWxYUVdZM2JWQkZiV1IzUVcxRGNVRRAB",
            "text": "Straight up barely ok. Smh."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSFZXZHZlVEJyTlZKdVQxOW5NRGxqVUdsNWJIYxAB",
            "text": "The old lady that made my food was very stingy with it for all the money I spent !! I come from far to get food here won’t be back any time soon ! Why raise the price and lower the amount of food you get and think you are going to keep your customers . Sad and stingy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeFVqQTRMVzg1YVV3d1MxVnFNemw2Um1Oa2IyYxAB",
            "text": "I recently ordered food for a party from this restaurant. It was sooo good! I received many compliments from my friends and family. They all asked where I got the food from, and I told them Bake & Things. I ordered roti skins, curry chicken, potatoes & chana, jerk chicken, rice & peas, and plantain. I placed my order on a Thursday for pickup on Saturday morning. The food was prepared and ready to go when I got there. I have ordered from there a few times before for parties, and already knew that the food was amazing! Thank you for making the ordering process easy, and allowing just a few days notice to prepare a feast! And the people are so nice. They even helped put the food in my car. I’m very appreciative! You’ll always have a customer right here. I must say that I love my Trini food, and I miss having caribbean restaurants close by. Now that I am further away, it’s difficult to find good Trini food. Glad that I can always rely on Bake & Things when I am in the area, or need to cater an event. Thank you again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMlNGRlJjWFpWVTBkcWExbFhkelpaU1U5Q1FXYxAB",
            "text": "The workers was so rude and never got the order right"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podGNUWlViVkV5YlRCVk5rSlRibVpHZDJOS2VGRRAB",
            "text": "The bake and shark was plain, I thought it would at least come with a pineapple, I asked for everything on it🤷🏻‍♂️…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWelMyNUdiSFZ5U1daTVNUQnpSbkF6UzBremNuYxAB",
            "text": "Bake and salt fish was delectable 😋 passion fruit juice was delicious 🤤"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQTDNzNjZVd3RDeWlBRRAB",
            "text": "I used to go to this restaurant all the time when I lived in the area. Their roti was always good so I stopped and get one while visiting my Dr office recently. I ordered a curry got roti and when  eating it there was barely curry goat meat…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcU5yTkRNeUtUSm1BRRAB",
            "text": "Amazing food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNDVxNXB3RRAB",
            "text": "Love the food but today I got some bad service, and it's made me rethink eating there.(this review is about the young light-skinned girl with the wig and them baby hairs) 10:37am in the morning day before easter, you gotta have an attitude cuz of how I gave my money. I ordered a doubles, gave 5.55 for a 2.72. Shorty catching attitude because I gave the extra cents so I would get back less change. She's muttering to herself. Bro I work in food, I have to greet the customer. How she went about handling me was unprofessional. Then I tried to inform her that the service wasn't the best in an orderly manner and she walked off. Okay then. I only just starting eating here, the doubles is $2.50. Like brother I'm going to a whole other neighborhood for this when my own sells it for 2.00 just made differently. I understand I'm not one of those customers spending a whole Burkina bag, but I was still a customer. Now? No, I'm good. Serve doubles to someone else cuz my patronage clearly ain't wanted. And it's not even like I'm mad, I'm just taken aback and disgusted because I WORK IN FOOD. That is not how you handle a customer, even if you feel they are doing foolishness. I'll see yall a few months from now cuz im good right now. I don't need to make myself quarrel on deaf ears. Bro like shorty was stink. If you see this, your attitude makes me not want to eat at the shop. ✨️\n\nEdit, i feel bad saying this, but the doubles is salty man. Still gonna eat it, but I drink a lot of water. Still taste good to me, just a lil too much salt"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJenFEc3JnRRAB",
            "text": "I ordered buss up shots n chicken curry\nThey gave me roti skin which was really under cook gooey smdh"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOU9PRGdnRRAB",
            "text": "Omg the Oxtail and peas and rice with callaloo was sooooo good.My hubby had the curry goat peas and rice and callaloo he loveeeeddd it❤️❤️😋😋😋😋We live in Jersey we plan to go back asap 🇹🇹 ❤️"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYckstdkpnEAE",
            "text": "I will never spend another penny here ever again. I would rather starve than buy anything from here again. I used to be a big supporter of this location for years, but seeing how stingy they are becoming with the meat portion in your food,…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNTlUYU13EAE",
            "text": "I went there yesterday to get a slice of macoroni pie and it looked weeks old I decided to try a little piece just in case and it gave me food poisoning and ended up in the hospital, don’t come here"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBa19XYkZ3EAE",
            "text": "The food is amazing. The roti's are a must have. My favorite is the doubles and the pholourie with tamarind sauce. The pholourie sells out fast so good and get it as early as you can.\n\nHowever the callaloo is good but not a Trinidadian callalloo you still have whole leaves when it's supposed to be a puree. It still tastes amazing however."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBN1BqS2RREAE",
            "text": "Best roti in Brooklyn"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNnJlOEJREAE",
            "text": "Ah little taste of the Caribbean, love the food"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeDRQVVJREAE",
            "text": "Authentic"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcnBlRTNnRRAB",
            "text": "Ordered 4 bake and herrings and didn’t enjoy it at all waste of my money went I. The garbage the herring have too many bones either Granny can’t see good anymore or they just don’t care so just lost a great customer for the New Year I work hard for my $$$$ see all the bones for yaself!!!!!!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbHBEem9RRRAB",
            "text": "Been going to this place for many years the food was good  but over the years the quality have dropped drastically, recently I got a seamoss punch from this place and it was terrible, when I went to empty out in my sink , I saw ice and egg shells in the punch , when I went to report this at the store I was cursed out and shouted at by the staff , after many years of being a customer they thought I was lying about a $7.50 punch , to whom it may concern do better , your store will soon close down with workers like that , i promise you"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dGV2VzV3RRAB",
            "text": "If they had a Trinidad flag hanging up in there, I would have ripped it down. This food is terrible and not representative of the flavorful dishes of Trinidad."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2a2N6TnlRRRAB",
            "text": "Anyone that is Caribbean I would advise you not to eat here. You might as well throw your money away. I bought 2 doubles, a fish pie, an aloo pie and a red solo. It was so bad I didn’t even drink the solo."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQODZlNXJnRRAB",
            "text": "Was craving some bake and shark awhile ago. I was in the area and check and see that they were selling it. I bought one which lucky i did for safety. I was excited but when I got home it was just plain. They did add tamarind sauce but not alot. When I put it in the microwave it was so dry and salty. The bake also was old.The ladies that work there was nice though. It was $7 and change which wasn't to bad based on what I was seeing. Definitely would not recommend or return"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzakszejdnRRAB",
            "text": "I always go here for a roti every time I am in Flatbush. It's delicious and the staff is friendly and funny, especially Trevon"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdE5DR25nRRAB",
            "text": "The Bake and Shark is good, but it’s disturbing eating and picking out huge pieces of bone. In addition, once the bones are removed not much shark is left….so what am I really paying for. Smh. Don’t think it’s worth the price. Lastly, I added spinach and extra tamarind sauce (for extra fee)to it, which was a delicious addition."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNDl2VE9nEAE",
            "text": "Had there fish soup a few times, and it was delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNnVucjFBRRAB",
            "text": "I had food from here a few times, in the past it was okay. Though my recent fish dinner was horrible. The rice had a weird taste and the fish seemed like it was over cooked and dried out. The food is too inconsistent not worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNud1l1MUZnEAE",
            "text": "Plastic wrap in my doubles…. If you’re going to have a bad attitude - at least have safe good food to make up for it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuanFHUVFREAE",
            "text": "I live 45 minutes away in New Lots Ave  . I travel everyday for Over 20 years , my first work(Job) i ever got was in This  Bake & Things Restaurant I moved on to construction work . I will always make this sacrifice to get this good quality food and excellent service.  Every time I leave  $4 tip for the hard workers there doing there best . Keep Up the Excellent work"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIODdMNThnRRAB",
            "text": "Curry goat ; taste nasty and had more bones than meat. Never again 🤮👎🏽👎🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIaXEtSzVBRRAB",
            "text": "it’s always the same young guy in the back with the attitude moving in slow motion. You guys need to train him on proper customer service especially early in the morning leave that nasty attitude in yuh bed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaU4zdnpRRRAB",
            "text": "I use to pass here all the time one day I decided to go inside and honestly I been going everyday since love the bake& Saltfish"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1a2RfcTZRRRAB",
            "text": "The doubles here have the perfect spice and sweet mix! When I went they didn’t have anymore fry bake only roast bake but the roast bake with boneless curry chicken was sooo good! Get it with tamarind sauce. The sorrel here was also very tasty and full of all the ginger and allspice notes a homemade sorrel should have. Good trini spot here!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLN09QXzdnRRAB",
            "text": "Go to place to get a bake and salt fish or Quaker Oats porridge in the morning. Love their oats porridge. Convenient location not too far from Flatbush junction.\n*Update*\nTheir prices went up (which most places have due to “Covid”) and their portions got smaller. Ordered a bake and salt fish twice last month after haven’t been there in months and was shocked at the small size. Basically four bites or so and it’s done.  Bakes aren’t made consistently because the lady after me ordered two. One of hers were the same size as the bake I had and the other was almost double in size. Salt fish was also very oily."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNWRmZWJREAE",
            "text": "Great tasting food and reasonably priced!  Not too many places left in NYC or Brooklyn where you can get so much food for so little price.  The Doubles are on point and not soupy like some other places.  You can get their signature Bakes with pretty much anything on the menu!  Definitely worth the money and wait when it gets busy.\n\nService is good especially when you become a regular and get to know the staff.  Their Sorrel drink is also some of the best for a restaurant.\n\nPros: They pack so much food in the containers that it's bursting at the seams.\n\nCons: They pack so much food in the containers that it's bursting at the seams!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXbnRUZ2F3EAE",
            "text": "Absolutely delicious and fresh. Their bake and saltfish is delicious. The sauces were so good. I definitely recommend this place. I can't wait to go back and get more."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhazhqMHZ3RRAB",
            "text": "i visited bake n things this morning for roti skins and let me tell u this buss up shut roti skin was the worst!!! the roti was very very hard and lumpy not at all fluffy and fresh. i’m sorry but i had to post the truth! For $3 this is the worst! Manager you need a better roti maker or to just make fresh roti everyday!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dDVYT213RRAB",
            "text": "TERRIBLE TERRIBLE TERRIBLE I work very close to this restaurant. I was very disappointed with the server. She was not only rude to me but very condescending when I ordered my meal. When I arrived to my desk at my office, I noticed that…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMzlYX19BRRAB",
            "text": "I ate their soup and it was delicious.  I went back the following week and bought their soup and it was so horrible that I got food poisoning from it.  Five years later my daughter is there and I ask her to bring me a shrimp doubles.  It ran me straight to the restroom.  Never again!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJdC1TMlh3EAE",
            "text": "Not sure which location is better. But both are pretty good not a fan of the way they make calaloo nor roti nor doubles I like a different sort a dough but that's just my preference I assume..but their fish soup is great love it most of the time it always hits the spot mauby is good also"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVZ19XYzN3RRAB",
            "text": "Clean .... Great service... inexpensive .l and the Curry Chicken Roti mmmmmmm mmmmmm good"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZNW9lS1FBEAE",
            "text": "I brought  this roti for my daughter she loves roti even though it's  a vegetable  roti with Potatoes, channa and pumpkin for $7.00 i think is a little to much but i dont  mind she lives in Virginia i got it for her."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdEpLQWFREAE",
            "text": "Bake and salt fish is amazing ✔️✔️\nBoneless chicken roti is amazing ✔️✔️\nStaff is great, love this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENF82eWNREAE",
            "text": "I got their special which was curry crab dumplings and dhal and also fish soup, 1st the attitude of the workers STINKS they are not organized and it took three people to serve me, the cashier disrespectful. I know what curry taste like and that wasn’t it and the most water down soup it seems like they ran out of liquid for the soup and just poured water back without adding seasoning , it was horrible tasting I couldn’t eat it so I threw it away"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaEpUUk1REAE",
            "text": "When I was new to the neighborhood I walked into this place and asked them to educate me about their dishes (I am Asian). They were all very accommodating and spent some time explaining certain dishes to me. Because of Bake and Things, I learned about buss-up shot and became a raving fan. I would go there often to order it. I have since moved to East Flatbush, but continue to patronize the branch they have there on Church Avenue."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6cDZ5aG13RRAB",
            "text": "I heard so much about this place. A friend and I finally made it there. Now because I believe in honesty, let me state that upon ordering my Roti, I failed to specify \"BUSUPSHOT\"  When I got my order, I noticed it was not B U S. That was my error. Upon the managers discretion, he accommodated me by giving me the skin of a B U S. Good. Let me just say that it was supposed to be Curry Chicken Roti.  Lemme tell you, dem kiant touch Jamaicans when it come to dem tings deh. There was NO GRAVY, CHICKEN PIECES OF THE BREAST were the size of tangerines, and they were dry as hell. The busupshot skin was dry like eczema and the salt gave me a headache till the next day. I will admit there was flavor in the curry, but who wahn yam flava wen dem hungry?  Maybe they do cater to those that come regularly but it only takes 1 time fi mi. Btw, I gave the manager my review personally on 6/4/2024. I jus needed to know if he was Trini. He said he was Jamaican but the cook was Trinidadian. I told him how horrible it was (roti) and to let his cook know how horrible it was. Maybe that wasn't the day to go there but good luck to those who patronize them. I'd find the nearest Golden Crust b4 going there again. All hype ain't good hype. Oh, and we dined in.\nStill, all the best to your bizness."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMMmN2WHVBRRAB",
            "text": "Sad to say but as a fellow Caribbean, the food was below average. I bought doubles, the Channa was hard and dry, no gravy, no seasoning and bland. You can literally count each Channa without separating them ! I was embarrassed because I bought for my American coworkers to try. The rice & peas was burnt. You could literally see the burnt black pieces (not the rice). Whoever these cooks are, they making this business look really BAD !!!!! DEFINITELY not a true representation to Caribbean cuisine. 👎🏽👎🏽👎🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqajRERWdBRRAB",
            "text": "Went in here on 4/26 I was craving a roti so I decided to stop in the spot since it was close to home. I ordered a buss up with goat and a chicken roti, the young lady disappeared in the back after placing my order which had me thinking why because all the food is right here in the front. She shows back up with the buss up and a roti skin and a container with heavy Chana on it, she scoops up two scoops of goat mostly gravy and bone and slaps it in the container, she then scoops up some chicken for the roti so I ask her where is the potatoes and she decides to tell me there is no more which I feel like she should have mentioned when I placed my order. So I had to ask her how much is extra goat and she said $4 so I said ok. Once I got home and started eating let me just say that this is by far the worst roti I have tasted! I hate to talk bad about a black owned business but it reasons like this why these places fail and go out of business. The buss up tasted like it was warmed up in the microwave as it was dry and tuff! The goat was salty! The chicken and Chana was bland !!! This place will not be around much longer with this type of food!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4N2RYX1F3EAE",
            "text": "The food, I have to honestly say is hit or miss. I've picked up food that was amazing and then there are times it is not good. Like the last time I went to get Shrimp Roti. The skin was hard, the shrimp wasn't great and it wasn't seasoned as it usually is. Just disappointed. I won't totally bash because I've had it where it was amazing. It's inconsistent and that's an issue. The service is usually pleasant though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MU9MNTRBRRAB",
            "text": "I will always be a supporter and will still purchase from this establishment. However, two items have changed..the doubles tastes dry, lacking sauce. The coconut bake has no coconut..the first thing you taste is sugar..it tastes like sugar and milk.."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVcE0zVW13RRAB",
            "text": "Love the specials! The dumplings that goes with the fish is amazing! They say it's cassava dumplings. Yum😍. Miss Pat has a lot of patience and she knows how to satisfy the customers! Great staff!\n\nThis is an update...Got to  complain  about  a new staff member...she is very rude! Not happy about her. The guys are amazing!\nNow I only feel like going in the afternoon when the guys are there. So disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibjhXQktBEAE",
            "text": "Place is small, there was a young lady at the register seems like she did not want to be there. Very rude and unwelcoming. Food was horrible, the saltfish seemed to be from the day before. Overpriced and stale. Avoid"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3LXV6VDJnRRAB",
            "text": "Love their food. They have a good variety of Trinidadian / Caribbean food. It’s so good. I usually get their buss up curry goat and a few doubles. That usually is good for 2 meals. They do take cash and cards now. Support ya black owned business!"
        }
    ],
    "reviews_count": 58
}