{
    "name": "Good Hope",
    "place_id": "ChIJeYpy7KxEwokRwkZ58pQQZ_w",
    "grid": "BK14",
    "address": "1683 Flatbush Ave, Brooklyn, NY 11210, USA",
    "rating": 3.8,
    "user_ratings_total": 382,
    "phone_number": "(718) 692-4274",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcFNqRnNaSFJMYlVwVU16bDFORFJxWjNCNWRHYxAB",
            "text": "Actually ordered a delivery. Ordered stew chicken and they sent me a bunch of cut itty bitty pieces of chicken and barely any gravy. Such a disappointment"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQ00yczNNRFF4TjFkT2VGbFJlVGhmY0hkbFMxRRAB",
            "text": "They sell authentic Jamaican curry goat"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MVdEWmFaM2RPZHkxaFQyeFpTSEJSWkZaclltYxAB",
            "text": "Fine experience, but temporarily closed."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5dk9MV01REAE",
            "text": "This can't be the original owner this food is not the same😡"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GeVJqRlVSSFoxWldGWmJYUnhiV3RKWTJOTVpFRRAB",
            "text": "The food was delicious, fresh and flavorful. I ordered veggie rice with curry shrimp, which was chuck full off veggies and the shrimp was flavorful with fresh ginger. The beef patty was fresh and tasty and the fried shrimp sold by the piece was crispy, large and not overcooked. So glad we stopped here for a quick lunch and the 2 ladies there were both warm and friendly. Such a pleasant experience. I’ll be back when in the neighborhood."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNE9HWXRRWGRYWVRWcmJubDZSa0pWVUUweVRIYxAB",
            "text": "Overpriced and over salted"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNNjlwOTY0cGR1Mmx3RRAB",
            "text": "I went to this place sometime a month ago. I placed and paid for two orders. After I was given my food the elderly lady adamantly accused me of not paying for my meals. She was very degrading and disrespectful towards me. I then showed her the receipt and at that moment she back off. I’m a respectful transit employee and luv this restaurant. I’ve recommended this to many workers. But no more."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKLUdqSWoxOE1QTnFnRRAB",
            "text": "I haven't had a positive experience there; I ate there twice and became unwell. My stomach is quite sensitive to certain cooking methods, and I can often tell when food isn't freshly prepared.\n\nService, I'll say, is Mid. Nothing stood out to me."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOTEdvNC1CcC1xaGdnRRAB",
            "text": "The jerk chicken has great flavor  but they served it cold to me , service was slow I was the only costumer in the store but the ladies were talking each other’s and take their time to serve me !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQ0prdEdzMWNpX1VREAE",
            "text": "The food was incredibly fresh and absolutely delicious! We ordered the oxtail and goat curry plates—both were full of flavor and came in very generous portions. The ladies working there were so lovely and helpful, making the whole experience even better. We’re definitely coming back for more of this amazing Jamaican food. Highly recommend!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpaF9qelFBEAE",
            "text": "The food is great. Servers are always pleasant."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNklUaGZnEAE",
            "text": "Ordered fry chicken large meal so I wanted mac and cheese and pasta so original the price was $14.00 plus $12.00 for extra side know I don't have a problem paying for my food but when you getting robbed it is a issue I also ordered jerk chicken with rice and peas $12.00 and got stew chicken with rice and peas instead and also had to pay $4.00 extra for green salad and plantains when I was eating the fry chicken it was not tasting good like they fried it in fish oil you can taste it and smell the fish oil like it was spoiled surely I would not be going back to the establishment. Beware."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJakxTRG13RRAB",
            "text": "Food has fell off tremendously linked really my cheese look like that and I paid my money and my porridge was salt. My saltfish font have a lik of salt left in it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcGJlbnRnRRAB",
            "text": "I ordered online through Uber eats, the cod fish cake had a piece of plastic inside of it. Uber offered me no refund, I had a small get together and a guess discovered it. I won't be ordering online or outside for a long time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Z0txNmh3RRAB",
            "text": "Just the way mama left it😋"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3elppa3p3RRAB",
            "text": "Walked in, made eye contact with an employee (or was it a scowl?)- thought we had a moment. Anyway, she looked away, helped someone else, then disappeared to the back for what I assume was an important coworker summit. Never acknowledged me. I walked out."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNU9PcDNRRRAB",
            "text": "Placed an order and it was sent to the wrong restaurant.  I called to cancel and also canceled it on ubereats. I didn't receive my order and was charged $48. The good hope restaurant is refusing to give me a refund hence the reason my next step is the BBB."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcnRPV2ZBEAE",
            "text": "Friendly staff. The salt fish and ground food is delicious.\nUpdate:\nRecently visited since the New Year started. Got the salt fish and provisions again, it has changed. The potatoes are hard and undercooked, it's way too spicy and no plantains."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmd3Nib1JREAE",
            "text": "This is the old stale fish they serve"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M012MkxREAE",
            "text": "The food is not the same."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzOGE3RDB3RRAB",
            "text": "Love the food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzX1BqUnVnRRAB",
            "text": "I ordered a medium Curry Chicken dinner and roti skin. The curry chicken dinner was so delicious but the roti skin taste old or stale."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYa3Mtblp3EAE",
            "text": "I asked for a jerk chicken meal with no gravy or sauce. The server gave me 2pc jerk wing and mixed it in with stew chicken. I’m disappointed. This was dishonest. I supported this restaurant heavily when I moved to the neighborhood 16 years ago."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcF9LUTBnRRAB",
            "text": "Hair was in my food and they said they couldn’t give me a refund bc there was no manager at this location. So I called the other location and they said that they are not affiliated with the Flatbush and parkside location. But have the same sign and name.. 🤦🏽‍♀️🙄"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bnFqM05nEAE",
            "text": "Will be back on another Friday for those jerk wings you can smell how good this place is from a block away truly drool worthy ♡"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbnVYV05REAE",
            "text": "Sizes & Shapes , Mac & Chee better if Ms. Plommy is there , awesome Flatbush block ( peculiar too ) no pelos en la lengua con EL LOS y muchos HUGS y besitos Pa 'ellas ( specially to the copper hair color my size kinda of attendant there who bumped on me by 6 & 52 st NY NY Bonne chance 2nd Floor & Bon appetite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5Z29pdzZ3RRAB",
            "text": "The fried dumpling doesn’t taste good … it’s drench in oil and sugar I was disappointed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaEtuVjV3RRAB",
            "text": "Great west Indian meals, unique and delicious recipes, very busy, fast service, friendly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0OHAzYWh3RRAB",
            "text": "Rude the girls that work there is not nice at all they make you feel like you’re a bother to them food is not even that great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxeThEdlp3EAE",
            "text": "Coconut milk in chicken foot soup was a no no 😔"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxa0k3c2RBEAE",
            "text": "The girl who works the counter on Thursdays is rude and difficult.  I was charged 6.64 for white rice got home no white rice.  I paid 51 dollars for my meal.  Get home no white rice.  Go back to get refund, can’t give me a refund.  So I take the money in soda’s.  Ask for two BBQ’s sauces gives me an attitude.  It’s not even about the money it’s about the principle.  Don’t be mad at me cause you messed up.  Food is alright but she acting like there ain’t a bunch of other places to get the same food from."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaHJfbTdnRRAB",
            "text": "Food was delicious and my colleagues enjoyed their Christmas lunch"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWci1IdzlnRRAB",
            "text": "Vegetables are good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWaHBHYmJREAE",
            "text": "This was my first time going in, but usually we get the soups -chicken foot, beef, chicken there and it is always really good! Definitely touches the spot especially in the winter months, though I love soup all year round!\n\nThe customer service was excellent both ladies were Amazing, unfortunately I got the names but didn’t write them down and now I can’t remember. But she set me up very nice. They also have the Jamaican sodas which I don’t drink regularly but whenever I see them I have to get the Pineapple Soda!\nHighly recommended for tasty soups that hit the spot when hungry!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMXRQTHpRRRAB",
            "text": "The food is amazing,  I think they're better than Footprints. Yesterday I ordered the oxtail and curry goat dish.  Today I ordered the jerk chicken.  Seasoning is on-par!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGLU1Hb2ZBEAE",
            "text": "The prices here are way to high . And the food is alright. Not worth the money to be honest"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1aE1YdldBEAE",
            "text": "I don't eat meat Asked for a salmon patty and was served a chicken patty .....15 years down the drain"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1a1pMTHZBRRAB",
            "text": "Good cook jamaican #food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacGIzYzFnRRAB",
            "text": "Delicious Jamaican,  other foods, and non alcoholic drinks that people from the carribbean love to cook but don't have the time to cook are served here at reasonable prices. It's right on Flatbush near Parkside Ave. Seriously, go give them a try, and their workers are cool and friendly workers. Dont let the serious faces fool you speak to them, and you will find out how nice they are."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaZ3UzcUNBEAE",
            "text": "Patrine is amazing…she does her job extremely well and I trust her with my food ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabUp1Mi1RRRAB",
            "text": "I’m annoyed by the food. A friend of mine was talking about this place, I asked for the name and paid them a visit. There I messed up at was not asking that friend how was the food. I get there and none of the food is fresh- it’s dry. VERY DRY ! Two stars because the girls were nice and assisted in a timely manner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaXZMelFnEAE",
            "text": "I promise you I never leave reviews. If you don’t wanna be frustrated, then don’t order from here!! No matter how many times you type instruction or tell it to the employees they do what they want anyways. You can ask for white rice they’ll send you brown you can ask for no salad they will send you salad you can ask for sauce on the side I promise you you won’t get it. It is almost like they play a sick game with customers."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwOHRQSUl3EAE",
            "text": "Horrible customer service..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNweVpfb2lnRRAB",
            "text": "The perfect place for Jamaican cuisine. Friendly staff and a clean establishment.  Check it out. I will definitely be back.  Yea mon..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdFB5Zmp3RRAB",
            "text": "I decided to support this alleged Jamaican Restaurant. This is the bun up Jerk Chicken the Jamaican female server packed in my bag. When I got home I was greeted with dry charred blackened chicken with no jerk sauce. The lady that served this should be deciplined. I will never step foot in this restaurant again. I would suggest that you showcase the Jerk chicken in the front so customers can see what they are purchasing. Please retrain your staff  to provide better customer service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeElud1R3EAE",
            "text": "Good Hope used to be amazing but now the aura of this place is just awful. the food is way to spicy , you can’t even taste the food!! i ordered stew chicken with rice and peas .. and it doesn’t even look or taste like stew chicken.. like i said its wayy to spicyyyy !!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHajRPZzhBRRAB",
            "text": "So I ordered large fry chicken with rice and peas and stew chicken gravy and chicken is perfect but the rice was undercooked everything you see on the side that’s just me taking that out because it’s hard please guys do better ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycllhSmF3EAE",
            "text": "The worst oxtail dinner ever in my Life. I should have read the reviews. Save your money $20 could be spent on better food. This was in the oxtail, what is this"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbWRhWm93RRAB",
            "text": "I like people who working there\nFood is good 4/5"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OE9UYm9RRRAB",
            "text": "I had a large chicken soup it was not fresh meat ,they put old chicken turning blue black in the soup.They are very disgusting, this place can get people sick !!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVekpxTzF3RRAB",
            "text": "Ordered a LG oxtail but it was more like a large rice  and the oxtail is small and tough. I’ll pass"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMC1mYUVBEAE",
            "text": "Food was good, i got oxtail w rice & salad but it did give me a stomach bug..rice was a lil undercooked...but it was still good. Prices aren't bad they mac and cheese is the best i def recommend that if u looking for something quick and…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncTktUVNREAE",
            "text": "A friend of mine who grew up in the neighborhood told me that customer service at most of the Caribbean restaurants in this area will be very different than what I am accustomed to. My first few times here proved her to be correct until they began to see me regularly, which I will explain at the end.\n\nNow let's discuss the food. In my opinion, their jerk chicken is the best around as I have tried several restaurants in the area. Not that I found a bad place, but Good Hope's jerk sauce is really good. Unfortunately I do not like bones with my meals, so I stopped sampling the jerk meals of the neighborhood after having theirs.\n\nI love their mac and cheese! I am a bit of a connoisseur, and their combination of cheese and spices makes it a very flavorful dish. For just $3, the portion is generous. It's a meal on it's own or you can make two small appetizers if you share it.\n\nOne weekend I was so sick that I hardly left my bed and was not well enough to cook. I struggled to walk the five blocks to get some air and my mac and cheese (I believe they deliver, but I have yet to do that). I spent $12 on four orders as I was lucky that they had a full, fresh tray! I enjoyed my food that weekend.\n\nGoing back to my paragraph about customer service, they now smile and immediately prepare my mac and cheese without me having to ask for it."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNneV9qWU5nEAE",
            "text": "Caribbean restaurants are saturated in Brooklyn and often times it's hard to acquire a favorite.  What I look for is good food and even better service. Good Hope delivers just that.   The food tastes just like home and the service is so…"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURneV83dUx3EAE",
            "text": "The food has always been good. The reason why I've given them a poor rating is because every time I've been there the customer service has been almost disrespectful. The woman taking the order doesn't let you finish placing your order,…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbVBXSTVRRRAB",
            "text": "I absolutely loved my food from Good Hope. The owner is a kind Jamaican woman who radiates joy. As a vegetarian, I asked her to give me the veggie option and she gave me a chickpea stew with rice, plantains, and salad. I also shared a Rasta…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURROU0yd3FnRRAB",
            "text": "Ordered Festival for a bake sale at work. Had no gas in my building or I would have made them myself. Came two days before to leave a deposit. I was assured that my order would be ready for pick up at 9 AM Friday morning. Left my phone…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcmQyS093EAE",
            "text": "The quality has really declined over time. This used to be my go to for oxtail out of all the other Caribbean spots in Flatbush but now they have the worst, toughest oxtail around. Not sure if they’re cutting corners or hired a new chef but please don’t waste your money here"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhMWNIdElnEAE",
            "text": "The Food is really good and they have good prices"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcjdpcGJ3EAE",
            "text": "This is more of a fast food style of restaurant. Meaning get it and go. The food itself that's on another level. When they're out of jerk chicken(which is at the end of the night usually)  I want to cry. I don't go anywhere else. The…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNReWFUdzVnRRAB",
            "text": "They messed up my whole order. I ordered a medium fried chicken they sent a small, I also ordered stew chicken they sent stew fish. Then I tried to call like a good 10 times and they didnt pick up.  They kept taking the phone off the hook every other time i called. Never ordering from here again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxLWJiNHdRRRAB",
            "text": "Good Hope has been a staple in the community for years!  Back in the days they even had parties n live music. Formly ran by a wonderful lady who watched me grow up n whose name was dubbed in the community simply as \"Mommy\". Mommy just wanted to feed the community n she did! One of the greatest Jamaican restaurants in Flatbush that isn't a big chain with multiple stores.\nGood Hope is a family owed mom/pop restaurant. I mostly gave a history lesson of Good Hope because the food speaks for itself! Breakfast, lunch, or dinner, you will truly be satisfied by the savory taste of Good Hope!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2M2ItVmtnRRAB",
            "text": "Order jerk chicken dinner. Chicken was not freshly cooked. Tasted day-old and was very dry. The delivery boy had the dinner in one bag and another small bag and was standing at my door. He gave me the dinner but took the small bag with him…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrbjlhbW5BRRAB",
            "text": "The cashier has a disgusting attitude and is very rude. She doesn’t know how to talk to people and honestly makes me not want to come back there just so I don’t have to see her face. No greeting what’s so ever just a angry looking face.…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBc3IzOV9RRRAB",
            "text": "I can't say enough great things about this restaurant. The food is soooooo good. You can smell the deliciousness that is Good Hope a block away. Whenever I go here I want to order a spoonful of everything on the menu. I love the staff here. They are always smiling and laughing when I talk to them."
        }
    ],
    "reviews_count": 65
}