{
    "name": "Wattli Bar & Kitchen",
    "place_id": "ChIJYU3k-TRbwokRbZyJx5oMwHg",
    "grid": "BK14",
    "address": "1505 Newkirk Ave, Brooklyn, NY 11226, USA",
    "rating": 4.5,
    "user_ratings_total": 155,
    "phone_number": "(347) 413-9790",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaFZYb3pkRGhtUlhJMlVUUjFiWFJaTUc1SWQxRRAB",
            "text": "So delicious!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNM19hRTZnRRAB",
            "text": "This place has not been fully explored yet and I don't know what people are waiting for! The drinks are made by the owner who scurries around tending to everyone with the sweetest energy. I had the salmon with wild rice which was delicious. Also the appetizer sampler of wings, scallion pancakes and spring rolls all super yummy. Washed it down with a ginger Margarita a spicy margarita and a tequila with splash of ginger ale...I opted for the chocolate cake over the cheesecake and neither is a wrong decision but that chocolate cake was delicious. This quaint lil spots ambiance is amazing. I'm heading back, hope to see you there!! Update- Still the spot to get to!!?"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbVpfWmNBEAE",
            "text": "Local \"Cheer's\" style bar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMl91cXNBRRAB",
            "text": "Great local spot for home-style comfort food, great drinks, and fantastic atmosphere. Great hidden gem in the neighborhood and the patrons and staff treat you like family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueXJqU1FnEAE",
            "text": "The Chef here does an amazing job! Everything on the menu is good! And Arber is always a gentleman."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuM0w3Z0FnEAE",
            "text": "Favorite place to eat in brooklyn, the owners are wonderful people and they run a great bar with even better food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdXE3YlFBEAE",
            "text": "Saw a few small roaches on the bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINE1IMUlBEAE",
            "text": "Wife and I went in and no one Greeted us, took a seat waited still no one approached us, we decided to just walk out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM05YTjVBRRAB",
            "text": "Love coming here every now and then with my friends to chat and drink. The owners are really nice people, too. This is our favorite drinking spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidXFpdHNnRRAB",
            "text": "It was my first time in this bar & I was finishing my last drink with a friend of mine, as the owner was sitting next to us at the bar kicking me and my friend out of the bar. She literally asked us “did you pay”  we responded yes & she tells us “okay get out”. I felt very uncomfortable & disturbed. Never going back there, I don’t recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaGFPSUhREAE",
            "text": "One of my favorite bars. Good food and drinks, chill atmosphere"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWc2JXRndnRRAB",
            "text": "This is a pretty cool local spot. I always enjoy coming here for a drink or two. They have a nice outside area to chill out and eat. The food is ok. I like the food from their small bites menu. The shrimp sliders and the appetizer sampler are decent. The shrimp was grilled nicely. Overall a nice place to visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNnMyUld3EAE",
            "text": "One of my neighborhood go-to spots. I usually go for the wings. The staff is friendly, Jerry the bartender will take good care of you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGX3RlOW13RRAB",
            "text": "This little hole in the wall kind of bar/restaurant has been on my radar to try out for quite some time. For such a small place, it serves up a really mean cocktail and fantastic food.  Their Spicy Coconut Mojito was probably one of the best I have had as far as mojitos go, and the Fried Whole Fish was beautifully presented and tasted absolutely delicious. The menu is pretty limited, and the prices are decent. The staff is friendly and the place is kept clean. They have enough small tables for smaller crowds and a large enough bar area. Overall, I really enjoyed my first experience and will definitely stop in again the next time I happen to pass in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bzhxVHh3RRAB",
            "text": "Rude, racist behavior. While I was looking at their menu, I saw the white business owner / manager yell at a brown-skinned man for throwing litter away in their outdoor trash can. “This is not your personal trash can, we pay for this trash!” I looked at the manager in surprise and he glared at me. Very rude, really uncalled for."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaZ00tMmRREAE",
            "text": "Went to this place and sat at the bar....I'm expecting the bartender to greet me and ask what I would like to drink but he kept walking back and fourth with no type of eye contact. After 15 minutes of waiting, I excused myself and asked for a drink. He made the drink without apologizing to me for waiting. I wanted to have something to eat and was told to sit at the table. Ok, another 20 minutes of being ignored and not being attentive to with no menu, my hunger was destroyed. I've been living in the neighborhood for over 40 yrs. Worse service ever!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaXNuSTZBRRAB",
            "text": "Local place for local people good style and service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaa3FlQUFnEAE",
            "text": "An interesting little place! We will be back to try more of the menu. Burger was amazing:)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaeElMZjlnRRAB",
            "text": "Cozy little neighborhood bar with a super friendly and neighborhood vibe, good food good drinks and great conversation."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNab0tDTXpBRRAB",
            "text": "My family and I come here at minimum once a week. The food is delicious, the crowd eclectic, fun and diversified....Oh , and the drinks are everything. The owners are great too! Small Hotspot that Newkirk Plaza only benefits from! TEI"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyLVBxUmRREAE",
            "text": "Excellent service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4c192X3JnRRAB",
            "text": "Definitely has the neighborhood bar/restaurant \"where everyone knows (or could know) your name\" kinda feel. Very nice bartender/wait staff.\n\nLocal beer options, solid burger.\n\nAtmosphere is friendly in a dive-bar kinda way, there is a outside backyard space where you could have your drinks/food and see the Newkirk plaza trains go by (though high-ish walls so kids wanting to see night need adult assistance, for better or worse).\n\nBathroom is a little small for changing a baby, there is possibly space on the ground for it in a pinch but not a lot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N2NhZnZRRRAB",
            "text": "The food was really delicious. Also the staff was super kind and attentive!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NGQzRUFnEAE",
            "text": "My favorite place to in Brooklyn."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4akoybU1REAE",
            "text": "We've been here twice: once shortly after they opened and then just a few days ago. Hard to capture just how disappointing this place is. Great location, reasonably good service, yes. Run down and cluttered interior. Years ago it was so many throw pillows you couldn't breathe. This latest visit was all kinds of random items out in the open taking up space, it felt like we were inside a storage closet. The local brew beer was simply undrinkable. The food was simply soggy and sad (appetizer sampler). The thing that gets me is that this COULD be a simple dive bar, but totally lacks the focus or discipline to be that. This place hurts me every time I walk by it now. Why not a kitschy margarita bar? Or a REAL dive bar? Or even a laundromat? Any of these would be miles better then the reality of Wattli.\n\nP.S. What is up with all these weird and seemingly scripted \"it's like Cheers, everyone knows your name!\" and \"the food was scrumptious!\" Are you bots? Are you aliens?"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSLTczMVR3EAE",
            "text": "A wonderful neighborhood spot. The drinks are as delicious as to be expected for a very nice Kitchen Bar restaurant but the food is so much more delicious than what you would expect. I'm going to be eating here at least once a week."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScHRXVWdBRRAB",
            "text": "my fav local neighborhood bar.  sally, arbor, and jerry are amazing ppl and they are always so nice.  good bar food, great drinks 👌🏼…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOHNpdU9nEAE",
            "text": "Penne vodka with chicken was pretty damn good. Narrow space with a handful of tables and a bar. Have a ipa on tap from a resident of the area who brews beer. IPA was pretty good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeUt2TlR3EAE",
            "text": "Delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcV8tN3VnRRAB",
            "text": "Good selection of drinks and food options\nToo many noisy people though 😉 😜"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCaF9UU0tREAE",
            "text": "Great local little gem 💎…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNzRXa3hRRRAB",
            "text": "Had an excellent dining experience. The food was solid, the staff very pleasant and attentive, and the overall atmosphere was cozy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNzdMbXRnRRAB",
            "text": "Great food, drinks and service. Enjoyed the shrimp rice bowl, salmon and bacon burger and fries."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNy1xMG53RRAB",
            "text": "Picture pretty much sums it up great owners awesome people good drinks"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXODhIbkRnEAE",
            "text": "Wow! The drinks are well balanced of favor and alcohol to spice. The service is friendly with a local homie feel. The Chef Sally is amazing with her bend of Tavern food with Asian flare. Highly recommend just to grab a bite or just go hang and have a few with some friends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXZ1lqYU9nEAE",
            "text": "Dope owner , dope food, dope drinks , dope vibe . Owner is very kind and charming ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXMy1haWdnRRAB",
            "text": "I hate leaving bad reviews but the ramen tasted like $.50 cent Maruchan. Don’t get me wrong, I’ll eat it, but it isn’t worth $15. Come here for drinks not for food. I was so disappointed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNnVHdkNBEAE",
            "text": "The food and my drink were delicious. My daughter and I enjoyed the large wings, shared fries, which I wanted to order more, and I had a classic margarita because I was scared to try the spicy. I will try it next time. Been here before, and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMnZYaEVBEAE",
            "text": "You immediately get a \"Cheers\" cozy vibe walking in this bar. It did help that the night my friend and I dined in, they were having \"Karaoke night\" featuring a lot of regular folks in the neighborhood.  I learned that the establishment's name comes from the joining of the 2 owners last names. All the staff here was very friendly and attentive. The service wasn't lacking. The bar also felt spacious so you didn't feel like you were piling onto other people.\n\nDrinks: We loved the bartender. I enjoyed the pineapple mule and my friend had the spicy coconut mojito. The drinks were simple but delicious. He was also flexible with changing the contents in each drink or playing around with the ingredients. I could hang out here  just for the bar alone.\n\nFood: We started out by sharing the large wings. They come out in a good size with a crispy skin. I then had the pan seared salmon with white rice and veggies. I felt the salmon had a good sear. The rice could have used a nice gravy to marry the salmon with. My friend had the lime Shrimp rice bowl which she said was good. We were rewarded at the end by a generous slice of chocolate cake served by one of the owners. What a nice surprise!\n\nGreat portion size and reasonable prices. Overall, the food here is solid and I could see myself returning to try more dishes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtZ0tlRW5nRRAB",
            "text": "AMAZING OWNER AND GREAT PLACE TO HAVE DRINKS.THE CHICKEN TACOS WERE MY FAVORITE.BEST PLACE TO GO ON A DATE AND ENJOY."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHelpiR1dREAE",
            "text": "Cozy local spot with interesting cuisine and drinks."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHN3ZudG1RRRAB",
            "text": "The decor was all over the place... Seemed less like a dive and more run down. I ordered a Spicy Coconut Mojito which was okay. It was on the tad spicier end which drowned out the flavor of the rum and cocunut."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHaC1iU2ZnEAE",
            "text": "Drinks are so good and the wings are huge!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNnVHQTBRRRAB",
            "text": "My sister, my mother and I got lunch here twice this week and both times we had great food and service. Their shrimp and mussels vodka sauce pasta was amazing and the shrimp tacos and shrimp sliders were delicious as well. The staff there were friendly, fun to talk to and provided fast service. They also have very smooth tequila! I will definitely be returning.\n\n*the photo below includes the shrimp and mussels vodka sauce pasta special, shrimp sliders and scallion pancake."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVOEp6ZVFBEAE",
            "text": "Delicious meal, friendly service, nice outside seating area (admittedly next to the Q train) and spicy cocktails. This was our first time here and would happily return."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZdV9pV0lBEAE",
            "text": "New neighborhood bar that is a great addition to the area. Right off the B and Q make it easy to get to, and the owners and staff are super friendly. A cozy bar with good food and drinks."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURraE5TWUdnEAE",
            "text": "I was very excited to see a new bar open in the neighborhood and got to check it out a few weeks after they'd opened. First, I love the decor and really love that they have a little outdoor seating space (to the side of restaurant--you don't see it from the street). It definitely feels like a fun place to grab a drink and hang out. We'd already eaten but did try their appetizer plate and the food was good. Our cocktails were tasty. I'm exciting to see how they evolve as a restaurant and I would definitely recommend it stopping by.\n\nMy one complaint (and this is a complaint I frequently have) is that their cocktail menu is too small. They have a fully stocked bar, so I'm sure they could make whatever I'd want, and the cocktails they did have listed included some fun house made ingredients. Still, it can be too easy to default to your basic cocktails (not that there is anything wrong with a good Manhattan, but I can make that at home) if you don't see something that speaks to you on the menu. I really appreciate it when bars go through the effort of laying out more options through a lengthier cocktail menu. Given how new the restaurant is, I wouldn't be surprised if they'd already added things since I last went though. Regardless, I look forward to grabbing a drink and sitting outside on a nice day."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpMUlEbVhnEAE",
            "text": "Amazing place! I love everyone there. The food is delicious and everyone is very friendly ❤"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLdl9pbEJBEAE",
            "text": "This place is small, but a cozy bar with plenty of personality. The servers or waiters are very attentive to customers needs. Taco and Shrimp tacos are amazing along with anything else you order. Absolutely 5 stars for all or most of their menu and Pineapple mule is smooth and had me singing home woohoo!!! love this place!!! worth a go for sure!!!!\nwife bakes the cakes and it was the best chocolate cake I have ever had! love!!! love!!! this place"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDbjRPT2VREAE",
            "text": "Great local spot!\nFood is great from appetizers to full dishes.\nShrimp basket, the salmon, the wings all tasty!\nThe owners Sally and Arbor and staff are friendly and welcoming.. drinks are good, nice happy hour and there is nice backyard seating as well!\nBeen going for a couple of weeks now and there is always a great mixed crowd and great atmosphere... def beats the other neighborhood atmospheres like oxcart, westwood and rusty nail. No one at wattli is stuck up!This is my new go to bar! Dress up or come casual either way you will feel comfortable. I was a bit skeptical about the location but I have noticed from the times I stopped in that some of the tenured neighborhood guys are usually there and they add a sense of security and they bring some life to the air as well! Overall like i said this is my stop from now on!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwa3BLSkVBEAE",
            "text": "I pass by once in a while. Last week decided to try couple of cocktails and food. Salad is simple, but good. Wings are nice and crispy. Enjoyed well pressed panini 👍 salmon dish was well paired and delivered as well. Cocktails and service are a 5+! Try it when in the neighborhood!…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbmJpNk1BEAE",
            "text": "I’m really glad a place like this exists in our neighborhood. The staff and the owners are wonderful and the food and cocktails are excellent as well. The creativity and time taken to make people feel at home is a rare find but, you’ll find it at Wattli. Fun and personable owners who will make sure you have a great experience."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0a2NmbENREAE",
            "text": "Food was great. The pineapple mule was amazingly delicious! The patio is gorgeous, really great atmosphere. Service was friendly and attentive. So glad this place opened up in our neighborhood!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZMVpHcUpREAE",
            "text": "Feels like you're in someone's living room in a good way. Good happy hour deals and friendly staff. Seating arrangements are best for small groups. Excellent addition to the neighborhood."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNrZ09yVzlBRRAB",
            "text": "Such a lovely and refreshing establishment! Lovely owners/staff, good selection of booze and brews with an outdoor seating area in the back. Make it a point to come in and enjoy :)"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNaFptZHNnRRAB",
            "text": "Awesome chill atmosphere with great people. Drinks are great and not too expensive. Good idea very good also. Great place to hang out any day of the week."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVc01LaGd3RRAB",
            "text": "The service was fast, the staff was friendly and the food was delicious! I stopped by for Sunday brunch and dined in their cozy outdoor garden. This spot is a hidden gem."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVMWF6MlVREAE",
            "text": "Really good food, kind of small portions. Drinks are good too. I hear they have a pretty good happy hour. Pretty close to the train at Newkirk."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwb2NXTlpREAE",
            "text": "I was there September 27 it  was on a Friday the people are very friendly the atmosphere was great the portion size were really good I had the chicken wings 🐓were very crispy And the chicken tacos had a lot of flavor  the coconut Mojito‘s were the best I had in a very long time  really a nice place…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZNTVIdkN3EAE",
            "text": "A true neighborhood bar and kitchen. Brings me back to 1998 when I first moved to Brooklyn. Community comfort fantastic cocktails. Give this place a chance!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDcl92QU93EAE",
            "text": "No better place in the neighborhood to eat or drink. Great cocktails, beer and shot happy hour specials and every item on the menu is worth trying  Seafood and shellfish are specialties"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURreDdLUnJRRRAB",
            "text": "Just had a drink .saw the place .thought it might be a good neighborhood stop off for a quick belt and a beer . Not sure what else they serve during the day but the owner was nice enough for me to stop back another time"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMDdYVUZnEAE",
            "text": "Great food.  Good drinks. Wonderful owners and staff. Always a pleasure to be there which is almost every Friday night"
        }
    ],
    "reviews_count": 63
}