{
    "name": "Garlic & Olive Pasta Eats",
    "place_id": "ChIJWcMmCwBbwokR2m5ggalnidw",
    "grid": "BK14",
    "address": "1314 Cortelyou Rd, Brooklyn, NY 11226, USA",
    "rating": 4,
    "user_ratings_total": 61,
    "phone_number": "(929) 210-0198",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WWJtdFpMVFk0TUdWalRHUlRkRWR2T1UwdFdFRRAB",
            "text": "I am gluten intolerant, so what am I doing at an Italian restaurant? Well, having a delicious meal. I asked if I could have veggies with garlic and olive oil. The garlic was perfectly balanced and the veggies were roasted. It was Total Yum.....that put me in my happy place. Not to mention, I was also delightfully serenaded by live music from a variety of musical artists at their Open Mic. Can't get much than this!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadmJHbDFUVTFIV1RGVmJFVldkemt0Vm1WbVVVRRAB",
            "text": "I had the ricotta toast appetizer which came out (twice) not as described. First it came out with red pepper, no walnuts, and doused in Caesar dressing (or something but truffle honey it was not). Second time was the same with less dressing, more weird seasoning (tasted like the Italian dressing packet sorry), and some walnuts on the side. Bread was cold and limp. I cannot imagine this is how the dish would be served but I also get the sense that nobody has an idea of how to make the dish.\n\nThe mushroom pasta was tossed in a giant cheese wheel, which was an interesting choice because the pasta was warm and there was no additional heating element so it was just a random and awkward 30 seconds where the pasta was stirred around and then served back to me with giant chunks of unmelted parm that had been previously scraped into the cheese wheel. (I didn’t hate this but it’s certainly not what I expect at a restaurant.)\n\nServers are nice and the vibe is nice, but it seems like the kitchen is pretty disconnected from the menu."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVdGNVVmhUbEZTUkVoTU1HeDBRMjR5U1c5Rk0zYxAB",
            "text": "My partner, and I decided to try out this place tonight. I left pretty disappointed.\n\nWhen we came in and sat down, they asked us if we wanted still or sparkling water. We both said “still”, but I was surprised they brought us out an $8 bottle of Saratoga spring water. I was expecting tapwater, but before I could say anything, the bottle was opened and being poured in a glass next to us. Oh well, not the worst thing in the world.\n\nWe ordered two glasses of wine. They have a pretty OK selection. It was nice that they had wine from different regions like Spain and Georgia, and a pleasant surprise to see some orange wine.\n\nWe ordered the burrata and arugula salad to start. They brought us 4 tiny pieces of garlic bread on a paper plate. Really odd that this place served paper plates, after just serving me an $8 bottle of Saratoga spring, but whatever. The burrata was OK, though the portion was kind of small and it wasn’t super creamy. The salad was also OK, but nothing about it felt very Italian or inspired.\n\nWe ordered our main entrées, which was the rigatoni alla vodka, and the tagliatelle funghi. They bought out both of our dishes, but we were surprised when they unveiled a cheese wheel that they used to mix the mushroom pasta in. It wasn’t bad per se, but it was sort of unexpected. It felt a little awkward as well, and I’m not entirely sure if all that much cheese made into the dish because there wasn’t anything to warm it up. The pasta sauce for each dish was pretty good, but the mushroom pasta was advertised to come in a mascarpone cream sauce - and when my partner was finished eating it, it had a pool of oil in the bottom. It’s unclear where the oil came from because the pasta was just mixed in the cheese wheel, and the pasta was creamy before it came in. I assume the sauce was an emulsified properly so it was a bit unappetizing to see. My pasta sauce also seemed to separate a little bit, but still tasted fine. I also think the pasta came to us overcooked, not al dente.\n\nI will say the Server was very nice and pleasant to us and she did a great job. It’s very clear this restaurant is not Italian owned - which is not a dealbreaker, but overcooked pasta in an Italian restaurant is a sin.\n\nI’ll also add that nearly all the photos in the menu were AI generated, which is really disappointing. A paycheck was taken away from a photographer or graphic designer, and as a small business, it’s important to support each other especially with many artists living in the community. It’s also odd, because the food being shown in the menu looks nothing like what is probably offered. I think if you have real pride in your food or your craft, you should take the time to make sure it’s being displayed proudly.\n\nOverall, I probably won’t be back for dinner. It’s probably worth it for a glass of wine and maybe a small snack, but there are many other options in the neighborhood. I grew up in NYC and love good Italian food, and this just isn’t up to par.\n\nPros: service was good, and had some good wine options.\nCons: dishes were not executed well, and the recipes were basic. Pasta was not al dente. Use of AI on menu was disappointing."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cGFqQk9OMloxVm1rNGFuWnlWVTlwZFdGcU1rRRAB",
            "text": "The live band at the front gave this spot a midtown Manhattan feel.  The food was pretty good.  We all ate different things from the menu and had no complaints.\n\nThe manager was pretty cool too and the waitress was very attentive. There was no wait time."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R2FVUk9Ua05HT0ZObVgwSXRjVE5uUmxOdlRHYxAB",
            "text": "I had a great experience at Garlic & Olive, everyone was so friendly and the service was attentive.  The restaurant was cozy yet spacious.  I like that the tables weren’t too close to each other. Everything was delicious but must try Brussels sprouts, branzino and tagliatelle ai funghi (mushroom pasta in cheese wheel)."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMFdUUkRiWEpMTVdveE4yYzBVRWMyVldSM04zYxAB",
            "text": "New to the community, still trying to gather who they are and do they fit in to the atmosphere of the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JeVMwZEhXRVl3TWxSVk5rZEJUREpZYVV0R1gzYxAB",
            "text": "We visited this place while looking for a different restaurant on Courtelyou Road and looking at their menu we thought why not. It was brunch time and no wait for a table. It was a great find. We enjoyed our Mimosas while waiting for our order of NY Strip Steak and the Primavera Frittata. The vibe is laid back, approcable with a small outdoor seating in the back perfect for summer and now early autumn days when the sun is bright but the temperature is perfect. We've added this place to our list of local restaurants that we are happy to visit when in town. It's a great neighborhood spot that I hope will continue to bring joy to residents and visitors alike."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMWFuaDZkRVV0TmpSbU5VVnVZbVZEUlRGRVZtYxAB",
            "text": "BEST ITALIAN DINING IN THE AREA!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUWRHdFFhSGRzZFdsSGRscFNabVozZEhwdFJGRRAB",
            "text": "Food went beyond my standards will try again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reVNrVjFhMjlRY1RoWmEyWlZVRzEyZHkxRlUxRRAB",
            "text": "An odd but not altogether unpleasant experience. After having drinks nearby we decided to try this new place, since it was one of the few on the road listed as being open until 11 pm on a Sunday night. We arrived just before 10 and they clearly looked like they were just preparing to close. Everyone seemed very surprised to see us, but accommodated us politely and took our order. The crostini was a tiny portion and refrigerator cold — not pleasant. One of us ordered gnocchi with pesto and he was told that as they were out of gnocchi they could substitute it with penne— we accepted this, as it was late and there weren’t a lot of meat free options, but were charged the same as the gnocchi we didn’t get. While we waited for our order we asked to order bread and the server seemed completely confused and said that “we haven’t had bread for a long time”…? This is all while the staff sat around having their meals while we waited. Truly bizarre scene for a place that should be working on impressing their new clientele.\nI do have to say that once the main dishes arrived, they were totally delicious! We were very surprised, as by that point we weren’t expecting much. But honestly, some of the best pasta I’ve ever had! So kudos there. The owner kept apologizing—but no effort was made to actually make up for their shoddy service (a complementary glass of wine? dessert? or maybe just a simple and fair price adjustment for an out of the pantry pasta substitution?—penne for gnocchi, not the same, my friend!) Anyway, I wish them luck, but I see from other reviews that they’re quickly becoming Not a new restaurant anymore, so I hope they up their game and fast. The food IS good— but atmosphere and service…gotta work on that, big time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGd01UZzRXamRpTkhreGJYVlBSalZ0ZFdkM1VrRRAB",
            "text": "Name and decoration of the place deserve some rethinking, but the food and the service are very good. Glad to see them in the neighborhood!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUlEwdEJhMVI1Y25WdVFWQm9hMmh1UkRsTVMzYxAB",
            "text": "I seldom leave a poor review, and I promise I wanted to have a solid Italian restaurant with traditional dishes. This was not good. Pasta was soggy, bland flavors, and honestly didn't taste like an Italian (or anyone that knows about Italian food) was involved. They bring out over- toasted garlic bread, sauce that tastes like it came out of a jar, and tempura style octopus (again not Italian and also not in a good way). I hope they find a new head chef or someone who actually knows the cuisine or this place may not last.\n\nService was ok because they were very friendly but it was scattered and not well paced. We won't give it a second chance."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUWVWaHNhbk55WVUxMFdGWTBiM0pLZGs5elkzYxAB",
            "text": "Really nice experience this weekend.  Food was high quality and staff made genuine efforts to make everyone happy and feel welcome."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMmRDMHlha3A0VDA0d1gyaDNhMFJTVjNSUVRGRRAB",
            "text": "Everything was great!  We started with the Ricotta crostini and Caesar salad. For our mains we had shrimp scampi and tagliatelle fungi. The flavor on both were delicious!  Service was great. Will Definitely be back….our new favorite local spot!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsb1IxaEZjVlk1VUhaSmRXWk9iMGx6ZDNrelRGRRAB",
            "text": "We had a very good time tonight dining at Garlic and Olive. The staff was very friendly and the food was excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMFl6aFNWbEJ5Y20xalpFMWhSVFozYUdOaU0xRRAB",
            "text": "I had been meaning to check out this new addition to the neighborhood and had such a great experience. We were the first to dinner on a Friday night and service was quick, friendly and accommodating. The food was so delicious, I forgot to take photos for this review. We shared a ricotta crostini, rigatoni a la vodka, gnocchi with pesto and the chocolate mousse cake. It was all incredible. The pasta and sauce were really fresh. Looking forward to coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUWNHZG9iak00VjBWRGNsSnBWMDFyUVVWdldHYxAB",
            "text": "I had an amazing experience at Garlic & Olive Pasta Eats. The pasta was perfectly cooked, and the garlic and olive combo was packed with flavor—simple but done so well. You can tell they use fresh ingredients, and everything tasted homemade in the best way. The atmosphere was cozy and welcoming, and the staff were super friendly and helpful. It’s a great spot if you’re craving comfort food that’s not too heavy. I’ll definitely be coming back and recommending it to friends! Now am no food critic but this is actually some good stuff😭"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVlZsWnFkVU5PVjA4MmJHVndOR3BQT0hvNFIwRRAB",
            "text": "Garlic & Olive Pasta Eats was amazing from start to finish! The food was absolutely delicious—fresh, flavorful, and perfectly cooked. The staff were incredibly friendly and made us feel so welcome. And the atmosphere? Warm, inviting, and just the right mix of cozy and stylish. It’s rare to find a place that gets everything right, but this spot truly does. Can’t wait to come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeldFSktUMWRRVkVKM1NHWm9WRjlNTWpoR1JtYxAB",
            "text": "Such a hidden gem! The garlic and olive pasta was full of flavor—simple, fresh, and perfectly cooked. The staff was friendly and the vibe was really chill. Definitely coming back for another plate soon!\nCostumer service is insanely good😩"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNWVYRkhVWFF3Um1KaVJFOXNTWE5JYjBaamQxRRAB",
            "text": "The staff at Garlic & Olive Pasta Eats made the experience unforgettable! So warm, welcoming, and genuinely attentive—they went above and beyond to make sure we were happy. It’s rare to find service this good. Combine that with great food, and you’ve got a perfect night out!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbmMwbG9PVnB5UWt4aFVFdGFSRnBCZVU0MU4wRRAB",
            "text": "Absolutely delicious! The food was fresh and flavorful, the service was quick and friendly, and the atmosphere was cozy and welcoming. Highly recommend if you're craving a satisfying pasta meal. Will definitely be coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdlF6VmhZMEpSWjBndE5tMXNkRXcxU2pWbGVtYxAB",
            "text": "Went here last night with my family (party of 4). We didn’t have a reservation, but I’d recommend making one, especially on weekends. The staff were really friendly, welcoming, and checked in on us often. They also kept our water glasses full all night, which was nice.\n\nWe were a little unsure at first because of some of the reviews we read, but honestly, they were way off. The food was amazing! I had the chicken parmesan—so good—and we also tried the tagliatelle mushroom pasta that they serve in a parmesan cheese wheel. Super tasty.\n\nWe ended the night with tiramisu and the chocolate mousse cake, both were delicious. The wine was great too—I had a rosé and the others had red.\n\nOverall, great spot, great service, and great food. Definitely planning to come back, and I’d recommend checking it out."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaGMyRkVUa28yTkVkc1JsUklkbEo1Ym5CeVYyYxAB",
            "text": "We went to this newly opened Italian resturant with a party of 5! The food was delicious with generous  portion sizes. The staff is incredibly friendly and attentive. The owner is on site and goes above and beyond to make guests feel special. I highly recommend checking it out. They will also be opening up an outdoor area which sounds very cool!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STWFGbElkMGxwY0c0eWVEaHVjbWN5ZVhWc1NVRRAB",
            "text": "Solid pasta! It is easy to get a table and service is quick and friendly. We shared a salmon dish had an excellent crust. My friend ordered the tagliatelle mushrooms and it was great. I ordered the clams and white sauce pasta (pictured)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcVVVRjRiMm8yTFVjdE1tdGpXVzE2VVU1bGJFRRAB",
            "text": "super delicious food with warm & attentive staff. ordered the tagligatte funghi and so cool seeing the staff make it in front of me in the cheese wheel. my partner had the involtini and that was delicious"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGblgxYzFSRGhMUWpGNFoyVldaRzFVZGpoRmFIYxAB",
            "text": "The staff was amazing! Kitchen too!!! Too bad whoever the owner is gave them really mediocre recipes to make and to serve.. did you taste the recipes before putting them on the menu? Still gave a big tip because your staff is awesome and I feel bad that this is what they have to work with ( I liked the wine.. ) re-do the menu, we all love classic Italian American! Just maybe.. add garlic to things like the name suggests and some acid/ lemon here and there? Thanks"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRd2MxUlpXVkJ6UW10eWJIRTBWREkwTkU1ak4wRRAB",
            "text": "What an unpleasant experience all around. This place had the oddest setup, service, and food options. There is a beautiful garden that isn’t open and is inhabited by trash cans, so you squeeze inside. There are many staff standing around not doing much. The food isn’t very good and is quite expensive for what you get. The pasta is actually tasty but in the tiniest portions — what you’d expect at a much fancier Italian restaurant in Manhattan that actually has atmosphere and great service and isn’t in a block focused on serving local families with kids. Just a bizarre place all around. Won’t be going back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPMml1T253dGJucnpnRRAB",
            "text": "So happy to have a delicious, cute, excellent new spot to the neighborhood! We had the polpo ala grigila and the burrata for appetizers as well as the parpadelle bolognese for entrees. Everything was delicious and the staff was lovely."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VOajFrYjc5OTY3ekRREAE",
            "text": "I was really excited for an Italian place on Courtelyou Rd, but unfortunately, this ain’t it. I ordered the spaghetti with marinara sauce. The spaghetti was overcooked. It pretty much disintegrated in your mouth. The marinara sauce tasted an awful lot like a slightly doctored up Ragu. The dish came with cilantro dotted around it. A weird choice for a spaghetti dish. I understand it’s a new restaurant and therefore the staff are new, but the waiter didn’t even know if they had a Pinot noir when I asked and had to go and check. Save your money and go somewhere else"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNRHUyZHk0cGFXMEZ3EAE",
            "text": "Wanted to support a new place. Ordered app of arugula and burrata it was microscopic but the cincher was the $29 shrimp dish that came served with a literally tablespoon of crunchy old quinoa and rice and 8 little shrimp in a sauce. When we asked for more rice the chef came out all salty and pissed saying this is the proportion. Honestly dude if your a new restaurant and a new customer asks for a\nBit more rice ….. is it worth it to be surly and lose them forever for the price of rice? This place is FAR from Italian. Decor,  lighting, food annd service  all needs help. Bummed to not have gained a new place in the neighborhood but this place with their stingy proportions lack of any Italian authenticity and an angry chef ain’t gonna make it. Anyone who tries it won’t be back! $100 wasted"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPVGlrNFhLcnE3ZG1nRRAB",
            "text": "Starting of with the fact that most of the dishes names and description have plenty of grammatical mistakes, I don’t expect them to know Italian but it would’ve been nice to google the names before printing them out.\n\nThe arancini reminded me of the diner style mozzarella sticks. The main ingredient is “rice” not cheese.\n\nPasta was overcooked up to the point where it was falling apart.\n\nCilantro isn’t the right choice for the pasta presentation. Last thing I expected is to enjoy some pecorino with the overwhelming taste of cilantro on it.\n\nThe bolognese was pure acidity, reason why you need fresh ripe tomatoes instead of canned ones.\n\nThe service was very interesting, one server that had zero knowledge of the menu and another one that was casually eating in the middle of the dining room.\n\nWe got the appetizer and 3 minutes later we got our mains, some time in between would’ve been nice.\n\nWhen you have a party enjoying their meal you wait for everyone to finish their food before picking up plates.\n\nThe whole experience was just plain disrespect towards Italian cuisine.\n\nWill not put one star only because they just opened and deserve a chance."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOM2t2cS1tbnJmMDJRRRAB",
            "text": "The pasta dishes are delish!!!   The wine reasonably priced and good.  Service needs a little work.  They are all very kind but slow.  Im sure they will get it together.  A really nice addition to the neighborhood.  EVEN GLUTEN FREE PASTA!!!!!  A perfect family spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLT1YtUDNZaEl5T3JRRRAB",
            "text": "It's a new restaurant and they have not worked out the flow of food and service. The resraurant has potential but the service is not great. Staff should be properly trained and they should have a better system with the service. The food was okay but I would not recommend it, for now. I would give it a try again, assuming they workout their service. There is not a lot of Italian options in the neighborhood so I'm rooting for this restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMGRXYXZ3RRAB",
            "text": "Cheers to a new restaurant opening in the neighborhood! The restaurant looks very similar to what it was previously, not much effort to make it look or feel like an Italian restaurant. We had the ricotta crostini and chicken parm..I would recommend sticking to the pasta ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaHFuYzd3RRAB",
            "text": "Wanted to give this place a try. Google says they open at noon and we came at 3:30. They were closed and the sign on the door said they opened at 5pm. We waited around the neighborhood and returned at 5pm and was turned away being told they…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLW9mRUdBEAE",
            "text": "I'm happy to provide a positive review; the reviews have been mixed so we weren't sure what to expect. The place is very cute, nicely decorated, good lighting, reasonable noise level. The staff were friendly and helpful. We ordered gluten free Rigatoni Alla Gricia and were told ordering it gluten-free would take extra time, which it did. [Note that the gluten free pasta serving size looked to be about half the size of the regular pasta dishes we saw at adjoining tables; I'm not sure why.] However, it was absolutely delicious. The arugula salad was also very good. The wine list is challenging; it's divided into color (white, red, orange, rosé) and under each color are a couple of brands, but no hint as to what the grapes are. Fortunately, the server was able to explain what the grapes were, which wine was dry, etc. The wines were excellent. We will return."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveWVhcTVBRRAB",
            "text": "I'm being generous with the stars. Food was mixed. The experience was lacking. Wine was good and reasonably priced. There were bread plates, but no bread. The mains don't come with sides and there are no sides offered on the menu, so the chicken was just a piece of chicken without the option to even add anything to the plate. (At over $20, it should have come with sides.) The rigatoni was (I think) meant to be a type of cacio e pepe with guanciale. What I got was a bowl of flaccid pasta sitting in pasta water with congealed pecorino and guanciale on top. I would have sent it back, but the chicken my partner ordered came out 15-20 mins before the pasta, and by that time, his chicken was gone and we did not want to wait for a new bowl of pasta. Clearly something was wrong in the kitchen, but there was no acknowledgement or apology whatsoever from our server. I get that they are new, but there are clearly some serious wrinkles that need to be ironed out. My partner's chicken was delicious. My pasta, not so much. We also had crostini and octopus to start and both were ok, but not great. We will probably try again, as we live in the hood. Hopefully next time will be better."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvem92TVlnEAE",
            "text": "I love Ditmas Park and I am always hunting for new places to eat in this delightful hamlet. My beloved and I ate at the bar of Garlic and Olive. The charming bartendress didn't disappoint with the robust Nebbiolo and the wonderful orange wine. It went downhill from there. The sadness of some pre prepared garlic bread. The most certainly heat and eat arancini. The caesar salad was ok. The pasta vongole...boring overcooked spaghetti and chewy clams. Shrimp scampi, same pedestrian overcooked spaghetti and overcooked shrimp. Also, we didn't get our entrees at the same time...I would say they really need to research what good Italian food is, and probably some better kitchen timing, if they don't, this place will not last."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNVBqTjd3RRAB",
            "text": "Nice addition to the neighborhood. Good food and great ambiance."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNzgyejVnRRAB",
            "text": "Really delicious and cozy restaurant. I could tell the flavors were well thought out and balanced. I enjoyed the pappardelle, arinicini, beet salad, and steak."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNV9TdjFnRRAB",
            "text": "Cozy new neighborhood spot with friendly staff and great food. Will definitely be back! Especially once the backyard is open!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcTc2aWxBRRAB",
            "text": "Great service, and nice atmosphere. Nice new place in the neighborhood"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcTh6NEdnEAE",
            "text": "My wife is Italian and she said: deliziosa.\nWelcome guys. We will come again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMDdqUXNRRRAB",
            "text": "really great staff and cozy vibe!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvX2FmSWh3RRAB",
            "text": "Went on their third night open with some friends, so any current reviews mentioning service need to show them some grace. We had great service and our waitress was on top of everything! Especially with topping off our waters. I have never been so hydrated."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaWVxZlZREAE",
            "text": "We ate here on what (I think) was their second night of service, so I'm going to cut them some slack. The food was very good but the service could use some work. But I'm feeling generous with stars, and I have been a beginner too.\n\nFirst, the beet salad was very good but needs more beets. Pistachios and fruit (apple) was a nice touch and overall very good but too much lettuce and not enough beets for a salad called \"bietole\".  Pasta alla gricia was excellent. Rigatoni was perfectly al dente, the guanciale was nicely rendered and served hot and delicious. Chicken parmigiana was also excellent. Perfectly cooked, hot and juicy.\n\nNow for the service. Hmm. Servers were new. I mean really, really new. One young woman clearly knew what she was doing, the others not so much. But they will get the hang of it. They seemed flustered that we ordered a whole bottle of wine. (Really?) Please teach that server how to use a corkscrew. Our 3 orders (one salad, one pasta and one main) all came out within 5 minutes of each other yet the table next to us that arrived at the same time waited probably 20 minutes for 2 pasta dishes. (I saw their annoyance.) Please give us some serving utensils (big spoons) to serve with. Overall the kitchen seems focused and capable but still some stuff to work out as well, like timing.\n\nI was sorry to see Purple Yam (previous occupant) go and the neighborhood could use an Italian restaurant, so I wish them well. I also wish them to work out their growing pains but we will be back, especially for more of that fantastic rigatoni alla gricia."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvenN6LXh3RRAB",
            "text": "Garlic & Olive just opened, and it’s a pretty cozy and casual restaurant. The servers are welcoming, friendly, and attentive. Plus, they help guide me towards choosing a delicious recommended pasta and drink!\n\nTheir Tagliatelle ai Funghi is fantastic and probably one of the best Italian dishes I’ve ever tasted. The sauce is just right amount of creaminess and doesn’t overwhelm the noodles. And of course, the Affogado is an amazing dessert/drink to end off a meal.\n\nOverall, Garlic & Olive is a welcome addition in the Cortelyou neighborhood. I recommend trying them out!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbmF6NVBREAE",
            "text": "Saw Garlic & Olive just opened and wanted to check it out and support a local spot. It was their third day open. I came with my family around 9:30 PM, group of 5. We were seated right away and welcomed by really friendly and talkative staff.\n\nWe started with the Brussels sprouts and Bietole salad—both were really good. For mains, we got Shrimp Scampi, Tagliatelle Funghi (served in a cheese wheel in front of you, super cool), Pappardelle Bolognese, and Fusilli Con Salsiccia. Everything tasted great.\n\nFor dessert, we had the chocolate mousse cake and affogato—both were delicious. Already told friends and family to try it.\n\nFood came out in about 25–30 minutes, which made sense since it was busy. We weren’t in a rush, so we just talked and enjoyed the time. Just a heads-up in case you’re short on time.\n\nAll the staff were really nice, checked in on us, joked around, and made the vibe feel chill and welcoming. Definitely planning to come back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvN1lfRGlRRRAB",
            "text": "Went to Garlic & Olive on Cortelyou Rd around 7–8 PM during rush hour. Staff was super friendly and welcoming. It was only their third day open, and with just three people working, they were really busy—but they apologized and asked for patience, which was nice.\n\nWe ordered the Bietole salad, Tagliatelle Funghi (they serve it in a cheese wheel right in front of you—so good, my favorite), and the Shrimp Scampi. Everything tasted great.\n\nJust a heads-up: food takes a bit to come out since the kitchen seems small and it gets busy. But the staff was sweet, kept refilling our water, and checked on us while we waited. Cozy vibe, great for a family meal or a chill date. Will definitely come back.\nalso is Dinner and price range from $30-$50!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbnFuRkJREAE",
            "text": "This place strikes the perfect balance between elegance and comfort. The atmosphere is stylish yet relaxed, making it great for a nice dinner without feeling too formal. The pappardelle Bolognese was outstanding! It had slow-cooked sauce that was full of depth and flavor. Every dish we tried was beautifully plated and thoughtfully prepared. Service was warm, attentive, and knowledgeable. An ideal spot for a date night or a special dinner with friends—definitely a new favorite."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvN2R6QUNREAE",
            "text": "Garlic & Olive Restaurant just opened, and they’re already off to a great start! I had the Spaghetti Pomodoro and it was fresh, flavorful, and perfectly made. The tomato, parmesan, and basil were a great combo. The staff was friendly, and the place felt really welcoming. They have a bright future ahead, and I’ll definitely be coming back soon!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvN2RTN3dBRRAB",
            "text": "Absolutely incredible experience at Garlic & Olive Restaurant! From the moment we walked in, the warm ambiance and friendly staff made us feel right at home."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvamFlbzVnRRAB",
            "text": "The food we recieved was your average italian food, my order was forgotten and then a wrong order was brought to me. Waste of 90 minutes out, ended up at the taco truck across the street."
        }
    ],
    "reviews_count": 53
}