{
    "name": "Golden Blue Bar & Restaurant",
    "place_id": "ChIJL8ukd0hbwokRNyCXCwTKCls",
    "grid": "BK14",
    "address": "2172 Clarendon Rd, Brooklyn, NY 11226, USA",
    "rating": 4.3,
    "user_ratings_total": 91,
    "phone_number": "(347) 406-5414",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGb2JscEZhVWhtWDI5cU9WUnFORmh4TVZKVlIzYxAB",
            "text": "Golden Blue Restaurant & Bar – A Hidden Gem in Brooklyn!\nA couple of weeks ago, my friend Stephanie invited me to Golden Blue Restaurant for dinner, and I was shocked I hadn’t discovered this spot sooner!\n\nThe food, drinks, and overall vibe were on point. I ordered the buffalo wings, and my friend had the griot fritay—both were delicious. The bartender, Kurt, was super friendly and attentive to everything we needed.\nThe music was a bit loud at first, but they gladly turned it down when I asked. It’s the perfect spot for a late-night dinner with great hospitality, flavorful food, and a fun atmosphere.\n\nHighly recommend if you’re looking for a tasty, vibrant spot with excellent service"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dU5tWjNZbWRPYzNSdk9WUTNZVWd6WW1Od1kwRRAB",
            "text": "My quality and quantity I received from my $90 appetizer take out Order extremely poor mybe dine"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVmFUWm1halpHWm14Wk5XMVVaVUZXZG5NM1pVRRAB",
            "text": "Happy to see another Haitian restaurant. The food tasted good, but the wait time was quite long. However, I believe it's important to consider even the minor details. I hope the place continues to improve in the future.\nEpi jwenn plis mizik kreyòl, 80/20 I'd say. People come there to listen to our music, not Afro or Jamaican tracks.  At least that Friday, 9/26, I heard too many Afro tracks."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U01YaHpRVkY0Y0U1YWNqbGFOVkZSWkVKWWNXYxAB",
            "text": "OMG idk where to start!! I love Amantha!!!! She’s the BEST Bartebder EVER!! Seriously!!! The food is great the Griot is so juicy and delicious the rice is amazing and the drinks are 🔥🔥🔥🔥 top tier !!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQlp6RkVSREJPVm05eFJsUTBjRFZrVkhWS1dGRRAB",
            "text": "This is definitely a hidden gem in Flatbush! Came here with a group of friends and we all cleared our plates! The service was really good and the staff was very attentive. I kept asking for more pikliz because it was that good! IYKYK! They even gave us free shots. I'll be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUk9WcE5VMXAzTFdGQmRGUlFUREZrWlVseVZYYxAB",
            "text": "One of the best haitian restaurants in nyc"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWmRHa3dSbmN5ZVVocWEwdGtaWFo2UlVScWRHYxAB",
            "text": "Golden Blue is one the best Haitian restaurants in Brooklyn, the food is very good. The staff is amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUGJEbFVNemM1WkhKT2VYVm5Za3hpUTAxVWVVRRAB",
            "text": "Absolutely love this establishment… From the first time i came there almost 2 years ago, never had a bad experience allowed me to try the haitian cuisine ❤️ loved it try the acca platter its really good!!! FRIDAYS ARE KOMPA DANCE DAYS IF YOU ARE INTERESTED IN LEARNING TO DANCE!!!!!!❤️❤️ pls come and enjoy"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSS1pESkxTamhMTTBKbmNtRlVVV3B4UlVSUWRuYxAB",
            "text": "The food is spectacular!!!! Boutta get another plate ong"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WV2FEUkRSa2hNY2pWS1RsUTJUMWhmYUhBMFNYYxAB",
            "text": "Food, drinks and vibe is on point. I highly recommend that you come experience  this oasis in the heart of flatbush corner Clarendon road."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSlltVjJXbE5PUzBOamVuaE5YMHRKYzFoQ01uYxAB",
            "text": "I always have a great time at golden blue especially for their all day happy hours on Mondays. Their tassot is on point!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkamJ6aHBSMVJaVmpGeFUzcFZlVkpPYjBwZlltYxAB",
            "text": "Golden blue is a place I go to when I want food that tastes like home. They make my favorite legume with white rice & black beans. It slaps every time!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTWRGb3paa3BVU2xkVmRXUnRNV1JKTnkxc1ZsRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nGolden Blue Restaurant (2172 Clarendon Rd) is where I trust my appetite! The food takes a little time, but that’s because it’s freshly made to order and it’s always worth the wait.\nThe service is excellent, the restaurant is clean, the music and drinks are on point, and the owner shows true hospitality. Honestly, for the quality and flavor, they could be charging 30% more. Highly recommended!\n\nThank you Golden Blue Bar & Restaurant"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205b2F5MWhSa054VUd4MU9FNXhOVWR4WW1kbWFuYxAB",
            "text": "Where do I start? Let's start backwards, how do you impose an 18% tip on a  table for two? My niece and I came to Brooklyn for the Maxwell show and decided to grab something eat. We"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sZmJrRnpPV3A0ZGtsdlNHVm9hVFp2WTI1S1VHYxAB",
            "text": "Great food and very nice service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTVJHWnBTVW8zUTFsbFZXZFhiVmxyY2xSbFNHYxAB",
            "text": "Food is always full of flavor! The fresh juice hits every time. I love the passion fruit juice. Would come here all the time!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMFZuRlpaV3RmVjJaWU4yMUVNV00wVXpWd1ZHYxAB",
            "text": "I went to this place it’s Amazing I like the food it was good my only issue is they required you to give an amount of tips I don’t mind to give but if you put pressure on me it’s gonna be an issue\nHaitian people are something else"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbE56VjBXVWh6U2t3MFluRm1RVk52YVd0dWRHYxAB",
            "text": "The food here is 10/10 amazing. The restaurant arguably serves the best Haitian cuisine in all of Brooklyn and their attention to flavor is supremely authentic. The food is served fresh (bistro-style) and so there is a little bit of a wait; however, the taste and the atmosphere make any wait worth it. Additionally, the owners and staff are committed to offering regular programming and events that complement the food and social environment they provide. Golden Blue is a *must visit* location, for sure."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbldYVjVhMlYxVERCak4wdzFURkF3Y25kaGMzYxAB",
            "text": "CUSTOMERS BEWARE: This place overcharged us on our bill and included an 18% tip without asking/telling us."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcUtEcHFRRRAB",
            "text": "The food here is horrible… I ordered fried chicken. They gave me one piece of fried chicken and the rest was fried turkey, completely tasteless. I will never return or recommend this restaurant to anyone.\n\nResponse to Owner: As an owner, your response to a customer who is simply voicing their experience from your establishment, is disappointing. I am NOT confused. The only thing I did wrong, was not take a picture to post along with my review. You are the owner, maybe your employees don’t care enough to provide your customers with the proper service. I stand behind what I said. My food was disgusting and lacked taste and quality. Trust me, if I did not pay a good amount of money for my order, I wouldn’t have cared enough to take time out of my busy day to write this review or to even respond to your disappointing response. A piece of advice, if you run out of an item, please let the customers know instead of being money hungry and making a decision for them by providing them with your choice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJWGIwZHVkbmJldHhnRRAB",
            "text": "Very nice ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGJ1YTN3RRAB",
            "text": "We stumbled upon this gem trying to find a place to eat before a show at the Kings Theatre. We were promptly seated and everything was top tier! Their take on the rum punch got the job done. Calamari was super hearty, not a bunch of flaky breading amid a few gnarled over cooked pieces. The oxtail and stewed turkey dissolved in my mouth like cotton candy y’all…..Food was super fresh and came out quickly. Get into it!!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MUpLOGhRRRAB",
            "text": "I’m American and I’ve been eating Haitian all my life . I’m not being a picky when I say this . This shit food is lowkey expensive but they give huge portions . This food is a 10/10!!!! Must try the legume is the bestttt"
        },
        {
            "date": "7달 전",
            "language": "ht",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MU1DdGVnEAE",
            "text": "Mwen pase vizite yo deja, Fè m konfyans nou ap jwenn bon sèvis. 🔥🔥🔥♥️🇭🇹🇺🇲\n\n#Haitian #Food #Restaurant #Bar #USA"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cEtUemdRRRAB",
            "text": "I am gonna be straight if you like to enjoy life like me. Like to listen great music and a little bit nostalgic of the wonderful night out (Petion-Ville/Delmas) just come to this place. Prestigement talking you gonna appreciate the food and the staff is amazing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMFlyUWlRRRAB",
            "text": "Came here with a few friends because I just moved into the neighborhood never had Haitian food a day in my life and I’m vegan one of the best overall food experiences that I’ve ever had! Service was immaculate and the food was phenomenal. Definitely will make this a frequent spot. My friends ordered traditional food. They absolutely loved it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbnFuQVNBEAE",
            "text": "Great vibes, food was delicious, and the staff is very kind."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNjZxUjFnRRAB",
            "text": "Love the ambiance and so happy I stopped in for the New Year!! The owner is giving out our freedom soup to the community for free.  I’m so happy and proud to be Haitian."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaDZPbmdRRRAB",
            "text": "The  best  Haitian restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNGFTS2dnRRAB",
            "text": "incredible food, service, and atmosphere. we stopped in for a drink and ended up going back for a delicious dinner that night. we recommend the ox tail, golden curry goat, rice and beans"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURublByUDR3RRAB",
            "text": "We came in on a quiet Monday night, so there was only one other group there. The music was nice, not too loud. Our server was also great and made some nice conversation and made me feel very welcome. By far, the best part was the food. The Rara pasta with jerk salmon and the Labadee pasta were absolutely amazing. Our server had recommendations for me based off what I ordered for next time, and I'll be taking him up on it. I'm definitely coming back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3b2JMYjl3RRAB",
            "text": "Terrible service. My friends and I ordered food and it took AN HOUR AND 45 MINS for one of the dishes to come out. I was in a party of EIGHT. Once they all came out, me and my friends had bad experiences with the food: some of it was overcooked or too hard to bite into. They ended up leaving a majority of their food on the plate before we had to pay unfair prices for the meal and left the restaurant dissatisfied. If you want a burger, go somewhere else."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3b2VMM3pRRRAB",
            "text": "Food was average and on top of that, the service was exceptionally poor because it took over an hour and half to be served our food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3b2NpRWRnEAE",
            "text": "Over 2 hour wait for our food, another table that came 30 minutes after us was served first. 2 and a half hours later and not everyone at the table has their food yet. There are only 4 tables currently being served in the restaurant there is no reason for a burger to take that long to make."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNmU2U3hnRRAB",
            "text": "My dish was good. Staff was friendly and owner is super cool. Often you go to a Haitian restaurant and the servers are sometimes ehh…here they are polite and friendly. We were there with out of town family the night before laying my grandmother to rest. So it was a nerve biting time but turned out to be a good time. **Disclaimer I do know the owner however if it wasn’t good trust I wouldn’t say anything on here. I take pride in my reviews. Check me on Yelp :) Happy dining."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMa2J6UW5BRRAB",
            "text": "We chose this restaurant for a special occasion. We had a party of at least 30 and the food was exceptional from the salads, the appetizers to the main entrée. I recommend any and everything that they have to offer. My only complaint was that we only had one server for such a large party, and it was her FIRST day! It took hours for our main entrée to arrive, and we just ended up packing it to go. She was still very polite and tried her best. Poor planning on their part, but that won't stop me from returning because the food is just too good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqZ1AzS1ZREAE",
            "text": "Delicious food! The pasta and shrimp curry were awesome. Great atmosphere and service. Would come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaXF6THdRRRAB",
            "text": "Service and food definitely lived up to the name “Golden” what’s also refreshing is seeing management and staff working together as a team to deliver prompt service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqM05id0F3EAE",
            "text": "The worse experience ever I’m starting to think  they writing their own reviews. This place is horrible the reposado Don Julio is watered down we waited almost an hour for food and didn’t get any. Oh it gets worse We asked to pay for our…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5NmRtSVBREAE",
            "text": "I love this Haitian family owned hidden gem nestled in the heart of Flatbush, Brooklyn. The restaurant is spacious, clean, and has a huge bar. They also have co a private room for parties. I came here twice within a week.\n\nMini  Golden Delights\nCoconut Shrimp\nShrimp  Tacos\n\nRa Ra Pasta\nStew Snapper w/ rice and beans And plantains\n\nspecial cocktail made by the bartender\nThe golden delights are plantain cups that were stuffed with succulent fried pork. The plantains were fried to perfection. I haven't had plantains like that in forever. The shrimp tacos were mouthwatering they are pricey, but it is worth it and it comes with a lot of shrimp. Big pieces of shrimp. You can tell that is made with good quality shrimp. Also the sauce that comes with it is spicy crack.\nThe sauce that comes with the shrimp is spicy, but really good. The stellar item besides the tacos was the Ra Ra pasta. It is similar to Rasta pasta, but with a spicy cake it was so delicious and the shrimp was grilled to perfection. I enjoyed the snapper and it was huge. It does take a little while for the food to come out because it is made fresh and it’s worth the wait.\n\nIt is easily shareable and they do give big portions here the cocktails are good here and the staff are so friendly. They also have another room for private events.Friday night is Kompa Night. They give out shots and you can also learn how to dance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MkxINUNBEAE",
            "text": "You're greeted upon entry with a warm smile. And the food and drinks are delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMzVmY1JnEAE",
            "text": "What a gem! Food was fresh and delicious! The owner is so nice and makes you feel right at home. Nicest place in the neighborhood for sure. Must go!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURweXVUaHVnRRAB",
            "text": "Cozy spot with 5 star food.\nWe had the oxtail, jerk wings and shrimp salad. All tasty dishes. Even their side veggies were made with care.\nHighly recommended spot to hang out with friends and have a tasty meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOTkySDZnRRAB",
            "text": "We had shrimp curry and goat curry. They were both delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4akpQcjRBRRAB",
            "text": "Food is so yummy!!!! The owners are amazing! Great customer service!\n\nThe space is relaxing and ready for you to come enjoy your time!\nI forgot to take pics of the food- but will try to remember next time- because I know I’ll definitely be going back for more!\nI had veggie tacos 🌮\nand the frittai is 🤤😋"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1N0lfQVl3EAE",
            "text": "This is a must visit restaurant! We ended up here by chance and had the most memorable restaurant experience of our lives.\n\nThe food is absolutely amazing, that goes without saying. The thing about Golden Blue that sets it above the rest is the people that work there. The hospitality is unprecedented! The boss played our country's music and we all had a blast together! I've never felt so welcome at a restaurant and so sad leaving one. We will all be crossing the Verrazzano Bridge to make our way back to Brooklyn just to go eat at Golden Blue again.\n\nIf you're in the area or even if you aren't, you have to go eat and drink here! No bad options and a guaranteed amazing time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleGJMcExBEAE",
            "text": "Enjoyed an early dinner here. We ordered the Golden Legume with Goat and the black pea rice & the RaRa pasta with shrimp with a pineapple juice.\n\nThe food was delicious. We enjoyed the goat which our host recommended. The Rara pasta was creamy and surprisingly not spicy.\n\nCan't wait to come back again. The music was loud for those with sensitive ears but we enjoyed the atmosphere!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtM0phc1NBEAE",
            "text": "This place was a great find! First introduction into Haitian food and it did not disappoint! This family-owned restaurant has tasty, beautifully seasoned food, friendly/attentive staff and a great atmosphere. Can't wait to go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoX2FtSEFREAE",
            "text": "I came on a quiet Tuesday evening, The food is phenomenal and I love the family feel it gives. The chef cooks with love as if made by your own mother. Definitely going to come for brunch on a weekend. This place also looks like it can get real LIVE! The drinks are nice and strong too, just how I like it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXOU5YNkNBEAE",
            "text": "Before I ate here, I thought Jamaican cuisine was the best.   After eating here, I must admit that Haitian cuisine is by far the best Caribbean cuisine there is.  Everything is super fantastic here.  In fact, it is incredibly amazing.  To…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcjRQSl93RRAB",
            "text": "This restaurant offers great, authentic Haitian food, but the service needs a lot of work. In all fairness, they are low staffed, and not yet fully set up to handle large parties as they had they say I dined. They also just fully opened…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlOXRpM19BRRAB",
            "text": "Horrible experience and will never go there again. You could not pay me to go back to this place. Unfortunately today out of all days some friends and I came to try this place out because we love Haitian food. We get there and they are serving  a prefix brunch menu for the first time.\n\nWhat makes this more frustrating.. instead of serving Haitian food/brunch they were serving American brunch food. Why would you as a Hatian Restaraunt not have a brunch menu with several Haitian food options? It makes no sense!\n\nThe bartender Candice or Candy whatever her name is was absolutely horrible at mult-tasking. She seated us asked what we wanted to drink and forgot to come back to us.She had absolutely no urgency and made each drink one at a time and sent out drinks separately to us 20 minutes apart!! What bartender does that? We all ordered at the same time. She was horrible and did not care how long she kept us waiting.\n\nI ordered steak and eggs. I ordered the steak medium and they gave it to me well done and rubbery! The steak was tough and had no flavor! My eggs had egg shells in it so I could not finish my eggs. I was upset and disgusted. The waitress Tatiana was lovely and tried her best to work with the horrible service that we were all surrounded by. The food took forever to come and so did our drinks which we got after our meal 1 person at a time 15-20 minutes apart after ordering at the same time!!!! I cannot stress that enough. This place is extremely unorganized and they have to do better! I would also suggest to get a chef who knows how to crack eggs and please incorporate more Haitian food options in your brunch menu since that is why people are coming… for Haitian food specifically!! Never again will I even put a toe in this establishment! Go at your own risk!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaU5fVTNRRRAB",
            "text": "I usually come to this place when I do my hair across the street. I would order takeout and the food is always good Fast forward Now my mom birthday is coming up so me and my brother are trying to find a location that serve Haitian food and not to far from her so I tell my brother about this location and when I telll you I’m soooo happy we came there omg. The food was sooo good and fresh, everyone loved it especially my mom. It’s wasn’t salty like some other places, the food had soooo much flavor and the hospitality was sooooo good. I was sooooooo shock I have yet to get good a** hospitality like this in soooo long or maybe at all. The owner/manager shout us out even let my family got on the mic with a live band to say happy birthday and sing he even came over to dance with her. The whole night they made sure everything was good with us no one had an attitude, oh yea I almost forgot they don’t usually make Mac and cheese on Sunday but when my brother called them and ask if they can they sure did. I highly recommend this place I will continue coming to this place they are good with me and my family my mom loved this place and definitely enjoyed her birthday coming to this restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdnF2V1VBEAE",
            "text": "The food was absolutely amazing!\nI came here with a friend and we shared the family sized red snapper (which can easily feed 2-3) with the rice and an extra side of golden legume! I’ve never Hatian food, and I can’t wait to come back and to try everything else! Best food, HANDS DOWN ❤️👌🏾…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbTdqR0ZBEAE",
            "text": "If you're in the area, definitely make your way here. Sony is the man! Attended a birthday party here and Sony showed us great hospitality. They serve big portions of authentic Haitian cuisine and the drinks are perfect for the party/turn up/fête/all that. Very nice venue with a familial vibe. Honestly, a dope spot to throw an event."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcS1hYlBBEAE",
            "text": "I had a great time, the place is spacious and clean, the people were nice and yes outdoor space is a definite plus nowadays not to mention bar sitting. If you need a spot to relax and enjoy some Caribbean cuisine right here in Brooklyn Golden Blue is the spot."
        }
    ],
    "reviews_count": 56
}