{
    "name": "Brooklyn’s Best Eats",
    "place_id": "ChIJJZ353g1bwokRubInqTJ7-fM",
    "grid": "BK14",
    "address": "23 Hillel Pl, Brooklyn, NY 11210, USA",
    "rating": 3.8,
    "user_ratings_total": 75,
    "phone_number": "(718) 252-1234",
    "reviews": [
        {
            "date": "23시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCelRsSmhTWEZGWkMxdWVEZHFkWEZPVVVWdWJrRRAB",
            "text": "The food is always fresh, the staff are super friendly, and it’s just steps away from Brooklyn College, perfect for a quick bite between classes. Their sandwiches and wraps are packed with flavor, and the prices are great for the quality. It’s become my go to spot whenever I’m around campus. Highly recommend to anyone nearby!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdFNVcGlkR2QwV2pFM1lXMTJTVkppYTNCS1EzYxAB",
            "text": "Great food! Fast service!! And extremely friendly staff! 100% recommend"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eE0zUkhVa3BMVDI5NFNtbDJkV1ZmV0UxbFQyYxAB",
            "text": "Went to try it out and was very disappointed eggs had a shell in it then they got upset because I had eaten half of it before my discovery and I demanded a refund.They said \"you people always complaining\"\nWOW... Never again ✌️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSlZXNUdkazlYTW1aMlJYQlBORGxNWlZNMmJtYxAB",
            "text": "Horrible experience ordering from here. Never again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORWNEQm1lSHBxWWs4M2NURkpRVU51TjBoamFFRRAB",
            "text": "Nicely located in the closed loop in Flatbush area, this corner deli serves up a variety of hot/cold sandwiches.\n\nGo checkout the creative sandwiches with plenty of options like the Steph Curry, omelettes and breakfast burritos. I got the healthy breakfast burritos (egg whites, Turkey bacon, Swiss and home fries w/ ketchup). It was good and definitely some extra napkins as you devour it.\n\nWill go back to try a different sandwich for sure. Make sure to check prices, they may have some incentives if using cash and watch out for addictives to pricing.\n\nDefinitely worth a check out if you’re in the area and just want a lot of options to choose from."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ3JISUlnEAE",
            "text": "So disappointing. I ordered a beef burrito today. What they gave me was some chopped hamburger bs inside my burrito.  What's worse was the burrito was drowning in grease. I had to wipe it down before taking my first bite. 0/5 would recommend this place to anyone."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdXVqdkpnEAE",
            "text": "They definitely take advantage of these college kids. They be up charging from the original price it is. Plus they don’t even be saying how they charge extra with apply pay."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OXVyczBBRRAB",
            "text": "PESIMO CUSTOMER:  The Service  a terrible attitude, I do not recommend it at all, I will never come back. I do not recommend it at all."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aVpfS2h3RRAB",
            "text": "THIS PLACE IS A SCAM!!!! I am a busy college student and have been a frequent customer since this place is very close and convenient. However, I have noticed patterns in which these people overcharge the food despite telling a different price on the menus. In addition, the food is not high quality nor do they meet the expectations as explicitly stated on the menu. I used to order the chicken cutlet sandwich and each time, they would skimp on the veggies especially avocado. Or shall I say barely. Then, today I ordered a grande breakfast burrito. The cashier said the total was $13.35. How do you go from $8.95 to $13?? So I asked her nicely, and she said the Chipotle mayo was an extra 50 cents, which is fine, but how is it still $13? The overcharge is insane. I went to eat my sandwich later and there was NOT EVEN CHIPOTLE MAYO. This is extremely upsetting. People deserve to get what they pay for and taking advantage of college students for extra money is completely immoral. Do not go to this place and take the extra step to go somewhere else where you’ll be treated with respect."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbHBMbENREAE",
            "text": "The food is Okk and the customer service is bad the lady at the register is rude she got an attitude from me asking for the menu because it was my first time there. The chicken was very hard and I asked for it to be very tender, wouldn't recommend it to anyone first and last time going it just wasn't it for me"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYc2JpSDRBRRAB",
            "text": "Thanks for having vegan options! The vegan sausage Italian sub is great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNk1xNjJRRRAB",
            "text": "I was 36 cent short and they let me slide—instant good vibe. Panini’s good too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua3JmcnFBRRAB",
            "text": "Very interesting customer service, I came to get a spoon and the short Hispanic lady with brown hair gives 2 by accident , so when I grab the second one she didn’t want to let go of it. Not sure if there’s a spoon shortage or if she’s on her last write up."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbHFqbVRREAE",
            "text": "Great breakfast sandwiches and other snacks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OVBXVG1nRRAB",
            "text": "The prices are expensive but you’re paying for excellent quality food and big portions too, they never did me dirty on the food and I usually ordered pickup on Uber eats so I never had a problem getting scammed. In fact, sometimes they would accidentally give me a hero instead of a roll lol."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNExlQ0VREAE",
            "text": "Like it, is one of the few places who make a killer of Mediterranean hot sandwich."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNnBlX2tRRRAB",
            "text": "The lady who’s always by the register with her glasses on is my girlll🫶🏽\nthere was some new rude lady at the register today; wasn’t trying to help me out, lazy attitude the whole time while i waited for my food, and gave me an attitude."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkb092dWZnEAE",
            "text": "The reviews are true their prices are very expensive and they charge you extra. They charged me an extra $3 “tax” for a $13 meal. They do this all time they’re taking advantage of people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcUxMQV9RRRAB",
            "text": "This is my favorite place to grab a bite when i go to work. The staff is as amazing as the food is!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsdjdQTUZnEAE",
            "text": "Sometimes they get your order wrong and give you an attitude about it, for the outrageous prices you think they’d always get your order right. Food is good though"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaXEyamVREAE",
            "text": "I gave two stars because they write your order down and they get it wrong. I asked to create my own salad, when I got home I realized they gave me what they wanted not what I asked for. I did not walk back to return it but I was annoyed.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMjdtbm5BRRAB",
            "text": "Despite the hefty price tag, the salads are the healthiest thing in Flatbush, wish Brooklyn College had more healthy options."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMDRUTndBRRAB",
            "text": "friendly staff\ngreat food selectio"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNHJDR2R3EAE",
            "text": "Great hamburger 🍔 and sweet potato fries.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NV9qell3EAE",
            "text": "Got the chicken tenders, fries and tres leche cake. It was busy but they are organized so I didn't have to wait too long. Food was yummy as usual :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cmRDWENnEAE",
            "text": "Too much oil"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NGYtcTV3RRAB",
            "text": "If I could give it 0 stars I would. Dudes working in the back angry at me because I asked for ketchup and mayo on my sandwich. Then I was overcharged on my meal. 12.38 dollars for a drink and chop cheese. They are scammers. He pressed the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dk96UG13RRAB",
            "text": "Delicious food and service was great 😊…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSazdTMnVBRRAB",
            "text": "Does not understand the difference between bacon and turkey bacon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScnJhYkJnEAE",
            "text": "The food is okay but way too overpriced for the quality you actually get. Also not to mention that they up-charge people without warning. They have a policy written on their menu that breakfast goes up by a dollar starting at noon. I was in there at 11:07 and after I paid they said starting at 11 it’s an up charge even though it conflicts with what they advertise on the menu. When I expressed my concern they told me the menu wasn’t updated despite the fact that those are the menus they’re giving customers to look at and also that at the bottom it says prices may vary. But the lady at the register told me I was up charged because of the 11 am policy, which is no where in writing.  I feel bad for everyone else who bought breakfast there at 11 (which were a lot of people) because this business thinks they can get away with just calling out whatever price they feel like at the time. Completely unreliable and no integrity. And a business that relies on money from college kids. It’s just dishonest business. I liked the food okay but won’t be returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSMmYtMzh3RRAB",
            "text": "My son told me the food was good here, so I gave it a try. I ordered two sausage, egg, & cheese on rolls. The sandwiches was okay,  but I gave them specific instructions on how to prepare each sandwiches, & they didn't follow my…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbnE2LU1REAE",
            "text": "Love the chop cheese"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaUtYRjJRRRAB",
            "text": "Very fast service, delicious wrap, amazing price!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCemFIRDBBRRAB",
            "text": "If you haven't been here yet make it your business to go. Great food and fast service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdDZqLVhREAE",
            "text": "not very good sandwiches as all and pretty pricy as well. workers are not very attentive to customers either"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleHZma1FBEAE",
            "text": "Super busy and my hot sandwich was not even warm. They told me the cost of my sandwich was $8 and some cents but on my Wallet it says $9. Beware of them marking up your total! Will not go back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcFAyeDNRRRAB",
            "text": "I come for the sandwiches! Fresh & delicious every single time. My go to is the Steph Curry w/ pepper jack cheese and extra chipotle aioli. Can’t go wrong with the flavor combo’s in this - Simply Superior!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NXUzVTFnRRAB",
            "text": "Update: they are back on Uber eats!\n\nIs this place still open? The phone number doesn’t go through and it’s not on DoorDash or Uber eats anymore. I loved their food!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1b3N2RVF3EAE",
            "text": "Best place to eat in the area...bar none."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMjR1dEVBEAE",
            "text": "The sausage egg and cheese is divine. Their sandwiches are also quite good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyZ192STJRRRAB",
            "text": "Best service and sandwiches you'll find in Brooklyn"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyMl9tb3N3RRAB",
            "text": "Very nice people, quick to assist you, and they make my coffee just right."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXN1p2c0hBEAE",
            "text": "🙏the best🍗…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeFpMamlRRRAB",
            "text": "Best deli around Brooklyn College. Clean, good food and friendly workers."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXMHFYcGdBRRAB",
            "text": "It is fully halal if anybody wants to know as the food is pretty good because of covid no seats to sit."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpMUtpU0FnEAE",
            "text": "Solid flavors. A bit on the expensive side. 11/24/2020"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzdllYcXlBRRAB",
            "text": "Family business that provides amazing service and fresh food. The service is always friendly. A great plus to the neighborhood. Highly recommend their sandwiches 🥪…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNaU5iWFdREAE",
            "text": "I went for the first time yesterday and it was amazing. Really good food and customer service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dGFhdDRRRRAB",
            "text": "the vegetable burrito is the bessst ive never physically been there i uber eats but good just bit expensive"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2cTliak13EAE",
            "text": "Exceptionally good local breakfast/lunch spot.  Friendly staff & good quality food."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzN2ZMYV9nRRAB",
            "text": "Food is good but over priced. Literally a deli around the corner just as good but cheaper."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTbDVueHJnRRAB",
            "text": "Great food, delicious shakes, and great customer service"
        }
    ],
    "reviews_count": 52
}