{
    "name": "Ayat Ditmas Park",
    "place_id": "ChIJ6X_uAQBbwokRkz6ELYOHvnA",
    "grid": "BK14",
    "address": "1618 Cortelyou Rd, Brooklyn, NY 11226, USA",
    "rating": 4.8,
    "user_ratings_total": 1082,
    "phone_number": "(347) 365-4684",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sd1dsa3lNVGhUVUVrMlZWOHlaelYxVEdoUVRtYxAB",
            "text": "Wonderful experience at the Ditmas location with Meh as our server! She was wonderful. We will be coming back!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214ZmR6QnRNMjFXZFRGaVYxQmxZVkJVWTNaR2VWRRAB",
            "text": "Food was better than expected out of this world. Meh was an amazing server!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSFREQlhRM05UYkVNNFRFRmtTbE5RWlRWeVNHYxAB",
            "text": "everything WAS AMAZING! soft pita, amazing tangy babaganoush, great vegetarian options. only thing was the tahini ice cream was freezer burnt. baklava was incredible, not too sweet, flaky...mmmm"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GM2JpMHdSSFEyY25CVVUzWkpNMkpOZGw5U2VuYxAB",
            "text": "The food is absolutely amazing."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKc01XaFRhMk5MVEhwdGNYbEtPR2RsYjJsNFZrRRAB",
            "text": "The food is BANGIN’. Proceed with caution, you will be full and uncomfy from stuffing your face."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taelJGVXRTWFpwWlMxZlUwVllXWEI1ZFhFMFJIYxAB",
            "text": "Absolutely amazing food and hospitality, will definitely be back!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTk1HcDNSRGRuZUY5TE9YQmxPR2szY1c4M2NWRRAB",
            "text": "Loved the chicken kebab sandwich and the pistachio dream cake. Amazing portions and a lovely atmosphere,  can’t wait to come back here!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTE1WZHFOM0Y2WWpSWGFXcGxYM2RxWm5GTllVRRAB",
            "text": "The food was absolutely divine. I give it a 10 out of 10 it was such delicious fresh and I enjoyed every bite. However, the service was a bit off. The moment we got in there, the waitress was on her phone, dragging her feet literally that’s all you heard throughout the whole restaurant while she was on the phone. I also asked one server for garlic sauce and two cokes and she gave me garlic sauce to go. I had to ask her again. It seems like they lack a little bit of attention there I really don’t wanna make it sound like it wasn’t a nice experience because absolutely it was! I’m going back !  just the service was a little slow. Maybe it was  day they had an off day but that girl on her phone was wow…. But highly recommend this restaurant you really get a taste of Palestinian cuisine, but in professionalism standpoints she really seemed into her phone a lot. Amazing place I love it!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMVNsVkRaMnM1TUhoZmNHaG1SekV6Ymw5aVRFRRAB",
            "text": "Some of the best food I had in NYC. 100% worth a visit."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMVFteHdhMnAxUzBoTlJqWjBNVTlHT0dkT1NtYxAB",
            "text": "Delicious food and wonderful atmosphere, very family friendly too"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcmEzSXdMVU5ZTlhWdldrTklTMlJpYkdoVFNuYxAB",
            "text": "I visited Ayat Ditmas Park with my family, and the experience was delightful. The interior is vibrant and beautifully decorated, with striking artwork on the walls and an upstairs seating area with a glass floor, allowing you to see people below, a unique touch that adds charm to the space. I tried fried calamari with fries, khubz, and the family platter, paired with refreshing lemonade and mint lemon water. Each dish was flavorful and satisfying, highlighting the care and quality of the food. The service was attentive and welcoming, making the meal even more enjoyable. What made the visit memorable was the combination of delicious, vibrant cuisine and the striking, lively atmosphere. Overall, it was a wonderful experience, and I would gladly return."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQlprSlhWMU5tT1ZoMFozaDFkVXBZUTNCdFNGRRAB",
            "text": "The food is fabulous. Love the vibe and highly recommend."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNk9WVk9PVkJvUVV0bFVXaGFPRjg0VWxCeFVWRRAB",
            "text": "Great experience here at Ayat, huge portions and great customer service with a friendly staff and reasonable prices and love the interior of the restaurant. Will be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVWJFbHZYekpDYjFWWVp6RlJlamRsTkRobE1rRRAB",
            "text": "amazing food"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMmVETlFNekZCY0hodmRrYzVWR2x1TFVSVlRuYxAB",
            "text": "My Experience at Ayat was one I’ll never forget. I was serviced by Ali and he was an incredibly attractive waiter. The food has amazing flavor and was so fresh, the drink was perfectly refreshing, and the dessert was great! When I received a dessert I didn’t like at first, Ali didn’t hesitate to recommend something else and change it, free of charge. My second dessert, tres leches, was right up my alley! I will definitely be back"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBNVFWcDFWMUp3YkVwYVpVNVpVVWR0ZGt4NGJXYxAB",
            "text": "I ate here last Sunday with a friend, but I’ve been here multiple times in order for delivery whenever I have company.\n\nWe started off with the eggplant with pomegranate dish, an order of falafel, and some tabouli salad. They also brought over some table, olives, zaatar, and warm pita. The falafel there is always fresh and you can tell it’s made in house. It’s not dry or crumbly and pairs well with the pita. The salad and eggplant are also good. The tabouli had lots of fresh parsley, and the eggplant is warm and tangy, and is delicious with the pita. I’ll also say that their pita bread is pretty top-notch and they’re usually generous with offering more for your spreads as needed.\n\nWe ended up also splitting a pistachio pizza, which was very good. I always add a little bit of tahini and zaatar on my pizza. I’ve also had some of their other pizzas, as well as the pizza Shawarma.\n\nDefinitely one of my favorite restaurants in the neighborhood. I also like that it’s BYOB but their other drinks are good as well.  The service here has always been excellent and the food stays consistent.\n\nMy only critique is that sometimes the table feels a little crowded because of the larger platters and the pizzas, so I wish they had those tabletop pizza holders that some pizza restaurants use so you can stack things.\n\nPros: the food is excellent. The service is excellent. The vibes are good and BYOB is always appreciated.\n\nCons: maybe finding a way to stack some of the platters or trays so the table doesn’t feel too crowded when you order or share things."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUmVGRmFSbUpDY0ZobFMyTjRiRFZKWm01WlZuYxAB",
            "text": "The food is flavorful! So very good. The service is so much better than it’s been. Tonight it was perfect!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeGJHcGxTV1UzZEcxS1NVdHRTR1pQV1dkMU0zYxAB",
            "text": "Loved this place, loved the staff, and  loved the food. I live nearby and have always passed by, finally got the chance to stop by and don’t regret it!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVmMyWk5jMEpyVWpsVGJFRmtaRGhOWlhkSFpIYxAB",
            "text": "It was phenomenal and the people there were so sweet"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReE5uZHhaVzgwYjJ4MGJYcDBRMVpKVDE5cFoxRRAB",
            "text": "Beautiful experience!! Staff was so friendly and attentive and gave us an amazing experience"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SQ2JuTndVbG96ZW5sSmQwUTFSVzUyV25sME5HYxAB",
            "text": "Stunning food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeE1VaE9TVE16VlMxUVJqSjVhMjAxY1dScWMyYxAB",
            "text": "I have been to Ayat Ditmas Park several times and it is always wonderful! The food is so tasty and the ingredients are so fresh! Also the service is wonderful. I want to shout out Ali in particular who is so attentive and knowledgeable about the menu. When he found out it was my husband’s birthday he ran to put on Stevie Wonder’s happy birthday and brought out a surprise dessert. He is super sweet. We will definitely be back again!"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkdk5yUVV3EAE",
            "text": "I had to write about an experience that I had when I walked into this restaurant on an afternoon on a Sunday there was a hostess at the front and I was waiting looking for a menu after a while she came over and said “what do you want” very rudely and disrespectfully. I said a menu and then instead of going to get a menu she points and says over there in the front. I grabbed the menu and while it’s looking at the menu, I came over to her to ask her about an ingredient in a dish. She quickly dismissed me and moved to the front where the menus were to help a white couple coming in. I don’t wanna bash the restaurant over a bad hostess, but I’ll never be coming into this restaurant again or any of their locations  businesses. I don’t support this business."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTldHZHlPSEExYzNOek4yMDNSM05wYzFnMmVrRRAB",
            "text": "Fantastic experience overall, amazing food and service!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cc1UxRjVaRVZ4WVZaMFNIRmxWMkpDY1RObGMyYxAB",
            "text": "Walked in at Ayat and we were able to get seated right away. Food is delicious. Currently BYOB. The entrée servings are generous so you can get away with some apps and an entrée for two.\n\nShout out to Arin. Appreciate her warm spirit."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paR1QxQlpjeTFJY201ellWOHRkMlJZYzBvekxXYxAB",
            "text": "Meh took wonderful care of our large group! Fantastic food and service!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNlpFRXRkRVZ5ZW5KV1NFZHFSMmxwV0V0d04zYxAB",
            "text": "Best restaurant in the neighborhood! Great food, great prices, high quality ingredients. You can’t go wrong."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SlpuRm9jVVY2ZVdsQmJHSmpZMlJXT0ZCMU4xRRAB",
            "text": "Ayat gives you the best bang for your buck! And the customer service is impeccable. Shout out to Shondel for her hospitality!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNU9HMWlRM1U1WjFNMU4wYzNURTg1Y2pOblRrRRAB",
            "text": "What a wonderful dinner at Ayat Ditmas Park! The food was completely fresh and full of flavor—the hummus and fresh saj bread were just the start, and the lamb and chicken mains just the right balance of spice.\n\nSpecial mention should be reserved for Ali, whose brilliant service and warm hospitality made the evening. He looked after us well and made some excellent suggestions.\n\nIt's more than just any restaurant; it's a cozy little community treasure. I highly recommend it and will be back again soon"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMFoyVndVV3h5WmtKT2QxWmxWRzVFWkVoRlQzYxAB",
            "text": "Great service, super friendly and quick. Made the whole meal even better without making a big deal out of it. Thanks, Ali"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adGNrWmZjRTlaVVhWM1gxOHdRekF4UW5aMlZYYxAB",
            "text": "ALI was very welcoming and nice  he served us food and was patient with us, he took time out of his shift to take photos for us, and made it a memory for us, thank you"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NE9WbFRVV0UyUkhkdmVXTkNja2RsY2xkWVZuYxAB",
            "text": "By far the best middle eastern in New York."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STE1HRm9Zek5wZURWZkxVcDBSMUZCV1VGYVVrRRAB",
            "text": "Everything delicious and accommodating, friendly staff."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWWRVVkdWbGhhTldsVFVHbEhPSE10Y1ZVMmVsRRAB",
            "text": "Wanted some delicious, comforting, healthy food on a rainy day and I was not disappointed! Got nice portions and plenty to take home for later :)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsT1luUlRRa1k1WmpOTFlsQmhZbGxPUW14UWFIYxAB",
            "text": "Ali was an amazing!!! The food was delicious too!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dmQyOVBOME5wY1RaMU9TMTZkVzlJVm5wU2QzYxAB",
            "text": "Food is wonderful. Portions are huge. Very accommodating of toddlers. One of our favorites in the neighborhood. We love this place. Our server, Arin, was fantastic."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUmF5MUlXalZuUjBjNU5XaDJUazgzY1VSUlpVRRAB",
            "text": "Our food was incredible. The portions were huge. The pita bread is so soft. Our server was Ali and he was very friendly and efficient."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTU9ESTVXalJVV1dwUmNXbEJZVGR0TVZNdE1GRRAB",
            "text": "Incredible food, the servers were lovely—shout out Ali who took great care of us. I would come back to the neighborhood just to eat here again."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ZlpVWk9TamN5VUhKVk9WcHRiMWxwV1dSc1IyYxAB",
            "text": "One of my favorite restaurants. Food, service and vibe are top quality. And they have consistently stood for peace, inclusion and justice through their community action and social media presence. So happy to support Ayat!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQ2VYWTVTV3RCUzFkRWJuUnZhakZ4VEdod1luYxAB",
            "text": "People on this site will likely focus on the restaurant’s strong defense of justice for Palestinians, so don’t be distracted that this is some kind of political think tank. It’s not. Justice and great food — and a wonderful cheerful helpful staff — can co-exist!\n\nThe falafel sandwich and platter are great but definitely order the muhammara, which is a red pepper spread with pomegranate molasses.\n\nAnd please pray for peace. Peace for all, not just those with talented and well paid spokespeople."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNU1qRXlWRWc1VjJsUU1URTROelpWYW5FMGQxRRAB",
            "text": "Best food, absolutely incredible wait staff. We loved our waitress Meh, she made my mom’s birthday really special. Thank you!!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRWRUUnBRakY1YVU1aFVXeEZUSHBCVXpGMVgxRRAB",
            "text": "I was choking while laughing and this sweet lady who works at ayat with a butterfly clip came by and gave me some water ❤️"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReGN6TjZhVWxtV21KQ2RWSm1ZbkpYYWxvdGIxRRAB",
            "text": "Everything was absolutely delicious! 😍 The oven-baked pizza was perfection, falafeeel 😍😍😍the fresh bread with olive oil was so tasty, and the tahini ice cream was truly unforgettable. Such a wonderful dining experience — can’t wait to come back!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONU5WSnhjMWRXVDNoRVoxUmpSR05YZGtscVlWRRAB",
            "text": "Casual. Authentic. Delicious. Every time. Can’t fault this place! Maqloube for the win!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGblYxSm9WMFF6YlU5blZYaDJabmM1YlZSYVQwRRAB",
            "text": "The food was amazing as always,\nArin, Thank you for such a wonderful experience your recommendations were perfect!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxT00wWkZNRUpyV1VGRGRUZE9ZVUZNTFRsQ1pVRRAB",
            "text": "I had my baby shower here and the food and service were incredible. Our servers Arin and Genesis did an exceptional job. They were covering the entire downstairs in addition to our party but they still managed to make sure we were very well taken care of. All the guests couldn't stop raving about how good the food was. Portions were super generous- everyone left happy and fed.\n\nMy only complaints is that the upstairs got very hot. The one A/C was running full blast but it wasn't enough. We were all shoving ice down our shirts. Also, the see through floors on the second level are an interesting choice- I'm just happy I wore shorts under my dress so I didn't flash the whole restaurant. 😅"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NGVVOU5iRE5XYjJjdFIyVmliMUU0ZW1SQ2VHYxAB",
            "text": "Incredible experience will remember this for the rest of my life!! Came here to celebrate my virgo friend’s birthday and we left full and happy. They even took pictures of us and were so friendly. All the food came out hot and delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVE5XRjFjRUZUTm1OVGEwRkRlVzA0VVd0RVluYxAB",
            "text": "Our server Arin was very professional and nice. She was very helpful. Our food was very delicious giving a shoutout to the cooks for such awesome and big servings. I love this restaurant and I think other people would too."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJakxQZkVREAE",
            "text": "What an absolute joy this place is! Went for lunch, and we loved it! The drinks were fun - particularly loved the Limonana. Had the cigars with spinach and cheese, and those were quite delicious, too. Had hot, delicious pita bread with olives and an herb mix...was zata'ar?\n\nAnd then came our mains - I had the vegan platter. I am not vegetarian, but I must always get falafel if it's on a menu, I was told I had to try the zahir (cauliflower) by a friend, and I love eggplant. The falafel was tasty (wish I had gotten some labneh on the side, but I'll know for next time and there will be a next time), the eggplant was divine, the rice and stuffed grape leaves were ok, but the zahir? It was the best bite of food for the whole meal - so very, very scrumptious. My daughter really enjoyed her pizzawarma, too, which was honestly the most massive thing I've seen.\n\nWe got the pistachio dream cake to go because we were too full and I can't pass up anything pistachio. It was just okay for us as it's more a chocolate dream cake with a hint o' pistachio.\n\nThe service was lovely, the decor and vibe cool, and I am just happy to have discovered this gem near home!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMVNrWm9UVFJGU2s4elpreEZWRnB1V214bGNFRRAB",
            "text": "Awesome spot for amazing authentic Palestine food with live ambient music! Came with a date and sat in the outdoor seating which added to the amazing vibes. We got a hummus and a pizzashwarma to share and even that was too much food! The price is just right for the food you’re getting"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3d01VUmFSRTlrVDFaaVFXbFpiMkpsWkhaVmFsRRAB",
            "text": "Our wonderful waitress Demiz made our experience so lovely, we had a warm welcome! They accommodated my many allergies so well, checked on us multiple times to make sure we were doing good. The food was fresh and tasty, customer service was 10/10, food was 10/10. No notes at all."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ak1WVXpYMVpqYm1VeU9UTlhTM2h1T0hCVldtYxAB",
            "text": "Beautiful atmosphere with the art, live musicians, and friendly staff! I went with an old college friend of mine and my husband, and we ordered three dishes - the portions were so big, we took the rest home and it fed me for days! (Note that they do not serve alcohol :))"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLM3ppUEdjNXByaHFBRRAB",
            "text": "Food was amazing!!! Every item, every bite, was just delicious. There’s no other way to describe the food. Pure bliss. Service was excellent. Drinks were tasty as well!! If you have not tried this please do. You will not regret it!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQRDBsb1g0c2VEYWhnRRAB",
            "text": "This place was so awesome!! it’s super cute, wait staff is great and very friendly. The food was so delicious and def great if you like to share food. will definitely be coming back to try their other dishes !!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdWE2LUc1cllqWENnEAE",
            "text": "Genuinely one of the best meals ive ever had. We ordered the hot appetizer mix, m’sakhan, and tanhini fudge brownies. Huge portions definitely able to be shared. Amazing food, quick service, friendly staff. Couldn’t recommend more highly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQN1VxTTcwcGNLV1lBEAE",
            "text": "Delicious food served in large portions. The service was great and our waiter, Arin, was very attentive. I would definitely come back here the next time I am in town."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SYU0weHNiRlJqYW1KMGJIcGFaR2hDY0ROZk1rRRAB",
            "text": "Shandel was very welcoming, friendly and attentive. My first time here, i ordered the Salmon Kabab, yellow rice with potatoes and salad. The salmon was cooked perfectly, moist on the inside crispy on the outside. The rice was delicious and light. Potatoes were also delicious and crispy and the salad complimented the whole dish. They gave the right amount of food portions. I will definitely be back soon to try other dishes and desserts."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdE5ITnFaMWxEVmpJMGVEWmtVM2RGTVV4YWFFRRAB",
            "text": "Always have a great time every time my friends and I come here. Portions are large, food is delicious, and the staff is amazing! Definitely a neighborhood staple for us."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLN2cyZXFDaTV5RjJ3RRAB",
            "text": "Everything was amazing. Some of best food I've ever eaten. The server was personable. The food arrived quickly. The watermelon feta salad and za'atar margarita pizza were AMAZING, as was the lentil soup. My only critique would be that the music was very loud."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMGRFNVBNVTlSVDNwWlFqaGFVWHA1ZEhWbllXYxAB",
            "text": "Palestinian restaurant in South Brooklyn - multiple locations throughout the city and pretty well-renowned.\n\nPulled up on a Saturday night expecting to wait given its popularity, however we were seated right away. Definitely a good vibe for large groups, apparently they have a BYOB policy so don’t be alarmed if you see people drinking. They do not serve any alcohol or pork products on the establishment, and. their food is strictly Halal.\n\nWe got an iced hibiscus margarita mocktail and a hot drink called ‘Sahlab’, which I would describe as very similar to a Horchata but a little bit more fragrant and extremely comforting. The hibiscus margarita cocktail was also on point.\n\nFor the appetizer, we ordered the ‘Mezze Filistini’ which came out on a large display plate featuring 6 different cold spreads/salad, which was served with their endless, wood-oven-fired pita bread. The dips were amazing, special shout-out to the Muhamarrah, a red-pepper and walnut spread.\n\nFor our entrée, we ordered the mixed grill, which came with chicken kebab, beef kebab, kofte kabab and a single lamb chop. This was served over a bed of rice, and salad, with mixed pickles. The meat was cooked perfectly especially the kofta kabab, however I would say that the beef kebab was a bit chewy probably because it was steak.\n\nOverall: 8.5/10"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLNkt3YkxxdVBfdXJ3RRAB",
            "text": "The ambience is great and there are happy customers all around. The overall environment is very positive. The food adds onto the happiness because the taste delivers a unique blend of healthy and delicious ingredients. The waitstaff checks in regularly and holds your needs to the highest regards. Lastly, be sure to order the cinnamon hot tea drink they have! (And don’t forget the hummus!!!)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMnJQaEhREAE",
            "text": "Okay what a gem!! Food is marvelous. Their bread is addictive. Everything we tried we\nJust stuffed ourselves with. Our waiter, Tafka was so sweet. He gave us a whole box of pickles to take home. We are stuffed and plan to come back soon to try their desert menu and coffee"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZmVXSk9NMWxpZWt0b1dEa3pla2hETUZoQlJsRRAB",
            "text": "We loved our experience at Ayat! We started with the Mezze Filistini, a generous platter featuring hummus, baba ghanoush, muhammara, tabbouleh, salata tahina, and labneh. It was the perfect appetizer—plenty for our party of four to share and enjoy.\n\nFor mains, we ordered the lamb kebabs, which were incredibly well-seasoned and flavorful, and the maklouba—a beautifully layered dish of slowly cooked chicken, carrots, potatoes, cauliflower, eggplant, and rice, topped with parsley and slivered almonds. It was comforting, hearty, and delicious.\n\nBeyond the amazing food, the service was excellent, and the art and decor throughout the space were both beautiful and deeply moving. Generous portions, warm hospitality, and a truly memorable atmosphere—Ayat is a must-visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVGJ5ZkRJeVBHNU9nEAE",
            "text": "We had a lovely experience last night at Ayat. The food was incredible, full of deep flavor and textures, and the spices were perfection. Especially the za’atar. The house made Naan was light and airy, baked to  perfection. Yum, yum, yum. We were too full for desert so opted to take the baklava home for a late night treat. Yes and yes!! Our meal was enhanced by the amazing service we received by Arin, among others. What a special place. One that we will definitely be returning to soon. It’s BYOB so keep that in mind if you’d like a drink with your meal. They are more than happy to offer glasses and opener if needed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NU0wNWpiV1JsU1c1ZmJEbEthVWhXV2xFd1VuYxAB",
            "text": "Nice and beautiful way of interacting with the customers. They are very well mannered and pays a great service too. Good work by Arin, really appreciate her work and she’s amazing"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJLWhoclNCdTRTZlBREAE",
            "text": "My friend and I had a lovely experience at Ayat. We went for lunch and it was very quiet. Our food came out fast and fresh. We got the Halloumi Watermelon Salad and the Chicken Shawarma sandwich. They were both incredible and flavorful. The chicken was very tender and juicy. I am absolutely coming back to this cute spot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKZlRuWlZOWHAyYzFoYVdVaHBlR2h0TkU1TGEwRRAB",
            "text": "Arin was absolutely wonderful! Attentive, kind, and so thoughtful throughout the entire meal. She really made our experience feel personal and special, and her recommendations were spot on. Truly one of the best servers I’ve ever had! And the place was so cosy and beautiful, definitely recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNaTFyUDZRMnZ1REVREAE",
            "text": "Lovely atmosphere with such friendly, attentive staff. I was drawn in by the live music and just got dessert, but the pistachio dream cake is superb, and the warm pita (with olive oil and dipping spices) they give you while you wait was probably the best pita I've ever had. I'll definitely be back for the food!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX2NYZHJRRRAB",
            "text": "Started off with the hot appetizer plate , which was a great way to try multiple things. Everything was delicious. The lentil soup was one of the best that I’ve had !! And ended with the Mansaf which was a great piece of lamb which was shared between two people. We were stuffed and happy by the end. Loved it all!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdUM4TUg4NzZHb2tRRRAB",
            "text": "An absolute gem! This Palestinian restaurant serves rich, authentic flavors with heart. The pizza warms and maqluba were perfectly spiced, the hummus ultra-creamy, is unforgettable. You can taste the culture and care in every bite. Warm service, beautiful atmosphere—truly a soulful dining experience. Also Shondell was an amazing host. Highly recommend this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNU4yeDNXa0phTm1aTVJVeEVVMjFmUlVVeU5IYxAB",
            "text": "All of the portions are huge, so keep that in mind if you don’t want leftovers. the mensaf rice was amazing. the service was incredibly friendly, and Erin did an amazing job taking care of us. We were from out of town and they helped us find a spot to put our luggage!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUGF6WkJlVVpJTUZoWVFVbDVXR3BETTFoNGVtYxAB",
            "text": "Great Israeli food. Feels like home. Chicken shwarma is amazing but the beef one was chewy (it wish it was a lamb one instead).\n\nGreat meze - I particularly liked labane and baba-ganush. Pitas were great as well.\n\nIf you like this kind of food - you'd love it here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FM2JsRkZiekZrYUdWWFRqbHdNbXh2YTFwcGFHYxAB",
            "text": "We loved our meal, all around excellent. They start by bringing olives to the table along with some seasoning. We decided to start with the hummus which was very silky, paired with fresh made pita. My friend enjoyed the vegan platter while I had the mixed shawarma. Everything was flavorful and cooked to perfection. The portions for the platters are huge, enough for at a second or even a third meal.\nThe service was delightful. Den helped us while other staff were also attentive.\nSuch a great experience with a positive message on the bags and bill about love, empathy and bringing community together."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQQ2xtdnFZLVpUNnVRRRAB",
            "text": "Some of the best food I’ve ever eaten, so many naturally vegan dishes! Amazing place, great to go with the fam"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNMllvX182c2JxajdBRRAB",
            "text": "Everything at Ayat on Cortelyou was amazing. We had the chicken shawarma with french fries and pickles—absolutely delicious. The chicken was incredibly moist and flavorful, and the service was prompt and polite. The Arabian coffee was also outstanding. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOR3RfYVBmbTVtMkZREAE",
            "text": "Shondal and Gi Gi were our amazing servers!\nShondal went above and beyond. The food was soooooo good !! The warm pita bread, the platters, the falafel. The decor is also beautiful and well thought out.. wonderful experience!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaVAzaDJBRRAB",
            "text": "First time trying Palestinian food. The food and service was top notch. They were very friendly and helped me choose the menu. Tafka was a very nice person. Overall 10/10. I will surely visit again. Highly Recommended!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnanBMemFREAE",
            "text": "Had been here for Valentine’s Day. Reservations are recommended as they can get crowded. The ground level area was nice and warm with live music. However the host seated us upstairs which was not great. It was cold upstairs with terribly loud tables which made the experience unpleasant. We started with pita bread and hummus and a fried cauliflower appetizer called zahir. Some of the best hummus I have ever eaten. Zahir was good as well, I wish they were more generous with the sauce drizzled on top. For the mains we got lamb kebab and fattat jaj- a 6 layer chicken dish. Food tasted good. Lamb kebabs were rubbery and chewy and the portion size was very small. 6 layer dish was good, would have loved more sauce as it became dry after a point. We followed with kunafa and mint tea. Kunafa was good but there is room for improvement. Also tried their pistachio dream cake which was delicious. I wish they had taken efforts to Atleast decorate the place for Valentine’s Day. Upstairs area had nothing except plastic tables and chairs."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZmg3WkhTaTlHV0VnEAE",
            "text": "This was our second time at Ayat and our server Shondel was great. The food was good and the service was very attentive. They are very generous with their portions, we’ll definitely have leftovers for the next few days."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOTlEUnZnRRAB",
            "text": "Everyone needs to run to this place. The pizzawarma is without a doubt one of the best meals I’ve had in such a long time. The service was incredible, Shondell was so sweet and very attentive. All of the food was so fresh, warm pita, everything was 10/10!! Come here ASAP!\n\nAlso get the limonana :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbDZDMU9BEAE",
            "text": "10/10 would recommend!\n\nAs a Muslim-owned Palestinian restaurant, they were incredibly welcoming and accommodating—whether you’re with a big group, family, or dining solo. The food was high quality with generous portions; I got the chicken and lamb over rice for around $15–16, and the serving was huge (barely finished it!). I also tried their lemonade and their alternative to Coca-Cola—it tasted just like the original but, of course, aligns better with human morals.\n\nThe atmosphere was vibrant yet serene, making it a great spot to enjoy a meal. And bonus: the bathrooms? Very aesthetic—perfect for pictures!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvd3BTQzN3RRAB",
            "text": "I don't normally write Reviews unless I really really like the place. This Restaurant is 100/10 I loved it. We came across it as we was passing by the area. We loved everything about it. The atmosphere, the food, the drinks. It's definitely my new favorite restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeFIwZ3ljMGhMYTFFNVZFNW9jblowTWtrNVRWRRAB",
            "text": "Spicy chicken kebab and hibiscus margarita was delish.  First time here and will definitely be back.  Our waitress Shondell was nice and provided great customer service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eU5LR0tBEAE",
            "text": "I loved loved loved everything! Service was amazing! The place is perfect and the atmosphere was so nice and chill everything is designed so prettily and the food was 10000/10 ! Finally some good food in that neighborhood! Highly highly recommend!! Also they have a Ramadan menu for those fasting and they provide dates as well!"
        }
    ],
    "reviews_count": 84
}