{
    "name": "PiCH Restaurant and Lounge",
    "place_id": "ChIJw2tVPFRbwokR1sV9AyFFCQM",
    "grid": "BK14",
    "address": "774 Flatbush Ave, Brooklyn, NY 11226, USA",
    "rating": 4.2,
    "user_ratings_total": 322,
    "phone_number": "(718) 313-3100",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kck5DMTZURGhYYUdKalMzUjRiVVpIZUU1MVZWRRAB",
            "text": "Good food, vibe and staff"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNVlqUklOams0WmxCdU0xbzFXaTFtUm1OaVExRRAB",
            "text": "Great Monday night game night. So much fun. Vendors also."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUU1FMXhXRFJLVlZsWVptOTNTV05qU0RoRVNFRRAB",
            "text": "In door and outdoor nice vibe drinks were good very accommodating and service was great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210U2VGWlNSRVk1VEhwTmEwaHRTMEphU1habU9XYxAB",
            "text": "I’m honestly speechless about my experience at PiCH — thankful my fingers still work so I can warn others. As a Jamaican, I felt embarrassed that this is what they’re serving in the name of our food. This was easily one of the worst dining experiences I’ve ever had, and I even had to apologize to my wife Toya for bringing her there.\n\nIt was clear authentic Jamaican cooking is not a priority at this spot. Our waitress was wonderful and did her best to keep us comfortable, but the food and drinks were unacceptable. We started with margaritas, but the bartender clearly didn’t know how to make them — using cheap tequila that tasted awful. My rice and peas were burnt and scraped from the bottom of the pot, old and stale, and my meat was dry and tough, like it had been sitting around for days. My wife tried cutting hers with a fork and gave up because it was too hard, and her food was so salty it was inedible.\n\nI’ve seen all the glowing reviews, but maybe it was just a bad Thursday. Still, that’s no excuse. If they were out of oxtail, they should’ve just been honest instead of serving us old scraps. We spent $150 and barely ate two bites. Do yourself — and your wallet — a favor: skip this place at all costs. I’ve never been this disappointed in a restaurant, especially a Jamaican one in Brooklyn."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoQlJYbHBNRkV6TXkxWVIybEJkVkJ2UWpKeGQxRRAB",
            "text": "That was hands down the worst Jamaican food I’ve ever had in my life. Everything tasted old and stale. They served me burnt rice from the bottom of the pot and oxtail that seemed weeks old. On top of that, my wife’s salmon was overcooked and so salty it was inedible. I wouldn’t recommend this place to anyone, and I won’t even drive down that block again. They should be ashamed to call what they serve restaurant food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWVpVdFdZMVpyUWtzNVZTMDNMVEJrYlMxdmVuYxAB",
            "text": "I have dined here about 10 times in the past year. The food is fantastic, consistency is key. The bar persons definitely know their way around the drinks. Service for the most part is great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUU5EZHRTR0Z5ZFVaR1pUbERSSGQ2VUZFemFIYxAB",
            "text": "I had the curry muscle the sauce was salty the season fries salty and whatever sauce that was on the salmon bit It overpowered the taste"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNVZWaDRaVGt5WmxsUVJrcEhabE56WlhWeFQwRRAB",
            "text": "Finally made it to dine at PiCH with 2 friends on Sep.2.  The service started out great with a super friendly and attentive waitress. But the food was very average. One friend's rice was cold and when he raised it, his entire plate was taken away and then returned without the rice ostensively for him to eat the rest of the meal (salmon and mash potatoes) while waiting for the rice to warm up back in the kitchen. We all found this move very strange.  We spoke to a manager who agreed with us, but also tried to justify the waitress' actions. Again the waitress, and host, were very sweet and attentive about the whole situation. But bringing out what should be a hot meal, at almost room temperature is unacceptable. In the end, the waitress rectified the situation by eventually bringing out a whole new plate of the meal and at the proper warm temperature. Beautiful place with terrific staff and it was only my first time, so I will return, although our 3 different dishes (fish and chips, fried ribs, and Salmon)  were very mediocre. Nothing outstanding or rave worthy about the freshness, seasoning, or creativity. For example, the flavor of the fried whiting and fries was saved only by the pepper sauce served on the side. Also, the automatic 18% gratuity for 3 guests seems a stretch but which I hope goes directly toward fair/living wages for all employees.\nCheers!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdmFVUmthRFIyZG13NVJYbGlWVGw2T0VsS1pHYxAB",
            "text": "This is a go too Caribbean restaurant in Flatbush Brooklyn where the vibes are welcoming the staff are attentative with the atmosphere of mood lighting as the tables and chairs set up not to be intrusive to the next table seated to make a feel of 4 star service for date night and birthdays etc."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbVJFazNaamhhYlhrMmNFZGxNMEZsUTAxQ1JIYxAB",
            "text": "Monday evening is a vibes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa1pHbDJYMWhsWlRWdmFXSmhhVk5qYWtZM1kxRRAB",
            "text": "After going on a mommy and me walk with my friend, we got hungry and went to get some food. She mentioned this restaurant to me and I said let's check it out. It was my first time coming to this restaurant and it was absolutely amazing. First and foremost the hospitality was incredible. I am truly blessed with all the employees that filled the place with their presence. I felt as if we were royalty because that's how lovely the customer service was. I will definitely be dining here again. The food and drinks were amazing. I enjoyed the overall experience. Thank you for an amazing spot that's a vibe and have great food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONmNGQkhNUzFZUWpSemRGRkRia2huV21SUFEwRRAB",
            "text": "I had a terrible time at this place. The service was horrible and the food was okay. Waited forever for the server to come take our order. When she finally did arrive to take our order, we got the bottomless mimosas and because the bartender was sitting, eating and talking with a guest, it took a while to get our mimosa pitchers. I immediately told the server that we‘ll just go ahead and put in for another pitcher since it took FOREVER to get the first one. The server then charged me for 4 pitchers instead of 2 and said I should’ve waited since they were bottomless, when she knows I already waited a long time. I wish I knew the names of the bartender and server but they never even introduced themselves. If a manager of this place is reading this, it was on 8/3 around 3pm. I had a great time the last time I went so it was sad to receive such terrible service. I’ll probably go back but I’ll look inside FIRST and see who’s working before I  sit down."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeU5HZENNVXRzTVdwTU9IZzVNV05qWkhrNWFYYxAB",
            "text": "The vybz and service are 👌🏾"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTWR6ZHdkRXRUYVVKQmFsVXlZakZCWmxsdlVYYxAB",
            "text": "Always a party!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbWRsWXRlVzFJU2xkUFNGRTRNMGxQUTNaWWMyYxAB",
            "text": "Went for food and drinks before the Joe concert at Kings Theater in May. They were out of some of what we wanted to try but what we did have was quite good. The drinks were good and the music keeps you in the party spirit"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJZVk0TVdNdzd1MmpBRRAB",
            "text": "Drinks are expensive here. I paid $20 for a regular alcohol drink. Makes you want to BYOB smmhhh. My 3 stars is only for the music they played."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOZjN2S21pb0p1RTFRRRAB",
            "text": "Music is to freaking loud."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQU3l1OFhpejlyQ0F3EAE",
            "text": "Oxtail & grits was really good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQUGhqZnFWOWN1aVNBEAE",
            "text": "I love this place. I had a good time. The food I had was amazing and the rum punch was strong and they had hookah and games in the back. The owner is a very lovely woman. I definitely will be going back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQNjlfZTZWdkxUZFBBEAE",
            "text": "My worst experience in a restaurant EVER.\nWe arrived at the restaurant and we stood at the door entrance for 10 minutes Before someone came. No one on post  to welcome patrons. It took another 10 minutes before we were seated. It took another 20 minutes before our server came with water to our table. The drinks took another 15 minutes and it wasn't good at all. No creativity with the flavors and the just stale limes as garnish. We ordered 2 appetizers and only 1 made it to the table. I suppose they forgot what we ordered. The food took about an hour before it came to our table and it was terrible. I ordered the most expensive entree on the menu for mother's day to support a local establishment. The lamb chops were uncooked and nothing like the seasonings in the menu description. The vegetables were very salty and the yellow rice had no flavor. I tried to eat but left 2/3 of the food on the plate. Finally when we received the bill, the server had a $22 tip which we asked to be\nremoved since the experience was so bad. I am a generous tipper but I just couldn't reward this experience with a tip.The DJ selections were good but the music was too loud. Never again. PiCH OUT."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ3g0TE9xZzRyZnVBRRAB",
            "text": "Sadly a lot of these newer Caribbean Fusion Soul Food spots have very similar story. Under staffed, Training is lacking, lack of management. The vibe is great, it’s the 1hour plus wait for your food is what kills the experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc0xpY1FREAE",
            "text": "It truly pains me to write this review. The atmosphere was so amazing. Great dj and vibes. The mimosas were good but the “pitchers” were so small. It took our party a hour to get our food. I was so embarrassed being that I set this up for my party of 8 and was raving about this place. The food was okay, the chicken wasn’t as flavorful and the waffles were decent. We got shots for complimentary reasons. Our server was amazing and I appreciated her for everything she did. But I wouldn’t recommend this place to anyone. I hope this business flourishes but until they get more efficient cooks this place will keep losing customers for long waits of food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvODdmNmp3RRAB",
            "text": "Food is good. Music is good. Atmosphere is chill. Always fun when I am with my friends. 6 of us dined in and our meals came out at different times. I gave 3 stars is because the service was slow. The last person in my group to get served her meal took a little less than 2 hours from the time she ordered til the time she got her food and the only thing she placed was an order of chicken wings and waffles."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN1p2MEJREAE",
            "text": "I really try not to leave bad reviews for black businesses but this was an unbelievable experience. Just wasted $100 with tip included, for terrible service and subpar food.\n\n$22 for some old dry overdone pancakes w cold eggs. Barely ate any of it. The server could tell how bad it was and gave a very small discount still. Salmon cakes were pretty good but not worth 18, at all, for 2 little cakes. Everything that could go wrong actually went wrong.\n\nNo sense of urgency in this place - customer service is very poor. Don't see myself goin back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOGUzSVdREAE",
            "text": "I've been here for brunch quite a few times. The food is good, a little overpriced. Each time I came some of the food items temp wasn't always where it should be I'm guessing its due the wait. Service is okay. Chill vibe. Come early before the crowd if you have children. Something is typically not available on the menu. I haven't tried dinner here but I've gone to a friend's brunch event. The price really wasn't worth the food items"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbV9UZFFBEAE",
            "text": "Went there for a 7:30 birthday reservation. At 10pm we finally left because the food never came out. The waitress was nice but unfortunately that didn't make up for never getting the order. They also gave plastic utensils as if we were getting takeout. I will try again so I can support a local business. But I have to say it was truly disappointing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNFlEZVJREAE",
            "text": "Good food, great vibe, great service,  would definitely return"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOF9DQU1BEAE",
            "text": "Chill spot, see Jessica bartender on Saturdays"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOUk3UlNnEAE",
            "text": "FOOD WAS AMAZING , MUSIC WAS ON POINT. JUST SERVICE COULD BE A LITTLE BETTER."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bEpqU29BRRAB",
            "text": "I went there Saturday night and waited a hour for my food I ordered the pineapple fried with shrimp and when the waitress came with it ......it was a  plate with rice and shrimp no pineapple it was just horrible I wouldn't go back"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNld2FLcnlnRRAB",
            "text": "Has a beautiful decor in and outside and great overall atmosphere. Food was delicious we wanted to try EVERYTHING on the menu. A ton of GREAT drink options and staff was very friendly."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnb2NLeWhnRRAB",
            "text": "The food tasted very horribly (The pasta was very salty  and way to cheesy ) . They possibly need to find a better chef for a better tasting of the food. As for the scenery, it is a nice place and is well designed."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLXZXUTd3RRAB",
            "text": "A perfect spot for brunch with great food and a lively atmosphere. The music sets the mood just right, making it a fantastic place to relax and enjoy a delicious meal with friends. Highly recommend for a fun and tasty outing!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBLS11NVJnEAE",
            "text": "PiCH is a fun place. Good atmosphere with music, good service. Most importantly, good food. Nothing blew me away, but I would definitely eat here again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOTdmYXpnRRAB",
            "text": "Had an amazing time. Drinks were amazing, and Shanae was amazing!!!! 💖💖💖"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmb2QyLVFnEAE",
            "text": "I've been to Pich a few times.  The space is a good size.  Music is good.  The food taste good.  The service is on the slower side. I went there a few days ago.  It had just opened but did not have some of the items on the menu. I asked for pasta with oxtail.  They didn't have oxtail. I wanted callaloo but they didn't have that.  I asked for a salmon dish and another person wanted salmon bites.  We were told to choose one or the other bc there was only one salmon fillet left... I ate the whining pasta with salmon and it was really good.  Perhaps it was an off night but this is the second or third time I've been and the service was not the best it could have been."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYN3RtUVVBEAE",
            "text": "I've visited this restaurant multiple times, but unfortunately, each experience has different issues. While the food is consistently delicious, the service falls short. Very long wait times, making it unsuitable for those in a hurry. We were asked 2 separate visits to move seats mid-meal to accommodate larger parties. (Complimentary drink was given the first time)On our third visit, many menu items were unavailable, including salmon and mashed potatoes, etc. Even ordering a simple salad became an ordeal to wait an hour-long just to tossed lettuces in a bowl? (Really?!) I hesitated to write this review, because the owner is a cool person, but as someone who values quality and service, I believe honest feedback is essential. Despite notifying our server that we were celebrating my birthday, they failed to acknowledge the occasion.\nOur server was inattentive, lacking interaction. Then, automatic gratuity despite poor service and significant menu item unavailability.\n\nDue to repeated service issues, I now opt for takeout to avoid disappointment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcHQyaXVnRRAB",
            "text": "Tuesday night karaoke vibes are great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOUtxREp3EAE",
            "text": "I went today for brunch ! I highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNk5LR0lREAE",
            "text": "I went to this restaurant last night with my girlfriend and had one of the worst dining experiences of my life. The waiter forgot about us multiples times and it took almost 20 minutes for us to grab our drinks and an entire hour before we got our food.\n\nWe had to walk up to him and ask for our stuff multiple times meanwhile this dude was trying to get some girl's number at the bar next to us.\n\nThe total bill came out to almost $100 dollars for horrific service and subpar food and drinks. If you're planning on going here, please choose better for yourself and and go anywhere else"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuenJTYTd3RRAB",
            "text": "Food is ridiculously priced for example omelette for $35 and server abandoned our table over 2 hrs of this and was not able to get adequate service until we were trying to leave and then all of a sudden they acted like we were thieves. also never received our drinks because we were told other people ordered more so they had more priority, even though we were sitting at a table, so essentially we were punished for not buying a Pitcher. I would not suggest this place for brunch if you’re genuinely interested in eating. DJ was entertaining, but way too loud as well"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOXZpWnN3RRAB",
            "text": "Blasting music, no respect for neighbors. Absolutely terrible!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNua2ViQ1dnEAE",
            "text": "Tried to support them.  They had nothing to serve me. Everything I asked for that was on the menu they didn't have. After asking about 6 options, I went to a better service place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdTcyVUt3EAE",
            "text": "Dj was on point, our waitress was so sweet and the food was delicious and large portions"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMGVEbHBnRRAB",
            "text": "Labor Day weekend was a Vibe! I'll be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKb003RGNREAE",
            "text": "During happy hour this restaurant IDs all persons even if you’re just there to have dinner. Folks under 21 will be given a wristband. The happy special is a 2-for-1. And the drinks were good. The service was pretty good, the only recommendation (which we spoke to a manager about) is to invite the servers to ask “how folks would like their burgers cooked.” The food was pretty decent, a bit pricey. There is an backyard outdoor space when you can smoke or hangout. Lastly, the music was spectacular, whoever the DJ is or the person who designed the playlist was fantastic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcjdPNjJRRRAB",
            "text": "My friend and I got together for my late birthday dinner. When we arrived we parked on the street nearby. We walked into a cute restaurant. We sat and found out the brunch was still going on, so we waited and drank and had apps until they…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4LXNDWTd3RRAB",
            "text": "Nice place with a nice size backyard. Food was good and didn’t take too long to come out. Mimosa pitchers aren’t that big but it’s unlimited for I think 2 hours so more time to try different flavors. Music is good and definitely a vibes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNDRmWGpBRRAB",
            "text": "Let me start out by saying the girl at the front, I forgot her name already but her face and hair was on point. She made the Entrance look up to par and professional. She also took our orders too. I got seated quickly and just in time to order 2 for 1 drinks. Get the mojito and rum punch!Drinks were really good. The Mac & cheese was good but very OILY too much oil. The jerk chicken for appetizers was not small at, it was 2 thighs and a leg lol. But I would come back though.  The music was a nice r&b mix. The vibes was there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa2F1TTZBRRAB",
            "text": "I highly highly recommend! PiCH always wows me from the service, to drinks and of course the food. The DJs are fun and vibes are on point!\n\nRain who I think runs the bar area is sooo nice! She always has a smile on her face which is very welcoming. Alberto’s blueberry margaritas with authentic blueberry syrup was possibly the best margarita I ever had. And the rum punch be punching! I love the 2 for 1 happy hour drinks and discounted food.\n\nThe jerk wings, jerk tacos (on Taco Tuesday only), Mac n cheese, jerk burger and whining pasta are some of the things I’ve tried. I am literally never disappointed!!\n\nPiCH is by far the best restaurant in Flatbush right now! And they have a different events on different days. Good place to watch the Knicks too!\nMonday - game night\nTuesday - karaoke\nFriday - after work party\nSunday - brunch party"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScHRMQkRBEAE",
            "text": "I visited PiCH last week Tuesday where they were hosting a karaoke night. The energy was amazing since most song selections were in the 90’s R&B era which evoked a state of nostalgia. The service, crafted cocktails and cuisine were all top notch. I had such a great experience that I returned on Saturday. I certainly approve!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcThmWDBRRRAB",
            "text": "Stumbled on this gem today while in Brooklyn. Outstanding service, reasonably priced and oh so delicious. The salmon with asparagus was simply divine and their cocktails 🍹 don’t disappoint. We will be back for certain for karaoke 🎤 Tuesdays 🎶 My new fave spot💕"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocV9DVGlBRRAB",
            "text": "This spot is def a vibe. The DJ was great, had great tunes playing all night. The rum punch was mixed well and packed a punch. The fried pepper shrimp was amazing, probably best I’ve ever had. The shrimp pasta was packed with flavor. Good spot all around."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4czRUSi13RRAB",
            "text": "Great Quality Restaurant!\nService is good, so worth the wait once you get your food & drinks. Drinks were made very just right (perfect). The food was so tasty flavorful & just Amazing. They also have a very nice setup for dinning in their backyard.  We went on Tuesday, which had great taco special (Delicious) & Karaoke. We had a Great food & a great time.\nDefinitely going back, there's more food on their menu I need to try 😀"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINHA2SERREAE",
            "text": "We have been working hard all week and needed somewhere to start our birthday celebration. We ended up at Pich and nothing but Amazing from the time you enter till you are leaving. The music, the atmosphere, the food, the beautiful server we had, to big bro Snoop looking out for us. So great we went twice in one week and we will be back again.You want to celebrate your birthday, a career achievement, anything this is the place to do it. There is not enough stars here to give Pich 20 stars. May the beautiful place continue to have many blessings and successful years to come. Lady Vincy love you all."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCaXBLc1ZREAE",
            "text": "My waiter was cool. The food was not to my liking though. The manager and the other staff were very inconsiderate.  I had the pineapple shrimp fried rice! The rice was hard the shrimp was dry. I had three rum punch they were OK."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSMDVEelhBEAE",
            "text": "Came here for Easter brunch and had an amazing time! Our server Diamond was amazing and very attentive. I got the sorrel waffles and my lady got the peach cobbler waffles. We both enjoyed our meal and our bottomless mimosas. Overall great experience and I will definitely be back in the near future."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaVplWlpBEAE",
            "text": "OMG!!!  Bklyn u got a rocking restaurant in this establishment I can see what all the buzz is all about, everything was perfect!!!  Opened jus over a yr or so now I believe.  I need a space like this where I live in SC.  The music was awesome, serious partee atmosphere, went there on a Fri nite like 9ish.  Had drinks were good n strong, not mincing on there alki at all 🤭.  Then the food came out, OMG, I'm a foodie, and u got me when u plate the food w/ some imagination- presented SALMON BITES in a waffle cone!!!  The mussels was in a curry coconut sauce, I luv mussels neverrrrrr had it done this way everrrrrrr, it was so gooddddddd had to get a roti skin, think a thin Naan, in order to \"sop\" up that sauce 😋😋😋....  there's a bac yd w/ lots of seating and hookah is available if so inclined.  A bar is out there as well.  The service was top notch even though it was busy!!  The co-owner was there doing it all, and she made each of the customers feel like a VIP!!  Highly recommend this establishment in the heart of Bklyn w/ easy access by public transportation b/c of location.  Looking fwd to returning for sure!!  Keep up the good work and would reach very far....."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENk9fY2NREAE",
            "text": "As advertised, \"Feel the vibes\" festive atmosphere with the sounds of the Caribbean pulsating throughout the restaurant, makes it a cool spot to hangout with your team. The food was very tasty and they nailed the Trini style callaloo. Also had the honey glazed salmon and my companion the tenderly braised oxtail. They were both superbly done to perfection. Well presented food with the feel and service of the Caribbean. PICH\nP.S. the glazed salmon bites and waffle cone was uniquely exquiste and paired well."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlX01pWVdnEAE",
            "text": "The vibe and ambience 💯\nStaff! 💯\nDrinks 💯\nFood 💯💯💯\n\nThe food is absolutely amazing! You have to get the Salmon Bites with the Mac n Cheese... And eat them together 🤤\n\nThen the Jerk Burger... OH EM GEEEE 🤩\nThe sauce, the spiciness, the beef 🙆🏾\n\nLastly, the pork chops 🙌🏾🙌🏾🙌🏾🙌🏾\nI don't know what's in the sauce that comes with it but it's crack!!!! 🤤"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSXy1mWjRRRRAB",
            "text": "Had a good time here. The food was delicious I had the Caribbean style pork chop with a vegetable medley and jasmine rice. Also had a Rum Punch. The vibe was nice DJ was good. Our sever was bomb very down to earth."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlb29YbWRREAE",
            "text": "October 2022 and one month old PiCH is a beauty. Clean lines in shades of grey, exposed brick behind the bar. Little perfume like flower holders on each table, really really nice.\nAs we left Flatbush and walked in we could smell the newness of the place, (a smell I absolutely take pleasure in).\n\nWe were immediately sat and as it was a low-key Tuesday evening, we were given the opportunity to choose a table we preferred.\nWe inquired about events and was graciously shown around by one of the owners a Black Woman! Yes!\n\nDownstairs can be accessed through the restaurant or another private door from outside which I'm sure those hosting private events will appreciate.\nIn the \"basement\" there's also a bar and a music set up for DJs. This space is on the smaller side but nice and new just like upstairs. I envision small parties or dinners being held there.\nWe thanked the owner and made our way back up to the main dinning room.\n\nThere's a cozy completely private backyard but it was a rainy evening so we missed the opportunity to enjoy it.\n\nDRINKS:\nWe requested a taste of their rum punch and Dominique our Server was happy to accommodate as she presented our taste in two shot glasses. I'm not a fan of rum but I liked it.\nMy friend the rum connoisseur loved it and went with that for her beverage. It really didn't disappoint. But listen, if you're pushing Caribbean taste you better be able to make some RUM PUNCH!\nAs a whiskey lover I was intrigued by \"The Forbidden Apple\" which consisted of apple whiskey, cinnamon syrup, ANGOSTORA BITTERS (all caps because that's from my Island T&T haha), pineapple and orange juice.\nYo! Me lovey!!! Not too sweet, not too intense and the cinnamon stick garnish was a suitable touch as I loved getting a wiff of it with each sip.\n\nFood:\nPork chops were seasoned just right. I couldn't tell if my jasmine rice was indeed that or plain white rice but that's okay because Mr. Callaloo! Mr. Callaloo made the hell up for it! Dominique adviced their callaloo was more of a soup type callaloo rather than the chunky ones many are accustomed to. I absolutely didn't mind because I love the soup-y callaloo more than anything! I adored Dominique's American pronunciation of callaloo and we had some fun with that. So cute. \"KeleeLooo\"\n\nMy friend scraped her pineapple shrimp bowl. She said it was that good.\n\nChef Guyanese, I'm so sorry I forgot your name. Was it Chef Terry? Anyway you know who you are. Thank you for making yourself available to greet us. You were so humble as we sang you praises.\nAll the staff we interacted with were gracious.\n\nThis is a spot that swiftly got into to my *Must Tell Folks about Them List*!\n\nThank you for your hospitality PiCH. Thanks for suggesting this spot (bar) Aaron. We had a good time and we'll be back.\n\nThe End."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNWQyUVpBEAE",
            "text": "We opted for the bottomless drinks. Each person gets a carafe and you can each choose a different drink. For the entree, I got the chicken and waffles. Chicken was crispy but the drumstick was dry. Service was extremely slow, we had to flag her down to get our 2nd round of the drinks and she never refilled our waters. She actually never came back after the 2nd round of drinks. We waited a long time to get the check and had to flag down another waiter just to pay. Music was too loud making it hard to have a conversation. We could barely hear each other and we were across or next to each other.\n\nParties of 4 is an automatic 20% tip which we only discovered when we got the check. This is not noted anywhere else. Maybe that's why the service was subpar and slow since it's automatically included in the bill."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwek55S0JnEAE",
            "text": "Sat brunch: I had the coconut french toast and it was delicious, eggs and sausage. Pineapple coconut mimosa was also good. Service: I disliked that everyone at my table’s food was served at different times. I started eating and 15 minutes later my friend was still waiting. They played good music. 18% gratuity is automatically added. I like that the waiters worked together to seat,serve, and attend to guests."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMGV6SEpnEAE",
            "text": "PiCH is great caribbean restaurant, the food was excellent!! I had the pineapple fried rice with shrimp. It was soooo delicious, my girlfriends raved about their food also. One had pork chops with rice and the other salmon with salad and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSekszMjd3RRAB",
            "text": "Great atmosphere. The waiters were very polite and friendly. My family was seated and served in less than 30 minutes. The food was great. The prices were reasonable. Great local spot for Sunday brunch or a drink with friends. They have a bar and live DJ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtb1lIN1dREAE",
            "text": "Great place to hang out at the bar with friends or go for dinner with the family. The atmosphere is amazing. The food was delicious and our waitress was polite and professional. The music they played was also on point. I wanted to dance and eat at the same time..lol. I noticed that you could also reserve the back area of the restaurant for a birthday party if you need to.\nI highly recommend this spot. Will definitely go back many more times."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodU0zQ0NREAE",
            "text": "Beautiful restaurant, sat at the bar, and bartenders were very attentive and friendly. I ordered the rosemary home fries, and they were excellent. Also, I had the spicy mango wings, which were just ok, I found them to be too tough and need a bit more heat. I intend to return  again to try their brunch and other  food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodXRteVFBEAE",
            "text": "Very great restaurant! Love the vibe.  Great food! They accommodated our party Even when it grew past the reserved number. I will definitely be back and tell others to come! Looking forward to trying their brunch.\n\nOh and drinks are strong"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSenNEdUxBEAE",
            "text": "Wonderful calm atmosphere with great music. Brunch.  Had a pitcher of mimosas- several flavor options. Pitcher gives you 4 glasses, better value than single glass. Oxtail grits. I prefer my grits on the creamer side personally. Calypso omelet is a great healthy choice.  Mango buffalo wings were bomb. Not very spicy but a very fun flavor ride for your tastebuds. Would love to go back for dinner menu.\nMost impressed by the service. The waiter was extremely polite and tended to us exactly as should be. I think she must have been a manager because she carried herself so well and seemed to be running the show. Thank you for a great time !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMHY2cW5BRRAB",
            "text": "Visited for Sunday Brunch and had a great experience. I ordered the peach cobbler waffle with fried chicken, which was delicious. I enjoyed and highly recommend the passion fruit mimosa. The live DJ also played a good variety of music."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ZzlqTVhREAE",
            "text": "My husband and I tried it out to celebrate his Birthday. We both loved the food and drinks. The vibe was great and the waitress was so accommodating! We will definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobXVpNVJnEAE",
            "text": "The mimosas were good but the food wasn’t it. The salmon cakes weren’t good and to only get 2 for $18 was crazy. The sausage that came with the French toast reminded me of the jimmy dean ones in the supermarket. But if you’re looking for a good drink this is the place for you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN3FpV2xBRRAB",
            "text": "Had a wonderful time on a Saturday celebrating my birthday. As soon as we walked in we were greeted by the DJ and the bartender. We got there at 10:45 pm and even though the kitchen closed at 11 we were able to order and receive our food without much of a wait. The jerk sauce is soooo good. Perfect blend of sweet and spicy. The meat was falling off the bone of the wings! Then I ordered the jerk burger (thanks to the waitress for the recommendation) and the macaroni and cheese... AMAZING! Every bite was delicious.\n\nHighly recommend Pich for the food and the vibe- the music was great all night, I got several birthday shout-outs from the DJ and they even brought out a tasty slice of cheesecake to sing Happy Birthday at the end! I will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWOEpxWUpnEAE",
            "text": "Someone recommended pitCh to me and I went for the first time and will not be returning. The waitresses and waiters WILL forget about you. The food took 1hour to arrive and it wasn't hot. My drink had mostly ice and in a plastic cup. I paid, enjoyed the music which was good and that is all. Go where you are appreciated!"
        }
    ],
    "reviews_count": 75
}