{
    "name": "Werkstatt",
    "place_id": "ChIJ8QR3uzpbwokRS6jD-jk9BWc",
    "grid": "BK14",
    "address": "509 Coney Island Ave, Brooklyn, NY 11218, USA",
    "rating": 4.6,
    "user_ratings_total": 873,
    "phone_number": "(718) 284-5800",
    "reviews": [
        {
            "date": "2시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WR1ZWaFpkR3RZY21jMk1XWldhMFJtT0ZsWlowRRAB",
            "text": "Always reliable when you need schnitzel."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjd1JsOWplakI1UjNwZldHNDFUV1V4UmpnMU9YYxAB",
            "text": "Austrian food, drinks and atmosphere. A very pleasant place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padVZWUkhNVVpEU1ZGRlZUbDZabTFmTjE5Q2ExRRAB",
            "text": "We had dinner here and tried the Kase Spatzle and the Curry Wurst plus a blackberry cider and glass of wine. Keep in mind they accept cash or American Express only. I thought the food was excellent and well priced. The total for our dinner was $70 without the tip when paying in cash. They do add a 4% fee if you use Amex.  My only complaint was the person who waited on us wasn't very friendly and barely said anything, no recommendations on food or a thank you at the end of the meal. Overall the meal was enjoyable and did remind us of food we ate in Austria."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa1EzUTNiblZoUkZKd1RUWjRiVlF5ZDFCbGRFRRAB",
            "text": "Great flavor small portions.\n\nNot much of a schnitzel as far as actual German schnitzels go, but it was a tasty breaded, sort of pounded, half chicken breast. .\n\nThe pasta dishes are fantastic.\n\nBeers are also great. A good selection and cold tap."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMk0wWXhRMk5yYVRCSFJrMTZMVlpFY1hjMFNYYxAB",
            "text": "Best place in BK! Werkstatt is a welcoming place with kind staff. The owner, Robin, goes above and beyond for her customers. Try the pretzel for sure. And don't miss out on the homemade desserts."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdGVYY3paMWxCYjFkMlNIbDJSV0p4YVdGc2QzYxAB",
            "text": "The price reflects the true worth of the meal. I encountered new flavors in this premium meal. The team balances efficiency with personal attention. The food preparation here outclasses nearby establishments. Give them a fair chance to demonstrate quality."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMVlYbFVOMGc1V0dsM1dsaFJOM1ZaVnpOVVpFRRAB",
            "text": "It is Vienna"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseVFsQmFja2h2UVZaRVduSlpTVlZSZDNCNFEwRRAB",
            "text": "Nice place for testing 🍺"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSU1VURlhhRGRUTmpaSVRGRkRiRlYyWXpreVEwRRAB",
            "text": "Oh my gosh! The kitchen team here deserves every compliment. Good value for the money as well. The team members were exceptionally friendly, keeping drinks replenished and checking that everything was enjoyable. Their meals combine taste with substantial size. I'm thinking I'll try again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRVVESldTMlozWkZWaFZraEtZbkpUT1RWT1RVRRAB",
            "text": "Wonderful place with friendly staff and convenient location."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubl8zQXZRRRAB",
            "text": "Despite being regular customers for the past 5 years, this place pulled a real number on my wife and I today. A bartender (bald guy who looks like Bob Mould from Husker Du) said he was leaving, so we needed to cash out. I paid for the 4 drinks my wife and I had, yet said Bartender continued working (we later found out he was doing a double shift). After 4 more drinks, I asked for my bill, at which time I was charge for 6 drinks, two more than I had ordered. After a brief argument, I was charged for 5 drinks despite only ordering 4 since closing out my earlier tab (I still don’t understand why I was asked to close out if the bartender knew he was doing a double shift)?\nEither way, this is totally unacceptable after being a loyal patron here for the past 5 years. Werkstatt obviously pulled a scam, and I’m sick over this as they’re one of the few bars in Brooklyn to feature Hofbrau on tap.  I sadly must take my business elsewhere, and urge future customers to keep track of their order."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204M1JrNXFNSEkwUzNOaVJUTXdiREIzVGtsbWIzYxAB",
            "text": "Absolutely one of the best restaurants in New York. Spotlessly clean, with great music at the perfect volume. The service was outstanding — timing was perfect, and the staff took excellent care of us from start to finish."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNnQzUmJ3EAE",
            "text": "Always a great experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTU9HOXhkMnRDTWpRNWN6TjJRWGR5VFVwRlFrRRAB",
            "text": "Walked in and was immediately greeted warmly by the bartender and what seemed to be the manager—both very friendly and welcoming. The atmosphere felt inviting right from the start. Ordered a draft beer and the paprika chicken—both were excellent. Everything was fresh, flavorful, and well-prepared. I’ll definitely be coming back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRWFVbEVOR0l5TTJwb05rcGxlVXR2UjIxcGJtYxAB",
            "text": "So yummy that you will never want to leave ever in the world ever again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OelgzQldYMnhTVEU1NGVWbFpUVVZZV0d3dGEwRRAB",
            "text": "Very friendly and attentive service , food was freshly made and very tasty! We’ll be back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wQlVYbG5VV3RMU2tkM1ZHcDRUVTFmVEdRME9YYxAB",
            "text": "Have been going to this place, repeatedly,  shortly after it opened for business.\nI was so excited that the neighborhood I have been living in my entire life was acquiring different cuisines.\nWerkstatt does not disappoint. Right down to the specials board, the food is traditional with a home cooked feeling.\nThe staff is knowledgeable and friendly.\nHead on over if you are in the area. Always start with the cheese board if you can, goes great with the wine or beer."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cGFYaGpSRzB0Tm05NlNFTTBiV0pQZDAxQ1dVRRAB",
            "text": "My thoughts on this restaurant have already been expressed by others. Previous diners guided me to this place. Their cooking maintained standards, I should note. Efficient assistance and pleasant demeanor. We'll come back to taste more options."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMzVHb21BRRAB",
            "text": "Delicious Austrian/German food and a delightful outdoor area. The pretzel is the move here for sure. Wash it down with a beer."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNk9GY3lTVFJCU25NeFRIRktOM1JhT1U1R2JGRRAB",
            "text": "I only tried this place on a whim and found it incredibly good. Many workers move about the restaurant, all displaying friendliness. You'll get what you pay for. No hype needed with food this good. We'll make another visit happen."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RVZTMTVSbEV4ZVU4eVZUbHdhRVJCYjBFNFVuYxAB",
            "text": "The food was delicious, especially the bolognese. However, I would not reccomend dining here if you're looking for an especially unique experience:\n\n1. Authenticity: This is more of a low-end German restaurant than an Austrian one. For some reason, their \"Wienerschnitzel\" is made with pork, not veal; this is common in Germany and America, where veal is not quite as abundant as in Austria. Additionally, there are many additions to the menu, such as the French onion soup (which is conveniently stripped of the word \"French\"), that are more applicable to Anglo-French cuisine. If anything, it is a humble German restaurant with an identity crisis.\n\n2. Waiters are awkward, poorly dressed, and a bit undisciplined. They are polite, if a bit clueless.\n\n3. Payment methods: They only accept paper cash and American Express. They don't even accept Venmo, Google Pay, or Apple Cash.\n\n4. Pricing: Their prices are in my opinion highly excessive. I was charged $63 for a bowl of soup, some pasta, and a plate of sauerkraut. Not exactly what I would expect from a place whose waitstaff dresses like middle schoolers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdFNGWjFXVFZIYmxkaVZqTjNhVlo0YVdkWGJYYxAB",
            "text": "Great dinner in a relaxed environment. Highly recommended."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRlFtNVJia1I1VlhCa1dqZ3RSV0pDUmw5c1FuYxAB",
            "text": "Risotto and the big pretzel are delicious."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2cWNDeXZnRRAB",
            "text": "Great neighborhood spot. I especially like their brunch menu and cocktails, perfect for people who like savory dishes like schnitzel instead of an egg-heavy or sweets focused menu. Their chicken liver mousse appetizer is amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaVdHZHlUVGxSZFZoNk4xQnRSVFZwVkVKVGNHYxAB",
            "text": "Food was great, service was amazing and wine was the best!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMGFtUTFVVkJMVVRKb1NuQnlNbk5wVFhselZWRRAB",
            "text": "The bartender was nice and friendly. The regulars who came in added to the already friendly atmosphere. Food was plentiful and delicious! 10/10 would come back again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJT3gyN2FrbDVxaWVREAE",
            "text": "I committed to returning after my first visit. The menu has stars but no failures. Every employee demonstrated real friendliness. The staff is courteous in a laid-back atmosphere. I hope to return and try more of their food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJUE8zUDdDdWZEcDZ3RRAB",
            "text": "Werkstatt is one of my favorite restaurants in Brooklyn. Heart warming Austin inspired food and cocktails. Delicious schnitzel, goulash, beer and cocktails. Really love the place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPLU9ncjJpLUtfSXh3RRAB",
            "text": "very talented chef and wife who have aged well.   The central problem is that winen in doubt, someone adds butter.  very good in the meat and carbohydrate areas their lack of experience in fish still shows.\ngreat design."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqeHNYUEFREAE",
            "text": "It's always so good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbDVqOF9BRRAB",
            "text": "Any time we go for a walk in Brooklyns' Prospect Park, Museum, Zoo by the park or just in the area in general we get tired and hungry. Eventually we will choose a place to eat and chill, preferably close to where we ended up, and somehow that \"close\" is this place, even if we had to walk another 45 minutes to it ;)\nIf you're into unique, Euro-centric quisine with home-style cooking, you're home. Cozy, with a feel of a local bar turned a tavern (bar portion is still there, no worries), road-side attraction decore with a ton of crazy crap on the walls. Outside seating available if you prefer sidewalk but the view is just a local street so we stay inside. Why I come here is a warm friendly staff, great food and drinks. They mix a great cocktail (my wife is hard to please on that so I trust her) and a good choice of draft beer. Excellent desserts, for which I almost never have room. They also don't mask tips under some sort of \"fee\" and then on the bill ask for \"additional tips\", which is a pet peeve and I avoid those places if I can, I'm thankful they don't do that. Small note - its cash only or American Express, in case you're out I think they got an ATM machine on premises. You can always get their number off Google and find out, I do that before taking a risk visiting a new spot. In short - atmosphere, people, staff, menu and final product is our total satisfaction makes this place a no-argument winner when we're in the area, deciding where to anchor for a spell."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeU0yWm9nRRAB",
            "text": "Delicious and very friendly. Everything I’ve had has been wonderful. Get the pretzel!"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MUl2OEpnEAE",
            "text": "👌"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneDVIZDFRRRAB",
            "text": "This place was great, but each cocktail we ordered ended up being $2 more expensive than what was stated on the menu. That price difference really adds up if your party has a few drinks. They need to update the menus to reflect their current pricing, otherwise one feels taken advantage of during the check out.\n\nEdited to add a response to the owner's reply as there seems to be no way to reply on here:\nI'm wondering if there was a misunderstanding then? We ordered the Palomas which were listed as $13 each but our check had them listed as $15/e. One conversation we did have with the bartender might have been misunderstood though. I simply asked which tequila and mezcal were used in the drink and he told us the name of the tequila and then showed us the new mezcal that just came in last week. We just assumed that was the one that was automatically coming in the drink because there was no other one mentioned. Do you think it might have been an extra charge for that one? If there was a misunderstanding I will just delete my review! But we definitely did not ask to change the type of liquor that would naturally have come with the drink, I only asked out of curiosity."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnLWZTeV93RRAB",
            "text": "Rob & Kyle are the absolute best. Great food, great people."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOU92QkhBEAE",
            "text": "I love the place so much\nI always ask my pops to bring me here!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5eE1mc2pRRRAB",
            "text": "This place is still a 5 star in my book"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOElXR2lBRRAB",
            "text": "Really exceptional, loved the food, great service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbkk3czJRRRAB",
            "text": "Great Austrian/german staples (schnitzel, spaetzle and yes the best pretzel in NYC) along with other dishes. Nice warm atmosphere and good on tap beers."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eW9mX09REAE",
            "text": "Excellent place, everything are very good. Usually their service attitude is very good.  But today Dec/29/2024 the service attitude of a new big guy is disappointing"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bDlfSmxBRRAB",
            "text": "Thoroughly underrated. You easily feel the loyalty the chef and his team pay to the tradition and classic. Even simple side dishes like potato salad and picked cabbage are different: potatoes are creamy with just the right acidity, there’s a lovely hint of caraway in the pickles…We had one of the entree specials, beef shoulder braised in apple sauce and wine - phenomenal. Texture and flavor all perfect, the generous portion made such a wonderful, hearty Christmas dinner. Also had the famous pretzel, bratwurst, mackerel salad, chicken liver mousse. So good. The chef simply has so much talent and energy."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNUltNElBEAE",
            "text": "지나다닐때 마다 손님으로 북적거리는 집.\n대기시간이 조금 있지만, 음식도 맛있고, 함께먹은 맥주도 좋았어요.\n가볍게 맥주한잔 생각날 때 가기좋을 집.\n아마 걸어갈 만한 거리에는 비교할 만한 집이 많지 않을것 같네요."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4c2FPRWhRRRAB",
            "text": "Always a tasty experience! Tap beers are refreshing. Bavarian pretzel soft, fresh, delicious with dipping sides. The soups, french onion ,butternut squash, Cold borsht and cucumber Dill are so good! Many main vegetarian dishes to choose from. Their salads are delicious for a main dish, especially the burrata salad!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OWFualZREAE",
            "text": "Just came home from Werkstatt. It was my first time trying Austrian food. Everything was delicious and very attentive service. Nice atmosphere. Highly recommend their chicken liver mousse and salmon with leek risotto. We will definitely go back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdGNLaHF3RRAB",
            "text": "Werkstatt is a beloved neighborhood spot, offering a laid-back atmosphere with standout dishes like the Lamb Shank, Pretzel, and Pastrami Hash. A perfect weekend destination for regulars, it’s a great place to meet friends and enjoy top-notch service. The Roasted Chicken with fries and salad is a must-try if you’re looking to impress. Add a whiskey sour to make them extra happy. A true community favorite for over a decade!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaFpUY1J3EAE",
            "text": "Amazing food!!! The cheese plate and pretzel were bomb!!! My partner liked the chicken schnitzel as well. Drinks were on point and service was great but most importantly did I mention the cheese plate was incredible? Yes I would definitely be back again. They only accept cash or Amex but not biggie because it’s worth it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4MzhTd0ZBEAE",
            "text": "Was a little skeptic at first because German food is not my go to but I'm glad my boyfriend convinced me to try it because it was absolutely delicious. Even the chicken liver mousse which I was scared to try but wow was it amazing. The…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMFo3WWVBEAE",
            "text": "Delicious Austrian food in a rather ugly part of Brooklyn. Pork schnitzel was delicious (can't believe we ate the whole thing!) and sides were really good. Most notable was the delicious potato salad. Kielbasa was grilled perfectly and tasty.  Good selection of wine and beer. The orange zest Grand Marnier flan was very good, but a tad too sweet. Service was a little scattered but friendly, and it's a cute place with a good vibe. Family friendly."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4cmJINXNBRRAB",
            "text": "Oh so nice. I am sad they only have so few people in for the outdoor dinning. Every table (about 6) are separated with plenty of space. We got luck to be at their balcony table.\n\nI miss dining out so much. I forgot the joy and social experience that was lost in my life for the past 4 months.  Dining out gives me a joy that can’t be filled. I don’t go to a restaurant that often but the lost of the ability really eats into me after being a yelper for so long. I miss yelp events. I miss yelp writing and I miss mostly is food made by talented chefs. If this is the only way I can keep them from leaving the industry, I hope everyone will go out and dine once a week.\n\nBeside the beautiful Friday breeze, we get to order food at a table. We went for a few rounds and order two appetizers. I am usually a cheap guy who get one and share but wth. German beer here is amazing. Crisp and super fresh. A good draft beer is hard to come by and here you can find it.\n\nFood is delicious here. From their pretzels which is probably better than one you get in Germany to their famous calamari, I would order one of each items on the menu if my stomach allows.\n\nGuys come find this place and give it a try. Social distance still"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNzhIczNRRRAB",
            "text": "I am a fan of green eggs and ham,  Sam,  I am! First time having it and I've always been weary of running eggs but it was the crisp of the egg bottom with the flavor of the ham and the creaminess of the spinach that made my adult taste buds take notice! Just dash a punch of salt.. all in all, good plate good Mims and the service was exceptional! 🗣Be sure to bring u a lil cash 👈🏾\n#ForkJab all thru this🤌🏾"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdWZlOTVBRRAB",
            "text": "Nice neighbourhood spot, service is good. The food we ate was desperately calling out for some salt, hopefully this was just an off day but I still want to give four stars.\n\nBeer options are nice, mostly German with a couple of domestic options. They are checking vaccine status which is obviously great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5ay15TlhnEAE",
            "text": "Stopped at Werkstatt to kill some time and grab a drink and a bite to eat.  Thet have this appetizers with calamari and kielbasa that was outstanding. Great combination. I also had a jalapeño and Hibiscus Margarita which was pretty good.  Good stop by and try this !"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOFpHblJnEAE",
            "text": "If an upgrade to your old German/Austrian favorites is what you're seeking, then this is it! The homemade sauerkraut and coleslaw (?) are so on point! I don't love fennel seeds, and the coleslaw was fresh and light and exactly what you need with the rich bratwurst burger. The crisped up potato hash on the side of kielbasa was crunchy on the outside and smooth on the inside. I highly recommend the linzer torte if you want a dessert that's not too sweet. P.S. the owner (?) was very attentive and made sure we weren't forgotten in the back of the restaurant."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2bDZxU2pnRRAB",
            "text": "We were in the food coma ;) it was so delicious and we couldn't finish it all because we got the best pretzel ever as appetizer;) We ask for fries for our son instead of all that super delicious mix salad and they bring him the biggest portion ever ;) Stuff were so nice and helpful.We definitely have another fav. restaurant in the neighborhood. Can't believe that we live here almost 10 years and never went to there.Sooooo delicious"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxb1puVU13EAE",
            "text": "I have dined at Werkstatt on two seperate occasions with a family member after a hard day's work of renovating a new living space. The atmosphere is relaxed, but not too much.\nMiranda is an excellent waitress who not only mirrors that relaxed atmosphere, but adds her personal and personable touch to it. Service like her's is exquisite and I only want to dine here if she can be my server.\n\nA plethora of food and drink to select from, keep an eye on those specials, they add a bit of in season/deluxe touch to the main menu.\n\nThe pretzel is piping hot, fresh, soft, and the accompanying cheese mix and sharp mustard offer a balanced, yet complimentary contrast to the delicious canvas of the pretzel.\n\nSchnitzel, spatzle, and pork chops are rich but follow that theme of balanced and complimentary notes in their recipes. Drinks are refreshing and cut through the rich food quite well.\n\nThe dessert is competent, but not exceptional."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbVBIajN3RRAB",
            "text": "Great place! The waitstaff are kind and professional. The food very delicious. The only downside was a send(or smt like send) inside mussels."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpcnNuQzZBRRAB",
            "text": "Love the food, but not vibe. Everything is delicious, food is really great and they have great selection. Staff is little bit rude, and chef is screaming at staff and you can hear that from open window, it’s not what you want to hear when you eat"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURha1p2UjN3RRAB",
            "text": "It’s a very flavorful type of cuisine. The schnitzel was extremely soft and tender with sides of fresh and marinated vegetable, while the pork goulash was accompanied by pasta which would help absorbing the rich meat sauce. Indoor and outdoor , kids friendly. Highly recommend especially when you are looking for rich and tasty flavors."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcEtmV213RRAB",
            "text": "Cozy spot, and our brunch was very good. I particularly enjoyed my chicken schnitzel ($15). Both our dishes came with mini salads and some delicious pickled vegetables. Although the waitstaff seemed a little overwhelmed, they were still friendly. Excited to come back for dinner sometime soon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcnJtVDlBRRAB",
            "text": "Amazing neighbored find - awesome food and friendly service. The decor and ambience me memories of my visits to Berlin and Bavaria. We had the smoked kielbasa and the Weiner Schnitzel - everything was mouth watering. Huge portions. Highly recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaXJmdFN3EAE",
            "text": "Varied selection of beer: German, Austrian, Belgian.  The salmon risotto and  sausage with cabbage were delicious!  Must try the strudel for dessert!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJdGFmeHpnRRAB",
            "text": "I had to revamp my original review from a year ago because I have eaten here many times since, especially now during our current pandemic. The food that comes out of that kitchen is absolutely phenomenal. I have never had a bad meal here…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndmR5cTdRRRAB",
            "text": "I love everything about this place. Great selection of beer and wine on tap (got a really generous glass of ventliner), and flavorful food in generous portions. I loved the paprika chicken (the sauce was the star of the dish) and the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOVpUYkNREAE",
            "text": "Great Food, The Pretzel was Best I’ve ever had!!! Calamari with Polish Kielbasa where very good, awesome flavors but I would say it was too greasy for me. But I will definitely go back and try more food!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRa00yTHZBRRAB",
            "text": "Werkstatt, very beautiful chilled restaurant. Very first time here and i honestly loved it. You will definitely enjoy it too.  Bartender are very nice and warm welcoming. Ask for cidney she is very nice she'll help you out Very quiet…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNTR1R1d3EAE",
            "text": "Very nice place, easy to park. The Brussels Sprout is stir fried after baked, so delicious. Mussels has too much alcohol in it, but my friend likes it. I guess it is just not my style. Oh, I like their decorations, especially the hydrant in…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcU9TWjRBRRAB",
            "text": "One of the best bloody Mary's I've had in a while and good brunch options - $15 for brunch with choice of beverage. Sat inside but heard they have outdoor seating thru the back. Though be warned if paying by credit, they only take American Express. They have an ATM with $2.00 fee."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMTUzYjBRRRAB",
            "text": "Friendly place.  Good food.  I had the Goulash.  Beef was buttery soft.   My partner had the mussels.  There were a lot of mussels.  But she wasn’t impressed.  They were ok.    Service was great.  We have had drinks there as well.  The bartender was great too."
        }
    ],
    "reviews_count": 68
}