{
    "name": "McBeans",
    "place_id": "ChIJ21dDdk1bwokRzbKjTgNyBQU",
    "grid": "BK14",
    "address": "1501 Flatbush Ave, Brooklyn, NY 11210, USA",
    "rating": 4.2,
    "user_ratings_total": 360,
    "phone_number": "(347) 770-9111",
    "reviews": [
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaX2Q3YmVREAE",
            "text": "Just had my first ackee and butterbean patty and it was delicious. No sauce needed! I’ll travel for this and want to come back and try some more food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaanBLNlp3EAE",
            "text": "This definitely one of my favorite places to get great caribbean. The fried rice & stew chicken is my go to meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCaWEtbGtRRRAB",
            "text": "Best food"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBZ29iSTFRRRAB",
            "text": "The Staff is Absolutely out of this world I love the girls Food u can't stop licking your fingers!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMnMyaUJ3EAE",
            "text": "Name change but this is my favorite place for Jamaican food, they used to have deserts but looks like they removed it for now, but really great food all around and affordable."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1Z3QyN1VnEAE",
            "text": "It was a good experience, I went there initially to find out how much it would be for a small pan of BBQ chicken and it was way too much so I didn't order it but I did get half chowmein and half fried rice with BBQ chicken and it was really good. I'm Guyanese so they did a great job with the food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbkxHdkN3EAE",
            "text": "JUST BOUGHT A CURRY GOAT AND WHITE RICE ABOUT 10 MINUTES AGO..FOR $18 I GOT 3 BIG BONES ..I AM STARVING AND WHAT AM I SUPPOSED TO DO WITH A BONE  AM I TO EAT BONES BECAUSE  I ORDERED GOAT..THIS IS UNFAIR ESPECIALLY IF I AM COMING HOME HUNGRY FROM WORK.."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPX19DbEJ3EAE",
            "text": "My goto for Caribbean food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPazVtNlRBEAE",
            "text": "Horrible! They literally give you bones and say they gave you chicken. Do absolutely nothing about it when you take it back and give you attitude! What a way to treat customers!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeDdqZ0RBEAE",
            "text": "If my son love the food then it's good"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbVotMnVBRRAB",
            "text": "Sweet meal"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXN29MYXhnRRAB",
            "text": "Carribean restaurant with no respect when ready. I went in there to ask for Casava Pone and she said they do not make it..which is fine but when I turn to walk out and reach the street she said out loud \"What, Are you Crazy\" .... A true…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNTZLeUl3EAE",
            "text": "I've only had one particular breakfast at this location.....its alright....I have yet to try their lunch/dinner"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURta3BWNBAB",
            "text": "i Literally saw a roach crawl into the food. Then asked for a refund , the manager came and lost his mind. Worst experience ever"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtZ3BpR1VREAE",
            "text": "Best porridge I've ever taste. Best Ackee I've ever taste. Prices are fair. Good portion. Sweet generous ladies to serve"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtaFBXMWd3RRAB",
            "text": "Literally the best! I have been going there for 7 years and it is my GOOO TOO when I go back to the city! The staff are super chill, and the food 🔥🔥🔥🔥…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtamZlVWF3EAE",
            "text": "good quality isn’t up to par and they recycle their food for next day, especially in breakfast."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHOTh2clhnEAE",
            "text": "Best rice and peas in Brooklyn. Yeah I said it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHeXFDR3N3RRAB",
            "text": "Excellent lunch special: for $4 you get your choice of jerk chicken or curry chicken stew on top of either white rice or rice and peas and either plantain or vegetables. Its a smaller portion but really an extremely good deal for money. My only complaint is that its a bit to spicy for some, not for me though."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHcUlIRkpnEAE",
            "text": "Food is good but the new workers so rude."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2ejhyUFRREAE",
            "text": "Haven’t been here in a while and was surprised that they increased their prices. Unfortunately I won’t be back as there are so many nearby restaurants that are cheaper. Money in this neighborhood is tight."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NDhLa1ZnEAE",
            "text": "Great oxtail and generous portions"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dklxOVpnEAE",
            "text": "This is literally my favorite restaurant! I enjoy my meal every time. The Curry chicken is my favorite and the customer service is awesome!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2cHVHbGlRRRAB",
            "text": "as someone who used to come here for their curry chicken VERY often , i lost interest of even walking in the store . the workers became so rude and disrespectful . i understand that the prices changed but you can’t be rude and expect to get business from people ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdHVlTHV3RRAB",
            "text": "I started going to Mcbeans back in 2014, my go-to for Jerk and Rice. Always has been a pleasant experience, flavorful food. 🙌🏾👍🏾…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMU1lTGlnRRAB",
            "text": "I been a loyal customer who been coming here almost daily for years.I get the same thing every time which is a small palm size tray with 1 scoop of veggie rice with the rest of the tray to be filled with chow-mein with a lil curry chicken gravy with one or two small pieces of curry potato & occasionally one piece of whiting fish & a slice of macaroni pie every once in a while.SEEM LIKE EVERY TIME I COME & THEY FEEL I LOOK LIKE I HAVE A LIL EXTRA MONEY THEY SPONTANEOUSLY RAISE THE PRICE WITHOUT PRIOR NOTICE. First the smallest piece of whiting fish was $1.50 then $2.00 & now it’s only $3.00 & up for a single tiny half slice of whiting fish. As for the tray first it was $3.50 then $4.00 then $5.00 two weeks ago  now today boom 💥$6.00 because they wanna charge me an extra dollar for one small scoop of rice in the same small  palm size tray containing the chow-mein 🤦🏽‍♂️smfh. As for the slice of Mac and cheese first it was $3.50 then $4.00 now $5.00 MIND YOU ALL OF THESE HEIGHTENED PRICES OCCURRED WITHIN THE LAST 6 MONTHS..i went there today expecting to pay no more than $6.00 all together but by the time these crooks were done I was hit with $14.00 bill  because since I didn’t have cash on me today I was also forced to pay an extra $5.00 to get the 1 slice of  macaroni pie because they have a $10.00 purchase minimum just to use a cash debit card.They knew I maintained a 6 or 7 dollar budget.but today they completely defeated the purpose of getting a small the smallest portion as possible to maintain that budget so as of today they will be loosing this regular customer.This is the most crabbiest stingiest restaurant I’ve ever been to in my entire life & most definitely price gouging at it’s worst!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxZ1l6MWR3EAE",
            "text": "Love the bakes & calloo"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxd3VxZHVBRRAB",
            "text": "Food was so delicious"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcjVLRkRnEAE",
            "text": "They continuosly satisfy my Carribean foodie cravings. Authentic  flavors of the West Indies, made locally. The curry, jerk & brown stew chicken, are fantastic. The oxtails are bonified delicious. Plenty of tasty menu options, good size portions for the money, inexpensive, . Worth stopping in for some good eats."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdUlmZEJREAE",
            "text": "Delicious west Indies food, great oatmeal, friendly staff."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLaC1uX3FRRRAB",
            "text": "Wonderful Caribbean cuisine! I never went into McBeans prior to this visit n I'm truly disappointed that I haven't. The food touches the heart n soul as well as the stomach. If your looking for home cook west-indian food then look no…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLeXRHUHhnRRAB",
            "text": "I'm giving this restaurant a 4 only because the food is great other than that I would definitely have rated this neighborhood restaurant 2-3 stars due to the management/staff. Again I only support this restaurant because the food is great.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbzYtTFV3EAE",
            "text": "for dinner, i had rice and peas, jerk chicken and steam cabbage. my favorite"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdHRUNm13RRAB",
            "text": "Food was out of sight very good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5cDRLZ01REAE",
            "text": "The food is delicious."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5NHEtOHp3RRAB",
            "text": "My goto favorite to pick up my Dad is the stew chicken and there rice & peas is a masterfully unique McBeans special blend of flavors. Definitely recommend you go and taste it and see for yourself."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5ck4tLUh3EAE",
            "text": "Real Jamaican cuisine. Best oxtails and rice & peas I have ever had. No cap!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5aThDbXdBRRAB",
            "text": "At one point I was a very loyal satisfied customer buying meals for two sometimes 3 times a week.\nNow I’m no longer satisfied. The prices have gone up and the portions have…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5LUx5djhRRRAB",
            "text": "I Love Mcbeans breakfast and dinner. Their fried rice taste awesome and is flavorful. They also make good stew chicken, and jerk chicken. My husband and I like buying food from them. When I was pregnant I'd stop by there almost every morning to get cornmeal or bake and Akee. Baby was satisfied lol and the place is always clean."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTd05uZ0pnEAE",
            "text": "This place does have some good food and the macaroni salad is probably the best i have come across. The only reason I'm giving this place 3 stars is because the portion size they give you is horrible. For the same price you get better…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpcXFiZXBnRRAB",
            "text": "That's one of my favorite Jamaican restaurants in Brooklyn I've been dining there for a few years now I usually get the stew chicken it's extremely delicious; It's strongly recommended !!!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpMHJmc053EAE",
            "text": "If you want to taste the absolute BEST cornmeal porridge in Brooklyn,  then you've found the spot!!! You WILL weep sweet sorrow when you get to the last spoonful!! The spices they use are out of this world. The bakes and salt fish are top…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDMTZDVjd3RRAB",
            "text": "Good n tasty food"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwM2F6Z2RREAE",
            "text": "Great breakfast!!! I can’t get enough of this meal. All the staff are very warm and welcoming best customer service in Flatbush by far beautiful people."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZbmQ3aUtnEAE",
            "text": "I've been going there for about 2 years and I love all their food. The oxtail, the stewed chicken, the curry goat, if food is just off the meat rack."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncWR5eWxnRRAB",
            "text": "I go to this restaurant every weekend. They have a delicious soup without too much of those flour dumplings.…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNWJmaVB3EAE",
            "text": "Love this place! Mouth watering meals for a great price. One of the best places  to eat in Flatbush and Brooklyn. Affordable, tasty and great decor. Staff is friendly and food is consistently good. Their $4 lunch menu from Monday to Saturday is sheer genius. I'll keep coming back!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNajlDcmtnRRAB",
            "text": "love love love.\nOnce a week I get curry goat or oxtail. Cow foot soup is amazing. Those are my favorites, but their entire menu is just delicious. you can taste the love in the food. Highly recommend!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdTRlQi1RRRAB",
            "text": "The people who work there are so nice and friendly. The restaurant is clean and welcoming. For me, the spices used in the food is not best but the food is good and fresh all the time. I've purchased morning, afternoon and evening. The lunch special is the best"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBaHJUR3lnRRAB",
            "text": "One of the most authentic tasting Caribbean restaurants in Brooklyn. Flavors are on point and the food always well cooked. Their portions are fair in comparison to price and prices are fair in comparison to industry margins. Always…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwOFlMbU9BEAE",
            "text": "I only bought a piece of lime cake from here which was very good, however their food looks delicious and reasonably priced.  Very clean, small eat-in area & can view outdoors.  Wheelchair accessible without automatic doors."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNW83R09REAE",
            "text": "The taste is there but not quality. I got salmon meal fish was very dry and ordered goat curry. In the curry all I got was plenty gravey  big bone with no meat. I couldn't share with anyone. Waste of money"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnOFlfNnN3RRAB",
            "text": "I'm am not so happy with them.. I was standing behind a lady she was ordering stew peas I watched how the lady bag it out and everything so I was maybe I should get one... I actually came in there for a jerk chicken salad which the chicken taste so damn old... How I know cause I does cook my damn self.... I regret buying anything from them.... Salad was dry I wasn't offer any dressing or anything.... And about that stew peas it was salt as hell.... I get to the register to pay and even before that I asked the lady who was serving how much is a stew peas she said 3.50$ so I was like cool let me trying... The lady that order before me paid 3$ so I was like no problem... I get to the register its a different story!!!!! She told me its an error and its 7$ what's kind of business very unprofessional and greedy for money... Anyways they won't be seeing me back in there with there tasteless salty ass food....should of done what I was planning to do and go to Fisher man cove!!!!!!!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBcHU3T1l3EAE",
            "text": "I had the unfortunate displeasure of purchasing food from this establishment this evening. I decided to try this neighborhood restaurant out for the first time. I ended up buying Oxtail w/Rice & peas and an order of Stew Chicken over Lo…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVaGJmT0FnEAE",
            "text": "This place is really nice.Its not so far from the subway and buses,so it is convenient to get to.Plenlty of food for a reasonable price.Their stew chicken is the best I have ever had! I wish they had a wider variety of drinks."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRN1Azc2NREAE",
            "text": "Food is not consistent. Sometumes it can be good and sometimes it's nasty.They staff is hit or miss many of them have bad attitude.\nThey are really stingy, a large order of jerk chicken which cost $12 only comes with one peice of chicken cut into 4 pieces. The only thing they are generous is is the rice. There's many times over the years where I've eaten here and my stomach would give me issues afterward. I wouldn't recommended their rice and peas because of this. The restaurant across the street is much more generous with their portion sizes and they are basically the same price. Atleast there you get 2 pieces of chicken in a large order rather than one. You get less for your money at Mcbeans and for this I cannot recommend them. After years of going there I feel much more appreciated at the restaurant across the street from them. I should also note that on my last visit I saw one of mcbeans employees eating food at the Jamaican restaurant across the street which says a lot to me."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJb2RtNXBRRRAB",
            "text": "Rating based on dessert: made me sick....because I couldnt stop eating it!!! I grossly enjoyed the red velvet carrot cake, tried to save a piece for dinner and failed. Moist, not too sweet, icing was delicious. Will definitely be back = )"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzdEx5Q09nEAE",
            "text": "Not as good as it use to be. I had a medium size order. It was mostly rice that had a gummy texture. Only two instead of three pieces of chicken that were small. I regret giving them a tip."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzd3U2N0VBEAE",
            "text": "Great service, great staff and personnel, and of course the food is always good. The food is well seasoned it's cooked properly and all their plates and sizes are properly priced."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRamFhUEpnEAE",
            "text": "I have had the displeasure of experiencing what everyone else had already told me about this joke of an establishment. Now it looks nice. I don't take that away from them....their recent remodeling is very attractive and modern.\nNow on the other hand. You have disrespectful staff. One or two times I went in they were nice but always....always stingy with their food. A dining establishment shouldn't treat food as if that extra spoon of rice will force put them under.\nRecently....I went to buy oatmeal...it's oatmeal not porridge. Thats there cheap way of trying to be authentic. The largest size they offer is 7 dollars. Now let me point out, I have went in everyday all week to buy one. Your talking about 3 dollars a day all week. I go in and buy the biggest one for work..now thats somehow 7....and I made the mistake of asking for a few cups. A FEW CUPS!!! Ok i understand...these things cost money. Can I buy a few cups? NO. YOU CANT WE DONT DO THAT. I left biting my lip forcing myself not to curse them out. Should have listened to what everyone had already told me. Now adding things up thats 20 dollars in oatmeal add a dollar for three cups..no problem. Simple math...your losing. If peopke pay therr should be no reason you shouldn't accommodate them. No matter what the case is. This along with there crazy prices  I'll no longer buy oatmeal there. Simple."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0czh1TE5BEAE",
            "text": "I love this place I eat here religiously every pay day the oxtail is consistantly great everytime ,the cheese rolls touch my heart everytime ,as a half trini half guyanese I feel like my grandmother cooked when I'm chowing down ,the Maurby…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdEw3SkpBEAE",
            "text": "I Usually come here to purchase my mom food, I’m a vegetarian so the options are very limited to me. In the past I have bought roti skin alone (it is labled on the menu priced so that gives me the impression you can purchase it alone) the lady had no problem selling it to me. Today I walked in to make a purchase. I’m a very polite person, I always greet the person serving me. The woman this time had an attitude, I asked to buy 3 roti skins alone. She then told me they dont sell it alone... which I find weird because I have gotten it alone. Whats the big deal, I’m still paying for it? Her response & attitude made me feel unwanted. I will not be going here anymore. Fortunately, I found a store across the street called “Bake and things” that sold roti skin separately, to my surprise they sell curry tofu too!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBOWRhRmh3RRAB",
            "text": "The food is okay, but the customer service is horrible. What's worst is the prices and the food amount. They give reasonable amount to their friends that come in but give you small portion. Why pay 10 and up for food that okay with small…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNC1fZ2Z3EAE",
            "text": "If you are not jamaican they will screw you over with your order, more bones and alot of rice. This used to be a great place to get food but the server who has been there the longest who likes to play games with your food. Note, they use alot of MSG and will resuse old food for stews and soups. Really sad."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQweXJ5SDhBRRAB",
            "text": "The fact that they use gloves I was pleased. Food was great with nice portion for the price... My cuz is from England I'm from Philly and we will come back here our next visit"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNMDVfNFl3EAE",
            "text": "The food is the worst! My friend and I had rice and beans and oxtails. The rice is nasty and oxtails was hard. (NOT COOKED) It's definitely not the Caribbean way."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBN3RlUjhnRRAB",
            "text": "Great food and good customer service. Employees are very helpful in explaining what type of food and their lunch special is a price you cannot beat."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZdDdtM1JBEAE",
            "text": "The server was very rude and the food was cold and nasty. I wasted my $16 for some old nasty fish and some cold veggie rice. I’m so disappointed with this place."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwbFlXdDlRRRAB",
            "text": "The food is so delicious and the prices are great. Good is ALWAYS fresh and the servers are actually nice"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwaWVHUnB3RRAB",
            "text": "Amazing food. I personally am the biggest fan of the Stew chicken but everything I have had from here is great"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNLU5TX2NnEAE",
            "text": "Great Jamaican Food. This is my go to ppace place oxtails, rive and peas with extra gravy. Trust me reward yourself and enjoy McBeans. You will not regret it."
        }
    ],
    "reviews_count": 71
}