{
    "name": "Michael’s",
    "place_id": "ChIJ2cccPJlEwokRnkUFMJ3M_-k",
    "grid": "BK14",
    "address": "2929 Avenue R, Brooklyn, NY 11229, USA",
    "rating": 4.7,
    "user_ratings_total": 1655,
    "phone_number": "(718) 998-7851",
    "reviews": [
        {
            "date": "수정일: 4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGa2Q3X2VREAE",
            "text": "Had a phenomenal delivery experience, now I know I have to have it in person too! Ordered gnocchi bolognese and it was fabulous. Came with a ton of extras (chunks of parm, grated parm, olives, extra sauce, focaccia and a baguette!) I loved the gnocchi. Super tender, seemingly homemade, rustic gnocchi with a perfect simmered-all-day-tasting sauce. Perfect serving size for two with a side, or for just one big and greedy girl. I feel like I can taste every ingredient in the sauce. I didn’t know that such classic, old school Brooklyn Italian could be found on Uber eats.\n\nUpdate: I recently branched out from my favorites (gnocchi or papardelle bolognese and lasagna) to try the arugula shrimp and crab with linguine (but you can get whatever pasta you want). I can’t recommend that dish enough. It was incredibly generous and delicious, like everything else here. Michael’s of Brooklyn, I love you <33"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWWVWZEVaazFxYzNNMlVUSkJkMVZ1VFVKRE5sRRAB",
            "text": "This place is a must-visit on every trip to New York.Although it is slightly out of the way from the city, I would never miss it, the food is off the charts.The service is impeccable. Jack is a gem! Portions are huge atmospheres , family , classic , traditional and friendly. The rice balls are the best. I've ever had chicken parm is unreal and the Berry lemon sheeta sorbet dessert is light and tasty. I'll never skip on dessert here. Also, the coffee and biscotti with it are top."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd1Z6bG9OazF3VG1wVmJYWmZWRzF6ZDFvdGRIYxAB",
            "text": "An incredible dining experience. My first time and is one of my favorite places. Highly recommend."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5S1dHbFBZMlZqY0hRNVUxcExSMUJUZUhwMVUxRRAB",
            "text": "Need reservations but went as single and got a side table though if not busy, can get table in main room. Staff was very attentive and answered my questions as l am lactose intolerant.\nPictures are of Tres Color salad and Fisherman's Platter. Paid $97.00 but it was worth it."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVdGFrbE9RbGhOWW01bFVHUlNjM0ZpZDE5ZlowRRAB",
            "text": "Been coming to this spot since I was a child.\nHad many cherished celebrations there.\nHaven't been to Michael's in a few years..\nDecided to stop by today. Ordered $200 dinner for takeout.\nI had to ask the manager to help me when I arrived. No greeting.. no form of service.\nMy chicken Rolatina had hair inside. Quite literally in the middle of the dish, as soon as you opened the cover. That ruined my dinner.\nShort rib and lamb shank were decent enjoyed by my parents, but again I paid $200 for dinner and threw it in the garbage.\nPlace was packed out when I arrived. Michael's has never dropped the ball on my patronage.\nDidn't bother calling to complain.\nI had to ask for help to pay in the first place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBM09EbFhiVTkwVkRKeldESTBUV1pvVnkxT1gwRRAB",
            "text": "Service was A one"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KYVpraDJObGRYTVMxSFFXTTViek5UWTNFdFUxRRAB",
            "text": "Recently moved into the area and a friend of mine recommended Michael’s for the exquisite dinner for my wife’s 50th birthday. Well, I couldn’t have made a better choice. Everything was perfect.  ambience and food service was top notch. We will be returning again, not our last time."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weVdua3hYMU13VFhkU1lVSjNRV1UzWTBrelVGRRAB",
            "text": "We dined at Michaels of Brooklyn on a weeknight, knowing how tough it can be to get same day reservations on the weekend, and I am so glad we did. From the moment we sat down, our server Gregory made us feel like part of the family. His warmth, humor, and attention to detail set the tone for an amazing evening.\n\nI ordered the Fishermans Platter, which came loaded with lobster tail, pulpo, shrimp, clams, calamari, and mussels, all perfectly cooked and tossed in a rich and spicy fra diavolo sauce over linguini. The flavor was incredible, and the portion was generous enough that I had plenty to take home (and yes, it tasted just as good the next day).\n\nFor dessert, I could not resist getting a cannoli to go, which was the perfect sweet ending, with a crispy shell, smooth ricotta filling, and just the right touch of chocolate chips.\n\nThe restaurant itself has an intimate, classic Brooklyn charm, and the prices are very fair for the quality and portion sizes. Between the food, the service, and the family style hospitality, Michaels of Brooklyn easily ranks among my favorite Italian spots.\n\nIf you love authentic Italian food, this place will not disappoint. I will definitely be back, next time for one of their specialty coffees to close out the night."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRMXFlVFJREAE",
            "text": "The  Service  & The Food and you never know who you're gonna meet there"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OS04zbHZVbWxYU21sSlFrWTNlR05JYm0xZmJuYxAB",
            "text": "Both the cooking and the customer care shine at this restaurant. Our order arrived promptly and tasted wonderful. Workers maintained quickness while showing authentic warmth. The restaurant doesn't leave you hungry. This place has me planning my next meal."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nd2VsWldlR3hsWVRGNlYwY3RVMkUyYmxseVNGRRAB",
            "text": "As you might be able to see from the star ratings, Michael's restaurant is all over the map. The service is excellent; the staff are courteous and helpful. The food varies considerably in quality. For instance, the enormous menu included a special appetizer - Crabmeat, Shrimp & Avocado Salad. One might assume that the crabmeat would be fresh, but it tasted as if it were canned.\nAnother special appetizer was the Wild Mushrooms and Soft Polenta with Truffle Oil. The mushrooms were tasty, but unfortunately the polenta was extremely bland and mushy. On the other hand, a third appetizer - Artichoke, Avocado, Almonds, & Fennel with Shaved Grana Padano Cheese, was excellent.\nVarious appealing breads, crackers, olives were placed on the table at the start, and pleasing biscotti were provided at the end of the meal.\n\nThe room was comfortable, but unfortunately a pianist started playing at the neighboring bar section. Normally, a cocktail pianist should not play in too pronounced a manner, but instead should provide a soothing background; this is not a concert setting. Unfortunately, this pianist played mostly uptempo selections with bebop-like inflections, and unfortunately he was not very good at it. I kept wishing he would take a break, but he seemed to play for over an hour without stopping. This became extremely fatiguing and eventually rather annoying.\n\nIf I had to make a couple of suggestions for Michael's, they would be:\n\nOffer a smaller selection of dishes, and make sure that they're all of the quality that the chef is clearly capable of.\n\nEither hire a different pianist, or ask the current performer to play quietly, and take breaks so that we can rest our ears."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQekxISzJ3RRAB",
            "text": "Love this place , Chef John is awesome. The food is great . Huge portions of classic Italian dishes done right."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocE1HSkZVa2hIY0hwemJXOTNkMnhDZDNWaVRFRRAB",
            "text": "So delicious!! The staff was so attentive and polite! Best Italian food I've ever had!! 10 out 10 😘👨‍🍳 chefs kiss perfecto!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjd2JEaFNWVmxJVHpWZmFWZGhWa1psU1RrNE5uYxAB",
            "text": "Always great food and service.  I highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRk1rTlBOVlozY3pCM1psUjFlQzF0YkhWSmFYYxAB",
            "text": "Have been coming here with the family for years. The food and service keep us coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQlZWbEROVGcxWkZKVlFYbDROamcyTXpkR2VFRRAB",
            "text": "Kit offered us a very good service. He recommended us the best branzino and he was friendly and cooperative. We loved the food and we recommended this place 100%"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U1ZVWnRiRkJpZFd4RFgxRkdlSFZKWVRoM1drRRAB",
            "text": "This is a fabulous restaurant! Food is delicious,  service is great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WFpFOWpWek5VY25SVFdEVmpXbGRwZFVwM1ZGRRAB",
            "text": "The veal chop parmesan and everything else was amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMU0yZFVhMWxEZW1wdlJYcHFiVTR6ZVVwNE5VRRAB",
            "text": "I bought Michael's of Brooklyn red sauce. It is the best sauce on the market. It taste as good as my homemade sauce. Thank you MB. I highly recommend this."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sd2JuVnFlWE5MZUVaU00wVk5ia1V3TXpCclYxRRAB",
            "text": "Great experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbFdXUk9TbkpyZWtveGRGaDFkWE42Y21RNE9WRRAB",
            "text": "On the pricy side, but every thing is delicious (food and drink) . The service is top notch. I would definitely come back for fancy occasions"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWVgxTk9aM0p2YlhaS01WZDZVblpXZGw5VWVuYxAB",
            "text": "I have been dying to come here for so long. I finally made it over and I was not disappointed. Such a gem!! The food is wonderful, service is perfect. I can’t wait to come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQmRFOVJjamt6YzFodVlWaEljMXAwVjJ0MFoyYxAB",
            "text": "Gregory provides evacuate service and the food at Michaels is consistently top level."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkclVGZGpVMEZ5ZGxCcldFOHdUa05ZVUhkUk9IYxAB",
            "text": "Nestled in the heart of Brooklyn, Michael's Italian restaurant is an absolute gem that truly lives up to its five-star reputation. From the moment we arrived, the valet parking made the experience feel effortless and luxurious. Stepping inside, we were immediately transported to a place of old-country charm. The decor is stunning, evoking a classic, elegant feel that's perfect for a special night out.\nThe ambiance was nothing short of magical, with the gentle melodies from a live piano player filling the air, creating a truly romantic and sophisticated atmosphere. We were warmly greeted and seated promptly, and from that point on, the service was impeccable. The staff provided white-glove service, attentive and professional without being intrusive. Our water glasses were always full, and every need was anticipated.\nThe speed of service was surprisingly quick, with our dishes arriving at the perfect time. The full bar offered an impressive selection, and the cocktails were expertly crafted. As for the food, the menu is fantastic and showcases a passion for authentic Italian cuisine. Every dish is fresh and made-to-order, and the flavors were simply divine. The pasta was perfectly al dente, the sauces rich and savory—it was clear that great care and quality ingredients went into every bite.\nWe had such a memorable evening with friends, and I can't recommend this place enough for special occasions or even just a beautiful dinner with your significant other. Michael's Italian is more than just a restaurant; it's a complete dining experience that delights all the senses. We're already planning our next visit. A truly delicious and delightful experience from start to finish!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dWJFNUtOMVJOVUUxVGJ6RjVOVVo0TVZsRmVIYxAB",
            "text": "Michael’s is known for their rich Italian dishes and overall atmosphere and experience. This place is wonderful for family gatherings and events. Some of the dishes I suggest to try are calamari and any steak of your choosing. Overall they’ve been serving marine park for as long as I can remember and I’m thankful to name them as one of my top favorite restaurant’s in Brooklyn."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SlJWY3dUMjl2WlVSNVJFUjRlVzFsUkZweFFYYxAB",
            "text": "If you want some old school vibe like from your grandparents, Michaels is a great choice. The service is awesomly friendly and homey. The food is a-maz-ing.\n\nGrilled octopus was grilled perfectly, the chicken parm was the best in the city with awesome red sauce. I also had the stuffed shells once and they were just great.\n\nJust an all-around perfect spot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVWNFTTFMWFIxV1RjeVZWRm1jRlJwTkZKNU9FRRAB",
            "text": "Grear family owned restaurant who is been giving amazing food and service for decades.  Always providing excellent hospitality with an old school waiters who have the knowledge of the a true culinary going on .👏"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaE1rTnpPRUp5UlhOdVpsWnpaMTlmV1dScmFtYxAB",
            "text": "Been wanting to go here for a while, and the long wait did not disappoint. Every dish, side, and dessert was executed with fresh ingredients, beautiful plating, and aromas that left us beyond satisfied. This establishment had a very “family business” feel to it which made it warm and inviting- special shoutout to our incredible waiter Gregory."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMmFGTXpSMmsxVHpGbVprdFZkVGxqY1dKMlVXYxAB",
            "text": "Love it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdWFtdHFNbkZQYTFOQlIzRk9aSFZoTFY5V1gxRRAB",
            "text": "The lobster crepe is absolutely DELICIOUS!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MFYxZGZVMU5KTVhobmJuRTJMVmd6WVUxVU0xRRAB",
            "text": "Unfortunately my experience here wasn’t so welcoming. Really felt like I was pushed / cornered to basically eat & dash. I won’t be coming back here."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaXQtZ1FnEAE",
            "text": "My favorite Italian restaurant located in the Marine Park section of Brooklyn.  I have dined at the restaurant for many years with my family.  The food, service and atmosphere are all excellent.  We ordered the baked clams, calamari and mini meatballs with a side portion of ricotta cheese.  We easily shared the portions which we re served as appetizers.  I ordered the chicken rollatine as the main course which is accompanied with potatoes and string beans.   We also shared a chocolate caramel cake with ice cream and whipped cream for dessert. The server also provided a plate of mini biscottis.  The restaurant also has displayed on the wall a biscotti that was on a previous space shuttle flight!\nFriendly, informative and well-dressed staff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNVZVVkNRbHB2U0cxUVVWWlFUVkZtT1dKR1ZVRRAB",
            "text": "Very nice most atmosphere, friendly waiters that are eager to please and good food that is very tasty but comes at a premium"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFdFEwVnFTR3BIWmxwdFVHaEhkVUUwTTJ0dlNWRRAB",
            "text": "I felt looked after from beginning to end. This place definitely lives up to the reviews."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdk4xWjFjazF3ZDNneVNuRjZOWFJZWjA1alFYYxAB",
            "text": "Clean setup and consistent quality — like a stable chart"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQ09WRlhRamhHVGs1TmVGOVpZalJuUW5VMlJYYxAB",
            "text": "Not many places can top Michael's in terms of dining experience.    Old school NY Italian restaurant.   Great food and service.   Great for a special occasion."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNmNYQnFRMmxTUkZCVFNXUkRiM0F4VnpoT2JHYxAB",
            "text": "The food is great, Classy place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRlkxbGtkMHhQYldwQ1ZFb3dNemRvUjI1NU9XYxAB",
            "text": "UNBELIEVABLE……\n\nThe food, service and atmosphere is the BEST I have ever had.\n\nHighly Recommend.\n\nWe will definitely be vack"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdE1HbDFNVFF5Wmw5V2QwcHZjR3hFVFROcWJYYxAB",
            "text": "the best food in brooklyn"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeGVuWnBXbFIxVlY5bk1ITkdUVUZDYm5ONFVXYxAB",
            "text": "Wonderful environment drove all the way from New Jersey to enjoy a great evening with friends from Howard Beach New York."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSZmRFeHdOakZ1VGxCaE1XaE1ORm81ZERkUlNIYxAB",
            "text": "Food is best in Brooklyn. Fresh produce nice ambiance, professional waitstaff. Well worth it!!! The Smash Veal Parmesan was unreal!!! Must try"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaVdXNHlUa0pDUTB0emIxZEhSMUV6ZFZKbGRrRRAB",
            "text": "Everything was great except the baked stuffed clams. That’s my favorite dish and unfortunately it was not that good. Very dry."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xST2FUbG9PRzkyT1dkM1gwRmtiMnhJYzNKYVozYxAB",
            "text": "I didn't even know this was an actual restaurant. I found Michaels of Brooklyn brand jarred sauces in my local grocery store and was blown away!! Every time I buy jarred sauce, I always have to add my own spices to it to make it taste good, but not with this brand! And I love that it's basic ingredients and not loaded with sugar like most of the name brands. Im originally from New York, was actually born in Brooklyn, but live in Texas now. Will definitely swing by the restaurant the next time i'm up that way."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCU1QyeDBTRFo2WXpjNU1sSTBiRFl4ZUhwcVdtYxAB",
            "text": "Amazing atmosphere and food. Incredible owners and staff. Special thanks to Michael and Jerry. I completely agree with the opinion that the only thing limiting this place’s fame is its location. This is love."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NWVFSnhOM1JPVTJwUFFrbHpOREJrV0V0c2VYYxAB",
            "text": "2nd time here.1st time was an anniversary 2 years ago.I ordered the grilled pulpo,not bad,then ordered dinner.Husband ordered an off the menu combo which he thoroughly enjoyed.I had the Bolognese on penne,which had too much basil for my liking.I am cook by trade and have never had pulled so much basil strips out of my sauce.It wasn't very hot,but husband was enjoying his meal and I didn't want to spoil the occasion.He absolutely loved his tiramisu,where as I went to order the Lemon meringue cake and was informed they don't have it.(It was shown on the website they have it on the menu.)Overall dinner was better for him than me.I guess I'll chose different next time."
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNmVLblFnEAE",
            "text": "진짜진짜맛있고유명한레스토랑입니다~~~Shrimp Francese 진짜맛있어요"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFellVZGFjMnBuY0UwNU1FZEJRMWROWjNaV2RIYxAB",
            "text": "Amazing father's day food. Special dinner menu but price well worth it with amazing food and typical Italian family-style portions. Brought two bags of leftovers home, including dessert and bread. Great service where waitstaff dropped by constantly to check on us and clear empty dishes. Really impeccable and reflects why Michael's remains our go to place for Italian food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U1dHOUdWalF3WTFsM1NHTk1OVWhHV25Wbk5FRRAB",
            "text": "Outstanding food & service!   We came for my brothers birthday.  Every single floor manager greeted us upon arrival.  The atmosphere & the lighting was perfect.   Food was beyond my expectation    We have various pastas.   I recommend the cacio peppe, penne puttanesca & the bolognese.  Then they brought an amazing birthday dessert platter with unbelievable desserts, including cherry pie, Tartufo,  chocolate cake & more.  Throughout the dinner the captain & staff were on top of every detail.  I highly recommend Michael's restaurant.  They do everything right & perfect!   I was very impressed & cant wait to come back ! 👍👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNdWxydUhiNDVDY05BEAE",
            "text": "We have been trying to get here for 5 years.  It was worth it!  The food was absolutely amazing and the service matched.  They were very attentive and friendly.  11 out of 10!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfb3M3MHlBRRAB",
            "text": "We had our eye on this place for a while now and were finally able to visit. I believe they have valet on the side of the restaurant but there is street parking right in front of the entrance. Inside, the restaurant itself was very elegant and had a nice romantic vibe. The staff was very polite and professional and service was very good. The drinks weren't very strong at all but came nicely garnished. The appetizers and entrees were good but I will say, we were a little underwhelmed with them still. They just seemed to be described more extravagant than what they were on the plate. We were overall happy with what we ordered but weren't wowed by any means. In the future, I would return to give it another whirl. Perhaps to try other menu items like their pasta dishes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJamU2M2dRRRAB",
            "text": "Michael’s of Brooklyn has been a beloved family-owned staple since 1964, now in its third generation. Known for hosting birthdays and anniversaries, it’s a go-to for special occasions—and the food does not disappoint. Must-tries: stuffed zucchini, oysters, seafood platter, veal, and the outrageously good hot cookie dough with vanilla ice cream. The bacon is not to be missed wither!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndHQyemtnRRAB",
            "text": "My second time at Michael’s. My go to option for Valentine’s Day. I do have to say that the service is much worse than last time I visited about a year ago. The food is your classic Italian, high quality, wouldn’t disappoint. They have a great selections of drinks and wines. Live piano music would accompany your evening. Overall, great restaurant definitely worth a visit if you’re in Brooklyn."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNZk01NnI4N3VmQTNRRRAB",
            "text": "Good food and atmosphere.\nWe had the fisherman seafood, lam chops, chicken and fried carimari. All portions were good size family portions."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMmUtd2l3RRAB",
            "text": "It was a Thursday night and Michael's was packed. I suggest reservations. There is free parking. It seems very family oriented there were diners with children. The cuisine is Italian, but the menu also has dishes other than pasta. I had the Chilean sea bass."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaEt5RWt3RRAB",
            "text": "Michael’s Italian Restaurant offers a delightful dining experience with generous portions and delicious dishes that keep you coming back for more. The flavors are rich and authentic, with each dish prepared to perfection. Whether you’re indulging in their savory pasta or enjoying a classic chicken parm, every bite is sure to satisfy. The portions are incredibly satisfying, ensuring you won’t leave hungry, often providing leftovers for the next day.\n\nOne of the highlights is the convenience of valet parking, which makes it easy to enjoy your meal without the hassle of finding parking. Plus, the restaurant adds a nice touch with free bread and cookies served at the end of your meal—small details that make a big difference. The warm, inviting atmosphere and attentive service only enhance the overall experience, making Michael’s a must-visit for anyone craving a delicious Italian meal."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdlMydDBNelpZVlhCRWR6YzVSazlSUkhaeE1sRRAB",
            "text": "Nothing can surpass the immaculate experience I had at Michael's. The food is unbelievably delicious, and so were the drinks! Service was incredible, too!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxOGVIRTd3RRAB",
            "text": "This is a very busy, loud, exciting, upscale restaurant. Takes a couple weeks to get a reservation, and once you experience it, you will understand why. Beautifully decorated with comfortable seating and excellent service. An elegant bar when you enter. They present you with plates of breads, olives and cheeses-before you order. The dishes are amply filled with thoughtful presentations of scrumptious food. It’s an exciting place to dine. ♿️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdHJ5UnVRRRAB",
            "text": "I've been coming here for quite awhile and highly recommend making a reservation. It gets busy during the holidays. The food and service never disappoints and the wait staff is usually super attentive (if it's a non-busy season). They don't rush you throughout dinner so you can actually connect + chat with your party.\n\nI usually end up leaving with leftovers for the next day. Parking is available and it is also accessible by bus."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLZWx4X205b28yNkl3EAE",
            "text": "My husband and I patronized Michael’s of Brooklyn for the first time on Tuesday, May 20th for his birthday. We had a reservation for 7pm but we were early and they sat us quickly, no wait. From the time we arrived in until the time we left, we felt welcomed and relaxed. The food was exceptional and our waiter Enzo B. was polite, attentive and friendly."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2d2ZmVlJ3EAE",
            "text": "Very cozy vibes , elegance & atmosphere with soft lighting 🤌 The menu offers a wide variety, artichoke salad is amazing !\nAlthough despite all of the amazing qualities this restaurant has to offer , I’ve noticed disparity in service attention , which could leave someone feeling overlooked. Overall experience remains amazing , their bread & butter with olives and cheese are a good way to start off your dining journey!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bkxxbDBRRRAB",
            "text": "When it comes to Italian food, Michael’s is the best.  We’ve been coming here for over twenty years with family and friends and they never cease to amaze and impress us.  Everything from the braised short ribs with gnocchi to shrimp parmigiana to lasagna to their amazing roasted sea bass is simply outstanding and beyond perfection.  They also make a terrific veal parm!  I can’t have red sauce so I get the veal with vodka sauce.  It’s utterly sublime and I’m in heaven savoring every delicious bite.  Service and atmosphere are unparalleled, warm, friendly and inviting.  I recommend without hesitation.  Just go… you’ll be very happy you did."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleDZqU0JREAE",
            "text": "Decor, service, ambiance were all good. Service was attentive and professional.  The place, with its all male wait staff, feels like we're in the set of a Godfather film.\nThat said, the food did not deserve such a good mark as the other reviews mentioned. The base sauce was surprisingly simple, which might be a good thing to some people.  There are definitely better tasting Italian places in Brooklyn but the ambiance won't be as nice.  If this restaurant is not in Brooklyn with all its great Italian restaurants, then perhaps it's worth a return trip. Unfortunately for someone who grew up on great pizza and Italian food in Brooklyn, I was a bit disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNTR6QmRREAE",
            "text": "Michael's was phenomenal! The service was swift and attentive, the food was very good and filling. It was FANTASTIC. There was someone playing the piano as well, and it just added to the warm comfort and cozy feeling. There were a lot of people, but it wasn't too bad. I will say it's better to reserve a table! This place is very popular, and seats get filled fast. I went on a Sunday night around 7:00PM, and it was nearly a full house.\nIt boggles my mind I've been passing this place for years, and never realized how amazing a place it is! I highly recommend! Make those reservations!\nIt can be a bit pricey mind you, but for the quality and amount of food you get? Worth every penny!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeUpyRGpnRRAB",
            "text": "What a great place. Impressive service, great food and wonderful atmosphere. The Italian food is some of the best I have ever had. I recommend the veal chop parmigiano and the veal osso buco. If you have room the desserts are magnificent. The coconut custard cake was the real thing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdmNQQTl3RRAB",
            "text": "Authentic Italian restaurant in Marine Park, a must try. Came here on a Tuesday night, wasn’t too busy but eventually got full as the night went on. Put waiver was awesome didn’t catch his name but he was an older gentleman,  very kind, he explained the menu very well. The other staff members came over and took our empty plates and refilled our water bottle. Highly recommend this place. Parking lot is free, not much slots but if you get here early enough you can park, just remember to tip the valet guy, don’t be ‘that’ guy."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSE5IaHNabEJGVXpaSGVuTTVOMlpCV2tkdloxRRAB",
            "text": "Es un restaurante fabuloso . La comida es fantástica, Las atenciones son insuperables."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbXR2S3FBRRAB",
            "text": "I made reservations for our anniversary. We were seated straight away.\nThe service after that was disjointed.\nThere was some misunderstanding with our orders.\nThere was a long wait for our main course. Then, when we got the food, it  tasted OK.\nThe appetizer salad was delicious though!\nI think it would be best if your first time at this restaurant is not a Friday evening.\nI plan to visit again to see if I  can increase my rating of this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdktYSTNnRRAB",
            "text": "A true authentic Italian experience in Brooklyn. Michael's definitely loved up to all of its high ratings. The service was great, everyone was really nice. There was never a moment where I felt unattended or neglected.\n\nThe restaurant is truly a gem with its classic decor. The fried calamari was fresh and the chicken parmesan was delectable. I finished off with a Cafe Godiva which was amazing. Growing up in NY, I hold Italian cuisine to a very high standard and Michael's definitely hit the mark! Highly recommend for delicious and genuine Italian food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCOGFtei1RRRAB",
            "text": "Fantastic on all counts! This place was recommended to me, so I decided to try it out. Upon entering, the decor and atmosphere is classy, elegant and old school. There was a piano player playing music, which elevated the vibe as well. I liked how all the staff were nicely dressed, too. Everything we had from beginning to end was fantastic...we had the baked clams, eggplant rollatini, shrimp oreganata, shrimp parmesan, the napoleon and  profiteroles, and glasses of white and red wine. Overall, the dining experience was outstanding, with the food being absolutely amazing. This place is one of the best for Italian food in Brooklyn, every dish was fresh, delicious, and on point. The desserts were incredible. I will definitely be returning here, this place is a must try!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQYlhfdkNsM2ZDS1NnEAE",
            "text": "Food was good and filling. Folks were very nice and food taste fresh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYN1lYOC1BRRAB",
            "text": "This place was raved by a friend of mine. He invited and he wasn't lying. It was truly a gem. The sauce was amazing. The food was phenomenal. The atmosphere and service was excellent. I would definitely go back to visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZy1Ua3JnRRAB",
            "text": "The eggplant parmigiana, the butternut squash soup, the cocktail, and the bread were great. There were lots of vegetarian options, and they were accomodating. I love how festive the decor is especially inside the restaurant. I was pleasantly surprised. Everyone was very nice here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbkpfSEN3EAE",
            "text": "Michael's of Brooklyn on Avenue R... Just sounds inviting, doesn't it... This warm upscale italian eatery since 1964 did not disappoint! Were we're greeted by Yo Cuz, ;) if you know you know.... The service was exceptional, every dish, we left nothing behind... In addition to having no clue what a wonderful meal I was in for, I had Spumoni for the first time!!!!! >SCREAM< it was so good, no actually like the best!!! (no I don't live under a rock) just started to live a little!\nSo good! Just so good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NDU2d1pnEAE",
            "text": "Real live piano player near the bar, fresh flowers as decor , neatly suited waiters who are attentive and make sure your needs are met , Michaels was great. Complimentary bread and cheese olives salami brought to your table.  Ordered the grilled octopus/pulpo and it was delicious. Tender and flavorful. Husband got the chicken parmesan and side of spaghetti...the spaghetti portion was small , I got the veal dish but it tasted too Dijon mustardy.. the flavor was not that great. Overall the experience was great."
        }
    ],
    "reviews_count": 74
}