{
    "name": "Sugar'd",
    "place_id": "ChIJVY7ZpRRbwokR6B8IRrIcSwU",
    "grid": "BK14",
    "address": "2614 Newkirk Ave, Brooklyn, NY 11226, USA",
    "rating": 4.3,
    "user_ratings_total": 324,
    "phone_number": "(718) 758-5066",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SFdVcFNNVlpDTUZoTlpWQjFYMHBuYlRoNE5XYxAB",
            "text": "My first time visiting Sugar'd or the city. Pleasantly surprised when I entered. Upscale vibes in walking distance. No wait seating. Dj playing music with viewing of sports on big screen. Sautéed cabbage and potato salad and coconut bread pudding for a vegetarian eater. Generous portions. It was a nice meal. My waiter Marlon was very courteous."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rdGVqYzFaM2h5ZWpGRWRWaFhiRzlpZEhrNE0wRRAB",
            "text": "Laid back meets upscale! Cozy nook with friendly genuine servers and customers! The drink menu is fab and the food is delicious soulfully crafted! Check it out before it gets cold outside!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJdE5WTm9hR1JUWm5oZlZXaG5Sak0wVW5wRlJVRRAB",
            "text": "I absolutely loved Sugar’d. I went with some friends for a birthday dinner. The atmosphere was vibrant with music, The servers were nice and accommodating. I went with a large group. Our food was incredible. The drinks and appetizers were also really enjoyable. The restaurant isn’t spacious but works and they know how to maneuver. The staff was hype and helped us celebrate my friend birthday. The decor is nice and great for pics. It’s assessable in case someone is handicapped. Definitely go there and experience it for yourself."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNGFHNTNZV3g0VUVzMk4wVTJMVEZVTWxKbVIzYxAB",
            "text": "Great food and excellent service!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobWNIWjFZVGxzYXpJdGJFczJMVGhEWms5bFpFRRAB",
            "text": "Thumbs up every time"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OQlNrOHdOQzFJVVhWbE9UQmtVelJWWTB0RVEyYxAB",
            "text": "The service was on point,my server Marlon. Was professional, and on point."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wU1pFSlpSMFZWUjFScmVVNDNjMTkwWW10aVgyYxAB",
            "text": "Food amazing and fresh. Very delicious food and ambience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRk9FOURVMFJqT0ZscmRrUk9ZVTR5WWxObk4zYxAB",
            "text": "1. CHICKEN TENDERS TOO SALTY\n2. MACARONI AND CHEESE WAS A 2 INCH SQUARE\n3. NO PARKING"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BelRFb3dZa1o2VGxOcmNIcHNXVGRNVDJJMFpWRRAB",
            "text": "I had a great dinner at Sugar'd, First I want to say, the service was excellent, with staff constantly checking in on me and my friend to make sure we had everything we needed. We ordered the purse drink, which was definitely pricey, but huge and strong enough that we only needed one. The food is bursting with flavor and seasoning, true to its Trini roots. My friend loved the wings, and the salmon was cooked perfectly. i want to go back to try their brunch menu."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadVVsSndWRm93YkVkUFQyMHhhSFJrZFZKQ2RVRRAB",
            "text": "The décor of the place is undeniably beautiful, and the service was decent—but unfortunately, that’s where the positives end. It took over an hour for our food to arrive, and this wasn’t even on a packed day.\n\nTo add to the frustration, I had a $150 credit from last year after missing a brunch reservation. At the time, the owner told me it was non-refundable but could be applied to a future date. Fast forward to Labor Day weekend, and I was told the credit was no longer valid. First, they claimed it was because a year had passed—but the original message never mentioned any expiration. Then they said it was because I didn’t have the same number of guests as the original booking... seriously? If you just didn’t want to honor the credit, say that.\n\nWhen we asked to see a policy backing up these claims, no one could provide one. It felt like I was being given the runaround for my own money, which is incredibly disappointing—especially when people work hard and expect honesty and professionalism.\n\nAs for the food: I ordered stew chicken with rice and peas but was served coconut rice instead. The dish was underwhelming, though a few others at the table enjoyed their mashed potatoes and broccoli oh and the lambchops. The \"Jerk wings\" were extremely spicy—so heads up if you're sensitive to heat. The brunch menu overall was unimpressive, and the bill was higher than expected for what we got. Our waiter was really nice, pleasant and patient and that's why I gave service a 3 star. Drinks was good but limited.\n\nI had really hoped for a better experience, but between the customer service and the food, I left feeling let down. Won't be recommending and won't be returning."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYLU5DTXZ3RRAB",
            "text": "Absolutely yummy food at decent portions and prices!  The outdoor space deserves FIVE STARS, but the indoor space always has the music blaring, and I end up having to speak at top volume to be heard by my dinner mates."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkR1JGbFZSRmd6VTNWUU4yMUdhR2x1Ym01TWMwRRAB",
            "text": "Might be pricey but it worth the price good staffing, the owners are very very cultural people always giving back to the community, I will support them every time am around at least once a week, blessings continue the good services and ambiance"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeWF6QkZRVFJXVVU5clVIcGhVRE5HUVc4elpVRRAB",
            "text": "Jessica, and Marlon, have great interpersonal skills; that coupled with Food and Vibe are EVERYTHING"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcVVUaEpkQzF1VUZsbVgzQktMVkZ2WDJWMmJFRRAB",
            "text": "We came here to celebrate our anniversary and the food and cocktails were incredible!! After we asked for a box to wrap things up, our server decided to take the drink, appetizer, AND entree orders of a 14 person table. We waited for the check for over 40 minutes. Other tables were ready to pay too. Then he let the 14-top close out on individual checks and gave them all their drinks while we were STILL waiting. We missed our train :( It was a pleasant time but they were clearly understaffed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNME1IZHNjSGMxVjNkR1RsbE1PRFZhZW01WlVIYxAB",
            "text": "Love this trini restaurant, rel vibes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMlNGUjVSa1p6YUhrd1owSXRWMFJUTW5GV04yYxAB",
            "text": "This place was absolutely perfect. When I went I found parking right in front of the restaurant. I was part of a large group of 9 people and was seated immediately. We did have a reservation so therefore I encourage calling ahead and making one if that is your situation. The customer service was top tier. They accounted us if we did not want something in a dish. They were great. The food was amazing; everything was well seasoned. The presentation was very good. The drinks are good too. They have a private area if you want a more intimate space. I went during the summer so the plants out front were beautiful so my party was able to take great memorable pictures. I will definitely be back."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUmFVaFBiREJOY2xWQlJrMHdhelJHUTBOUmNIYxAB",
            "text": "Of course I am a regular and this is the only place I think is worth traveling to be at especially on Fridays for Karaoke Fridays with their amazing dj but let’s get into the Food-10/10. Comes in large proportion Customer Service-exceptional, Ambiance -Amazing. Drink- just know you have lots of option that will take you across the world and have your feet dancing to the music and don’t forget the happy hour  $7 cocktails and more . Don’t walk run to here if you are looking for a very welcoming atmosphere with great vybz and everyone is like family, this is the perfect place. Thank you"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dFNXWkxYMlpKUm1SNFlreE9kMVYzV2pNeE5YYxAB",
            "text": "Great food, drinks and atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdWRuSmtjVk5QVTFSelJVVkdTbVU0UjJOMWQwRRAB",
            "text": "First time I went it was good. This recent time was okay. My friend and I only got 2 drinks and appetizers (2 order of wings, fries & mac) & the bill was $145 (cash). We felt like that was excessive. The drinks were $20 each!! And not sure if that was top shelf liquor or not. 18% gratuity is added to parties 2 or more & don’t think it’s worth it as our waiter kept disappearing and it was not that busy. Now that I think about it, felt that they charged more than the 18% gratuity. Check your bill throughly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdGJGSXhXa3RrV1daTVpXRm9OVzF4Wm1wa1FtYxAB",
            "text": "If you’re looking for a Caribbean vibe with tasty food and good service then Sugar’d is the spot. Karaoke is a vibe!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdFdIRXhiRzR0VW05aE5IbEhTRWxWYzI1aFQxRRAB",
            "text": "Barely had an experience.  Apparently, they had an electrical problem and had to shut down the kitchen.  I understand things happen however we weren't offered to stay for drinks or even bring out drinks just to be warm and apologetic(we…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSWRrVkNWMUo2ZGpCVGFGYzBSekJ5Um1sYWRWRRAB",
            "text": "Food was good, drinks were good, service wasTRASHHHH. And it was hot as hell! It took the waiters too long to come back around to check on you, the power went out mid service and they didnt have on the AC or a fan. One person in our party got their food 20 mins later. Sucks that the food is good cause I’m never coming back here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTVZuaGllRFl3WWxReVFqVm1jMFpWVVU5cWNsRRAB",
            "text": "Food is good. Service was good but a tad bit slower than I’d like but tolerable. It’s food. My only complaint is watch your bill. Initially there were 2 tips on my bill. When I brought it to the waiters attention he said it must’ve been a mistake. He removed it but the bill has an 18% gratuity fee which when checked is about 22%. My wife just wanted to leave so I gave him my card and when he brings the bill back it’s even more from the gratuity (about 25-26%). They won’t see me anytime soon. Check your bill…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTWVrdHJVREY1U2xWcmFrSm1jWFZRTkhCbU9YYxAB",
            "text": "Very good food,Very Luxurious,And very good service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Zd2FIbFNSRVJtTjBSYVdGb3dSa1ZGU2tORWFsRRAB",
            "text": "This place is amazing! One of my girlfriends took me out to dinner for my birthday, and she chose this this place. We were greeted with friendly faces of staff members as we were ushered to our table. The staff were extremely friendly and polite and jovial. They surprised me with a happy birthday cheesecake and played a happy birthday song on cue. We danced and then I was given hugs, wishing me happy birthday. It was unbelievable. I had so much fun last evening. I would recommend this place. You will not regret it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MmJXaEZaRWN5VW1wclEyZGZZbkZXVVdzMlFuYxAB",
            "text": "The food was delicious but the wait time was over an hour to get it. The waiter did not come back to check in on the table. We ordered drinks which took just as long.  There was also a gratuity charge which I asked to be adjusted due to the service we got, But was told it's mandatory."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONVdHWlRZMlkwV0RoTWFFaFdRVEpFZURCbFNVRRAB",
            "text": "The food was good but the wait time and customer service needs extreme work. There’s no reason why the food should take over an hour to make and drinks taking 20 minutes to prepare. Would not go again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbmRVNW9ZMFZEWVU5Vk9GQkZVV3AxVDJGemFrRRAB",
            "text": "All the way from JS here for a party. The service and food were phenomenal.  i wish I could give 10 stars. This food is straight from the islands. I only like my husband's cooking. No Caribbean restaurant has been as good as his. This is up there. The vibe is great. Clean and the waiters wear gloves and hats. I will recommend. I will come back. So if anyone is looking for the real deal this is it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSU2NFZFJkbDlIVlY5SlIzSmpRbGRQY1dabGVHYxAB",
            "text": "As a fellow Trinidadian, this spot didn't disappoint. Vybz, music, drinks, appeitzers, main course and most importantly service was amazing. I will be back for that purse drink lol."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cE9WQlZaVWRVYjA4M0xURnFPRWhyTVVKNmQyYxAB",
            "text": "Overall: A Maybe!\n\n1. Third time visiting. The chinese salmon was smothered in a sweet sauce but overall wasn’t seasoned. The pasta with the oxtail tasted water down.\n2. The  wings were bussing and easily saved the entire meal.\n3. The drinks and music/vibe passed the test as well. They have a drink in a wallet mug that cute and added to the experience.\n\nUsually I’m a fan of the oxtail and bussup. However, you’re as good as your last dish. The toll I paid to drive here from NJ wasn’t justified on this visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQMmk4LXFoczUzU2xRRRAB",
            "text": "While the food is great... tasty & fresh. The service, and length of time to recieve the food could be better."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPS29uZFNVMmFDcG9RRRAB",
            "text": "Visited Sugar' D for the first time yesterday. The jambalaysah snapper, was the bomb. That cilantro sauce was so good, along with the coconut rice. The sorrel needs a little spiced up, with less sugar. All in all, the food was great. I will be revisiting very soon."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLM1E1ZHVhMUs3UmRBEAE",
            "text": "We went for Mother's Day & the ambiance was gorgeous & energetic. The service was good, but the wait for food was crazy & they ran out of dishes🥺. The guy even said they double & tripled ordered stock because of Mother's Day. Trust me, I asked what happened.  I chalk it up to it being Mother's Day clearly.\n\nThe place was packed & they even have outside seating. I would definitely go back & next time, I'm getting the damn purse drink.😄 It was so pretty I could only admire it from a distance. Beware, it's big. The waiter said 2- 2 ¹/² drinks held in it. Something to share or not 😆. But very cute & no, you can't take home the purse, unfortunately.\n\nWe had the lamb, a little salty but really good even the next day it was still good. Rasta pasta was good too, the next day it was better & with the lamb leftovers really good. I think they balanced each other out salt wise. The portion for the pasta was huge & the shrimp in it was tasty. Definitely a sharable item for the table if you want to be able to taste it & still get an individual entree. The whole snapper (not Chinese one) was enormous. 😆 My aunt really enjoyed it. I've never seen a snapper so big at a restaurant & I order whole fish when I go out. I would like to try that next time.\n\nEverything was well seasoned from the apps to the entrees, even the sides were really good. Mac & cheese, plantain, cabbage, broccoli. The mash potatos was slightly off my aunt & cuz were convinced they were box. Idk, I tried it & i was on the fence, idk, not sure if it was technique or not. Also, we had the jerk wings, a little salty too & shrimp appetizer. The shrimp was my favorite. I could have eaten another one with the sauce & plantain, 🤤 they weren't oily either. Chef's 💋. Oh, only my mom had dessert a coconut bread pudding. I'm not a fan of coconut, but I love a good bread pudding. It didn't look like traditional  bread pudding but was surprisingly good, like I would eat the rest of it if she didn't want it good.\n\nOverall, it was a beautiful Mother's Day, the vibe was high, the wait staff were attentive, the music was energetic, & the food was delicious 😋.  I will definitely be going there again to try other dishes & that purse. GREAT JOB, Flatbush!!! 🤭"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJbWYzTjdQaWJ2OGZREAE",
            "text": "Wings are good a bit pricey to go on a weekly basis"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdXJLb0V3EAE",
            "text": "Family gathering. Service and atmosphere were on point. Sadly my food was totally inedible, way too hot and I am used to eating hot food. The only saving grace was that everybody else’s food was great, we were a party of 9. I suppose 1 out of nine is not too bad.\nI would visit again and give these guys the benefit of the doubt. I just wouldn’t eat the Buss-up-shop, curried mango and curried vegetables🌶️🌶️🌶️🌶️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOHBMTnZ3RRAB",
            "text": "Awesome time"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbFlQcXRRRRAB",
            "text": "Food was really good drinks trash $66 for 3 drinks was insane & not worth the money at all....Other than that everything else was great"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMXVHVV9nRRAB",
            "text": "The food is sooo good. Well seasoned everything tastes good. Especially the potato salad! I love the space in the back. Sometimes it can get very busy. I wish they opened before 5. Not sure how people don’t see the main entrance on the corner with the name on top. They try to come in on the side where ppl are eating."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM01YLVZREAE",
            "text": "Can i brave about this food for a minute..... Amazing Amazing, Amazing all around. The Drink was amazing, the food was amazing, the ambiance was amazing. Amazing Amazing until it put me to sleep, lol"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvXzdYbWVREAE",
            "text": "1st time and I will definitely be back! Happy hour on a Sunday? Count me in! The coconut margarita was on point. Marlon was our waiter and bartender and hooked us up! The jerk wings were great (wasn’t a fan of the dipping sauce on the side aka it didn’t need it) The star of the show was the curry goat. Tender, flavorful and a lil spicy. 10/10 recommend. I’m Jamaican and Guyanese so trust me I know good Caribbean food. They knocked this out the park."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvejVhWjBRRRAB",
            "text": "The food tastes so good we had the spicy mango and i had to order another one."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRX3RQQkNnEAE",
            "text": "… So let’s start off positive. My family went to this restaurant on Sunday and made reservations for 6:30 pm.\n\nThey said the food was good & the restaurant looks nice. 👍🏾\n\nThis is being said after waiting literally 2 hrs to get their food ! They were seated and noticed that a baby shower was taking place as well.\n\nWhat was then relayed to them was that, the reason why they have been waiting 2 hrs for their food is because a baby shower was going on… That is a RUBISH excuse. If you can’t handle it leave it alone. (A wise man once said) The manager then stated that the drinks were on the house cool..\n\nAll for gratuity to then be added to the bill for $26 dollars. At that point I just paid for a drink.\n\nAlways remember that gratuity is a common courtesy. And according to the service that was provided a dollar should’ve been given.\n\nAlso, lol after looking at other lower reviews … we are not the only one experiencing an abnormal wait time to either be seated or served. So as mentioned earlier in the review…………. IF YOU CAN’T HANDLE IT LEAVE IT ALONE. Work within your means ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcHJ6MWNBEAE",
            "text": "Was great food drink and music"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdHBiTUlREAE",
            "text": "I came for my Birthday. The atmosphere was welcoming. They made accommodations for my son and sister. It was 3 Large parties that were there but made sure we were ok. Nice ambiance in the entire place.Will come again!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMVpEYW9BRRAB",
            "text": "Always a good time with a great happy hour"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbnVLQ2hnRRAB",
            "text": "Well first off, the entrance is confusing. The address is plastered on the side where you would expect to go in, however you have to walk to the corner and go in through a bar. It’s a pretty small area which is fine if you have a small party. The waiters don’t communicate with each other which causes mass confusion. I asked one for a to go bad for the massive snapper they have and was told I would have to cut it up because they didn’t have anymore, two minutes later another waiter brings out the to go boxes that clearly fit however I had already cut mine into pieces. The food was pretty good though so no complaints there."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bWYzcUt3EAE",
            "text": "Went on a Sunday for brunch. Food is really good. Everything seasoned nicely and you get a good portion of food. Menu have. Wide variety of items. The bag drink was so cute (no you don’t get to keep the bag/glass). The drinks are good as well. Would definitely visit this establishment again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dE1Ybk93EAE",
            "text": "My girlfriends and I went here for Galentines and it was POPPIN'.  When I say this place was a vibe it was a vibe.  The music was good, the people were nice and the food was delish.  For Galentines they offered a buy one purse drink get one free.  For brunch I got the shrimp and waffles.  Soooo good.  The only down side is the service was a bit slow but you know what it didn't even matter cause the music was entertaining.  Next time I'm in Brooklyn I would definitely visit again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNzZiaXJBRRAB",
            "text": "I enjoyed my meal a lot. Kree was a good server, was able to explain the food selections so it helped us decide. Shrimp was over cooked but good, rice and peas weren’t that great either but I loved the bacchanal chicken and waffles, and the fried chicken and jerk was really good too. Drinks are pricey but strong. Worth a visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURELWV6aWhRRRAB",
            "text": "This spot has a dope atmosphere where the tunes never stop. It was fairly empty not too many people were In the establishment so it was a good time to ask questions and see what was going on. They had me hooked with the appetizer the wings!!!! Food overall is give a 4.8 Rasta pasta was decent and the drinks were pretty good. The staff was all extremely friendly and definitely made you feel right at home in Trinidad. Definitely plan on going back soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuak5fODNBRRAB",
            "text": "I recently visited Sugar'd and overall, the food and drinks were fantastic. However, there was some confusion regarding the happy hour criteria. It turns out happy hour specials only applied if you were seated by the bar or in the vicinity, which wasn't clearly stated on any signs. Once we inquired, the staff kindly accommodated us and moved us to the appropriate section. While I've never encountered a 'situational' happy hour before, the service was great after the seating adjustment. A bit more clarity on the happy hour rules would improve the experience, but otherwise, a great spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dGFPaHBRRRAB",
            "text": "Food was tasty! Service was pleasant and personal. Reserved for a 10 person birthday event. They were able to serve the  large table quickly and efficiently. DJ made the atmosphere live."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OVktUGtBRRAB",
            "text": "My friends took me to Sugar’d for a birthday brunch this past weekend! The indoors is very nicely decorated with lots of light bright colors and gold accents.\n\nWe checked in for our reservation and went to the back. FYI, there is a front room and a back room.\n\nThe brunch menu is pretty simple, however, keep in mind they don’t have a bottomless option. So we opted to do a rum punch pitcher and the jerk wings to start. There was a delayed timeframe in which we got water and the rum punch. We received the wings first before the water and our rum punch. The rum punch was good, there could’ve been a bit more punch in it.\n\nWhen it came to the timing of the food it was pretty on point. The wings were extremely delicious. The meat fell off the bone and they were seasoned well. As a lover of spicy food, the spice is there, so if you aren’t someone who can’t tolerate spicy food, maybe have them tone it down for you (if possible). For my entree, I had the calypso fried chicken and waffles with a side of macaroni pie. So, I will say the sauce on the chicken is soooo good! I requested dark meat, and my friend ordered the same thing (without a request), and his chicken portion was a bit more than mine. In addition to this, my waffle was a bit soft. The macaroni pie I was a bit disappointed in, it did taste good when dipped with the calypso sauce. The chicken carried the meal. I tried a bite of the mango shrimp which was very good as well.\n\nWe ended up getting these complimentary shots that were a combination of sweet, spicy, and a bit strong. There were a bunch of emotions behind the shot, but I enjoyed it.\n\nThen came the birthday cake! The presentation was cute! It was a chocolate lava cake and it was pretty good! I just felt like the cake was falling apart a bit too easily.\n\nI saw there were comments about no large parties for brunch, I can confirm that I did see one this past weekend, I hope that clears up some of the misunderstandings. Vibe/environment wise. I was informed that it does get turnt, and I went in expecting a party brunch. The music was a bit low and the crowd was mainly sitting around having conversations. I’m not too sure if it was the day, but the setting was more date-like. Everyone was polite and smiling and our waiter was great at checking in.\n\nIf I would return? Only to try the dinner menu.\n\n(This is a 3.5/5 ⭐️ rating )"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkem9HbWFREAE",
            "text": "This spot was 100% on point for Caribbean cuisine.   Started with the tenders and plantain.  Moved on to the ox tail, peas and rice, macaroni and jerked chicken and pickled slaw.  All amazing.  Atmosphere was on fire with music and good people."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbWJTbDJBRRAB",
            "text": "So I’ve been there twice. Most recent was date Night with hubby the food very tasty and the drinks are really good. Me and my hubby both order the Trinidadian Chinese Snapper  and Shrimp WITH Mango slaw I had mines with garlic mash .The Appetizer was the Crab cake which was delicious 😋😋😋The DJ was on point it was an awesome experience thanks Sugar’d for the good eats and tunes"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNmYzUFhnEAE",
            "text": "Food was delicious as were the drinks. Marlon was extremely helpful as he is with every visit. Sean/Shaune was also very very patience and kind w/ assisting us."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtLWE3Ujh3RRAB",
            "text": "Are you ready for the 411? Here we go…I have always been a fan of Sugarcane so was excited to hear they opened a new location, Sugar’d! This new location is in the heart of the Caribbean community in East Flatbush. The spot is absolute beautiful and they did a great job in transforming it from the previous lounge that was there. Parking is TIGHT so I would advise to Uber or carpool. The aesthetic and ambiance is beautiful. This was their launch weekend and actually Day 2 so kudos to them. The Spicy Mango drink was everything, between the three of us, we had 8 drinks! It was tasty with a mango zing! If you are a sweet drinker this is the one. The snapper was perfect according to my husband and the oxtail was fine but a little more seasoning. The mango bacchanal shrimp was an excellent appetizer, I cleaned off my plate! I see this spot as a great hangout location with friends and family. If you are looking for a kickback and enjoy!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwa05uR1N3EAE",
            "text": "My lady and I made a list of Restaurants that we wanted to visit in 2023 and Sugar’d made the list. We were not disappointed at all. As usual, we sat at the bar and Paris the bartender warmly greeted us. The restaurant decor is impressive with a gold theme right down to the flatware setting. You can sit outside, dine in the main room or in the back that has a lounge like feel. There is also a mini bar there to accommodate diners. We found the dj there who played tune after tune of Afro beats to soca to reggae. Now, on to the food!! OMG!!! Flavorful and totally delicious! We ordered the Snapper and shrimp as well as the Lamb chops. No to go box needed, we ate it all :-).\n\nRecommendation:\n1) New hires should be well versed with the menu and how the dishes are prepared. We found that Paris had difficulty initially but sought help. Overall, she did a great job while taking care of us at the bar.\n2) For brunch days, additional help may be needed at the bar so that drinks can flow smoothly. Initially, although seated at the bar, we felt that we waited too long for drinks.\n\nIn summary, we highly recommend Sugar’d and this compliment was communicated with the manager - Marlon.\n\nFor brunch, a date or any celebration, go to Sugar’d."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdGF1N1hREAE",
            "text": "This newly opened, cool, trendy spot is a must visit soon! Good Caribbean music, sport bar setting at the bar equip with TVs. Food is tasty. You feel happy, with the good energy this place puts out, everyone look’s beautiful, in their trendy styles and positive vibes. The staff is friendly. Though there was a mixup with the kid in our party not getting her chicken fingers. The waiter was nice enough to remove that dish off the bill at the end of our meal. Great dining experience, totally high marks and you will not be disappointed you visited. I had the lamb chops - delicious, came with macaroni and cheese pie, rice and peas."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdXJHSzJnRRAB",
            "text": "I visited Sugar'd sister resturant to SugarCane resturant and was very impressed with the service, food, and atmosphere. Our server was fantastic and very attentive, checking on our every need. The other staff and manager were very friendly creating a welcoming atmosphere. The food was very consistent with their sister resturant SugarCane, and the chef brought back memories of my grand mother's stewed chicken with their Heritage chicken dish. Excellent. The resturant has two entrances with one side that will be excellent for a private event. The decor was well thought out and elegant. The overall experience was top notch. I will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbEtTWm5nRRAB",
            "text": "I came for brunch and was so ecstatic that I did. I ordered the waffles with mango bacchanal shrimp and asked for cherry vanilla ice cream on top. They certainly obliged my request, and I was so happy they did. My brunch entree was everything I wanted it to be. And the drinks.. amazing. The brunch bartender, Marlon, made me a really delicious cocktail with whiskey and orange juice and it tasted so great. It was sweet, just how brunch should be.\n\nMusic was great, vibes are always amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOXZ6ZDdRRRAB",
            "text": "The person serving us (Cree) seems deeply invested in it, treating it as if they were the owner. We initially assumed they were the owner. Now, turning our attention to the food, it was incredibly flavorful, presented elegantly, and all menu items were in stock. If you catch my drift, this place came highly recommended to me, and I'll enthusiastically recommend it to anyone I know in or visiting New York."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cWVPSjRBRRAB",
            "text": "I absolutely loved this place!!! The food was delicious, the drinks were nice and strong, and the service was excellent!! I made reservations but the person I spoke with wasn’t aware that there was a huge party that  had just made reservations at the same time. Alex called me back immediately and apologized. She even offered to call me if there was  availability. She did call me and when I showed up, she said Tammy? I have your table ready and sat us right away.  She was so genuine and sweet. I will be back again and again!! 🤗😊"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcHBPUTNRRRAB",
            "text": "Great atmosphere. Friendly staff. Food was delicious. Drinks were made to perfection. Got my purse cocktail but that is for special occasions only due to the cost."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbm95WUVBEAE",
            "text": "First time at sugar'd and it was excellent from  the drinks to the appetizer was a hit i ordered two drinks of tamarind  spicy margaritas our server and bartender INDIAN MARLON WAS GREAT WE ALSO HAD THE GRILLED SHRIMP AND SALMON ,COCONUT RICE ,GARLIC MASH ,JAMBALASI  DOUBLE SURF APPA WERE GRILLED  SUGARCANE SHRIMP SWEET PLANTATIAN  10/10 😋"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNnVmVVFBEAE",
            "text": "One of the best restaurants I've been to in a long time.  The staff are friendly and attentive, there wasn't a ridiculously long wait for the food, which was absolutely delicious and the drinks hit the spot. The decor and entire dining space is absolutely beautiful. I would highly recommend and would definitely be returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbmF5cm5RRRAB",
            "text": "Went for my birthday and they gave a wonderful experience. From the people, through the music: listening to soca, food, and enjoying the hospitable nature of Sugar’d made it a night I will remember. Their drinks are exceptional as well!! I’m definitely coming back and encourage you to take your chance for a cherished experience !\n\nHave a special occasion and you want to go with a group of people (3+)? Booking a reservation is recommended. There may be a full house."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN3N6TGtBRRAB",
            "text": "Let me start by saying the food is worth every penny..... yes there certain things that's can be tweaked. But your getting your monies worth especially bw the mains.... the curry is amazing\n\nThe FRIED CHICKEN WAS everything I NEEDED.\n\nI WISH  I had space for dessert but i can only imagine how good it is.\n\nI dunno if I can ho back to Popeyes after trying this.\n\nThank you for having a solid restaurant in da hood and on top of that catering to  the real ones and not gentrifiying even farther.\n\nBut this place is so beautiful the food is amazing.\n\nBut let me be a little critical the mango slaw although it was good I felt it could have been toned down in terms of saltiness regardless it's A1 .\n\nOTHERWISE THE FRIED CHICKEN WAS DEVINE!!!!!!!!!!\n\nCRISPY WITH A HINT ON SWEETNESS AND JUICY NOTHING WAS DRY.\n\nI felt like a kid again at home waiting for Sunday to come to b eat a good home made meal and after all the restaurants I've been to especially in the carribean feild it's not a easy feat to do"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbUpEdFFnEAE",
            "text": "The best nice small , service top notch. Everyone that came to our table was attentive and excellent. Would recommend to anyone to try, I can't wait to go again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREZ3BXRDB3RRAB",
            "text": "My husband and I came all the way from South jersey to attend a basketball game and decided to check out sugar'd ! The drinks we had were flavorful and strong , we had the rum punch and sorrel mojito . We wasted no time and went straight to ordering our entrees.  Which were jerk chicken,  rice & peas , potato salad, bust up shot with curry mango , curry chicken, and a side of macaroni pie . When I received my bust up shot , it was overheated, making it hard . I was very apprehensive about sending it back, but my husband said something to the manager or owner ( not sure of his title), and he took care of it.  Overall service was great , food was good , we enjoyed ourselves.  Our only complaint would be the music was a bit loud , great selection but a little too high ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdFAyTlhREAE",
            "text": "Honestly it’s sad that these types of restaurants are the way that they are. You had a reservation for 15 people for over 2 weeks. You couldn’t get people seated in a timely manner. You couldn’t even provide enough seats causing a person in my party to leave to accommodate someone else. Your “hostess” had an attitude for having to do her job and communicate effectively. You have one “waiter” who for some reason thinks it’s acceptable to stand on one side of a 4 table long set up and scream across a room while u have music plastic at ridiculous level. Sat for almost 30min. 5 table settings were never put out until about 25min in. Waters never came. What is the reason for blaring music at these establishments? You walk in and immediately struggle to talk to the person next to you. Forget for a table of 15. 5 people sitting at a round table literally couldn’t speak across it. When it was all said and done your “manager” who was also the “waiter” had the audacity to say the BILL would be $231 for 2 appetizers and 6 drinks that NEVER came out? I wouldn’t recommend this place. Not because the food isn’t good but because of the employees, the service and atmosphere."
        }
    ],
    "reviews_count": 71
}