{
    "name": "Melany Restaurant",
    "place_id": "ChIJmxYBq2pbwokRbzKAAbmGduY",
    "grid": "BK14",
    "address": "785 Flatbush Ave, Brooklyn, NY 11226, USA",
    "rating": 3.8,
    "user_ratings_total": 623,
    "phone_number": "(718) 282-0399",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMVQxOWxlVGRGUVROS1kxSm5RWGgzWDNSWlJrRRAB",
            "text": "If you just gonna microwave day old food, slather bbq sauce on it, and then keep it under a heat lamp all day, then stop serving food and JUST be a bar. Y’all are 90% of the way there anyway."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abU1UQllkalV3T0Vwd1gwcFpTSE5rWTBOVFIwRRAB",
            "text": "Se dañan antes cocinaban bien ahora cocinan salaisimo si tu quieres que se te suba la presión vete pal melany pedí un mofongo y me dieron un SALFONGO SALAO..."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQ1NXTlBYM2t4VVhKdGNrSkNSbUk1UW1aYU4wRRAB",
            "text": "Good Food good ppl"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VVQwVnNiMWd0YTJsRlZVeElPREo2UkVodFlWRRAB",
            "text": "Buena comida, lo malo es que hay una señora que siempre se queda con centavos que me debe dar de cambio, y no es la primera vez."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KemRrTjRWRWxhWTAxNk9IQm1NR2d5YVhnMGNIYxAB",
            "text": "Pudimos para llevar aquí pero tienen grandes opciones para aliviar los días en los que no logramos cocinar."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOclJUSlFhV0prUW5ReGRFZFBUVEJCTld0VWRsRRAB",
            "text": "Not ideal for black people . The Spanish girls that work there treat Spanish people totally different than what they treat the black people that walking. They act a little scared or maybe prejudice ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTE9Ua3RjakpqV0VaNVVIWnlVWFJtVm5SVlptYxAB",
            "text": "This place is nasty"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGV2RqQnhVMUoxZEVNMmVtSkNVVmw0YTJaeGExRRAB",
            "text": "The owners sit outside with a giant speaker from around 6 PM to 1 or sometimes 2 AM every night without fail, blasting music. Sometimes there are as many as 20 people out there with them. This has been going on for the last four months. Despite frequent complaints from neighbors, they will not turn their music down. In addition to this, their food has really declined in quality, and there have been multiple reviews that mention them being racist against Black people. This is a Caribbean neighborhood and you're going to act like that? Turn your music down and stop being racist to your neighbors."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTWRHUlZaRTAzWjJJNVNWWlhZVE5CV1ZWdlVHYxAB",
            "text": "I received an horrible service. I came up and nobody asked what I wanted I ask for assistance and that girl looked at me with an attitude. I stand there and I called her again and she came  looking at me like I’m crazy . I was asking her questions she responded to me like she doesn’t want to talk to me, and I think they are racist . They didn’t have rice or any side just the meats . The only reason I bought the food is because I couldn’t go somewhere else.  I end up having a slice of lasagna and the stew, she charged me $23, I don’t think that’s the right price. The women restroom wasn’t working too that night . I don’t recommend that place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaFpYUktRbEJTTFVoTmFucHhiM2xMYW5OVE9HYxAB",
            "text": "The workers are extremely rude. The person who took my order had a bad attitude and took a long time to come to me, even though there was no one else in line. It seems like they are exhibiting racist behavior."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KZlMxTjNlbFpOV0ZWWWFEQnBPVmRXUVc4MVkyYxAB",
            "text": "This was our first time trying Melaney’s. Me and my son’s father just happened to be in the area and wanted to find a spot to eat and chill. I ordered the shrimp quesadilla and he had shrimp tacos. We ordered the salt fish and rice for our son. To my surprise the quesadilla was REALLY GOOD. From the first bite, I was like damn this is not your average quesadilla. Delicious! Only thing is that it was “half” sized and $15.95. I felt like the food is overpriced . But all of the food we had tasted amazing. For that I give them 4 stars."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaVoyeERRbVJyVFMxUFpIZEJSbEJFWWpsRFExRRAB",
            "text": "I love going to this resturant it is so nice inside great staff and great food I got a garlic lemon Salmon and rice and peas it was sooo good will be back for more and bring some friends along because they have seating."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTVJsTlNWMFJ6WWxsWE5HcHVaVFpaZEhoMWVWRRAB",
            "text": "Ordered from there all the time 3 to 4 times a month for years, vegan so always heavy on rice and beans but on a few occasions they'd send me a large bean container with like a 1/4 of beans in it, finally that last time o ordered twice for a totally off 4 large brand and I barely got one whole container of actual beans, I called to speak to someone but got the time around so I don't order there no more"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aM1ZtaEpSbFJ0T1hFMVJVc3hUWEozZUZka2NGRRAB",
            "text": "Perfect place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MWRGTkZjbXd3Tms5NExXVTJXa05KZEd4RGVrRRAB",
            "text": "Horrible,  yellow rice salty, chicken tasteless, beans salty undercooked, terrible!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KS2QzaFRXVlo0WlhRd1NqbE9abDh5TWs1Rk5tYxAB",
            "text": "I live in the building across the street from Melany and it’s a nightly occurrence that music is blasting for hours after closing time. Stop it! I’ve never been to Melany and why would I bother going to the place that’s the source of my sleep deprivation? Hugely disrespectful. Do you want new customers or not?"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLalFqZUdpMGRtT25BRRAB",
            "text": "Bueno"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLandnOG5NX3EtelpnEAE",
            "text": "I was a customer for over 15 years. Yesterday was my last day supporting this business. My sister ordered us food and my grilled chicken sandwich was wet, soggy and inedible. I called to explain what I received this man gets on the phone rude and disgusting yelling at me, simply because I asked for a new sandwich to be made because he claims the sandwich is soggy because it is fresh off the grill and sitting to be delivered so I asked it to be separated he said that’s more money. I wasted over 30 dollar in food. He also claimed I wasn’t a customer for the amount of years I claimed because he doesn’t see the number in the phone. What a bozo.  Over the years the food got nasty anyway that’s why they closed down the first time. DO NOT SUPPORT THIS BUISNESS GO TO LA CABANA THEY ARE FAR BETTER"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1eHBhbzF3RRAB",
            "text": "Best Dominican this side of Brooklyn"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaXJxRElREAE",
            "text": "very good place with great prices!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcUt5NzR3RRAB",
            "text": "It started out with the disinterest of the servers to take our breakfast order. We were the only persons seated for breakfast. The fries were cold, the toast was actually warm bread,  the mangu was subpar and the lackadaisical attitude of the three servers remained the same - no interest.  As you can see by the photo, they remained in place as we ate, no check in to see if the food was good, it wasn’t. Again, we were the only customers there. I recommend Castillo de Jugua at 679 Flatbush Avenue for a great Dominican dining experience, breakfast, lunch or dinner.\n\nI love to support the culture, BK born-Panamanian raised, and try new restaurants. This is my first and last time here. It’s really sad that this is the type of treatment received in a predominantly Caribbean community in Brooklyn. They need to do better."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMkxxb2JnEAE",
            "text": "I walked in even though I was the only person in line everyone was busy. The lady serving the food didn’t even ask if I needed something or acknowledge someone was there. I walked out and saw a white couple walking in right after me. I was waiting outside  for my uber. And I was watching to see if someone would help them, the minute they walked in. 2 people behind the cash register jumped to assist them including the lady that was serving the food lol."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdnZQRUxBEAE",
            "text": "Buen servicio"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNzhTTENnEAE",
            "text": "I love there food always fresh and the the people in there are very nice and respectful"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnck9uWWVnEAE",
            "text": "Only ordered take out twice, but so far it has been really good and the service has been great. Fast delivery and good communication. They answered all my questions with patience and accommodated all my vegetarian requests. My favorite part: true Dominican portions (we eat a lot) and amazing prices. Hope I dont jinx it, but 100% recommend if you’re in their area because unfortunately they’re not on uber eats ☹️"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBeUtybXNRRRAB",
            "text": "It's not my first time here, but it's close and it's convenient I must say that the rice and the chicken is pretty solid. Everything else is trash. It's not much other Dominican spots around the area so that's the only reason why they're still open. They're very rude to people who don't speak Spanish, just know they're not gonna pay you much attention ... Which is weird because they deliver in a predominately black neighborhood which is now slowly becoming gentrified... Like I said, they're the only one that's close by the neighborhood"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMTVfWUNnEAE",
            "text": "El mejor"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbThtMWRnEAE",
            "text": "Very good breakfast and the best chicharrón ."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmOXEzUVdREAE",
            "text": "Seems like the workers are very rude it feels like when you black they rush want you want when u say I'm undecided they get nasty oppose of someone coming in behind me comes in they spanish decent and they be very happy and giggly I just walked out"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQemZtU2ZnEAE",
            "text": "Laid back atmosphere with wonderful employees and comida."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbE9hcVNBEAE",
            "text": "Una comida deliciosa. Muy recomendable y solo ten paciencia a la hora de ordenar,aveces tienes que hablar fuerte o no escucharan tu orden y pueden darte algo equivocado(esto en parte es por la música alta que siempre hay) pero en general si recomiendo este lugar nuevamente por su rica comida. Vale la pena"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuZ3EyOGh3RRAB",
            "text": "Delicious rotisserie chicken chicken and rice and beans. Casual little neighborhood spot with a variety of foods to choose from."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3X2Y3X0FREAE",
            "text": "Está bien"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNib2NfejNnRRAB",
            "text": "Local neighborhood Latin food , offering some good dishes that satisfy the pallette."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMVBHMm1nRRAB",
            "text": "The food was delicious It was a shareable plate. If you are ordering a beverage I suggest the fresh squeezed OJ yummy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMZ0l1M3lBRRAB",
            "text": "Have respect for the residents who live in the neighborhood to not have speakers blasting music every Sunday night. We do have jobs we have to get up and go to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUelp1S2V3EAE",
            "text": "The prices are completely wrong. I clearly showed which I wanted to buy and everything that was ordered was charged way more. I showed her on the menu again which I bought and nothing was corrected. Would not recommend here unless you like places that lie about the prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNFpiVVpBEAE",
            "text": "I love the food. I really can't give more until I have gotten to know the establishment better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEM3NPaHZBRRAB",
            "text": "rented the upstairs for a party do not recommend the manager will throw extra things on your bill without telling you! do not recommend this place!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MF8yWl9RRRAB",
            "text": "HOLA BUENAS TARDES QUISIERA SABER PORQUÉ USAN EL NOMBRE DE MELANY SI SON MEXICANOS !! Y NO DOMINICANOS CAMBIEN EL NOMBRE NO USEN EL NOMBRE DE MI FAMILIA AYER PASE A COMPRAR Y MIRE MELANY EN EL MENÚ QUÉ DESCARO TODO CARO Y FEO LA CARNE GUISADA DURA MEJOREN EL MENÚ NO RECALIENTEN LA COMIDA NO EXAGEREN LOS PRECIOS Y TENDRAN BUENA CLIENTELA ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0dF9YWDVBRRAB",
            "text": "THIS IS THE WORST RESTAURANT I HAVE EVER BEEN TO,, THE FOOD IS DISGUSTING, WHAT A WASTE, REALLY SAD,, DON'T GO THERE PLEASE,, NASTY NASTY FOOD"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcUk3QW5RRRAB",
            "text": "The only thing that tastes good was the Tostones. The steak is a cheap piece of meat with so much fat on it.\n\nWe ordered an order of yellow rice and white rice, both portions of rice was hard as a rock.\n\nThere was a long black kinky curly hair in one of our steak platters.\n\nThey forgot to give us our Maduros when I first called to place my order the lady was so rude.\n\nShe put me on hold and forgot to come back to the phone.\n\nI had to call back several times to get someone to answer the phone just to take my order.\n\nThe lady was rude, and said that she was very busy. She was also very impatient with me.\n\nI had this order delivered to my house.\n\nBut, I will not order from this place again.\nI am shocked that they serve such yucky food for a Dominican Restaurant.\n\nWhat ever happened to people taking pride in their cooking and serving the public???\nNYC has gone down the drain."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJcDZ1VERBEAE",
            "text": "Food is ok at best sometimes.. little variety same choices . & not the best at it . Weekend they have a Corona crowd & some good music..awesome mural on the side of the building. Luv that part. But it's cool if u have a taste for some…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdnRXcjZ3RRAB",
            "text": "HORRIBLE SERVICE. The sever only spoke Spanish and did not understand what I was asking for when taking out my food. The  roast pork i ordered was not up front in the steam table. There was only a small portion off to the side in a beef pattie like food warmer. I believe that's the leftovers from lunch. For some strange reason when I asked for more pork skin the server    said \"skin\" and showed me the last peice she had cut out but then decided to put it to the side and fill my bowl with fatty pork chunks. I feft like she was trying to keep the food for her doggy bag at the end off her shift. Seems like Melany's is running a establishment that only offers good service to people of Latin decent. Thats from my experience. If you pay attention to the majority of who give good reviews here you will have a better understanding of whats going. NEVER BUYING FROM THEM AGAIN."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlM01fWkt3EAE",
            "text": "Cake was dry and moldy it was disgusting waste of 10 dollars . The empanadas were cold and hard as a rock this restaurant is selling old food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4c2N2cFhBEAE",
            "text": "New people working there. My family and I used to order from them, but we will now stay away.  There are better places in the neighborhood.  They are serving very little roast pork portion, little beans but a lot of rice. Keep in mind that…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdC0tZGl3RRAB",
            "text": "Some very tasty Caribbean food! Everything cut in large pieces. Terrific seafood soup on Fridays.\n\nClean and nice, with some light flair. A large space upstairs, and a few tables downstairs. The personnel are friendly, but speaking some Spanish is extra helpful. The music is always on and loud, but still within reason. They used to have a couple of old arcade machines in the back, but im not certain those still function.\n\n(Also, apparently the writer H.P. Lovecraft lived in this house shortly. There's no plaque.)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eEp2QTF3RRAB",
            "text": "I often come here to eat. I love the place, but today I found out there is a new administration. Sadly is not the same. I came to dine in and I have to get up to order what I want. I ordered some beers, rostisiri chicken with fried plantain and I have to get up 2 times to check on my food to make sure is ready, so I can eat hot. The green plantain was good but the rostisiri chicken was dry and no flavor as it used to be. I hope they make some changes soon because customer service and flavor on the food it’s very important for a business to succeed. Environment is very good. Nice Spanish music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOX19qNlhBEAE",
            "text": "Ordered catering for a party and a day before (fully paid) they had a gas leak at the restaurant. They never tried to reach out and I no one has responded to my calls. Had to put in a huge last minute order at another restaurant and pay premium for it. Still haven’t gotten my money back from Melany."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c01fZHZBRRAB",
            "text": "Food is kind of good, the service is not the best though,  when you order your food it is like the ladies try to find something else in to the food they are going to serve, instead of serving faster and giving the right portions. Also if…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxb2FQZ3R3RRAB",
            "text": "Melany is known for its delicious and flavorful food. The restaurant is also praised for its outstanding service provided by its friendly and attentive staff. It is a must-visit for anyone wishing to experience the best of Dominican cuisine and excellent service. The food here has been enjoyed by my family and I for many years, and we feel at home when we eat at Melany."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNU5EcjhnRRAB",
            "text": "I have been a faithful customer for over 2 1/2 years. Each time they have messed up my order, i let it slide. The food is okay, especially on days when you dont feel to cook.  Today i order ten dollars worth of fried chicken (legs and thighs) i waited one hour and a half to get the incorrect order. I was told she will send the correct chicken, which took an additional 45 minutes. The lady over the phone expected that i hand back the incorrect chicken. At this point, my daughter had been waiting to eat all day. I picked off a piece for her to eat. The chicken was not what i asked for nor was it worth ten dollars. With that being said, they lost a customer for good. Good customer service would have been to hand over the correct item as a courtesy without expectation. They took way over two hours for this transaction, they sent the incorrect food, and they were very inconsiderate!! I am very upset because this is no way to treat your consistent customers!"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVeTRleGFBEAE",
            "text": "Me gusta lindo lugar y una comida muy  excelente un personal muy atento al cliente"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnaGFPTVVBEAE",
            "text": "Horrible I wouldn't give them even one star. I get to New York after driving from Boston. My sons father suggests we go to this restaurant because of their prices and seating availability. Long story short my sons father ordered goat and the barely got any meat! Mostly fat. He asked for a different meat because he took one bite and wasn't satisfied. Woman was very rude, didn't want to give him another plate. By then I took a few more spoonfuls of their bland rice and stew chicken for myself and children. Paid and left! Meanwhile I ate (so I didn't pass out!from hunger!) she ignored him and only took the plate when I expressed that I eat out all the time, have family who own restaurants, and only would a unprofessional place not take back their plate and want to satisfy their customer! She seemed only concerned with flirting with the other male customers! I try to eat at local business tonsupport their development... I would NEVER eat there again! I rather go to a fast food place. I NEVER like to eat fast food. I contacted the better business bureau. The restaurant never responded. Who ever owns this place should consider taking  their customers seriously! Don't loose a customer over a slab of meat! Cheap asses!!!!!! If you want good food go to La Cabana which is up the street from there better food and service!!!!!!!!!! I ate there twice while I stayed in NYC with my children for those 5 days of Feb vacation."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtb05TRU53EAE",
            "text": "A lady called from the Melany restaurant and she was out of 3 items more than half of the order...i said no problem you can send me something instead equivalent to the same price...instead of her being nice and grateful that I am very accommodating and flexible she was incredibly rude. She was very disrespectful and very unprofessional...\nShe could have just canceled and saved us both a lot of time...but instead she strung me along for 2 hours and made ubereats send 4 different drivers to pick up an order that she didn't complete and have ready....\nFinally it was cancelled and 2 hours later I placed an order with another restaurant that is professional and worthy of my Business...\nThis is my first Negative review ever because I never experienced such rude and unprofessional service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxNHZDN2p3RRAB",
            "text": "Oxtail and goat stew were good. Wish they gave  more meat and less rice. The service when I came to pick up my food was not so good and I was obligated to provide all my credit card info over the phone, even the CCV code which was strange…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNzRQbE9REAE",
            "text": "Foolish me has ordered from this restaurant About fifteen times because I like the taste of their food, but nine out of the fifteen times my food NEVER arrived and I had to get a grubhub refund. All the other times my order arrived an hour…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OU9hQzhnRRAB",
            "text": "The people  there look very unhappy. I  watched the  lady with strange boudoir make a smoothie. She tasted the smoothie with a fork . Went back added some stuff in it. Pick up the same fork and used it to mix the smoothie. Come on now that…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzaUttQVR3EAE",
            "text": "Great customer service! All of the workers make eye contact and say hello. Food was delicious! They gave a lot of rice and a little bit of meat. No bueno when your watching carbs but well worth it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdS12dWx3RRAB",
            "text": "Staff was very rude and soup was just water no seasoning no meat super expensive. I won't visit anymore terrible service when I complained they spoke in Spanish like they didn't understand me. Terrible"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbTZ1Vl93RRAB",
            "text": "The food isn't what it use to be. The chicken I ordered had absoulety no seasoning, it was bland. I don't know if their under new management or what but they have to do better."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4OHB2Ri13RRAB",
            "text": "Casual, no-frills restaurant serving up affordable yet tasty and filling Dominican / Hispanic cuisine. You can score  half a rotisserie chicken with rice and beans for around $11. I'd definitely recommend and look forward to trying out some more of their food options."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRajVfczZRRRAB",
            "text": "Food is good, the wait is long as hell,  I order from here a good number of times, the customer service is lacking big time also I told the owner of this place, I wanted yellow rice with my orders all 3, over $50 this guy lies to my face,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScV9TZ2RnEAE",
            "text": "If you’re not Dominican I suggest you DONT stop here. I am very cultured so I don’t discriminate about where I stop to eat what so ever. But boy, I won’t stop here again while I’m alive & WOULDNT suggest it to anyone with a pulse. They don’t treat people with common decency what so ever, the only words I spoke to them were “ may I please have an empanada “ & that became a regretful transaction."
        }
    ],
    "reviews_count": 64
}