{
    "name": "YOYO CHICKEN ( Flatbush Ave )",
    "place_id": "ChIJI13sv7VbwokRzCDdja97d3c",
    "grid": "BK14",
    "address": "1300 Flatbush Ave, Brooklyn, NY 11210, USA",
    "rating": 4.6,
    "user_ratings_total": 66,
    "phone_number": "(347) 365-7946",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQmEwVTRRMGwxWTJSeGQyRmpSak5vYTFCcE9FRRAB",
            "text": "Food is great, staff are nice."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaWEtZldnEAE",
            "text": "Get the spicy chicken and fries combo, they taste really good and has good value.\n\nThey recently added chairs and got rid of the loud music, so I have updated my review."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdGQwRXdSV2h6WTNoNE5uY3llbTFrYlhaWU1GRRAB",
            "text": "Love that with the rice options, they don't give the gyro rice because that upsets my stomach. Instead they give this brown rice. The food isn't bad and they have a variety of sauces including lemon pepper. The space is quite big. The cashiers are friendly especially the Pakistani boy. Love the juices they have such as dragon fruit and hibiscus. Oh and they're halal!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWlRHWm1XbVIzVEhaUFJtcERNek01TjFaMFRsRRAB",
            "text": "Delicious!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeWNsbGhjRWxWZW1sNlJYZG5UMEZrUmtocWNXYxAB",
            "text": "Good one"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbk4wdGlaSEJyVDFCWllWaHFPRE5wUlZveVVHYxAB",
            "text": "Cheap with their sauce"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SU1rOVlZVzlaVm1JMmNtZDFTa3BOUXpOV2QwRRAB",
            "text": "My daughter and I went in to try a milkshake and the customer service was top notch. Definitely will be coming back here again we love rye fries."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaVlUUm9jMEZ2YTBWYWR6UlJhVlY2YzNsNWVYYxAB",
            "text": "YoYo Chicken is great! Finally a place that has flavorful chicken and burgers. Went there on Monday and the food was very fresh.\n\nMy new go to spot, as long as they don't change a thing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4R1FrcExXbk10WlhJeGNIUXpNamhWWlc5aGFWRRAB",
            "text": "The chicken and burgers taste amazing! And the yo-yo sauce goes SO WELL with the chicken. The staffs are also really friendly and nice. Totally recommended 100%"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMFdsaENhMGR3U1c5ZmNtMTZZVWhGZHpOSE9WRRAB",
            "text": "The kindest staff ever we got free milkshake card and a refresher"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLcms5SzJTcXRfMXRnRRAB",
            "text": "Idk why so many folks are raving this place. The service was great, it's very clean as well. The gentleman behind the counter was very courteous and provided some more details before I ordered. The menu is pretty simple and easy to decide. However the food itself, is just okay especially for that price. I expected more quality for two mixed plates for 36 bucks. These mixed plates have a fried chicken sandwich, a smash burger and  small portion of waffles fries. I'm a spicy guy and got the very hot chicken sandwich. I did not every get a bit of spice on it, it lacked any seasoning on there but did have a good crispy fry. The smash burger also lacked flavor. It tasted like it had been out for a while (kinda rubbery) with two slices of craft singles. I did like the caramelized onions but that was about it. I wouldn't visit for a 2nd time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRVFrUm1NM1Z3TUVZMVZsRmZXVEJKVDJZeFozYxAB",
            "text": "The only good thing about it the size of the food but it's not flavorful at all...oh and fries are nice and cruncy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYTQ3c2Y1MHV6bUF3EAE",
            "text": "Very delicious and fresh! Had the double smash burger and definitely coming back again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKXzk1TnlPX1plcUhBEAE",
            "text": "I just visited this branch of yoyo chicken and I must say that the environment was very clean, I ordered 6 tenders and when I saw that the tenders are too big, soft and tasty, highly recommended place to go for good quality food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMFVuZFdTbTkxWlRWaWNqQlVPVXRsZGtFMGVHYxAB",
            "text": "Waffle chicken and Smash Mac bowl was really delicious. I think they hire some new guys these guys are so professional."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOR3B5Wmo5enRmWkJBEAE",
            "text": "the guy that was 3ish  yesterday idk exactly his name he was very very welcoming his energy was very perfect wasn’t going to order anything but just a water but he actually convinced me i tried the chicken sandwhich hot it was so goodd !!!! this is a new place i will be going tooo !!!! recommend this place to come and eat !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLakh6b096NHUtMk13EAE",
            "text": "Both the chicken and burger sandwiches and waffle fries are amazing!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOaUt0STZXZzZ6bl93RRAB",
            "text": "I bought a mixed plate and an oreo milkshake. The service was amazing they were very friendly and the food was chef’s kiss. The fries were delicious and crunchy just to my liking. And the sandwiches were really good. The oreo milkshake was really freaking good with oreo bits in it. I live nearby and this is truly my Go to spot now. I am being 100% honest and i would 10/10 recommend this spot to anyone, bummer they aren’t on uber eats yet or doordash"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQNjQ5OEN4M0xpZDlRRRAB",
            "text": "When I found out a new restaurant was replacing the quickly shuttered taco spot, I was happy. I was less impressed that it was a halal chicken place only given the fact that there is a halal Kennedy Fried Chicken across the street so it was something completely different coming to the area. I never heard of the brand until it came.\nIt has a great location being right next to the b41/b103 bus stop heading to Kings Plaza/Canarsie.  There is no seating but high counters along the window so you can stand and eat. It is a shame due to the space they have available.  The person at the counter is generally nice and answers questions and gives recommendations.\nI think it has a range of items though if you go in person, you have to deal with the menu flashing too quickly on the screen to get a good glance of the options. Luckily they provide a paper menu.\nI ordered the chicken tenders (mild) as my first taste since I was planning to share with family. It comes with Texas toast and a yo yo sauce. I was informed that the spice options for tenders (original, mild, medium, hot, very hot, lemon pepper) were seasonings so you can’t order it separately. For sauces, you should order wings.\nThe amount of meat you get from the tenders is decent for the price. The seasonings used were not my favorite and they were unevenly applied. I might have been better off getting it hotter or lemon pepper. The Texas toast was provided but it was underneath the chicken as to soak up the tender juice as opposed to being separate so I couldn’t judge it on its own merits. The yoyo sauce was decent and a great compliment to the chicken.\nThis meal was similar in taste to me to Raising Canes. The Texas toast and sauce add ons definitely helped but while the chicken wasn’t as crispy as Canes, the juiciness and relative lack of flavor go hand in hand.\nI wouldn’t order the same thing again but I would be willing to order something else from the menu like the Mac bowl, burger or the fish options"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMFlYUmlnRRAB",
            "text": "The sandwiches are so good! Super crispy chicken, moist in the middle, and the Cole slaw and yoyo sauce hits! I really hope these guys stay open, I love having them across the street."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdmNLVTF3RRAB",
            "text": "It’s called yo yo chicken but there burgers are better and Popeyes chicken sandwich better and the Mac"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNFlTdGFREAE",
            "text": "The mac and cheese kinda remind me of the microwaveable mac and cheese you fet at stop and shop and the fries were WAY too butter, overall the MY food experience was not so great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvb3MzS3lnRRAB",
            "text": "❤️❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc3VDemd3RRAB",
            "text": "The place was nice and clean, they didn't have seating, but theyare waiting for tables and chairs. However they have a counters where  you can stand and eat if you like."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMHBMcnNBRRAB",
            "text": "The nicest people I swear. The special sauce is to die for. Like drop the recipe plsssss"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOWFxZlFREAE",
            "text": "They have some kinks to work out but giving them grace as they’ve only been officially open one day.\n\nI don’t eat meat so got the fish sandwich. Fam got burgers, chicken plate, and tenders. Everything fried was fried and seasoned super well, which isn’t easy. My kid said the chicken plate was pretty intense and a lot for one meal. The tenders were huge and my younger kid loved them as well as the burger — and she doesn’t usually like burgers. Super happy to have something in that weird little spot that has the potential to stick around so we plan on adding them to our list of local spots."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMWNLRWZREAE",
            "text": "Very expensive.  Not worth it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaVlMZnlRRRAB",
            "text": "Delicious food, hot & fresh, great customer service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOGJMYXR3RRAB",
            "text": "This place is litt, the sand which was good and the staff was friendly, i definitely recommend the chicken sandwich"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOGRMWDZRRRAB",
            "text": "Great addition to the neighborhood. Loved the food and customer service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJc1p2X05REAE",
            "text": "Here for the grand opening! Line was moving at a good pace."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc2F1ajVBRRAB",
            "text": "Amazing food good queue person is friendly"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJc2F2TUhBEAE",
            "text": "great loved it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc1ptSW53RRAB",
            "text": "Amazing food with amazing combos and amazing price the workers are nice and gave me a free meal"
        },
        {
            "date": "6달 전",
            "language": "ht",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJc2VtcmZnEAE",
            "text": "FYE !!! 🔥🔥🔥"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc2I3T3h3RRAB",
            "text": "Very amazing sandwich"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJXzlHZFRBEAE",
            "text": "Great service and food and atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbTczVVhBEAE",
            "text": "Amazing service. The employees are so charismatic and friendly and the kitchen looks extremely clean. Although you can’t sit down and eat I would recommend this place to everyone. I especially love their waffle fries and their chocolate milkshake. The milkshake is thick and creamy and you can really taste the chocolate. They also put whip cream on the milkshake and they sometimes give you a discount. The waffle fries are absolutely divine their equally crunchy and greasy texture just makes the whole experience amazing. This place completely blows away all my expectations and I would definitely go again. Their sauce is also amazing and goes with everything on the menu."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ay1Mb3dRRRAB",
            "text": "The greatest experience!!!\nAnd food!\nAnd service !\nand atmosphere !!"
        }
    ],
    "reviews_count": 39
}