{
    "name": "Westwood Bar",
    "place_id": "ChIJjxSW1EpbwokRxIlsNH5fl60",
    "grid": "BK14",
    "address": "1715 Foster Ave, Brooklyn, NY 11230, USA",
    "rating": 4.6,
    "user_ratings_total": 230,
    "phone_number": "(347) 350-6551",
    "reviews": [
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MU1mQnF3RRAB",
            "text": "Food and Service is Very good"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQllsVmxiMkp0VjBsV01YQklOR0ZFTUhGeFNYYxAB",
            "text": "Absolutely delicious!\nThe thai mussels and the skirt steak are a must orders!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204dGRYWlRjMVpZUkdwSlRUSldObkZzTmtSR1FuYxAB",
            "text": "Excellent service and delicious food. Would definitely come here again. Staff is really friendly and the ambiance is awesome id definitely recommend sitting outside if you can."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcWFqZHRVVUl3VmtRemIwdFFaakl4V2xaTWJYYxAB",
            "text": "My family and I love going to Westwood! It’s children friendly, the waiters are very nice and friendly and the food is delicious! One of our regular in the neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcGRFVXlZVkJCWVRkWmNGcFdZVmx1ZUZsaFkxRRAB",
            "text": "Truly wonderful Austrian cuisine. It's our favorite place for celebrations. Service is top-notch. Food is never disappointing. Very few other places in the area this good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWWMxUkNlR0pSY1hoUmRXRlFibDkyZUdoR2IyYxAB",
            "text": "We came here for a quick Friday night dinner. Alcohol and mocktails and waiter were great!!! But the food was so over fried and swimming in oil that I felt like we spent 200 dollars on vegetable oil. The sweet potato fries were less fried, the avocado had a kick to it. But the Brussels sprouts and the kids fish n’ chips were so over fried that it was inedible. Needless to say I wished I had stayed home and cooked dinner instead."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRDAtcUctcE56c3RnRRAB",
            "text": "Popped in for an evening snack and cocktail on a warm spring evening. Excellent mojito made with mint from the bartender’s garden paired with some guacamole and chips. Other than the freshly fried chips being a little oily, the food, service and lovely patio seating was a nice day to wrap up the day."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYUQyLU9pclByTFR3EAE",
            "text": "I met the owner, Leo, at an event today and decided to come check out his establishment nearby. The restaurant is very warm with nice ambiance. It feels like a cozy neighborhood gem where everybody knows your name. You can come here with family, friends or solo like I did and catch a nice vibe.\n\nFrom the bar, I ordered with Vinny who was very funny and personable. I tried two drinks: the Paloma and the Flatbush neighborhood inspired Rum punch. Delishhh! I can see this being a summer time problem if I lived on this side! Lol\n\nI wanted to keep it light since it was after 9pm so I ordered the mussels in Thai curry sauce to go. Mannn, those mussels were sooo good!! I contemplated saving the sauce 🤣\n\nAll in all, very nice establishment and even warmer people! I hope to visit again next time I am in the area."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdF96TEV3EAE",
            "text": "Their burgers…the hype is real. 🤤 I also appreciate a place that has a mocktail menu! Can be a bit rowdy on a weekend but c’est la vie."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcXZLaDBnRRAB",
            "text": "Terrible experience. It’s one hour before closing and me and my partner try to sit in a booth in the back. We were told to sit anywhere we want. We sit down and we’re told to move because it’s for parties of four. I understand that but it’s one hour before closing and the place is empty. I’ve been before so I wanted to show my date a good time and we were awkwardly moved. The food is good. The drinks are good. The owner or manager was the one who moved us and I even tried to pay an extra $20 to have the table but still refused. I’ve been a few times before so I know the quality of the food and drinks, but after this experience I won’t be back. This is the only “good” restaurant in the neighborhood. I wish it was a better experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRXzRlVDJnRRAB",
            "text": "Cute lil neighborhood spot. Food is deliciious ans drinks are very well done. I'd definitely recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdXEydmZREAE",
            "text": "Some of the best margaritas!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBellpSXpRRRAB",
            "text": "My fav bar in the area hands down"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUR2OWJkTBAB",
            "text": "Good ambience, tasty food what else you need !"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aUtLV0h3EAE",
            "text": "Cozy, great drinks and service, but the absolute worst fried pickles I've ever had. Whomever made the decision to fry entire spears vs chips needs to rethink their life choices"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbHJXbXVRRRAB",
            "text": "Very friendly and welcoming! The tacos smack!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbHRYM2hnRRAB",
            "text": "Amazing food and customer service"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeTd1Ykh3EAE",
            "text": "Amazing atmosphere. Great staff. Always a fun time coming here. Food is amazing and delicious!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaTlmV1ZnEAE",
            "text": "The happy hour here is soliddddd. $8 for a old fashioned?! GTFO. Even $10 during regular time is a great deal. I came here after work once and have been back every week and befriended all the regulars. The rotating daily specials keep it exciting and the staff are genuinely good people to be around. I’ve met some of the owners and they are so, so lovely.\nIf you come by, say hi! I’ll be at the bar lol"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaS03VGhRRRAB",
            "text": "Great time here. The food is amazing.  I love the Birria Tacos! The Manhattan is perfectly balanced. The service is excellent!  I like eating at the bar. it is easy to to talk to everyone seated."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMmRILW9nRRAB",
            "text": "Love this local neighborhood spot! Food and cocktails are always consistently good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMmJqVzJ3RRAB",
            "text": "Our favorite neighborhood spot! Such a warm and inviting space. Cocktails are awesome, food is incredible, bartenders are so friendly and chill. Highly recommend if you’re in the neighborhood, you won’t be disappointed. ❤️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNmZ1ck93EAE",
            "text": "Great vibes, music, and severs. Love the burgers and the chicken fried chicken on the brunch menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMk9qX0dBEAE",
            "text": "Great place for a date. Great drinks too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cHFTODNRRRAB",
            "text": "Decent food—TERRIBLE service…just be prepared to wait to order even water"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3emJTNXBnRRAB",
            "text": "My friends and I love Westwood so much we would wear t-shirts with their logo. My fav burger ever lives here: The Alamo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidHZUaU9REAE",
            "text": "Very nice restaurant/bar for families.\nFood (Quesadillas) is awsome!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibXVLTF9BRRAB",
            "text": "I have been coming here for the last 14 years and when I went to order my burger this last time (with extra peppers) the owner was in the store and charged me $1 extra per pepper which in total they charged me $3.\n\nI explained to the owner that I only wanted $1 off for one pepper since for the past 14 years they never charged me and she told me it made her upset that I was getting it for free and that they would not be in business if they gave it for free which is INSANE and of course not true. Absolutely no customer service. She seemed not to care that I was a long time customer and to not even discount one pepper for $1 is absurd. Very bad experience and I will never be returning again. Pinching pennies from customers will lose you much more in the future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdWVMak9nEAE",
            "text": "Live this place the owners a so nice!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbHVhZ29BRRAB",
            "text": "Appetizers are delicious. Every nacho chip was filled with something. Cheese, beans, guacamole, tomatoes. Crispy brussel sprouts. Very tasty. Happy hour drinks refreshing. We had margaritas and beers. Being a vegetarian you are able to swap out any burger for the Impossible. Served with fries. For dessert they had a special toasted almond cake. That was so good. Sunday brunch is so delicious. Many items to choose from .Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUMy16WkR3EAE",
            "text": "This awesome bar had amazing food, service and a great atmosphere! I started with the soft baked pretzel and couldn’t decide if I liked their cheese sauce or mustard better- both were really good. Then for dinner I had the quesa birria tacos which were unbelievable good. The service was also really fun and friendly and sitting on the covered patio while it was raining was really nice and relaxing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NmZlNHdnRRAB",
            "text": "My girl and I go to the spot. Always friendly services, the food is delicious and the cocktails too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bGFtdEVBEAE",
            "text": "Not cheap by any means but the food is solid. I'm a little suspicious of a place that has good fish and chips and nachos but that's the situation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxNkxQN3pnRRAB",
            "text": "i love going to westwood, the ambiance is beautiful and the service is always professional. the happy hour is great. this bar is a great edition to the neighborhood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscFl5S3Z3RRAB",
            "text": "Great customer service, Food was delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGNWFHS0N3EAE",
            "text": "Always come here for the great bartenders and the mussels. The happy hour is really good as well , margaritas are made fresh and aren't syrupy. Only con is I wish they stayed open later"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaejY3NldREAE",
            "text": "Great local place. Came in with my wife for s bday dinner. Real easy and right to the point. The food was perfect and the drinks were strong. Ordered the wings and they were great. My wife loved her salmon and my old fashion was right on.  Even got me a shot for my bday."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNW96dmhnRRAB",
            "text": "great burger, but the fries are weak. if they upgrade to hand cut fries, then we'd be talkin'."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMXIyTW5BRRAB",
            "text": "Cool, unique local place with delicious food and atmosphere"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcjc2WkZBEAE",
            "text": "Omg when I tell you I had a wonderful taste of their food 🤤🤤🤤👏🏽👏🏽👏🏽 bless the God of the chef here because it had my mind blowing in away.. I can’t wait to go back ☺️☺️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNHBHTlVBEAE",
            "text": "Best restaurant in the neighborhood. Steak is wonderful, drinks are on another level, service is impeccable. Their specials are always good and fairly priced."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcUtibWN3EAE",
            "text": "AMAZING 🤩"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKM0tuRkxREAE",
            "text": "Great food, service, music and ambiance! I had a small gathering here with family, shared a few different dishes/cocktails and let me tell you, they did not disappoint! Well seasoned, cooked and presented. Thank you to Leo and the entire team!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4czgzU2R3EAE",
            "text": "Very good customer service. Very good Margaritas."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bkpyWkdREAE",
            "text": "Just amazing!!! Vibes, food, cocktails, service, the owner is absolutely personable and runs an incredible establishment. Completely deserving of success and the kind of a place you want to keep a secret but can’t!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4bzZIbGNBEAE",
            "text": "I just had my first visit today for brunch at this bar/restaurant because it is the \"sister\" restaurant to a favorite of mine The Ox Tavern that is a few blocks from here. And since this place just opened this year I wanted to show my support.  I guess because of the current COVID situation they don't serve with plates and silverware. Everything is treated like you are getting takeout, which is fine with me. Easier cleanup. I got the Omelette which was very tasty and the home fries that came with it had a good flavor. The menu is limited for brunch, but the prices are very reasonable and you seem to get a lot of food for your money. Also the waitstaff was very friendly.  I will definitely come back for another brunch and/or dinner. The dinner menu seems to have a lot of good options."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXaWRXV0JnEAE",
            "text": "Came here on my way to visit my friend who lives in the neighborhood. What a great place to grab a drink and some food in a non-pretentious neighborhood bar. The bartender made strong cocktails.  I ordered the Birria Tacos and they were delicious."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzb3ZyZ1Z3EAE",
            "text": "It may be a small space, but the quality of food more than makes up for it.  Rapidly becoming a neighborhood favorite and a must-try.\nThe mushroom and goat cheese omelet was fantastic!"
        },
        {
            "date": "3년 전",
            "language": "fy",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdU5lOVVnEAE",
            "text": "I was at the Drag Bingo Fundraiser for Kaegan hosted by @KaeganForNY @Kaegan_Marie In the @westwoodbk this evening 3/14/2022 #lgbt #dragbingo #brooklyn #bingo #drag #ditmaspark #westwoodbk 1 Westwood Bar I was at the Drag Bingo Fundraiser for Kaegan hosted by @KaeganForNY @Kaegan_Marie In the @westwoodbk this evening 3/14/2022 #lgbt #dragbingo #brooklyn #bingo #drag #ditmaspark #westwoodbk 1"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaG9UM2JnEAE",
            "text": "The drinks were really good the wings were really good also. Overall nice neighborhood eats. I will definitely go again"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzaEp5QU5REAE",
            "text": "Wanted to try the  new bar/restaurant in the area. Food was great and shareable for the price. Will definitely return."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSM2N2dlV3EAE",
            "text": "This is my 2nd time at Westwood bar. Both times, the food was delicious. Everything was fresh, well seasoned, and the portion was more than enough. I will be a regular for dinner service."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNdWF5SGh3RRAB",
            "text": "Great for brunch, friendly service, casual atmosphere."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLZ3F6UDhnRRAB",
            "text": "Portions were kinda small nonetheless food was good. Bloody Mary was meh."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNmN6clJnEAE",
            "text": "Went before a show at the Kings Theater. Glad to see the Ox is still with us.\n\nNice place, excellent service, good drink specials. The Black Manhattan was great. Loved the hot chicken sandwich, and my wife said the baked cod was outstanding."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNzZtVFlREAE",
            "text": "Delicious food! Tried it first on UberEats and the hanger steak was amazing. Visited for brunch and mimosas are reasonably priced and the food is great. Stay outside for a more chill and relaxing experience and sit inside for a darker and louder vibe with some music."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSanVQUjlRRRAB",
            "text": "Went here to try their cocktails and they are amazing!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtX2ViTk53EAE",
            "text": "Have heard about the place from other people who raved about it.  Was driving past it one day and decided to stop and get a takeout burger. Friendly staff.  Ambience pretty chill on an evening when there were only a handful of people. Burger was pretty good when I got home. In no way a knock to the place but given my limited time there, I can't give it 5 stars (sorry!). But, I can guarantee that it's on my list of imminent neighborhood dinner spots!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeEtxNkJ3EAE",
            "text": "Had the most amazing time attending the Drag Queen Bingo it was our first time eating there. The food was so reasonable and outstanding. The owners were very attentive andmade you feel like home. The service was on point! Highly recommended!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNGZ2QUNBEAE",
            "text": "I like this spot, it's got a good vibe, usually seems pretty busy and their menu definitely makes a solid effort to be gluten free without being real flashy about it, which I appreciate. I'm docking a star because there are some very subtle things that could so improve the whole feel of the place - I want a decent napkin. None of this stack of tissue paper nonsense which is what we got when we are there earlier this week. It is such an easy fix and changes the experience from feeling like takeout to feeling like a restaurant. Another easy fix along the same lines, I don't want plastic takeout ramekins on my plate complete with lids. That's for takeout food. Just use a metal ramekin for the sauces; all the dishes and silverware are not disposable so why draw the line at ramekins?? It just would complete the feel of the dining experience at Westwood, so those are my thoughts. Anyway you should go here and eat their food which is delicious and enjoy the ambiance, it's lovely. Good service too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeVpXYm9BRRAB",
            "text": "Loved, loved, loved it! Went there for the first time and I loved the steak frites. The bartender, Carlos, was awesome as well as the owner. Great vibe and service. I will definitely go back soon!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeDlmeWZBEAE",
            "text": "A terrible experience, after being installed we were served 40 minutes later while the restaurant was not occupied. The waitress had a bad attitude and just told me that the kitchen was busy. Finally when the dish arrives, I find a long…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMTZMYVFBEAE",
            "text": "I have a confession. This place has never cooked me a bad meal (dine-in or delivery) or made me a subpar cocktail. It may have taken a bit longer than expected to to get to my table/house but I swear on everything I love, I was never disappointed. Westwood is the go to spot in the neighborhood; food and friendly staff have never wavered in the quality department. Thank you for being here 😊🙏🏾"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzMXRHUTB3RRAB",
            "text": "I saw this spot transition so very nicely over the past couple months kudos to the folks who took this spot to ah whole new High. I finally stop by for a quick bite to eat, had the mango habanero chicken wings it was so delicious, very…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtb2R1WERBEAE",
            "text": "Drinks are strong at a good price point. The fries are insanely delicious, and well-seasoned. If I lived closer, this place would get me happily morbidly obese."
        }
    ],
    "reviews_count": 65
}