{
    "name": "El Ranchito Poblano Restaurant",
    "place_id": "ChIJz4QI40hbwokRKQTO1sxks1k",
    "grid": "BK14",
    "address": "1306 Flatbush Ave, Brooklyn, NY 11210, USA",
    "rating": 3.4,
    "user_ratings_total": 266,
    "phone_number": "(718) 282-0366",
    "reviews": [
        {
            "date": "17시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JM1RrbGlibVZCWW01b1QzbGlSbmwzUVdoa04yYxAB",
            "text": "I ordered two portions of pork chops here and it was a terrible experience. The beans were bad and the tortillas were hard. It's not a reliable place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Sk5FRlpWRFZJWm5VMVNqSmxlbVJzWTFCQldGRRAB",
            "text": "The torta was good but twice as expensive as in other places. The meat was no cut into pieces and therefore hard to bite and chew"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYVlsSk1jalpCY1d4SU1YbHdUMVJFYmpGYVUwRRAB",
            "text": "Delicious food"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMFNFdFBSWFpaYlc5UldXbE1ZVVIxUm5sNGJIYxAB",
            "text": "This is my go to spot every time I take a trip to New York to see family! Its a nice small place that's very clean and the staff is super nice and super friendly! The service is super efficient and they will meet all of your needs and expectations and then some! Highly recommend this place if your looking for a good Mexican spot to try!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSll5MUZRMk4wWld0SFltcHNSamxuV1RGYU5tYxAB",
            "text": "I used to order the birria tacos here faithfully and I raved about this place being good, affordable, and having a quick delivery time. But in this last year the quality has gone down drastically. I noticed about 6 months ago that the food didn’t taste the same and assumed they got a new cook. But it kept getting worse and sometimes I would get cold food or a quarter of the consume.. i tried to give them the benefit of the doubt and kept ordering but they they doubled their prices, took Mexican rice off the menu, and the food was subpar so I finally gave up…."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1c1pWSkpOMk13WDE5NWR6WnNXblExV1dsNU5sRRAB",
            "text": "My work group came here for lunch and had a wonderful time. Their menu pricing challenges competitors. Their customer treatment and menu options are excellent. The food tastes exceptional and costs what it should. El Ranchito Poblano Restaurant satisfies our entire family's tastes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aa2JYWnBZMEZDVkdaSmRtbENaR3N5YUVzek0zYxAB",
            "text": "not good.  both the chicken chimichanga and the chicken enchiladas were filled with alot of onions and not much meat."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FM1RFWnhRVlkyUjNGdmNXWXlja3Q0YkhveVNGRRAB",
            "text": "Fire loved it"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeVEzcEdkRXhJVFZkWGVYTkNaRUU0ZFc1UFVHYxAB",
            "text": "AVOID THIS PLACE! I ordered a Sope (a mexican  dish) and almost swallowed a piece of hard plastic that was embedded. Please see the picture. It scratched my throat, and now I have an infection. I called to complain, and they just said the boss would call me back – which never happened. Terrible food, terrible service. Stay away!\""
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJNjhsZURxbkozS29nRRAB",
            "text": "I usually order burritos from this place and they’re consistently ok. But tonight? Whoever is in that kitchen tell them to get out IMMEDIATELY. Raw onions in the burrito?? Me and my partner’s stomachs are turning after eating that slosh of a burrito."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOZWU1NGJ5emVYaHNnRRAB",
            "text": "I use to order food from this Restaurant about 2 yrs ago and it was good but today I ordered some sweet fried plantins and steak with onions and it was horrible the steak was tough like leather not tasty or appetizing I will not order from there again wasn't worth NY $27...."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbm1pczJLd1pEVy1BRRAB",
            "text": "Best food when I’m craving something my grandma would make"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNDRlcF9RRRAB",
            "text": "Excellent service"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnak91X3Z3RRAB",
            "text": "This restaurant makes me want to walk into the Mexican consulate, renounce my American citizenship and declare my allegiance to President Sheinbaum"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcl9YTHJ3RRAB",
            "text": "This is another happy surprise that I came across during my travels.  I stopped in on a whim and one of the workers greeted me warmly; when I asked for a menu they gave me a few right away.  We've ordered from them several times already and everything has been delicious, including the appetizers.  I love the flavored lemonades and the cemitas, which are some of the best I've tasted in a while.  Everything is fresh, including the sauces, and the presentation/packaging is always done well. They also have some great vegetarian options that have the same amount of flavor as the meat ones.  Five stars all around with a great atmosphere and customer service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcmFPYjRBRRAB",
            "text": "Terrible food, very bad, very bad customer service, the woman who answers you in a bad way, very rude, very irresponsible when taking your order"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOHZMbUNnEAE",
            "text": "As a first-timer, I was a bit skeptical, but I ordered the shrimp taco and the pork with pineapple, and they turned out to be really good! Both were well-cooked with great portions. However, I felt the pricing was a bit on the high side."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyb0pYUnRBRRAB",
            "text": "The best Mexican Cuisine on Flatbush by far. Their food was delicious & fresh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURManUyRV93RRAB",
            "text": "I ordered the red sauce enchiladas and no jokes it was so damn spicy I just couldn’t have another bite!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNGFyajVnRRAB",
            "text": "If you order off a 3rd party service just expect to wait at least an hour being that they do the delivers themselves just be patient."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6Z0xLb1RBEAE",
            "text": "The birria tacos are dynamite!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NE43dDZnRRAB",
            "text": "La comida no es buena para lo que cuesta.  Di una estrella y ni eso merece."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMjZydjFnRRAB",
            "text": "Pretty good, burrito was tasty and warm! But hard pass on the cheese dip tho. $8 for cold cheez wiz is kinda crazy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqZzUybUxBEAE",
            "text": "Great food and great service the atmosphere was very humble and the patron was so helpful. I will definitely go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd28yMEdBEAE",
            "text": "Don't expect them to get your order right.\nExample - ordered super nachos and they forgot the nachos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxczhXTi1RRRAB",
            "text": "I'm an Uber eats delivery courier. The lady on the register was nice. The pick-up was a long wait. But like I said before, I don't mind waiting if the staff actually talks to you and tells you why it is taking so long and is not rude. A rude staff makes me want to cancel the order. I feel bad for the customer, but I'm not putting up with poor treatment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaTRQNWlBRRAB",
            "text": "Ordered from uber eats and it was super tasty and came quickly! Birria tacos and steak fajitas."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGMDRfSHRRRRAB",
            "text": "Had the gyro with fries. It was delicious."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacjlfTjdRRRAB",
            "text": "Muy mala la comida, pedí un churrasco y me mandaron un bistec todo flaco sin sabor y mal cocinado...  Mala experiencia!!! No pidan, ni vallan a comer ahi Lo único bueno fueros sus totopos 🙄 que mal gusto...…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaelBTU2NREAE",
            "text": "So I've been ordering takeout from here a lot lately. It's really good. I love their Birria Tacos which are super juicy. I get it with the mild green avocado salsa which comes in a separate small container add even more flavor. If you're not a spice person, you may find it to be slightly more than mild - but I love it. Everything my wife and I have ordered from there has been good. Chicken Enchiladas, steak, beef and chipotle chicken quesadillas, tostadas, side of pico de gallo - always fresh, Last time I tried their deep fried burrito (chimichanga) - it was awesome. I'm not sure what the actual restaurant is like as far as service and atmosphere but the food is on point"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMGNQd1Z3EAE",
            "text": "great food!\nVERY slow service in person.\nFaster to order delivery"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeEwtWVZREAE",
            "text": "El muchacho trabajo 10 años Aqui y la forma como lo trataron sus ultimos dias es muy muy triste. Yo estaba esperando mi comida y el cocinero le grito muy fuerte a ese pobre muchacho."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNktTQXdnRRAB",
            "text": "I messed up my order this evening and called them, and not knowing how to explain the situation I just rambled. The guy was so patient, asked the right questions, fixed the problem. And the food was delicious! Definitely will order again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MmY2RFR3EAE",
            "text": "They have very good customer service the food is delish. Its a family friendly location always clean and well kept"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NHQyMkZREAE",
            "text": "Been to this restaurant a couple of times and everything was fine. Until tonight  I felt so disrespected. I waited  a whole  hour for my food, thinking my order took time.  Until I realized they never started it until  50 minutes of me waiting. While they were sending out delivery left and right.I had to cancel and get a refund.i had to cancel anf get a refund.\nNever again"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NTVUV0p3EAE",
            "text": "Es la peor comida de flatbush ave aparte de la comida cara tardan demasiado en hacer los delibres hace 2 semanas ordene una hamburguesa para mi hijo y la carne sabia mal tenia un mal olor fatal mi hijo se me enfermó...."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodm9ySlF3EAE",
            "text": "The Birria tacos were delicious. They put rice in the consomé which made me actually eat the consomé instead of wasting it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNHFLRGxRRRAB",
            "text": "NEVER AGAIN.. They lost me as a customer and those I’ve told  I will definitely tell them to never order again from this rude and disrespectful place ever again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoaS1HVGh3RRAB",
            "text": "Grilled chicken was good , rice was kind of dry . Didn’t really like the salad. It’s like they just put random vegetables together ."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMWFTRVBnEAE",
            "text": "Cobros excesivos por delivery"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCZ2JDcWdBRRAB",
            "text": "I like overall. The server is so nice. The food is okay. There is also a deep odor of dookie right when you walk in the door, but you tend to forget about it after a minute 😂"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCekxIV3NBRRAB",
            "text": "Atienden de mal jenio  y tedan la comida  recalentada de otro día  se tardan para atenderte"
        },
        {
            "date": "2년 전",
            "language": "gn",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtLS1TTmlnRRAB",
            "text": "Pedi unas tostadas les dije el picante aparte pero le hecharon todo ahí , xq he comido tacos sin picante por eso pido aparte pero aquí no me gusto ni la comida aparte caros y poco"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtODVTNldnEAE",
            "text": "Great attitudes and service. I can be comfortable here."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4OS1DVUhBEAE",
            "text": "I am basing the stars/review on this order placed tonight. Typically their food is alright but tonight it definitely was not. I wish I could get a refund but who knows how that would go. I decided to take a risk and get there sampler which brings onions rings, mozzarella sticks, buffalo wings, french fries, fried baby shrimp and chicken tenders. All of that for only 13 bux sounds great right? Well it was horrible, not sure how long they have these in their freezer and took out to make today. I only had 2 pieces of “buffalo wings” but there was no flavor of buffalo at all, no sauce nothing. The mozzarella stick looked really as you can see is gross as well. Onion rings are scary looking. I also ordered Caldo de Res and it was subpar, basically make it at home if you plan on using this recipe; celery sticks, a sliver of carrot, chopped up beef, and garnish with onion, cilantro and limes. Sucks i won’t be eating this sampler!! DO NOT ORDER THE SAMPLER!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtaE42RGx3RRAB",
            "text": "I ordered delivery around 10pm on a weeknight. I got a burrito with the shredded beef, Mexican rice, pinto beans, guac, corn salsa, cheese etc. I really enjoyed it. Beef was neither dry nor overly fatty. Appreciated the customizable options although I do wish there was an option to choose no lettuce. I have definitely had larger, more delicious burritos from other places but overall this was a solid order."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtMk1xV0FREAE",
            "text": "I ordered for delivery, while the chicken and tongue beef tacos were very good and flavorful,(thus the 4 stars). The tamales were really lacking, I mean as a person who works in the food industry if the said food is not edible I flatout will rather not sell the item and just say were out(advice to the business owners)  overall ok experience......"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNTRmcDV3RRAB",
            "text": "I ordered chilaquiles verdes and agua de jamaica to be delivered to me. The chilaquiles were good but they weren’t adequately wrapped for delivery and salsa was dripping in the bag when it arrived. The agua de Jamaica was good. The delivery…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5b19UWnpBRRAB",
            "text": "Primera y última vez que compro en este lugar pedí un platillo de barbacoa Y me salen con esto todo quemado page por esto casi 20 dólares y el arroz ya no servía lo supe por el olor pésimo no lo recomiendo para nada"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3bUtIX2FREAE",
            "text": "Great prices and delivery time. They're open relatively late so you can call in orders, order online or go to the location.\n\nFood is always good. Rarely a miss with them and I've been ordering for years. Delivery can be stressful during busy times like weekends but they're pretty prompt.\n\nDefinitely one of the \"go to\" spots on my seamless list when I don't feel like cooking."
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNaFBMaExnEAE",
            "text": "Pésimo  servicio de los que atienden\ny la comida no está buena para el precio que dan muy caro  en otros lugar esta es una torta regular y acá es la famosa torta cubana  nunca más vuelvo a comprar"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNazViNmpRRRAB",
            "text": "Food came pretty fast, but it had no flavor. Our refried beans smelled & tasted bad, you don’t have to be Mexican as myself to figure out that they had gone bad. The fajitas also had no flavor whatsoever & they didn’t have any flour…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhMmZ5bk13EAE",
            "text": "I thought I’d give the place a try\nTo expensive for the amount of food I received. I payed $16 for grill chicken and rice with a splash of beans (Yes a splash of beans lol) The compartments were…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjN05tWnB3RRAB",
            "text": "Ordered a burrito with a side of chips and salsa through Uber Eats at around lunch time, and I won't lie it was not as flavorful as I'd expect a Mexican restaurant to be. To be completely honest, the food at Chipotle is way more flavorful…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvdi0yc053EAE",
            "text": "Ordered with them and after the food hadn't arrived after a little over and hour, I called them to make sure they had my order. When they assured me that they had my order and already sent it out, I waited another 50 minutes before the food…"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcjZ1emt3RRAB",
            "text": "I don't know about all these raving reviews, there is nothing good about this joint. We got a menu dropped under our door and decided to give this place a try. Their menu looks good and prices are reasonable. When I called, a lady told me that they don't deliver to our neighborhood and if we would like to order, they will have to charge us $6 extra. This was surprising since they dropped menu in our building, and we constantly order from other places that are way further than this place. Just to give you an idea, we are located on Coney Island, and this place is on Flatbush and Ditmas, so roughly 15 street blocks. We ordered for $46 and they told us that it will take 20 minutes. 40 minutes later we got the food. When delivery guy came to the door, the bill was $50 instead of $46, this was strange since I remember I've been told $46... I still paid since $4 is not a big deal. However, later we decided to double check the math, and not only the sum didn't come up to $50, it wasn't even $46... So this place cheated us for about $8, about $4 from the original bill, and I also think that delivery guy added another $4 for \"extra tip\". $8 is not a big deal, and I would have probably ordered more from them in the future, if the food wasn't just bland... All \"authentic\" food was of mediocre quality, with tiny portions of meat. The best what was more or less eatable was burger and it wasn't that great. There are other places in the neighborhood where you can get a decent burger for $10-15. I would actually prefer McDonald's burger to what we got from this place."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNGRDV0xREAE",
            "text": "No es un sitio nada lujoso pero fui a comer con mi madre y nos gustó bastante. Ella pidió tortas con carne y yo burrito de pollo, los dos platos estaban muy sabrosos. La cerveza Corona bien fresca y la chica joven que nos atendió muy amable y servicial."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcklTajJBRRAB",
            "text": "The food is good,  but they have no concept of customer service ordered thru grub hub $50 when they arrived l didn't check order turns out I  was missing large salsa verde $2.50 when I called they said no problem I would get it on my next order, BIG LIE. When I ordered again she said they have no POS system for recording such info and anybody can lie about \"green water\" This is unacceptable really who's ordering $30 worth of food to lie about $2.50 sauce.  I'm done, there are to many good Mexican restaurant's delivering in Flatbush for me to pay for poor service."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjaE1yclp3EAE",
            "text": "I posted the picture but this is my first time trying there food I CAN NOT EAT BEANS I told the young lady she looked me in the eye and said I put no beans on the receipt it says no beans so I have no idea why I have beans  then it’s like…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHemViRW9BRRAB",
            "text": "I ordered nachos with skirt stake. The food was very salty taht I could not eat it. I reported the issue to the restaurant and they said they couldn’t do anything because that’s how the kitchen does it. Really bad because I have ordered the same before and it wasn’t that salty. Lost money for a food I didn’t consume."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNmJtR0JnEAE",
            "text": "Small Mexican food place without authentic Mexican taste. We ordered Veggie Burrito and Veggie Enchiladas, which took atleast 30 min to arrive. They were very bland without any spice, Burrito was stuffed heavily with rice with only a little…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNraXQyYzF3RRAB",
            "text": "Went there to eat and they didn't even acknowledge my mother and I. They were so focused of making deliveries which they kept opening and closing the boxes and talking on top of them. One employee even sneezed on his hand and continued…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMTVuMTNnRRAB",
            "text": "Ordered for delivery thru Grubhub. They never delivered by indicated on Grubhub that it was delivered and charged me anyway. When I called they yelled at me and kept telling me that it is outside of the apartment. When I said it’s not and…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBN3QzN2VBEAE",
            "text": "Very disrespectful and racist I don’t even want the food pay and go..."
        }
    ],
    "reviews_count": 64
}