{
    "name": "La Cabaña Rodríguez",
    "place_id": "ChIJh3ivmUdbwokR7GoSs2UFyrs",
    "grid": "BK14",
    "address": "1062 Flatbush Ave, Brooklyn, NY 11226, USA",
    "rating": 4.1,
    "user_ratings_total": 1657,
    "phone_number": "(718) 287-0248",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xad05VRk5NRzlDU1dNNVlucHJTa2h2TTNJNWQxRRAB",
            "text": "It's always busy because the food is great.\nOpen Late If you want fresh and authentic tasty food, you can't go wrong with this restaurant. I can't go there without getting my Octopus salad Yummy yum"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWmNtVmZUSFZvTTNwR2FFTmFjbWh0U1VaNVlVRRAB",
            "text": "Very good ambiance nice service , good for money"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbGNUSk5iVkZWWVdwTFoxaE9VbDlXUjFkeVdWRRAB",
            "text": "fried chicken and food is fantastic it's reasonable and it's worth coming out and getting yourself some good Spanish food"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMFdWcE5NR3AxV1hKdmRrTnBTbmh3VkhKcFVsRRAB",
            "text": "Slow and barely speak English.. food good in afternoon"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bk1VUlNSVlZ0VFdGbU1YZE9OblF4TWw5a2JrRRAB",
            "text": "Hands down some of the best Spanish food in Flatbush !! The lines can get long & the wait can be just flat out ridiculous sometimes. Depending on whoms serving you, someone sweet or someone MEAN you can get. BUT THE FOOD IS ALWAYS A1!! I love the fried chicken with green sauce & the HENNY COLODAS … Omg they will out you out !!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdUtuOHB3RRAB",
            "text": "Great Dominican food in the heart of Brooklyn\nThey have been serving the community for years"
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTVQzWnRaM050VWxOcGVtMVhlVmN5TjJSUE4wRRAB",
            "text": "No me gusta la atención. Pides unas cervezas te tomas 2 baldes y te quieren cobrar 3."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kek56bDRVMkkwT1VGeWIzVjZja1oyZDA5akxYYxAB",
            "text": "Delicious sometimes but wait time is way too long when you order online… if you’re hungry, you’re gonna be starving"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUFpUVkZZbVZMTTFkVU0wTldORzEyUlhWNWNIYxAB",
            "text": "I love the food here its always fresh & great service i was impressed!! 10 ⭐️ for me ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVM1NubGlNMFl4VTJKeGIweG5iVEZTWjIxNlJFRRAB",
            "text": "Ordered my food from Uber Eats. The rice was overcooked and mushy and the pernil had no flavor and wasn't tender at all. I'm very disappointed to say the least. Will not order again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWaVNVVnBNRFJUV2sxVlltdHlWWFpUUVRJMWNIYxAB",
            "text": "DO NOT GO TO THIS RESTAURANT- DIRTY & COMPLETE TRASH MOST UNPROFESSIONAL STAFF & SERVICE IN NYC"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMVRIWTNWWEJoWDJwb2RFUmxaRmhzUVZacmMxRRAB",
            "text": "Best Place To Be With Friends And Family\nOn Saturdays Come Celebrate Your Birthday Here! Live Dj And Live Band Saturdays!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeFMwRXlNemR1TFRFMWVGTlRSSEoxUTBkVGJtYxAB",
            "text": "I had a great experience at this place! The atmosphere was dull, not plain, but the food was good. I enjoyed rice with sweet plantains and beef strips; the sauce was amazing! 😋 It's a first-come, first-served setup, but online pickup was smooth. However, updates on my order were slow as they got busier. The price was a bit high for the portion. I recommend it if you enjoy food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UlNGbElOa1YzVm14SWFEUklaVGhRU2xSWlMyYxAB",
            "text": "Great place to take the family"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQRE5tcjZnMmJqTWpRRRAB",
            "text": "Don’t order a lot online because they can never get my order right keep the order small"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYUZocGFfcXI2M2dBRRAB",
            "text": "Always serving up the best food 24hrs a day 💓"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNU2J2ZDZibnU2TUlBEAE",
            "text": "The food is always amazing, this is my go to spot when I'm in the mood for dominican food."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQMkRrTFNsdkxqOW53RRAB",
            "text": "El servicio es pésimo cobran mucho de servicio primero pedí comida y me cobraron 15 dolares del servicio y después pedí 3 margaritas qué por cierto están super cara 18 dolares cada una, ni en un restaurante lujoso cuestan tan caras y aparte…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQWGdvNXZzX1pqdWRnEAE",
            "text": "Their fried chicken and tostones are what has me driving an hour for at least once a week. The waitstaff are friendly and funny as hell. Now, back to their menu, you won't be disappointed with anything else you want to get."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNHZLdThnRRAB",
            "text": "Horrible service you stand there to order a drink and they walk right past you and continue to talk to one another. Second time going and trying to order and wind up walking out I will never visit this place again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb3BUbU9BEAE",
            "text": "Food is delicious but last two times I’ve ordered via uber eats it’s taken them forever to arrive. Way past its expected delivery time and it’s on the restaurants end. Not sure if the staff forgets to mark the food ready for pickup or what, but it needs to be fixed!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbDRUeVN3EAE",
            "text": "10 out of 10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaDhUMlp3EAE",
            "text": "Great food have eaten there for over 35 yrs great late night."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd3JLVHBBRRAB",
            "text": "$25 for half chicken with rice and peas and a small beef stew by it self.. ehhhh.. a lil steep and nothing special… I was  working in BK and was craving Dominican food and came across this spot. But, Harlem where I reside, I can get the exact same order for $16 and much superior. I will not be going back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMUpMdDlnRRAB",
            "text": "La Cabana Rodriguez is one of them ones. Huge poster board menus with pictures of the food with tape over the prices, worn out wood panel walls from the 90s, employees whose 2nd language is English, the beautiful aroma of authentic Dominican food, hand written signs informing you they don't take apple pay, etc. There was even a dude walking around trying to sell fake airpods, which is a telltale sign that a spot is gonna SLAP.\n\nI walked in and got in the short line and ordered my homeostasis meal of a half chicken, sides of yellow rice and beans, and plantains. I also added a beef empanada, as when I see an empanada on a menu my hands are tired. All of this food for $18.06 is a STEAL.\n\nI got my plate and took a seat in the back of the restaurant where there is ample seating and black film over the windows to keep the sun at bay.\n\nThis chicken was fantastic, although not top 5. I have it right at the top of my A-tier rankings for chicken spots, just barely missing S-tier. S-tier is special though, reserved for the Casa Adelas, Malecons, and Caravan Chickens of the world.\n\nSides were great and the beef empanada was special. The beef was so well seasoned and reminded me of how my Granny used to make it. Shout out to Granny!\n\nAs I'm doing research for this review, I realize they sell a Henny Colada. My only regret in life may be not getting this Henny Colada.\n\nIf I lived in the area, I'd be in here at least twice a week but unfortunately it's a PUSH from Lower Manhattan.\n\nIG @jnov_\nTiktok @jnov__"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJLXZuU3JBRRAB",
            "text": "Excellent rotisserie chicken"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRN29MaURnEAE",
            "text": "Good Spanish Food Spot In The Flatbush Area"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRb0o3OThBRRAB",
            "text": "Visiting from out of town, the place can become easily congested with the enter order process. Lots of what’s seems to be no proper process. Food was delicious as I had expected it to be. The place seems to have a bar area, towards the back. It was a heavy loud music, no ambiance was to be enjoyed while ordering, not the sit down and eat kind of place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMTRLUndnRRAB",
            "text": "Excellent food and good prices. The Beef Stew with White Rice and Red Beans and Plantains is amazing. And the staff are beautiful people. Dominican. Lovely polite friendly people. And of course Presidente beer was delicious!!!!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNC1Ddlh3EAE",
            "text": "Affordable delicious fresh good quality/portions"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcWZyV1FBEAE",
            "text": "Es un buen lugar la comida esta muy buena 👌\nPero lo malo esque una trabajadora me quería cobrar el típs y se supone que eso ya es opcional.........."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfal8zWkNBEAE",
            "text": "Buena atención y muy buena comida"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfa2ZPaVNBEAE",
            "text": "Great portions and great food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcU8zSkRREAE",
            "text": "Great selection of food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmb0tHQjlBRRAB",
            "text": "N/a"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OS1PVmRBEAE",
            "text": "The food here is decent but the service is so horrible such a turn of.. every time you’re getting food from be prepared to wait a long time . Don’t go if you are hungry and want quick service.. It’s like they are purposely taking forever to give people their food& not understanding people came to get food because they are hungry… A bunch of peop\nle on staff doing a whole lot of nothing. They always talking don’t know what the hell they always talking about… More talking than working."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaXZubUlBEAE",
            "text": "Lowkey… why was this beef stew thing I got so good??!?? Does anyone know what it is? I had Dominican food once before. I wasn’t expecting much from a late night pickup in my friends neighborhood but I was starving. THIS BEEF WAS SO INSANELY TENDER, it fell apart without the slightest toughness. You know how hard that is to get perfect?! Cook it long and slow enough for everything to melt together… but not enough to dry it out and get tough… this was incredible. In fact it was so good at 9pm and the portion was large so I had the other half the next day, which sadly I screwed up overheating in the microwave and it turned tough. SO EAT THIS HOT AND FRESH!!!! Thank you for reviving me this was sooo good! And the plantains were amazing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcE5pbFBREAE",
            "text": "This food was great. Well seasoned, and not a bad price. I was full and content with this meal. I would definitely come again. I got the pepper steak & yellow rice with green plantains. I also tried their macaroni salad which was delicious as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiM0ktTk13EAE",
            "text": "I’ve come to this place many times but was extremely disappointed in my service this time. I usually arrive with my friend who is Puerto Rican and he orders. Tonight I came by myself and I sat almost an hour waiting for someone to assist me.\n\nI told them my friend would be joining me and I requested 2 cups of water. The server never came back and I tried to speak to multiple servers none spoke English.\n\nAfter my friend arrived he ordered for us.. while eating they turned up the music extremely loud, so loud we couldn’t have a conversation. We asked them to please turn it down and one guy did but another guy came in and turned it up super loud.\n\nOther customers started getting upset and they almost got into a fight with the guy controlling the music. It was the most ghetto unprofessional experience I’ve had at a restaurant. If I could have given 0 stars I would have!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREc0xyblJBEAE",
            "text": "Love Love Love their food. Their Henny Coladas are soooo good i finish my drink before my food even came. The best spanish food in bk. The late night opening is a plus. Im so glad i live close by."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMDhMb05REAE",
            "text": "the service is terrible only thing good really is the drinks the roast pork terribly cooked over cooked and I’ve never had a bad food experience but they have not been doing their part."
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNjRYR2RREAE",
            "text": "The star count is less indicative of my impression of La Cabaña. I thoroughly enjoyed my experience here and it was precisely what I was looking for. Immediately upon entering there is an array of tantalizing stews, and it's clear you're going to be receiving genuine cooking. I had goat stew with a side of maduros, which was fairly epic, and it was a meal one simply can't get in most places. That being said, things were a bit salty to excess (I'm not a person who's afraid of salt), and the rice was underwhelming. Also, it was more expensive than I expected, which colored my meal slightly. You don't really know what you're going to pay, and for me it ended up being closer to $20 rather than $10, which was a little disappointing.\nHowever! The people are very warm, and if you want a slice of the Dominican or a reasonable meal outside the ordinary, I'd check it out."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZMmUtX3B3RRAB",
            "text": "I really want to give them five stars bc of the food, portions, and late night hours. The prices are a bit overpriced and change price every time I come here it seems. The Henny colada is what keeps me coming here and it’s availability when everything else is closed.\n\nThe customer service isn’t the best and the line flow is not clear, there are frantic ppl by the door looking for their bus or illegally parked car. The service or concern isn’t efficient or welcoming. Every time I come they are arguing with customers or not giving their all time best service. I feel like the places needs a totally new Strategy bc it doesn’t feel comfortable coming here bc it’s often hostile or the ppl working seem extremely exhausted and/or in a deep conversation in a different language, while ten ppl stand there looking at them. I’ve learned to just wait in the car for 12 min to avoid the awkward set up. There’s a side that is restaurant and side that is to go. I come here occasionally but it would be much more often if they made some improvements. The bathroom was unpleasant to use, there seems to be a lot of people working there and connected with a restaurant so not sure what it is so unkempt...\n\nThere is no sense of urgency here, you can literally end up waiting around for 45 min if you’re not on top of them about your order, not so customer friendly. If trying to figure something out, all of a sudden everyone is speaking a different language and I’m just like, wait what’s going on? It’s a bit not nice to do to ppl, standing around starving for 30-45 min and not understand what people are talking about regarding your food or just possibly a completely different topic. I asked for a side of sauce in the beginning, at the end they didn’t include it and then when I asked it took the lady so long to get the task done. Why? Bc she was chit chatting and laughing with her co-worker, I mean having the best conversation ever apparently as holding the bottle and cup, not pouring anything, giving no care that I asked four minutes ago and stood here forced to look at her bc she is the only thing between me and some sauce for my chicken. It’s like at least make the prices cheaper or add more if going to put ppl through it like that. I let her know that in the end and said it must be great to work here, it’s like a party, and she laughed and held and squeezed my hand...\n\nOverall- food, availability, drinks and hours are most likely what is keeping people coming and I’m one of them, it’s the sacrifice you must endure due to the circumstances, factors, and variabilities of this business vs. others in Brooklyn."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdE9UMzJnRRAB",
            "text": "All the food looked and smelled so good. With or without an appetite you're going to want to eat. You'll eat well here. I had the stew chicken. Bless the cook for the potatoes. They were a hit. The chicken was it's usual fall off the bone…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhcWI2S3lBRRAB",
            "text": "This certainly gonna be my last time supporting this restaurant...poor communication very low English...ordered online through uber...ordered twice 8/2/21 first order I wanted stew chicken with yellow rice and peas with yellow plantains and ginger ale soda 20 ounce to get 2 cans...as you see I got fried chicken with white rice and bean sauce...called uber got a refund...now I said let me try this again being hungry...mine you called first to confirm if they had what I wanted answer was yes...got stew chicken got 2 whole wings, 2 pieces on half wings, chicken neck and a small piece of chicken breast...yellow rice instead of yellow rice and peas...unbelievable SMH...the worst didn't complain never took a picture just throw straight in the garbage gave up...called back to be told our apologies we are out of yellow rice and peas and hung up the phone the worst...years ago it was so different...I'm so done I'm taking my service elsewhere."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURra19fUzNBRRAB",
            "text": "Great food recommended by a fellow Dominican friend of mine and the empanadas are amazingggggg. Prices are decent and may come high because they make their drinks and food from scratch with natural/real ingredients. Nice and helpful staff. Will come again soon"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUQtLS1ZeRAB",
            "text": "First and last! The yellow rice is hard, the pernil wasn't cooked fully, the soup was salty and the plantains were disgusting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMd0ozV0lBEAE",
            "text": "Been coming here for a long time. Food is always amazing. The staff, even with little to no English, are amazing, sweet people who really take care of your food needs.\nThey took out the seating in the main area and put all in the back, not the best place to eat, especially when people are rolling weed next to you while you eat.I get it( but time and place).\nwon't stop me from coming back. I just have a little more respect for the one sitting down eating"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bklHZElBEAE",
            "text": "Recently I visited the restaurant and the service was unprofessional one of the individual who was with me reminded the waiter of an order that was missing you got bothered. Is just a chaos environment, no returning back to see if we need something we had to get up and look for the waitress to pay the bill. Now I decided to order via one of the delivery services and for 45 minutes it was on “preparing your order did not move from there even when I refreshed it” Now I decided to call and once again unprofessional telephone service and they ended the call so their lost because I cancel the entire order."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwX09xeEN3EAE",
            "text": "I’ve eaten here before but didn’t have hair in my food(that I know of). But this time, after giving me the wrong order (I ordered 2 chicken empanadas and plantains), they gave me 2 piece of chicken breast and plantains. I ate the 1st one…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3LVlYMXhBRRAB",
            "text": "Used to go there in the late 90s. Food taste the same, the sisters are a little older, but it brings some good memories. The 3 pieces with fries is always my favorite , but I would recommend white rice with beans."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiZ0xhMmJBEAE",
            "text": "Their service is horrible!  I ordered just wings and fries and it took them forever to give me my food. Meanwhile people who came after me who ordered more than one meal got their food before me. Make it make sense!  I had to ask them did…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbzgtMlJnEAE",
            "text": "Frankly, their food is good; their service is HORRIBLE. If you order through Uber eats or if you go in person, you're waiting about a half hour to order and choose to an hour if not an hour for the food. There are a lot of people behind the counter; but the system they use to get things done, doesn't work. The entrance is EXTREMELY NARROW and it's also get place you make your order after holding up the wall for what seems like forever. I saw no gloves being worn, the hats and hairnets were halfway on. Not everything looked appealing to eat. I'd give the place a 4 out of 10. They need a better system handling customers and the wait time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OUppa3hnRRAB",
            "text": "Worst customer service. Waited 40 minutes for my order. Would’ve waited even longer if I didn’t say anything. Just watched ppl that arrived after me get their food. It would’ve been nice too if they got the order correct. Horrible!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzcXNYOEZBEAE",
            "text": "Everything they serve is wonderful. Perfect place to go for any occasion. Their customer service is always on point as well."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNkw2Y29RRRAB",
            "text": "Bought 3 piece and fries it normally taste good now I notice the portion got smaller price went up.charging me tax and for suing my card in there.Fries didn't taste right .I'm never eating there again."
        }
    ],
    "reviews_count": 56
}