{
    "name": "The Grounds Of Brooklyn",
    "place_id": "ChIJfZ4ZEexbwokRxRNY-pZIhzo",
    "grid": "BK14",
    "address": "1117 Newkirk Ave, Brooklyn, NY 11230, USA",
    "rating": 3.9,
    "user_ratings_total": 163,
    "phone_number": "(718) 676-0373",
    "reviews": [
        {
            "date": "1일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNVdXOVRjRUZLUVY5eVZscExTbVJ1UnpaWWNIYxAB",
            "text": "La comida estaba deliciosa, con sabores auténticos y presentaciones muy cuidadas. El ambiente es acogedor y moderno, ideal para disfrutar en pareja o con amigos. El personal fue muy amable y atento en todo momento, se nota que realmente se preocupan por ofrecer un buen servicio. Sin duda, uno de los mejores lugares para comer en Brooklyn. Volveré pronto!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jM0xXOUNVRzFVTTNsTVFWZEhOa3hJTFd4bmNuYxAB",
            "text": "This hidden gem has become the go to spot for me and my seven year old son. We had the Pizza alla parmigiana, the margherita pizza, both were SOOOO delicious. On other occasions we tried the meatballs, the chicken parmigiana and salad. The mocktails are amazing as well. My favorite is the lychee mojito and my son loves the blue lagoon. The rose Martini was ok. George appears shy or timid, but he's super sweet and provides great service. My son never forgot his name. I highly recommend this place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOTDU3N1d0amN2Ynd3RRAB",
            "text": "Great food and great service, perfect summer spot!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPSFE2ZkxiOThIUWVREAE",
            "text": "The pizza, the seafood pasta, and burger was magnificent! It’s a great neighborhood restaurant. George is so kind, he convinced me to try the pizza and I’m happy he did.also mocktail was 10/10."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNdk96TTZqdDdiV0NBEAE",
            "text": "The place has decent food and is great for kids, as it is usually not very full or, if it is, the clientele are unpretentious."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLWVxQkJREAE",
            "text": "It was so yummy 😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLWFyczhnRRAB",
            "text": "Great place. Amazing food and service. I tried Rigatoni Bolognese,  it awesome. Better than i expected. Thank you!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNzYyYmFBEAE",
            "text": "George is just a chill dude 😅 what some would consider timid but he is good! He recommended great options and held great convo. I had the paperdelle pasta (great) and the cacio w/chicken parm on top (light, buttery and great). Also the rice balls for appetizers. 10/10 EVERYTHINGGGGG oh and the lychee mojito is a musttttttt."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMGZEcVZREAE",
            "text": "Really nice atmosphere, cool wait staff Jorge was attentive and friendly! Food was really good and the music was chill. Highly Recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcUpQY21RRRAB",
            "text": "Love the food 💕"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdjg3NTJBRRAB",
            "text": "This place is definitely a hole-in-the wall. Very cozy atmosphere and great service, our waiter George, was very attentive to our needs especially as a bigger party (8 of us). Definitely recommend the lamb burgers that come with fries! They were absolutely delicious and the fries were amazing. The place is beautiful and definitely slept on! Would recommend!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdjhIamtnRRAB",
            "text": "This place deserves more attention! Quiet and cozy atmosphere with great food. George was our waiter and he was very accommodating. The food was very fresh and good. Very family friendly and excited to return!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJLTVTNHFnRRAB",
            "text": "Food and services were awesome!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bVBMMGJBEAE",
            "text": "Amazing food and wonderful service! 10/10 will definitely be coming back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aVBDYTRBRRAB",
            "text": "A very nice and quiet place, the food is excellent, the virgin drinks are delicious. And the service is 5 stars. Highly recommended."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NEpfcExBEAE",
            "text": "Delicious"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OXYtblFREAE",
            "text": "This restaurant has extremely delicious pizza. I have only eaten such good pizza in Europe. I recommend it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcHVIdGN3EAE",
            "text": "delicious food, had the Creamy Tuscan Gnocchi"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eUluaHdnRRAB",
            "text": "Excelente"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidDdQNEhREAE",
            "text": "The food was really good. The drinks were probably the best mocktails I’ve ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaW92emN3EAE",
            "text": "One of the best mocktails I’ve had!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcWRyN3N3RRAB",
            "text": "They didnt bring out my food until like an hour later so I was able to start eating while everyone else was finishing up. They decided that the person who ordered extra food to go in the group should get their burger before me so I was left all alone awkwardly waiting for my burger. Then on top of that the burger tasted bad and under cooked so even though I was starving I didnt want to eat it. They didnt bring out the receipt for everyone so I was left to go to the counter and request the oppertunity to pay. And the bathroom situation is a nightmare that looks like a maze someone who get murdered in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcXBTRl9RRRAB",
            "text": "We went there with the family, and we each ordered different items: the ribeye, seafood fra diavolo, salmon, and gnocchi al pesto. I definitely would not recommend the salmon as it was very dry, and the mashed potatoes were buttery but bland. The gnocchi was overpowered by too much Parmesan cheese. The seafood fra diavolo was good, with great flavor, as was the ribeye. We decided to give the margherita pizza a try and took it to go since we saw it advertised as wood-fired pizza on one of the logos outside. When we opened it, we were disappointed as it was not a true margherita pizza. We still gave it a try, but it was not great as the sauce was very sour and there was too much cheese. I hope to see improvements."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaV9LZGZBEAE",
            "text": "I’m sad to write this review as this is a restaurant we frequently visit. My boyfriend and I have been coming here together for a year. Separately about 3 years or so. The food is amazing as always, the creamy tuscan gnocchi is perfection *chef’s kiss*. My boyfriend usually gets something different every time, each time turns out great. This time he got the pesto potato gnocchi that he says he would absolutely go back for! As for appetizers we loved the fried calamari, rosemary fries and the cauliflower steak w/ hummus-(that has sadly been discontinued 💔). As for drinks, we have tried the; Blue lagoon (tastes great but might be too sweet for some as it was for us), as well as the Rose Martini a few months back this drink was delicious and absolutely our go-to whenever we came here or ordered for pickup. The Rose Martini had crushed dried roses that gave it it’s signature flavor and mint leaves, as well as citrusy and sweet flavors, and whatever they used for carbonation (might be Sprite because of the sweetness and citrus flavor, whatever it was it was great) fast forward to now (05/25/2024) the Rose Martini is nothing but water and a whisper of rose essence…no dried rose petals, 2 mint leaves, no sweetness, barely any carbonation, no citrus, it was awful. This actually made me sad. Even the drinks that they added were not cutting it. The watermelon lime was just watermelon, barely any lime… and the lychee pineapple was just too sweet, tasted more like pineapple than lychee, and the crushed lychee didn’t look too appetizing in the glass since it looked like shredded calamari…idk what happened but ever since our good waiter left us (tall very light brown haired young man) the quality in both the service and now the drinks has dropped significantly. Every time he served us we left satisfied with the drinks, food and service. The new waitress that attended us could barely hear us, brought us cute glasses for water sans the water all the way up until we asked for it and our order was already brought out. The other waiter we had the time before last was also new, and he seemed high as a kite the whole time we were there. Very unprofessional. I wouldn’t recommend the pistachio gelato either, it tasted like slightly barely there nutty wet shaved ice. We left that day very unsatisfied and sad that many things have changed. The only thing I have left now is the gnocchi 🥲 I love this place so much, and it saddens me at how much is different. We even recommended this place to a bunch of our friends and now we’ll have to alert them to the changes. If the Gnocchi’s were to ever change, I would have absolutely zero reason to return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd2VhNUhnEAE",
            "text": "This restaurant is AMAZING. One of the best dining experiences I’ve had in a long time. The loaded french fries and Spaghetti Alla Vonegole were especially good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENVAyZktBEAE",
            "text": "Chill spot and a hidden gem in the neighborhood. Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5anVlZWhBRRAB",
            "text": "Food was excellent and reasonably priced. Staff were knowledgeable about the menu and friendly. Can’t wait to eat here again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dEpUMjdBRRAB",
            "text": "The Italian dishes were incredible and reasonably priced. We had pasta, gnocchi, and chicken parmesan, all of which were clearly homemade, and delicious. Tiramisu is absolutely worth getting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cUsyeTlnRRAB",
            "text": "Was coming from Philadelphia, called because we hit traffic at 7:30, appreciate their honesty but was told kitchen closes at 8:30. We were suppose to arrive at 8. But traffic Changed our arrival to 8:20. You should change your closed time to 8:30 would be my only real suggestion. But appreciate the honesty would be a lot worse going 2 hours to find out the kitchen is closed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0bjlQQ1RBEAE",
            "text": "Don’t let the rating of this restaurant stop you from taking the chance. yes, i’ve read the comments but based on the photos and menu i came here for dinner.\nThe pasta and the menu options are very good. The service/server was attentive and helpful if i need to tailored or removed an ingredient. the food is prepared in eye view depending on where your seated at. overall will come again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0ak5DQkxnEAE",
            "text": "It's ii"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0OU1pbTh3RRAB",
            "text": "Super rude service I was asked ro leave because I took my laptop with me and other customers got offended like seriously I wasn't even talking or nothing I was minding my own business never going there again I wasted my money there for no reason I was atleast nice and still paid for the food I should have just left the food and canceled the order never again this people are so rude I can't believe this was the first time this type of stuff ever happened to me honestly I feel super offended regardless lesson learned don't wanna spend my hard earned money in a nasty place like that"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0bEt5NFJnEAE",
            "text": "We had came here 45 minutes before their closing time, and they took our party, not only that, the food was amazing amazing ANAZINGGG!! And Alex is such a sweet soul, def coming back here, AND it’s halal! love ittt"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0b0pxaHN3RRAB",
            "text": "Pasta is amazing. Especial spagetti With meatballs"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOeHVIWS13RRAB",
            "text": "Alex was amazing! He catered to our every need and promptly 🥰🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbHN6MjlnRRAB",
            "text": "My family and I visited The Grounds of Brooklyn, and it was a delightful experience. The manager, Alex, made us feel incredibly comfortable with his kindness. The service was excellent, and we indulged in a feast that included the Ribeye steak, Pesto Gnocchi, Lasagna, Margarita flatbread, and more. Everything was delicious. The food surpassed our expectations. We enjoyed our time and have now found our new favorite place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeEp2YldnEAE",
            "text": "Everything about this place was top notch. The lychee mocktail, appetizers, and entrees were phenomenal. Our server Aleks was amazing too! Would 100% come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbGZQQllnEAE",
            "text": "Great food. My daughter was in the mood for fettuccini alfredo with chicken. Although it's not on the menu, they still were able to make it for her.  We also had the lamb ravioli and the skirt steak. They were delicious. For an appetizer we had the chicken pizza. We tried their mocktails and they were very good. Service was outstanding."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWaElTdEVBEAE",
            "text": "I want to like and support this place but the pizzas came out completely soft and doughy.  Made no sense considering they have the giant wood stove.  Lack of wine or beer doesn't really go with the menu, but that could be tolerated if the food was on point.  Menu just seems too big and varied.  Better to pick a direction and do that well.  Atmosphere / decor is ok."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtelllYjhnRRAB",
            "text": "The meat ball is Amazing!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsLXB2MnNnRRAB",
            "text": "Had a birthday dinner for my son here. The food was good, and the price was right. Alex was the best. Very helpful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGX3FhMFdBEAE",
            "text": "Very pleasant! Food is amazing you definitely get your money worth here. Highly recommend to all"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGemRhVWdBRRAB",
            "text": "Very very good address to eat pasta! It was DELICIOUS and the service very nice!!! Kids have liked pasta too! And the décor is absolutely AMAZING!!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaODZtc2pRRRAB",
            "text": "Pictured: Ribeye Steak with cherry tomatoes, roasted rosemary potatoes, and chimichurri with herby garlic butter\n$36\n\nThis Italian spot located in Coney Island is delicious! The ribeye steak was a solid 8.5/10. Service was slow despite us being the only ones in the restaurant but the staff is very friendly and accommodating.\nPictured: The Beef’s Whisperer Burger $17\n\nDouble beef patty, havarti cheese, caramelized onions, sautéed mushroom, beef bacon, pickles, sliced tomato, lettuce and chipotle aioli\n\nFollow our insta: @nyc.halal for more halal food reviews!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1c3FpYlBBEAE",
            "text": "Went for my birthday, had a great time with friends."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5Z3FlbGlBRRAB",
            "text": "I just had my first lunch here today after seeing several post on social media about this place. It looks like right now they are still not doing indoor dining, which is fine. The little \"pods\" outside are super cute, clean and very warm.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MWRLQ2l3RRAB",
            "text": "The setup of this restaurant is very nicely done and is Halal. They have a cute little heated Cinderella carriage outside the restaurant that’s def an eye catcher. However, I have to say I was extremely disappointed in everything they had to offer. The owner named either Matt or Max seemed very annoyed and had no clue on what was going on and apparently it’s the same owner as Milk & Honey. First off, we called and asked for reservations but the waitress named Stephanie said that there are no reservations due to covid. We get to the restaurant, requesting to be seated in the nice Cinderella carriage and she tells us that we need reservations. Then, we proceeded to be seated in a shed where “there was heat”. The room was ice cold and definitely could’ve used more heating because their “strongest” heater wasn’t bussin’. As the day went on, they brought out one dish of lamb chops that was ice cold @6:45pm. We didn’t get the other four dishes til @7:27pm. At this point we request to be seated inside due to the room freezing off which they did accommodate but were very upset doing it. It’s okay the servers had little to zero experience as Stephanie expressed she works on the cafe side so I started to expect the most inadequate customer service received. Taylor was the only one that was super friendly and efficient. Now, that we were seated inside and waiting on the rest of the food, there are no plates given or proper utensils. The rib-eye steak was a bit burnt that it tasted like charcoal. The spicy chicken jalapeño pizza wasn’t spicy and was burnt. The Gnocchi with pesto and Mac and Cheese were good but mediocre. The food was awfully cold for the most part. I will cut them some slack because they do look like they just opened. Proper staffing is ideal especially if you’re advertising halal Italian food. I do not recommend it with the current customer service they have. I will be back in 6 months to do another review."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwaHMzaDdBRRAB",
            "text": "Food was ok and the interior was quite eclectic. At one point I saw a rolling pin hanging from the ceiling . It's pretty and clean inside the restaurant with the huge brick oven as the center piece. Pricey for a Brooklyn restaurant.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHN3JYTVpREAE",
            "text": "my family & I came all the way from Atlanta and found this gem in Brooklyn!! When I tell you, this was definitely our favorite halal place ever!!! We ordered pizzas, pastas, steak, & mock tails!! We ate it so fast that we ended up ordering more. Jaw dropping, mouth watering food! Service & food 12/10!!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwaHI3UG5RRRAB",
            "text": "Maybe has some potential, but currently unreasonably long wait to get drinks and food, inexperienced staff, food arrived cold.\n\nWe arrived for brunch on Saturday, around 1pm. The place was not very busy and we got a table right away. The waiter forgot to order our drinks with the bar, it took them 30 minutes to bring our coffee. Had to ask four different people to bring me some lemon. Some of them I asked twice. After a while our eggs arrived, but they were cold. And I don't mean lukewarm, I mean cold. It probably would have tasted good if it was warm. My eggs were served on a wooden board, which is not ideal for sunny side up :)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwaEpxMGZREAE",
            "text": "This is without a doubt the best restaurant in Ditmas Park at the moment. Attention to detail here is unlike anything I’ve seen in the area—or even manhattan for that matter. We went here on the opening night and loved every dish. We…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzeGVYdEV3EAE",
            "text": "My first visit and I felt in love with this little place. Only few items in the menu but the food is delicious. The server was very attentive. Just look at the pictures and visit the place. It’s worth every cent. 😊…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhNkxITjhBRRAB",
            "text": "I’ll be brutally honest, the food didn’t meet any of my expectations considering I paid well over $100 for just my wife and I and we only ordered 3 things - lobster Mac & cheese, land and sky burger, and the linguini. The chicken in my burger was undercooked, the beef felt dry and felt like it had no flavor. My wife didn’t like her linguini either, it was REALLY salty. The only thing that either of us liked was the lobster Mac and cheese.\n\nThe service was great, it’s actually the only reason I gave this place 3 stars. I felt so bad since it seemed like it was just one girl running back and forth, they definitely need to hire more waitstaff in my opinion. But that one waiter was so nice and helpful, she even gave us some cheesecake at the end for free, which I appreciated a lot.\nI personally think this place might be going through some growing pains, I’m not sure if they recently opened. I know I’m not the only person that’s complained about the taste/quality of the food, so maybe they’ll hire a new chef and tweak their recipes a bit.\n\nAll in all, I really hope this place improves as I’d love the concept. I wish the owners the best of luck, I know it’s hard making a new restaurant successful in this pandemic"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NHVYME9REAE",
            "text": "For the first time in this restaurant and with confidence I can advise everyone.  Very kind staff, delicious food.  In general, do not wish.  Thanks guys again!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzOWFhZmpBRRAB",
            "text": "Came here for brunch. The place was very understaffed. The waitress was not familiar with the menu. We also waited 25 minutes and didn’t even get a water and had to ask for it again. The food was good but came cold. Empty plates stayed on…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NmFqdXN3RRAB",
            "text": "Food was very flavorful and prepared well. Service was also excellent. Definitely deserves higher than their current 3.3 rating."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NThuRDVBRRAB",
            "text": "Great food. Updated menu. Our server, Alex, was wonderful. 10/10 recommend 👌"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5Z2Rxalh3EAE",
            "text": "Fresh pizza with a Mediterranean twist. Cool booths. Delicious food. Wait staff could be quicker 🤔. China serviced tea, yummy. Would revisit.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhbzgzM3p3RRAB",
            "text": "Amazing place to be, ordered the burger called the beef whisperer, it was a well seasoned burger with soft beef patties cheese and fries on side one of the best burgers I've had in brooklyn. Place is nice and has a vibe to it. Also tried their pasta pizza. All of the food was amazing service was quick would definitely be coming back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaM2MzalFBEAE",
            "text": "We ordered lasagna, ravioli and meatball pizza. The food was delicious. Alex was our server who was amazing!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLbUlUWmlnRRAB",
            "text": "If this restaurant is owned by the same person as Milk and Honey next door there is definitely something wrong. I took my grandchildren to eat at the grounds which they ordered burgers, I wanted an omelet which is served by milk and…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzbnZpamNnEAE",
            "text": "Delicious branzino. Would have preferred less potatoes and more roasted tomato. The real tragedy is that this beautiful restaurant has no liquor license. Definitely craving wine with my meal."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MWZ6Q3FRRRAB",
            "text": "If I can rate this establishment half a star, I would. The food was cold, the proportions were WAY too small. I even had to go to the grocery and make my own drinks because the Mamosa was just orange juice and sprite were $7 and no refill."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLaC1HRGl3RRAB",
            "text": "The food here is really good. We had the rib eye steak and pasta and both tasted fantastic."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaXY3VE13EAE",
            "text": "This place deserves 0 stars. We decided to try this Italian place for a friend's birthday celebration.. We were super excited about this place that we traveled a hour just to go here. The carriages were an eye catcher and we managed to get a carriage seat. The food took a very long time to come. Once the food came, it looked delicious and we were exited to dig in. Instead,  we were extremely disappointed. This has been one of the worst restaurant experience. Every single  lamb dish that we ordered had an extremely strong smell which made it unbearable to eat, the pasta has so much salt that it ruined the taste buds. Worst of all 2/4 pastas has hair inside them. We made a complaint against this and it was taken out of the bill. In addition to this they charged us extra for something we never ordered. Overall this place was a dissapointment and I hope the manager takes this feedback into consideration."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMya2RTeW1RRRAB",
            "text": "Food was great! Just wish there was pictures of the food on the menu so I knew what the food would look like. Also it was a bit pricy but some of it was worth the price"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhLTVpdHJnRRAB",
            "text": "Experience was terrible.\nLet me list it for you.\n1. They will take your order whenever, if you get lucky.\n2. It will arrive approximately 30 minutes later or more.\n3. They have fancy menu but non of those dish actually taste anything close to what they advertised.\n4. From meat to everything is super dry. Taste like they just preheated in oven and served us.\n5. In CAP do not get any type of desert. Rather go to deli and buy a ice cream.\n\nOnly thing was decent sea food pizza. Other than that, it was a disaster. They literally have one server.\n\nGo to next door “ Milk & Honey”. They are much better.\n\nNote to owner : if you are the business owner, please get more server, keep it clean. Actually get creative with foods, maintain the quality and DON’T serve dry foods to customers. Stop being cheap when it comes to owning a business. Worship your business if you can."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbEpTQjlnRRAB",
            "text": "By far the worst dining experience my husband and I have ever had both together and independently. Upon entry, we were the only diners in the restaurant. It was very cold and this did not prompt them to raise the heat. The single waitress even put her coat on while we were there. She knew it was cold and unprompted, seated us across the kitchen because she said it was warmer.    When the bread was served, we were not given plates to use. We asked for recommendations and she tried her best but had not tasted most of the dishes. We had the Involtini appetizer which was okay. From our seat across the kitchen we were able to witness and hear their difficulty in making the pasta dishes. The pasta itself was so salty that it was inedible. Clearly someone had made an error while cooking but worse was that no one acknowledged the error, our long wait time or offered to comp the meal. The meat was good and we tried to eat the food but the pasta was genuinely disgusting and overdone. Per my husband, \"It tasted like it was cooked in brine and from what I overheard from the kitchen, it was obvious that person had never made Italian food before.\" We sent it back and only after asking were we told it would take another 20 minutes to make so we said nevermind. They did not apologize and charged us for both dishes initially but removed them from the check after I refused to pay. We paid for the appetizer. They seemed unbothered by our complaint, lacked remorse and made no effort to improve our experience. As a frame of reference, this is the first time I've sent a dish back because of taste. Usually I will suffer thru it out of a feeling of obligation. The only other time I have returned a dish, it was full of insects. After paying, we went home and ordered pizza. If you are going to serve Italian food in Brooklyn, more effort is required. I was excited to find a halal Italian restaurant and was truly disappointed. By contrast, Milk and Honey next door was overflowing which should have served as a warning."
        }
    ],
    "reviews_count": 68
}