{
    "name": "Guac Time Mexican Grill",
    "place_id": "ChIJuTSmCc5bwokR3saDLF8vAyk",
    "grid": "BK14",
    "address": "1060 Flatbush Ave, Brooklyn, NY 11226, USA",
    "rating": 4.5,
    "user_ratings_total": 514,
    "phone_number": "(347) 312-4168",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFM2JTMTFWSEJUWVd4YWVGZE5iR1JaYVd4R1FrRRAB",
            "text": "The veggie bowl was delicious and lasted me for 3 meals! I appreciated the Impossible Meat option."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTlRqUXlNbkJuYmw4dGFYSnFUVFZGZEZkVmJFRRAB",
            "text": "The food here is so good and truly delicious! The portions are generous, one plate is enough to fill up a hungry stomach. What makes the experience even better is the friendly and warm behavior of the employees; they really make you feel welcome.\n\nI also noticed a review by someone named Anna Adam. I happened to be there when she came in, and honestly, she was harassing the employees just because she wanted extra meat. When they charged her fairly, she started bullying them. Her comment online was very disrespectful, and I feel it’s important to speak up — we should all respect others the same way we want to be respected."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVFdHUlhiSE0yZWxsNllXZHhka2s0Y2w5NmRXYxAB",
            "text": "I told him I would pay for extra of whatever I bought & he still proceeds to share put half scoops of everything."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoZldqQmxRMWg2TmtSbFNVMDRTbXMyUjBGSk9WRRAB",
            "text": "Gus time is no time. The food unfortunately leaves little to be desired. I"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRWFrOU5WVEZYVldsRVdVUXdkbVZIWW10MlgyYxAB",
            "text": "Comida muy buena, no tomo foto porque tenía mucha hambre pedí unos tacos y estaba exquisitos"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkb1NEbFVZMDl6YlVWSGN6WjBPR1pTTm1KbVJYYxAB",
            "text": "Very nice workers! Food looks great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bGNERnRWSEJHYVV4ME5teFFSVTVPYnpNdFkwRRAB",
            "text": "Love this place. Cant go wrong."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeWEyOVphR1JCUTAxRlpVNHhhMUE1YWpWU1VFRRAB",
            "text": "Fast and efficient."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swelRsbE1RVlpvYVUxZldXVlJPRUp4VkhWVmVVRRAB",
            "text": "Ordering online here is hit or miss. I ordered the vegan Impossible twice through Uber Eats and both times received real beef, and no one answers the phone to fix it. I’d recommend dining in so you can see what you’re getting. The food is good, but service could be friendlier."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poU1kxZGlkVXRrVFZkWGNtVlpaVGh3WW05WFpXYxAB",
            "text": "Great portions and the food is great, honestly prefer Guac time to Chipotle because they dont skimp on portions even when ordering online"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aE1VUm5ZbWd6Tkdsa1oyNXFWRE5QWkVSaFltYxAB",
            "text": "I usually do not receive bad orders from here , I ordered so many topping for my quesadillas and they just chose to go with there own I’m guessing ."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6X2NPRmFBEAE",
            "text": "If im paying $26 I should get more then basicaly half a bowl. My bowl had such little portions that the whole thing just took half the bowl."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWc3BmeDJnRRAB",
            "text": "Server did not understand english what-so-ever to the point where I waited 15 mins for fish that wasn't being cooked.\nWhen I finally got him to understand that i ordered the fish he couldnt ubderstand that i wanted guac on the food and was going to charge me extra because he thought I said I wanted it on the side."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBelpVVXdNVTF0VEhWd1NVTlFNRFZ0Tm1sdUxYYxAB",
            "text": "Food here is amazing. I always get the burrito with honey chipotle chicken and it’s sooo good — super flavorful and they don’t skimp on the portions at all.\n\nService could be better. They’re not rude or anything, just not the most welcoming. It feels like they’re just there to get the job done, which is fine, but a little more energy wouldn’t hurt.\n\nThe atmosphere is alright. Nothing bad, just kind of plain. Could use a little upgrade to make it feel more inviting.\n\nStill, the food is what keeps me coming back. If you haven’t tried it yet, definitely worth checking out"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVVptVnpaelZHT0ZRemVHczBkRWRWVmxOSGRYYxAB",
            "text": "Friendly worker"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYkx2LUc1bVpUZDN3RRAB",
            "text": "One of my favorite restaurants.   Great menu.   Great customer service.  Nice treats.  Open late."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMX3UwdnJDdk5DWmF3EAE",
            "text": "No pork kitchen for Mexican food... it just didn't sit right with me, and it was a bit pricey"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdmFURlpia1pKWm05S1FXWlZjV1ZtWWtsMFNXYxAB",
            "text": "This is my favorite Spanish place in the neighborhood! The staff are always super friendly, the prices are great, and the food is so tasty. My go-to dishes are el pastor tacos, fried calamari, guacamole with chips, and the fried ice cream — all so good! It’s the perfect spot to relax and enjoy a delicious meal without breaking the bank. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZTB0NEhLeXRlY013EAE",
            "text": "Amazing food, very fresh"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOU5uYmN3EAE",
            "text": "The customer service is horrible. The workers don't smile. they always look annoyed, and it is my second time going. I will not be going there  again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaEttaHdnRRAB",
            "text": "Let me start by saying the food was DELICIOUS, fresh, and portions were more than enough!\n\nI ordered the “BOGO” burrito bowls on uber eats until I realized it’s not really buy one get one because they jacked up the price of one bowl (so you’re still really paying for two).\n\nBut the food was fresh and tasty! Perfect spice level and the guac was fantastic."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcHRTSXpRRRAB",
            "text": "I usually buy guac time everyday for me my lady the hospitality is usually great....at the this particular location The service wasn't friendly and the host (lady) that serve me wasn't pleasant I wouldn't say all stores are bad but this one I didn't like my experience I think I might not buy food from you guys for a while"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdjVqQVp3EAE",
            "text": "do NOT order from this place through UberEats. everytime i order, they always leave out items from my order. whether they \"forget\" to include the chips i PAID for, or don't include the chipotle sauce, this is ridiculous. i can't even call…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc1ppS3pBRRAB",
            "text": "Recently tried this location and the food was so delicious. Everything was fresh and portion size is way better compared to Chipotle. The service is top-notch! I will be returning back for more and recommend everyone to must try this place. You will love it!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcklfUEJ3EAE",
            "text": "It’s good but at the same time overrated I thought the food wud be a bit distinctive but it taste da same as chipotle"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOHUteElREAE",
            "text": "love it here forget chipotle"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3djVYMWd3RRAB",
            "text": "The food is amazing! And the service is just as great, I highly recommend coming here especially since they’re open late, and bonus for my fellow Muslims is that this restaurant is HALAL!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OTZDd0N3EAE",
            "text": "jerk chicken bowl ($14) is good! added guacamole and the white sauce and chipotle sauce. also tried a chicken and beef birria taco ($10 for 2), but the meat was so dry and the dipping soup was average and skippable for me. Quick service! and saw better rating over chipotle (only taking online order in the store) and seemed too busy so came by to try this out. Limited seating, stopped by before a concert at king’s theater."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUM01XWF93RRAB",
            "text": "One of the best in new york city"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRenVqaFFnEAE",
            "text": "Delicious 😋"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfel9iV1dnEAE",
            "text": "Akin to Chipotle but fresher and larger portions. Get the burrito bowl. And their BOGO deal is a huge deal whenever they run it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdGNtSUtREAE",
            "text": "The portions here are incredible! I love coming here for late night eats!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmLTVDWnZ3RRAB",
            "text": "Literally the 4th time they forgot the sauce it’s not fair."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bHVIaE5BEAE",
            "text": "Customer service is fine.  Birria is rhe best here. The only thing was rhe chips  were stale.  Guacamole was excellent."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQamJ6RjRBRRAB",
            "text": "The food was absolutely delicious. It was seasoned to perfection. My compliments go to the chef. Oftentimes, I ordered Burrito Bowl, but this time, I wanted to try something different, and I wasn't let down . Future orders await ."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQLXJIMi1nRRAB",
            "text": "Great restaurant. Great prices. Great food. I go every week. Highly recommended."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzN0tUaFhnEAE",
            "text": "There is One waitress who insult the costumer i dont Know his name he’s tailller than other guys when the costumer want to buy something overther he increase the volume of radio the Guy he so bad if i was the boss i will get out"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNTdpdjhBRRAB",
            "text": "wow amazing food best i’ve ever had 10/10 would recommend"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcnAtc19BRRAB",
            "text": "Mi gusta! Never enough guac!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeHVuYlJBEAE",
            "text": "the “birria” sauce was just water and onions"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNXVHM2FBEAE",
            "text": "the food here is very good better than chipotle"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMWJyX1V3EAE",
            "text": "10/10 - The quality is fantastic and the staff is great. Ali made my bowl and it was fantastic to find a halal Mexican food place in Bay Ridge. The food tastes really fresh and way better portion than chipotle. This is a great fast-food/comfort food place in Bay Ridge where the food is also very healthy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbTdmRUN3EAE",
            "text": "Very delicious food. The portions size for the burrito bowl was huge. I got the grilled chicken and it was fresh and tasty. Definitely recommend to anyone looking for halal Mexican food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNnNxM2dBRRAB",
            "text": "Best halal Mexican food in the town. It’s a must try. Price is not bad at all portions are so big two people can eat one plate. Sauces are extra ordinary. Overall loved food. You will love it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabDlicEVBEAE",
            "text": "Ordered online and found it a little odd the way things are priced on the DoorDash app maybe there’s an issue, but when i did order it stated that i had to add a meat to my order which all of them cost extra. I added grilled chicken to my burrito bowl, however when i got my food there was no meat at all :( I also ordered a churro but it never came, food was good but was not satisfied with the missing items( quesadilla was good tho)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMklfUldnEAE",
            "text": "The store is clean & has seating nothing much to talk about in terms of ambiance or design just feels like a fast food spot at a restaurant stop. The service is really good as in the staff are patient and helpful but If this would have been my first time eating Mexican food I’d think I don’t like Mexican, for me it is a travesty to Mexican food. The tortillas they use are the worst quality & the soft ones don’t taste like corn at all where the hard tortillas taste like stale corn. The chips are aren’t good either & I actually just overall regret spending my money here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NXFfTXVRRRAB",
            "text": "Had the steak bowl from Guac Time on Flatbush Ave in Brooklyn.  Was definitely good and filling as you can see from my pics the bowl was filled with toppings. It's a good alternative if you can't get to Chipotle."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dmQ3Q3RRRRAB",
            "text": "The food was good they give a good amount of protein unlike chipotle. They had a lot of side options including chips. The service was also good. only thing is the salsa rojo is more of tomato sauce then it is spicy. I would've enjoyed it better if it was spicy. The guy at the counter told me to get the red one because it was spicy, but it had a sour tomato taste. 🫥"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNVo3NnpnRRAB",
            "text": "The food was very tasty and restaurant service excellent One of the best restaurant experiences of my life.Definitely recommend will go there again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNG96VGNBEAE",
            "text": "Definitely one of my favorite places to go to now! Food is absolutely delicious and the atmosphere is very friendly and nice! I ordered the rice bowl and loaded nachos and I’m absolutely in love! It is to die for! 10/10 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM0x6Z2hnRRAB",
            "text": "Our burrito bowls were amazing! We got the shredded chicken with white lime rice, pico, sour cream, Mexican cheese, corn, lettuce, cilantro and pinto beans! 😋😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMjZIS19nRRAB",
            "text": "Food was very good. It was a reasonable price, and the service there was top notch. Very friendly and homey atmosphere."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURud3RuY3J3RRAB",
            "text": "Hay gente ahi son malas para servicio al cliente te dicen que se acabó la carne de rez te dan otra te cobran 4 dolares demas, I recomend this place more than anything else the food is served better than any other place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSOFlhV3JBRRAB",
            "text": "I ordered on Uber eats and they def listened to my notes which I appreciate. Super delicious and the Cajun fries are so good. Loved the shrimp. Overall def will be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUc0tLSHRnRRAB",
            "text": "Wonderful place always clean and neat.  Great customer service, they will always go the extra mile to insure you are a satisfied customer. Will always recommend"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NHJHYmpBRRAB",
            "text": "The food was great! The service was great, and the place was clean! Layla took care of my order and she was very professional! Guac Time is a good time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaTZlMldnEAE",
            "text": "Love loves their food. Ao much better than chipotle and they even give u bigger portion. Their burrito and bowl ate awesome"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNHAzSUVBEAE",
            "text": "First time ordering from here and they just throw everything on there like a pig… the sauce was mixed in there like water everything tasted spoiled and sour so disgusting so disappointed never again horrible horrible horrible"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUM083TUVBEAE",
            "text": "I love their Biria tacos. I’ve tried this tacos for couple of times and all the time it was fresh and crisp."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUM002RE1REAE",
            "text": "Good service and very nice food I always come to buy food from here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdEx5Mi1BRRAB",
            "text": "Definitely worth every penny"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNk43SUtREAE",
            "text": "Amazing food! Zabiha halal - they get the meat from Hal & Al which is great because we don’t have too many spots as such in Brooklyn. Got bowls of Honey chicken, Grilled Chicken, Chicken barbacoa and beef barbacoa- all great can’t go wrong with any"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0NWZuVVlREAE",
            "text": "Flavorful halal Mexican food. Big portions and good price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaeU5ydEN3EAE",
            "text": "Ordered a grilled chicken quesadilla 😋\nVery good 👍🏾\nW lady came in with a big dog\nAnd had a attitude\nNot with food"
        }
    ],
    "reviews_count": 64
}