{
    "name": "Manchego",
    "place_id": "ChIJK-Ao3zZbwokRndVV8VgU_qs",
    "grid": "BK14",
    "address": "1502 Cortelyou Rd, Brooklyn, NY 11226, USA",
    "rating": 4.4,
    "user_ratings_total": 731,
    "phone_number": "(347) 425-8511",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGc1ozRlhPRk5sZUd4clVuaEhUMEpxYTNrd1dGRRAB",
            "text": "My friends and I returned to confirm our good first impression. The meals are excellent. The employees make you feel valued at this place. Each morsel melted instantly while I tried to make it last. All aspects demonstrate quality."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScGNYWXRUMFJCYVcxWlVIYzNkWFptWTNCeWVGRRAB",
            "text": "I’ve had dinner here the past two birthdays and I’ve enjoyed the food immensely both times. I love that you get two distinct dining choices here that you can mix and match. The skirt steak especially was delicious with the pork bun being a favorite appetizer of mine. I’ve enjoyed this place every time I’ve come here and I strongly recommend it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dVgxTjVUMDlLT0dwV1lXSkNaamwxYW5CbllVRRAB",
            "text": "Lovely tapas in an inviting atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneGVHdElNakZmY0RkMmFFWnVWR0Z2VjJkMldIYxAB",
            "text": "Loved loved this place! The bartender and all of the staff were very nice and the food and sangria was the best! Will come back very soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTFVEbDRNbmxuZDBSelRWUnJOVkJPTTNGT1lVRRAB",
            "text": "One of my go-to local spots. The menu is fabulous, the staff is lovely."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUmNFUTNiMlJOWlc1R1oybE5UMDVvYjB4b2JIYxAB",
            "text": "Right when we walked in, everyone was so friendly and welcoming. The food came out fast and was seriously delicious!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNN2pnYnZ6amZLMERBEAE",
            "text": "I enjoy the food here and the wine. I find everything reasonably priced and it's one of my go to spots in the neighborhood."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wM2VqUTJaRTFwUlhoS09HOTRia2xWZFhocVpYYxAB",
            "text": "This bar is my favorite neighborhood spot! I come here every other week to chill and enjoy great drinks.\n\nThe cold brew martini is my go-to. The bartender always nails it, and the quality never changes.\n\nThey also serve Spanish and Japanese food, and I’ve got tons of favorites: grilled salmon with cream sauce, fried calamari, takoyaki, seafood spaghetti, gyu don beef, and more.\n\nThe staff are always friendly, and the prices are super reasonable. Highly recommend!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQMi0tZVRNeWUzODV3RRAB",
            "text": "Great vibes, good food. When there's live music, it's a delight!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZmw1Y1RKMEx6all3EAE",
            "text": "I recently returned after some time and was impressed by the kind and welcoming staff. A special shoutout to Murat, the bartender, for his exceptional service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM1luWmZ3EAE",
            "text": "Great food. Priced for our wallet.\nExcellent service. We will come back soon"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcU1LTVJREAE",
            "text": "I live in the neighborhood and walked by this place many times but it didn't look like the food would be great so I never went in. But this time a friend was eager to try it so we went in. The place is a bit noisy (most restaurants are these days) and we were seated in the middle of a long table of other patrons. At first I thought this would make it difficult for me and my friend to converse but oddly it didn't. Maybe we just got lucky with fairly quiet people on either side. We ordered the cabbage pancake appetizer which was large enough for two people and really excellent. We both ordered ramen soup which was very good.\n\nA much better food experience than we expected and we will be back. It was a tad pricey but the ramen bowls and appetizers were average priced.\n\nService was fast and polite."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnenBLQzZnRRAB",
            "text": "Tapas are very little portion.\nI don’t think the price is justified.\nThe ramen is not authentic.\nThe vibe is good and servers are friendly.\n\nWould come back for drinks."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBX18yYnFBRRAB",
            "text": "Spanish lamb sliders were outstanding!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcnItamhRRRAB",
            "text": "Loving  it. Good prices and good food. Good people and a place that I love to come to."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRMzlfUWh3RRAB",
            "text": "Darryl and Murat are amazing... Food is consistently fantastic. Local spot where you can always find a neighbor to talk to."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmd2VQUUV3EAE",
            "text": "Great selection of tapas AND tasty ramen under one roof!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OEliWGdRRRAB",
            "text": "Everything is incredible except the music. Please stop playing this corny stuff I promise no one will snitch on you for using Spotify premium"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2c2NqcFhnEAE",
            "text": "Very Cozy Environment, Great Food, Friendly Service and Live Music"
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aXV6NXd3RRAB",
            "text": "Ce mix espagnol asiatique une tuerie 🤩"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdmFIbUd3EAE",
            "text": "Amazing black , good food and wine , bartender is nice person"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzak1pUTlRRRAB",
            "text": "Friendly staff, cozy ambiance, and good food. I’ve been here a few times and typically go for the same dishes grilled octopus, Spanish spaghetti, and salmon paired with aburino."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMk5ITWN3EAE",
            "text": "Nice place, nice people! I love it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuODd5Zlp3EAE",
            "text": "Nice place with good food. Delicious strawberry basil margaritas!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucGFmMEtREAE",
            "text": "The most charming local restaurant. Always a pleasant atmosphere, food is delicious. Octopus is my favourite. Murat makes the best mixed cocktails ever! And they have life music on Wednesday!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucGNmN2tRRRAB",
            "text": "Cosy atmosphere, quality food, tasty tapas. Murat, the bartender, is super nice and makes great drinks! A good vibe for the neighborhood crowd and visitors. Try their tuna tartar!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdHF6Y3ZnRRAB",
            "text": "Nice wark"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMnRiZEFnEAE",
            "text": "Highlights? There aren’t very many. The best thing about my whole meal was a cheese board which is pretty sad considering it takes minimal effort to put cheese on a wooden board. Not sure if they were having an off night but the teriyaki chicken came out ICE cold and was inedible. The chicken wings were as dry as the wooden board in the photo. Highlights the servers were very nice, the vibe and ambiance were amazing and they’re serving $6 well drinks for happy hour! The food however, less than subpar! My suggestion? Order a cheese plate have a drink but don’t order any of the  food coming out of the kitchen, it’s all inedible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIaEs3S3pnRRAB",
            "text": "Wine selection is great! Tuna tartar and ceviche are pretty tasty! Cute date spot! Staff are welcoming!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOeS1HZlZREAE",
            "text": "I’ve been here about 5 times. The food is okay, my friend enjoys the cuisine much more than I. The place itself is really nice, nicely lit and interesting decor. I did have an unfavorable encounter the last time I was there. The waitress stood by as the card was inserted and then demanded that we leave at least 18% tip. However she did not say that to any of the other customers who had left before. Haven’t been back since then."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiakw3bnBnRRAB",
            "text": "We only had drinks, but loved the vibe!❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyamJEY21RRRAB",
            "text": "great place, used to be my dads favorite bar when it was hurleys in the 60s and 70s"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMXVmdFNBEAE",
            "text": "Manchego restaurant is a gem in the local dining scene. On a recent visit, I enjoyed the Benzino fish with asparagus, and it was absolutely delicious.If you're looking for a welcoming spot with fantastic food, Manchego should be at the top of your list"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMczcybnZBRRAB",
            "text": "I went with my daughter and we had dinner and drinks she had the peach mojito and I had the strawberry margarita and I loved it. The bartender was a cutie as well as making great drinks. Would highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNmRLRnF3RRAB",
            "text": "Wish i could have liked the place. The people working were nice, the atmosphere is perfect for a date night, the food on the other hand was a complete miss. I had the ramen and it was salty, i mean SALTY. I thought Bloomber put a cap on salt use in NYC. This place did not get the memo. The pork in the dish was ok. I could have sworn the broth was made from a premade ramen soup base packet and watered down. Got bacon date, I had high hopes only to be crushed. Ordered the brussle sprout with bacon, because it smelled nice from someone elses table, what a dissapointment. Did not eat more than 2! I did eat the bacon that was on top. The other item that was ok was the octopus balls. A bit chewy but considering the other items I think it was the high light of dinner. Needless to say, we left the place and got a crispy slice at Lea's. Walking around there seem to be plenty of places that are much much better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MnN6YmJnEAE",
            "text": "I loved everything about this place. The service was amazing, the food was absolutely mouth watering, the atmosphere is very laid back and casual. I highly recommend giving this place a visit if you happen to be in the Flatbush area of Brooklyn. It's literally a 15 minute walk from Kings theater."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMjhfcTNnRRAB",
            "text": "This is a local spot that punches well above it's weight. They serve great food and have some classic cocktails on the menu. Don't go out of your way to go but if you are in the area definitely check this spot out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUa1pIQlVnEAE",
            "text": "Salmon Special was perfect for meal for Mother's Day! In addition to Tapas options. Best place in the nabe!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeDZqZGtBRRAB",
            "text": "nice neighborhood spot. restaurant is cozy, food use a bit more seasoning. spanish spaghetti was decent, calamari was expensive but wasn’t fresh. the drinks and atmosphere were the winners!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREck9IMVpnEAE",
            "text": "Food was very tasty and fresh"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1eExQNkJ3EAE",
            "text": "I came back to edit my review. After giving this place another chance, this is truly a gem on courtelyou. Shoutout to the waitress who served us the weekend of our anniversary."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkN3N5X0ZREAE",
            "text": "Went here with my partner the service was alright, we had 3 dishes, they octopus with potatoes which was great, some kind of shrimp and a big eye tuna tartar. The shrimp was ok but the big eye tuna tartar was off...... and sure enough later that night me and my partner got a wicked seafood poisening!! It took me a total of 4 days to get over and i feel like my stomach has never felt the same. We called the restaurant to let them know just to check and make sure that no one else got sick or was at risk... the person on the phone seemed to be more bother by the call than concern i  will never go back to this place!!! 1st and last time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbXYyVGpnRRAB",
            "text": "I really liked this place, it has a nice cozy atmosphere and interesting interior with a lot of unique details. There are separate tables and bar counters. Their menu offers a variety of delicious treats, from ramen to steak. I definitely recommend it, and come here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0azZ6MEtnEAE",
            "text": "One of my favorite bars to go to with my friend the bartenders are so kind and give honestly some of the best servers I’ve gotten in New York City. The food is so good. Me and my friend always get the patatas bravas to share!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROOV9pT01nEAE",
            "text": "Stopped in here because the kitchen was open later than average for the neighborhood. Atmosphere and staff were pleasant enough, not too loud but steady buzz.\n\nDrinks were pretty good - we had a glass of wine and a Mezcal Mule, the latter of which was flavorful and not too watered down.\n\nThe food, unfortunately, was not great. We got the asparagus (just regular asparagus with a smidge of orange romesco sauce), patatas bravas (cooked okay, but drenched in ketchup and mayo), pan con tomate (just two pieces, underseasoned), mussels (best dish we had, spicy flavorful broth, cooked properly), and the skirt steak (overcooked, mushy, tasted like dog food marinated in ketchup, although the fries were good)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNTdqNGR3EAE",
            "text": "I stopped by today for the first time for lunch. When I walked in, I immediately loved the ambiance in this place. The waitstaff is extremely friendly and attentive, and the food and cocktail that I ordered was fantastic. They have a very interesting food and drink menu, and the prices seem pretty reasonable. I will definitely return in the near future."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNeUtudVhBEAE",
            "text": "Food is decent. Their appetizers are good. We ordered pork belly bun, pancake and chicken wings. One thing I need to mention is make sure u mix the ramen up before eating. All the sauce remains in the bottom."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbmVMNFV3EAE",
            "text": "Made it in time for happy hour which is 5 to 7 everyday, which we were unaware of but the server brought it to our attention. You get a lil appetizer as a side with your ramen which is great. They were very friendly and attentive with us.…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4c0t1cWNnEAE",
            "text": "Absolutely delicious. Stays up to the standards of catalonian tapas. The Nagoya wings were crispy and tangy, the lamb burgers were full of flavor and perfectly constructed. the crisp texture and seasoning...just look at it! And the Spanish spaghetti was delicious as well! Drinks were bomb too! I'll be coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOXFXS3V3RRAB",
            "text": "This should have been a five star review. Atmosphere is clean, friendly and relaxing. The cool lighting and tree branches overhead make for good ambiance.\n\nI sat at the bar and asked the bartender what drink he had just made for another person at the other end of the bar. He told me it was a Manchego sour which was very refreshing and hit the spot.\n\nI ordered the tosta de setas y queso which was amazing. The bread was grilled to perfection with melted Manchego and mushrooms. Loved it, the cheese, bread and mushrooms blend together nicely for an explosion of flavor.\n\nI then had the seared tuna salad which was also delicious. The only downside is that the mangos were not ripe. They were hard and unsweet. It took away from the overall tasty and satisfying dish. The tuna, quinoa, greens were all fantastic. Given the mangos were so prominent I deducted a star.\n\nLastly, the bartender was wonderful and mixes a great cocktail. Overall, I loved it and look forward to coming back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNeE9iRnhRRRAB",
            "text": "Ok food. Yum duck bun. But a little pricy. In Manhattan two buns are 8 for two, here 1 for 6, but delicious 😋. Cozy interior, very small, fast service. Portion of Ramen is small to my taste. Not filling.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJeEtPQzVBRRAB",
            "text": "Tapas restaurants. We came during happy hour. Good size place, bar seating and regular table sitting if you have kids. Parking of course is not easy so we just parked a few blocks away at the neighborhood area about 5 min away. Food & wine selection was good."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnai1ha3RBRRAB",
            "text": "2023 update: I can’t say how many times I’ve been here since my first review, but NEEDED to mention how the octopus dish is always SO soft and AMAZING!!\n\nPreviously: Excellent foods at very reasonable prices. Great vibes and ambiance. Super service."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbl8taGNnEAE",
            "text": "Not sure how long this place has been here but my wife and I discovered it only a few days ago. They have life Spanish guitar on Monday heights and live flamenco dancing on Wednesday nights. The bible in here is super warm, relaxing and…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMzdPYjFBRRAB",
            "text": "Had a very nice dining experience here would give them 4 1/2 stars. Wait staff were friendly and definitely recommended the correct amount of dishes without trying to oversell anything. They were also great about checking on food intolerances. The food was solid! Tuna tartare delicious and nice combination with the mango and avocado. Found myself wishing for a few more mango pieces. The Potatoes Bravas was legit and similar to what I’ve had in Spain - wished it was just a little more sauce - but guess that’s personal preference. The Octopus was the star of the evening it was pretty much perfect and would highly recommend it. The Iberico Salichon was tasty and loved that it came with a side of seasoned olives. Drinks were great!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdzVQM0hREAE",
            "text": "Ramen was very yummy and flavorful. Duck was so tender and good. Salmon was tender. It was nicely seared. Broth is on the saltier side but flavorful. We had the tonkatsu very nice broth. The okonomiyaki was very thick and very cracker…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzcXB5amhnRRAB",
            "text": "A little on the saltier side but still very delicious!! The place is small but perfect for couples. Keep in mind it is Cash only! Also customer service was awesome and I cant wait to go back"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBMDltVndRRRAB",
            "text": "Koko Ramen is such an important neighborhood place at this point. They have about 9 ramen options and one special. For appetizers, they have 3 or 4 options for bao buns and other general app options. They only have one veggie ramen, but it…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvbnRTWjd3RRAB",
            "text": "My little neighborhood ramen place is only the size of my bedroom. It never disappoints, the staff is blissfully nice. All of the ramen is solid and slurping is more than accepted. The veggie ramen is bold, flavorful and has mushrooms aplenty. When in ramen restaurants, drink Asahi duh🍜🍺\n\n@ahag"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdzcyenpBRRAB",
            "text": "Drinks were ok i give it 6.5 definitely worth the money. food was also okay i rate it a 7.5 :)"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBZ0lyMHlBRRAB",
            "text": "Amazing duck ramen here. I bit on a salty side but awesome. However, the ramen never seems to be hot enough even if you ask. It's like they pour it over icecold noodles or something."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMktlVFlnEAE",
            "text": "This has been my best brunch experience in a long time. We had sangria of course and it was potent and powerful. I wouldn't call this fusion but my partner believes it should b3 considered Mexican fusion. Everything tasted fresh and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPZ29iY3VRRRAB",
            "text": "This is our go to spot for food and drinks. My kids love the ramen, rice bowls, lamb sliders, and guava lemonade. I love the octopus and ceviche. Drinks are always strong yet well balanced. The bartenders are very attentive."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNld3JiRjVBRRAB",
            "text": "This is a neighborhood  spanish favourite.  Great cocktails, their strawberry basil margarita is a favourite.  I often get the fish tacos pictured here because they are filling, lightly battered fried cod with a mild spicy and tangy sauce.…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3dG82cDlRRRAB",
            "text": "A beautiful setting I love it, but the food not what I expected. But the bartender awesome guy after I had my dinner I went to the bar had Two Jack honey Manhattan and we spoke about everything and anything."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvN3JEX1BnEAE",
            "text": "Great for a distinctive late-evening bite or a light meal of sausage, ham and cheeses sourced mainly from Spain. The namesake cheese in a platter we ordered looks ordinary but lights off a happy dance in the mouth. An artichoke appetizer is…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScE9ETTlBRRAB",
            "text": "Absolutely love this place!\n\nThey have a really unique offering of a mix between Spanish Tapas and Ramen. The Tapas are high quality, but can be on the pricier side. The Ramen I love to get is the Curry Ramen, and if you’re vegetarian they have options for you as well.\n\nI love going here and go AT LEAST once a month.\n\nVery cozy vibe regardless of day or night.\n\nWould highly reccomend them."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncXIycFdREAE",
            "text": "We have visited this place at its opening, and it had best ramen I ever tasted. Now a year and a half later?NOT any more. The noodles now are of incredibly poor quality, same tasting as a 99c noodle cup possibly even from a 99c noodle cup,…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZajZ2RF9nRRAB",
            "text": "Save your money!! I love Ramen soup , but this place sucks. I spent almost $20 for a flavorless soup. This was cheaply made and I am appalled at the fact that they are so expensive for such little food. I've been to way better places in…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbzRpUUxnEAE",
            "text": "I took my wife out for her birthday dinner here to Koko Ramen. She's been wanting ramen and this place did not disappoint. We each got our own bowl of ramen and it was fantastic. I got the spicy pork belly ramen and it was the perfect…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZdlllYklnEAE",
            "text": "Manchego is a wonderful food experience. Just walking in puts you at ease with the relaxed atmosphere and chill vibe of the staff. I ordered the brunch special which looked amazing and tasted even better. I had to pace myself because the food is so good yet deceptively filling. For sure I'll be back to try the rest of the menu."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdXMtOF9BRRAB",
            "text": "I called Koko ramen in advance 20 minutes to order two chicken ramen. I checked the menu; there was $13 for each; I prepared cash and headed to the place. I live precisely 20 minutes by walk from the Koko Ramen. When I got there, the barman told me that the order is not ready and ramen cost $17 for each. And now I have to wait for my food to be prepared. My boyfriend and I got a second shot of the vaccine, and we feel very ill, but we decided to go out and order the food in advance. But instead of that, we are sitting over here, paid more than we expected, and still waiting for food. You can't treat customers like that, disgusting service; I'd encourage my neighbors not to go to your place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcGFyUDJBRRAB",
            "text": "We hosted our wedding brunch at Manchego. Excellent service, excellent communication and fair prices! Delicious food and ambiance is great. Thank you"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOLXFQSC13RRAB",
            "text": "Every dish full of flavor, romantic and interesting dining room!!! Will definitely come back"
        }
    ],
    "reviews_count": 74
}