{
    "name": "Bordeaux Steakhouse",
    "place_id": "ChIJq3ogpOtEwokRKoIeubTWEoc",
    "grid": "BK14",
    "address": "1922 Coney Island Ave, Brooklyn, NY 11230, USA",
    "rating": 4.8,
    "user_ratings_total": 1689,
    "phone_number": "(718) 942-4040",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcWNtTkZNWGM0VDJOU1MwcG1SVlJmVWpSVFkxRRAB",
            "text": "Everything was outstanding!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMlduSldiRU4wZGxCWFFrUmplRWd4VG1sVExYYxAB",
            "text": "Killer steaks. Nice dry aged ribeye. They do great for black and blue. Understood what I wanted. Asparagus was fantastic. I will never forget the Potato mash"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvc0lHNjdRRRAB",
            "text": "Good atmosphere"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbE5ISldiVmhvV21kdlJFUmxPRE5GUkU0dFMyYxAB",
            "text": "We came following friends’ recommendation, and it was an incredible experience.\nThe restaurant is beautiful, with a refined atmosphere and elegant seating.\n\nStarters included a perfectly dressed Caesar Salad, flavorful Beef Tartare, and a Short Rib Taco bursting with taste. We were also treated to delicious meat cigars with two excellent dips.\n\nFor mains, we enjoyed a 6-week dry-aged entrecôte, a surprise steak that was tender like butter, and a prime rib that stole the show. All cooked to absolute perfection.\n\nDesserts, chosen by the chef, were outstanding – a rich chocolate soufflé, a dairy-free mille-feuille style cake, and a refreshing lemon treat.\n\nThe attentive chef, relaxed atmosphere, and top-level food made this an unforgettable dining"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSWNsRXlaRXRHVG5KTVQyVlFjWGx5VjFFNU0zYxAB",
            "text": "Thank you Bordeaux for the most exquisite  anniversary dinner ever!\n\nWe had an awesome time from beginning to end. The maître D’ was so courteous and patient despite the packed house she was contending with (reservation recommended), the steak and apps were divine and cooked exactly as we wanted them, and the wait staff were attentive and helpful.\n\nRecommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvelgxcHJlREJ1ZW5keFIwWXdUalk1YVdwTmFGRRAB",
            "text": "Pretty good food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gb1JXWjFiM1pQTWxSeVVHeG9OR3B4V0hOeFEzYxAB",
            "text": "Amazing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNWQweHpWRzh4UkhCSWRYaFRjVVZMUkU1MFRHYxAB",
            "text": "What an amazing place they gave a free steak for my birthday!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNk9VZHdia2x0TTI5WFdEQk5Nbkl6ZVZSbmFVRRAB",
            "text": "Great food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQmJXZGpOMjF0TkhwU2VGTmxWM2xMZUVGSk4wRRAB",
            "text": "Amazing place hoping they will be in the neighborhood for a long time ⌛️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sa2FWOHdNM1Z4YVVWWmNUQlBkbW8yTlVOQlpsRRAB",
            "text": "Lovely night"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbDcyZTBnRRAB",
            "text": "⭐️ 5-Star Review for Bordeaux Steakhouse ⭐️\n\nEvery visit to Bordeaux Steakhouse has been nothing short of exceptional—whether I'm there with my family for an intimate dinner or hosting large gatherings in their beautiful private room. It consistently delivers an outstanding dining experience.\n\n🍽️ Food\nThe steakhouse’s menu offers an impressive array of beautifully prepared dishes. Their signature cuts are always perfectly cooked—juicy, flavorful, and tender, every single time. Complemented by creative starters and fresh, vibrant sides, each dish strikes the right balance of indulgence and finesse.\n\n🍷 Wine & Drinks\nTheir wine list deserves special mention: thoughtfully curated with both classic and adventurous selections, it’s easy to find the perfect pairing for every meal. The cocktails are expertly crafted, showcasing both traditional favorites and inventive new flavors. Wine enthusiasts and casual drinkers alike will be delighted.\n\n👩‍🎤 Service\nConsistent, warm, and impeccably professional—that’s Bordeaux’s service in a nutshell. The staff instantly makes you feel welcomed and attended to without ever feeling overbearing. Whether we’re coordinating courses, checking dietary needs, or switching wines, the team executes it all seamlessly.\n\n🎉 Private Room & Large Parties\nI’ve hosted several events in their private dining room, and the Bordeaux team always delivers. The space is elegant and intimate, with seamless flow for food service and clear, discreet communication from the staff. Our guests consistently rave about the atmosphere and attention to detail.\n\n---\n\nIn short:\nBordeaux Steakhouse continues to impress on every front—culinary excellence, superb beverage selections, world-class service, and impeccable event hosting. It’s become my family’s go‑to destination for dinner, celebrations, and cherished moments alike. Highly recommended for anyone seeking a top-tier steakhouse experience."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ScGRVVm1TWE5FU1Znd1ZFOUhWWFpsYlc5RFpVRRAB",
            "text": "I love the steaks here !\nBut service is slow\nYou really have to wait a lot to get attention!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMlJHWlJXRnA2ZUhWUmQwRnJNRkZ1U2xkR1JVRRAB",
            "text": "Excellent food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRUxYY3hVbWRNU1ZVNWRqQkhZVXQ0WVV4MlRIYxAB",
            "text": "amazing food and elegant presentation. upscale and affordable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobVNUaEdlR3d6V0ZCWWF6UTRZbWhLZEhKbGMyYxAB",
            "text": "Ambiance ✅  excellent service! Jamal and entire staff very friendly and accommodating, food was flavorful and tasty"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KblNYVllSR0pOYW5jelJubGhPVzUxVTFjNU5GRRAB",
            "text": "Every dish was superp!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ck1IWm1kMHRYU0VOWlVrVXhNWEpqVHpKM04yYxAB",
            "text": "My boss took us to this amazing place a few years ago and I’ve been craving it ever since! One of the best meals I’ve ever had."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeFZraFVMVVJUYWtZeGRUbHVPVFp0UVdWQ2MzYxAB",
            "text": "Perfect ambiance for a special night out. Professional and caring waitstaff. Delicious food. Never had cigars like these."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJdnp1ZnFfaUt6UWV3EAE",
            "text": "A beautiful and upscale meat restaurant. The staff is attentive and kind, and super helpful. The food was delicious, fresh and served quickly. I will definitely be back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNU9FRnRPSGQxVDNSaldFODRhSEJTZGt0Q2JWRRAB",
            "text": "Came for a company party and everything was fantastic. All of the foods served were really prepared well, servers were professional and helpful and everything is beautiful, clean and well maintained. This is a superior dining experience!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJem00TmlUMkpIeE1BEAE",
            "text": "Everything was perfect."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJV1Eyc3J4N05hQ213RRAB",
            "text": "Food and ambience is great.\n\nRIMA and her team, are supper attentive, and go the extra mile to ensure your experience is 10/10!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPUHozWnJNdmNXRTV3RRAB",
            "text": "A quality and luxurious meat experience"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcHV1akt3EAE",
            "text": "We had a great time at Bordeaux. The food was beautiful and delicious . And the service was amazing!!! Highly recommend this place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeGZxOUJBEAE",
            "text": "Best kosher steak house in Brooklyn"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJa29lcWdnRRAB",
            "text": "Went for a friend's birthday. The steak was grilled to perfection, medium/rare. Everything, from the ambiance to the service to the delectable food, was exquisite! Definitely recommend this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbHJPZ0JnEAE",
            "text": "Great food, great service, nice ambience, I’ve recommended this place to other friends of mine and they loved it. Overall great spot."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdEtxbnlnRRAB",
            "text": "Delicious food!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ak92SDZ3RRAB",
            "text": "They made a mistake with 1 dish, and they took full responsibility!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dzR5QzZRRRAB",
            "text": "Very good food. The candied bacon appetizer and Ceasar salad are very good. The short rib app was mediocre at best and was dry and somewhat tasteless. The lamb chops are excellent if you like on the fatty side, and smoked ribs were very good. For drinks we got a spicy drink (very spicy) which was delicious and strong, and another sweet purple drinks, it was too sweet. We also got the brain damage shot which was very strong and tasty."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNTVmUk1REAE",
            "text": "Great Food!! Great Vibe!! Great Service!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRd3B5VGpBRRAB",
            "text": "Great atmosphere\nGreat service\nGreat food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnb2RPdnpRRRAB",
            "text": "Delicious food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbXJTRmJREAE",
            "text": "Amazing food amazing service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBazhfMGJnEAE",
            "text": "Special place"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbG9lU3JnRRAB",
            "text": "Very good food went there for a birthday party we had 60 people. Steak was delicious and so were the appetizers."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVeV9hMGdnRRAB",
            "text": "Delicious appetizers with some good drinks"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dE56LWlBRRAB",
            "text": "Went for our anniversary. We put that it was our anniversary in the comments when making a reservation but they didn't acknowledge that we added anything, which was a little disappointing.\n\nAside from that though, the food and service was great. We had the gnocchi app which had lots of meat and sauce. For dinner I got the pepper crusted steak and and the beef Wellington. The pepper steak was delicious and came with a side. The beef Wellington was also incredible but didn't include a side. For dessert we got the perfect couple, which was a hazelnut dessert and soooo good! Would definitely come back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OHFxcUd3EAE",
            "text": "The meat was really delicious cooked to perfection!\nAppetizers was next level!!\nService hit the spot!\nLittle too squishy\nVery clean store."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocTdmQUt3EAE",
            "text": "I recently dined here and overall, I had a positive experience. The food was delicious, with perfectly cooked steaks and sides that complemented the meal nicely. The atmosphere was also elegant and sophisticated, providing a great dining experience.\n\nHowever, it's important to note that the prices at this steakhouse were quite high. While I understand that the cost of dining at a high-end steakhouse can be expected to be on the higher side, I did find myself taken aback by the price of the meal.\n\nDespite the cost, I still believe that the quality of the food and the overall experience were worth it. If you're looking for a special occasion restaurant or have the budget for an expensive meal, I would definitely recommend this steakhouse. However, if you're on a tighter budget, it may not be the best option for you.\n\nOverall, my experience at this steakhouse was excellent in terms of the food and atmosphere, but the cost is something to consider before making a reservation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUc3JTczdnRRAB",
            "text": "Let me start by saying that service and atmosphere was nothing short of superb. Unfortunately, the food was a mixed bag. The desserts were great. I especially enjoyed the lemon tart I had. The steak, potato fries, and the chicken soup were a bit of a letdown. While it was not terrible, it was not great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbnJyRVhnEAE",
            "text": "Celebrated a birthday with a large party and had the most amazing experience! The service- Yair rocks! The food- mouthwatering! Chef Mendel - we cant wait to be back! Highly recommend this place. Every single dish was cooked to perfection (and we pretty much had every item on the menu)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVakk2ZUR3EAE",
            "text": "I ate here for the 1st time this week and I was blown away by every dish I tasted. The food was absolutely delicious. The staff were super helpful and friendly. This is definitely not my last time there. I have found my new favorite place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNzRqc2lBRRAB",
            "text": "This place had very good food. My wife and I personally weren’t such big fans of the liver but the Smoked Ribs were DELICIOUS! The reason I gave four stars and not five, was for our experience at the place (not food). We were seated in the back which was great, thought we’d get some quite there, but boy were we wrong! Two tables down sat two women (who were clearly intoxicated) talking and laughing loudly, and to our surprise, the two hosts that night were encouraging it and laughing with them as well and continued throughout our time there. It’s was very unprofessional and disturbing to our evening as well as to the couple next to us. A really shame to be honest…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNnNMdmRREAE",
            "text": "The food & drinks were fresh, tasty, and delicious.\nThe service was amazing. We had Shaken as our waiter, and she did a fantastic job.\nThe place was nice, calm, and clean."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCb3NpNGxnRRAB",
            "text": "Overall restaurant is good.\nWhen we order the stake no body ask what kind meat we want they just made well done .…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzNHVEZUR3EAE",
            "text": "Phenomenal New York steakhouse. This is the first time I've been here but I was really impressed. They go toe to toe with all the other New York City heavyweights... Exceptional service and even better food. Valet parking is also huge. Our waitress Shani was outstanding. Highly recommend. Definitely going to come here again! Keep it up!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbE0zaFdREAE",
            "text": "We had a Siyyum tonight. All our guests were wowed by the presentation of the food. The delicious and abundance really added a special touch to our event."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRczRMYUhBEAE",
            "text": "This is not my first time at Bordeaux, but it is my first time trying this new menu and we were not disappointed!\n\nWhats great about a restaurant that is always updating their menu seasonally is that you get to basically go to a new place each time you go except you also know you can expect the same great service and quality, not to mention they kept lots of our favorites.\n\nOur waiter then suggested we go in on the apps since we had not tried the new menu and he felt it would be a good way to try it all with out overdoing it too much. We had them all, yet again, and even after promising my self I would only have one bite of each, their flavors proved impossible to resist and we demolished them one after the other.\n\nOverall we were really impressed with this new menu, I always want to see our local Brooklyn Kosher scene get better and better and it looks like I am getting my wish with Bordeaux’s new additions to the scene. The whole meal was a great experience, the waiter Adonis, really was able to anticipate our needs and really helped to make it a night to remember."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtenVEOHpRRRAB",
            "text": "Definitely one of the best restaurants in the area!\nThey making everything indoors!\nStart from the Beef Jerky and to the aged steak and to the desserts !!\nWe got couple different courses.. couple different types of homemade beef jerky, truffle Beef tartar, fig carpacio, Qatayef stuffed with beef, Sweetbreads with potatoes paste and a wine sauce, and then there steak with Bone Marrow. unbelievable.\nAnd of course dessert!! OMG!!\nAnd don't forget to get cocktails they are so good!!\nfollow the pictures.."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZc19uZ25nRRAB",
            "text": "We visited here for the first time tonight with our son and daughter in law.  They have specials and tonight was no different. Luckily the special was a Surprise Steak (Google it) which was delicious and tender. We had some mixed drinks and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNVp6c3lRRRAB",
            "text": "Had a great experience at Bordeaux tonight.\nThe smoked short rib tower appetizer was amazing.  The fried onion crunch went perfectly with the incredibly tender short ribs. Top tier appetizer. 9/10\nThe sweet chicken fingers were also great, slightly spicey and just the right amount of tanginess. 8/10\nService was quick, efficient, and orders came without any delay. Attentive service without being in your face.\nThe prime filet steak was great, but didn't live up to the high expectations set by the appetizers. We ordered medium well and received medium. Tasty but didn't really stand on its own; was much better with their (delicious) provided sauces. 7/10\nBourbon Smores desert was great. Perfectly prepared with delicious ingredients. 9/10\nWe may be spoiled from our NYC home base, with so many great steakhouses nearby, so we may be overly critical.\nOverall 8/10. Great experience. Only ten minutes from home, so I will certainly be here again soon"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNWY3WVV3EAE",
            "text": "Was there for a business meeting, didn’t have time to go to Manhattan. There is no reason to go to Manhattan if you live or work in Flatbush. Bordeaux has really taken their entire restaurant to a new level. Ambience is excellent. Service is fast and professional and the food was well prepared, well plated and tasted great. Keep it up guys."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncmRPS2FnEAE",
            "text": "This place is amazing, delicious food, and great service. I would say is the best kosher stake house in Brooklyn. This big guy there who serve me makes me so in the mood and the owner Shay is so friendly, hope to come back more often."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQb2VpVWdnRRAB",
            "text": "Perfect place for good steak. Burgers and the truffle gnocchi also great taste. Most recommended"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDMUtMTWFREAE",
            "text": "Impressive steakhouse! The food was so tasty, Goodness! That Tomahawk steak... 👌Pleasant and calm ambience with kind and attentive waiters. This is my new go- to place! Thank you Bordeaux for an amazing experience!!…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2N2ZXZmFBEAE",
            "text": "Had a fantastic time here. Appetizers: gnocchi was heavy on the truffle flavor in the best way, fantastic. Rib/onion cake was fun and delicious. Chicken/waffle was so good, especially with the smoked maple syrup. Empanadas were not exciting. Tomahawk steak was insanely good. Wasn't crazy about the sangria. Pina colada daiquiri was... Well, a daquiri! Sweet and refreshing. Ambience was a total winner. Great place, and well worth the cost for a special celebration."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdGRIZ2J3EAE",
            "text": "The food is great: amazing beef stakes. The staff well-trained. The only thing I didn’t like is that they include 18% of service charge to the check. I definitely leave tip, but I want to decide the sum myself."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcElmVUFnEAE",
            "text": "Great ambiance, amazing service, and delicious food!\nDefinitely coming back:)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZ2V5VGxRRRAB",
            "text": "Very very good place to go out, good service and delicious food\nHighly recommended"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrcFlibmh3RRAB",
            "text": "The staff is amazing the food is very nice plates and good well managed keep it up there aren't much kosher restaurants like this it's worth every penny will come again"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdzdLdTdBRRAB",
            "text": "Great food great staff very comfortable place to eat!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZaTkycklREAE",
            "text": "Great Place food was heavenly delicious, service was above and beyond!!!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyeTQySVlBEAE",
            "text": "Very good food! and very nice service!\n(Shouldn't have charged for water...) went again very good service! (Just waited a little to long for the desert) but overall very good experience!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxOG9iNFNBEAE",
            "text": "The vibe, service and hospitality was exceptional. Very friendly and perfectly balanced between being around for service but not being on our backs."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNWE2bkRnEAE",
            "text": "Food is amazing meat quality and taste of steaks are superb service is excellent pricy but worth it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6clppa0pREAE",
            "text": "Delicious Food. Steak was 5 out of 5. Service was great!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRak1YOVlBEAE",
            "text": "From the innovative appetizers to the delectable desserts, had a great experience here while attending a birthday celebration with a large group - and I definitely sampled almost everything that was on the table! The pulled brisket tacos were super tasty and was very impressed with the presentation of the liver kadaif appetizer.  I also had to taste the smoked short rib tower served between onion rings and topped with BBQ sauce. The truffle gnocchi and aged beef carpaccio were also big hits.\n\nThe room was upscale yet comfortable and everything from the food to the service was very detail oriented. While they offer a varied menu featuring an array of dishes from fish to veal chops, I of course, had to taste the steaks including a chateau and 25 oz prime rib which were both tasty and tender and cooked to perfection. The Belgian chicken waffle special served with a sweet sauce was also definitely worth the calories! The chef is a true culinary artist - the unique flavors and gorgeous plate decor made for an extremely memorable evening.\n\nThe bourbon s'mores were a chocolate lovers paradise and was also beautifully presented. The staff is extremely attentive and was super accommodating both before and during the celebratory evening.\n\nI have to say this ranks at the top of my list for not only the best kosher steak around, but overall experience. The complimentary valet parking was also very convenient. Highly recommend and will definitely be back!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBc0t6VllREAE",
            "text": "Amazing delicious fresh food\nBeautiful plating with style\nFragrant elegant high class\nGreat temperature cook on the steaks\nJuicy chicken dishes\nDelightful elegant desserts\nAmazing friendly helpful staff always with a smile\nGreat drinks & cocktails mega bar\nThe manager's are fantastic\nHighly recommend steakhouse for all you're occasions\nQuiet relaxing place with some music in the background\nAn amazing experience everytime I stop by"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnd3I2bDZRRRAB",
            "text": "One of the tastiest meat restaurants in New York. The service is so fast and courteous, excellent. The atmosphere is beautiful and intimate. One of my favorite restaurant.…"
        }
    ],
    "reviews_count": 71
}