{
    "name": "THE GARDEN AT DITMAS",
    "place_id": "ChIJi-kIc5FbwokRCSA1cXofy0g",
    "grid": "BK14",
    "address": "1108 Cortelyou Rd, Brooklyn, NY 11218, USA",
    "rating": 4.3,
    "user_ratings_total": 139,
    "phone_number": "(347) 365-2968",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNGVWSkNlRE5zWkV4MlpWTlZZbmhyYjBaRFZXYxAB",
            "text": "Lazy worker"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0emVGQjVUelZMWnpJdFJHSktTa2RRYUhaeGJXYxAB",
            "text": "Poor service"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMlFsaHFWakZtUTFsSGVtSm5UakZuZVdnelZtYxAB",
            "text": "Take so long"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORFdHRllhbWR4YkVkNE9XOWpiak5UTldOTVVsRRAB",
            "text": "Bad service take long time"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTllYTjVNR293TUZReGVtTTBRbXBIWjFaWVNYYxAB",
            "text": "Today I have bad experience  long time waiting my food"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnemMyUnVhMVJQUzJ4bWNWSXROMk5MV1ZCT2QwRRAB",
            "text": "They don't care how long you wait"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSmVVcE9Oak5aTkZwcFpqaG1TRmxVVVRWRVlVRRAB",
            "text": "Long time waiting"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STGFHUnhkVXBtVkZwYVRXZDZVelJQU1Vwa01uYxAB",
            "text": "Employees are to much slow"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNFlXTjBPSE5MZFdGTFZuVjNUa1pDTW5kWmFWRRAB",
            "text": "Poor service"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQmVIbDBNa3RJTUZwVlMwWmlSVlZ6UzFOUk5GRRAB",
            "text": "We are HUGE fans of The Garden. Takeout salmon poke bowls are a go-to. When we dine in, I love to get the ramen.  The broth is super rich and the noodles are cooked perfectly.  The server is always friendly and attentive, really warm vibe in restaurant - a true gem in the neighborhood."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaVdHeE9kV3h1ZUd4Uk1tMURNbWQ1VG0xU1ExRRAB",
            "text": "Frivolous... Boring .. but not bad .."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRWVFSlNWWHBhTTB0ZmF6RXhkRkpqTlVOS2VHYxAB",
            "text": "My husband and I stopped here last night for dinner but I really wish we had kept walking to Kumo… music was pretty awful: Maroon 5, Train, Counting Crows.  Plastic flowers in the garden did not add to the ambience.\nService was a little slow and uneven, especially with drinks.  Gyoza and ramen were both tasty enough, but caused intestinal distress to both of us the next day.  Will not be returning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNVZYQkdNR05RZEZndE1rTTFaemREUXpoTlozYxAB",
            "text": "Place is grate\nSo delicious and cozy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSGNYQmlXV2RwY0ROV04wNDFVVlpvYUZoa1FVRRAB",
            "text": "Visited here on several occasion. Minimalist decor, dimly lit providing a cozy and intimate ambiance , cute for a date night without feeling over the top. We've had Dawa as our waitress couple times and she is very attentive and personable. Gave us great tips on what to order\n\nThe spicy yuzu margarita is my go to drink .Well balanced, strong, not too spicy which i liked. For food, I have really enjoyed their eel roll and salmon teriyaki. Recently tried their Omakase and it was very tasty . The sushi was so fresh, the salmon sashimi was melts in your mouth. The dragon roll was also a great addition. The portion was plentiful, felt very full by the last bite. Overall, really impressed by the quality of their sushi. I look forward to sampling the ramen on the menu since so many people have raved about it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVmRGUXhTMlZ6V1ZkWFNsQXpWelJ6Um5Cc2NtYxAB",
            "text": "The food was very good and filling. Perfect sushi and ramen."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONFdrOTFOVEp3TlRsVVNUUTVjbGhJYlVWMGFGRRAB",
            "text": "I had spicy miso ramen here and it was the best\nGood food and good service thanks to Soniya 🥂"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOME56QlpaUzFoYW1aS1pWQjJXbG95WHpWclpIYxAB",
            "text": "I like , I like"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaFplR2lBRRAB",
            "text": "The food wasn’t anything exciting to talk about. I ordered the veggie tempura,  which was bland and oily. The vegetable soup was just okay . I chose this place based on the images and setup I saw on Google , how disappointing it wasn’t the same . The place looked old and rundown. It’s like the mask came off, and there’s no need to keep up the pretense."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJSHBxcHVxMWNXOWxnRRAB",
            "text": "My family and I love this spot. We’ve gone at least 3 times since last year. It has something for everyone, including my toddler who loves the ramen. The staff is friendly and the space is clean. Now that it is getting warm, we have the option of eating in the outdoor area at the back of the restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPX1drOFNXM05DTm1RRRAB",
            "text": "I’ll be honest. This isn’t amazing, or out of this world ramen, but it’s good to satisfy a craving that a home-made ramen won’t do. Will I frequent it for the price? No. Is it utterly bad? No. It’s just fine."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOaWd1NFN4OGJxaDNRRRAB",
            "text": "I waited for more than an hour to be served. My drink came out with a dead roach in it, the second drink wasn’t good, I had to send it back. The kimchi wasn’t that great and the shrimp fried rice tasted old. For my first Mother’s Day this was very disappointing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc1lUMzZBRRAB",
            "text": "Shio Ramen smelled very weird..didn’t want to eat it. Another Ramen was okay. Gyozas were just fine. The floor inside was very sticky, you better go to their nice terrace😁"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnd1BXRzdRRRAB",
            "text": "Super yummy! So glad we have a great ramen spot in the neighborhood - I ordered the TanTan Ramen, it was very delicious."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNGJLMXVRRRAB",
            "text": "Craved for ramen after 12 hours of work and checked what’s near and The Garden at Ditmas popped up. Great food, delicious ramen indeed! Good place, but can you hide your garbage bin at least? And absolutely amazing staff."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOXBfQ0xREAE",
            "text": "sushi delicious, ramen really good!\ngarlic chicken with rice - chicken tasted old.\nthe waitress was rushing, gave us the check as soon as we finished eating without asking."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMHFYeUN3EAE",
            "text": "Good food, everything was cooked well, great service. The Karaage chicken could do better with a little less oil but overall nothing to take a star off."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGa2Ntbm9RRRAB",
            "text": "I reviewed this place previously. Tonight, I did not order sushi. I went with the garlic chicken which comes with a delicious garlic soy sauce, tasty cabbage and perfectly cooked rice.\n\nThe thinly sliced, grilled chicken cooked in garlic is one of the best chicken dishes I ever ate. The chicken is extremely tender, great texture and explodes with flavor when you add the garlic soy sauce.\n\nThe sauce, rice, cabbage and chicken all go together nicely. I will go out on a limb and say that this dish is the best dish dollar for dollar on Cortelyou Road. This perfectly cooked chicken dish was only $17. It was extremely flavorful, nutritious and so reasonably priced.\n\nIf you have friends who aren’t into sushi even though that is what you want take them here and they will  love the garlic chicken.\n\nIn addition to the garlic chicken I had a lychee martini which was a nice cocktail."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MHRfZHFBRRAB",
            "text": "The vegan ramen is absolutely perfect. So savory and filling. The only thing is that mine was missing one of the ingredients from the menu. The hibiscus cosmo was delicious also."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeHJqajNnRRAB",
            "text": "Ramen was excellent. So savory and delicious, it's rare you can feel the broth very tasty. I barely finish my ramen but that day bowl was empty. I loved the experience and hoping to come back. My fiance got a chicken dish, can't remember the name but it was actually good as well. They do know how to cook!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbVBfYlNnEAE",
            "text": "Everything I've eaten here has always been amazing. One of my favorite Japanese places! The Chasu Pork buns are unbelievable, and the sushi is always outstanding."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuODdmS1NREAE",
            "text": "Great prices and excellent service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaXV1RHdnRRAB",
            "text": "This place is really excellent!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3Z0k2TjZ3RRAB",
            "text": "We didn't like their ramen. The portion was large but tasted very bland. Our table was right by to the window in the back and the windowsill was too dusty with dead bugs and flies, I had to clean it up myself before our food arrived. I also didn't like the wooden or bamboo spoon. The service was fast, our waitress was kind and attentive."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNHVhRzlRRRAB",
            "text": "❌Tonkatsu Ramen > ️⭕️ Tonkotsu Ramen\n* Tonkatsu is Fried Pork\n\n❌Chasu > ️⭕️ Chasyu\n* There is no such a word, Chasu, in Japanese.\n\nIf they call them a Japanese restaurant, they should know what they are cooking and serving. I, as a Japanese, don't understand why many Japanese restaurants ran by non-Japanese, including Koko Ramen, don't have enough respect for our culture.\n\n******************************************************************\n(updated my review instead of replying to you)\n\nThank you for your response to my review. However, your menu in the picture and under the Menu tab clearly say \"Tonkatsu Ramen\" instead of \"Tonkotsu Ramen.\" I appreciate it if you respect Japanese culture and could correct them soon. Thank you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3ellubDlnRRAB",
            "text": "Oooh it’s always so good here mmm yes mmm immaculate\n\nIdk how they do it, but the fish is FRESH as all heck. It really makes me feel like I am one with the sea, in the ocean.\n\nThey also have really good takoyaki buy the takoyaki\n\nRamen is good too\n\ncool"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOXB2TFVBEAE",
            "text": "My wife's favorite restaurant."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkcWRlWmlRRRAB",
            "text": "Bao, shrimp, Gyoza, rolls, Pho, Beef Teriyaki....Everything sooooo good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOTczOEFREAE",
            "text": "I had a little dinner on my own at The Garden tonight. My waiter, Dawa, was very attentive and friendly; I believe he read the room well, which I greatly appreciate. My Kakuni bun was a perfect starter, and the Hibiscus Cosmo was brought to me almost immediately after I ordered it. Tan Tan ramen was not only gigantic but delicious as well! Happy I chose The Garden to have dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbzVELUp3EAE",
            "text": "Portions were small (hence four and not five stars), prices high. Service was good, flavors yummy. Music too poppy, vibe just okay. Hot ginger lemon drink, though? Slaps.\n\nWe got two miso soups (bowl half full), two sushi bowls (bowl is big, but not so full), and the hot ginger and lemon drink as well as the genmaicha and an iced matcha (all three drinks were great). The total was $70.66 before tip. That’s a little too much, I think. Like I said, the prices were just a bit high.\n\nOverall, not a bad experience, but I probably wouldn’t come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdFBURkN3EAE",
            "text": "Love this restaurant.  Foods very delicious.  If you want to spend good time your friend(s) it's perfect place. Unfortunately today they little bit disappointed me.  Ordered online chicken fried rice.  It came not good. Chicken was too dry.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5NzhQWkd3EAE",
            "text": "I always get vegetarian or vegan ramen and they had that, so that's great. We don't eat pork and my boyfriend was able To substitute that with grilled chicken instead (in the ramen) so that was excellent.\nPlace is cute and there's good service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5d3JlcHN3RRAB",
            "text": "I went in for lunch, and had a ginger/ hibiscus iced tea and a dragon roll. It was Amazing! Friendly service too I'll definitely be trying out more of their menu soon."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsaUpmODRnRRAB",
            "text": "The garden is a clean, friendly, delicious establishment. Hot saki was delicious and warming. Appetizers were very tasty and the  vegetarian ramen was delicious!  For dessert, green tea cheesecake with green tea, ice cream. So delicious! Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5bUtIZG13RRAB",
            "text": "Place was empty on a Saturday. The waiter were very attentive and food came out quickly. Overall very welcoming and relaxing atmosphere. The chicken karage and dragon roll and the tan tan ramen was fantastic. Chewy noodles, savory broth and the ginger in there really surprised me in a good way."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0aTctZlF3EAE",
            "text": "I ordered beef teriyaki and pork gyoza … super good just not enough food to share but worth the price!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxM2RuWVJBEAE",
            "text": "Quick and attentive service. The ramen portions are definitely for two people, very tasteful.  Dimly Lit atmosphere perfect for a date night with a sushi chef and full bar onsite. Various sake options (hot and cold) and imported draft beer (Orion) from Okinawa, Japan. Definitely a go-to 👌."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoemJDOVBnEAE",
            "text": "If you're looking for a taste of Japan in Brooklyn, look no further than Garden. This unassuming Japanese restaurant offers some of the best sushi and ramen I've ever had.\n\nFirst, the sushi. The fish is incredibly fresh and expertly prepared, with each piece melting in your mouth. The selection is varied, with traditional options like tuna and salmon as well as more unique offerings like octopus and sea urchin. Whether you're a sushi connoisseur or a novice, you're sure to find something to love here.\n\nBut Garden isn't just a sushi spot. Their ramen is also top-notch. The broth is rich and flavorful, with tender noodles and perfectly cooked toppings like soft-boiled eggs and tender slices of pork. It's the perfect comfort food on a chilly evening.\n\nThe ambiance at Garden is also noteworthy - it's cozy and intimate, with a minimalist decor that lets the food shine. The staff is friendly and knowledgeable, always willing to make recommendations or answer questions.\n\nOverall, I can't recommend Garden highly enough. If you're a fan of Japanese cuisine, you won't be disappointed. I can't wait to go back and try more of their menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcVlTRWNnEAE",
            "text": "As much as I love and miss the previous restaurant at this location, The Farm on Adderley, this place is such a great addition to the neighborhood. I stopped in today for lunch to show my support, and I was immediately blown away by the food and service. I ordered the Pork Gyoza and Tonkotsu Ramen, and both were extremely flavorful. The staff is friendly, and the restaurant itself is spacious and clean, and they have backyard seating. I definitely recommend this place, and I look forward to dining here again in the future."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdGFTcFNBEAE",
            "text": "I had been meaning to visit the garden since they opened. All of my friends who live in Kensington had reached out to me to let me know that there was a delicious new ramen spot in my neighborhood. But my schedule never really aligned. After a long morning of errands and working out. I told my fiance... \"You know what I could really use right now? A hearty tonkatsu ramen.\"\n\nThe air quality was still a bit questionable so he asked if we should do takeout and I wasn't having it. Ramen (at least the first time you're testing a restaurant) needs to be eaten in house. So we went to Cortelyou, and took a seat in the Gardens garden.\n\nLong story short: the food was worth the hype.\nWe ordered the gyoza, shishito peppers and the Garden roll. All the portions were generous and we didn't wait long at all for anything. (We went around 7pm on a Saturday night. The place was at about 70% capacity).\n\nWe were most pleased by all the surprising subtle flavors we tasted in these otherwise common dishes we had ordered. Nothing major, just enough for you to turn your head and say \"oh I didn't expect that, and I like it.\"\n\nI ordered exactly what I had been craving that morning and it couldn't have been more perfect. The tonkatsu broth was hearty and flavorful without overwhelming the senses. My hard boiled egg was fermented and salty, the perfect combo with the pickles and bamboo shoots.\n\nWhen we were all done, we both felt comfortably full...and satisfied 🤤. I love that there's a place in the neighborhood that is quick, easy, and thoughtfully delicious. I will be back. Definitely. (P.s. the spicy yuzu Marg is fun and tasty.)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeDhDR3BnRRAB",
            "text": "Beautiful restaurant, great food, wonderful staff :) Loved the karaage and salmon teriyaki lunch bento box. The tea was also very good! My mom loved her tonkotsu ramen, and my friend enjoyed the omakase."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdTh5bnlBRRAB",
            "text": "Had lunch and was amazed by quality and service. Ramen is the best I ever ate! And all the appetizers were delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab01PY1lREAE",
            "text": "Very nice vibe and atmosphere, especially the outdoor seating area. Unfortunately, as someone who has had authentic Japanese Tonkatsu ramen, the one offered here was extremely underwhelming. The broth looked rich and flavorful, but tasted watery and bland. The pickled ginger in the ramen was so strong and off-putting that my partner complained it tasted like dishwater. The noodles were also a bit gummy and the pork belly slices were mediocre at best.\n\nThough this meal was disappointing, the staff was kind and understanding and refunded us on the ramen. I will likely return here as I can’t comment on the quality of the sushi and other dishes here. Thank you for understanding."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSekpubm5BRRAB",
            "text": "The sashimi was excellent quality, and the portions were ample. The staff and owners here are kind and attentive as well! Would highly recommend those in the neighborhood to come check out this restaurant :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodkx5MmhnRRAB",
            "text": "Enjoyed a delicious lunch with group of friends.  Tenzin, the owner, was very welcoming and answered so many questions.  Cannot say enough about this marvelous restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScnVpTlBBEAE",
            "text": "Great food, need to try the ramen from here it's surprisingly good for the area. Overall amazing place, great options"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNUlYWDVnRRAB",
            "text": "Got the lunch special of ramen with a side of karage chicken. Wow. Incredible bowl of ramen and the fried chicken was super delicious as well. Honestly it was the best food I’ve had on Cortelyou Rd., and the price is amazing also. Highly recommend, I’ll be going back soon to try other things."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQteXItRXRnRRAB",
            "text": "I went to prospect park and was damn hungry, so decided to try some japanese restaurant in the neighborhood. They just opened and as per the server's suggestion I tried RAMEN, damnnnnn the food was super DELICIOUS. Since it was cold today I also tried Homemade Hot Ginger Tea or something it felt so good. I would give the Restaurant the RATING of 🌟 🌟 🌟 🌟 🌟 out of 🌟 🌟 🌟 🌟 🌟 for FOOD and HOSPITALITY. The interior atmosphere is good and I loved the plates, bowls and silverware which gave warm japanese vibes. I am hoping to try other dishes soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtM0lmTEdREAE",
            "text": "The Garden at Ditmas is excellent! Such a lovely space, with delicious food, good music, and an incredibly friendly staff. The ramen was perfect. I am so happy this place opened in the neighborhood! Great energy!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLW9lNW9nRRAB",
            "text": "Really nice place , great food , great atmosphere,  4 star’s instead of 5 is because there was a hair in ramen and one of us was really unhappy about it since he found it in the bottom of the bowl , other than that everything was very good ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbmJyNFl3EAE",
            "text": "Best ramen in the area! I came for take out and the food was delicious. I’ll definitely be returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScU9yNWl3RRAB",
            "text": "Yes!!!! Beside the customer service being amazing the food was absolutely delicious!. I'm sorry I didn't take photos of it… Drinks are amazing as well. Definitely a must see in Ditmas Park."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocnYzc2dRRRAB",
            "text": "Pleasantly surprised here! The quality of ramen was FANTASTIC, pork buns were perfectly balanced with a little spicy mayo, and the freshness of the Tuna/Avocado sushi roll was refreshing.\nService is traditional; extra attentive — you’ll never have to ask for a refill or “look” for your waiter.\nAnd somehow the drinks (beer) compliments the taste profile of the food! 🫡🫡\nYou can’t go wrong here. Treat yourself!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCckwyYk1REAE",
            "text": "Tasty Japanese katsu, ramen and other goodies. Great service and chill atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCZ0pqSV9BRRAB",
            "text": "Recently visited this new Japanese restaurant and was blown away by the quality of their food! The ramen was some of the best I've ever had - and sushi was also top-notch. The service was excellent, with friendly and attentive staff. This is what our neighborhood needed!!"
        }
    ],
    "reviews_count": 64
}