{
    "name": "Margez Grill House",
    "place_id": "ChIJ92ITmWBFwokRSvKc5mXGXEk",
    "grid": "BK14",
    "address": "1018 Avenue M, Brooklyn, NY 11230, USA",
    "rating": 4.7,
    "user_ratings_total": 231,
    "phone_number": "(718) 369-0979",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213M1REUXRTWFpVY1ZkUU1FNW9Wa0pRZEZORmVHYxAB",
            "text": "Food tasted stale, staff not very friendly"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadlIwUjRPVTFpVUZkcFFUZHVXVTV1T1dWcWNXYxAB",
            "text": "The service was next level\nAnd the food was delicious 🤤"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaFpsbFNla3B0VDAxdlkzbDNWblpqU25GdWNsRRAB",
            "text": "Lovely atmosphere, delicious food!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdExXVnFjVTE1V2xweWRFNTBObWxtWDFsRlQxRRAB",
            "text": "Food was fresh and delicious.\nPerfect menu.\nAll the food was tasteful.\n\nThe price includes 20% and they ask for additional tip."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaU5uUldlbTFuV1ZkeWJFRkRTM0ZKVVdobExYYxAB",
            "text": "Good place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVFpYVjVRVEZQVTNkYWJ6SllTVXBtU0RVM2QyYxAB",
            "text": "Food is good. Seems to be heavily influenced by Israeli cuisine. They had nice instrumental music going which I enjoyed, but it was a bit too loud. Service was nice. Overall good experience. Not too pricey."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aM0xXNWZaV2MyUzNFdFYwNVBUM1JXWW1wRWVIYxAB",
            "text": "Food and service A+"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPQ2NtTGkwa1B1VHpBRRAB",
            "text": "Food was so good I got amazed by how good the taste was  and abie service is amazing it makes me excited can't wait to come back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYWM2cFAzeVllZ3VnRRAB",
            "text": "I was just here for dinner and I had such an amazing experience abie and Oren were very helpful with what to choose and the food was splendid  the waiter was very patient and really friendly"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYVppcDM4cWZqNHBRRRAB",
            "text": "The food was excellent the outstanding waiter was really helpful and patient with us at all times . The atmosphere of the place and the staff was amazing, can’t wait to come back.\nThank You Margez."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNdm8yTmFabnVDRE1nEAE",
            "text": "I just had dinner at Margez it was very good we enjoyed the service was a 10/10 amazing Abie and Oren were amazing and very helpful"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOSzRpTE9CdTRuRkZnEAE",
            "text": "Delicious food! Amazing quick service! Much faster than other stores.\nClean kitchen and friendly staff! Highly"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPWDdfTlhiLVlmaEd3EAE",
            "text": "Great place food Alma’s good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYnVnTi04NHJlWEN3EAE",
            "text": "My man Eric is the best server. Gave us the best approach and was very nice to us"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJVHB0SUNKMy1iVmpnRRAB",
            "text": "Great vibe and best food very fast service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYlJ5ZWJsaXRIV1pnEAE",
            "text": "Best place the food is crazy Eric is my boy"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQYnctS3Itd3ZXVVRREAE",
            "text": "they want you in and out .food has no taste ,very small portions .i order a glass of wine for $18 .i got like 2 oz .they charge 20% tip and 3% admin fee (never heard of it )and then you have to pay tip again.would not recommend this restaurant"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMkluNE1BEAE",
            "text": "Amazing restaurant!!!!! The best food in Brooklyn"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYXU0dFQtLWRLSFBREAE",
            "text": "You have to try the new dessert menu!!!\nthe best Parve  dessert I ever had"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbU1xYUR1eEo3WEh3EAE",
            "text": "Ziggy made great drinks"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbEpyX0VnEAE",
            "text": "Food was very good with a good vibe. Prices are so/so but to throw in a 20% and an another admin fee of 3% is way too high for what you’re getting."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJZ29lNHhnRRAB",
            "text": "Great overall vibe. Awesome appetizers."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNDduMkVREAE",
            "text": "Food was excellent environment excellent great service BUT HOLY COW is this place expensive, they charge a whopping 20% service charge and to add insult to injury an additional 5% “admin fee” all and all your hit with 25% in fees for just sitting not to mention food is also very expensive. Again excellent place but this threw me off and would def 2nd guess coming on the regular. Without a doubt was deft the most expensive restaurant I have ever been too and I’ve been to all the fancy top of the line restaurants across Brooklyn Miami etc."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LWNPVTJRRRAB",
            "text": "I ordered a medium-rare burger but received it well-done, which the waiter acknowledged. Unfortunately, it lacked flavor, and when I mentioned the issue after eating, the staff told me I should have spoken up earlier. The service was unaccommodating, and overall, the food was bland.\n\nI wouldn’t recommend it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MC1mSlpREAE",
            "text": "The food and service were outstanding! Visiting from Florida as a party of three without a reservation, we were warmly welcomed. Oren’s hospitality was nothing short of exceptional—he treated us like long-lost family returning home after a year abroad."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eFlPWDR3RRAB",
            "text": "Food was delicious!! Ziggy made some great drinks, we could use a mango flavored daqueri though!! Service was great, Eric and ziggy were awesome."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRa2FMWjVnRRAB",
            "text": "Have been coming here with my wife every week for the past few months. Best kosher restaurant, highly recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneG91UVN3EAE",
            "text": "amazing food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnZ0thb2tRRRAB",
            "text": "Their food is absolutely divine! There is something special about every single dish I've tried there!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNjhiQ0l3EAE",
            "text": "Had a party of 6.  no bread. very long delay in food service.  Terrible service and waiter who then asked for a 30% tip after providing horrible service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcWNmOE5nEAE",
            "text": "The food was out of this world. Amazing atmosphere, vibe and overall experience. Drinks were fire and service was great. Will definitely be coming back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOXVyRVd3EAE",
            "text": "Always perfect! Unique style, and food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aTZhaXJnRRAB",
            "text": "Delicious Food, Amazing Service,\nThanks to Eric, the experience was a true pleasure!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aTZ6Mlp3EAE",
            "text": "Amazing food great service! Fun with friends"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aTZ5d2VREAE",
            "text": "Amazing food, great service and awesome vibes"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aTR6TmZ3EAE",
            "text": "Great food and great vibe. 10/10"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cHVET2VnEAE",
            "text": "Muy buen servicio el de bar buen servicio la comida muy rápido y caliente"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MHBMREVREAE",
            "text": "I order couscous and this is what I get this charge me $75 what is this? Is nothing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bGNMZ2ZnEAE",
            "text": "I recently visited Margaz Grill, and I can confidently say it’s a hidden gem for anyone who loves perfectly spiced meats. From the moment I stepped in, the aroma of sizzling margaz sausages and fresh herbs welcomed me, setting the tone for a fantastic dining experience.\n\nThe margaz here is nothing short of extraordinary. Juicy, tender, and packed with a medley of spices, each bite bursts with authentic flavors. The chefs clearly take pride in their craft, serving sausages with a balance of smokiness and spice that’s hard to find elsewhere.\n\nIf you’re a fan of meat in general, the menu has so much more to offer: perfectly grilled lamb chops, succulent beef skewers, and even flavorful sides like garlic-infused roasted potatoes and fresh salads to complement the main dishes.\n\nThe ambiance is warm and inviting, making it perfect for family dinners or casual outings with friends. Service was attentive and friendly, adding to the overall charm of the restaurant.\n\nWhether you’re a seasoned foodie or just looking for a satisfying, hearty meal, Margaz Grill is a must-visit. I’ll definitely be back for more!"
        },
        {
            "date": "10달 전",
            "language": "ms",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bGR6VlJREAE",
            "text": "Wowwwwww!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bGV5MlFBEAE",
            "text": "The food was good and the service was good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bGZTcUtREAE",
            "text": "Great place ever!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cm9uR0dBEAE",
            "text": "Reasonable price, very basic mediterranean menu, the waiter kept coming back and tried to convince us to order more food. not so pleasant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeF82bk9REAE",
            "text": "Abie was so helpful and the server gave me the food on perfect timing and everything was perfect"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQZ2Y2R1lnEAE",
            "text": "Food was delicious service was pretty good atmosphere was quite nice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dHUzMTB3RRAB",
            "text": "11/10 recommend this place. Make sure to have a reservation as seating is a bit limited however everything else is a plus.\nThe ambiance is beautiful and the decor is nice.\nMalia was our waitress and she was so pleasant! She held entrees for us to give us time to eat the appetizers.\nThe food was amazing and came out piping hot and fresh.\nWe had the dirty nachos, chicken poppers, pastrami burger and and brisket burger.\nThe veggies for the burger were super fresh as well.\nThe drink menu is unique and delicious.\nThis place is a gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OGFYNEZREAE",
            "text": "I highly recommend Margez Grill House on Ave M. Their customer service is exceptional. After placing an order, my food arrived half-open and squashed because the Uber driver had opened the bags. I contacted Margez, and they were extremely apologetic and explained how meticulous they are about kashrut, with their mashgiach double-checking the bags before delivery. They immediately suggested that I replace my order, ensuring it was secure. Two different managers called me to confirm the food was taped and sealed properly.\n\nThe portions were large and generous, and the food was incredibly tasty. The packaging was excellent, with dry and wet dishes separated to avoid sogginess – for instance, the chicken platter had the chicken in one container and the salad in another.\n\nI will definitely reorder and highly recommend everyone give them a try."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtaWRic1hBEAE",
            "text": "Wow! This place has REALLY delicious food!!! Funny thing is, I live a couple of short blocks away, and never even knew this place existed. My brother was here by me visiting from out of town with his girl, we wanted to go out to eat, and he found your place online, that is only walking distance from my place and I never knew about it...\nAnyway, I'm glad he found out about it, cause we had a really nice time there. The place was really full, but they seated us almost right away. And took out order quickly, the food started coming out almost immediately. And every thing we tried, was really delicious! Not one dish did we not like. The service was also very nice. We really enjoyed it in every way.\nI'll definitely recommend your place, and I'll for sure be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMWZTQVpREAE",
            "text": "I think this was my first experience going to a restaurant and enjoying every single dish.\nFirst off- if you’re going to a place called Margez, you must order the margez. It was absolutely delicious and my favorite appetizer. The restaurant is relaxing and clean. Service was great, our food came very quickly. We ordered the margez soup which was so spicy but insanely delicious. We also ordered arayes, shishito peppers, the pastrami burger with french fries, and skirt steak with mashed potatoes. Everything was cooked perfectly and had delicious flavor. Don’t skip dessert, the kunefe and chocolate chip molten cookie were also fantastic and the best way to end our meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCN0pqLUlnEAE",
            "text": "The vibe is awesome, the food is next level delicious and also very fresh! Service is super good and food is ready very fast! Will definitely recommend and come here again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUeHVUb3dRRRAB",
            "text": "Very good food\nFresh\nGreat customer service\nThe place has beautiful design.\nEverything is very clean\nAbsolutely recommended!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dGJxNWhBRRAB",
            "text": "Absolutely loved this restaurant! The ambiance was awesome, and the food was fantastic. We ordered 4 appetizers and everything was delicious. Pretty high end I’d say, it would be a solid place to go to for birthdays, anniversary’s, or even for just a night out. No question I’d pop by again soon, 10/10! We paid about $130 for 4 appetizers including tip and a bottle of club soda, for reference."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1c2EyR3F3RRAB",
            "text": "After being an extremely good customer for a while [being one of their first customers]... I paid a visit recently, and the guy at the door desk [claiming to be the manager, which I never saw him] told me that I can't get a table becuase I didn't have reservations.\nAlthough he had several empty seats available...\nIt's extremely upsetting 😡, loyal customers shouldn't be treated this way!!\n\nIf you want nasty attitude, pay a visit at this place, you'll certainly get it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MVotcXhRRRAB",
            "text": "Came for my birthday. Prices are reasonable, very big portions, food is nicely arranged, great taste , and the place looks really upscale and hip."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4amNqbzRRRRAB",
            "text": "Had an amazing experience here! From the food to the ambiance to the service- everything was 👌🏻\nWill definitely be back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMVB1Szl3RRAB",
            "text": "Love this place.  Choice is great !  All entrees must try! I definitely come back! Great place to have a meeting of celebrate event with small group of friends or family"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCakxLanR3RRAB",
            "text": "Great ambiance, amazing service, and delicious food. Would 10000% recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbE1fcE9BEAE",
            "text": "Very cozy and delicious place!  Service at the best level! I will definitely come back here again!☺️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMjZxT01nEAE",
            "text": "Food was outstanding! Great vibe and service is amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxX1B1Tk5nEAE",
            "text": "Great atmosphere and the best nachos I've ever had—I highly recommend going"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPc0xTb3dBRRAB",
            "text": "The best!!!! So fresh and clean. And the most important so delicious!!! Highly recommended ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCXzhXQ3dRRRAB",
            "text": "As an appetizer, Margaz sausages were juicy and delicious. The main course, the chef steak, is excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOHN6amRnEAE",
            "text": "Came with family here last night. Everyone was very satisfied. Food was amazing. We had multiple appetizers (arayes were excellent!), and then several different type of burgers, and the rice entrée (tajene). No complaints. Manager (Oren) was great (\"dinner and a show!\") and even my picky teenager had no complaints! We got seated promptly even without reservations and the wait staff was very professional and attentive even though they were obviously busy. Thanks for a memorable evening!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkclBiWFN3EAE",
            "text": "Very decent and overall good experience.\nFood was very good overall, steak was cooked to perfection.\nService was ok, there were some times that we had to wait a bit long for someone to remove our used plates, the mains were brought out while we still had our dirty plates ..\nThe tables are also extremely close to each other, which makes it extremely uncomfortable if you'd like to have a nice quiet dinner with someone.\nOverall, a very decent place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMnZHdjRnRRAB",
            "text": "I really enjoyed this place food was great and tasty"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOWRXTGJBEAE",
            "text": "Food was meh at the price we paid. At a lower price point food would be worth it. Atmosphere was nice though if not in the back room you feel like you’re at a lower end restaurant due to the surrounding area. Probably wouldn’t go back due to the prices and overall quality of my meal. Young Man in the front who sat is, waited on us, and was the clear leader of the house did a great job."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eG92SHp3RRAB",
            "text": "Great steak. We got the cowboy, tacos and fries and split it  all between us, and it was plenty of food.\n\nAll the food was great.\n\nTacos are spicy,  but it doesn't say that on the menu.\n\nWe got a seat next to the speaker, and around every 5 minutes, they blasted \"Happy Birthday\" in our ears. Just avoid sitting next to that speaker and you'll have a great time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNFllWlRnEAE",
            "text": "We came in without a reservation and Jonathon our waiter got us a table even though it was packed! He was attentive, clear, and overall added to the great experience. Food is delicious, atmosphere a vibe, a little pricey (adding grilled chicken to my salad was an additional $18 on top of the $22 salad) but it is NY so whatever. Would recommend to friends and definitely return!"
        }
    ],
    "reviews_count": 68
}