{
    "name": "Midwood Flats",
    "place_id": "ChIJDeoRAUBbwokRRJWSct7E3Lc",
    "grid": "BK14",
    "address": "577 Flatbush Ave, Brooklyn, NY 11226, USA",
    "rating": 4.3,
    "user_ratings_total": 630,
    "phone_number": "(718) 484-4466",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMVFucGthbEJYY2tWYWFtaFVaMmhsV0cxd01WRRAB",
            "text": "Maybe I just got lucky, but this is one of the friendliest places I've ever been in Brooklyn.\n\nGrace the bartender and literally all the customers were very nice and positive, in a way that rarely happens elsewhere.\n\nI definitely want to go back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTFgyWk9UMjAwZDE4d2RtNXBkbTFxWjNBeGEyYxAB",
            "text": "Love Midwood flats! I’ve been coming here for many years and it’s always a good time. They have an incredible happy hour deal and the potato nachos are really delicious. They also have a really good beer list. Would recommend if you are in the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SaVpWUmhNalJwTm10TE5rdE5ZbUZSVVhsSVUyYxAB",
            "text": "It’s a solid bar spot. The food was good and the service was excellent. Inviting staff always makes you want to come back. They were also hosting a Love Island viewing later in the week so they have fun events. All in all it’s worth a try."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMWVucE5OMU5WWXpadmRVdHJNVUkwVkdSc1NGRRAB",
            "text": "Wow, the food incredible, The staff incredible, and the vibe is chill. Will be returning !"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwM29URDB3RRAB",
            "text": "Perfect local pub."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObFptOVVObVIyTldsd05EaHZNbXhZV1ZCUFdVRRAB",
            "text": "Heavy doors, loud tvs not very accessible but seems welcoming."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzXzZ5Z2VREAE",
            "text": "mostly fun, when not super busy! I guess, like everywhere :}"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPMkxqWVQtbF9ialpnEAE",
            "text": "Great neighborhood spot to hang out."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNeTdpNC1tc3VqV2RBEAE",
            "text": "My go to neighborhood bar! Food, drinks and staff are amazing!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc2RYY1pnEAE",
            "text": "My first  time here the lady name  Madelyn    was so nice cool vibez mix crowd  amazing spot"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveXBHMm53RRAB",
            "text": "Great spot"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJckx5XzFnRRAB",
            "text": "They included an auto gratuity, then added a tip option on top without indicating the tip was included. I therefore accidentally tipped 20%, then 20% again - a $44 overpay on a fairly sizeable tab. When I noticed on my cc statement, I asked the manager if possible to revert the extra charge and they refused after multiple back and forths. Happy to tip generously but the way this was done felt intentionally disingenuous and the refusal to correct was irritating."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcmNEcEtnEAE",
            "text": "Grace the bartender is really friendly. The gravy and biscuits were delicious and the bloody Mary was perfect."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMUx1MXdnRRAB",
            "text": "hits every time. staff is friendly, atmosphere is great, food and drinks are always amazing. I’m obsessed with their potato chip nachos and spicy marg. also they usually have really creative cocktail specials and quality shot/beer combos. haven’t tried brunch here yet but it’s on my to-do list! one of my favorite spots in the area"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3Z3NqNFJBEAE",
            "text": "Love this bar, chill atmosphere, friendly staff and great food for brunch, lunch or dinner!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbjdDOG9nRRAB",
            "text": "Go to this bar for drinks that is the whole point. The food is not worth it. Next to the bar there are a few options but come back for drinks."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNGRqTzlBRRAB",
            "text": "For what it is, Midwood Flats is a cool, unpretentious place delivering an acceptable burger with salad and chips. I have been here 2 times and have had their burger each time. In my opinion, the burger doesn't warrant the glowing reviews people have given it. I'm bringing the food down to 2 stars because of it. It's supposed to be their signature dish. Hanging out at the bar is another story.  It is  relaxing and friendly, and the neighborhood appears to be drawn here, although the whiskey selection appears unremarkable. I think I  liked the place and will come back. I just don't think I would order the burger a 3rd time. They have a catfish sandwich on the menu. I don't know about that one either. The beers and ciders are worth a look if you are into that sort of thing.  I had the Holiday cider, which did possess some smells and taste of the Holiday season, but I do not see myself ordering it again, primarily because it was served lukewarm. Ciders, in my opinion, should be served bristling cold so your lips smack."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aHVUTFFBEAE",
            "text": "Great service and food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cmVibVNBEAE",
            "text": "We came here on a  Sunday evening because of the proximity to Kings Theater and the good reviews. Really comfy spot.  They have a wide range of good beer, nice booze selection and good cocktail list.  Grace and the rest of the team made us feel so welcome.  Not only was she friendly but was also helpful with food and Bev suggestions.  We started with  the MFER’s which were the best White Castle you’ve ever had.  We all also had the buttermilk chicken sandwich.  It was delicious. It was not one but two hamburger sized buns.  The chicken was moist and really flavorful, lightly breaded and melted in our mouths. I look forward to coming back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Nk1mZGJ3EAE",
            "text": "I haven’t been here in a while and now I know why.  Service was awful\nTook an hour to get my food\nTurkey sausage was awful\nCoffee came cold\nMeanwhile waitress was taking shots at the bar at 1pm\nWon’t be coming back"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbmR5N2JBEAE",
            "text": "I’m a native New Yorker living in this particular area for a while and I have given this place so. Many. Chances.\n\nI went tonight with a group and after multiple times having bad service, we actually had a good server! However I ordered the pierogis - filled with hair. I took a bite from one and pulled out a hair - thought it was mine (grossed me out) but benefit of the doubt. Another one - hair. I opened the rest and found another hair! So gross and I’m thinking of contacting the Brooklyn health department"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMW9DQi1nRRAB",
            "text": "Toller Service, gutes und ansehnliches Essen"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbGJEeEp3EAE",
            "text": "Unbeatable service. They let you sample in case you don't like. Burgers are absolutely outrageous- it doesn't get better. It's close to Kings theatre and we are seeing a band ghere tonight, there's no better place to go if you're looking around. Dive bar vibes. Cheap drinks. Great music. Alvaro was an excellent bartender and I'd come back again just for him."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvbmFqbUt3EAE",
            "text": "One of the best bars. Amazing selected of beers, wines, and whiskeys. I love that this place has no TVs, kinda forces you to communicate and socialize (a dying art amongst humans nowadays haha). Friendly bartenders, quaint yet wonderful selection of dishes. The wings? On point!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua2J6MG9RRRAB",
            "text": "Midwood Flats has such a cozy, welcoming atmosphere. The café might be a bit old, but that just adds to its charm, and the interior is really pleasant. I absolutely loved my skillet; it was cooked to perfection. The pumpkin ale was excellent—rich and flavorful. We’ll definitely be coming back again for more. A great spot if you're looking for good food and a relaxed vibe!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaEtIcDlBRRAB",
            "text": "Came here for bottomless brunch for my sister’s 21st birthday & it was a total vibe! Very chill, laid back atmosphere. The service was absolutely amazing, and so were the food & drinks! Will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdzlIWTlRRRAB",
            "text": "Fish tacos were dilish!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bDk3Z0xREAE",
            "text": "Dim orange\nNo, I’m doing the post wrestle comes to my head in a minute lighting"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6enREVGJnEAE",
            "text": "While I haven't tried everything on the menu I do recommend anyone who comes to this establishment to try their burgers. They are the best local. Also the perogies and flatbread are an absolute delight."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUZzV6TEZ3EAE",
            "text": "I went to their karaoke night. The host grabbed my hat and pulled it down. I do not like being touched without consent. The actual bar is fine but if you go on their karaoke night be aware the host thinks they have licence to do things like that."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqX091NDJBRRAB",
            "text": "Our “regular” neighborhood pub. Very welcoming and relaxed vibe, great music, extensive beer list on tap, and an amazing catfish sandwich!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcUpDSWxnRRAB",
            "text": "Great food, great service. busy brunch so the Manager waited on us, and she was a delight!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnb3BUb2NBEAE",
            "text": "The food is amazing, and the expansive selection of beer is awesome! The staff is very friendly and the atmosphere is quite welcoming. The Midwood Burger is so delicious, I usually consume at least two of them.\n\nThis is one of my favorite neighborhood bars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5aHBDbmhBRRAB",
            "text": "Elite underrated burger that belongs on all the best-of-nyc lists"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N0lXeHBRRRAB",
            "text": "A wonderful bar with a great atmosphere. The music is just the right volume, and they always play a wide variety of bangers (everything from Sufjan Stevens to 90s pop). There's some good non-alcoholic options, plus the food is lovely. The sliders are some of the best burgers I've ever had. The pretzel is good too, and though the potato nachos aren't my thing, some of my friends love them. Also, its very LGBTQ friendly, without officially being a queer bar.\n\nOverall, just an incredible low-key neighborhood bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWaW8tMm9BRRAB",
            "text": "I would skip the food all together. The cooks microwave everything."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZ0txeTFBRRAB",
            "text": "Bartender does a mean old fashioned here. That alone makes this place a great place to visit. Space is small so if it suddenly gets busy it will be awhile until a spot opens up, or there will just be a wait."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGOVk3SS1BRRAB",
            "text": "Best local bar in PLG. Great happy hour deal. Affordable drinks and food. Always get cast iron loaded nachos, catfood nachos and midwood burger. Great tap options. Weekly karaoke and trivia nights as well."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMXBtUHZnRRAB",
            "text": "Pub avec bonne ambiance, plein de bières locales à la pression, gentil acceuil. Nachos excellentes, bon rapport qualité prix"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwb3NIaWNREAE",
            "text": "We ordered the bottomless brunch (which came with one entree and unlimited beer/ cocktails off their brunch menu.) I ordered a bacon egg and cheese sandwich and my bf got the biscuits and gravy.\nEverything was sooo good and worth the $35! The sandwich and biscuits and gravy were very filling.\nIt seemed like one person was working that Sunday afternoon, but he tried his best to get to us as much as possible.\nAll in all, I would definitely recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcTQ2QXdnRRAB",
            "text": "A relaxed and chill bar. The staff was warm and we were welcomed to stay long after our drinks were over. Along with the round of nicely curated draft beers we ordered the potato nachos which were delicious. In beers I would highly recommend their Stout and Ciders if you like those.  The ambience is nice with good music, booths, and bar chairs."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyOXBUVHJBRRAB",
            "text": "Great little bar right here on Flatbush and Midwood. A calm and warm ambiance with friendly staff and great ipa’s on tap. They’re a great spot to catch up with a friend or make new ones! Great people and great community. Definitely worth…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbmNIUHhnRRAB",
            "text": "Have been here a couple of times because is really close home…\nThis place is really good, food is great, the service is great too! Hector has always being a nice server.\n\nThe drinks are always on point, it is definitely a spot worth checking out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbnBtdmNnEAE",
            "text": "My favorite bar on Flatbush and the best catfish tacos ever! Great place to stop for a great drink (or two) and everyone that works there is friendly and fun. 10/10 recommend."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNNlpUVmdBRRAB",
            "text": "Right off of Flatbush Ave Midwood Flats  is one of the few places in this area I would like to go to for a casual comfortable dinner with friends.  It's dark and cozy, and they have a good service.  MF is more of a restaurant than a bar, although they have a bar, but not the kind of a bar you would want to go to for night night, but to sit at the bar with a friend for a beer and a burger.\nTheir signature dish is their burger. Although I think their burgers are a tad small for American standards bit they are gooood. I will be doing there again for sure."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodDZ1Ty1BRRAB",
            "text": "Excellent experience here the other evening! All of the staff were gracious and helpful. They had a great beer list and offered a variety of cocktails. When I went for a second round, I was a little undecided and they let me have a few samples before deciding! The nibbles are great too, the Little MFers (4 for $15) and the potato nachos were stellar. The pretzel looked giant and satisfactory. They have both booth and bar seating, low and warm lighting makes for a cozy atmosphere. Fair prices to add to everything else. You really can't go wrong! Excited to return.\n\nUPDATE (05/26/23): This spot still seriously hits! OMG! Came in for happy hour and their deals can't be beat! $5 select drafts and $6 mixed drinks (choose your spirit/mixer). The potato nachos are still on another level, do wish the beans had a little more spice but honestly they are so good regardless. The waitstaff, I really cannot, they are so kind and sweet. The pretzel, tried it, delish and pillowy. Just, GO!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlN2VHVkVBEAE",
            "text": "Had a couple meals here, and it is a great place.  They have a great selection of bourbon and spirits.  The food is amazing!  They even offer brunch on the weekend and that did not disappoint at all.  The staff is all friendly.  Definitely check this place out!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxOXNfQVdBEAE",
            "text": "The Cajun Club was great.  A thick cut strip of bacon on a catfish sandwich, who knew?  ...with a great bun.  Calm, relaxing atmosphere on an early weekday afternoon.  Good beer selection and fairly priced."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNROXVDbGdnRRAB",
            "text": "The catfish sandwich and the burger both taste great. Salads instead of fries.\n- Good sized beer selection"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMFBYMjVBRRAB",
            "text": "Awesome place. Staff is very polite and helpful, the environment is pretty much kids-friendly and suitable for families. The burgers are awesome, try the Pork Shoulder. Wide variety of beers. Servings are huge."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdGNiT3BnRRAB",
            "text": "Popped in for dinner here while visiting. Loved the vibe at dinner time..good music. I highly recommend the Catfish tacos!"
        },
        {
            "date": "3년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbUlfWTh3RRAB",
            "text": "Un peu calme ce soir là\nAccueil très agréable et d’excellents burger et sandwich"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybHVHOERBEAE",
            "text": "The best veggie burger I've had in New York.  Side salad is always strong too.  Great beer selection and great servers."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJd2NYZkp3EAE",
            "text": "Great place for a casual brunch, good selection of cocktails, very reasonably priced. Can recommend shrimp and grits, mashroom omlet, avocado toast. The mimosas were great too. Friendly staff."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNVozNlNREAE",
            "text": "cozy and cute bar with a great vibe, nice staff and nice music, chips nachos were soooo good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NGVYZE5REAE",
            "text": "Nice place friendly stuff… love ❤️ beer 🍺…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1LTZ5SWN3EAE",
            "text": "I’ve never really been during the day so commenting about the nighttime experience. A really great nightcap spot or a place to come with a group. The food is ok- mostly bar bites and typical burger fare, but I don’t ever come here for the…"
        },
        {
            "date": "6년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZMzlIdkx3EAE",
            "text": "Excelente bar com grande variedade de cervejas. O burger e o sanduíche BLT são deliciosos."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNFpQaXBBRRAB",
            "text": "Great experience very low key Brooklyn Gem 💎 the cat Fish tacos was everything and a bag of chips straight Situation!!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoem9yY1B3EAE",
            "text": "Food is delicious - best burger in town.\nLimited menu but decent drinks.\nKitchen is the size of a closet and limited seating,\nChefs deserve a 10 star rating but the bartenders could be more personable."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPX3FLaElnEAE",
            "text": "Charming staff, great beer selection and well-made cocktails. Great atmosphere. Food looks excellent - I definitely need to check out brunch. Shame that I've only now visited after living in the neighbourhood for 4 months. Will definitely be popping back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NHRxa3pBRRAB",
            "text": "This restaurant is better for dinner service rather than brunch. For one, brunch is $35 for one plate and unlimited cocktails/beer. The plates are small and unappealing. The biscuits and gravy are watery and without taste. Not worth the $35.\n\nA better place would be Giovanni’s in Windsor Terrace. They have a two course brunch with unlimited mimosas for $27, which is a MUCH better deal."
        }
    ],
    "reviews_count": 62
}