{
    "name": "Sesame - Flatbush",
    "place_id": "ChIJoUU4u8ZEwokRfHi2dw3E35A",
    "grid": "BK14",
    "address": "1540 Coney Island Ave, Brooklyn, NY 11230, USA",
    "rating": 4.6,
    "user_ratings_total": 351,
    "phone_number": "(718) 427-0000",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMFExQkhlSGw1YVRkNWRtSk5aR3BSTFU0emNrRRAB",
            "text": "Highly recommend!!!!!! Best bakery in Brooklyn"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210d1QySkJTRFp3YjJkT1RrOXFSMGhuU1hZdE0zYxAB",
            "text": "good food"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NThmM2RBEAE",
            "text": "Great customize your own sandwich/salad bar. Good coffee. Also legendary donuts. They have fresh, ready to go meals also. And usually a hot pasta self service station. Parve chulent and kishka on Thursdays. No seating."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLV1B4S1hteEp6ZGJREAE",
            "text": "Always get a s salad everyday  the prices are different .\nAsked for small salad $17 the day before $10 what’s going on won’t go there again not the first time it happens"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLcjJtOFNqdnVDUW53RRAB",
            "text": "garbage service, food is decent"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcmRPc2tRRRAB",
            "text": "Very good nice clean store, fresh, used to be affordable, and have price tags on every item, now there's no more prices on any of the items so when you show up to the register you get charged like $6 for a donut. But otherwise good food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOXVXdk9nEAE",
            "text": "Very good bagels , nice atmosphere and service . Well done 👏 ✔️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bDhtd0lREAE",
            "text": "Very good place"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNk9udmhnRRAB",
            "text": "Love food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRZ2FlZEhBEAE",
            "text": "These are some of the best doughnuts you will find anywhere. Good ingredients, yet very indulgent. Nice staff. On the pricey side, but good quality often is. Great bakery."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneGV1V29RRRAB",
            "text": "Awesome"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMXZLUGJBEAE",
            "text": "Good food. Little pricey"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmd3RtajZ3RRAB",
            "text": "I stopped in during Hanukkah for Sufganiyot. They had a huge selection of flavors, and I was thrilled how many parve options there were. I got the custard, salted caramel pretzel, chocolate rosemary and lotus.\n\nAll were delicious. The salted caramel pretzel was my favorite followed by the custard. They are a very dense bread-y donut, but the amount of filling is proportional!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2XzZMMGJ3EAE",
            "text": "No order to who is next in line. Donuts are overpriced and not worth it. Very disappointing. The whole family took a bite and decided it wasn’t worth the calories or the money"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NTdpblpBEAE",
            "text": "Amazing, l definitely recommend everyone to visit."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OTVDRC13RRAB",
            "text": "Good food, the store is super clean."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2alBUT0V3EAE",
            "text": "Really enjoyed this spot and they've upped their game from years ago. Where else can you get a professional sandwich that's kosher? Super fast service, wide selection of breads, dairy ingredients and pastries. The egg and cheese came out super quick (spicy mayo, banana peppers, tomatoes and crunchy onions). Service was great. My kids loved it. No tables to sit. Try the iced Frappuccino!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzczlydU93EAE",
            "text": "You should Start doing Food Stamps cards"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueGF5WTZnRRAB",
            "text": "Food is good and the store is nice. However, they run a shady business! No menu and no prices displayed, which is always a huge red flag.\nI asked the girl behind the counter how much a tuna and vegetable bagel would be, she gave me a price and I ordered that. Paid and had to specifically ask for a receipt... That made me double check it only to find they discreetly added an unidentified extra charge. Asked what it was for, guy said \"coz you added too many vegetables\" and this is after I specially asked the girl the price *with vegetables*! Now that's shady, it's not about the amount of $. I obviously said that wasn't fair and they should have said so or have it posted. Girl said too bad and went to help the next customer. Only after I insisted that it wasn't fair and if they didn't fix it I'd dispute the whole charge did he tell her to return a dollar to me (still ripped me off for the extra tax but I'd already made my point so let it slide).\nThat is a scam! How many unsuspecting customers are they scamming?! Disgustingly dishonest."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMzZ2dHFBRRAB",
            "text": "The food is always fresh and delicious. They have package food, bagels, baguettes and can make sandwiches 🥪 Don't forget to try their ice coffee it's amazing!\n\nThe store can sometimes be overcrowded as is sometimes common in high demand areas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdmVua1d3EAE",
            "text": "Great store has the best challah on Fridays"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcmJqQnh3RRAB",
            "text": "The young lady who served me was extremely nice. Smiled feom ear to ear. She is the short one near the food serving department."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqb3VHQ1JREAE",
            "text": "One of the most popular bakeries in the neighborhood every time I walk on here there's also plenty of people looking to indulge in the delicious appetizing yummy baked goods here!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcnBTc2tnRRAB",
            "text": "Got a few bagels, a sourdough roll, and and assortment of pastries that were all so delicious and excellent - couldn't ask for fresher.\n\nHowever, service times are very slow and disorganized, with unattended children running amok."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eDQ3cWJREAE",
            "text": "Love Sesame! They were great to work with. They made us dough for Purim parties!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OE9TaVF3EAE",
            "text": "Dangerously tempting to break all diets. Startlingly creative hamantaschen. Cheese danishes that are a must. Good coffee and helpful staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMlpfZG9RRRAB",
            "text": "I never really know the names of anything I grab when Im in there, but its always delicious. Theres this reddish cinnamon type croissant that is absolutely delicious. I also like a danish type thing with powdered sugar on it. Anything you grab will not disappoint."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaC11MGFBEAE",
            "text": "Cashier is rude"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxZ3JHNk93EAE",
            "text": "This place is so delicious . The quality of the food was so fully . I couldn’t finished all of it. The food is so fresh. I love that we chose the bagels. The price of the food is wonderful. I’m definitely coming back again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2alpfMGhRRRAB",
            "text": "Has the best donuts"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWbmNDZWt3RRAB",
            "text": "Amazing bakery good food but sometimes there are big lines and it a little overpriced but overall its a good bakery"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWamVQZzBRRRAB",
            "text": "Really, jewish Brooklyn place.\nWe visited it on Hanukkah and found a lot of sufganiyot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWMk03ZlF3EAE",
            "text": "Great donuts"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWLTVqLTh3RRAB",
            "text": "Super quality bakery shop in brooklyn,always fresh products."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcmFHakl3EAE",
            "text": "This is one of the best takeout bakery shops in the city. They have a variety of hot n cold coffees n drinks, as well as delicious fresh bread and a full sandwich bar. The donuts here are insane n the danishes n cookies are pretty solid. Expect to pay a pretty penny when coming because this store ain't cheap"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1b2JTaDJBRRAB",
            "text": "Went today to get a bagel and a coffee figuring it will cost me under $10 turns out my bill was $19 INSANITY!!!!. The real issue Is that there is no price list on the wall to tell you how much they are going to over charge you. It's illegal to not show prices."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMWI2UFV3EAE",
            "text": "Good service amazing treats and fresh food top 5 for sure"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMTV6ZFVnEAE",
            "text": "Excellent kosher bakery"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabjhYOEJREAE",
            "text": "A great place to enjoy fresh pastries and desserts. The range of products is great, and the quality of products is excellent. The service is fast and friendly, and the prices are quite affordable. I recommend Bakery Sesame to anyone who is looking for a cozy place for breakfast, lunch or dinner"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaemR5SzhnRRAB",
            "text": "Got a simple toasted bagel with cream cheese ~$3.50. Perfect texture and flavor. Only problem is the place is really unhygienic with no tongs and every customer barehanding the baked goods and bagels from communal trays."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabGNTRXl3RRAB",
            "text": "Very fast service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyN19UeHhRRRAB",
            "text": "I'm convinced that they have some secret technique and their own super yeast because the texture and consistency of these bagels and doughnuts are unlike anything else in NYC. It's chewy, moist, and there's a bounce to the bite. It's a little bit mochi like in terms of mouth feel. The prices are unbelievably excellent as well!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydnVqZUFnEAE",
            "text": "I really enjoyed the unique aspect of these donuts. They were overly sweet for me but my family enjoyed them. If you are not a big fan of dense sweets, don’t buy too many at once. The caramel one was quite enjoyable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eEpIWUN3EAE",
            "text": "Giant cream filled donuts but I wouldn’t call them donuts, the breading has the chew of a soft bagel. Also it was very sweet and very messy to eat so grab extra napkins. I didnt see labels for the stuff in the middle island so I had no idea what each thing was."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNNi0yWFFBEAE",
            "text": "Fresh everything, great coffee, bagels muffins and all types of pastries, open early\nvery clean, good prices...…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcjRtNmtBRRAB",
            "text": "Here the first time, pretty nice store, food looked delicious and so was my sandwich, just not sure why the guy charged me separately for the sandwich and separately for the coffee when I told him I wanted their breakfast special which is these two items for a better price but I paid more... Otherwise I'd probably visit again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVeVBQMFBBEAE",
            "text": "If you're looking for a doughnut and coffee in Midwood, stop your search. This place is fantastic. I could spend all day looking at their baked goods!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZc0lhd3dnRRAB",
            "text": "Small modern Bakery/Cafe on a street corner in Flatbush. Got some pastries and coffee. Their pastries are so fresh and out of this world. Tasted like they were straight out of the oven😋 This is definitely one of my favorite spots for getting fresh baked goods and coffee. Love their chocolate danishes and hot coffee.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvbWNPa09BEAE",
            "text": "I love sesame because there pastries are always so delicious and fresh. The best thing that you must try is the lotus doughnut and the corn muffin they also have fresh vegetables for the amazing salad bar and also the bagel bar - my 11 yr olds review"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTa3BDQU5nEAE",
            "text": "One of the best bakeries in Brooklyn! Everything looks and tastes amazing!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMXJfcU5BEAE",
            "text": "Worth the wait! Very busy on the Sunday morning we stopped by, but very fast employees. Wide selection of baked goods, the donuts were amazing - a uniquely dense and chewy dough. The bagels were also great, nice and chewy. And last but not least, a delicious chocolate croissant."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdGJMWWh3RRAB",
            "text": "My office is right there, so I go almost every day. The pastries are phenomenal minus a few things. The bagels are great when they are fresh. The coffee is also very good as well. What I don't like is that since they are still newish, they…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDcWFhWjJnRRAB",
            "text": "I just had the best, tastiest mouth watering, scrumptious donut ever.\nI stood there in the shop and ate this cream cheese, cream filled donut and didn't waste one crumb.\nThen I told all the people in the shop to buy one before someone else gets it.\nAbsolutely insane\nI wanted to go back in the middle of the day and buy another one.\nThis donut was oozing cream and I was scared that it would drop on the floor.\nI made sure that it didn't.\nIt was soft, too soft and too fresh.\nIf you are going to gain calories at least make sure that you are going to eat something that you cannot resist.\nMy diet just went out the window"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBemN6ZnFBRRAB",
            "text": "Really tasty food but occasionally expensive. They charged me $3.50 for a scrambled egg sandwich which sounded reasonable but then charged me an extra dollar for every morsel of food I put inside. Also charged me an extra dollar because I…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeUwyalBnEAE",
            "text": "I wanted to buy coffee and rolls to go.  But they kicked me out because I was with a dog.  The other customers weren't bothered by the dog. Didn't see any signs saying no pets allowed.  I do not recommend this place👎…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxd3BuUnV3RRAB",
            "text": "I just had a great pastry at Sesame. It tasted fresh and very chocolaty. The only objection is that they keep their front door open and some flies get in. 5 stars for their pastries."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNDYzZzZnRRAB",
            "text": "I’ve seen so many times people coming in touching the bagels and bakery goods without any paper or gloves, then putting it back. This place is super unsanitary and expensive. I’m surprised health department didn’t close them down."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwaTg2cVpBEAE",
            "text": "Heavenly smelling and tasting cafe /bakery.\nI brought a strawberry drink, and they gave me a free amazing chocolate filled donut!\nThey have a lot of variety of drinks and pastries!\nPlus, everything is very fresh and they have pareve choloent and potato kugel on Thursday night!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaFpYLXBnRRAB",
            "text": "Omg, this plase is DISGUSTING!  Stay away if you do not want to catch stomach virus or dirty hands sickness.\nI loved this little bakery when it got open. But with time it became HELL. Customers touch everything with hands, breaking pastries and putting back. I saw today one boy just smashed pastry and left. Another boy snifed and touched pastry. Adults are not different,  acting like animals, touching everything with unwashed hands. People are you serious?!  It is DISGUSTING! YOU TOUCHED YOU BUY!\nOwners please watch cameras, your place is a zoo.  How it is even allowed?\n\nNever again.  This bakery should be reported to the heath department"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBN2JfQnp3RRAB",
            "text": "Bakery delivered fresh every morning from ostrovsky on ave j .same price as them ..\nBought the compact lunch box with Tuna eggs and veggies for 7.99 was truly disappointed wasn't fresh at all tomatoes were soft and mushy lettuce weren't crunchy.\nGirls behind counter don't tall English and Manager /owner nowhere to be found"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwdHU3TzV3RRAB",
            "text": "Great food super clean... They could improve  their service a bit , and also they never put any napkins with your food order.. Otherwise I would have given them 5 stars..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHMlp6ZEVnEAE",
            "text": "I love this place it's a great place to get a quick breakfast the service is good but a bit crowded at times but overall it's a quick trip max 5 minutes and the breads are all freshly baked daily"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdWFTMHJRRRAB",
            "text": "I have MANY food allergies,  one which is dairy.   My bestie  is jewish and introduced me to parve, well that was it for me.  These donuts are remarkable 😋   I'm in luv. BOWTIES yummy 😋…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMk9LTWhRRRAB",
            "text": "They have delicious donuts, danishes, and iced coffee. Their tuna wraps are perfection incarnate. They're a bit pricey, but it's worth it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNcWRpWS1RRRAB",
            "text": "Sesame bakery is the go to place when it comes to freshly baked goods.They have a variety of bagels, paninis, delicious muffins, croissants, and of course their legendary tasty Doughnuts especially around Chanukah time!…"
        }
    ],
    "reviews_count": 65
}