{
    "name": "Cafe Madeline",
    "place_id": "ChIJMUkOETdbwokRAmjoHlECnK0",
    "grid": "BK14",
    "address": "1603 Cortelyou Rd, Brooklyn, NY 11226, USA",
    "rating": 4.4,
    "user_ratings_total": 1082,
    "phone_number": "(718) 941-4020",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSmFFNUtjbVJuT0RWS2IwcG9UR0ZXY1VWM09VRRAB",
            "text": "I do not know what is the big hype with this place. 1 hr wait for take out. Yeah its not that serious, especially for how much it cost! I understand there are other orders. But their wait time is way too long. And then they forget condiments. Lol."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WldHSk9jMlF0T1RaNFFUZG5Vbmx0YTBoeFlWRRAB",
            "text": "Thank you for having delicious and nutritious vegan options!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRc3VIckF3EAE",
            "text": "Except for their coffee, everything here is presented with quality in mind. Pastries and prices in general here, have creeped up over the years. I customize my turkey, bacon , lettuce and tomato with spicy mayo on a sour dough bread for a fine sandwich.  No questions asked. Wish they carried arugula for my sandwiches"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCU1VqbDRkRnBLWW5GQmRXSnBRMGx1Y1cxa05YYxAB",
            "text": "While the menu is massive, all of the dishes I’ve had here have been fantastic. They are on the pricier side but it’s because they are so damn good and fresh. Coffee is great too - have had multiple friends visit and state it’s the one of the best drinks they’ve had. Super friendly staff as well. Only downside is it can get crowded but that’s just bc it’s a popular local spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRdFdUZE9NMUZwVkcwd1JYaEpVMUUyY0hFNVUyYxAB",
            "text": "I really can’t begin to say how delicious everything was"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaS1pVeDFTMEpSYW1Sc1dYTlNXWFJ4WVZsRWJXYxAB",
            "text": "I have not posted a review in a long time but I had to leave one for this beautiful gem of a restaurant. We live in the area and being a large family, we do not eat out anywhere fancy or above a certain price range. I almost did not give this place a shot because its prices are just a tad bit above other breakfast options in the area, but man oh man are they worth every single penny. The food is always prepared perfectly. Nothing has been overcooked in ny 5 visits back to back. They have amazing and different pastries that I have not seen anywhere else outside of very niche or focused pastry shops. The menu serves everyone by offering options for everything  from gluten free, vegan, or even keto dietary needs. The prices are a tad higher than others in the area but honestly try a lobster roll from here and realize you get more meat and less fluff (like mayo or other accompaniments) than from places like the red hook lobster pound who skimp on the lobster and charge an absurd amount. The French toast options were all delicious. The flatbush breakfast was superb and everything worked so well together (I would use bellas instead of shitake mushrooms but nonetheless it was delicious). The star of everything here is the Coffee. Madeline uses a Brooklyn owned snd operated coffee maker with known quality and the baristas are gods and goddesses among men. I love coffee. I mean it. I live for a good cup or even two in a day. I have never had better coffee that is consistent and balanced. I absolutely love them. I do not make these determinations lightly friends but this is hands down one of the best places to eat in Brooklyn for breakfast or brunch and with the service being as good as it is for as popular as it is (go on Saturday or Sunday morning and my god you would think your on the stock exchange main floor during a major IPO event). Eat here ny friends they are awesome and deserve every bit of money, love, and support. Madelines is the heart of Cortelyou and deserves the title undisputed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVVNYTm1aSG90TVZrM2RHcEJSRGgyYlZaTlltYxAB",
            "text": "i really want to like this place but its modern robbery tbh it’s WAY too expensive. i just paid $17 for a “breakfast sandwich” that literally only had cheese and avocado on it. all their breakfast sandwiches are the same price, even the one…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBM2RXcDVlVzkxV1hRMFowVkdkRVIxUW01R05YYxAB",
            "text": "Yes, it’s expensive - but this is the best pastry & brunch spot in the area, hands down. The service is also really nice, the WiFi is fast, and they always have a good playlist on!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwd00zZHJSbUZFTVU1cllteHBRMjE1VVRoNlNrRRAB",
            "text": "ordered a breakfast sandwich & it was missing something and on the wrong bread. overpriced and just okay but nice staff"
        },
        {
            "date": "1달 전",
            "language": "fy",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUVREaFRPV2hMWVdGUVRrSkxkazVFZG1vNVMzYxAB",
            "text": "Sweet potato brekkie. Fabulous"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNlpHdzRPR1p6TFhkVFduTnBlVVZzTUc1T1ZuYxAB",
            "text": "They serve food, real food. Just look at their vegetables, it's impeccable, fresh, and colorful by design.\n\nThey used to be priced higher than average for a breakfast/brunch plate but $15-20 is a very good deal for this quality.\n\nThings get hectic during Sunday brunch but is delightful on other days."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLUEh1WWZDLUxuYWh3RRAB",
            "text": "They have delicious cafecito as well as kouign amann, and other pastries. I saw Carrot cake today and it was Y U M. So much walnuts in it and its filled.\nOne ipad counter for ordering, a bit inconvenient. Creamy ice latte tho. My sesame bagel experience, were mid. (nopics): Financier Madeleine was too sweet."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aek1UUk9ReTFETmxWTk9HZFZWbXBOT0doUmFFRRAB",
            "text": "Love cafe Madeline"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV1RFVk9kWHBKVkRjdGJYQmlOelp6TlV0S04yYxAB",
            "text": "Madeline is a great spot for breakfast! Delicious food and friendly service. I’ll definitely come back again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSVNFcDZZMU5tTkZCNVRYUnhVQzFYWVdVeE9FRRAB",
            "text": "Had the pastrami brekkie and added halloumi to it. Also had the berry pancakes. Both were amazing, loved it! Servers are super nice and helpful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNk1EWnhiR0kyYTNOaGNrWjFVa3gyZUZob2RVRRAB",
            "text": "Always satisfying.👍👍👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWGIzZEJUMTlVWkdSSWNHMXdSWEZqT0ZCdGJYYxAB",
            "text": "Good coffee and food, but a little lacking in spice"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wd1JsZzVSRU15Tm01Q2FUTllXRUkxVW5aRFEwRRAB",
            "text": "incredibly cute people, amazing food, and chill neighberhood 🥰🥰"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MFdYSjNOM2RQTWtsMlFYUTRaVWgwVGs0MWRVRRAB",
            "text": "Huge range of breakfast options. Delicious coffe and lovely oatmeal. I'll definitely return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wd1ZGUnhka2xPY2tGTVRsaEpZMVIxY1ZCNFNVRRAB",
            "text": "Cafe Madeline is my go-to spot for breakfast in the mornings! The vibe is always calm and welcoming, and the service is quick and friendly. I usually get the ABC sandwich and a matcha, both are consistently fresh and delicious. The sandwich is perfectly balanced, and the matcha has just the right amount of sweetness. Definitely a favorite in the neighborhood!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdEx2NVdBEAE",
            "text": "if u ever on cortelyou and u want a great breakfast place u must go here great coffee and please ask for the wellness tea  its excellent breakfast spot"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRWNrZzFZbVE0WVdSV1YweEpjRTFuU2tkb1EzYxAB",
            "text": "I love this place. Their French toast with the berries and roasted pecans  is  really scrumptious. The owner, always makes you feel welcome when you go. I definitely recommend this place"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bzd6WXJ3RRAB",
            "text": "Worth it if you are in the neighborhood or from the neighborhood. In my case, I was visiting. Way more spacious than it seems, laptop friendly, and yes the food, service are great  - actually a lot better than I had expected."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUU4ybHJZVFkzWWpGeGRERkJlakJDTm5CMWNFRRAB",
            "text": "Highly recommend this place, service, food and drinks are excellent.\nThe service is amazing, the staff are absolutely lovely and brighten your day.\nThere's and endless selection of delicious food and the portions are big, you really get your money's worth. The food is also absolutely delicious, we had the Avocado Biscuit, the Croissant burger (without meat), an iced matcha latte each (one oat, one cow milk), a strawberry ginger apple juice and a flat white. Everything was high quality and very yummy."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybE1xa0NnEAE",
            "text": "The food is always fresh and delicious. I highly recommend their juices, croissants, and fig & fried egg grilled cheese. You order at the counter and they bring the food to your table. You have to get your coffee at the counter but other drinks theyll bring to you. Lots of seating. The bathrooms are pretty dirty and the cleanliness of the seating areas vary."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQUG1tTy1XX2FybFpnEAE",
            "text": "Great organization food and very good coffee in a very casual atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJRHUyY0NBLUtpdEl3EAE",
            "text": "I had a little anxiety ordering an $18 BLT…this would either be an overpriced trendy place or the best BLT ever. It is expensive after all. Cafe Madeline did not disappoint, the sandwiches, salad, coffee…all spot on. Warm bread, thick but slightly crispy bacon, creamy but not over-ripe avocado…I would go back just for the BLT alone! Delicious and friendly staff who are attentive to their guests…a rare find in a post Covid service world. I will be back 😍"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLS0VxdjM4MHYzREdREAE",
            "text": "Such a nice local cafe! Good food! Lots on the menu and they also have smoothies in addition to coffee/teas. They make a solid matcha latte here and have good non-dairy milk options."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNNlU2Y242Z0lyUV9BRRAB",
            "text": "It's a great place and good employes!! El pan con cardamomo es excelente!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKU0l0Y1N4NTlhejhRRRAB",
            "text": "My friends and I call this place \"Sign Hell.\" Great food though!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJX2tsUFhpNXJqb1pnEAE",
            "text": "I love this place so beautiful"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJTzN3Nkw1MS1TSWVREAE",
            "text": "I’ve been a loyal customer for over a decade, and have never had a disappointing meal here. The drinks are incredible (the guava matcha and the caramel latte in particular), the food is amazing, and the menu is always acquiring new items. Worth every penny"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVN2FYUmdBRRAB",
            "text": "Update: I loved my smoothie and as usual they are quite responsive. This spot will continue to be on my list for a quick, healthy meal or a leisurely brunch with hubby/ friends.\n\nFrom a professional standpoint, I also give them top points for training. (The kitchen area was packed, but it seemed like some people were being trained, and that's always good for business. It means that as a customer I'll keep getting good service, and in turn I'll keep coming back)\n\nLovely selection of breakfast items. The Ginger tumeric latte is awesome! And the fact that I can get my sandwich gluten free, makes this place a home run."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZXdpZGlGdTlfZUpBEAE",
            "text": "👍"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNUoySFZ3EAE",
            "text": "For premium coffee please change the coffee lids!\nIt spills all over when I drink it. Cheap and flimsy lids that don’t fit properly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaTdlajRBRRAB",
            "text": "awesome"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaW9pVUhREAE",
            "text": "The owner is a true entrepreneur of creating diverse food options. Healthy options are his focus health is wealth. In which his staff give more than smiles and call you by name is delighted."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNTcyc1Z3EAE",
            "text": "Popular in the afternoon, early evening in spite of pricey menu. Service is meh, seem less than interested in customer needs. Not exactly slow, but distracted by their phones. Outside is nicer to avoid the noise inside."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcy0zdEhREAE",
            "text": "Excelente atención muy ricas ensaladas y bebidas"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvZ2ZhRkVnEAE",
            "text": "Huge menu (sometimes pretty overwhelming) but since the food is so good, there are so many yummy things to try. I’ve enjoyed lots of different egg dishes, sandwiches and smoothies! It’s always a treat when we come here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbnNHZ3F3RRAB",
            "text": "This café is what brunch dreams are made of. The eggs? So fresh I half expected to see the chicken who laid them sipping coffee at the next table. Everything tasted straight from the farm—simple, honest, and ridiculously good. I had the avocado toast with poached eggs, and they were perfectly jammy, like someone whispered words of encouragement to them while cooking. Cozy atmosphere, friendly staff, and strong coffee that doesn’t mess around. It’s the kind of place that makes you want to slow down and savor every bite. 10/10 would brunch again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc09xblFnEAE",
            "text": "Loved that it has gluten free options and substitutions"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMnF1cjRnRRAB",
            "text": "It was a little too healthy for me... I want to eat GOOD ood when I pay. The service was slow and it was crouded."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbi1mbXV3RRAB",
            "text": "expensive disappointment, not worth it - ordered the most expensive sandwich on the menu, a $20 tuna melt. tuna was cold but the cheese on top was melted somehow? which made it a weird texture, very chewy. really unimpressed considering it was $20\n\nblueberry lassi was good though"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OUo3T0lREAE",
            "text": "Great food, very fresh."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMGNuR3JRRRAB",
            "text": "Delicious! Love the cardamom buns and other pastries. Yummy eggs and great, fresh salads. My only suggestion is offering glasses and mugs for drinks to stay. I bring my own mason jar and they always prepare my coffee in it! Thank you! :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dDdUQ1lREAE",
            "text": "Hands down my favorite cafe in Brooklyn! Love their bowls, always hearty and delicious. The smoothie and juices are yummy too. They have outdoor seating and a great indoor area with plenty of outlets if you need to get some work done."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIM1lxWFBBEAE",
            "text": "The food at this breakfast spot hits! Everything we ordered was fresh, flavorful, and well-prepared. I especially enjoyed my banana & peanut butter smoothie bowl.\n\nHowever, be prepared for a bit of a wait. It was pretty crowded when we arrived, and finding a table took some time. Also, the prices are on the higher side for breakfast.\n\nOverall, though, if you're looking for a tasty meal and don't mind the crowd or the price, it's definitely worth a visit!"
        },
        {
            "date": "9달 전",
            "language": "vi",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNDdxVGlBRRAB",
            "text": "Chỗ ăn sáng ngon nhất Brooklyn, đồ ăn tươi organic khẩu phần nhiều ăn ko hết (tui con gái ăn ít), đồ uống sáng tạo. Nhưng giá mắc nha quý dzị. Lâu lâu đi ăn thì được chớ ăn hoài phá sản. Tui kiu 2 món, 1 li ca phê hết $50 mấy. 😱"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1a1BYc0RBEAE",
            "text": "Cafe Madeline has quiet a big menu, the food was super yummy, it’s extremely fast service!\nI had the brekkie sandwich. It was a little messy but nice. Very filling! My friend had the roasted potato’s and mushroom and added Turkey bacon :-)\n\nThe cafe is quiet big inside, the staff are friendly. Coffee was ok quiet milky. Would definitely go back there again."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNWNieDhBRRAB",
            "text": "Super fresh ingredients and preparation. Tons of indoor and outdoor seating. Love the menu but they def need way more vegan options. Great spot for breakfast/lunch/brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyM3FEVHRRRRAB",
            "text": "Thank god some one told this was the place bcuz it looks different now. I love the coffe but I really love that they have everything !!\nI got super thick bacon and 3 fluffy blue berry pancakes.\nSoooj good I ate outside and a perfect Sunday morning"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbktfMkRREAE",
            "text": "Salmon was the perfect balance of char on the outside and tender on the inside. Chicken and waffles was basic, but good - chicken was also perfectly crispy outside, tender and juicy within. Owner sat outside chatting with patrons, and he was keeping a keen eye on things.\n\nOnly took a star away from service because it was a little confusing if we should order at the counter or if a waiter would come by. Would love it if they were a little clearer about how to order."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlekpUSHZBRRAB",
            "text": "A great place for healthy food. When I lived nearby 4 years ago, Cafe Madeline is my favorite bagel place. I love their bagel and lox to death. Last week I went back to NYC and tried to get the perfect bagel in my memory. Overall the indigents were fresh, but I think the flavor changed a little bit. The cream tasted more like sour cream instead of cream cheese. But the smoked salmon was still the best! Though it was not the one in my memory, I would still highly recommend everyone to try this."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbmEtNlVREAE",
            "text": "Fantastic service. First thing I did when I got utensils was drop them on the floor and before I could pick them up they team here already had new ones on the table me. The menu situation at the counter was a little difficult to maneuver as there were a ton of different menus strewn everywhere. Once I food the menu I needed, everything was in large font and easy to navigate. Got the Big Fat Greek Wrap. The wrap was good. The avocado and hummus dominate the flavor of the wrap. Enjoyed it very much. Punk rock music playlist was on while I was here 🤘🏼💯, Foo Fighters, Taking Back Sunday and Dashboard Confessional all played while I was eating. That kind of music has a soft spot in my heart as I enjoyed that music very much during my teenage years"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucXJxN3lBRRAB",
            "text": "My mom and I really enjoy this cafe. The portions are good and the menu has a big selection. It’s a little cramped inside sometimes, but there’s always seats. I see people working on their laptops. They have a back room with more tables too. Coffee is good too!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReTdhY3FBRRAB",
            "text": "Came here for Sunday brunch. The place is small and casual. There's no sit down service for those who are new to the place, if you're coming in with a group you should probably find seating first. You order at the front and they will bring the food to your table.\n\nThe food was presented well and it was really tasty. The drinks are average with a beautiful presentation. Only thing I wish they would fix is the ventilation in the place. When I came out of the place, i smelled like grease. Overall, excellent place to eat!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyak1EQ0VBEAE",
            "text": "Past Sunday we drive around Brooklyn.\nWe saw line next to a spot same cafe Madeline …we went in and order few things\nWas busy the place the owner saw we with kids and was very helpful and generous\nWe for sure recommend to go there and we for sure will come back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1eW95X1hREAE",
            "text": "The food was incredibly fresh and so tasty. Very well prepared. The staff is so friendly and the atmosphere is inviting. Definitely make a stop here every chance you get"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbHVxWnF3RRAB",
            "text": "This is a neighborhood staple! I come here primarily for break-feast or brunch. Service is good. The line is long sometimes but don’t be discouraged it moves fast. The atmosphere could be improved but it’s more of a casual place to meet with friends. The food is amazing, fresh and prepared fast.  Would highly recommend!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdExtQ1dnEAE",
            "text": "This used to be my sleeper spot but it looks like the secret is out. Friendliest staff, short wait times even with the long lines. Try the maple latte, it’s my favorite! If you love matcha, you will be obsessed with this spot. They have such a unique menu and everything is so fresh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMy1td1dREAE",
            "text": "Swung by this place hungry after a workout but was disappointed by the chicken curry sandwich I ordered. The “focaccia”  bread felt stale to the touch and the chicken itself was dry to the bone and flavorless. The side salad was barely there. Not at all worth the $18.45. Although the staff and atmosphere seem nice, I will not likely be back here for the food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwNXRDLTFRRRAB",
            "text": "TASTY! And super reasonable prices. Great service. Long menu, lots of selections but not in a bad, diner food kind of way. Everything is described and looks great, you may have a hard time making a selection. Had the breakfast biscuit…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdnRickF3EAE",
            "text": "The quality of their ingredients is fresh and abundant (pretty much any dish gets a half of an avocado). The food presentation is beautiful but I wish it was more functional. Pictured is the crispy eggs and if you notice the brioche is cut to make two triangular prisms lol. So much harder to eat instead of making slices. And it’s pretty expensive too. Overall really good but I feel like they make food for pictures not for eating. Coffees and juices are great as well!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWeHRPMmJ3EAE",
            "text": "My favorite restaurant in Ditmas Park, but also possibly in Brooklyn! The staff is so sweet and kind, the food is so consistently delicious and they have the BEST coffee drinks in the neighborhood. Prices vary depending on what you get and how you customize it, but I feel like for the high quality ingredients they’re super appropriate.\n\nThe menu is constantly being updated but they keep a core 50-ish items that never change. The new things they’re always adding are so creative and interesting and always make me want to try something I wouldn’t necessarily normally try!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxeS0tRzJRRRAB",
            "text": "I’m always taken away by their good service and their quality of food/drinks. The coffee here is fantastic and it’s a absolute joy watching the chef cooking while you’re waiting by the drinks area, pure art. Try their fig+apple sandwich, their mocha latte, regular coffee and their cold brew.\n\nThey also have the worlds healthiest tea I believe that’s what it’s called - it’ll cure any kind of cold/flu/virus!\n\nAlso remember they have a handful of menus so look thru everything before placing your order."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtd3VxczRBRRAB",
            "text": "Visited on a Sunday morning at noon and snagged a table inside. The menus were overwhelming so I would recommend taking a look beforehand.\nThe PSA smoothie with banana was hands down the best smoothie I’ve ever had. Pink Morning smoothie bowl was tart, but good. I would recommend not getting the raspberries or adding extra granola for sweetness. For our mains, we had the brekkie sandwich on a croissant and the Madeline brioche plate - delicious! We also tried the cinnamon bun (not pictured) which had a little hint of lemon.\nEverything was delicious! I craved this for the next two days after our visit 🤤"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbU15anJ3RRAB",
            "text": "Not sure why I haven't written a review for this place, as I've been coming here for at least a year now and have never had a bad experience.\n\nTheir food is top notch. My favorite's gotta be the Grilled Cheese Omelette. Everything on the menu is a tiny bit pricier than most places, but as soon as you see the food you'll understand why. Everything tastes amazing and their plating is on another level.\n\nAs far as coffee goes, their cold brew is super solid, but I recommend trying the Macadamia Latte—hot or iced—with just a little agave.\n\nThe best part about this place is that it's huge, beautiful, and bright. It gets busy but there's almost always one or two seats up for grabs, and plenty of places to plug in if you need to charge up your phone or use your laptop. It's a great place to sit down for a while and get some work done."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMW9lUzFnRRAB",
            "text": "This place blew my mind! Everything here tasted absolutely amazing. We visited Brooklyn and NY for only 3 days but we came here for breakfast twice. The bacons were thick and juicy, the scrambled eggs were fluffy and perfectly flavoured,…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNbGJhOF93RRAB",
            "text": "Nice cafe with good food. Thought it was a bit overpriced for the area but at least the portions were good and the food was tasty. Everyone was happy with their meals.\n\nIt was crazy crowded and busy on a Saturday, but our food came surprisingly quickly and we were able to snag a table. I wish they didn't allow laptop workers on the weekends as about a third of the people here we're taking up lots of space just on the laptops.\n\nI also think they could do better with labeling vegetarian/vegan options so people don't have to pester staff with questions.\n\nBut all and all it's a nice place for a coffee or brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGaGZXdGpBRRAB",
            "text": "Lovely place with super friendly staff!\nI ordered smth wrong (a sandwich with Halloumi but I'm a vegan) and it was no problem at all. The waiter offered to change the halloumi to Tofu and they made me a whole new sandwich even with vegan bread. It was so delicious!\n(On the picture you can see only half of the sandwich... 😁)"
        }
    ],
    "reviews_count": 71
}