{
    "name": "MangoSeed Restaurant",
    "place_id": "ChIJ0ZK6zGpbwokRuqUhA8Yxw7Q",
    "grid": "BK14",
    "address": "755 Flatbush Ave, Brooklyn, NY 11226, USA",
    "rating": 4.4,
    "user_ratings_total": 1126,
    "phone_number": "(718) 513-6084",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSVExSkVTRjlHYUVkM016RklMVzVaVGpaRllrRRAB",
            "text": "I schedule meetings nearby just so I can eat here after. This exemplifies the standard for customer treatment. The whole group praised what they selected. This spot mixes high-end design with cozy touches. This place has mastered every detail."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTmRrWkJhbW90ZUV0a1VHdFNaSFp6ZFhCVWNtYxAB",
            "text": "The food was amazing. My husband had so much fun there. I love love love it. It was top-notch, can't complain."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWT1lTMTBRM0ZXTkZCMWQyUmxXWFZrZEU1V1IzYxAB",
            "text": "I would recommend. The wait staff was very attentive and friendly. The atmosphere cozy. The music playlist was great. However, sound a little loud for me. It may be because I am older 😀). I had the burger, fries and macaroni and cheese. The macaroni was delicious. The burger was tasty but had bits of gristle so disappointed.  I would defintely return but probably order something  else."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPc1luUnd3RRAB",
            "text": "I hope you guys see this, I came here after work one day expecting my jerk salmon and plantains, after waiting an hour they bring out burnt jerk salmon that was cold. The dread bartender tried to convince me that that’s how jerk salmon is. I’m no fool I know how to cook this place has really gone down."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUVFUVlROMmhYV2pSZlNtaGxXSEJSV1dWTWNsRRAB",
            "text": "I went on a Sunday around 1pm. Food and drinks were good. I had the Jerk Salmon and Rum Punch. Music was a little too loud, couldn't really have a conversation. Other than that service was good and I would go again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbFlrcGZTbVZsTURZeFZEaFhZbFZhYkhnM1puYxAB",
            "text": "Just know this, the drinks are well made  and strong! Also, the music was such a vibe, felt transported into the early 2000s island music mash up!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cd1JWcEZVRlJqUnpKcVIyUTBaVUZhVTBsUk5IYxAB",
            "text": "Amazing food and service. RECOMMENDED!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZM1QzcEZTRTlIVWpCck1reFhPRU5hYjBOVlkzYxAB",
            "text": "Chicken🐔 and Waffles 🧇 were amazing!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQlIwdzFSMnd6ZHpoMVpFRnRUMmw2YUhwTWNIYxAB",
            "text": "I hadn’t been to Mango Seed Restaurant in a long time, so when a friend suggested we go for dinner, I was excited to return—and I’m glad I did! The food was just as good as I remember. The jerk Bronzino with spinach excellent; the fish was seasoned well, and the spinach on top added a wonderful flavor. The rice and peas & plantains were also delicious.\n\nThe jerk wings were another highlight—crispy, flavorful, and satisfying. The only thing I wasn’t a fan of was the mac and cheese;\n\nI wiI definitely need to go back again soon. If you’re ever in the neighborhood, I highly recommend you visit Mango Seed Restaurant—you won’t be disappointed!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdk0zRkVZM3BpZERWZlJqSkpVbmRSZDBaSGMxRRAB",
            "text": "Great music, stellar customer service and the food was the amazing. I had the fish and grits, my sisters had the oxtails and grits and both meals were so delicious. Will definitely come back again when in town."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbVVtdEhNekJxTUZaSlNXcFJPVUY2Y2tka1JGRRAB",
            "text": "Went for dinner last night and I just had to l leave a review because the food was so delicious. I ordered the Brooklyn mule which was strong yet still smooth and dangerous. I had the salmon with its fully developed flavors and lingering spice. The music was perfect setting a great vibe for a late night dinner. I’ll definitely be returning for the boozey brunch before hitting Prospect Park and should too"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NVMycFZXalI2T1VSdU1sWmFVSEU1U1V4RGJtYxAB",
            "text": "Loveeeee this spot very lowkey and the food is well seasoned!! Did a solo date here and only spent 50$ for 2 mixed drinks and a meal"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNS3BrcWV4dWZuOVVREAE",
            "text": "Drinks were great. The salmon was very good. They had a DJ and the music was a bit loud today but it was good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNVGk1N192cWVLbVJnEAE",
            "text": "Tanya is the best. I came here back to back just for her and the vibes. This is what our Caribbean community needs!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbDR2RTBBRRAB",
            "text": "I was disappointed yesterday. The whole experience was confusing. We were told they were already out of some food when we had a 6pm reservation and they open @ 4p, so that made a already small menu even smaller. The food portion size was confusing as well as K received a small bowl of rice with a larger bowl of oxtail mostly bones swimming in a gravey that was really rich, so essentially I had a bowl of gravey. The drink was ok in flavor b ut didn't taste a trace of alcohol. Our server seemed very nice but was gone and we only saw her when she brought the food so if we wanted something else we had to ask another server to help. I love supporting black business but unfortunately this is what  I mostly get for my support. My review is meant to help get better because it's a cool spot and has potential to be so much better."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbXBicEN3EAE",
            "text": "I love the energy in this spot. Joyful and laid back and the food is outstanding. I love the wings and sauteed spinach. The jerk chicken is wonderful - just the right amount of heat. I appreciate the attention to detail on the mocktail menu, too!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbDdINXBBRRAB",
            "text": "Went for dinner on a Saturday night. I think the food is very expensive for what it is. The jerk salmon is yummy, but certainly not worth $30. And the jerk wings came out cold. The mac and cheese is very good though, worth trying. I wouldnt go back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJXy1hblhREAE",
            "text": "Jerk chicken is fire"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ajdfbGVREAE",
            "text": "Nice little place, very friendly, good customer service, the music was nice, but the food wasn't tht great I ordered the jerk chicken n rice n peas   all u taste is the pepper on the food,  no taste at all......"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRb3FLaElnEAE",
            "text": "Great vibes, and the food and drinks were delicious. Will definitely visit them again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdDYtR1RnEAE",
            "text": "Come here for a quick happy hour and you will definitely come back for more!! The staff is fantastic and the food is amazing. Bartender Is the sweetest also 💚💚💚 This spot is a great Flatbush ave go-to !"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBamFESGhBRRAB",
            "text": "The waitress that served us was very sweet and hilarious. The food was even better! I can tell the staff put a lot of care into making sure every part of the restaurant is perfect!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZzk3LWJBEAE",
            "text": "It's a cute quaint hidden restaurant bar. When you walk in there is a bike store in front. When you walk through a hidden door there is a bar and seating. I had salmon, rice and peas, with sauteed spinach, and a guava margarita. Everything was absolutely delicious, and our waiter was amazing. I definitely want to come back again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Ml9YbkF3EAE",
            "text": "Fish tacos and quad Mac were delicious and the vibe was cool"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MHZYTGtBRRAB",
            "text": "Mango Seed is a little slice of heaven. Congenial atmosphere. Music right on time. Food is delicious. Drinks are slamming. Prices are affordable. Staff is awesome.  I can't wait to go back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNnVHX3pBRRAB",
            "text": "I was given a surprise dinner at your location on Saturday. The food and the ambiance ar this place was amazing. Loved my fried snapper, Will definitely be back when I'm in NYC ♥️♥️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbGRTdlR3EAE",
            "text": "There was literally a screw in my chicken and waffles. My siblings and I were there to celebrate my brother’s birthday and go see a show right after I didn’t say anything when it happened cause I didn’t want to ruin the night and miss the show but they said I should still say something about it after"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcXB2bW9RRRAB",
            "text": "Visited on 11/3/24. Went for brunch with my friends and had a great time. The dj was a little Asian dude but he was in tune with the culture. Felt right at home. The food was immaculate I 100000% reccomend the Mac and cheese. You’ll want like 3 of them after trust it’s that good. The wings were banging. Spicy but not too spicy jerk. The drinks we great. The best one we had was the Mule. It was really good. The waffle with the jerk salmon is amazing. The syrup and fruit tasted fresh. Only thing is one of my friends got the mango seed burger and it wasn’t really up to code. No biggie we got rid of it for some wings and kept it moving. All in all a great time and a minor inconvenience for a major fun time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYckpHcWVBEAE",
            "text": "Food was flavorful but I had two issues. One the music was way too loud and two (which is most important) they do not have a dessert menu !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYek4zSWdBRRAB",
            "text": "Quirky restaurant behind a bike store. We got the jerk hen and max and cheese to share and both were so flavorful! The server was so kind and fun, a great find!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudjZHd2RBEAE",
            "text": "Beautiful restaurant we found while strolling the area. It has a beautiful ambience - tucked inside a bike shop, it's charming the moment you walk in and never stops delivering. I recommend 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOTlTM01REAE",
            "text": "went on a friday afternoon before going out in the city. happy hour drinks are awesome and i had the burger which was delicious! also tried my friend’s jerk chicken that she ordered…super yummy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ZzdIbHdRRRAB",
            "text": "This place was a pleasant surprise . My family and I  were suppose to be going to another brunch up the block, but unfortunately by 1pm they were out of a few brunch items so we left and found Mangoseed. It’s in the back of bike shop but don’t get it confused the food is absolutely amazing. Like this is the first time in a while my mouth dropped at how delicious everything was. I got the Jerk Salmon Caccitore and 10/10! I would come back everything for this. Loved it and the service was super sweet and patience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3enV6TDJnRRAB",
            "text": "Came here for walk in brunch. The entrance to the restaurant is through a bike shop which was a little  odd. However, we got seated quickly and the waitress was very upbeat and quirky. Although she told us they were very short staffed that day, the food came out in a pretty timely manner and was very tasty. We got the chicken and waffles, jerk chicken, maple bacon, and salmon tacos. Portion sizes were good with enough to take home and presentation was also great. I’d say the dress code  is casual. Will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNFlEWW5BRRAB",
            "text": "Escovitch fish was overly wet with minimal onions. The plantains were soft as if they were boiled. Its wild to pay almost $30 for escovitch fish with no rice or starch of any kind. Also, the restaurant is now in the back of a bike shop. The only plus is that the drinks were strong, not good but strong. Tbh just go somewhere else."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNic09fcDRRRRAB",
            "text": "I had an amazing time with my family here, the music had us dancing in our seats. The drinks were very good and the food was amazing. The vibe there is nice, with comfortable booths and seats. The whole staff was friendly . We need to come back for Dinner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyd1BpZUxnEAE",
            "text": "It's a hidden gem !!! The food at this speakeasy is packed full of flavors and spices that would leave to wanting more 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNya3Y3cUJ3EAE",
            "text": "My family and I dined at MangoSeed last night. It was amazing! The Caribbean food was varied and delicious, the drinks were spot on, and the service was friendly with excellent timing. Wonderful vibe overall. Great backstory to the restaurant and the talented family running it. Run don't walk to check this out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeTRPZGVBEAE",
            "text": "Food was great and the people were very lovely. I'm just writing a review because I saw that a lot of the older reviews mention that this place is cash only. I can confirm that this place does accept cards now. I was just there in June 2024."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMM2JHR3lRRRAB",
            "text": "I went here on a Friday night around 9:30. I was greeted and treated very nicely by the servers and ordered the fish tacos and my favorite drink which I haven’t had in a good 10 years, the Sugarcane Lemonade. They were wonderful. I’ll be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOGZYcHBRRRAB",
            "text": "Hard to find at first as you have to go through the bike shop, but so worth the confusion. For happy hour the rum punch was only $9 and super tasty. The oxtail was melt in your mouth good and we mixed the sauce in with everything. The Jerk chicken was tasty, but the oxtail definitely outshined everything else. We loved the cozy vibe and friendly service after a long day of walking all around Brooklyn."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOGZqbW93RRAB",
            "text": "I had such an amazing experience at MangoSeed! The restaurant is located at the back of a bike shop which was really neat and the food was amazing. Best oxtail I have had in a minute and their guava margarita was perfection. Our server Rachel was a joy and I will be returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdUtqVzh3RRAB",
            "text": "Horrible my salmon is burnt and I specifically told them I don’t want it burnt! The Mac has no taste definitely not Mac you have on thanksgiving! Will never go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUcE5hMUx3EAE",
            "text": "Cute , cozy spot... This fish tacos and passion fruit mimosas were Delish with a lil kick, 🧐 Big shout to Julie our server and to the bartender (lady with the dreadlocks ) for great experience ! Definitely will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqaVlXcW1RRRAB",
            "text": "Great spin on Jamaican food!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNXZULV9RRRAB",
            "text": "The food is good.  The portions are larger than expected. I am not sure about when they open and start serving since when i arrived there was a line outside waiting for them to open on Mother's Day.  It is strange that they are a cash only…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyZ3V2Nl9nRRAB",
            "text": "Cash only! Great place for drinks and snacks. I came on Saturday and didn’t expect they’d have a large space in the back. The happy hour cocktails tasted great and were strong. My friends enjoyed their pizza. We ll be back for more"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMGZlLVRnEAE",
            "text": "The best pizza place in the neighborhood! Delicious! Delicious! They make a perfect personal sized pizza. Trust me, get your own. You will not want to share. YUMMY!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1akxQRTR3RRAB",
            "text": "Excellent food, fresh ingredients, & amazing blend of flavors. We ordered the jerk chicken which was seasoned perfectly and the mango salad which was do refreshing on such a hot summer’s day. My friend ordered the guava margarita and it was so good ! Highly recommend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1NnJqNU9REAE",
            "text": "The food was great, staff was super friendly! The Mac and cheese was heavenly and the cesar sald had actual anchovies! Fish tacos and jersey chicken for the main courses. It was yum"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHZ2RTUjVBRRAB",
            "text": "Solid brunch spot, went around opening time on a weekend without reservation but got busy quickly. Oxtail and grits was so good, the best dish on a cold gray day. $28 for a hefty portion, plus parm grits was thicker than most and definitely…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRLUl2Y29BRRAB",
            "text": "2021 Review: Mango Seed and Zurilee are now merged to one restaurant. Important note: THIS PLACE IS CASH ONLY. There isn't any sign of this anywhere, you're only told by the host right before you're seated. Good food, moderate prices. I wasn't the biggest fan of the drinks. Also, my party was the first of a batch to be seated, yet we were the last of that group to be served. It was only 2 of us. People had been served, eaten and was readying to leave and we hadn't been served yet. No reservations, so expect a wait depending on how busy they are.\n\n2017 Review: Pretty good restaurant. It's family owned and cozy (or crowded depending on how you view it). Food is okay and service was decent. The happy hour drinks blew my mind! $5 and $6 for such delicious drinks! Awesome! We sat in the back ... view wasn't the best because they didn't decorate or make it look nice, it just felt like someone's backyard with a deck and some grass in the back.  We wanted to go outside because the music inside seemed to overpower any conversation anyone would anticipate. I kinda felt like we should've been inside though, as we really felt left out from the crowd and the feel of the restaurant.\n\nOverall, good food and somewhat decent service, clean bathrooms and great drinks... it's a great place to grab a bite with some friends in the Flatbush area.\n\nRecommendations-  if you're okay with loud music, please sit inside or you'll feel like you're just eating in someone's backyard therefore totally missing the vibe of the restaurant. Another thing is to make reservations ahead of time as there appears to be a wait time. My group had a reservation but while waited to be seated we overheard others at the bar talking about a 45 minute wait."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtOHBtSHZBRRAB",
            "text": "Amazing. The food was fresh and seasoned to perfection. It’s a bit spicy if you like that. I love it. The drinks are fab. Try the honey, jalapeño cocktail. Marley is the bomb server. Shout out to them."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncVBhSkdnEAE",
            "text": "Love the vibe! Walk in, the bar's on the right. A few tables for eating right after that, which leads to a hallway that opens up to more tables outside in the back. Outside seating has its own bar and dj booth so you get a different feel immediately once you step out there. Looking around I noticed a little tucked away seating area that looks like it could be for a VIP section or private little gathering. Now back to my seat inside... server was excellent, very fun and engaging, had us rolling before we put in our order. Drinks were made well and tasty. The food was also very good and MASSIVE portions!!! Definitely highly reccomend this spot!! Fyi - music is played loud so mix it with drinks and good food #movie!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxLVBUVkZnEAE",
            "text": "The food options were so good I could not decide so I had both. The oxtail and grits was amazing as well as the jerk chicken and waffles was cooked to perfection! The staff is very kind and the place really gives you a Caribbean field one of my favorite places to visit in Brooklyn I will definitely visit again soon!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3NHB5Q3lRRRAB",
            "text": "Food & drinks are fantastic. Had the oxtail & bake pizzas. Oxtail pizza is hearty, feels like having a stew on perfectly cooked crust. Atmosphere is dope too, super diverse & great brick oven where you see the chefs cook pies."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJNWVuQlFREAE",
            "text": "1st time here... Food is good. Brunch service needs a whole new revamp. Being that brunch is a busy time more servers & a host is needed. Offering a \"bottomless brunch\" service but the service is SLOW is not acceptable. Once I placed my order I had no one come to my table to ask how the service is or if I needed another drink. I watched 3 other tables glasses stay empty on a bottomless option for way too long. Asked for to-go containers had to wait 20 mins to receive it. When I spoke to a staff member (I think it was the floor manager) he basically stayed that all the other times during the week they give great service just brunch is crazy. Knowing that, have more staff coverage 2 more staff members should not be coming in at 3pm when you know that you are busy from 11-2:30 during brunch hours. Being that you have been in operation for a long time you should know when certain things need a revamp... Out with the old way and in with a new way that will have a customer coming back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrX29pWXFnRRAB",
            "text": "Have been year many times before.  If you're a meat eater you will be fine... if you're vegetarian or vegan , the options are meagre.... if you're pescatarian you can have jerk salmon... but otherwise... avoid if you're riding the green…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDaU0zUnFRRRAB",
            "text": "Listen! Their oxtail is the truuttttthhhh!! Worth every.single.cent. I have had it in three different occasions with their Mac and cheese and rice and peas. Girl! My goodness, my goodness! They maintain that same quality each time. AND they…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHZ0lYUmhnRRAB",
            "text": "the food was tasty! a lot of people seemed to enjoy the crooklyn cocktail but it wasn’t my cup of tea. the other cocktails i had were good, tho!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBX3MySDVBRRAB",
            "text": "Small cozy environment the DJ was playing really good music.  I went for a Sunday brunch and I highly recommend you go early enough to take advantage of the unlimited drinks.  I arrived around 1:50 pm and the table sign said unlimited ends…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQweGJiSnFRRRAB",
            "text": "This place was on and poppin for a Saturday night. I was surprised by the fast seating for a party of 4 and the amazing food that was offered.  We ordered 2 of the Oxtail dinners, a Rasta pasta and a fish taco. All of the food was…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVemFQTDJRRRAB",
            "text": "Great cocktails! We a portion of 2 fish tacos for appetizer, then I ordered fish and chips, which came as half the fish 👍 kids had Mac n cheese which tasted great and burger which was more as craft burger. Good atmosphere and service overall!…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxM1BYWEVREAE",
            "text": "Ordered fish tacos bottomless mimosa and Brooklyn wing for starters, them had jerk salmon and waffles with whipped cream and bananas! So damn good! Nice place small and intimate but great place to visit. First date or just brunch with the girls!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNjlyN2FBEAE",
            "text": "Inviting and chill atmosphere.  The front bar has its own vibe and the back where more tables are is its own vibe!  Great food and unique drinks.  Staff and bartender were really cool and personable.  I'll definitely be back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHOU9PRU5nEAE",
            "text": "Really quaint pizza place in Brooklyn. Great drinks and good food. We ordered the oxtail pizza which was fantastic. The oxtail was braised perfectly in a sweet and savory sauce. Absolutely delicious."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvLS16VmtnRRAB",
            "text": "Amazing dishes all of it hands down amazing but the cocktails are extremely amateur. Feels like a teenager threw some stuff together. Drinks have great ingredients but the proportions are tremendously off."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbHZqQVd3EAE",
            "text": "The staff is amazing and they are only outshined by the food and drinks!! Thank you for maintaining such a high standard of quality!! You guys NEVER miss the mark!! :)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMEplOVZBEAE",
            "text": "I had a couple of things that I didn’t personally like. I had the jerk fish tacos and mac & cheese. I ordered sweet plantain and the wings to go. My best friend had the jerk salmon with cabbage and plantain. My issue with this place was the menu is very limited there’s no starch no rice no potato. They only take cash. And I wanted to try the oxtail pizza but it was $40 for eight slices. The jerk tacos were good and really small. My best friend enjoyed her salmon but she wanted more food on a plate and she wanted rice. So down the music was great service was great."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVeWVMcmxBRRAB",
            "text": "The vibe at ZuriLee is wonderful and the staff is very attentive and courteous and it shows, because many of the customers were obviously regulars. My friends ordered the oxtail pizza. I tasted a tiny piece and it was pretty yummy, but too heavy for me. I ordered the saltfish and bake pizza. The crust was heavenly. I will go back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZcXFxQ3F3RRAB",
            "text": "Waffles, fruit and salmon shouldn’t work together, but my goodness it does. Amazing brunch (with a really good value bottomless mimosa offer; they leave a jug at your table, so you’re not constantly looking around for a refill)."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvcXBmZmxRRRAB",
            "text": "Glad that my friend and I found this gem during our stay in Brooklyn. The atmosphere was great and the food was amazing! I always hear that New York has the best pizza and so far it’s true. If you’re looking to eat cheap and save money,…"
        }
    ],
    "reviews_count": 72
}