{
    "name": "Milk And Honey Cafe",
    "place_id": "ChIJD9wZTTNbwokR77qf0Dw91f4",
    "grid": "BK14",
    "address": "1119 Newkirk Ave, Brooklyn, NY 11230, USA",
    "rating": 4.1,
    "user_ratings_total": 2194,
    "phone_number": "(718) 513-0441",
    "reviews": [
        {
            "date": "22시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201YVdIcG1ORjlMUlcxbFUyVjNXR3hNVm14U1VtYxAB",
            "text": "I’ve been here twice and always get the steak sandwich with roasted potatoes. It tasted absolutely delicious. The freshly squeezed juices always are on point. My only issues are that I don’t like that you have to get up your table to order and that for the type of food you are getting prices are extremely expensive in my opinion. I paid $40 for my sandwich and a juice. Overall, the atmosphere is nice and staff is very welcoming and friendly."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wb2RITXhNbkpMYzNwVGNrdHNhRE5LYUdGbWVFRRAB",
            "text": "The food was so good, I was pleasantly surprised! A little expensive, but very flavorful. Will return when I’m in the area, I highly recommend."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkR1FVRkhOazlqTWtWZlpuRlBaMkZXUjJOdFIxRRAB",
            "text": "I hope my twin flame Joseph sees this, if so please tap my profile and email me so we can finally be in contact with each other 🤞"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbVoyNHRiWFUwY20xelVrNDVNMlIwTlRScVZIYxAB",
            "text": "It was such a lovely place to be cozy atmosphere, delicious food and excellent service from Alex! We were there with our kids and he took great care of us, making the experience warm and truly enjoyable))"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSak9YQm9kMGhNTVRWdlUycHFiVUZvVTBaR2JsRRAB",
            "text": "I stopped by Milk and Honey Café and absolutely loved it! The atmosphere is cozy and welcoming, perfect for relaxing with a good coffee or brunch. The drinks were smooth and flavorful, and the food tasted so fresh, especially the toasts. The staff were warm and attentive, making the whole experience feel personal. It’s the kind of spot you’ll want to come back to again and again."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTGVGTm1Ua3gxVEdGMldUQlhSR0l4UjNKR1ZWRRAB",
            "text": "This place used to be so good, but not anymore I was soooo disappointed came all the way from Jersey to eat such low quality food and terrible service! We ordered the pastrami sandwich, chicken flatbread and pancake and the crème brûlée french toast, the sandwich and French toast was just ok the side salad had hair in it and the pancake also hair in and when I told the waitress there they just made a face didn’t do anything about it we ordered coffee which was served cold to us, and the chicken flatbread we never got it! I told the cashier that I want a refund for the flatbread since we never got it even that they made it a problem but I eventually got the refund. Never coming back to this location ever again! The bay ridge location it 10,000 times better! better food better people better location!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRU9XOU5RMUZXYm1wWFZsRnFSakpUVEVKTFMzYxAB",
            "text": "I LOVE this place a ton of vegetation option and yummy pastries!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TVYxVnhNblUzT1c1TlF6WkxRamw0TTNwUmMyYxAB",
            "text": "We found this place off TikTok. It was such a cute vibe. When we decided to actually view the place, the service was fairly short. But overall, the atmosphere was very nice. Overall, a little bit left to expect it. But we will come back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kcFRESktXR00zZG1FM2NuVlRSRUl5UWkxU1RtYxAB",
            "text": "Idk why it has so many negative reviews the food was really good and if you want something you can just go up to the counter and ask. I got the crème brûlée French toast and it was good, not too sweet and the taste doesn’t get dull after more than five bites, which what usually happens when I get the French toast."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaVVGbE5SbmRLYkhkV2NuRlNURGh5YjAwMVMzYxAB",
            "text": "•\tWe chose this café because it looked very nice, clean, and elegant in the Google Maps photos. Unfortunately, the reality did not match the pictures.\n•\tThe place was not well organized or very clean, which was disappointing.\n•\tWe had friends visiting from another country and invited them here, but when we saw the atmosphere, we even thought about leaving. We decided to stay only because we were short on time.\n•\tThe cashier gave us the menus and said we could sit anywhere and come back to the counter to order. There were six of us, so my husband took everyone’s order and went to pay at the counter.\n•\tThe food came quickly, and it tasted good — thankfully! The food was halal, which we appreciated.\n•\tHowever, we had to go to the counter every time we wanted coffee or even water, and we had to pay separately each time.\n•\tDespite having many employees, no one paid attention to the tables. The service system and management really need improvement.\n•\tPrices were a bit high for the quality and service level.\n•\tParking was also difficult. Even on a Sunday, we had to park quite far away on another street.\n•\tAround lunchtime, it became very crowded.\n\n👉 The food was delicious, but overall, the experience was not comfortable.\nNext time, I would only order takeout, not dine in. Still, thank you."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeWVuSnFaRTh5Y2t0SVpYSXpZbGswV1U1UlZVRRAB",
            "text": "The food is overpriced and low quality. My husband got a $20 burrito that had no flavor, and as many have mentioned here, the French toast was frozen and reheated. The drinks were supposed to be mango/lemonade, but they really tasted like water. It all looks really good and would be fine for half the price, but is just not worth it. The milkshakes were a little better. I am confused how this place has such good reviews!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSFYwdGZjelJzUXpCRVNWUkJVemhRT1VSWVdFRRAB",
            "text": "I've been coming here since they first opened many years ago. Friendly staff, beautiful at, great food of different varieties, and my favorite (other than the coffee) breakfast all day."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQlQzQnBhSEk1YUZWR1NEVnZPV1o1TVVKU2VYYxAB",
            "text": "Excellent Service & Very Decorative Space for Brunch 💕"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTWFqUjBWSE0yZWpSaFMzaDNia0oyVW1aNFVWRRAB",
            "text": "I used to come to this café about 5–6 years ago, and I just visited again after all that time. I’m so happy to say it’s still just as amazing as I remember! The food is delicious, the coffee is excellent, and the atmosphere feels cozy and welcoming. It’s rare to find a place that keeps the same great quality over the years—this café definitely has. Coming back here felt like a little trip down memory lane, and I’ll definitely be returning more often now!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMGRtUjRSME5sUkZkUk56a3RXV1Y1WnpoeWMxRRAB",
            "text": "Cute spot with good food and coffee. Prices are definitely on the higher side, but the vibe is nice and the coffee is excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUGIyaEROWHBqYUhoQmRrOWljVGMyZEROaFMzYxAB",
            "text": "First time visiting this restaurant. Ordered the Turkish eggs, or so I thought.  It was unlike the description in the menu. More like avocado toast. But worse, much worse, the poached egg was ice cold. I don't mean lukewarm,  but ice cold. So was this egg raw or was this dish made added of time and just taken directly out of the fridge. I took one forkful of the egg, which I swallowed, before realizing that it was in that state. I pushed the egg aside. Hope that salmonella doesn't pay me a visit. I should have immediately returned it but I ate the arugula that was on top of what appeared to be avacado toast and called it an afternoon. My friend had yoghurt and fruit and she told me that it wasn't very good, but I didn't press her for details. Maybe this was a one off, as many reviews are five stars. Such is life. The wait staff were very pleasant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2packxXUlBNbVJvZUZCSE0yMWtiWHBGWVZGZlpsRRAB",
            "text": "Great place for breakfast food is fantastic!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadFR6TkRiRU5HU1MxbGRXSmhZM0pTZG1scVMxRRAB",
            "text": "I stopped by for breakfast today and absolutely loved it!\nThe vibe was cozy, the service was friendly, and the food was delicious. The Egyptian poached eggs were my favorite — perfectly made, rich in flavor, and something I’ll definitely come back for!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cmFWZDZRME5UWTBKQ1QwcE1kSEJ4VnpoMFMxRRAB",
            "text": "Had the breakfast plate, macha latte and the creme brulee French toast. It was absolutely amazing. I'm surprised looking at the negative  reviews because the food was so good that I recommended it to my coworkers and family. I'll definitely be back for sure. Highly recommend this place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGR1psSlplV1l4U1dKeVJrSnlTVTlxYzJwNmRrRRAB",
            "text": "I really enjoy the food, but recently the air conditioning hasn’t been on, and it gets quite uncomfortable during warm days. It makes me feel like dining in isn’t encouraged, but since it’s a bit expensive for takeout, I wish the dine-in experience were more comfortable."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWVdXZGhaa1JOY0Y5ak1GaHFMVTlRU3pZMmMxRRAB",
            "text": "Muy buen servicio,  y gran variedad de comida"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbWRqVkVaVTl2YUU4NU9Ib3RSVXA0ZFY5U2RGRRAB",
            "text": "Love the food, good variety and excellent service"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toc2FVTTFUVEJRUWtwRFZGbHNhbkIyT1c1V1dsRRAB",
            "text": "The French toast was delicious. No wait. I love that we pay for our food in advance so when you finish eating you can leave."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSFZ6VmhTMTloVjA5RmVtRjJRbXBWZG5GQk4xRRAB",
            "text": "This is my favorite cafe in the neighborhood. The pastries are particularly scrumptious!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TlltOUZlV1ZKWkV0SmNYaG9aVFU0TTBKaVYyYxAB",
            "text": "Very very good!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWZlgxQlhXWEp6YnpBMFgzSnlhelZIT0daUldIYxAB",
            "text": "Everyone was really nice and the food was absolutely delicious, will definitely be coming back a fifth time!"
        },
        {
            "date": "2달 전",
            "language": "mr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrd1ozVmhSRzFIYUVGNmMyNWFNMm8wV2tOa1NWRRAB",
            "text": "Abzal was helfull :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMGIyaFZYemRNYUdVMlFVUnRWa3QzZVdOelduYxAB",
            "text": "Abzal was great! Amazing service. 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeWJtbG1ORzFGZDFOVVltWm9TRGhMU2w5MmRWRRAB",
            "text": "Abzul greeted me and my friends kindly and his service was excellent. The food was even better and I’d highly recommend to anyone from or visiting the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMFFsRXpRa0YyYVZGVVZHTlpSVEJRWTBNeGJtYxAB",
            "text": "Amazing cafe. Great food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSFFVaFNjVFpQVjNWaE16ZGhVRE01VEZwb01YYxAB",
            "text": "This place is hidden gem in Brooklyn. The food is top notch.\n\nAbzal was our host, he was super helpful and knowledgeable of the menu. This is a must visit if you are in NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdU1IRllZa1J5V1dKYWMxSkNZMWR2VUhoaE1XYxAB",
            "text": "Thank you Abzal"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMU1qTTVkVEZpYkdwNmJqbEpaM1k0YXpkVlUzYxAB",
            "text": "Best brunch spot in the neighborhood for sure. Everything on the menu was incredible and our waiter Abzal was fantastic. Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUE1ua3dPV1U1VUVRNGIydE1XblpqUlRoWk9XYxAB",
            "text": "Delicious food and amazing staff. The French Toast was absolutely fantastic plus our waiter Abzal was super helpful and friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paelZYVllhRXBOUlZSak4xSlZWbGwwVldSRFgxRRAB",
            "text": "Great all day breakfast plates!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSWNVMW9RamRqY2kxelIwUlRVVEZpY25GMk4xRRAB",
            "text": "10 out of 10 service and food. Would definitely recommend and would revisit again. Alex was great, and provided great service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toU1RYUktVM1F3YTB4U1EwRnZOR3g2YjB0c2NsRRAB",
            "text": "Love Milk & Honey! The food and drinks are delicious and the service is great. The patio is very nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNGFGRXdkak5VV25ORk1IZFdTV0l5TVdkelduYxAB",
            "text": "Unfortunately I have to give them just 2 starts because of how the place looks. Tables not clean after clients, dirty inside too, inside the bathroom is toilet paper everywhere and smells bad. The food is amazing but because of how the place looks you will be tented to leave how can you be sure they have all the healthy measures taken if the place looks like garbage"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRGJFbEdTakpaZVZOd01FbHFlVEpvZDB3d1UzYxAB",
            "text": "The food is amazing and very tasty the portions are big but THE CLEANEST is BAD. Dirty tables, dirty floors and dirty bathroom. When u enter and see leftovers on the floor on the tables it makes you not wanna eat there or even buy food. Is a big issue the clean!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNmEwZFFXR1JPUWtZNFVEUlBVMm94V0drd1FXYxAB",
            "text": "Cute, from the outside, brunch spot. No table service, so in other words, seat yourself. There's an \"outside\" area if there's no seating indoors, that's enclosed so it was very humid and uncomfortable. Since it's self service, you have to order at the register. I greeted the cashier to which I received no response. Pretty pricey for breakfast food but it's in Ditmas Park, so I guess. Ordered the French Toast, scrambled egg whites and chicken sausage (which a server does bring to you). The lychee mint spritzer was good but could've been sweeter. Enjoyed the food for what it was worth. Not worth the hype and the crowd."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVFEyNXdMWFl3T0RSV1lVcHFhVzU2TVc5RWMyYxAB",
            "text": "It was horrible, having spent over $60, and the food was below average. The chicken club sandwich was very dry and bland and the French crème brulee was so dry, and it was like they tossed two bread pieces with a spoonful mushy\nberries, no cream or banana, not sweet just plain bland.\nI called many time no one picked up, I am so disappointed at the take out. And even at the store the wait time was over 40 minutes for takeout,  which would be fine but not with this quality of food.\nThe only okay thing was the steak\nPanini sandwich. I tried reaching out numerous times but no one picked up and even the voice mail was full that I couldn’t leave a message."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psQlN6UktOSFJIZDNWUWJqaGpRMFpQTVhSc1pYYxAB",
            "text": "This place has declined so much… I used to come here often, but now the food is very disappointing. Nothing tastes fresh and feels like they just throw premade items together rashly. The turkish eggs were disappointing and the watermelon mint drink tasted like a kool aid. The roasted potatoes used to be so good, but they are bland and mushy now. The iced latte was good though. I miss the old milk and honey!!!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdE56aG9SRzlpVFdoUlpIaE1lRmxGWkdWNldrRRAB",
            "text": "The looooveliest people! I basically consider the baristas my friends because they're awesome and they know it (or I hope they do!) To the baristas AND kitchen cooks reading this: **KNOW IT.**\n\nI've loved watching this place evolve since it opened in 2013. It's been an anchor for me, growing with me through major life transitions (college graduation + 2 careers! + relationships)\n\nHere for the vibes and oat lattes but truthfully - it's the community. If you can call a space your home away from home → life upgraded ❤️\n\nAlso, watching them (baristas + kitchen) work SO hard inspires me, too. It's been a huge honor for ME to watch THEM do their job so well, especially when they think no one's looking. Their stable presence has been helping me build my second career and they don't even know it.\n\n🥹"
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbVpFOXRTMGxuWkc4MlkxcDRVblJKY3pGVVNYYxAB",
            "text": "Часто приходим, вкусно, но очень грязно..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWE1EZE1UVmhOWTNZdFFuUk1kMVl0TUZScFRrRRAB",
            "text": "Based off reviews I think dine-in might be a different experience than take-out so I’d like to try that next. We ordered blueberry pancakes, strawberry matcha latte, and order of bacon. They forgot the bacon but luckily we live close so we were able to go back and request it. The pancakes were very dry and bitter so next time I’d probably ask for syrup to go with it. Matcha latte was very watered down and I’ll just stick to making mine at home.\n\nIt seems like such a lovely place so I’m willing to try it again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMllreEZTemRtV25oSWFGaGtja2R5YUZjME5VRRAB",
            "text": "This is definitely a hidden gem.  We went here on Father's day on a whim.  We were pleasantly surprised to find some seating on such a busy day.  Despite being so busy, they managed to get our orders correct and provide us with delicious flavorful food.  Everything on my plate was a home run!  My coffee was even perfect.  I could see this being the most perfect place to have a nice quiet breakfast on a weekend or weekday morning.  We will definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ak4yaGxORWgwYUhOMmJsOWFNeTFVYzJWT1dsRRAB",
            "text": "Love the name not the food. Very warm inside with limited seating.  Out of several menu items.  Food arrived before drinks.  Green juice was 90% water. Afagato had chunks of nuts floating in it and came partially melted. Creme brulee french toast was salty, covered in melted frosting, and mushy pre frozen berries ! Left after 2 bites."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMZUs3N21zM0tPUEl3EAE",
            "text": "We heard about this spot from a neighborhood regular so we were excited to try it out. The photos and reviews looked great as well so we had some hopes. We got the breakfast platter and the “Crème brûlée” French toast. Unfortunately, the sausage and toast were dry, potatoes were soggy and mushy. The eggs and ham were just okay. There was nothing French or crème brûlée about the French toast to us. It was just toast with some syrup and defrosted frozen berries and white cream sauce on top. The toast itself was not drenched in batter so it was really just toast. Maybe it was just a bad day for them but we couldn’t even finish the food so it’s just a shame."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Rd1dIWkNUWGRqVFV0b2FGUmpUVm96U1dac1ZFRRAB",
            "text": "Disappointing Experience – Poor Quality and Rude Service\n\nI visited Milk and Honey Café in Brooklyn recently and was really disappointed with both the food and the service. I ordered a flatbread that was supposed to come with chicken and various toppings. What I got was a mostly dry piece of bread with a few large chunks of chicken dropped in the middle—about 60% of it was completely empty and lacked any flavor or balance, also ordered cream brûlée french toast and there was hair inside. This was not acceptable at all.\n\nI also ordered a Tiramisu Latte, which should typically come with cold foam and cocoa powder on top. Instead, I was served a plain drink with neither, and when I politely inquired about it, the staff responded rudely and dismissively, telling me they “don’t have that,” despite it being part of the advertised offering. They posted picture of tiramisu latte with cold foam and powder and  server their customers completely different drink.\n\nWhen we tried to bring up both issues, there was no effort to make things right. The dismissive attitude and lack of care for presentation or customer service were incredibly disappointing. Unfortunately, I won’t be returning, and I hope they take this feedback seriously and improve both their service and food quality.\n\nAlso I drove 1.5 hrs from Jersey because of all the good stuff I heard but never again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNNjUyc1RnaWJYQUFREAE",
            "text": "This is a great cafe for brunch, with an all halal menu. I came with a group of 4 and we had a great experience. You grab your own table and order at the register. They give you a number and bring the food to you when it’s ready. I had the Hello Gorgeous from the brunch menu. It’s turkey bacon and hash browns on a piece of sourdough, topped with panko crusted chicken and poached eggs. The portion sizes were large and it tasted great. The minty kale lemonade was also delicious. I would definitely come back to this place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MGVHd3hTVEoyWkY5UVlUQXlVWGxPYkhoUllWRRAB",
            "text": "I absolutely love Milk and Honey, it is the only place I bring friends from out of town. The service is always impeccable with Asem being one of our favorites. The coffee is amazing with many creative drinks, I highly recommend the strawberry covered mocha latte, and crème brute French toast!! For lunch try the spicy lamb flatbread!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNy02VllREAE",
            "text": "I have been going Milk and Honey for the past 4 years and I want to say that this might be my favorite restaurant in all of NYC. I marvel at how the menu continues to expand over the years while still retaining amazing taste. It is centrally located in the Ditmas park area, which makes for quite the scene on weekends (a diverse community flocks over to enjoy it all).\n\nEach main entree costs around $16-$20 and the drinks can cost between $6-$10. There is great value and we should all do what we can to support local businesses.\n\nShare the spicy lamb flatbread (something we got on our very first visit in 2021 and continue to get each time)."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMGJEYlBREAE",
            "text": "Quick Brunch Date on a Weekday. This place is a cute little corner spot. We definitely ate our belly Full. Shared the French toast. I love a good clean foodie spot and this is definitely that. I ordered the Salmon Benedict and my friend go the breakfast plate. Drinks- Morning Glory , passion mango Iced. Also ordered drinks to leave 😂 with an almond croissant of course."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNFkzS1l3EAE",
            "text": "A good halal brunch spot. I wish they had clearly displayed halal sign on venue. Their website says it's halal.\n\nWe have tried different items during our couple of visits. From our most recent visit we loved lychee juice. Pouched eggs with smoked salmon was good. Chicken wrap was delicious.  Creme burlee French taste, though it tasted good not that sweet but they were missing Creme burlee touch, we were expecting it to be filled with custard and have some caramelized sugar toppings. It's better to call it loaded french toast then Creme burlee. Would definitely go back to explore more. Loved the interior after renovation.  Washroom was very clean. They have outside covered seating too. Finding parking was not that bad as we went on Thursday morning. Good food with good ambiance but little on pricey side. We paid $88 for 3 orders and 3 drinks. On a 2nd thought not that bad."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NellqTlFPVEV5WTBWRFN5MVhNRkk1Y0ZkWk5WRRAB",
            "text": "I’ve been a loyal customer at the Newkirk location for years. The food is always fresh and tasty, the service is warm and welcoming, and the place has a great community vibe. It’s clear the team cares about what they do."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xacWFtSkZTbFZFT1RkT2FXbzJjRGhSUlhaRVlXYxAB",
            "text": "Absolutely loved this place! Their menu is unique and the food is amazing. Would recommend this to anyone looking for a cute brunch spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMbEotVEp3EAE",
            "text": "From the moment I walked into Milk and Honey, I knew I was in for a treat! This all-day brunch spot offers a diverse menu that caters to all tastes, and it truly lives up to its promise. I had the “Three Egg Omelet,” which was absolutely yummy—fluffy, perfectly cooked, and generously filled. Also tried the “Three Eggs in Hell,” and while it wasn’t as spicy as the name might suggest, the richness of the veggies blended beautifully with the eggs, making it a delightful dish.\n\nThe juices are a must-try—they’re made fresh and burst with flavor, adding a perfect touch to the meal. The atmosphere is cozy, the staff is friendly, and the food is prepared with care, making Milk & Honey a must-visit spot for brunch lovers. Whether you’re in the mood for something hearty or light, this place has it all. Highly recommend for anyone looking to indulge in a top-notch brunch experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bjQyWVB3EAE",
            "text": "I ordered the chicken and waffles, I wanted bacon and eggs, but they only serve turkey bacon and I don't like turkey bacon, I was with 2 other people, one was visiting from the UK and chicken and waffles was on her bucket list of things to try in the US, our order came and she was the first to try it and was instantly disappointed, she's like this chicken has no flavor, now I'm nervous to try mine, she was not wrong, this chicken was BLAND!!! Absolutely NO seasoning on it , the waffle was fluffy with a hint of something spicy and the syrup was tasteless. My other friend had poached eggs over beans and tomato sauce, bland as well, the staff and atmosphere was nice, the food looked great,  but I also would have loved to enjoy food with flavor"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MHRLT2pnRRAB",
            "text": "-I loved it 🥺. I seat down for almost 2 hours the workers didn’t rush or try to kick me out .  The French toast was a 10/10 the eggs were eatable anit nothing salt and pepper can’t fix. The macha was so good . Loved it here"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3X2FIOHVRRRAB",
            "text": "My fiancé and I were on vacation this week, and our family members suggested this place. I’ve been to other milk and honey locations, but this place was the best one. The atmosphere conveyed a cafe the best way, the service was great, and the food phenomenal. I would highly suggest this place if you’re looking for a great brunch spot that’s calm and friendly."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNHVpVG1nRRAB",
            "text": "Edited: Ate in.\nService was rushed, but expected for such a busy place.\nFood ranged from great to phenomenal. Great: chicken flatbread and Egyptian poached eggs. Phenomenal: spicy lamb flatbread and bambooza waffle.\nPortions of food are large and delicious.\nThe cafe itself is beautiful with lots of light filtering from outside.\n\nOriginal review for takeout:\nHad takeout. Spicy lamb flatbread and chicken flatbread were large and delicious. Filled and happy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaEo2bVZ3EAE",
            "text": "The last time I had breakfast here was back in 2018, which is some time ago. My visit recently, in my opinion, was long overdue. This place is just as I remembered it. The food was good and plentiful, and the service was great. This is such a cute spot that offers both indoor and outdoor seating. They have a very extensive food and beverage menu, and they offer brunch all day. Everyone who dines in gets a number assigned to them to have the food and drinks brought out to them to their table. I ordered the Poblano Chipotle Omelet, and it had the right amount of heat and wasn't too spicy. The potatoes that came with the order tasted great too and had good flavor.  The staff is friendly, and the establishment is kept pretty clean. I will definitely come back again, but I will make sure I won't take so long the next time to have another great meal here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NE02dV9RRRAB",
            "text": "I was looking for a new place to try and this has been on my ‘Go To’ list for a while. It was about a 20 min train ride for me and I’ll tell you, it was WORTH THE JOURNEY!\n\nI often dine by myself so make it a point to order two things to try. Both of these were amazing: (1) BOMB: egg, turkey ham, avocado and Swiss on a croissant with chipotle mayo (2) DECADENT: crème brûlée French toast; nothing else to say.\n\nLatte was perfect.\n\nVibe was awesome; great music playlist running!\n\nStaff friendly, fast, and helpful.\n\nI will be back next weekend to try the sandwiches."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeExxYkRnEAE",
            "text": "Food was excellent, and was served pretty quickly for the amount of patrons that were there. They have an extended eating area off the side of their building but it was too cold to sit out there comfortably. I would definitely go again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQmFuTnBiMnAzTjFSNGNVSmhUa0poWVVGSVVVRRAB",
            "text": "I came here with a party of two for Friday brunch. Basically you had to take a menu, select your food and order at the counter. Once you paid, you took a number and sat where you like. So we did this. They actually suggest a tip when you pay at the counter which I found to be pretty ridiculous as no one is really serving you, except the person who puts the food on the table and whom you never see again. That’s not deserving of a 15 or 20% tip. No.\n\nThe server who gave us our food was pleasant but the people behind the counter could use some lessons in basic customer service and just how to greet customers. Smile, be welcoming. Food service is an experience. Be personable. Be pleasant. Have a personality. A pulse?\n\nThe food was ok, save for my chicken sausage that crumbled as I cut into it. It was dry, which made me wonder if it was reheated from the day before. They were not so generous with my eggs. I doubt I even had more than 1 scrambled egg on my plate. There was one slab of bacon. My son had the french toast which he enjoyed. Overall I would find another brunch spot. They were pretty stingy with their breakfast platter portions and it may as well be a self-serve restaurant."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa2VDZ2ZnEAE",
            "text": "Milk and Honey is a cozy Brooklyn gem with great vibes, delicious brunch, and friendly service. The avocado toast and pancakes are a must. Perfect spot for a chill morning bite. Jose was my server and he recommended the best items in the menu for me to try which was all delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbHBxSmxnRRAB",
            "text": "Food was really great! Atmosphere was pleasant and there was a vibe! However, the host/person at the register didn’t seem to be too happy to be there. The pricing on the food was comparable to typical NYC pricing.\n\nAlso charging $3 for a small/extra squirt of chipotle sauce is insane and quite ridiculous, please be reasonable :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MU1ERDV3RRAB",
            "text": "I googled this cafe, I was so excited to go there. It’s quiet a modern cafe with indoor and out door sitting areas, the cafe food is quiet good, I had a pizza it was burrata, tomato basil and pesto, so tasty, I wanted it with meat balls but…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOWRHTlJBEAE",
            "text": "Definitely a hidden gem. Small space but great food. The grilled steak panini was delicious and tender and the crème brûlée French toast was perfect (not too sweet like most North American desserts). Bonus: it’s also halal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxM2MzVTJVMGR0TTI1SmNtRmZORFpDYW1sTE9FRRAB",
            "text": "I live a block away and have lived here for over 20 years. The cashier was really nice, and the place itself is inviting. I ordered 2 cookies, 2 croissants and a ginger lemonade. I thought the bakery items near the register were for display but after I ordered the cashier gave me the cookies and croissants that were out and open all day near the register. The croissants were stale and the cookies were chalky and sour. Are the baked items made in house? The bakery items need to be covered for freshness and sanitary reasons because everyone who makes an order at the register are close to them. I was really hoping for some good quality, fresh cookies. Still searching!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwM2JfYUpBEAE",
            "text": "We came here on Sunday later afternoon for a coffee date and got cold brew with carrot cake. Carrot cake was delicious but not sure it was worth $9 for the small slice.\n\nThe cafe is huge and very nicely decorated. I’ll definitely come back for food and use this as a place to work out of."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhLXVidUJ3EAE",
            "text": "Food was good. I didn't care for the taste of the turkey sausage.  I ordered a hot green matcha but got iced.... but it tasted good. Other than that all was good.  Nice ambiance. Nice area with outside dining.  You have scan the code on the table for the menu. The server was polite."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmX0tfMnpRRRAB",
            "text": "The presentation of the food was good as always. However I ordered the breakfast plate and the sausage was bone dry and crumbling. The rest of the food was barely warm despite having come immediately from the kitchen. Given the more expensive price point of this restaurant I was very disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4d2QzbklBEAE",
            "text": "Had lunch at this place and food took me by surprise. Place has been nicely decorated.  Ordering food was nice and easy. Avocado toast with sunflower seeds was amazing.  We have tried Italian Seafood soup and it was OK but felt like its missing something.  I would definitely come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbkxlT29nRRAB",
            "text": "This was a very disappointing experience. The orders took over an hour to arrive and they did not arrive  together. Some meals arrived and then the next set of meals didn’t arrive for another 40 minutes. When the last meals did arrive, their appearance was dismal  and a bit sloppy.  Though I gave the overall service two stars, our waiter, Muhammad( apologies if that is the incorrect spelling) was very cordial, polite and apologetic. We greatly appreciated his understanding and efforts to correct the situation. My family and , unfortunately will not eat here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCM28zR1hBEAE",
            "text": "It's a very busy cafe. You will need to find a spot by yourself then order. I think it's very popular on the neighborhood, so the food takes longer than I expected to come to the table. It's a bit cold inside but I think it's ok to wear a coat all the time(then it will soak up the smell 🫢). Everyone ordered something to eat. The lamb flatbread is a must have and it's the best of what we had. The other dishes are the smoked salmon with corn fritter and the spicy pasta ( I don't remember the name). I had the rose latte which I can't barely tasted the rose, but it's not that bad. The little got her favorite Snore hot chocolate. I also saw a lot of pastries and pretty looking deserts. Maybe come back next time and try."
        }
    ],
    "reviews_count": 76
}