{
    "name": "Good Hope original restaurant and bakery",
    "place_id": "ChIJQY0toTdbwokRdKdCc5vM6XU",
    "grid": "BK14",
    "address": "711 Flatbush Ave, Brooklyn, NY 11225, USA",
    "rating": 3.5,
    "user_ratings_total": 48,
    "phone_number": "(347) 240-6221",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0elVXaExhR1poV0ZFM1JVMXZaWFJrTVVoRVVtYxAB",
            "text": "Great food, great service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOallYQlRaMWxXV0hsZmNFNUdWR1p5UTNBMFFuYxAB",
            "text": "if you want good food be ready to get it (with a side of what you didn't ask for)  'ATTITUDE'! I asked the server for peas, little rice and oxtail, she made 2 different orders, then came back with \"we don't do that\". I countered \"it was done last week\" and here comes the attitude, she trashed what she already made and grumbled as she plated what I originally asked for! So now when I go, I have to arm myself to expect 'Good Food with a side of Attitude' pay and git out!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNVVsWkRabHByWW1aQ05rZEdXbFZyUlRKS2FuYxAB",
            "text": "Great food and service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkT2JERmtWakY0YVZKRVVuVXdaekEwWDIxQ2FYYxAB",
            "text": "JA food and they have tasty food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NVozbGpZWGMyTW1sd1lqRTFhbTEwWWpaNGQxRRAB",
            "text": "The food is super good. It's always busy and long lines throughout the day, and everyone is patient and civil.  The jerk chicken is consistently good and plentiful and a copious amount of food is given on large orders. The only problem is that they seem to run out of steamed cabbage which is essential to a complete Caribbean meal. For $13.07 , 4 pieces of jerk chicken,  rice and peas but without the cabbage, just ain't complete!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ka2FUWTJUWEJaWVY5aVpqZHBkR1J1U2tweFdFRRAB",
            "text": "I’ve been going to this spot at least 4 times a week because my kid is super picky and only eats their jerk chicken or oxtail. I’m SO DONE.\n\nMy mom ordered 3 meals, including jerk pork with rice & peas and jerk chicken with rice & peas. She politely asked for oxtail gravy, server says, “We don’t have any.” Fine. She asks for stew chicken gravy on the rice the server REFUSES, saying “we’re not allowed to add gravy.” Since WHEN?\n\nTo top it off, the jerk pork they gave us was mostly skin. Not meat. Just skin.\n\nAnd then there’s the attitude. The young lady who served us is the same one known for giving the tiniest portions like she’s counting grains of rice. Short pixie cut, glasses, and a permanent scowl. My mom says she was the one who served today, and judging by the way she acted, she must be related to the owners.\n\nI’m done spending my hard-earned money here. I’ll happily walk to C&J’s on Church before I give this place another dime."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UGVtZFVNa3BQVmxCWVIwMDNSVlJSV2tOWVFuYxAB",
            "text": "Food is cheap and amazing. Medium jerk chicken w/rice and peas is a Hamilton. It gets busy but the line moves. Go here about once a week."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWUxYWXhlbE5TU0VOdU0wVXpVelpXZVRSWE1XYxAB",
            "text": "After a hard day's work. Felt for some curried goat. Got home and started eating and found hair in my food. Called and staff was so rude. I was in disbelieve, \" call tomorrow when the manager is here, we cannot do anything about it\". I replied, its not even an hour yet since I bought this meal. She shouted again. I said, ok and hung the phone up."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNUDcyTXJOLVp1MDVRRRAB",
            "text": "Food is astonishing, never disappointed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ2JpSGZREAE",
            "text": "I was really looking forward to trying this chicken patty, but unfortunately, it fell short in several ways. The pastry was noticeably dry and lacked the flaky, buttery texture I expected. Inside, there was very little meat, and what was there wasn’t seasoned well—it tasted bland and lacked the flavor you’d hope for in a savory filling. Overall, the patty was underwhelming and didn’t deliver on taste or texture. I wouldn’t purchase it again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOUtYTGJREAE",
            "text": "This is the second time I've ordered oxtail from there I get home and it's literally only bone and gravy. I try calling and the phone just rings out. Ridiculous!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJakotLVJnEAE",
            "text": "they are like slow motion..."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3amN5aVV3EAE",
            "text": "I got food poisoning last month iwas sick for days since  Their chicken pattie was old. Buyers beware . Please Don't buy their patties since they are   not fresh t will send u to the bathroom and hospital."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMV9Qa0xnEAE",
            "text": "In short, the food is terrible. I would give the food zero stars if I could. My mom ordered a seafood soup for me and an oxtail dinner for herself. She also ordered a red bean and rice dinner. Hands down the worst food I’ve ever had from a restaurant claiming to have authentic West Indian food.\n\nThe seafood soup lacked flavor. No taste, no spice just broth with a few pieces of provision and seafood in it. Also, the green banana (green plantain) in the soup still had the skin on it. So instead of eating just the banana, I was eating the skin along with it. Like who puts a cut up green banana in a soup? Do you eat provision with the skin on it when serving it with salt fish?! No, exactly! At the very least, who ever made the food could have removed the skin for consumption.\n\nThen the shrimp completely disintegrated because of the heat of the soup. The shrimp continued to “cook” in the hot soup even after bringing it home to eat, making it so the shrimp was complete mush when eating it. The fish was cut into the smallest half inch sized pieces. I could not even identify the type of fish in the soup. The dumpling was in the shape of little balls and was still raw in the middle when I bit into it. The oxtail was okay on flavor (at best) but the rice and peas had absolutely no color to it. It barely even had peas in it. It was basically white rice with a few peas tossed in. The rice was also mushy (not grainy) and the only color the rice had was from the little bit of gravy from the oxtail.\n\nThe red beans and rice dinner was just as disgusting as the oxtail and rice. Again, the rice was mush. Also, to add insult to injury, how are these dinners without an included side. The dinners did not come with steamed cabbage, plantains, Mac and cheese, coleslaw or even potato salad as part of the dinner which I presume would have been an up-charge. A dinner should include at least one side.\n\nI grew up in this neighborhood and I am also of Caribbean descent and although I don’t not live in the neighborhood anymore, I do come back periodically to visit family. The restaurant prior to this had very delicious food and throughout the years I frequented that establishment. Apparently this is a different restaurant, new owner and chef. Quite frankly, I do not know what “Good Hope” is providing but I cannot call it good food. In fact, the food was quite inedible. I am all for supporting my people but this was truly disappointing. Consider hiring a new chef and changing the standards of how the food is prepared and served. Definitely not worth almost $50. Money wasted."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRd2F2ZktBEAE",
            "text": "I find their food tasty but a little too spicy"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMExIbGhRRRAB",
            "text": "the food is amazing. the price of the food is amazing. that's why theres always a 10 person line in the store, yet some people act like thats a bad thing."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfLUtMRUpREAE",
            "text": "The is always good and fresh ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMk1QajV3RRAB",
            "text": "The Oxtail is really bad. Please don’t purchase it here. Signed, an oxtail love."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaEsyRUdnEAE",
            "text": "The is place was needed  in the neighborhood. I enjoy the curry goat is my favorite. Breakfast  is good too. The soups are fantastic. Thank you for serving the flatbush area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeXR1RXdRRRAB",
            "text": "Decent meal. Rice needed more gravy.\nService…. I’ll just say I already knew what it was when I stepped into a Jamaican spot. But still! It could be a bit better!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIN2IyNG93RRAB",
            "text": "Macaroni and cheese was trash. That’s where it ended up. It was overcooked, tasted like bland mush. Very disappointing. I might as well have dropped my money on the street and walk away."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNWZiWm1nRRAB",
            "text": "Best Jamaican food on Flatbush Ave for sure but my gosh why is it so hard for them install AC or some type of cooling system. The store is hot and muggy feels like hell. The poor workers are drenched in sweat  from the hot summer and the heat from the food holders. I don’t know if i can go back to this restaurant because i leave drenched in sweat and i feel bad for the workers. Good food tho."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6Z0lQNU5nEAE",
            "text": "The young lady's are very rude not polite don't say goodmorning  or anything.They're  not  professional.More people need to complain about them"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENHVfdzdnRRAB",
            "text": "This restaurant is out of control, I got 2 large jerk chicken one for me and one for my friend I regret ever stepping my foot in this nasty restaurant salty burned they hv a lot of left over food i believe they will sale them in the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0eW9uSVV3EAE",
            "text": "OMG !! I've been in Flatbush Brooklyn for over 20 years, and this has to be the most authentic and delicious Jamaican food out there next to going to Jamaica itself! Everything from their goat head soup to oxtails are delicious, portion full, and keep wanting more! I order here at least 3 x a week for me and my staff! We all rave about it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOcS03ZUJREAE",
            "text": "Very good. Good people"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOX00zanhRRRAB",
            "text": "Loved this place until a new server waited on me.\nAsked for 2 different chickens and he told me no that he can't do it.\nI'm paying for it so why should it matter to him\nLeft with fried chicken and rice. Didn't order the rest of the items\nWon't go back.....\nI think it has to do with me not looking like the male server.\nFemale servers always happy\nThis guy seemed miserable"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURac3ZYaGZnEAE",
            "text": "Good consistent food, the lines will speak for the restaurant. Breakfast, lunch and dinner 👍🏽!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNnZPcmdnRRAB",
            "text": "id like to marry the chef who makes the stew pork .\n(stay away from the girl with the glasses ...I dont like the way she portions out food...she needs to do better)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMjhQLTRRRRAB",
            "text": "Good Hope is a recently updated Jamaican Food take-out spot in Flatbush Avenue. They have the typical Jamaican cuisine items on the menu.\nDon’t expect fast service, The service is slow.\nBut the staff are professional and friendly. And the food is decent.  Definitely worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwM01EWDZBRRAB",
            "text": "Great food !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdl8zQkhREAE",
            "text": "This place just recently opened but I am already hooked! I love the way that everything is always so fresh. Prices are definitely not too bad either compared to other Jamaican restaurants. Oh and I love that they close very late! It's nice to have decent food as an option during late hours because everything in that area closes pretty early except Peppa's and they suck :("
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbnBQU3N3RRAB",
            "text": "Great curry goat, super affordable too ($8 small is a solid meal)"
        }
    ],
    "reviews_count": 33
}