{
    "name": "Pescada New York",
    "place_id": "ChIJYZURPrlEwokRUn3XSSWYPhY",
    "grid": "BK14",
    "address": "1359 Coney Island Ave, Brooklyn, NY 11230, USA",
    "rating": 4.6,
    "user_ratings_total": 998,
    "phone_number": "(718) 766-2759",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTmEyTlBYMWxNUjAxVlFWQXpSMHh3ZEhSUlRtYxAB",
            "text": "Beautifully designed and spacious restaurant. The food is delicious and decently priced... the staff is very friendly as well."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOclUzTlNlaTF6U3pObmJXeEZiSG8zYURCU2FVRRAB",
            "text": "Food was amazing. The wait staff are prompt and really nice. I recommend the chatchapuri."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNFVtdFpkRGwxUlRSNk4wcE1hbHBvVWtWbVkyYxAB",
            "text": "New location same great food."
        },
        {
            "date": "1달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKU1ZXMXZZVmt6TXpWUllsbHJRMDlrV2t0UVJHYxAB",
            "text": "מנות גדולות."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWVYydDVjbEl4UW1selZVTm5hV2RCV1VwamQzYxAB",
            "text": "Food was really good and the service was excellent. The downside was the atmosphere. We made a reservation hoping for a quiet, intimate dinner, but about 15 minutes after sitting down there was an event/party in the sanctioned off section of the restaurant (we learned later it was the owner’s son event) with music blasting so loud we could barely talk. On top of that, there was a leak right next to our table, and at one point the smoke alarm even went off contributing to an even more chaotic night.\n\nBy the time the music started blasting we already had some of our mains and were eating, so we stuck it out, but it definitely wasn’t the experience we came for. The owner was around and never acknowledged any of it, which felt disappointing.\n\nIf you’re coming for a special occasion, I’d think twice."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdWIzUjViRnBsUlhnNFRFbzJTbEJEYTFCNmMzYxAB",
            "text": "The food was outstanding! especially the Asian sea bass, which is a must-try. The appetizer and cocktail selection was impressive, and overall, the culinary experience deserves a solid five stars. The only drawback was the extended wait time for our waiter's and the dishes to arrive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210b05XTlBUbk5mUzBaaGVWQndOMEp0UVZKTVpVRRAB",
            "text": "Service was great here. The food was very good. Very nice place to have a party."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxV09FMTVTVEZPTUc5YU9UQmtVMVJvWVZKV1UwRRAB",
            "text": "The restaurant deserves its ranking. Excellent flavors in comfortable surroundings. The meal impressed everyone enough to finish everything. Every restaurant personnel was incredibly flexible. Another visit is definitely on my schedule."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMVlXWlZibEYzY0RJM1dHOWtaemw0ZDIxR2NYYxAB",
            "text": "Great service great food!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTFNFRnBaMm93ZHpoWVluaGhNRTFQUTJaS2FsRRAB",
            "text": "Nice kosher dairy place. They have sushi and plenty of fish items. Try the tuna steak. It's excellent. The avocado piccolo appetizer was also great and very creative. Prices are somewhat high although not unexpected given the location and kosher designation. Service was quite good although for some reason dessert came out very slowly. Parking is absolutely terrible in the area. Be prepared to walk several blocks. Recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWVVUVkpia293ZW5aSVN6SnlkbFp4YkRWVmNrRRAB",
            "text": "We had a terrific lunch here.\nJesus was so accommodating and hospitable.\nHighly recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscFdFdFdTM0F5UVdkc1R6TlROM2R4VGxKUE1VRRAB",
            "text": "Oh my the fish is as good as the day a friend grilled fresh caught fish! Vegetables just crisp enough. Decaf cappuccino?  I'm sold and will return!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWWFIbFVXWGh5TkhGQ00ybzJWazlSWDBKNlVIYxAB",
            "text": "It was amazing!! Delicious food, and it was brought out so fast! Our waiter was attentive and patient. Pictured here are the black bean nachos which were phenomenal! We will definitely be back again 🥰"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNFNtSkRRMEZWYVV4b1ltWldZVjlrUVhNNVJFRRAB",
            "text": "It takes a while to get your food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWVNUWkVWMDFVWkVWdVQweGllSFJQVkZveWMwRRAB",
            "text": "Great food excellent service!\nHigh recommended for people who love kosher dairy food!"
        },
        {
            "date": "3달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeWFXVk9jekZXWTNaelRWWlJObTFtTVhoTFlYYxAB",
            "text": "מסעדה כשרה חלבית המקום מדהים השירות מושלם ביותר נהנינו מאוד מהאווירה ומהיחס שהוא פשוט יוצא מן הכלל אני אישית לא התחברתי למנות שהזמנו, אבל ממליצה מאוד!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcGR6SnpiRUZqZEZFNE1sQXpkSEpCYkVwcVJFRRAB",
            "text": "The food here is exceptional. Everything from the mozzarella sticks to the tuna steak. The food also came in record time. We also ran into our friend Roni who we’ve known from his previous restaurant job. Any place he’s a part of has exceptional service and is always a good time. Thank you."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxT1pGZEdNblUzYmxCdFdsZEtkWGhxUVdSbVlYYxAB",
            "text": "5*++++++ experience. From the moment our group arrived, we received VIP service from our host RONEN. We were promoted to the party room for no extra charge!!!!!!! Shoutout to #1 waiter Valentine for going above and beyond to satisfy us. Food was divine! Must tries include \"Goat Cheese Egg roll\", \"British Fish and Chips\", \"Sesame crusted tuna steak\" and ahhhh the CHURROS! Will definitely be back!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRmJ6aFlVMEZoZFU1ZmNYbDFjMTlKU2xSM1QzYxAB",
            "text": "The best kosher restaurant ❤️❤️❤️  Lava cake 😍😋😋😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUGFGbFhTM1pHYjFGU1JrdFRYMnh4UXpGVk1tYxAB",
            "text": "The best food ❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYmo3Ym56OTdPbElBEAE",
            "text": "Wow wow wow\nLegit great milk restaurant\nThe tuna steak was cooked to perfection\nWas the best I had in a while\nThe fries came out hot and yummy\nReally homemade vibes\nPizza was also delicious\nReally really good Matziv\nI am definitely coming back\nThanks for the awesome service!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKS0ZwS21KaWUySE1BEAE",
            "text": "I love Pescada and have come back numerous times for the amazing food and service.\nBut last night, unfortunately, the new location didn't match up to the service level I know and love.\nFor dessert we ordered the churros with milk & white chocolate dipping sauce.\nI've ordered it multiple times, most recently just a few months ago in the old location, and the decadent chocolate is the highlight each time.\nThis time, our server brought us a plate with some oily fake chocolate syrup, not the creamy milk & white chocolate we expected.\nHonestly, the churros aren't that great, it's the chocolate that we ordered this dish for.\nWhen we asked her where the chocolate was, she dismissed our question, saying, oh, since we moved to the new location we don't have it.\nShocked, we asked her why a) the menu still shows the item as such, therefore we ordered it off the menu\nand b) if the item is not as pictured, why didn't she say so when we ordered?\nShe had terrible attitude and snottily responded that \"since we moved we don't serve it, so I didn't mention it\"\nWe were very disturbed at her attitude and told her we didn't want the dish without the chocolate, especially as she hadn't mentioned it when we ordered it. (we had both taken one bite, but without the chocolate it was just oily and tasteless)\nShe did not offer a refund and we left with a bad taste in our mouth, when a server's own error made us the fools and we had to pay for the fallback, really left us with a bad taste in our mouth after a wonderful meal!\nI suggest Pescada look into their servers' attitudes and make sure they inform customers on menu changes BEFORE they order. This will eliminate any disappointment and miscommunications that could ruin your restaurant's good name!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNemZzdlRvZ1phUXhRRRAB",
            "text": "The place is beautiful and the food was great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYUhvYlRTdTVQal93RRAB",
            "text": "They did a beautiful job with designing this place.\nThe food is very tasty. Every single dish was perfect!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGdTg3cWJ3EAE",
            "text": "Delicious and healthy luxury food.  The place also gives a feeling of luxury and the experience is great.  There is a menu with many options and the fish there is simply fantastic.  And the staff is just great.  The place offers a special room for small or large events.  This place has a lot to offer you."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLXZyWXJBRRAB",
            "text": "Great lunch. Sea bass, salad and mashed potatoes delicious, as were passion vodka and cinnamon milk shake whipped cream. Friendly attentive service. Beautiful classy ambience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJZ3FHT1RREAE",
            "text": "What an amazing place! The food is great, the portions are very, very generous, the wait service and the prices are so pleasant! The maitre-de is extremely personal, warm and kind.Highly recommended!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcWFPcnFRRRAB",
            "text": "I had a great experience I highly recommend, the food was delicious the greatest thing was the penne"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRb3U2eVhBEAE",
            "text": "Not a bad spot for kosher dairy. Pizzas, pastas and fish were solid."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMU9HTFN3EAE",
            "text": "Consistently fresh and tasty!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcExuMlRREAE",
            "text": "Thank you Peter for the  service\nThe food was very tasty"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnaWQ2eXBRRRAB",
            "text": "Yum"
        },
        {
            "date": "8달 전",
            "language": "fr",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNUxIZTN3RRAB",
            "text": "Restaurant où tout est tres bon que se soit pizza pâte poisson etc..\nmais restaurant service très lent et surtout pour le payement y’a pas moyen de bien partager lorsque qui est en groupe\nLes mozzarella sticks sont excellents mais tout petit\nLa pizza de champignons de forêt est très prononcé en goût champignons\nVoilà en gros c’est ça mon avis\nLa meilleure pizza que je peut vous recommander c’est la pizza italienne\nLe saumon arrive avec des légume qui était cuit très légèrement donc je ne les ai pas manger\nC’est un 3/5"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcU0tX3ZRRRAB",
            "text": "They have great food and great service I would recommend you to try this place"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxM2ZqUFZnEAE",
            "text": "Me and some long lost high school friends went out to eat. After getting all our food, one of my friends fish was a little dry. He didn't complain but only told our waiter. The manager, Andrés came over and told us that he will get my friend another plate. Long story short Andrés took the fish off the bill and gave us all desert on the house. The staff were very polite, friendly and mastered customer service. I really recommend this restaurant!\n\nMy fish was perfect and honestly my favorite kosher dairy spot in Brooklyn!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfcklqLTZBRRAB",
            "text": "Great food and service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNzZuS2t3RRAB",
            "text": "Delicious food! Beautiful place! Great Service!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNma2RyLU5BEAE",
            "text": "The atmosphere at this restaurant is undeniably charming, with soft, pleasant lighting that creates a great setting for special occasions like an anniversary dinner or a nice night out. However, while the ambiance was impressive, the service left much to be desired.\n\nIt took far too long for our order to be taken, and then another 20-25 minutes for my dish to arrive. Unfortunately, my wife's dish was prepared incorrectly despite clear instructions. While mistakes happen, the real disappointment was the additional 20-minute wait for her dish to be remade. By the time it arrived, I had already finished eating. In situations like this, the remake should be prioritized to avoid such delays.\n\nThe manager did apologize, but it didn’t change the overall experience, which was frustrating and underwhelming. While the prices are on par with other restaurants, the service issues make it hard to justify. Unfortunately, I can only give this place 3 stars."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cmN6Y1NREAE",
            "text": "Just had an incredible experience at this dairy restaurant! The food was absolutely delicious, with fresh ingredients and creative dishes that exceeded all expectations. The atmosphere was warm and inviting, and the service was top-notch—attentive, friendly, and professional. Whether you're a fan of classic dairy dishes or looking to try something new, this spot is a must-visit. Highly recommended!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OVlmenRRRRAB",
            "text": "Pescada delivered a great kosher dairy dining experience.  The service is friendly and attentive. The room is modern and gives off a high end luxury feel. Dishes were delicious including sea bass, salads and appetizers."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dW9XZWZREAE",
            "text": "Great lunch we had today. The fish was fresh and delicious 😋  the Desserts were amazing.  Cheesecake was yummy. The soup was delicious 😋 I would highly recommend this place"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaHNiM2RBEAE",
            "text": "Kind of pricey, but good food and service"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOHNxRDJRRRAB",
            "text": "Very nice food and quick service\nThe price of the door is quite expensive"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQczVLamhBRRAB",
            "text": "We had good time eating together, different dishes and enjoy each bite"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcmR2Mk9nEAE",
            "text": "What an amazing experience we had here today! First off, our waiter Valentine - he was courteous, friendly and had fabulous recommendations that were backed by reasons, not just “because I like this” 😂. We ordered the nectarine salad, arugula truffle goat cheese salad, bronzino special & mushroom gnocchi. The balance of flavors in the salads was 👌👌👌. The bronzino was cooked to perfection with just the right amount of grilled flavor and crispy, crispy skin. The gnocchi was gorgeous with shaved parsnip chips that were so good - OMG, this was the creamiest, smoothest gnocchi I’ve had. We wanted to lick our plates clean.\n\nThe ambiance is beautiful & fresh feeling - very airy, sunny with all the glass, comfortable seating & booths, and beautiful dishes. I had eaten out somewhere else the day before, spent the same amount of money, and was underwhelmed with the food and overwhelmed with the noise and messiness of the place. This experience here was such a pleasant contrast.\n\nThank you Pescada & Valentine!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIb282YTh3RRAB",
            "text": "Went out to eat yesterday with the family. Pictures and words won't do Pescada justice. The food was delicious, Peter and his team were exceptional. The service makes you feel like you're the only one at the restaurant.\nI try something different every time we go and I have not tasted a dish I did not like.\n\nHighly recommend the Mac n Cheese balls ( see pic) and Seared Tuna (no pic)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6Z2JXMm5BRRAB",
            "text": "I came in with the expectation of it being a regular cafe where I could fill my stomach and get back on the road. However, Pescada Cafe turned out to be one of the best, most enjoyable, and most delicious dining experiences I’ve ever had. The flavors of the food were truly extraordinary, leaving a lasting impression on my taste buds.\n\nFrom the moment I walked in, the warm and inviting ambiance set the stage for a memorable meal. The menu offered a delightful variety of dishes, each one crafted with care and attention to detail. The staff was attentive and friendly, adding to the overall pleasant atmosphere.\n\nThe highlight of the evening was undoubtedly the food. Each bite was a burst of flavor, expertly prepared and beautifully presented. It was clear that the ingredients were fresh and of high quality. I was particularly impressed by the seafood options, which were cooked to perfection."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxLWRuQjh3RRAB",
            "text": "I've never had a more enjoyable dairy meal in my entire life! Beautiful restaurant, elegant yet relaxed ambience, with extremely courteous and informative staff. The service was quick and professional, and the food arrived promptly with beautiful presentation. Be sure to try the mozzarella balls & truffle rizzoto appetizers, they were both unreal! They also offer a variety of gourmet fish options, I recommend the glazed shallot salmon or the sea bass. Their wine selection is terrific, and they brew other fresh drinks and shakes as well. If you're looking for an upscale dining experience, Pescada should be at the top of your list!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aXVXdE1BEAE",
            "text": "Went for Mother's day with entire family... the flavor was great! The portions were quite small and the prices were a bit much... kept having to ask them for utensils and to switch put plates. Cherry on top was the mozzarella \"sticks\" and 20 dollar cheesecake that was 3inch in diameter (photo attached). Not coming back even tho it was tasty. Wish it was more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbkxDM0R3EAE",
            "text": "The food was ok, the service was slow But the prices were very very high. I think that for that food to pay $340.- for 4 persons, without drinks!! was very expensive. Exaggerated. We had 4 appetizers and 1 fish, 1 niokky, and 1 Pasta Alfredo with 1 desert. By the way the parking possibilities are horrible."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydzhUcEdBEAE",
            "text": "Best kosher dairy restaurant I’ve ever been to. Favorite food was the Buffalo cauliflower. Also really great was the mushroom formaggio- even just to get the cheese leaf cracker - totally worth it. The pescada fettuccine was so delicious in so many ways, just a shame the cream sauce was too salty.  The vibe is really lovely- great for dates or meetings or almost anything.\n\nJust warning about going in the last hour before they close. They sat us and then super super rushed us, shut down the kitchen at 9:45 before we’d even eaten, even though the restaurant was supposedly open much later. The waitress practically pushed us out the door (even gave me my drink in a to-go cup!) even though they easily had over 20 other people they were still serving.\n\nI will definitely try again. I am hopeful."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdE9DMDVnRRAB",
            "text": "Wonderful experience!\nI came here for my birthday dinner (huge deal) and everything was amazing.\n\nI started with a cocktail, not sure of the name but it was passion fruit, surprisingly strong yet perfectly sweetened. My friend, a sangria master, ordered the white wine sangria and loved it. My other friend ordered the nana (mint) tea and it looked so refreshing.\n\nFor my main I ordered the glazed shallot salmon and I swapped out the mashed potatoes for the French fries. The portions were generous and everything was seasoned very well. FF's were crispy yet freshly soft and salted perfectly, veggies were also seasoned well and limpy- but in a good cooked way. I liked the salmon cut bc it was thicc yet crispy in all the right places.\n\nMy friends ordered the classic fettuccini alfredo and the sushi as their mains and they enjoyed their food.\n\nThe service was A1 and the waitress went out of her way to make my dinner special. For dessert I couldn't order anything containing dairy and after she let us know everything contained dairy, she returned with a cup of whipped cream (a puppaccino iykiyk) with a candle!\nEven though I couldn't eat it, she wanted my friends to still be able to sing HBD to me and I thought that was the sweetest gesture. That is now the energy I expect for all kosher dairy restaurants.\nI hope my friends tipped her well bc bday girl never pays.\n\nDécor is bright, \"modern\", aqua water vibes and next time I return it'll be for brunch/lunch bc the menu looks bomb."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndzVtU0FREAE",
            "text": "Food was very good. Fresh, tasty, imaginative. Fish we're delicious. Good!\nDessert was not. Was disappointing that the Icecream was the best part of the desserts. All of them tasted like plastic, like store bought law grade factory cakes.\nWe were told the the regular Cheff was on vacation. Well, a recipe is a recipe, no?\nKudos to our server 👍👍\nWe will return though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaklyd1pREAE",
            "text": "Delicious food, quick service, and phenomenal outstanding service.\nWould definitely recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyc2Q3ZklREAE",
            "text": "Outstanding service and delectable food, particularly the cauliflower poppers—an 11/10 experience! The ambiance and settings are top-notch."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbU5DNENREAE",
            "text": "I recently dined at a restaurant and had the pleasure of trying their Pescada dish, and I must say, it was a culinary delight! From the moment I took my first bite, I knew I was in for a treat.\n\nThe Pescada was impeccably fresh, with a delicate, flaky texture that melted in my mouth. The flavor was exquisite, with hints of lemon and herbs that perfectly complemented the natural taste of the fish. The dish was beautifully presented, with a garnish of fresh herbs and a drizzle of flavorful sauce that added an extra layer of complexity to the dish.\n\nThe portion size was generous, leaving me feeling satisfied but not overly full. The dish was also accompanied by a selection of perfectly cooked vegetables and a side of fragrant jasmine rice, which added a lovely balance of flavors and textures to the meal.\n\nThe service at the restaurant was outstanding, with attentive and knowledgeable staff who made me feel welcomed and well taken care of. The ambiance was also cozy and inviting, creating a pleasant dining atmosphere.\n\nAs a seafood lover, I am always on the lookout for high-quality, fresh fish, and the Pescada at this restaurant did not disappoint. It was truly a culinary masterpiece that left me craving for more. I highly recommend trying the Pescada dish at this restaurant for an unforgettable dining experience that will leave your taste buds dancing with joy!\n\nOverall, I give the Pescada dish at this restaurant a glowing 5-star review. The freshness, flavor, presentation, and exceptional service all contributed to a memorable dining experience. I will definitely be returning for more, and I urge seafood enthusiasts to give it a try. You won't be disappointed!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHLUxLX3B3RRAB",
            "text": "Excellent service! Delicious food, very comfortable seating. Nice ambience! Love coming back time and again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1LWZPclBnEAE",
            "text": "I have to tell you the food was great the drink a passion fruit  was a big glass with crushed ice so plenty to enjoy till the end not like some other places that just give you ice the service was impeccable will come back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcXBDYTB3RRAB",
            "text": "Food was delicious with minimal wait time and outstanding service !"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4OWJxVkhnEAE",
            "text": "I went there after it reopened in July, we were sitting outside.\nIt was just awesome.\nThe food, compared to 2 years ago, was delicious, and dinning outside only does good to this restaurant.\n\nThank you, it was a great experience."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNNHZYVXJnRRAB",
            "text": "What a great experience. Food was amazing and service was top notch this is a place I'd definitely come back"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2cTRtUEZ3EAE",
            "text": "We are always looking for a great tasting pizza. The sauce here was bland and barely there. The cheese was off by the time you picked it up in attempt to eat it. Haha and a few slices were so underdone like so thin and soggy and this was fresh and just delivered. Overpriced and not satisfying in any way."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvbWNPay1BRRAB",
            "text": "Amazing fresh and well plated food. Clean facilities and nice and freindly waiters. Excellent service and will definitely be back soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaE5tTHdBRRAB",
            "text": "Everything is amazing there! From the food down to the cozy atmosphere and everything in between!"
        }
    ],
    "reviews_count": 64
}