{
    "name": "Rehmat • رحمت",
    "place_id": "ChIJIzMwRQlFwokRIR_ZI95kiI8",
    "grid": "BK14",
    "address": "1095 Coney Island Ave, Brooklyn, NY 11230, USA",
    "rating": 4.3,
    "user_ratings_total": 117,
    "phone_number": "(718) 210-1470",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMWRtbzNaWEZpWkVOaVlWaG5XR2N5Tm5sS05tYxAB",
            "text": "What an amazing find!!! This unexpected discovery will become a regular stop. The taste quality is outstanding. The workers make each visit feel like coming home. The items I've tried were flavorful. I'll visit again and suggest others try this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NWJrZEZNSFJ6VEdrMGEyRmFVMHRYUnpOdk5uYxAB",
            "text": "Fine taste.Pakistani typical food.\nAverage prices & best value of food & money.\nHighly recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkc2IxZG1lRWh0UVZOc1ZYWTFjbEJUY1hBd0xXYxAB",
            "text": "Wonderful experience and very delicious food with affordable prices. Staff are very friendly"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoU1Jub3dXVWx1UWsxNVluUk1ORGc0WVhFNWFFRRAB",
            "text": "Good food and kheer was the best part!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4YVZXVnFPRTl2YVZWTWQxRmxVV2M1VkRacGFuYxAB",
            "text": "food is quality and friendly service you definitely try this place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCalZYaFdNV1JwYUZoMVRUVlZRV2xJUjBSTFMwRRAB",
            "text": "They gave me very wrong naan . Instead of the naan they gave me roti and also burnt"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTmRpMVFhMmhRVkZsU1ZXbGZUM0IzTjFoT2FYYxAB",
            "text": "Nasty food yuck"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WME5TMUJjV3hRZEZsbmFXWlBha2N0YjA5TlMzYxAB",
            "text": "I learned about this place a couple of weeks ago and now my family gets food every week, we really like it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQzM2TU9scjVmZHFRRRAB",
            "text": "The gentleman serving is very nice. He gave me samples for everything. Food is not to pricey. Not spicy and good tasting."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaXI2UW9RRRAB",
            "text": "Wonderfull experience. I am amazad such a nice place such a delicious yummy food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLanRpTS1scFlHLXRRRRAB",
            "text": "Umer bahi nyc parson\nRehmat restaurant nyc place amazing food 💯…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VObkx2X0xCLVk2RnhnRRAB",
            "text": "My wife and I have eaten here 4 times before. We called to make our usual pick up order of 2 butter chicken, samosas, kebab, and aloo naan. They gave us totally different chicken so we called and asked them to make us what we ordered and my.wife walked the 12 mins back to get our food. She spent over 20 minutes being gaslit by the chef that eventhough the what they gave us was a different color amd taste, that it was what we'd ordered every time. Finally he admits he didnt make any today and \"would make some tomorrow\".Their half-assed solution was to offer us some tandoori chicken, TAKE BACK THE UNOPENED container, and partially reund us. We were really growing to like this place and I'm SUPER pissed off and may never go back. TERRIBLE CUSTOMER SERVICE. Just admit you didn't make the dish and offer us our money back and something to eat for dinner. They have a lot to learn as far as manners and customer service. DO BETTER"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNblVtS1dyd09DUnFBRRAB",
            "text": "Umer bhai is very good person. He is very friendly person and provides good service 💓"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eXVlcUhREAE",
            "text": "Umer bhai is awsome. Very nice service always welcome people with happy face.\nI really appreciate him. Thanks umer"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNZml3WnVzak1fSXZBRRAB",
            "text": "First visit and I think it's my last visit and might be not visit again\nThey opened a new  restaurant  and I thought its a competition for next door and a neighborhood Pakistani restaurant but unfortunately not .\nExperience goes wrong when we ask for tasting of their rice plow as soon it was given. It's already expired, so they had a bad small, and then still we trusted and ordered chicken kharahi\nNaan, which is also very average, and chicken kharahi is loaded with too much oil and kasori mahti, and herbal quantity can not take place. Quantity\nRonnie Haan don't look alike that and its mostly made with Milk and have different texture and taste but unfortunately not even close what I expected got complimentary casterd sweet due to served roten food  but not upto standards.\nI always try to give honest reviews. They have a chance to show the best restaurant among all these in the community, but unfortunately, they can't\nThe atmosphere is very loud and the service travel is as well not good\nFloor need to be clean and as well they must have to be some little bit nice place for family but no its like other same typical restaurant in the area nothing feel change.\nFood atmosphere and custom service are just very average\nLiked and recommended only because its from in community and its works they need to focus a lot to survive\nBest of luck"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJX0NvSUwtM0wzall3EAE",
            "text": "Very nice place , but clean-less , service is very bad, only one person work in front and pickup phone , he is very busy ,"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveGJ2cUZBEAE",
            "text": "We ordered three falooda and they were more like waterlooda. One circle shaped cut  ice cream in a large bowl… not sure what I just ate but I wouldnt order falooda here unless you prefer something watery. Other items are good!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbjc3SlFREAE",
            "text": "We were visiting brooklyn coney island ave saw this restaurant so we went in the food was great ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvei1mdTVRRRAB",
            "text": "Awesome"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdGVXUDVBRRAB",
            "text": "Amazing taste, good environment...must try for Pakistani taste lovers\nWe tried Mix platter with Naan...it was 😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMktyRy1nRRAB",
            "text": "Food was really good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNE1uOTVnRRAB",
            "text": "I was happy to see new halal restaurant but kabab was shit , two week before I purchased two dozen kabab but my stomach had swear pain after eats"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OUlxRnV3RRAB",
            "text": "Was charged extra for card payment. When asked they said its tax. Ok then tell me which tax it is"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndE5PUDF3RRAB",
            "text": "Service is really nice I really enjoy there samosa very tasty and fresh and server is so kind and good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnXzdURlh3EAE",
            "text": "Very great service and food. Best Pakistani restaurant in the town."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBc3NpOXhBRRAB",
            "text": "Very personable staff, Kashmiri chai was excellent. Definitely recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBLTdHSGt3RRAB",
            "text": "This is the best South Asian style kabab place within the few block radius. They are the only ones who also carry beef kabab based on order.\n\nI had started purchasing from them from the very first few days of opening. However, I didn't write a review until now to see their consistency. I had ordered dozens of times from here from few to hundred kababs and the kababs were always great. They listen to feedback and make things the way you want.\n\nFor large batch of order for beef kababs, Osama was great at prepping and taking in the order, customizing beef to fat ratio just the way I wanted. Almost like getting customized burger patties in a kabab style.\n\nKeep up the great work!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeFpmUklnEAE",
            "text": "The place is clean and the food is decent . Staff is nice but please the men need to clip their nails as it’s really unhygienic and disgusting. In food industry please make sure employees have clean nails fully clipped at all times"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBak95T0xREAE",
            "text": "Lamb chop 💯…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdkt5U0hREAE",
            "text": "Al rehmat is a must visit place being addicted to their chicken soup don’t forget to try other items too the good part is they make it fresh"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmajhYSnpBRRAB",
            "text": "Food was good quality. One of the only clean restaurants around. Very good service from the employees. Ask for Mubarak, or Osama. The cook was amazing named Hafiz. Made the dish to my liking, customized service available upon request."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOFl2QXpnRRAB",
            "text": "I recently came here for the first time and had one of the best experiences. Not only was the food Devine but the service and the owner were exceptional. The owner went above and beyond for him to make us comfortable and welcomed. The service was also amazing, they were fast, kind and efficient. I can easily say this was the best butter chicken iv ever had. The naan were puffy, soft, warm and fresh. The restaurant was clean and very new and modern. I highly recommend this place."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOFoyTE5REAE",
            "text": "We stopped in and had a late lunch at Rehmat while on holiday and we’re very impressed with the quality of their dishes; the butter chicken being the best we’ve ever had along with the best Naan we’ve had. We were treated very well and really enjoyed eating here."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURma29DckVBEAE",
            "text": "The food here was very good, delicious and my family enjoyed it. The service was also very calming and polite. Thank you all very much. Hafiz and Mubarak were good servers and good cook, good company."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNHFId2JBEAE",
            "text": "Wonderful team , Hafiz , Moborak and rest of the team and very hardworking and very helpful.Food is truly great."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMy02VkRREAE",
            "text": "The food is on another level here! Great service all the time! Refreshing 🙏🏽"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmX2RTdTFnRRAB",
            "text": "Good food and staff is so friendly\nMobarak is very friendly"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbmV6ZXR3RRAB",
            "text": "All the food is amazing and taste good.\nVery clean place.\nMust try 10 star rating if it was available."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNma2VPNmlBRRAB",
            "text": "Mubaraq is very helpful"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNma2VIbThBRRAB",
            "text": "I recently visited Rehmat restaurant and I couldn’t be more impressed. From the moment we walked in, the ambiance was inviting and warm, with a cozy yet modern decor that made us feel right at home. The staff was incredibly friendly and attentive, ensuring one staff he is so friendly name I think Mobarak we had everything we needed throughout the meal.\nRating 9/10"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNma1lhb0F3EAE",
            "text": "muhammad Luqman gave us very good service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeEkyZlB3EAE",
            "text": "The young Bengali guy (mobarak) who was at the cashier is very rude. He was shouting at an old customer because he interrupted him and then he locked the bathroom so the customers couldn’t use them. He didn’t serve us chai because apparently they are sold out and he said we are understaffed. I thought he was the owner the way he was acting. This was my first and last visit. Either train your staff if you hire them on cash or don’t hire these people at all"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2djkyMFR3EAE",
            "text": "Best taste in a Neighborhood"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dGFhb2tRRRAB",
            "text": "My go to restuarant the days my mom doesnt cook anything.  Also great place for breakfast and Lunch.  Very friendly staff.  Best lighting on the block. Thank you for your service to the pakistani community."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bTU3RXRnRRAB",
            "text": "Really nice to see a well maintained clean restaurant that provides one of the best foods I had in a while really recommended!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMDQtUmVREAE",
            "text": "The restaurant is located in the Midwood section of Brooklyn.  They prepare Pakistani cuisine and have tables for dining in.  I ordered the saag which is a plain spinach dish.  The garlic naan bread was well-prepared.  The vegetable samosas were good.  I also included a lentil dish and chicken dish with a tomato and butter sauce.  The carrot with rice dessert was different.  The food has some similarities to Indian cuisine.  Very nice and helpful staff."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeHBfV3JRRRAB",
            "text": "The tikka, kabobs and biriani all hit the spot. Good value and the staff is really nice too. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieE1qalRREAE",
            "text": "If you want good food in clean environment then bring your family here. Sweets are fresh and food as well. Prices are very reasonable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNXV2b0hnEAE",
            "text": "Best taste in Brooklyn after many years. Delicious food with highest quality of customer service and cleanliness. This will be our go to family restaurant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNua2NQVEpREAE",
            "text": "I had the pleasure of dining at Rehmat  restaurant recently, and I was thoroughly impressed! The food was not only flavorful and well-prepared, but it was also served quickly without compromising on quality. Each dish was bursting with fresh ingredients, and you could tell a lot of care went into the preparation. The service was equally outstanding—prompt, attentive, and friendly, ensuring we were well taken care of throughout the meal.\nWhat’s even better is that the prices were very reasonable, especially considering the portion sizes and quality of the dishes. It’s rare to find a place that offers such a perfect balance of taste, speed, and affordability. Whether you're in a rush or looking to relax and enjoy a delicious meal, this restaurant is a fantastic choice. I’ll definitely be returning soon!\""
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcWVEYnlRRRAB",
            "text": "Whenever I’m in the mood for some tasty homemade Pakistani food, I love heading over to Rehmat! Their dishes are absolutely delicious, and everything is so clean and welcoming. It’s really the only desi restaurant in Coney Island that keeps the food fresh and the dining area neat. Plus, the staff is amazing! They’re super friendly and always go out of their way to provide great service. It’s such a lovely spot to enjoy a meal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYa3NfSEJREAE",
            "text": "I’ve been here a few times since they opened, maybe during the soft opening and the young guy who manages the place was very attentive and helpful. When I was checking out, he asked if I wanted rice pudding and I said I didn’t but he gave me some for free to try. I usually ah e a problem getting served in other similar restaurants but I get served right away and all of the employees are helpful and kind. The food is always fresh and the special $1 kebab and naans are a steal. It have become my go to in the neighborhood. Definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYLU55MHdBRRAB",
            "text": "The staff is fantastic! They take their time to help the customer. I’m a regular customer and have seen many people from unique and beautiful backgrounds. So Rehmat has something for everyone through their vegan and vegetarian options! The owner also implemented the Too Good to Go application to help save delicious food from going to waste. I enjoy their food, knowing my money supports their small business and simultaneously saves meals! I hope you will choose to support them too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYLXRlREV3EAE",
            "text": "It's one of the best places compared to all the ones nearby. This is one of the new ones that actually care to make their services and good better based on customer feedback.\n\nI've ordered food from here for a large gathering and Osama was great at making sure everything was ready and available on time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3aVBYbmFREAE",
            "text": "MASHALLAH I’ve had the best experience booking  Rehmat for my children Aqiqah Dinner. Everything went so well - the food was delicious and all my guests went home happy.\n\nThis restaurant does not COMPROMISE on quality.\nThe manager and staff are amazing - they dealt with my guests with so much respect and responsibly handled them.\nDon’t hesitate to book this place for parties and they do catering as well."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdGV2amxRRRAB",
            "text": "So nice food, the price is so convenient, everyone can fully eat and go home happy. The food always fresh and tasty Ma sa Allah! The personal also nice, thank you for your service.\n\nTofik."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeTktR0FREAE",
            "text": "Price is unreasonably expensive. 1 (medium size, not large) plate with rice, lentils, coliflower + 2 samosas = $30. Unfortunately, I will not be back as competitors around sell same for exactly half the price. Food is tasty and very oily."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aDluZy1BRRAB",
            "text": "“Amazing experience! The food was authentic and delicious, with rich flavors that took me back home. The staff was friendly and attentive, making the dining experience even better. Highly recommend this place for anyone craving genuine desi cuisine!”"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzX2VTLURBEAE",
            "text": "I saw the great reviews and decided to try it out.Meri tauba logo ko taste ka pata he hai. I live a bit far from the restaurant or I would have gone back to return it . The food was very flavorless and I tried three different dishes .i could have had egg bread at home and that would have tasted better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3Nkx1eHJRRRAB",
            "text": "TOTALLY RECOMMENDED! Very well decorated restaurant from inside..nice and clean tables and floor,,staff is really very polite and respectful and quick service I went for dinner i ordered biryani, chicken karahi and sweets all of them was very delicious I really liked their food and service..I wish I could give them 10 stars ✨"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cmFMUjRnRRAB",
            "text": "The staff is really really friendly and really makes sure of great service. The food is beyond compare. Amazing food and really delicious. Also very hygienic. Loved the vibe of the place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eEt6X0tREAE",
            "text": "The brother Osama and his crew were very nice and the food was very good. The restaurant is also clean and its people are kind. Highly recommended"
        }
    ],
    "reviews_count": 62
}