{
    "name": "Namaste Brooklyn",
    "place_id": "ChIJTUTBCEhbwokRhkuPw3jIV30",
    "grid": "BK14",
    "address": "1202 Cortelyou Rd, Brooklyn, NY 11218, USA",
    "rating": 4.7,
    "user_ratings_total": 200,
    "phone_number": "(347) 365-3468",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaMlJrcHphMkpHUm01MmJ6Wk9TRUpQWlVKR1UyYxAB",
            "text": "Incredible cocktails! And the food was so delicious I can’t wait to go back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWGRWbDBjMlF0YkY5bllrbFBlbGhwUlVvMldtYxAB",
            "text": "Incredible atmosphere, food is so atheistic have no words. Must visit this place and try everything in menu."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQ2JYbHBUWGx2ZGpWamNsTnRVVEkwWDA1NFMyYxAB",
            "text": "Delicious food and drinks, good quality ingredients wonderful flavors. Got the cucumber cocktail and the Thenthuk a hand pulled noodle soup with bok choy and radish. A delightful addition to the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201U1psSktSbkp1ZURGbmJ6QmxVa3RRWTNNNUxYYxAB",
            "text": "I absolutely loved the food and the service.  The restaurant was so clean.  The best part is that it was inexpensive and a local gem.  I will definitely be back with mom in tow.\nThe Ginger drink is so good, I got two.   We also got their wings and chicken lollipops.  For dinner we had the shrimp chow mein and the chicken Thali.  Sooooo flavorful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM2JFbFdWRFpyWTBSSVNIVXpOSFZJWTJGbFRtYxAB",
            "text": "This restaurant has phenomenal service and really great food. There are not many like it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NE4waDVPR3BuUzBnNGVXZHpiRmhyZVVRMFVFRRAB",
            "text": "They have the best drinks both cocktails and mocktails. Delicious food and consistency great service. The place is clean and welcoming!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcGJXcFVhRms0U2pKamExbG9OREJNVm5GamNrRRAB",
            "text": "The service was really friendly and quite attentive. I felt very comfortable and welcomed. I had the beef thali and ginger tea, it was just perfect -everything about food was amazing. It is very chill environment with great vibes, great service and good food. Feeling really good for discovering it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWVIycEtjVEpZUm5WcU5HeEVVMW81WmpCeGFXYxAB",
            "text": "I love this place has a little spot in my heart food is always great, service is great and it all combines perfectly for you to have an amazing time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdldsRm1UR3BIYW5OUU5uQlNSa1UxVDBoUWFtYxAB",
            "text": "Excellent food, great service and nice ambience! Veg Thaali, momos, dessert were all great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWFpWODJkVWhTYURocWMybHhSbFZFVkZOMlIxRRAB",
            "text": "Warm hospitality, cozy ambience and beautiful people. The food was amazing. Nepali cuisine presented at best. The hygeine was top notch. Went there with a group of 6 friends and the hosting was amazing. If you are looking for some Himalayan food from Nepal, this is the place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCd2NWTldhVzV6V0VoeGFGTTFXV0o1UWxCUWJIYxAB",
            "text": "I went there with a group of 6 friends and the hospitality was amazing.The owner and staff were very welcoming. Felt authentic taste of the Himalayas from Nepal. The ambience was super soothing. The hygiene was well taken care of.\nFor my Nepali visitors : ramailoo thau cha yarr ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbVMwSmxiblJtZFRkeWFHOHlka2xVTFhGaVRXYxAB",
            "text": "Had a lovely dinner here last night. Sat outside which was such a great vibe on Cortelyou. Service was super friendly and steered us towards some favorites. We had the spring rolls, momos, and the thali with pork, which were all delicious!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OQmIyZHlNelF5VWpKWmNFaEdkRTh4Um5SQlduYxAB",
            "text": "Best momo in NYC, kakrako aalu achar was mild and tasty. Botanical garden mocktail was really good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xseVVsaDJiMHRGUVZOV1FuaGtRMWxzYVZaMVYxRRAB",
            "text": "This lamb dish was a plate of bones"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbTdEWTRBRRAB",
            "text": "Good food, good vibes and good service. Definitely coming back here again 💯 Ended up getting the gyuma, pakoda, and jhol momo, which were all delicious!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GdVoxaGpjRkJyTmpORFNVRjRiRmRqVjFCRFNuYxAB",
            "text": "I have to say they make the best cocktails ever! If you love Moscow mules this is the place to get them, their spicy namaste Brooklyn is to die for if you love spice, I travel from another borough just for their drinks just incredible quality! The ambiance is mellow and perfect to hangout great customer service just great all around I can’t recommend enough."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wa05YUTVlamc0TWpaTGRYSkZUbWxhTFdoR2NuYxAB",
            "text": "Quiet spot with great service and excellent vegetarian options"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toa1JYUkxNRFozZURsemEwbFRUWG94WDIxTU0zYxAB",
            "text": "Such a gem! Great service, great prices, great food. Curry and chow mein were 10/10."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdVptMTBSbWM1T0ROd1FsZzNVV1p3ZFc1R1EyYxAB",
            "text": "Wow. I just finished my meal, and I’m still stunned. Sooooo good. I wanted a hearty, spicy meal, and I remembered my favorite Indian spot in San Francisco is a mix of Himalayan with flavorful spice, so I stopped by. I told the waiter what I was looking for (spicy and hearty) and he he recommended the Momo dumplings and chicken curry. I only needed one main course and I had read the Momo dumplings may not fill me, so I ordered the chicken curry and asked for it to be spicy. It wasn’t. But the attentive waiter checked in with me, and when I mentioned it wasn’t spicy enough, he brought over the Momo dumpling sauce (which he had previously mentioned was spicy) and a chili oil. Holy crap. The Momo dumpling sauce is probably my favorite spicy sauce. I wish I could get a jar of it. The chili oil was also divine, and the heat was perfect. Super kind waiter, cool spot, and delicious food. What more could you ask for?"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMZkVyWmZUZ2JEMGpnRRAB",
            "text": "Very impressed with the vegan options."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQM2l0Nzcya29hSU9nEAE",
            "text": "I loved the momos but there were no server at that moment. Bartender was helping us and he was kinda rude. I had to ask few times for hot sauce. Also he wasn’t in welcoming mode.\nBut food was delicious. Recommendations shrimp shumai and jhol momo definitely."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcnRqZnBnRRAB",
            "text": "Food was tasty and very good customer service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNTdIS2dRRRAB",
            "text": "Friendly staff, fantastic food!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM29DMUVnEAE",
            "text": "The restaurant is located in the Kensington section of Brooklyn.  They prepare cuisine from the country of Nepal which is in Asia.  The food has some similarities to Indian and Chinese dishes.  I ordered the pakoda appetizer which were fried carrots, zucchini and onions in a doughy ball with spices.  The green curry was in a small soup container and consisted of all vegetables.  Broccoli, carrots, cauliflower and zucchini in a spinach chutney.  The beef thenthuk was in a small dish with noodles, bok choy and radishes.  Very little beef was in this dish.  The chicken jhol momo were eight dumplings in a soy bean and tomato based chutney.  Very little chicken in the dumplings.  The gulab jamun dessert was described as being similar to doughnuts.  It consisted of three small pieces of fried dough in a sweet syrup.  The \"doughnuts\" were the size of playing marbles.   The food is average in taste and too expensive."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRODdMWUd3EAE",
            "text": "So so wonderful. We stumbled in here just looking for a quick bite and had beyond fantastic food. Great vegetarian options! The staff was super friendly as well. We had the veggie Thali and momos and will definitely be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbG9lcnJBRRAB",
            "text": "Had a terrible day, stopped in for Momo soup and ginger tea. Food was fantastic, great service, tea was exactly what was needed to finish the meal. Highly suggest for anyone in the neighborhood"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmb3BiVTN3RRAB",
            "text": "Best food around courtelyou. Friendly owner and always great!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc28tWDVnRRAB",
            "text": "Good place. I will go again. Not too fancy. Not too stuffy. Quality plates"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2c3FEYkVBEAE",
            "text": "I’ve definitely had better Nepali food elsewhere. The menu here is not only limited but also overpriced. The cocktail selection is sparse, too. There are far better dining options available, so save your money and look elsewhere."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MmZxenlBRRAB",
            "text": "Neighborhood gem! Choose the tingmo to pair with your curry, it is so fluffy and is the perfect flavor boat. The chicken jhol momos are a repeat Uber Eats order for me."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdHFHZHJ3RRAB",
            "text": "I stopped by on Saturday lunch time, the service was so unintrusive, supportive and timely that it was exceptional. The dumplings were so good that i'd eaten them before i could photograph them!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMV92cVB3EAE",
            "text": "Great vibe and everything was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYck0zMkdREAE",
            "text": "The Botanical Garden Mocktail was delicious. The Gulab Jabun were great, and the beef momo were excellent, almost soup-dumplingy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNWVXVGNREAE",
            "text": "Have been here twice and enjoyed it both times.\nTheir soups are phenomenal.\nCan never go wrong with momos, the vegetable ones are the best in my opinion.  The waitress is sweet and polite. They have  great cocktails as well along with Indian beer that was right up my alley"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucW9iQl9nRRAB",
            "text": "Namaste was an incredible experience! We shared a momo entre for an appetizer, and I got this amazing chicken curry. It had less spice than the average curry, which is something that this while boy really enjoyed, but it still had soo much flavor! I nearly licked bowl clean. Also, try the mango Rupee beer. It's has the right amount if sweetness from real mango puree while clearly tasting like a beer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3M3FteFR3EAE",
            "text": "I went during happy hour time and got the chicken lollipop and a mocktail called smiley namaste. The drink was great, the chicken lollipop didn't have enough meat as I'd like but tasty! Great customer service and ambiance. The next time, I did takeout and got chicken fried rice. I didn't like it at all, so that's why I gave this total of 3 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bEpmNFZ3EAE",
            "text": "Food is tasty for sure, the chicken momos were juicy. Good choice of food in brooklyn if fan of indo chinese but, it won't be schezuan level of spice so see accordingly. So, for my taste palette its 4/5 due to spicy. Service is also good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiX3ByZWRBEAE",
            "text": "I love the food and the people waiting on you are very nice it's like serving with love which make the food moreeee delicious mmmmm I say try it you're not only like it you're love it"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdVluX2JnEAE",
            "text": "Food was delicious. Cocktails were tasty. Friendly, Clean establishment. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyZ1B6SThnRRAB",
            "text": "One of the best meals I have ever had!  First time with Nepalese cuisine — wonderful, flavorful, authentic.  I’ll be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyeUlLNGNBEAE",
            "text": "Hits all the boxes. Everything was so tasty. Lopsang was an incredible waiter who helped us with any questions we had. We had chicken and beef momos, pakoda, chili chicken with tingmo, fried rice, and chowmein. Everything was a 10/10. The cocktails are delicious. We had the cucumber drink, the sunrise, and namaste. We found our new go to spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMa1pQd2tBRRAB",
            "text": "Amazing food and friendly service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaWRlWGVnEAE",
            "text": "This spot is literally a hidden gem!  The service is supreme. Lovely ambience. The menu is fresh with tantalizing choices of Himalayan cuisine.  Uniquely crafted cocktails. Definitely now my favorite!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlOU5xWWN3EAE",
            "text": "The wait staff was very attentive and the food was delicious! I got the chili pork with tingmo and the potato appetizer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMb09lUW13RRAB",
            "text": "I freaking love this place. 100% worth going out of your way for. The mixed drinks are some of the best I've had in the city and the pork belly chilli is insanely good. And only $15???"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURCNTZVMhAB",
            "text": "The place has an amazing atmosphere. The art was just beautiful. The food was amazing and the presentation was next level. My favorites were the Rock shrimp, chicken momo with Jhol and the fried ice cream. Not pictured Namaste Brooklyn was my favorite drink. I'll definitely be back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlclpIYW5nRRAB",
            "text": "Namaste is such a great little addition to the neighborhood.  The food and service is really on point here and the restaurant is absolutely beautiful. They may have a pretty limited menu, which is fine since that is a clear indication that everything is fresh and made to order. I ordered the Shrimp Shumai and the Chicken Momo. Both had dipping sauces that really have a spicy kick to them...in a very good way. The bartender also makes a great cocktail as well. I have never tried Himalayan food prior to my recent visit, and it most certainly won't be my last. I will be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1ODdHenJBRRAB",
            "text": "Great new spot for the neighborhood. The menu aren't particularly exotic, I am sure there are more to Himalayan food than just dumplings and Baos. But I am pleasenly surprised by the food. The spicy stuff carries a punch. The chicken…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aXZPQU13EAE",
            "text": "Namaste Brooklyn is located at the heart of Cortelyou Rd near Ditmas park Brooklyn. I went with my family 5 people. They have outdoor seating and indoor. We sat inside the restaurant because of their beautiful ambiance. There are beautiful Art paintings of Nepal & Tibet on the wall. All the staff are welcoming and very friendly. First we ordered cocktail drinks for adult and their two special mocktails for children. Ditmas Old fashion is very good, I also like Namaste Brooklyn. My wife loves the Smiley Namaste mocktail. Among appetizers Crispy Rock shrimp and Gyuma are my favorites. I also like Aloo Dum.\nServer keep checking on us with drinks and refill water.\nI had beef fried rice for main course it was delicious. I also like momo, jhol momo and spicy pork. Dessert both Green tea and vanilla ice cream are delicious, my kids love them. Overall it was a wonderful experience and we will definitely come back again. Highly recommended."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMnN1cFNBEAE",
            "text": "Such a beautiful place to taste authentic Himalayan dishes. The beef momos are juicy and delicious, the chicken curry is beautifully spiced, and the alum doo (curry potatoes) is wonderful. I will surely return to try all the other dishes.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MU9mMl9BRRAB",
            "text": "Lopsang was very helpful and welcoming. He gave great recommendations and descriptions of plates. we had the sausage, potatoes & the tingmo which were all good.  The alcoholic drinks are one of the best on cortelyou. so far I tried the mezcal paloma and it was delicious. i think The gin cucumber lime is also really good, its aromatic ✨"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbWNmdEdREAE",
            "text": "Cons: If you have high expectations of gourmet food then you won’t be impressed.  I wasn’t.  The menu is very limited. The house made pulled noodle chicken soup was lacking depth of flavor that could only be accomplished by long boiling a lot of bones.  It was over salted to compensate and it was pretty obvious.  But hey- I’m just a foodie who makes a lot of deep rich flavored bone broth.\nThe dumpling appetizer skimped on the size and was more of an hors d’oeuvre than an appetizer.\n\nPros: if you’re coming for a meal with friends and want something tasty, you’ll appreciate the fair prices, calm atmosphere, and friendly service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbXRlWnlRRRAB",
            "text": "Pretty great dinner option on cortelyou. Not many Nepalese spots in the city so nice to have one close to home. The stars are the rock shrimp and the cocktails."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeE9XVmNREAE",
            "text": "Happy to find this new place on Cortelyou road!\n\nThey serve authentic Himalayan cuisine and great cocktails.\n\nWe visited it multiple times, and my absolute favorites are momo (dumplings) with chicken and Turmeric Pomona cocktail (with mezcal as a base alcohol).\n\nThe atmosphere and service is as high as in restaurant. I like their authentic, but so gentle vibe.\n\nAnd their cocktails are so tasty for me, that now it’s in my personal top-5 best places to order drink in NYC. Not this mixture of artificial syrup with unknown alcohol like some other places call drinks, you know."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MkptQXpBRRAB",
            "text": "Got beef momo and gyuma. For the drink I got Namaste Brooklyn. The food was delicious, and the drink was refreshing and tasty. The waiter was very kind and helpful with my order. Downside I Had to wait for the food for 40 min. Only because it is a new restaurant, it gets a pass on the waiting. I think they will get faster over time. Love to see something new in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNHJxVzVnRRAB",
            "text": "This place is a must, another hidden gem in the Ditmas park area. We had the edamame, which comes with a delicious spicy soy-sesame sauce, the chicken curry and the beef chilli. Everything is pretty spicy and fresh. The veggies are super…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURac3U3RDFnRRAB",
            "text": "I had an amazing experience at Namaste Brooklyn! The bartender was fantastic, whipping up drinks that were not only visually appealing but incredibly tasty. The service was top-notch, attentive and friendly, making the whole dining experience even more delightful. As for the food, each dish was a burst of flavors - truly delicious and reflective of their Himalayan cuisine. Can't wait to visit again for another round of culinary delight! 🍸🍛🌟"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcDRMdHd3RRAB",
            "text": "The food and the service was amazing! They had great flavours and good quantity. The thali came with papad and raita, which elevated the whole dish. The pakodas made an amazing starter, with a perfectly made pudina chutney. Perfect place for a date or a fun outing with friends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcjVma2dnRRAB",
            "text": "Dining alone, and it doesn’t even feel like that because the ambiance here is just so right and cozy. Teriyaki chicken is good, the lollipop chicken, and of course, the Namaste Brooklyn is excellent for those who love tequila with a touch of ginger. 3rd time here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKemVQa1JREAE",
            "text": "Great addition to Ditmas Park — hope more people give this place a chance! Enjoyed the momos, but the lowmein (chowmein? Sorry, dumb American here. anyways, the noodles) and the chili beef were the unexpected hits. Service was A+. Check this place out!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtZ2VmRUZ3EAE",
            "text": "We had a quick date night in the neighborhood and left extremely happy. We ordered the chicken lollipops and rock shrimp for starters and was so happy with the flavor and plate size. For our entrees we ordered the chicken momo (PLEASE TRY IT WITH JHOL OMG) and chicken chow mein! Everything is was so well done we vowed to make this the date night spot when we don’t want to trek to the city. For dessert, the fried ice cream tasted like a warm funnel cake with sweet cream. So tasty. From the food to the customer service, we’ll be back for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENnVHd0t3EAE",
            "text": "I'll give 2 stars only because the chicken Momos were good. I ordered the chicken curry was disgusting. It was undercooked, bland, and contained bones and ligaments. I couldn't eat it at all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENWFlZ05BEAE",
            "text": "delicious food with a fresh, clean , home cooked taste. we ordered the pakoras, chicken lollipops, chicken and veggie thali and the momo and  loved everything! the place is trendy and service is warm and quick"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNV9UMGhnRRAB",
            "text": "Came here for a birthday dinner. Wonderful experience! Food, drinks, and service were all amazing. Will definitely be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKa2J1WWpnRRAB",
            "text": "OMG. The food is so good!!! I’m eating the beef chowmein with the Namaste Brooklyn cocktail. The portions are larger than what you see in the picture. It was so good that I forgot to take a picture before I started. Lol!  Come through with friends."
        }
    ],
    "reviews_count": 65
}