{
    "name": "The Castello Plan",
    "place_id": "ChIJ4_g4QDFbwokR7aXH3yLVjpQ",
    "grid": "BK14",
    "address": "1213 Cortelyou Rd, Brooklyn, NY 11218, USA",
    "rating": 4.3,
    "user_ratings_total": 565,
    "phone_number": "(718) 856-8888",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdVRWRktXRlJxTWkxTlYwOVJiemQyUWtaRk0yYxAB",
            "text": "We made an in-person reservation the day before, but when we arrived, the staff claimed they’d never heard of it and acted like seating us was a favor. No apology at all. Service was slow, the burger we asked to be well done came raw and bloody, and the mussels were undercooked.\n\nThen they added a 20% gratuity even though we weren’t a party of six, and still suggested adding another tip on top, seriously? Terrible service, unsafe food, and zero accountability."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTmRXaFpka2RFWDFoSFZVMUpSMWRLZWtkTVJVRRAB",
            "text": "Best restaurant in the area!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRFdrZzRaRFJzUTNwaFVFOUhURGgwT0RoelQyYxAB",
            "text": "Good food, tables à bit small and cramped. Excellent, pleasant service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oT2RFeHZRMEZCUmtoUlQwOU9SMU56TmtOTU5GRRAB",
            "text": "I live in the area and have gone here numerous times. It’s close to me and I wanted to like it but i have had terrible service everytime I’ve been here. Wait staff or bartender are not attentive. Maybe it’s because I’m not white like everyone there. Not sure."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kS1NXNTNRMFl4TjJ4b2IzUTBNMU15YWxGTGFFRRAB",
            "text": "Solid 4 stars. Seated right away on an early Friday night. Got drinks,  and ordered, service to start was great,  friendly and on it.\n\nTruffle fries and salad for the table were amazing and was really looking forward to entrees.\n\nI got the fried chicken sandwich with.... well more fries because they were really good. The fries that came with my sandwich were burnt? Like,  fried,  but then baked?? And the end were burnt? No idea,  and totally not seasoned.... literally at all. My sandwich was good?? Fine,  good. Also.... no seasoning. The stuff that was on it was good so like.....I had that. But then I was really hoping someone would come ask how things were so i could ask for salt...... didn't happen. Ate the sandwich,  wished it had any salt.... like,  salt things when they come out of the fryer....... then finally,  I got to ask for some salt,  and got to finish the other half of the chicken that fell out of the sandwich..... which was good!!!!\n\nAnyway,  I know lots of people who live this place. I love that it's in the neighborhood. Good beers. Things that should be good. Maybe the kitchen could learn how to season.\n\nThe rest of my table liked their food very much,  but my wife is pretty anti salt,  and her friend put ketchup on everything."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4ME5GQnJNbVF0WVVwV01saDJXR3RSYUhGTVNIYxAB",
            "text": "I had a terrible experience at Castelo Plan on September 4th and will not be returning. My boyfriend and I arrived 45 minutes before closing (on a Thursday) and were told no cocktails would be served, only wine and beer, despite there being only a few couples there. After ordering wine, we were reminded multiple times about closing, which already made us feel rushed.\n\nWe tried to sit by the bar, but one of the employees was slamming things around and visibly disgruntled, so we moved to a quieter spot. At one point, I noticed a roach, which was unsettling. When we moved to a round table that had clearly been cleaned, a staff member (blonde male) came over and raised his voice, saying the table was “never open to anyone” - something we knew was not true. Moments later, he sat there himself, drinking a cocktail angrily.\n\nThe atmosphere only got worse: the music grew increasingly loud and aggressive, the curtains were pulled closed while we still had full glasses, and the check was slammed down within minutes of being served. The overall energy was hostile and unwelcoming, and we felt pushed out before even finishing our drinks.\n\nHospitality is about making guests feel welcome, but this experience was the opposite. Very disappointing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poT2JGQmlTbk5RVDAxTlVtZEphM0YxZUc1bk5rRRAB",
            "text": "I am a local to this place and it’s simply a perfect combination of food and drinks.\n\nThe place is chic and has a vibe of a well groomed hipster, which is a gem in a quiet Brooklyn neighborhood.\n\nevery drink I got so far was very tasty and well balanced. I love their one page menu for food, where all the dishes are so different and interesting.\n\nIf you are near prospect park and want to have a bite and a drink to complement a healthy meal — choose no other than Castillo Plan."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOb1JqRkZabFptWVhCa2MxUk5aVTF2YURoTVdIYxAB",
            "text": "Ordered a burger for take out. Asked medium well and paid $2 for cheese. Burger was raw, cheese wasn’t there. Place used to care? I don’t know what happened but it’s not what it was before."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMGRYTXRVRlZqVWpJeFIyMUxWVGw0V210a1ZIYxAB",
            "text": "Very cozy and love the atmosphere. Some dishes are a bit overpriced for what they are, but overall a good meal and solid service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnd1NUVnRRWFJXVFVReFRsTmtObTV5U2xWcVdYYxAB",
            "text": "I was amazed how delicious and fresh everything was. My first visit here, so impressed with the taste and quality of all the food. Gimlet was perfect. Cappuccino was huge, beautiful and made just right. Pleasant, friendly service. I can’t think of a single negative!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOTEh1dHo0eU9fNkVBEAE",
            "text": "I keep trying this place but I am never impressed and always leave disappointed. Food always misses thr mark but drinks are ok. Staff provide great service though. The space is very tiny."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLeXk0djI5czh6cVdBEAE",
            "text": "Get the nachos and bread pudding!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOeXM5dG5IOE1IMVlnEAE",
            "text": "Baked eggs with sauce was delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbUw3SVdhNEx6ZE93EAE",
            "text": "Great wine"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJcXVndHV1dzRXTXdRRRAB",
            "text": "We came here on mother's day because we happened to be in the area. The menu seemed great and the restaurant had a good amount of people, good reviews online, so we figured we would try it. I came in to ask if there's space for five, two adults and three kids. I was told no, not for five, unless we wanted to sit at the long tall tables. I said that we can't sit there with young kids, they said that's all they have for five people. I looked around and found it odd that that is the only seating that they have available. There were two tables side  by the door, two tables side by side outside, and then a few tables that looked empty outdoors towards the back of the restaurant. My wife then went to ask again and they said fine, we can sit outside. We tried to do that...but it got cold and windy before we even had a chance to order anything...or really have anyone come up to us. I then asked if we can take the tables indoors. There were now two other empty tables that opened up...so I figured let me go ask. I was immediately told no! I asked why not, it's the exact same amount of space as outdoors. They said that its because we had a stroller, unless I fold it. I said of course I could fold it! There was a woman and a child sitting there and overheard the conversation, she said that they're about to leave and that would give us even more space. The restaurant staff said ok, they will clean off the tables. We waited outside...for a while, nothing was happening. I asked the male waiter, he then said no, we have no space indoors, only outdoors and walked away. So I went inside and asked again, how come we are only being permitted to sit outdoors at two small tables when now they have 3 tables open side by side, if space is a concern. They said \"we're short staffed.\" I understand if staff are frustrated when they are short staffed or whatever, but it really feels like we were being discriminated by the staff for coming with kids. And they were not even misbehaving or anything. It was completely ridiculous. And on mother's day at that!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOFltQnZnRRAB",
            "text": "My partner and I had the weirdest experience at this place today. Maybe we are being sensitive, but this is the story- a regular customer came in and the servers set up to sing Happy Birthday. They started singing Happy Kwanzaa...just…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNnNLMzBnRRAB",
            "text": "Love this place. Food and staff are great! The fried chicken sandwich is amazing! Get the Pain Killer."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNzh2YkJREAE",
            "text": "the waitresses are kind and helpful and the food was okay, but the cleanliness of the restaurant was unacceptable. the cups and the cutlery weren’t clean and when I told the waiter and asked for more, I was given new ones that were also dirty (it was a different set with dirt in different spots). I can’t overlook that"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbDQ3YUpnEAE",
            "text": "Nestled along Cortelyou Road in Brooklyn’s Flatbush neighborhood, The Castello Plan presents itself as a beacon of culinary charm, effortlessly blending rustic ambiance with a contemporary twist. The establishment’s heated patio invites patrons to linger, offering a cozy retreat that complements its inviting interior.\n\nThe menu, while not extensive, is thoughtfully curated, showcasing a fusion of Italian and French influences. Dishes like the Butternut Squash Gnocchi, accompanied by oyster mushrooms, browned butter, parmesan, and sunflower seeds, highlight the kitchen’s dedication to harmonious flavor combinations.  The Ricotta Gnocchi, paired with asparagus and truffle oil, further exemplifies this commitment.\n\nBrunch offerings are equally enticing, with selections such as the challah French toast, served with sour cream and plum jam, standing out as a testament to the kitchen’s creativity.  The beverage program, featuring craft beers and inventive cocktails, complements the dining experience, inviting guests to indulge in leisurely afternoons or spirited evenings.\n\nService is attentive, with a staff that balances professionalism and warmth, enhancing the overall dining experience. The ambiance, characterized by tasteful music played at a considerate volume, allows for intimate conversations without the need for raised voices.\n\nWhile The Castello Plan excels in many areas, there is room for growth. Expanding the menu to include a broader range of options could cater to diverse palates and dietary preferences. Additionally, ensuring that all dishes consistently meet the high standards set by the standout items would further solidify its reputation."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdk4td053EAE",
            "text": "Very creative drinks and the food was great."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwME56MjZBRRAB",
            "text": "Food and service are great. The place is a little expensive, so this is not an “every-day go-to” place."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNjVMWGRnEAE",
            "text": "Such a cozy, romantic spot. Amazing food (get the shishito peppers + Castello tots) and great service. 15 min walk from Kings Theatre, so it’s a perfect place to grab a bite and delicious cocktail before a show. Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBa2U3RzRRRRAB",
            "text": "We ordered pumpkin soup, six oysters, roasted cauliflower, a lava cake, and an espresso martini. Everything was delicious, and the drinks were well-made. The only downside was that we were seated at the bar, where the space felt quite limited."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcDhfbV9BRRAB",
            "text": "Ordered an add on and got it raw on the side. \"Manager\" said they were not accepting feedback :+/; ......they could only give explanations for the poor service.\nApparently, standards have slipped with the current \"support\".  Now can't trust them based on their front people or back people.  I won't order again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmazdhZHlBRRAB",
            "text": "The restaurant is a great place to go for the atmosphere, it's very rustic yet unique.  I got the rainbow beet salad, popcorn chicken, and steak. They were all good but the steak was too salty. My date had the salmon and it was overcooked she sadly didn't eat any of her food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cnFqbVlBEAE",
            "text": "5 star experience at castello plan. The stuff were incredibly friendly and made our evening truly unforgettable. Super sweet and attentive people with always nice attitude, a smile and making you feel at the right place at the right time.\nHighly recommended.\nThe pumpkins gnocchi and lava cake are irresistible 🤤  We will return for brunch!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eXI3RERBEAE",
            "text": "I’ve lived in Ditmas Park some years ago but somehow never made it over here. That changed this past spring when my wife and I are visiting friends and stopped by here for a few drinks and some snacks before a dinner. The place is very warm and cute inside as well as its outside patio. We tried four or five different small dishes and everything was very yummy.\n\nReally loved the cocktail menu as it had several interestingly crafted cocktails that we thoroughly enjoyed\n\nEverything we ate was equally good and I would love to come back and try you more dishes that looked good and we haven’t had opportunity to order.\n\nThe place was quite busy by the time we were leaving, but the weight staff were super on top of it and some of the more efficient service I’ve had in a while\n\nThoroughly recommend"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeWZuMEZnEAE",
            "text": "Nice ,but more like a bar ,and seating area could be improved"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQa3Q3R3FBRRAB",
            "text": "We had a lovely time and the food was wonderful. The staff was so nice as well."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOUpmeHNBRRAB",
            "text": "The burger 🍔 was delicious and hearty!  The owner is fun and engaging.  The drinks were a great pour.  The atmosphere is cozy and stylish. There's no bad choices on the menu.Why aren't you here yet?"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQOUlYNHlBRRAB",
            "text": "Some dishes are delicious, some of them little bit less…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNVo3TU1REAE",
            "text": "Great food,  superb cocktails!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNTdHTlZBEAE",
            "text": "I have lived in Ditmas Park for nine years and have eaten at Castello Plan at least half a dozen times and have had generally pleasurable experiences. Most recently, my companion and I were accosted by a very rude employee. This person gave us an uncomfortable feeling from the time we sat down, and I don't know if this was due to things being universally tense right now, or if it was because I was Black (this employee, and the person I was with, were both White). However, I quickly made the decision to leave and this employee said \"don't come back\" in a very aggressive fashion. Needless to say, I will be following his advice. This interaction was the single most upsetting interaction I've had at a business establishment in my entire time in this neighborhood."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJODV5R1ZnEAE",
            "text": "The food was okay but a little expensive, but the service was unbearably slow. An hour to get our drinks, an hour and a half for food. The atmosphere was nice and the staff was pleasant, but that wait is just too long.\n\nEdit: 2024. Walked in, went to the bar with a friend. Found two seats after a brief discussion with a patron about if the seats were taken.  White guy bartender seemed annoyed so I joked \"sorry for so aggressively inserting myself into the scene.  I don't think I made friends with the bartender\"\n\nHe said \"no. No you did not. Just roll it back\"\n\nFriend said \"maybe let's go somewhere else. Not getting a good vibe here\"\n\nBartender said, \"don't come back\"\n\nOkay."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbGFYNXB3RRAB",
            "text": "I go for brunch here every once in a while and I enjoy everything. I have tried almost all the menu and have been satisfied each time, with both flavor and portions. The staff is nice and attentive and the whole space is really nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYb2I2ZXVBRRAB",
            "text": "We had a lovely brunch on the day of Armageddon. The food was really good and the portions were just enough."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeTdyZi13RRAB",
            "text": "Food was really good. there wasn’t one thing we ordered that was bad . Points were deducted for the table , it was sticky and didn’t seem clean"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bDhPVzlBRRAB",
            "text": "Great food, great drinks, great service, great music, great atmosphere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OGRfclJ3EAE",
            "text": "Stopped by this local hole in the wall for a quick bite and a drink, loved it! I ordered the Georgia winter cocktail, a dz oysters and a lil bowl of their tots. They had a really good varietal of oyster, plump & juicy. The tots were not at all what I expected, I was envisioning cheap frozen potato coins but I was pleasantly surprised! They were 10/10 crispy, creamy and delicious. I would’ve ordered 40 more if I was that hungry lol will most likely become a regular here. Good vibes good food and a good playlist."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Nk4yelhREAE",
            "text": "I bring anyone from out of town here for lunch! One of the only places on Courtelyou that actually has a good sit down lunch. The vibes are great, the bartender has always been extremely friendly & knowledgeable, and the food is fantastic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bGIyazlRRRAB",
            "text": "Where do I even begin about this place? We are greeted by the wonderful dual of the Brother sister combo Cici and Gabriel. They started us off with some lovely cocktails, pineapple tequila, and then we went into their beautiful cocktail menu so many wonderful options presented with something that was more my speed but everything looks absolutely delicious. We actually came back two days in a row. The first day was only cocktail filled, but with all the wonderful food coming out of the kitchen it was mandatory for a second day. I ended up getting the croissant sandwich which was absolutely to die for. A fluffy croissant, scrambled eggs with cheese, avocado, sesame seed, and some beautiful bacon with the arugula and their special sauce. If I could give this place a higher rating, I definitely would definitely recommended for family and friends and all walks of life.\n\nI want to give a very warm thank you to Cici for her wonderful hospitality and her patience to take me through the menu and Cocktail list. It is hard to find good employees, and i must say her service was exceptional alongside Gabriel. I hope to see them on my next trip back to New York."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3OGFfMW1BRRAB",
            "text": "Friendly staff, air conditioned (which is a plus for Cortelyou), delicious food. Happy to spend my money here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM19PWGlRRRAB",
            "text": "Walked in looking for a quick meal, and there were only 2 other patrons inside. The waitress told us we could sit anywhere when we opted to sit outside. We sat ourselves at a 4 top table (which seemed more reasonably sized) because the 2 top tables were very small (we are both quite thin). The bar tender immediately rushed out and told us we could not sit there and to move to a 2 top. We felt unwelcome and confused because the place was empty, and we weren't intending on taking too much time. Just a quick bite and a drink before a concert. The atmosphere was cramped and dark. We just left. 2 stars because the waitress was the warmest part of the place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMjV5aDhnRRAB",
            "text": "Great high end local sit down with delicious oysters."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydklhUDd3RRAB",
            "text": "I had a very rude encounter at this restaurant tonight. I was on my way home from work and wanted a fulfilling dinner. I saw they had quesadillas on the kids menu and asked what the portion size was, since it’s meant for kids. The server told me it was a small size, and I asked her if I should maybe order 2 and she said yes. When the male server brought the food out (which I believe his name was Tom), I immediately realized one portion would be enough for me so I asked him to take back the second portion. It was untouched, and he said “why don’t you take it home?” I said I only needed one portion. He said “well I can’t give it to anyone else”, and I said “okay I’m sorry but I don’t need this much food”. He began raising his voice at me and immediately packed my food in a to go box, telling me to take it home and that he won’t take the second order off my bill. After eating my one quesadilla, he ignored me after I asked for the bill 3x. I knew he heard me because everyone else around me saw me calling him, and I was sitting near the front of the restaurant. I understand that not every restaurant takes food back, but I don’t know why he insisted on charging me for something I never touched, and why he was so passive aggressive about it. I was pretty polite, and I’m not sure if he was in bad holiday spirits but this was no way to treat a new customer and I will not be back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcXNlZ01BEAE",
            "text": "I love going here when I visit my friend in the neighborhood. Their cocktails are always so fun that it’s always so hard for me to choose! I love the enormous amount of outdoor seating too. The servers are always so friendly and personable. And as a vegan, I’m thankful that I can get lots of appetizers and the veganized version of their impossible burger. Pro tip: get the pan fried okra!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaN2J2cGNnEAE",
            "text": "Really great atmosphere, delicious food! Very good seasoned! Portions are big!\n\nRestaurant is small but well organized, you can choose from seating indoor or outdoor.\nGreat selection of drinks/beers.\n\nLocation of this restaurant great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsOV83QlF3EAE",
            "text": "Great drinks, amazing food and a cozy location. It was super quiet on a Tuesday afternoon, but the drinks and meal were tasty! Best Truffle Fries I've ever had."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqaXMzM0RBEAE",
            "text": "Me encantó , la comida fue espectacular, deliciosa! Y la presentación muy apetecible , los wafles sin duda su salsa agridulce es deliciosa 😍 1000% recomendados! A mis niños les encantó las palomas de pollo y las papa fritas y tienen una porción muy generosa! Definitivamente volvería más veces , además de ser un lugar tranquilo es perfecto para reunirse con la familia y amigos 👌🏻👌🏻👌🏻"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyeXZ2YWFnEAE",
            "text": "My favorite place for pasta & cocktails. Absolutely recommend Spring Tagliatelle with chicken, mushrooms and ricotta - that’s the reason why I will return again and again. Plus in my personal top - potato tots with cheddar cheese and chives (I even tried to cook it at home). Cocktails are tasty and quality.\n\nVery good place, recommend it!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpOGR1bThBRRAB",
            "text": "It is funny...I have passed this place so many times and have eaten in other restaurants in the area, but I never gave this place a second thought. That is until I saw a posting about this restaurant on Instagram. This place is so cute and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocElYcE5REAE",
            "text": "We’ve been coming here for years. The food is always delicious and the cocktails are good. We’ve tried almost the whole menu. One of our favorites is the clams. But the jerk wings are right behind. I love that you can go for anything, brunch, lunch, dinner, or cocktails and a snack. For cocktails, I recommend the painkiller, but their rotating signature list is great. They also now have dessert on the menu, which we always wished they had. It does get pretty busy on a Friday or Saturday night, so definitely reserve."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpbjRUUjNnRRAB",
            "text": "Reliably delicious oysters, great wine. The visuals of this spot are beautiful : fresh flowers on every table, beautiful wall art, and a well stacked bar.\n\nCome here for breakfast or brunch: avocado toast (with bacon) and a latte. Or come for dinner: a short menu boast some good eats, and I especially vouch for the burger and old fashioned.\n\nSeating is comfortable and sensible, with indoor and outdoor optional."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbDRXak1BEAE",
            "text": "Rustic, simple, and good food. It can definitely get loud, and it’s better if you are only a party of two because the tables are small. The food is pretty consistent and balanced. If you don’t want to do dishes, this is a good spot to get a basic meal and enjoy it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhNFBPNFRnEAE",
            "text": "I had a craving for fried chicken sandwiches. So I looked up for a decent place that will deliver. Honestly, I lowered my expectations a bit because ordering fried chicken for delivery is quite tricky to expect the best product. But I was surprised that the chicken was not soggy with sweat but had a perfect texture and well seasoned. The pickled red onions and arugula were perfect in this stack. I’m giving it a 4 rating because I ordered to have fries with a particular seasoning and they missed that.\n\nAnyway, if you are looking to get good quality delivered food, I will highly recommend this spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NWJPWlZ3EAE",
            "text": "I ordered the “tater tots” to split with my partner and it was really not anything like tater tots. I was not a fan of this. When I order something with a common name, I expect to be served that and not an artistic version of it? It seems like they have an issue with this though, reading a review about an “endive salad” being 95% arugula. Nonetheless, the not-tater tots were enjoyable enough, but felt like a ridiculous price to pay (about $11 or $12) for 8 mini potato balls filled with cheese and served with way too much chipotle aioli. The chipotle aioli was hot, but not really an aioli, either. Just really a chipotle mayonnaise.\n\nMy iced mocha was good, but laughably, I was charged 75 cents for oat milk without being told it was extra when I was asked for my preference. This is Brooklyn, folks: just about every queer and lactose intolerant person orders oat milk. 75 cents is an absurd upcharge, especially when the coffee is served … well, how I would make it at home: in a mug or a jar, a few ice cubes, and a metal straw.\n\nFor those two items, my bill was $20 (before tip). Will not be returning.\n\n+1 star for the friendly skeleton inside for the season."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Xy1UeC13RRAB",
            "text": "One of the best and most reliable restaurants in the neighborhood. We love coming here and have never been disappointed. They overdeliver with comfort food staples (pictured: a tater tot that truly goes above and beyond) and get creative with their drinks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZ0p1cjFBRRAB",
            "text": "This place is amazing! The food and service is incredible. I’m a super fan of their salad with chicken wings. Their chicken sandwich is divine and they make a righteous set of French fries.  The music is on point and the wine is relaxing.excuse my pic. I ate Everything!🤣 This place is a total vibe, so come through 🤩"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacVo2ZjBRRRAB",
            "text": "I took my girlfriend here to celebrate a promotion and their $40 charcuterie board consists of a few razor thin pieces of cured sausage as well as few pieces of less expensive meats. There were an about 3 small cheese slices as well of cheese on par with Trader Joe’s. We had to ask for more bread although the amount of jelly spread  given was not enough for the amount of food/bread on the platter. Was going to order an entree but the vibe was off. Extremely disappointing. Completely ruined a special day. Highly embarrassing."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZanAtT2VREAE",
            "text": "Enjoy myself every time I go. The bottomless brunch is a good value. Each cocktail is made fresh - they even make the OJ for the mimosas... No mixers here! I've also been for taco Tuesday. I highly recommend the fish tacos. The service has…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeko3Tm5nRRAB",
            "text": "Nice place, I like the decorations. They have a nice menu of drinks n they have very good n juice burger it's a little bit a price but its Deserved)) we got a cheese plate with prosciutto and jelly, and I think it's a nachos"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdC1uUE1BEAE",
            "text": "Their drip coffee is not one to scream home about, I will however say, the service (quite friendly) and ambience is really cozy. I marked it as a place to go and chill or mentally recuperate. They also seem to have a back outdoor patio, however, was too cold to venture there."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwakp2dkd3EAE",
            "text": "Castello Plan used to be good but the SERVICE IS AWFUL. Ordered food tonight and they gave the driver the wrong food. They said they would figure it out and call me back. No one called back so when I called THEM back, the answer from the guy on the phone was “He picked up the wrong food. Sorry.” So I guess that’s it? They make a mistake and good luck? No offer to help, send me the correct food, nothing. Cool restaurant man, good luck with it. There’s WAY better places that have opened up on Cortelyou AND they are nice. The food smelled awful anyway - don’t order the chicken sandwich. Yes it was the wrong order but it looked disgusting, soggy."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2aU5hVW9nRRAB",
            "text": "When I came in I just humbly sat at the table and was waiting for the guys to come for me. After two minutes nothing changed, but I decided to change the table for a more comfortable one. Ok, after a couple more minutes I was noticed and made an order.\nI was extremely hungry, so wanted something substantial. And I got this magnificent salmon. Probably one of best dishes I've eaten in the USA in a month. Big, tasty, juicy. Loved it, so the initial embarrasment was quickly forgotten."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbmI3ZDRRRRAB",
            "text": "Best brunches ever!\nVery friendly staff❤️\nHuge portions🥰\nDelicious croissants, waffles and coffee is good(not Blue Bottle level but it’s fine:))"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwX3JmS2FBEAE",
            "text": "The Castello Plan is a great hang out place troughout the day.  Amazing coffee in the morning, tasty and healthy lunch, great after-work cocktails, lovely side terrace, great brunch food.…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZaEs2ZFNREAE",
            "text": "VAGUELY MEDITERRANEAN\nin its offerings, The Castello Plan is easy to miss surveying Cortelyou Road’s rich array of ethnic cuisine. The venue’s sole sign is eye level and a dull metal…"
        }
    ],
    "reviews_count": 67
}