{
    "name": "Blue Mountain Restaurant",
    "place_id": "ChIJSfW0OZ5bwokRIotWvPUjP9s",
    "grid": "BK14",
    "address": "959 Flatbush Ave, Brooklyn, NY 11226, USA",
    "rating": 3.6,
    "user_ratings_total": 93,
    "phone_number": "(718) 282-2968",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kb2JqTlpZWE5KWDJaWVFWYzNUR2wwWkd0d00xRRAB",
            "text": "I’ll definitely be back ⭐️⭐️⭐️⭐️⭐️\nReally good food & great energy!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd01FOTBaVFZJVWtGbWFURkNablF3VG1SSU9HYxAB",
            "text": "Jerk Pork was super dry, macaroni flavorless potato salad, flavorless many other Caribbean options in the neighborhood. Don’t choose this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWloyTnNjbE5RYVRjMU56ZEtlbVZxTUZBemQxRRAB",
            "text": "Food is so freakin good 😩 I got the oxtail and rasta pasta. I tried it my first night in NY, ate half that night & the other half for breakfast the next morning. Then got a bowl to go when I was leaving NY. Only thing is i found a piece of plastic in my food. still good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUk5FdzRjMWhrVG5ablgzaHNlazVpWTNWVVgxRRAB",
            "text": "Thai is a Jamaican take out restaurant with good food and service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMDhxOVJBEAE",
            "text": "The food is delicious"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eE9yXzlnRRAB",
            "text": "I'm surprised the reviews here aren't consistently high. I've been going to Blue Mountain for three years now; and, the food is consistently great. I'm very impressed by the taste, quality, and freshness for the very good value!\n\nThey catered some food for a baby shower I helped plan yesterday.  The fried chicken and salad were a big hit and everyone loved it!  They were timely in their delivery, and very easy to deal with! I would 100% work with them again!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBejh6N3lBRRAB",
            "text": "Excellent food and service! No Bs!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbDVLVWhBRRAB",
            "text": "Needed something filling but fast and the red bean soup was just the thing. The flavor was excellent with a thick texture and soft carrots, chunks of Irish (potatoes), calabaza and dumplings. Genuinely Jamaican in the most Caribbean part of Brooklyn! Love to keep going back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdGV1bHFRRRAB",
            "text": "Ordered on ubereats rice was dry and the chicken was too but it was edible."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBc3BhREhnEAE",
            "text": "I frequent this location at least two or three times a week. Everyone is very personable, attentive, and actually cares about who they serve! Not to mention their food is top-tier🫡, I've been to many West Indian restaurants and none have tasted as authentic as this one! I cherish the cooks and the people who serve me at this location...shout out to y'all 🙏🏾"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2c0w2QmNBEAE",
            "text": "The male server is a liar I asked for dumplings he didn’t put none on the person the person get mad because he likes dumplings"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuaDlHOWJ3EAE",
            "text": "I ordered their red bean soup though Ubereats and it was amazing! So good! I’ll definitely be ordering from here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OVlDRTRnRRAB",
            "text": "🤩 You have to order from here! Everything is delicious!! You will not be disappointed 🤩"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeTRmWi1RRRAB",
            "text": "Beware i got food poisoning from their chicken and its super dry too horrible spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeUp2elFREAE",
            "text": "I’ve tried a lot of Jamaican spots in the neighborhood and when it comes to patties, nowhere even comes close. I’m talking flavor, enough filling, flakiness, they got it all down. This is also my go to place for jerk chicken, but act fast because it sells out quickly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybGIyWjVBRRAB",
            "text": "Best restaurant in Brooklyn them stew peas have me…. Customer service 100% big Trish always makes sure my order right… guys just ask for Trish she will make sure your order complete … 100 outta 100.   Flatbush branch for me"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeE91TDFRRRAB",
            "text": "I love everything about Blue Mountain from Breakfast to lunch til dinner.\nAll the staff members are awesome and always make me feel at home.\nThere fish soup is my favorite all year round 😋."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeV8tdDNBRRAB",
            "text": "Ackee was 🔥🔥🔥\nFlatbush location"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOHBQdmJnEAE",
            "text": "The jerk chicken is dry, the stew chicken has no flavor , the mac and cheese is not macking. They definitely need to work on their seasoning more and getting menus."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6cHJhbHNnRRAB",
            "text": "Need to tone down the salt (especially in the soup)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaHZhaUV3EAE",
            "text": "Amazing food and customer service . Food was on point thanks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqaWF6eExBEAE",
            "text": "Had the rum cake, which is the best I’ve ever had.  Everything else looked and smelled amazing!  Perfect way to end my vacation.  Thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENzQzWVRBEAE",
            "text": "Customer service good friendly atmosphere, clean."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdExpLWZBEAE",
            "text": "Absolutely worst customer service. Whatever lady in there is beyond rude. You can’t ask a simple question without getting a rude response back. Didn’t even waste my energy to order food because the lady working in there was being so rude to me. Atmosphere was horrible can’t even wear glasses in there without them fogging up. Customer service truly makes a restaurant and if you’re not going to treat customers with respect don’t even waste ur time going there."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNjdHN3d3RRAB",
            "text": "I have been eating here for a few weeks now and seem there something wrong the preparation of the food. I always get a UBER delivery and yesterday found a piece of the sidewalk in my food. In my stew peas I taught I found a bone, I could have swallowed it or broke my teeth. Attached is a picture. I threw away all the food I ordered tasted horrible. This is horrible will never order again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxLVl5SWVnEAE",
            "text": "I order from this place on Uber eat and me in my niece got sick"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWaU5Lc2x3RRAB",
            "text": "I had placed an order on uber eats and a man from the store called me shortly afterward saying that they were out of the jerk chicken. He then said that I would have to replace it with something else. I did not want anything else besides…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsODQ2WE5BEAE",
            "text": "Ordered ackee and salt fish. It barely had any saltfish in it. It wasn't good at all the Blue Mountain on Utica is way better"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMmRfX1RBEAE",
            "text": "I couldn't tell if it was the BBQ chicken or rice. There was some type of foreign matter that felt like rock (hard, grainy/sandy). It persisted beyond one bite, so I put away to save for proof. Retrieving a granule from my mouth, it appears it may be glass. Mac and cheese was completely dry, but I did eat one portion, because I was hungry. Potato salad was fine, and I haven't tasted the red bean soup (assuming it's fine). Let me say I've ordered before, and didn't have this issue. I would like for the restaurant to be more careful, as I'm now worried about what I consumed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbjdtS3NnRRAB",
            "text": "Rasta pasta had a lot of oil. Oxtail had so much fat on it, it was gross."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMnVHMkhnEAE",
            "text": "Very tasty jerk pork! Mac and cheese was solid too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGczhqTC1RRRAB",
            "text": "I order stew chicken with white rice and jerk chicken with rice and peas it took 1 hour to come it was cold no jerk chicken sauce good fry no fork or spoon or napkins waste of money"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1OFB2OE93EAE",
            "text": "Waited in line for 10 minutes, workers don’t even acknowledge you cause they’re too busy attending to online orders(which seems to be the only orders they care about)"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyOU1PcmZBEAE",
            "text": "The curry and rice was terrible. The curry chicken was dry and the rice was hard and uncooked .The beef patty also tasted terribly frozen . The macaroni salad had a piece of hair in it. I was  completely disgusted and disappointed. My mom bought the goat head soup also and it was extremely salty. I Threw away all  of my food because of how disgusted I was. I will never eat here again. when I called to complain they offered to  remake it, that was a big no!! They need to do better in representing Jamaican food because this was outrageous and wouldn't consider this a Jamaican restaurant at all. If you want real  Jamaican food do not come here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaa3IyUmNnEAE",
            "text": "Their food was great"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadllfOU53EAE",
            "text": "Ordered a Guava Passion drink. So full of ginger can't even taste guava or passion. Ginger burn my throat. I mean if it's not ginger juice why is it so overwhelming with ginger. Really messed up my breakfast."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNWQ2ZVF3EAE",
            "text": "The food was trash, I literally had to threw it in the trash! I ordered bbq chicken with Rice & peas & a side salad of potato salad.\nRice & peas: Mushy, overcooked\nBBQ chicken: Stale, hard & old\nPotato Salad: watery & tasteless\n\nFirst & last time buying food from here….\n\nBusiness owner: please revamp your kitchen, chefs & food protocols."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadEtfWkJREAE",
            "text": "I ordered peanut porridge. Which was very tasty."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcDktTVNnEAE",
            "text": "I tried this place for the first time through UberEats and let me tell y’all .. DO NOT waste your money.\n\nI ordered a bunch of things to try. The stew chicken was bland but the most tolerable thing. The fried chicken was stale. The curry goat was the most disappointing curry that I’ve ever consumed in my life.\n\nDid y’all even taste the food before serving it to people???\n\nI don’t know who woke up one day and thought to themselves to become a cook but please try something else. Maybe take up painting."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMDY2NzZnRRAB",
            "text": "Best thing i got from Uber eat in a while and best peas soup i had in a while..\nPlus they actually read the note on the order and fulfilled it person. My only regret i didn’t order a large"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OHNHXzhnRRAB",
            "text": "This is my second and last time ordering from this place the first time I ordered I ordered a vegetable soup which was very good the red pea soup the second time I decided to Branch off further into the menu and order the rasta pasta the lo mein and I also ordered broccoli and carrots in which the broccoli came smelling so spoiled and still the lo mein was like six days old and dry and didn't have no more it was just dried out and then the rasta pasta was like big macaroni and cheese add insult to injury I found a plastic in my food everything from this restaurant smells spoiled and sour absolutely disgusting"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeksyQWlnRRAB",
            "text": "The dinner I purchased consisted of salty not savory oxtails. Mushy over cooked rice & peas and sugary undercooked macaroni salad.\nWhat  A complete disaster this cuisine I was looking forward to consuming a delicious meal. Instead I spent nearly $35 to discard. Highly disappointed and just tired of these restauranteurs not hiring skilled chefs. Another Flatbush Caribbean  restaurant with lackluster cuisine !!  Horrible food based on my first experience and last\nWhat a waste of money !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocGZ5RjJRRRAB",
            "text": "I just found them I live in the area and the food is not good finally came blue mountain food is delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNGNpVWd3RRAB",
            "text": "The best jerk chicken ever!!! Best Jamaican restaurant in the tri-state area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoanZ2aGd3RRAB",
            "text": "Excellent taste.\nVery clean premises.\nReasonable prices."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaFplQUVnEAE",
            "text": "I've passed this place so many times but never\nstopped in. I finally did and I'm so glad! I got the\nRasta pasta and their famous honey jerk chicken\n(small). While oily and a little salty, the Rasta pasta\nwas one of the best I've had. It was cheesy and filled\nwith vegetables. The small honey jerk chicken\ncomes in a small container but it's filled to the brim.\nI got white rice that ended up soaking up some do\nthe chicken flavor, 3 pieces of chicken and salad\npiled on top. This was enough to make me\ncomfortably full with a couple bites of pasta but if\nyou're really hungry upgrade the size. Staff was\nfriendly, I'll return!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyLXF1N09nEAE",
            "text": "I ordered on Ubereats 2 weeks ago the oxtail meal with beef Pattie. The Oxtail itself I give 5 stars. The meat was so damn tasty and tender! Whoever prepared the meat put there foot in it I swear!!! The rice n peas was good. The recipes for…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyci1hRldBEAE",
            "text": "I purchased 2 peanut punch and a salmon patty. Both of the peanut punch was spoiled and the salmon patty was spoiled. I caught food poisoning from this place. Spent this past Saturday in bed all day vomiting from a sip and a bite of food…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlakk3VTFnRRAB",
            "text": "Highly recommend. And when you've had your delicacy, please try the bread pudding. Cassava and potato puddings are there too, but the bread is in fact absolutely glorious. Take my word or not, the taste is the truth."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMybHVYaUNBEAE",
            "text": "I love this place. The honey jerk chicken is SO good. Staff is always friendly and have great recs. Their desserts are also delicious…try the banana cake or the sweet potato pudding…or both."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtb003Zl93RRAB",
            "text": "Tasty and well cooked food. Much better than Many other Jamaican restaurants. I like their taste and I'm well versed in Eating from many\nJamaican places, eg. London, Bahamas, NY, JA, LA, Chicago, Washington and Canada etc."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dm9uSjZnRRAB",
            "text": "I went to this restaurant a little before closing time. I guess the lady working just wanted to leave and wanted to be finish. Food is not all of that and on top of that I gave the lady money and she stated I didnt give her that amount. So I will never return back to this restaurant. ALWAYS show the money before you it to give them!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMjhIT2RnEAE",
            "text": "Bitter dry cold piece of fish. Horrible. Pumpkin rice had 2 different colors and no pumpkin. Just horrible."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeElYaC1RRRAB",
            "text": "Love the food. The atmosphere is friendly and welcoming. The jerk wings are life paired with the rasta pasta is amazing.  Try it"
        }
    ],
    "reviews_count": 54
}