{
    "name": "Art of Prime",
    "place_id": "ChIJ88FsV-pbwokRxe-RQtgJrBE",
    "grid": "BK14",
    "address": "943 Coney Island Ave, Brooklyn, NY 11230, USA",
    "rating": 4.9,
    "user_ratings_total": 64,
    "phone_number": "(718) 940-9454",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaE5GWXhibmhoZVdoMGFuazRPVFpPYVU1TVMyYxAB",
            "text": "Very good place. All was great."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVeVdrOTZVRlpWVlVKaGFsWkRXRzVwWjJ3NWRGRRAB",
            "text": "Alex is the best bartender! The staff and dining was top notch! I'll definitely be coming back again! Thank you!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeVpUTkRaVlo1Y1ZCcVVIZEJUVkF5VEZWRGFWRRAB",
            "text": "We had a great experience here! We sat at the bar and Alex was our waiter, he took great care of us and made sure we had everything we needed. The food was delicious, flavorful, and beautifully served. Highly recommend!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoZlVIUkRWV05PTlZGRWRFUlZPVWM1T1VWQ1FtYxAB",
            "text": "food was deilicious solid service was great reccomend ppl should go there"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMGNrcDJOVmRMUTBWQ2FUUkphbGRTTm1sVk1IYxAB",
            "text": "Phenomenal food, beautiful atmosphere. The kebabs are out of this world!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBdFZqTkZiMlJTYVhJNFpUbENXR1ZqUXpOek5tYxAB",
            "text": "Wow! Beautiful ambiance, friendly service, delicious food and amazing date ;)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbVZHcHFMVzlyVkRaeFpsWXlWV2hNUkdaZmQzYxAB",
            "text": "A cozy interior, excellent service, and great attention to detail. They serve Beef Wellington along with many other unique signature dishes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twd1VsZFZWR1k0TUU5NmFuZzVOVGt3Y1dWT2QxRRAB",
            "text": "Was a beautiful experience, amazing vibes, casual atmosphere, delicious food, friendly waiters. They scored 100 !!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RFNFTnNUMWhVUWt0clRXNTZhbTlrWDNaR1JWRRAB",
            "text": "It was a phenomenal experience  !\nFrom the service to the Food !\nVery professional all round .\nThe Name of the restaurant describes it the Best !\nART OF PRIME !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSk1EWTJVVTE2ZWpWRGRraG1Wa3BtUzNSR1psRRAB",
            "text": "My wife and I had a fantastic experience at Art of Prime. The food was incredible, the service impeccable, and the atmosphere just great. We will definitely be back, and would highly recommend if you're looking for a nice night out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCM1pITkZVbUoyUnpGeFdGUkVRWFZsVG1oaFgxRRAB",
            "text": "Absolutely beautiful! From ambiance to service, they’re amazing. Food was delicious and pleasing. They use to be Atlas steakhouse and not sure what happened but service is still great. A bit too crowded to my liking but they made my weekend. Last weekend was good because of them. It’s great visiting that side of Brooklyn. So much history and sighting."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWVpreFZka05SYUdwQ2JFZERlVkJMYzI1b1NFRRAB",
            "text": "Excellent food and great atmosphere. The staff was outstanding."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRVZsVlZlV1Y1YTNSWmFWaERlSFpUU1RKalkwRRAB",
            "text": "Art of Prime is a beautiful addition to the Brooklyn eatery scene! Delicious unique dishes as well as the classics Steakhouse expectations make the Ambiance not the only amazing thing about it. Allison (formerly T Fusion) makes sure everyone is comfortable and well taken care of. Wishing them lots of success!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSU5uUjJRV2hJWmtwTlVURTJTa3hPVkdaeFNWRRAB",
            "text": "Best experience. Food is outstanding. Great ambience. Extremely nice staff...."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRFRsVnFRa1ZhVUVzM2VXTXljSGhxVWtaUmRIYxAB",
            "text": "Beautiful place smack in the middle of Brooklyn.  Exceptional food, service atmosphere...a must if   you tired of Manhattan shlep!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUlZFcHVhbGhhWTFkMlIyb3hRa3BaVTFaeWNXYxAB",
            "text": "Wow. Just wow. The food, the drinks, the ambience, the service, everything was absolutely Devine"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPREdnTktwNGFLdi1nRRAB",
            "text": "Food was awesome 👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJUF93ZXp5OWF1TGlnRRAB",
            "text": "An Unforgettable Kosher Dining Experience!\n\nFrom the moment we walked in, we knew we were in for something special. This kosher steakhouse is a true gem, blending an upscale ambiance with warm hospitality and, most importantly, exceptional food.\n\nThe steaks were cooked to absolute perfection—juicy, tender, and bursting with flavor. You can tell the chefs here are passionate about quality and precision. Every dish was beautifully presented, and the attention to detail, from appetizers to dessert, was remarkable.\n\nWe also appreciated the thoughtful wine list and the knowledgeable staff who made excellent pairing suggestions. The service was top-notch—attentive without being intrusive, and everyone we interacted with made us feel genuinely welcome.\n\nAs someone who keeps kosher and appreciates fine dining, I can confidently say this place sets the standard. Whether you're celebrating a special occasion or simply want an elevated night out, this restaurant delivers on every level.\n\nHighly recommended—this is a must-visit for anyone who loves great food and excellent service in a refined, kosher setting!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZW93ZTJEMGNXWjRnRRAB",
            "text": "Food is great one of a kind"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPamtxcGZxci03S0V3EAE",
            "text": "The best Tomahawk Steak what I ever have in my life!\n\nI can't remember having such a delicious dessert!\n\nThank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMU3lpSjZqNllhWFJREAE",
            "text": "Best food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNeV85ZkNNcHZUcmd3RRAB",
            "text": "Great food, great staff and great vibe! Highly recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMR2E4cm41MjZxVi13RRAB",
            "text": "Amazing service!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VON2k2TEtENkptcnZRRRAB",
            "text": "5 Star! Everything was great. Joe the waiter was very very helpful and accommodating"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYUJvc3lodTRXUFN3EAE",
            "text": "The food was delicious and beautifully plated,  impeccable service, highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZXk3LVB2M28yb25nRRAB",
            "text": "We had a fantastic experience at Art of Prime. The atmosphere was classy but comfortable, making it a great spot for both a special occasion or a nice night out. The service was friendly and professional.\nThe food was excellent — the steaks were cooked exactly to our liking, incredibly tender and flavorful. The appetizers and sides were also delicious and beautifully presented.\n\nWe’ll definitely will be coming back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLcjNrSUxSdzYtQWtBRRAB",
            "text": "This restaurant was amazing. The food was so good. The service was so quick and efficient. Everything about it was amazing. The ribeye steak was unreal, and the banana brownie was the best desert I ever had. The restaurant was quiet and easy to talk. Overall amazing experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJX2Q1X2I5OUotOEx3EAE",
            "text": "Ambiance was elegant.\nMusic was on point.\nFood was delicious.\nService was the best 👌\nWhat a great staff🙌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNS19rS3ktXy1PZGR3EAE",
            "text": "I was absolutely blown away by this experience. The flavors swept me off my feet, the staff were so kind and attentive, everything came out quickly. Every detail of this experience was fantastic. If you love good food, good drinks, and good times; Art of Prime will take you to the next level."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNWDMxdjNycEwtX2hRRRAB",
            "text": "Kudos to David and his beyond amazing staff who made our evening a “night of delight” !  From the moment we entered the elaborate decor of the room, perfect lighting, comfortable seating, a table set for “queens” awaited us. We were given ample time to review the mouthwatering menu with the waiters/waitresses suggesting and patiently explaining what was there. Each dish was presented to tempt the palate. Colorful, exquisite and tasteful with the chefs extra touches of pleasing homemade warm rolls and sauces. David himself came to check several times to be sure that all was as expected. There was no disappointment in any aspect. The addition of a personal selection of desserts to sample was the grand finale of a wonderful experience! Thank you to all the staff!\nSusan Samet"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYkUxWUNJMU5qMUxREAE",
            "text": "Easily the best steak I've ever had.  Ordered the skirt steak with mushrooms, and they didn't disappoint!\n\nI've been coming here since before the updates, and the improvements definitely show.  Glad that Atlas / Art of Prime reopened!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOGJfXzRnRRAB",
            "text": "Amazing food. Great staff. Awesome bartender"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ3V5RFF3EAE",
            "text": "Looking for a new kosher spot in Brooklyn with amazing ambiance? Check out Art of Prime! We had a great time trying out a variety of their dishes. The French onion soup was rich and flavorful, and the Seared Surprise Steak was a delicious surprise. The lamb dumplings were bursting with juice, and the lamb riblets hit the spot. The highlight was the braised beef rib, which was incredibly tender and delicious. While the cauliflower puree it came with wasn't my favorite (personal preference), the beef itself was outstanding. Dessert was also a win, with a light and flavorful pistachio meringue roll and a rich brownie. Our first Lemondrop was the best I've ever had! While the service was a little slow as the staff learns the menu, the manager Joe was fantastic, incredibly helpful and full of great suggestions. Be aware that the portions are large and the prices are on the higher end, but for a memorable and upscale kosher dining experience, Art of Prime is worth a visit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZX0pyak5REAE",
            "text": "I had an amazing dining experience at Art of Prime. The ambience is stunning, and the food is truly top-notch. We started with the lamb ribs and lamb kebab, both cooked to perfection tender, flavorful, and beautifully seasoned.\n\nMy friend ordered the grilled chicken to share, and I was hesitant at first since I normally don't eat chicken. But I was shocked by how tender and tasty it was! I’ll definitely consider ordering chicken next time.\n\nI decided on the hanger steak and asked for it to be precut for sharing. It was cooked just right and, unlike many places, it wasn't over-seasoned or overly salty.\n\nThe wine selection was impressive, and I decided to test the bar with an Old Fashioned, which is usually my go-to drink. I’m happy to say the cocktail passed the test—well-balanced and expertly made!\n\nAll in all, I’m excited to come back and explore more items on the menu. This is one of the few places where I can confidently say I enjoyed everything I tried. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNlBMX2tnRRAB",
            "text": "Tender and perfectly cooked ribeye steak, along with their delicious and fresh branzino. Classy and elegant restaurant. My family loved it! Will definitely be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNktqZ3pBRRAB",
            "text": "From the moment I walked in, I was blown away. The food was absolutely incredible — every dish was beautifully presented and bursting with flavor. The service was just as impressive: attentive, friendly, and professional from start to finish. The environment was warm and inviting, with a perfect balance of comfort and elegance. The design of the space was stunning, creating an atmosphere that elevated the entire dining experience. I highly, highly recommend this restaurant to anyone looking for an unforgettable meal. Truly a five-star experience in every way!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ092ZW5nRRAB",
            "text": "Delicious\nRestaurant with a beautiful ambience"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMThLYTF3RRAB",
            "text": "Every dish came out beautifully plated, reinforcing the restaurant’s commitment to both flavor and form. Service was attentive but never intrusive, with staff well-versed in both the menu and kosher dietary standards. Whether you're kosher-observant or just a lover of great steak, Art of Prime proves you don’t have to compromise on elegance or taste.This is the kind of place you bring someone you want to impress — and where you’ll want to return yourself."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcDcyS1hnEAE",
            "text": "I had a fantastic experience at ART OF PRIME! The food was absolutely delicious—fresh, flavorful, and beautifully presented. The staff was warm, attentive, and made us feel welcome from the moment we walked in. The ambiance was perfect for a relaxed evening out. Highly recommend  I’ll definitely be coming back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNi1TMWlnRRAB",
            "text": "beautiful place with delicious food and drinks"
        },
        {
            "date": "6달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcS1xbVJBEAE",
            "text": "Ужинали с подругой, все превосходно, закуски очень вкусные, но изюминкой ресторана является бармен Alex, человек- душа, огромное спасибо за настроение."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveTRuNHV3RRAB",
            "text": "Not many kosher steakhouses around definitely will be my go to from now on……. Beef Wellington and for dessert pistachio roll!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZzdxMFRnEAE",
            "text": "Art of Prime nails the balance between upscale vibes and true comfort food. The kosher dishes are not just good, they’re seriously impressive. Sweetbread was very unique and flavorful, the hanger steak was cooked perfectly how I wanted. Every bite feels like a warm, familiar hug, but elevated with top-tier ingredients and presentation. The atmosphere is refined without being stuffy, making it the perfect spot whether you’re celebrating something special or just want a really satisfying meal. Highly recommend for anyone looking for kosher dining that feels both luxurious and genuinely comforting."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN2ZYREVBEAE",
            "text": "Had an amazing dinner at Art of Prime. The food was incredible steak cooked perfectly, and every bite was full of flavor. The vibe was classy but still comfortable. Definitely a spot I’ll be coming back to."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN2VtWEp3EAE",
            "text": "If you’re looking for a truly unforgettable dining experience, Art of Prime is a must-visit. From the moment you walk in, the atmosphere is upscale yet welcoming, with a beautifully designed space that feels both modern and cozy. The menu is packed with high-quality, flavorful dishes from their signature prime steaks to creative appetizers and fresh sides, every bite is crafted with care and attention to detail."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcnZyYlBREAE",
            "text": "Love it!!!!  We had an amazing time at Art of prime  The food was absolutely delicious, The service was just as impressive.\nDefinitely we will come back."
        }
    ],
    "reviews_count": 46
}