{
    "name": "Los tres Chiflados",
    "place_id": "ChIJb0s7dEdbwokRHtqhmaTCy2I",
    "grid": "BK14",
    "address": "1046 Flatbush Ave, Brooklyn, NY 11226, USA",
    "rating": 4.4,
    "user_ratings_total": 486,
    "phone_number": "(347) 350-6152",
    "reviews": [
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTlowTktXRUo1VnpSc1Z6UkZSVWwzZURWMk9IYxAB",
            "text": "Muy recomendado 👌yo soy ecuatoriana y la comida estuvo súper buena y la atención muy buena el personal es muy amable …❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRFRIVjFOV2RtVEZsc04xUnBiM0V6WWpWcFIwRRAB",
            "text": "I ordered through Uber Eats and, as always, the steak nachos never disappoint—fresh, flavorful, and served in a generous portion. Today I decided to try the carnitas taco, and it was absolutely delicious—packed with authentic flavor and perfectly seasoned. This place consistently delivers true, authentic Mexican food, and it’s definitely a favorite spot to eat at!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMR0h3c1NobEkzUGlnRRAB",
            "text": "The bestn2as the corn on the cob, taco wasn't the greatest"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLXzdyS0dHbHFiclhnEAE",
            "text": "From Philadelphia here in NY to see a concert, place looked very nice, atmosphere was prefect and food / service were awesome... i would give 6 stars if I could"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc1pxRUtREAE",
            "text": "Great food, good vibes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLXBDVWVnEAE",
            "text": "Great food, awesome service."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbWV5U0VBEAE",
            "text": "Excelente servicio"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eU5PMDdRRRAB",
            "text": "I love the steak nachos, quesadillas and the margaritas."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcmVpdnB3RRAB",
            "text": "So good 🤤 drinks, food, everything…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOTRXaFhREAE",
            "text": "Omg I just love this place, my girl took me and I came 3 times in 1 week"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd012dXJnRRAB",
            "text": "The staff is very friendly. The food is delicious. Had 2 orders of birria. So far the best birria in Brooklyn that I’ve tried"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM3Z2MmdBRRAB",
            "text": "Great food, had the tinga quesadilla, great flavor; mojarra frita, crispy and savory, not too oily or too salty, just perfect; and fried calamari, also very good.\nHope I was around that area more often to eat there again"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbXNPYU5nEAE",
            "text": "Everything was excellent, especially the super crispy fish in my tacos. Their margaritas are sneakily strong. And the staff was friendly and great. Would definitely eat here again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndGNhY013EAE",
            "text": "The food here is delicious and fairly priced. Ideal for a chill night out."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBZzhTelNBEAE",
            "text": "Cheerful stylish restaurant on Flatbush Avenue that delivers a different flavour of Ameeica"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbE9Hbm53RRAB",
            "text": "Great food and great staff"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcnAzeE1BEAE",
            "text": "Fantastic food, affordable, great atmosphere"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeE1XekdBEAE",
            "text": "Me encantó la comida y la atención muy buena y no se olviden d pedir café de olla es delicioso"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcGYzWlF3EAE",
            "text": "The food was delicious and authentic, the plates were large, and the prices were fair. I usually order the cheese mole enchiladas. The Spanish music playing in the background sounded fun and contemporary.\n\nI took away a star because we had to flag down the server and remind them of things we had previously asked for, even though we were the only customers. On the other hand, you can probably leisurely sit and talk for a while after eating, and they will not try to rush you."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2djhpeUx3EAE",
            "text": "Amazing staff and excellent food! Great little local spot, would 100% come again."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2a1BHZjFBRRAB",
            "text": "Delicioso la pasamos increíble ! Auténtica comida mexicana y excelente ambiente ❤️❤️❤️❤️❤️"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDLTZtVFpBEAE",
            "text": "Food is delicious AUTHENTIC Mexican Style"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzODVUR0x3EAE",
            "text": "Nice cozy place great food and service"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzLWR5VEtBEAE",
            "text": "Fish taco was super dry"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOGFiWGtRRRAB",
            "text": "When I first walked in, I along with 2 other ppl were in the front area. No one else was in that space. I ordered a drink & some food. A classic margarita with chicken (soft) tacos w/yellow rice & beans. The tacos were great, the rice was good but the beans needed salt. When I was done, more ppl started to pile in. Literally taking up all the seats in the front. Soon as they came in all the attention went from me to all of them. My server never came back to ask if I needed anything else. I asked a different server if he could make me another drink. He did. Finished that drink & wanted another to go. It took 26 mins for me to order another drink. I had to flag down a server to get it. Another server asked if I wanted my check & never gave it to me. I told another server that I wanted my check which she never gave me. Finally I got up went to the register, ordered my to go drink & paid my bill with a manager. My bill was a little over $60. Had the servers been more attentive, I would have tipped $40. Instead I tipped $0. That’s how bad the service was. Nice 😊 place but the servers have to get it together."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQza1pmWG9nRRAB",
            "text": "HORRIBLE!!!!!!!  I found MULTIPLE long black hairs in my chicken quesadilla. I ordered pretty late and got it delivered via seamless. Worst decision I’ve ever made. this place is absolutely disgusting."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtd3BudDZRRRAB",
            "text": "Love this place. Locals here often and repeatedly for a reason. The staff is friendly and always doing the best they can to make sure you have a nice meal.  I highly recommend the Birria Tacos platter which comes with 2 birria tacos stuffed and a side of beef consommé to dip in. The fish tacos are also excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYZ002WnB3RRAB",
            "text": "In disbelief how long the food took to come out. I believe communication is a form of professionalism. Stalling for time or tell me an hour late that there was a larger party which would delay orders. I could have chosen a different place. Honestly when the food came out. I literally didn't want to even eat the food. Very MID, absolutely horrid. Dry and overcooked like it looks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuczd2Q0N3EAE",
            "text": "I unfortunately did not have the best experience here. Me and my boyfriend got seated and our order was taken like usual, but we ended up waiting around 40 minutes for our food and it seemed like nobody noticed until a while later. I understand it was a tad bit busy because there was an event happening nearby, but 30-40 minutes for food is ridiculous, and we put in our food around when the place started clearing out. I worked at a restaurant and even on the busiest nights we’d get food out by 10-15 min max. We also had to go up to the bar to ask for water because they forgot to bring us water. The food when it finally came was actually pretty good, but I honestly was so frustrated I couldn’t fully enjoy it. Just wish the service was a little more attentive here, but the food is great, just a tad bit overpriced imo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNDVUZXJRRRAB",
            "text": "One of my favorite Mexican spots in the Flatbush area. In my opinion, they are one of THE top spots for anything birria in Brooklyn. Nice atmosphere inside, very homely like.\n\nThat being said, I love you guys, but you’ve gotta get out (and stay out) of “B” status in your restaurant grade! I haven’t been back here in awhile because of that. But when yall are solidly back at an “A”, count me in there like swimwear"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudmVPc01nEAE",
            "text": "I walked in to have dinner with my mother, they greet me and ask me where I would like to sit. I look at the 2 person table and see how small it is so I sit in a 4 person table and they said I can’t sit there. I tell the guy the 2 person table is two small for us because when I eat out I EAT OUT ! I usually order multiple things in the menu and drinks and I like to be comfortable. They gave me an attitude and told me either the 2 person or sit some place in the back. the waiter wanted to leave me at the 4 person but either the manager or somebody said, mind you the place was empty. So I decided to leave and go to another place where I so happily spent $200 plus and tipped the waiter nicely. You should worry more about getting your A inspection and not that B on the window"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaGJHMHFnRRAB",
            "text": "customer service.. not friendly at all, and the food is terrible.. i do not recommend this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIenZhTUZ3EAE",
            "text": "do not order from here. they do not follow directions on your notes. you will be unhappy and upset"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIekxLZ0FnEAE",
            "text": "Went for dinner yesterday and I want to say I was not impressed with anything at the restaurant. Our server paid us no mind even though we were the only table. The food was very bad. My husband had the steak encebollado and I had the adobo. The steak had a weird taste almost spoiled. Plus all the food had no real flavor. drinks were ok. We had been here before but not in a while almost a year I think. Something is different the food was not the same and the new staff is unwelcoming. Make sense why on a Saturday night they were empty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3eFAzZEVnEAE",
            "text": "Hands down best margaritas! 🤞🏽🤞🏽"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eU5yTVFREAE",
            "text": "Muy sabrosa la comida y rápida en servirlas"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbmNYYjB3RRAB",
            "text": "Compre una milanesa estaba horrible todo desbaratado el pan mojado"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6eDVuMzlBRRAB",
            "text": "Good is good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6cmRDdjFnRRAB",
            "text": "lovely, kind, delicious!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodUwta3pnRRAB",
            "text": "$12.50 3 quarters of a full drink 👎🏾 bartender got upset when I asked “12.50 for this”…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMUozWjNnRRAB",
            "text": "I place a delivery order earlier today, and everything came in fine, I order 2 large aguas frescas one horchata and 1 Jamaica, however when I drank the Jamaica I had a weird after taste, I had someone else taste and they told me it taste rotten already and how it even had a weird smell, I’m Mexican and I’m able to tell when things like does go bad because I’ve made Aguas frescas in the pass…and also a big fan of Jamaica. I call the location back to see if maybe I was able to get a new one and they said they would send a new one, it was taking them forever since I finish having my meal and about 2 hours has gone by and I didn’t get anything back…so I call again and the person on the phone couldn’t even make up a proper response, all I manage to understand was sorry is taking long we will send a new one once again…and it comes to the time that I never received a new large agua Fresca, I’m pregnant and I was craving it really bad. Guess what happens to their customers isn’t their concern they just want the money because i know Damm well of the delivery money wasn’t pay or there was any kind of issue with it, they would be blowing up my phone"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeEszdkJBEAE",
            "text": "Good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcnJlOHJ3RRAB",
            "text": "Everything was fine except the bill.. ☹️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbUlDVi1BRRAB",
            "text": "Pretty good. But not as good as Cali or TX Mexican food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREOE1mUE1BEAE",
            "text": "Great place for lunch. Amazing music playing with a super great selection of food - be sure to check out the lunch specials! And don’t forget to get a jarrito! Muchas gracias!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcTRpQWlnRRAB",
            "text": "I stopped in for lunch while I was shopping in the area. This is a cute Mexican restaurant that has a great vibe and terrific food and drinks.  Since they are known for their margaritas, I ordered the pineapple flavored one, and it was really good. I got the Shrimp Fajitas for my entree, and they had great flavor and the right amount of heat. The rice and beans that accompanied the meal were also tasty as well. They have an extensive menu with reasonable prices, and everything came out fast. It's definitely a great spot to stop in while shopping in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdXU2a2NnEAE",
            "text": "Cute little spot conveniently located across from Kings Theatre. It's an okay option for grabbing a meal before a show. The staff is very friendly and attentive. But, the food can be a gamble.  I had fish, shrimp, and al pastor tacos. The fish was super dry. The shrimp tasted overcooked and wasn't flavorful. The al pastor was good. I also added pico on all the tacos and it tasted a little bland as well. The strawberry margarita was delicious. My partner had the stuffed pepper and that was delicious as well. I would recommend the al pastor taco, strawberry margarita, and stuffed peppers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eDRhUGNBEAE",
            "text": "Ordered Burritos and quesadillas for pick up. Food items were created in a timely manner. Chicken was well spiced, fresh and tender. Planning to come back"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndmVxZXNBRRAB",
            "text": "This place is of to a solid start. The food is good and the service was very friendly. I'll definitely come back and try some more items off of their menu. I wish it were either a touch less expensive or that portions on certain menu items…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNFBUcEN3EAE",
            "text": "I really wanted to love this place.\n\nSituated across Flatbush Avenue from the historic King's Theatre, the location can't be beat. It's perfect for a bite before or after a show. The staff are incredibly friendly! The decor is warm and cozy, but not too crowded, and they feature USB outlets along one wall for charging up while you eat. I think this is a very nice touch.\n\nThere were no chips and salsa given to the table. They are instead on the menu as an appetizer. Chips and salsa are a traditional part of dining at a Mexican restaurant and I always look forward to tasting the house's sauce.  It's the first place I've ever been that charges outright. The chips do seem to be made in-house and were light and crispy.\n\nOverall I was a little let down and won't be in a hurry to return, but I'll be back to try other items.\n\nI would recommend giving Los Tres Chiflados a try. The location and friendly staff make it worth a visit."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNzdDZVRREAE",
            "text": "Delicious food, awesome margaritas, and amazing service. This is my new favorite spot and my top choice for Mexican food in the area! 🥰…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURReE9xUFFREAE",
            "text": "Had dinner here before seeing a show at The Kings Theatre. It’s a cute little Mexican restaurant with super friendly and attentive staff. Plus, the food was absolutely delicious! They don’t service alcohol but you can go around to the deli…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZMWZqb3NRRRAB",
            "text": "It was delicious! The tacos are good and the staff is friendly. The tacos are pretty big and filling. You probably only need 2 or 3 as a whole meal."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcHJmVWd3RRAB",
            "text": "Great service with incredible food. My wife and I find ourselves looking for reasons to come back every chance we get. The menu is reliably delicious and everything is good.\n\nI love the double tortillas on the tacos, too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMFppd1JnEAE",
            "text": "I’ll definitely be coming back! Margarita was superb (asked for it not to be too sweet and the bartender made it so perfectly that I had 3). I also had the buffalo wings and they were really good. Looking forward to trying more of the food🤗"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0dUtIakdREAE",
            "text": "Food is Great! Fresh made each time! Staff is very friendly. If someone like Spanish food I really recommend this place! Chorizo Burrito is Best I ever have!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHdXVTSnFnRRAB",
            "text": "This used to be the take out spot for Mexican food we used to order from them all the time. I am not sure what happened, now the food is so bland no taste at all. I ordered chicken fajitas the chicken is white and dry it  has no taste…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHOExDVWZ3EAE",
            "text": "Me and my wife stopped by on our way to see Will Smith at the Kings Theater and the good was just delightful. The chicken was well season and my wife said the mole was the best she ever had."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNROWJ6aktnEAE",
            "text": "The food was good but the service was great. The waiter made good food suggestions and was pleasant to talk too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseS1DLTFnRRAB",
            "text": "The birria burrito is so good! Very well priced food. Fast service. Great spot."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MzdqQW1nRRAB",
            "text": "Love it here this place is right around the corner, their food tastes almost as close as to my mother’s cooking which is huge. The only thing I didn’t like sadly were the chilaquiles since they were on the sweet side,  I’d make them a bit…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMnV2STR3RRAB",
            "text": "Just ordered the empanadas via Uber eats and they were burnt. This is so unacceptable for a restaurant to serve this. If you wouldn’t serve it to customer dining in at the restaurant why serve it to a customer ordering delivery. Delivery…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMS12ai13RRAB",
            "text": "Tasty sangria drinks. Delicious 🤤 meals. Good service. Affordable prices. Perfect location 📍 for dinner before the theater performance."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MTk2bmp3RRAB",
            "text": "The food at Los Très Chiflados  was wonderful. I found staff to be knowledgeable about the about the food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMnZHS0VBEAE",
            "text": "Food was pretty good. Drinks were delicious. Service was just ok. I ordered chicken quesadillas and received shrimp. I would have eaten it regardless since it still tasted good but he was very argumentative on being right about hearing us said shrimp. Would recommend coming by for the margaritas but only if the service was nicer."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwc3VhdnJRRRAB",
            "text": "Ordered here a couple of times and food Is worth it. Authentic and tasty. Well recommended."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTeDc3X1FBEAE",
            "text": "I have placed a Taco Order via Uber Eats at this Restaurant on January 11th and happen to find a 4-inch long plastic strip within one of the Tacos. This is unacceptable! Never again!"
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURneVpmOF9BRRAB",
            "text": "Exelente servicio.\nSe los recomiendo, es un lugar muy agradable... Muy buen sitio para comer con la familia 👨👦👧👩👴👵o con una persona especial 😉…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbDYzTVNnEAE",
            "text": "Great little spot! Came here before a show at the Kings Theater so it was a great location! Margaritas were a solid 10/10 plenty of tequila and flavor! Guacamole and entrees were also amazing. Staff was friendly and prices were super fair. Thanks for the good times!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodHNXby13RRAB",
            "text": "Absolutely the BEST and only sit down restaurant located across the street from Kings Theatre.  The food and margaritas were superb.  Service was outstanding.  Make sure you arrive early if you’re headed to a show. Keep up the hard work guys. You’re doing great! 😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNWNIaU1nEAE",
            "text": "Called in my order for a steak burrito. Got there 30 minutes later. Told me order wasn’t ready. Waited outside for 15 minutes checking in every 5. After the third time guy ask me what order what order was. Comes back said nobody ever put it in.  The incompetence was maddening. Place was maybe half full. Just moved into the neighborhood and will not being going back any time soon"
        }
    ],
    "reviews_count": 71
}