{
    "name": "HOUSE Brooklyn",
    "place_id": "ChIJlWmsggZZwokR2yHyFpFXD1o",
    "grid": "BK1",
    "address": "50 Norman Ave, Brooklyn, NY 11222, USA",
    "rating": 4.8,
    "user_ratings_total": 96,
    "phone_number": "(929) 675-7887",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eGJsQnZNVVJmT1VkeGMydGlkMDV6VGpnMFdtYxAB",
            "text": "An excitingly creative meal with warm service and a great sake pairing!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFd1VsQm9iVE56WlZKM0xYQmZUWGRvUTAxaGVFRRAB",
            "text": "Exquisite experience. The chef cooks right in front of you, serving a series of creative and tasty dishes inspired by Japanese and French cuisine. The food is high-end, but the vibe is relaxed since you sit at the counter."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WT04zaE9iVkZUTkhOQ2MzZEVhbTlhZEVVeE5sRRAB",
            "text": "Excellent all around dining experience that did not disappoint our much awaited anticipation    In a casual and inviting surroundings you are given great innovative food for 9 courses    I enjoyed every course with the standouts for me being the baratta cheese. Eggplant and wagu beef.courses    The service was very personable and the sake list extensive     I enjoyed watching the chef so closely preparing every dish.   The limited dining crowd keeps the quality and casual ambience possible.   They keep the menu different each season so you can repeat the experience.  My only wish is they would have a lunch or other meals with fewer courses as a secondary option so you could enjoy this food more frequently."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdVozZDBiMHBTVGswd1pFOHRlVWN4Tms5Sk0yYxAB",
            "text": "I had been wanting to try HOUSE for a while now, being a regular shopper at Dashi Okume. However, had been wary of fine dining experiences in Greenpoint after trying 2 so-so places that privileged novelty over flavor. Well let me tell you, HOUSE did not disappoint.\n\nPicture this. You arrive in a quiet street in Greenpoint, with the typical warehouse-y yet clean, modern and minimalist vibe. You see the interior through giant bay windows of a dimly lit store with Japanese products and ceramics. You see people waiting inside and other patrons dining at the café. By then the store is closed, so you ring the intercom  to get in. You wait to be called to the HOUSE, in the back of the store. It feels like you are at your friend's house, and your friend is a sophisticated person with a beautiful house and he cooks for you. The atmosphere is quiet but elevated. There are 10 seats. And you are hosted by 4-5 people. It feels luxurious. You may start the dinner as perfect strangers, but you certainly make friends along the experience.\n\nAnd the food is incredible. Your friend is an amazing cook. From start to finish, the story is coherent, with subtle development and transitions that never miss a beat or take you somewhere uncomfortable. Flavors are predominantly Japanese forward with some international ingredients and techniques. Noting for example the Monaka filled with ricotta and corn or the french tuile on top of a burrata with berries, reminiscent of Scandinavian flavors.\n\nThe highlight of the menu for me was the noodles. With a fragrant Dashi and rich egg noodles covered in egg yolk and fish roe, the final dish on the meal is an unmistakably Japanese grand finale, with an explosion of flavors.\n\nFantastic experience. Thank you team."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVWExbFdRemQxYzFCRWNXaDBWM05ETVhVd1dYYxAB",
            "text": "Beautiful space. Lovely intimate dining experience. We snagged a last minute reservation and were blown away. Every dish was meticulously prepared. Each bite highlighting a perfect blend of French technique with Japanese flavors. The craft sake pairing was phenomenal and must be experienced.\n\nThe hostess was knowledgeable and welcoming - made us felt absolutely at home, which is their philosophy. You truly felt as if you’re at a friend’s home, albeit a friend who is an incredible chef.\n\nThank you HOUSE brooklyn for such a special evening. Loved every minute of it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVVltSnhha1ZoV21WNFgxZHpSVjkzVldkcU9IYxAB",
            "text": "HOUSE Brooklyn is a refined French Japanese restaurant that blends French technique with Japanese precision. Led by Chef Yuji Tani, he has experience at a French restaurant and as an executive chef in Tokyo. Chef Tani opened HOUSE Tokyo in 2007 and now has brought his passion to Brooklyn. His Kyoto-focused French cuisine is accomplished through preserving ingredients through fermentation and dashi with layers of flavors with herbs and spices. By merging these two traditions, it is an unparalleled culinary experience you can truly taste and admire. His seasonal tasting menu progresses from delicate seafood and seasonal vegetables to wagyu enriched with French sauces then finishing with desserts. Service is warm, knowledgeable, and genuinely attentive enhancing the meal without feeling intrusive. HOUSE Brooklyn offers a distinctive and memorable dining experience that celebrates both innovation and tradition."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSc1prTXRUSGwxUjBaV0xVcG9lR2hFUVhScExWRRAB",
            "text": "I have dined at House a few times now. Every time I eat here, I truly feel at home. The experience consists of impeccable food and a well-thought seasonal menu without the sense of distance in a fine dining restaurant. It is no doubt one of my favorite restaurants in NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNmRHZFhZMDR4VDJKYWFIbFNTR1ptU201TlZYYxAB",
            "text": "Truly beyond a 5 star experience. This is a treasure in Brooklyn and a unique and intimate experience. The chef Yuji Tani pours his heart into the design of each of his dishes. You have the opportunity to experience a true artist at work with his team and enjoy the decadently delicious meals one after the other. This will make the night for any special occasion or for a unique cuisine experience with Japanese fusion at its best."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUFpreG9SVjl6ZFVWc1FucGZWV0YzVGxacE0yYxAB",
            "text": "The food was great and the seasonality really came through. The staff were very friendly and knowledgeable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMU5ucEVibVpxVTFSWlpFUnVVMlp2VWxsa1pXYxAB",
            "text": "⸻\n\nIt’s not easy to surprise a New Yorker, especially one who lives for discovering new food experiences. But this place… this place completely redefined my idea of a “hidden gem.” From the moment you walk in, the space feels unique, beautiful, and impeccably clean, with a warm, inviting atmosphere that instantly puts you at ease.\n\nThe chef isn’t just talented — he’s genuinely hospitable, approachable, and clearly passionate about what he creates. The staff mirrors that energy: attentive without being intrusive, and truly friendly.\n\nEvery dish is a masterpiece — not just in presentation, but in flavor. Some combinations are comfortingly familiar, others intriguingly unexpected, yet each one leaves a lasting impression. It’s the kind of food you find yourself thinking about long after the last bite.\n\nThis is a place you rave about, a place you bring your friends and family to so they can share in the discovery. An unforgettable experience from start to finish. I can’t wait to come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReU56azJSV3RUTjFWRVlrSjBPRFJMWDBkWlVGRRAB",
            "text": "I had the absolute pleasure of experiencing the tasting menu at House Bk. From start to finish, all the dishes were thoughtfully crafted and beautifully presented. Chef Yuji is a mastermind of his craft. Keiko and the team were also exceptional, very knowledge and welcoming. Can’t wait to come back to enjoy another meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNmVraE9WbXA2Um5sU1UxZ3RZemRIY0ZGc01sRRAB",
            "text": "Exceptional - one of the best tasting menu’s and chef’s table experiences that we’ve had in New York City. The passion for crafting peak culinary human experience is evident in everything from the rotating menu, to the patient preparation with local and Japanese imported ingredients, the presentation of each dish, and the contemporary yet humble and homely ambiance of the kitchen. Everything incredibly aesthetic - creative, new, but somehow not pretentious in the slightest. It has earned a place amongst some of my other favorite restaurants in the world: Jungsik, Providence, Trescha, and others. On par with 2 Michelin Star dining experiences, this hidden gem on the cusp of Greenpoint and Williamsburg is absolutely worth a try."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OYWRXUkpTako2TVRFemMwczNNM2N6ZFRSUk5IYxAB",
            "text": "one of our best meals in nyc. the dishes were a perfect, playful but honest balance between brightness and the warm, full bodied feeling of a cozy home. the meal was full of inventive, delightful surprises that were also unpretentious at the same time. chef yuji and the team are very warm and welcoming. well worth a trip to greenpoint. we'll be back soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVGVFOW1NblV0UWxkWWFHa3llbU5DZVdGalJWRRAB",
            "text": "Incredible experience!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RGVWZzFWelZXYkRWUlRFZFFaa1prWjNsYWJIYxAB",
            "text": "Criminally underrated, better than most 2 star places in NYC"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWFRsaHpNbFJKVDJ4VFRuRldaVmxRYzFwT1MxRRAB",
            "text": "Thoughtfully curated tasting menu by chef Yuji Tani and warm, welcoming staff. Outstanding service and food. Will come back when they expand the wine menu"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQbUk5SkNHckwzQVFREAE",
            "text": "A lovely experience, we were a larger group so we were seated in a private room in the back - they have a great selection of sake and offer a sake pairing. The service was amazing and my favorite was the squab. Their menu is differently not for everyone and that goes with the price point. But a lovely meal nevertheless."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZmx0SkxpN3JxT0tREAE",
            "text": "Came here with a group for a birthday. Everything is a set menu, which is really nice. The place is set up where everyone faces the kitchen so you can see the whole process, which I enjoyed. The space itself is very beautiful, and it was nice to see it finally after many months of renovation.\n\nThe food itself was amazing. They started off letting us drink some kelp dashi, which was light but flavorful. Then we had a matcha crepe that had a nice chewy texture. We had marinated sakura trout monaka, which was in a nice cracker. This really reminded me of a cream cheese with salmon, and the cracker shape really held everything together and stopped it from falling apart. We had white asparagus with a delicious sauce, an oyster cream croquette, red sea bream and green beans. The wagyu beef was good but seemed like a tougher cut. The final dish before dessert was a foie gras pilaf, which was very rich. I also liked the presentation that they had in showing you the big pot before serving. Dessert was a souffle cheesecake and you could choose a drink with it.\n\nService was impeccable, as with any fine dining restaurant, definitely recommend coming here."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnX1o2a21RRRAB",
            "text": "Really fun experience with all the prep done in front of you. Comfortable, like at home. Amazing food and presentation and the staff did a great job explaining what was going on in the dishes."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNnFESGl3RRAB",
            "text": "Loved the food—everything was delicious and well-prepared! However, the portions felt a bit small for the price. I left feeling like I could still fit in another full course haha :)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmZ05heUNREAE",
            "text": "House Brooklyn was a reminder of the joy of an intimate, warm, and playful tasting menu. I love observing craftsmanship and flow state up close. Sitting at the counter seats in front of the oversized kitchen island felt like how I’d imagine sitting courtside at an NBA game feels.\n\nMy favorite bite of 2024 was the second appetizer course: Yellowtail Tartare & Peach Sorbet\n\nMost of the time I’m skeptical of caviar because it feels like insensible luxury; a kind of edible glitter often used to “elevate” a dish to nowhere. But this was delightful - a play on a monaka, a rice cracker filled with yellowtail tartare topped with caviar and a quenelle of cold peach sorbet. I took my picture quickly, carefully placed the top of the cracker on to form a sandwich, and held it with the same joy a middle schooler on a field trip holds a no crust sandwich triangle.\n\nI appreciated how Chef Yuji brings a level of creativity and interaction with the food without sacrificing substance and taste. Yes, the monaka was fun to hold, but it also tasted good. Peach sorbet with yellowtail and minced shallot and kale? Amazing. A later course of a red sea bream spring roll had a dollop of what looked like caviar on top - our server smiled and explained that it was “squid ink mustard masquerading as caviar”.\n\nThe last main course was a Foie Gras Pilaf. Chef Yuji presented a beautiful donabe with the pilaf, just like how sushi chefs present fish before an omakase. I snapped a quick picture, and then he spooned the pilaf into rice bowls, family style. It was served along with a wooden cup of fragrant miso soup, a balm for the soul. I felt like I was at home."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NnFXNTV3RRAB",
            "text": "Amazing tasting menu!! Loved every single dish. The service was also amazing. Can’t wait to go back and try the winter menu."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Mk1LV1RBEAE",
            "text": "Had to cancel a reservation and called 36 hours in advance instead of 48 and was told I’d be charged $180/person. After telling me there were no exceptions to the cancellation fee, the restaurant then texted me multiple times asking me to cancel the reservation on Resy, even after I told them I was trying to find someone to take it so that they could have diners and I wouldn’t be charged. They did offer a $224 credit if I dine in the next ~30 days, but it has been a pretty poor experience and I’m not eager to give it a try"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MktTNGt3RRAB",
            "text": "I transparently haven't been - but we had a reservation and accidentally made the wrong day, we tried to call and cancel as soon as realizing, which was 36 hours in advance (outside of the 48 hour policy).  I totally get needing to charge, but charging $360 for a mistake + trying to cancel (and giving 36 instead of 48 hours), seems a bit excessive.  We did try to call and explain the situation - they were nice enough, but were unwilling to be flexible (other than to offer a credit).\n\nI guess we'll probably end up going now that we have the credit and hopefully the experience is great, but this just left a bad taste in the mouth - I've never seen a restaurant be this unaccommodating."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcE11R0tBEAE",
            "text": "Such an amazing place to celebrate an occasion! It was personal, intimate and overall such an excellent experience! Everything was very delicious. I definitely recommend!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM2RXSnV3RRAB",
            "text": "Unbelievable that this place doesn’t have a Michelin star. I think it might even deserve two.\n\nService was excellent. We talked to the FOH quite a bit, and they knew so much about what they were serving and they genuinely seemed to love what they were doing (or they were good at faking it). The location is a bit strange, at the back of a shop. We weren’t sure where to go exactly when we showed up a few minutes early. Then 6:00pm on the dot, they slid over a wall, and there was the counter seating. Just enough seating for eight people, very intimate.\n\nHere's what I had:\n\nCharred Manganji Pepper Crudités (manganji pepper, tofu, chickweed, capers, cornichon, anchovies, olive, walnuts, scallion oil): personally, I’m not a fan of peppers across the board for whatever reason. I just don’t taste anything. This is very much me, not them. But the rest of the dish was delicious and the plating was gorgeous, possibly the best of the night in that regard.\n\nYellowtail Tartare & Peach Sorbet (yellowtail, caviar, peach, shallot, kale, rice cracker, monaka): I will be thinking about this one for a while. Salty, sweet, the perfect amount of confrontation of my expectations. Reminded me of the Caviar Kim at Jua but three times better (not to denigrate Jua overall; I love that place).\n\nStuffed Squid & Cherry Tomatoes (small squid, cherry tomatoes, couscous, red onion, paprika, harissa, coriander, starflower): I remember thinking this was solid in execution, but I don’t recall many details a few days later.\n\nMozzarella Burrata & Strawberry (burrata, strawberry tuile, pomegranate, blackcurrant sauce), pictured: this felt more like a dessert course, but given the actual dessert course was also cheese and fruit, it makes sense that they wouldn’t want to sequence them next to each other. If they wanted to lower the price of the menu a little bit, it would make sense to drop this dish, but maybe I’d protest. I loved it.\n\nGrilled Eggplant with White Miso Hollandaise (eggplant, bottarga, white miso, bonito stock, pistachio, ginger): probably the least memorable of the night for me since it’s pretty similar to something I had at Dirt Candy recently. My dining companion loved it though.\n\nRed Sea Bream Spring Roll with White Leek Sauce (red sea bream, white leek, spring onion, hijiki, golden mustard): didn’t reinvent the wheel, but certainly the most perfectly constructed spring roll I’ve had in my life. Packed with perfectly cooked red sea bream, it’s not the kind of spring roll you just pop in your mouth.\n\nGrilled Shou Koji Venison with Mushrooms & Truffles (venison, burdock, truffle, chili pepper, mushroom, truffle, chrysanthemum, soy sauce koji, beef stock): the venison was so tender, it was hard to believe.\n\nEel Pilaf (eel, eel stock, bonito stock, japanese pepper): what a wonderful way to end the savory courses. Just fills you up with warmth. I’ve read that previously they used foie gras, but I wouldn’t replace the eel with anything.\n\nBlue Cheese Terrine & Apple Compote (gorgonzola, cream cheese, fresh cream, apple, cinnamon, olive oil): maybe I’m uncultured, but how is this blue cheese? Where’s the blue? Just completely smooth and sweet, pitch perfect way to end the meal. By the end, the dishes were exactly calculated for my stomach. I ate 100% of every course, and while I had no desire for any other food that night, I could still walk home.\n\nEasily one of the best meals I've had in NYC."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzXzRESEtnEAE",
            "text": "Best meal I had in Brooklyn!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcmNQM2FnEAE",
            "text": "Second time here. Thank you chef @yujitani for a lovely meal. The yellow fin tuna tartar with peach sorbet was original, innovative, creative, and just mind-blowing. The eel pilaf was mind-blowing. Just all-around excellent. Japanese minimalist decor. Hidden gem behind a retail Japanese goods store. (If they changed the utensils after every single course, they probably would have gotten a Michelin Star by now.)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYZ2ZyTUZREAE",
            "text": "Great fine dining experience with a touch of home cooked food taste. I was looking for some French Japanese cuisine, and House showed up as one of the top results.\nI really liked the eel rice, dashi and the caviar tartare sandwich. Not a big fan of the venison dish. Though I heard the menu changes seasonly and it’s a secret until you get to the restaurant.\nThe dining space is very limited and they would serve everyone all together, so make sure you are late."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIanZfTXhRRRAB",
            "text": "Hervorragend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeXJDdmFREAE",
            "text": "Perfectly executed food with fantastic service in a dreamy setting! A wonderful addition to not only the neighborhood but to NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybjZyakJBEAE",
            "text": "The dinner, with its wide range of dishes and flavors, was great. My friend and I were there for a summer menu and much of the offerings had a Mediterranean influence - a pleasant surprise. The staff was very hospitable and the decor and Japanese chef's-table/counter seating arrangement were well executed.  When I return to the City with my spouse, I will certainly try to make reservations 🤞."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaWFmYW5RRRAB",
            "text": "For my partner’s birthday, I set out to find the perfect omakase experience in NYC. After extensive research, House emerged as the ideal choice, blending Japanese and French cuisine with a pre-fixed tasting menu curated by Chef Yuji Tani.\n\nThe dining area at House is wonderfully intimate, accentuated by a long sliding door that separates the space from the outside world, creating a private and serene atmosphere. The flora spaced all throughout the table and kitchen gave it a very earthy feel, enhancing the sense of warmth and comfort. The host was exceptionally friendly and knowledgeable, explaining that the name \"House\" reflects their mission to make guests feel as if they are dining with friends. This philosophy extends to their approach to the tasting menu, which aims to be accessible and welcoming, eschewing the high costs and strict dress codes typical of many omakase and pre-fixed menu restaurants.\n\nThe menu at House is kept secret, revealed only upon arrival and changing with each season. This element of surprise adds to the excitement and exclusivity of the dining experience. Our evening began with appetizers, mains and then dessert. Each of which were visually stunning as they were delicious. The portion sizes were generous, leaving us satisfied and content by the end of the meal.\n\nThe dishes beautifully showcased a fusion of traditional French techniques and Japanese flavors. Each course was a testament to Chef Yuji Tani’s skill and creativity, seamlessly blending the two culinary traditions.\n\nMy partner and I were completely encapsulated during our tasting, and we eagerly look forward to returning to experience another season’s menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6djYyZUNnEAE",
            "text": "Another hidden treasure in Brooklyn. As we all know, Japanese cuisine is more than ramen and sushi. I enjoyed it a lot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUeTVybVJREAE",
            "text": "One of the better chef’s tables you’ll ever experience in NYC. Every dish was thoughtful and supremely delicious. Space is intimate but warm. Chef is a genius and his entire staff were top notch. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMDlXazl3RRAB",
            "text": "Amazing in all senses. Several Michelin stars should come soon. Best grouper and dessert tasted in years. Fantastic services and set up"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREM3R1d3JRRRAB",
            "text": "I'm a huge fan of Greenpoint and specific to this section of the the hugely popular area with up and coming dining and events. House is located in the back of a dashi store which has all kinds of Japanese bowls, textiles for sale. The experience was nice, the seating felt you were in a very intimate environment, seats facing the chef and kitchen at all times. The service was top notch and what I expected for a 2 course menu north of $400. The food, we had the 2 course menu, a sake flight, a sake flight B, a Kirinzan glass, a Nanbu glass and a Hakkaisan glass. The dishes had an amazing presentation and were tasty but honestly the flavors did not move me. Perhaps it might be a style where the flavors are really flat and balanced which I can understand but I was not overly impressed or blown away by any 1 dish. All in all, great service and great experience which still is within what I feel a 4 star rating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5ckxTSG9nRRAB",
            "text": "Great dinner, warm environment and a lovely team. Hope to be back to try the changing menus"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkamE2LTlRRRAB",
            "text": "Wonderful experience, amazing food and stellar service and people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNG9YZEhREAE",
            "text": "Delicious and unique dishes! Unpretentious environment but still felt elevated at the same time. Great service from the kitchen and staff!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMVoybmt3RRAB",
            "text": "Food was amazing! Service was great! I even enjoy all the pottery, flower arrangement etc"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdlA2WU93EAE",
            "text": "Warning Alert: the suggested tip is based on after-tax total amount, which is generally red flagging, especially for a fine-dining restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkLU1DZEdnEAE",
            "text": "The rice, baked in a black-enamel cast iron casserole with a whole or nearly whole lobe of foie gras, never leaves the menu. It’s impressive to look at — almost everybody takes a photo — and to eat. It’s mashed and stirred extensively before it’s served, leaving the foie gras in small, nearly invisible bits. You taste their memory."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0bl9qOEZBEAE",
            "text": "My recent visit to HOUSE BROOKLYN left much to be desired, primarily due to the unprofessional behavior of the host and the lack of flexibility in their service.\n\nFrom the moment my party and I arrived, we were met with hostility from the host, who seemed annoyed by our desire to take pictures. Instead of politely addressing the issue, she curtly informed us that photography was not allowed until the end of the meal, displaying a lack of hospitality.\n\nAs the dinner progressed, the host’s behavior only worsened. When it came time to select utensils, she displayed a shocking disregard for basic courtesy, leaving my friends and me to awkwardly vie for the shared plate of knives without clear direction. Her failure to evenly distribute the utensils among us was both frustrating and disrespectful.\n\nFurthermore, the host’s insistence on dictating how we should eat, such as instructing us to place our spoons beside our rice bowls instead of inside them, was patronizing and unnecessary. As paying customers, we expect to be treated with respect and autonomy, not condescension.\n\nOverall, while the food at may be enjoyable, the dismal service and discourteous demeanor of the host overshadow any positive aspects of the dining experience. Until improvements are made in terms of customer service and hospitality, I cannot recommend this establishment to others."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0Mk92RDVnRRAB",
            "text": "This place was only just OK, especially for the price. We only really liked 3 of the 8 dishes, and the service was a bit off as well. We felt rushed the whole time. Spend your money elsewhere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWaUx1NmtBRRAB",
            "text": "Amazing dining experience. Casual but elevated. Dripping with style. 10/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacTRxMTZRRRAB",
            "text": "Amazing - must go spot"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacmNQTXR3RRAB",
            "text": "Thank you again to Chef Yuji, Kiara (?sp), and the team for such an incredible meal, warm hospitality, and a fun evening. Can't wait to come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaN28yMzZRRRAB",
            "text": "Food and service were both top notch. Nodoguro and bonito were both outstanding but everything on the menu was creative and delicious. Definitely get a res"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadTZXU2t3RRAB",
            "text": "food great, service great, vibe great! the appetizers were probably the most stand-out in taste/uniqueness imo but there wasnt a single thing on the menu i wouldn't happily eat again. the front of house hostess is insanely good at explaining all the dishes and so cheerful/likeable-- regrettably didn't get her name but my friend and i loved her attentiveness! if you're in two minds about going, just book and go; you'll have a great experience."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c3NyVDhRRRAB",
            "text": "Beautiful artistry in decadent culinary creations! Chef Yuji and his team deliver a spectacular meal combining Japanese/French cooking in an intimate setting- all thoughtfully conceived and perfectly executed. We enjoyed their sake and wine suggestions from their carefully procured beverage list as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSMGFlQXZ3RRAB",
            "text": "HOUSE BK owned by Chef Yuji has been trendy recently and we finally got a table for my roommate’s birthday.\n\nChef Yuji mentioned the new menu just came out this week and there were a snack, 4 appetizers, 3 main dishes and dessert. It’s overall an impressive dining experience.\n\nAmong 9 courses, my favorite was the Broiled Barracuda & Fresh Chickpeas. The fish was cooked perfectly and flavorful with delicate texture. My roommate loves the Mozzarella Burrata & Crunchy Strawberry Net. It was between creamy and refreshing, soft and crunchy.\n\nChef Yuji’s signature dish Foie Gras & Shibazuke Pilaf is the most memorable tonight. He doesn’t like Foie Gras so he tried to infuse it with elements he likes to create a new balance. The outcome was extremely rich, delicious, which tastes like risotto and definitely worth the frame.\n\nThe dessert wasn’t our type but we still enjoyed the entire night. We definitely will visit again if we can get a table."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbDR6M0VBEAE",
            "text": "Great food in a fun setting. Best dish was probably a three way tie between the bonito, the grouper, and the pilaf."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNmVTZVVnEAE",
            "text": "Everything was perfect! Amazing flavors and combinations. Great sake pairing too. So happy to have a restaurant like House in greenpoint."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcHFQZXl3RRAB",
            "text": "A truly special experience. The best of Japanese and French cooking. The signature foie gras rice was to die for. The best service and hospitality as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dTZUd0R3EAE",
            "text": "Amazing dining experience! Creative concepts, top notch ingredients and attentive service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSLXVDTUNBEAE",
            "text": "A fun dining experience, interesting and tasty food, fun conversation too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNCelBvNxAB",
            "text": "The setting and the food were very elegant. Highlights for me were the burrata and amberjack dishes, as well as the cheesecake. It was a treat to experience Japanese flavors presented in a different way. Overall, we had a great time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dnR6ZFpnEAE",
            "text": "Amazingly good… very unique and subtle combination of Japanese and French style. Liked the radish noodle, burrata with strawberry and pomegranate seeds, wagyu with edamame sauce(how wonderfully paired), and the rice pot mixed with Foie gras and Kyoto pickles. The team is also welcoming. Will def come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweWZ6ZllBEAE",
            "text": "What a very inventive place Japanese Omakase French cooking"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadGR5bVBnEAE",
            "text": "Spectacular!!!!  The commute from manhattan… not so much"
        }
    ],
    "reviews_count": 61
}