{
    "name": "Fulgurances",
    "place_id": "ChIJcelSUXlZwokRkD8zyKGV6k4",
    "grid": "BK1",
    "address": "132 Franklin St, Brooklyn, NY 11222, USA",
    "rating": 4.5,
    "user_ratings_total": 200,
    "phone_number": "(347) 223-4106",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTFRtMXFkV3RvWm1jNE0xTmliVUptWDJOaFFtYxAB",
            "text": "We enjoyed the meal. Very good food and good service. We frequently go to the New York Fulgurances Laundromat location as we live in NY and enjoy this greatly. Pierre Buffet at the New York location is a wonderful host.…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aFJYbHdVVmd0ZEZSbVpITTVNRkJxVjI5b1EwRRAB",
            "text": "An interesting concept with rotating chefs. Food was good but it took over 2 hours to get the whole meal, which made the wait between each dish pretty long. They add the service and its labeled as it going to the staff. If that's the case, tax should not be calculated over the service amount but it is. Unless the restaurant is also taking a portion of the tips, then it is taxable. Overall good experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RlNrWlhiV1ZwYlUxUFlsOVFlVEJDT0cxWFMxRRAB",
            "text": "Went to see Lana and it was amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213M1FtNWlUVlZIY0dOdFVsWjBVbk5uTVVOSlFrRRAB",
            "text": "This is the coolest place. There is a new resident chef every few weeks. This my second time here with a Top Chef contestant.  Its a delightful surprise to see what you'll get. And you get to try dishes they actually served the judges on the show."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BM1JEVTFkV3cxTTFSNlJGcHNXbUY1Ylc5blRIYxAB",
            "text": "We came when chef Mathieu Rostaing was here for the week. His food is indeed unique and exciting. My favorite was the clam with confit pepper in tomato water and halibut in butter and oyster sauce. And the sauce under the peach sorbet, it has star anise and coffee grinds, it was amazing.\n\nMy husband had the beverage pairing, which was only $78. At first I had doubt because the price is too good but it ended up as such a pleasant experience. I’m pregnant so all I could do was sniff the aroma of each drink. It was overall 10/10!\n\nWe love the concept too, can wait to try more chef’s cuisine. I’ll make sure to always book chef’s counter too!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WME4xZzJlV2RVVEZsWWQxOTRUbkYzWkZOa2MzYxAB",
            "text": "I've been here a few times. The food is always excellent. The changing chefs/menus keeps things very interesting. Service is great. Such a cool, low key place where the food is the focus."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKSHg0YWk2c01mUk9REAE",
            "text": "With two kids under the age of 5, my husband and I don't get out very much. So we decided to gift ourselves a nice night out and decided to check out the 8 course tasting menu at Fulgurances. Rasika Venkatesa' food was so delicious and she was such a friendly chef, coming around and speaking with us. We loved it so much that we treated our moms for mother's day/70th birthday. They were lucky enough to have Oliver M George's tasting menu on the first day of his residency. They were blown away too. The hidden stars of this place, of course, are the cooks and staff who learn all these new and different cuisines every few months and provide outstanding service. Our hats off to them. We can't recommend this place enough. What better place to go to when you have precious little time, but the place that constantly changes!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPNno4STN1MlBUcjdnRRAB",
            "text": "We went last weekend with Nate as the chef for my husband’s low key bday with a friend and the meal was really great and fun. Honestly I’ve done a lot of tasting menus and had sort of grown weary of the pretense that tends to accompany the experience so found this dinner refreshing. While the food and drink pairings were delicious and interesting, it wasn’t pretentious. We laughed with our servers and felt comfortable asking questions. All and all definitely recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN1AzaXpnRRAB",
            "text": "Excellent space with lovely and attentive staff. Truly exceptional meal with Scott and Maria. Special place with a special concept."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvamQ2MEN3EAE",
            "text": "Fulgurances is one of the most original and honest restaurant concepts in NYC. It exists to give chefs without their own platform the opportunity to tell their story through food, and it’s perfect for anyone with an open mind, up for adventure, and willing to listen. (My parents wouldn’t get it, and neither does anyone who leaves a one-star review.) No matter who the resident or pop-up/guest chef is, the Fulgurances team always delivers, and last night was no exception.\n\nI have no idea how the chef duo of Scott and Maria dreamt up their culinary creations, but each dish was wildly delicious, super unique, and obviously personal. Same goes for the beverage pairings…they were all over the place, but each one was dialed in. (The Vietnamese yellow rice wine was a revelation.) Only way to fully appreciate what I’m talking about would be to experience the exact same dinner for yourself. That’s the beauty of story-telling through cooking.\n\nCan’t thank Fulgurances enough for such a fun dinner and for giving chefs an opportunity to share their story through food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcnViRkt3EAE",
            "text": "Always a lovely time 😘. Went last night with a friend, the collaboration dinner was completely insane in the best possible way! The creativity of both chefs and their culinary perspectives made the experience truly unique! Everything we ate and drank was thought provoking, really interesting and a delicious bite. Would not recommend if you’re not experimental with your culinary experiences. I would 1000% recommend if you’re, an ambitious and creative eater! Great job chefs Maria Barriga and Scott Murry 💚💚💚"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvanNfSTJnRRAB",
            "text": "This was the worst meal of my life. It ruined a birthday dinner. Over $500 later and we left early because it was horrific. Congealed mussels, a pork rind with a piece of bacon- disgusting drinks, it was awful. I can’t believe I spent money on that meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNzduc1RBEAE",
            "text": "This place is not worth it.  Feels like a tourist trap. Food is not good and poor service. Been here several times hoping it will improve and it is consistently poor. Pretty sure some of these rave reviews are fake."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cjVUWVdBEAE",
            "text": "Fantastic dinner - thank you chef Nate! We loved trying a tasting menu in a more casual and quaint setting. Every dish was perfectly balanced and delicious. We will be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbTliR2FBEAE",
            "text": "Really awesome Greenpoint concept! We went for the first time and sat at the chef's counter. Chef Nate was the resident chef at the time, and WOW, such an inventive menu. Reminded me a bit of Scandinavian influenced fine dining, where fresh vegetables / herbs and fresh cooked fish with accented sauces are the highlights. One of the first dishes we had was a salad with herb ice cream and yogurt - I would eat it every day if I could for my \"healthy\" fix! I'm not typically a fan of cooked fish, but I was so impressed with the tenderness of the fish (the tilefish in a creamy butter sauce). We got the extended menu so we could try the sweetbreads, which was delicious. I love that the food we ate is the best iteration in any given present moment because they work to improve it every day.\nLooking forward to more experiences there, and to see what's next for Chef Nate!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdm9xTEZBEAE",
            "text": "Just had our first dining experience here during chef Rasika Venkatesa’s residency and it was nothing short of phenomenal. Complex flavors, fresh ingredients, and maybe the best wine pairings I’ve ever had? in a warm, intimate setting.\nWe can’t wait to come back every season!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneGJfazVRRRAB",
            "text": "This was one of the best dining experiences I’ve had in a while. Chef Rasika delivered amazing South Indian food.\nAs an Indian, it is rare now to find distinctive good Indian dishes. The food here was unique and absolutely fantastic. The atmosphere and service matched the stellar food.\nWhile this is chef Rasika’s last week, if you see this review before it ends, don’t walk, run! Highly recommend this!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOWJ6YW53RRAB",
            "text": "Fantastic. It was my second time being at Fulgurances and it was incredible. The food and service were amazing! Can’t wait to come back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBeGVlVl9nRRAB",
            "text": "10/10 unreal meal!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MmRQeE9BEAE",
            "text": "This is our fourth time here. Fantastic team capable of accommodating any / all chefs in residence. This time the chef is Rasika and she crushed it. without a doubt the best Indian food you can possibly get in NY. Her residency ends late Feb 2025 so get on it before it's too late. Regardless of Chef, this is a fantastic restaurant for tastings. Wine pairings never disappoint and it's a fab date night. My wife gets mad at me for taking photos of an empty bowl but for me, that says it all. We literally licked our plates clean, the food is that good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQd3RIWlRREAE",
            "text": "Had an epic tasting by Chef Radika Venkatesa. Outstanding. Great staff, cozy environment, fine dining. Love it."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQdE82WHVRRRAB",
            "text": "We recently had the pleasure of enjoying one of the most vibrant, special, and beautiful meals at Fulgrances Laundromat, thanks to their incredibly talented resident chef, Rasika Venkatesa. Fulgrances is a truly unique concept—a cozy, intimate spot that features gifted resident chefs for a few months at a time. Each chef presents a carefully curated tasting menu at a reasonable price, and you can elevate your experience even further with a wine pairing that is also thoughtfully priced.\n\nLet me start with the wine pairings because they deserve their own standing ovation. I’ve been fortunate to experience a lot of great food and wine in my life, but this was on a whole other level. The wine pairings were special, surprising, and perfectly harmonious with each dish. They didn’t just complement the food—they enhanced it, letting each flavor shine. One standout was a peppery red wine with rose notes that I cannot stop thinking about. I’ve been replaying it in my mind ever since and am determined to find it again.\n\nNow onto the food, which was nothing short of divine. Chef Rasika’s tasting menu exceeded all my expectations, beautifully blending Indian flavors with refined, elevated techniques. We opted for the extended tasting menu with the supplemental chutney starter, and every single bite was exquisite. The courses included chana dal with persimmon chutney; scallop, bottle gourd, and Asian pear; idly with beetroot, pomegranate, and ruby grapefruit; ash gourd, ginger, black-eyed pea, and coconut stew; confit duck meatball with “mochi”; smoked duck “curry” with sweet potato, lavender, and pesarattu; rooahfza ice; and badam halwa tart with sunchoke and cardamom. These dishes were a masterclass in flavor, texture, and execution. Each course was a testament to Chef Rasika’s ability to showcase Indian cuisine in an elevated and inventive way while still delivering the bold, nostalgic flavors that brought me back to my childhood.\n\nThe highlight of the evening was the chance to meet Chef Rasika herself. She was kind, humble, and personable, and her passion for her craft shone through in every dish. Her residency at Fulgrances lasts for three months, and as the menu evolves, we are already planning our return visit to see what she creates next. Beyond that, we are incredibly excited to visit Mythily, Chef Rasika’s own restaurant, which promises to be a stunning ode to Indian culture presented in a new and innovative light.\n\nFulgrances Laundromat delivered a dining experience that went beyond just food—it was a celebration of flavor, creativity, and hospitality. The meal was a perfect 10 out of 10, the wine pairings were a mind-blowing 20 out of 10, and the service was impeccable.\n\nIf you’re a food lover or simply looking for an unforgettable dining experience, don’t walk—run to Fulgrances Laundromat to experience Chef Rasika Venkatesa’s residency. And once her tenure ends, you can bet we’ll be back to see what other brilliant chefs take the stage at this incredible spot."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNHVLaTB3RRAB",
            "text": "The meal was entirely underwhelming for the cost. 1 maybe 2 dishes were impressive, the rest were uninventive."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbjlEVllBEAE",
            "text": "Great restaurant! Phenomenal atmosphere and the wait staff was amazing. They were extremely accommodating and the menu was extremely unique. Absolutely loved it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYczQzTUt3EAE",
            "text": "I had an incredible experience at Fulgurances Laundromat last weekend while visiting my sister in New York. We were lucky enough to make a reservation on one of the few nights that they were hosting their Steakhouse at the Laundromat event. If you have a chance to go when they are hosting this - do not miss it! Our experience ended up being the highlight of my trip.\n\nWe were warmly greeted upon arrival and seated promptly. The restaurant has a great atmosphere and feels really intimate. The service was top notch and the food was beyond delicious. Each dish was presented beautifully and tasted incredible. The desserts (there were 2!) were some of the best I’ve ever had.\n\nI wish I had taken photos of each dish, but I was too excited to try them and forgot. I’ll be sure to make a special trip back to the Laundromat next time I’m in town."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcUlXZDJRRRAB",
            "text": "My regular haunt. Premium ingredients, bespoke service, and expertly paired wines. Such an outstanding place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYb1BqbGVBEAE",
            "text": "5 courses… more like 5 bites of food. One of the bites gave me food poisoning. Probably the blue crab bite. Something tasted overly fishy. Currently writing this review while consoling my aching and gassy lower abdomen. Trust the Yelp review ratings here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiX2NPT0JBEAE",
            "text": "Excellent meal. Every course of the tasting menu was awesome - delicious with great presentation, the wine pairings were lovely. Service was extremely attentive and they did a great job of explaining each food and beverage item in detail.…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqXzZYZVhnEAE",
            "text": "Update to previous review,  we dined again under new chef Adam Lawrence.\n\nThe tasting menu I experienced was in the category of \"interesting but not entirely enjoyable.\" No amount of narrative about how special the foraged and curated ingredients are could manage to overcome the lackluster dishes and monotony."
        },
        {
            "date": "수정일: 1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMZ2RlcW5BRRAB",
            "text": "Tres bon restaurant. L’ensemble des plats était parfait. Le vin rouge d’Alsace incroyable.\nUne très bonne soirée. Je recommande.\n\nCependant… après trois relances, je n’ai toujours pas reçu de copie par mail du menu qui m’a été proposé. Ne comprenant pas tous les ingrédients qui m’ont été proposé j’aurai aimé traduire le menu.\nUn vrai dommage par rapport à la table parisienne.\n\nPour info pour une personne :\n1 Menu du soir + 2 verres de vins : 163€ / 175$.\n\nMise à jour : menu reçu. Merci !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOGEtX2VREAE",
            "text": "I went to both Fulgurances in New-York and in Paris and the experience is always amazing. Great wines to pair with the tasting menu. Nice and welcoming staff. A great experience overall. I recommend this address in Greenpoint :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMb2VxaHp3RRAB",
            "text": "Chef Nazareno Mayol is amazing! The taste is special and not normal but delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6ODczRFFnEAE",
            "text": "We enjoyed the menu of Chef Mayol\nWe appreciated that he avoided the temptation of using cheap tricks ( no sugar, cheese or cream ). The Bolivian red wine was a surprise ( needs to rest and air for a while before testing). Great service.  Overall, a great experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMGNlREV3EAE",
            "text": "Came here for the first time with my wife and we were blown away by chef nazereno mayols menu and fulgurances staff and ambiance. So much so that I am writing this review immediately after coming home because I am so disappointed it’s not rated higher.\n\nThe food was spectacular and highly recommend visiting before chef mayol leaves end of June. Wines were perfect and the service was exceptional. Menu highlights for us were the hake in smoked milk foam, duck entree and beautiful accoutrements, and the white asparagus ice cream dessert.\n\nMy wife is very pregnant and they were able to make substitutions for her easily enough. I wasn’t sure about this when reading reviews so know that they are really good about meeting dietary restrictions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqaXJERHVRRRAB",
            "text": "My wife and I went here for our anniversary and had the best meal of our lives. Chef Nazareno Mayol's 9-course tasting menu was worth every penny. The wine pairings were also a perfect complement for each course. Our server, Chelsea, was particularly kind, attentive and engaging.\n\nCan't wait to return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeEtTVEJ3EAE",
            "text": "I love the concept of this restaurants with chefs in residence. The chefs are outstanding."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREd183QlhREAE",
            "text": "Creative dishes, excellent pairings and amazing staff!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5djRQUndnRRAB",
            "text": "If food could be creative and fun this is the place.  With it changing resident chef regularly you have to have an open mind but it's worth the risk"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkZ192ZlBBEAE",
            "text": "Laundromat Fulgurances is a culinary adventure playground. The rotating chefs bring a diverse range of flavors and techniques to the table, ensuring a one-of-a-kind dining experience every time. The service is warm and friendly, and the wine list offers something for everyone. This is a true gem of a restaurant!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNzVpVHNRRRAB",
            "text": "Rotating chef situation in a striped down and intimate dining room. Always worth checking out as they’re highly plugged into the fine food world and have a sister restaurant in Champagne, France. Wine list is massive. They offer a few batched cocktails and will make classic cocktails as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkazRMZGlRRRAB",
            "text": "The reservation system made us walk 20 minutes just to find out that there are no tables, and the staff member we spoke with didn’t seem interested in being helpful. Fix your system."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkZ2VMMmN3EAE",
            "text": "A+ experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0c3BHeTVBRRAB",
            "text": "Very disappointing meal. Served celery purée on ice cream for dessert (made with fresh celeries), not sure why…and then swapped it for ice cream with olive oil drizzled on top (?). Fresh sea food but lacked flavor, mostly cooked in chicken or pork fats."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxZzlhNnNBRRAB",
            "text": "Love this place! Very interesting concept with rotating residence chefs. We went for 2 of the recent chefs, chef Galen and Chef Emile. Both menus were amazing! Can't wait for future residence chefs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcEw3VzhRRRAB",
            "text": "Where to start? Fulgurances Laundromat provides you with an extremely elevated dining experience. From the very knowledgeable and attentive staff, to the  most delicious food I’ve ever tasted, I would 100000% recommend everyone to give this place a try. I already can’t wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbjhxSGVBEAE",
            "text": "Very very slow service. The main doesn’t arrive for a full hour."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NUxyV2NBEAE",
            "text": "Every dish was amazing and I was blown away by the wine pairings to go a long with each course. Very great atmosphere and staff as well. Can’t wait to go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURaaUtoaxAB",
            "text": "Amazing addition to the neighborhood. Food, service and hospitality is always impeccable. By changing chefs every couple of months it’s an opportunity to try differents food and flavor. A beautiful space with a true aesthetic and gorgeous setting."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaajlmNXRBRRAB",
            "text": "Amazing addition to the neighborhood! Food was fantastic, service impeccable. I love how the chefs rotate through. It makes for an interesting opportunity to try new flavors and styles. They are constantly bringing in great chefs. You gotta try it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaajl1YVZBEAE",
            "text": "I’ve been to this restaurant 4 times and every time it’s Amazing. $89 for a 7 courses tasting menu in NYC is a great value and the staff is really knowledgeable and the wine list is impressive. My last visit was for Galen menu and I’ll definitely go back for the next one !"
        },
        {
            "date": "2년 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bWZTZ0xnEAE",
            "text": "這裡每三個月會換一次主廚，所以經常會有驚喜。\n\n這次來用餐，配合的主廚是來自蒙特婁的甜點廚師，雖然是甜點廚師，但是整體的鹹食菜單設計的級完美！甜點好吃當然也是不在話下的。\n\n今天使用了很多日本元素，每一道都很美麗又美味，尤其是生干貝與紅蘿蔔的組合，非常令人耳目一新。\n還有最後一道的烤蕈菇搭配脆餅，也是非常的完美。\n\n這是一家值得造訪的餐廳，服務親切笑容可掬，而且價格合理，非常的推薦！"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlLWIzY0VnEAE",
            "text": "My wife and I went for our anniversary to Fulgurances, and it was one of the delicious meals in our life.\n\nThey have rotating chefs who always create their unique menus. We were lucky to get the amazing menu from Mirali Dibalzi. It were multiple courses of East European inspired dishes.\n\nWe also did the wine pairing, which were will presented and went well with the food.\n\nBesides all the great food the staff was super friendly. We were lucky to get a counter seat. I highly recommend you to ask for one, since it gives you the chance to see your food prepared and a chat with the kitchen staff.\n\nAll over it was a wonderful experience and I highly recommend to go here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbUplOWdBRRAB",
            "text": "Went in to try the menu by Patrice Demers & Marie-Josée Beaudoin. It was a nice experience on a Friday evening. The restaurant was quite busy with the staff running around to provide service.  The restaurant felt like a bustling beehive or a crazy busy french bistrot where you feel the waiter will drop a dish on you any second. So it did not provide for the most relaxing dinning experience.\nThe food was good particularly the not meat or fish dishes where the flavors were shining. I really liked the goat cheese panna cotta with tomatoes along with the airy strawberry dessert.  The wine pairings were excellent featuring some products of Quebec and a Georgian wine."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MlpqaENREAE",
            "text": "Loved the menu by chef Soomin and Greg!\nTop 3 octopus I’ve ever had. So tender and delicious.. was cooked perfectly in my opinion. The crab was so fresh and flavorful. The corn pudding with red bean mochi wow wow. The lamb was melt in your mouth (also top 3 lamb dishes I’ve ever had probably) tofu with mushroom.. simple yet bursting with flavor !!!!\n\nPortions are a little too small (despite the price) I didn’t walk away feeling full at all"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NXVmd3lnRRAB",
            "text": "Amazing service and fine dining experience. I definitely want to come back to try a new menu. They change chefs/menus every 2-3 months.\n\nDrink prices are lower than I expected, total price was a bit high with taxes and automatic 20% tip added (came out to $260 for two people).\n\nIt was my friend’s birthday, and they gave us a little chocolate cake slice with a candle. Make reservations online beforehand, but you could try walking in."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwd01pY1hBEAE",
            "text": "I’ve come here five times now (date night, family dinner and with friends) and each time it’s been such a great experience. It’s fun to experience different chefs and cuisines. The wine pairing is always on point and the staff is very welcoming and knowledgeable.\n\nOur last visit Chef Galen delivered an amazing meal. Highlights included the summer octopus, summer squash, and surprise bonus pork belly.\n\nWill keep coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwOHRhQVB3EAE",
            "text": "What a great tasting menu.\nWe went for Galen Kennemer menu and what a pleasure.\nPlates were perfectly executed with flavors that were layered and work all together.\n\nComes a cherry tomato with pickles and dry tomato and the all with an olive oil water and a celery type of flavor. Wow this was very good.\nEach of the amuse and plate were an explosion of flavor.\n\nWe had a great time and will come back to experiment more with this concept."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdGY2ZlVBEAE",
            "text": "Incredible value for a ‘michelin star quality’ fixed price menu with surprising and delicious wine pairings! Service was warm and genuine with a neighborhood fine dining vibe.\n\nThis is not a once-in-a-lifetime type place, this is a have-to-go-back monthly type place as the chef's rotate and come from around the world to share their experience and culinary expertise.\n\nPro tip:\nsit at the bar and watch the chef's effortlessly prepare each dish!\n\nBest bites:\nSkate wing delicately roasted with toasty garlic and paired with an unfortified fino sherry.\n\nMussel mousse, asparagus and peas (so much more going on with the dish I just can't remember) paired with a rich and totally dry, skin-fermented Muscat wine from Catalonia.\n\nSimply divine!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aC1XRVpnEAE",
            "text": "Wish I'd known Patrice and Marie-Josee have been at the Laundromat since 11/22, I'd have been there sooner. Fantastically clean flavors, I mean every bite was a lesson in how to let the ingredients shine. No pretention, not even in the plating, knowledge and attentive staff, with a superbly succinct and delicious 'chef's table' menu, which changes often! Don't know how long they'll be there, but try to get there before they leave!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdmZlNTVnRRAB",
            "text": "I went to the Colby Rasavong menu in late December. It is just not ready for prime time - when I read that this guy plans to open a restaurant called \"Bad Idea\", I had to agree. It was a real shame since I had enjoyed the restaurant where this chef trained in Nashville.\n\nI had to apologize to my friends as we were all hungry after the meal - it was not advertised as vegetarian but apart from a couple meagre pieces of charcuterie and a tiny fish course, there was no protein to speak of. The final rice pasta in broth course was a massive dud, and I simply couldn't believe it. The desserts were also lazy efforts - peanut brittle?! On the positive side, my group enjoyed the quirky wine list (lots under $100) and we had no complaints about the service level."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXeHZYU1pREAE",
            "text": "An absolute gem of a restaurant - we had the good fortune of trying a menu prepared by Alexia Duchêne and her team, and it was a stunner for just $85. Splurge a little and go for the wine pairing as well. Personal favorites were the beet tartare and the fluke; the fish stock based sauce had us all wishing for more bread to soak it up!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXOUpLZFVBEAE",
            "text": "What a fun tasting menu! Kevin Finch is amazing. His flavor creations were so fresh, creative and delicious! I definitely recommend this experience to any foodie. The wine pairing was great as well."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNVA2eklBEAE",
            "text": "Excellent time with the Wife on date night. The food was unique and delicious, and the staff was knowledgeable and friendly. We sat from 6pm to 8:40sh without being rushed enjoying our food and drinks. Granted it was a Wednesday evening. The decor was super chill and the music ranged from Salsa Oldies, to Jazz, to Hip Hop. My wife and I would definitely come again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dUxqUFhnEAE",
            "text": "Terrible, if not subpar, food and service. Been wondering why this establishment could survive in such a competitive hospitality industry in the city. Seafood was stinky, service was slow, portion was annoyingly small and no one checked in with us regarding food or anything. Server literally mumbled throughout our dinner — they didn’t care how they introduce our food. Friendly reminder — don’t judge the food by how it looks. Also, don’t trust the photos the restaurant posted."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXaUplV0tREAE",
            "text": "The new cook Kevin Finch have brought dishes that are interesting. We like the overall experiences and the drinks. But the food is bit lack of balance. Some dishes are either too sour or too salty."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeGNPNUVREAE",
            "text": "Came here on the first week of chef Inaki Bolumburu’s residency. The entire meal was well  thought out and executed, paired with attentive service. Rooted in basque cooking, the 6-course meal elegantly highlights flavors and ingredients with international influence and technic. The most memorable dishes include maitake mushroom in chicken broth and egg yolk, grilled artichoke with pea purée and ham infused foam, hake with chimichurri sauce, and the amazing desserts (lemon custard with honey and hazelnut foam and cheesecake topped with candied rhubarb). The space is intimated, cozy but not overly crowded (no scene-y, pretentious crowds). Overall a wonderful dining experience that’s very high value to price. Will come back very soon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dWNPZTd3RRAB",
            "text": "lovely experience at Fulgrances. food / wine / atmosphere were all excellent. service was attentive and helpful. did not feel rushed at all. fun concept with rotating chefs so you’ll always try something new. definitely will be back!"
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSX3ZfWDVBRRAB",
            "text": "De passage à New York, nous sommes venus pour une occasion spéciale et avons passé une superbe soirée. L’aspect expérimental de la cuisine est bien présent, on est surpris à chaque plat et on découvre beaucoup de nouvelles saveurs. Le service est excellent, l’équipe a été aux petits soins avec nous et nous a accordé de petites attentions bienvenues. L’ambiance du restaurant est intimiste, le lieu n’est pas trop bruyant et la musique est choisie avec goût. C’est vraiment une adresse à ne pas manquer à New York !"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dU5Ud3B3RRAB",
            "text": "Extremely disappointed by food by chef Greg Wong and Soomin Yoon and the service by the staff. Tasting menu is at best mediocre. And personally I hated every dish except the two desserts.\nTheir seafood are not fresh- especially the curated Crab. As an Asian who grew up with curated seafood, I can surely taste if the crab is fresh and well-curated and I can tell you this is far from even to be considered to be edible unfortunately.\n\nAll the servers mumbled through the introductions as they were reciting something. So please trust the low ratings on here. I DIDN’T and I just paid for my mistake.\n\nAlso in a BK location, they are charging $89 plus 20% service charge without any service is a bit ridiculous because with $90 in Manhattan, you can get a Real nice dinner 1) at any of the current participating restaurant of NYCRW for $60; 2) at Atoboy (sister restaurant of Atomix) for $75 - also modern Korean inspired cuisine 3) at Luthun for $92 - modern American cuisine 4) or just walk down the street, to MADRE - they have the amazingly fresh and well-seasoned oyster - unlike what I had this place tonight. Maybe this is just a bad night, but I have to say I had a TERRIBLE NIGHT - and I rarely say that."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPLWFfMXRRRRAB",
            "text": "Delicious and full of flavors dinner by chef Inaki on his last weekend at Fulgurances laundromat. I found it more interesting than some Michelin restaurants I have been to in NYC. Dessert was so good 😋😍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOU5MQUJ3EAE",
            "text": "My partner and I just dined here. We loved it. Food, wine, and service were all great. Chef Flor's menu was fascinating. The kitchen was great about accommodating my dietary restrictions. I don't agree that the pacing is slow- we were in and out in a bit over two hours, and our server was attentive the whole time. The wine pairing was lovely- quirky and interesting without veering into overly \"natural.\" I'd happily go again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKb28za0hREAE",
            "text": "Fulgurances Paris came highly recommended by a good friend, and it exceeded my expectations.  From the moment I entered the restaurant, I was charmed by the intimate setting.   I was greeted warmly by the staff, who immediately escorted my friend and me to our table.  Service was excellent and prompt.   The first server to greet me explained the flow of the evening, confirming that each course would be chef-prepared tasting menu, with the option of wine pairings with each course.   I found each offering very artistically presented.   The food did not disappoint.  Each new dish brought with it a different experience of taste and flavor.   The sauces were particularly creative and introduced me to combinations I would never have thought of myself.  The wine pairings were excellent.  The sommelier was very knowledgeable and patient, allowing my questions and the time to take pictures of each label.   I would highly recommend Fulgurances Paris, and look forward to visiting Laundromat, NY."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKM3F6SzVnRRAB",
            "text": "Enjoyed Chef Galen’s tasting menu. It felt like a good amount of food (2 desserts!) and enjoyed how the courses were spaced out. Vegetable and fish forward. Went on a Thursday evening; If you’re looking for more of a lively vibe, I’d go for the 8pm+ seating. The 7pm seating was good for dinner with parents in a more quiet setting as the restaurant wasn’t full at that time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobklpdW1RRRAB",
            "text": "One of my favourite tasting menu experiences in NYC. Always impeccable service, innovative (and changing) menu and a great way to try different cuisines from different chefs within the same location. I always get the wine pairing too, which adds another level to the experience. Definitely not cheap but compared with other NYC dining experiences I have had, this is really good value for a special occasion."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlX1BEZExREAE",
            "text": "We've eaten here four times over the past year. Each time was a different chef, and we liked some more than others, but I've never regretted forking over my ~$100/pp at the end of the night (we don't do wine, and the price varies depending on the dishes). For us, Fulgurances hits a unique sweet spot of inventive, warm, delicious, \"nice\", and accessible, in terms of both price and location, so we keep going back. If you like cooking, or just observing people doing stuff they're good at, sit at the chef's counter and watch that calm and well-oiled machine work.\n\nI've seen a couple of criticisms in less happy reviews. One is that the portions are smaller. This is probably accurate, because most other tasting menus I've had have turned into ordeals that leave me sick of food by the time the desserts start showing up. I'm happy when I leave Fulgurances, so they must be serving less food. I'm glad for that personally, but if you're a big eater, you might want to have a salad or something first.\n\nAnother criticism I've seen is that there's too much time between courses. I am, again, happy about this, since it gives you time to think, digest, and if you're at the chef's counter, just watch stuff happen. It might get boring if you're dining alone at a table, but if you're dining alone, there's really no reason not to be at the chef's counter anyway. We're usually in and out in 2-2.5 hours, which has always felt like a comfortable pace.\n\nAnyway, if you want to make an evening out of trying interesting and often great (not good, great) food for relatively low prices in a nice space served by exceedingly competent staff, try it."
        }
    ],
    "reviews_count": 75
}