{
    "name": "El Pingüino",
    "place_id": "ChIJeUVN0a1ZwokRmL33czrgxWM",
    "grid": "BK1",
    "address": "25 Greenpoint Ave, Brooklyn, NY 11222, USA",
    "rating": 4.7,
    "user_ratings_total": 208,
    "phone_number": "(347) 463-9509",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUFgzbElORkJ3UjJWeWNEQlllVlZtUlV0T05IYxAB",
            "text": "Love the Martini happy hour!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GZmExcDZSRFF5T1dvM01IVmpMVEJ5UmtSdWEzYxAB",
            "text": "Great drinks, great happy hour, great vibe. Outdoor and indoor seating 5 stars."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQk5UWktZWGROTVdoZmQzRlRaRWhVUzA4MVVtYxAB",
            "text": "Vibes on point for sure, but avoid if you are looking for something Spanish. This is not a Spanish bar at all. Cool bar, just not Spanish."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMFJFTndWMnR4Y21jMGJsQTVPREJEVkhwdk9YYxAB",
            "text": "Great food and service!!!!!\nAwesome cocktails too!!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oV056RnJNMVU0TjFKNFduVnlhMFJ4VEU5dE5uYxAB",
            "text": "The food and drinks were awesome. Surely didn't look like a happy place for the staff at least during my visit. Also, having everyone wear French work jacket at a Spanish restaurant seems like a bit of a fraud."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SaGIxYzRkMDR4T0dWM2NtdHJUV05XU1hCaFRYYxAB",
            "text": "Cool spot with good eats and chill vibe, hipster hangout for sure and I say that with zero disrespect or sanctimony. Just stating it as fact lol"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRGQzWldTVjkyVlRrelprbzVjaTFuVFdKbFZYYxAB",
            "text": "Had such a lovely dinner last night at El Pingüino. Highly recommend the Japanese martini and canned mussels. Some of the best oysters I’ve ever had. Lucked out to go on a night when there was an Aperol Spritz rep so we got some free drinks. Awesome experience all around!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaFMwaDZTMkU0YjA5U1lsUm1ZV00yZVVJNGFrRRAB",
            "text": "Very nice place with cute small menu and oyster happy hour!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocVdXaGZSRFEzUTNacFdGZElaemx2UVZSU1gxRRAB",
            "text": "Good oysters and a happy hour that runs until 7pm. The oysters were fresh and while I’m not a huge fan of red sauce I did enjoy the freshly shaved horseradish. That and a few other small Spanish plates and $12 martinis made this a pleasant low key early evening out"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jd1NsbFFNR1UxVW0wMFR6SlRlRWh5VlhGNVdHYxAB",
            "text": "This spot knows how to make food that people crave. Their dishes lacked culinary interest. They maintain high standards, serve generous amounts, and charge fairly. Workers delivered good service typical of this establishment. The quality is excellent!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPWHEwYW1fc0ltSGFnEAE",
            "text": "The waitstaff was great but the cheese plate was like 4 thin slices of a Provelone, a single banana pepper, 8 nuts, and a thing of jam that looked like it came from a smuckers single serve packet, all for $22 freaking dollars. Respectfully, That’s insane"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJV0VpT0QwcF82dTBnRRAB",
            "text": "Great vibe, delicious martini and oysters!\n\nService was also very friendly and welcoming, felt like a local"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPVEdySlN3M1k2ZUhnEAE",
            "text": "It’s been a year or so since I’ve been here but you wouldn’t know it since everything was just as delicious as the first time I came here. The food is thoughtfully prepared and served by kind, knowledgeable staff. I can’t say enough good things about this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJcjkycnU2MzYzdS1BRRAB",
            "text": "Definitely come for happy hour, 7 days a week 4-7pm! We enjoyed the half price oysters and $12 martinis. The food can get pretty pricey since they're all small plates, but they all tasted great. We had the roasted peppers, steamed clams, cheese plate, and basque cheesecake. Service was friendly but pretty slow. Overall, I'd come again, but definitely stick with the happy hour deals!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLblJsOUQzbVpxYTR3RRAB",
            "text": "Love the vibe, the staff, the gildas and the cheesecake"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdjdmWktnEAE",
            "text": "A nice chill place to eat and drink food items are very specific and limited. The drinks are really good.\n\nGood cozy spot to pre drink"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdy1LVDdBRRAB",
            "text": "Great place in Brooklyn!  Perfect for some tapas and wine!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndTRyQnhRRRAB",
            "text": "Went for the oyster happy hour which was amazing + ended up getting multiple tins of fish. So good + all of the staff were friendly and unpretentious. I also appreciated the minimalist decor very much."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfLWR2NUtBEAE",
            "text": "We had an excellent experience with the staff here.\n\nWe came after dinner at neighboring Fulgrance on their recommendation, because of El Pingüino’s fortified wine list.\n\nIt was a lovely experience - nice calm place to enjoy a thoughtful menu.\n\nDon’t miss the basque cheesecake with any staff recommendation on beverage. Did we need to eat that after a full dinner? No. Was it worth it? Yes."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMDk3UW5RRRAB",
            "text": "We had a great experience with Devin and Michelle tonight , thanks for your great service. Not only did we try a lot of new wine and sherries, we learned a lot about gastronomy from them.\n\nThis is the type of experience that patrons rave and talk about - it’s definitely a destination worth traveling to….cheers 🍷"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbk5DTlpBEAE",
            "text": "Amazing place to spend an evening with friends and eat oysters especially during happy hour. Cocktails are also good. Staff are super friendly. Definitely will come back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2a0kyTGd3RRAB",
            "text": "This is def a cocktail bar. The food menu is mostly snacks - not a dinner spot but a great place to get drinks and a seafood tower. Painkiller and dulcimer gimlet are amazing, alls had really good oysters."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQd0k2US1BRRAB",
            "text": "Love this place. I went here for a Tuesday date night and enjoyed the sausages along with a nice glass of Basque wine. The staff are as hip and friendly as you’d expect from a Greenpoint restaurant as well!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzZ0piWDBBRRAB",
            "text": "Great local bar and oysters"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbHBXT1V3EAE",
            "text": "My husband and I had a fantastic evening at El Pingüinos! We enjoyed a couple of dirty martinis, which were perfectly mixed, and paired them with some great bites: sardines, sourdough bread, olives, and a cheese platter. Everything was delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMk9uSHpnRRAB",
            "text": "Good martinis. The oysters were gritty and not well shucked but the bread was great. Translate that as you will."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuM1lUQlpBEAE",
            "text": "They do a great happy hour! Cool hangout spot, small dishes, nice wine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuemJmeWx3RRAB",
            "text": "On of the best places in NYC  the food was amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuamF5RERBEAE",
            "text": "Martini/oyster happy hour rocks, great crowd. Make sure to get the gildas and sausages as well!\n\nLOVE the freshly grated horseradish served with oysters."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua3JiQmlnRRAB",
            "text": "We spent around $400+ to have drinks & some food. I can't recall another place where we felt we needed to be out the door by the staff. The place is very pricey in the first place but the service was a 'no'. Let's also mention they double swiped my payment card...First time and definitely the last time here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaEpUVjdnRRAB",
            "text": "One of my favorite spots! Love that it opens at 4pm, quiet space to sit at the back patio space. The food is excellent and a great selection of wines."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIM2VTM1pREAE",
            "text": "We love El Pinguino!\nGreat Spanish tapas and amazing drinks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbHNTM0pBEAE",
            "text": "Had an impromptu birthday gathering in the backyard and it was perfection.  I swear my their martini and oyster happy hour.  My group was thrilled and I am still thinking about how excellent the oysters were 🥳."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbXJEekRREAE",
            "text": "Closed on a Saturday for a Private Wedding with 0 notice. Says open on Google, was just told “Sorry” upon arrival. Would not recommend dropping in without calling first."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOFpTZDV3RRAB",
            "text": "staff is a gem. backyard space is delightful. and the drinks are tasty and unique."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3M192ZUdREAE",
            "text": "Nice neighborhood restaurant to relax and enjoy a good meal and mellow atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMVpmamdBRRAB",
            "text": "Only stopped by for cocktails but had a great experience. It can get a little loud and had a yuppie vibe, but staff seemed down to earth and the drinks went great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaGQ2Y093EAE",
            "text": "a perfect happy hour"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMmZfeEJ3EAE",
            "text": "I've been wanting to try out this place for awhile and today I finally got to go and it was amazing! The vibe is super cute and the service was fabulous 🤩 and the food and the martinis were on point!! One of the best dirty martinis!\n\nEverything we ordered was delicious 🤤\nWe ordered oysters, steamed clams, boquerones, sourdough, black bass ceviche and basque cheesecake. Highly recommend 🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNzRQc3lnRRAB",
            "text": "Had a ridiculously delicious meal recently. Perfectly executed food and the waiter helped us pair the ideal wines along the way. Nice room and great service. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb3B1MVVBEAE",
            "text": "Great oysters, great wine and amazing basque cheesecake !!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dXRySzJ3RRAB",
            "text": "We had a terrible experience at this restaurant, mostly due to very rude staff and *very* bad service.\n\n1) We ordered drinks after about 15 mins of waiting. Then the drinks took approximately 30 minutes to come (this is always a bad sign). Around 15 minutes, I followed up with the waitress about the drinks (politely) and she said in a condescending tone \"the restaurant is full. Your drinks are coming\" - as if the restaurant being full is an excuse for drinks taking 30 minutes. This just means the restaurant is understaffed or they should have less tables.\n\nIt's not up to the customers to expect that service should be severely delayed when a restaurant is \"full\".\n\n2) At this point, we decided we were going to probably just pay for the drinks and leave. However my wife was very hungry and asked to just order a few oysters - she asked how long it would take, as we had made a new reservation next door. The answer - 25 minutes! 25 minutes for oysters! They literally just have to take them out of the fridge.  Once again, the server communicated this in a condescending tone.\n\nI would highly recommend if you want to have a nice waterfront dinner, you go to to 21 Greenpoint next door."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6N19ucEF3EAE",
            "text": "Much anticipated place and it ended up being mostly good but not without issues. We came for a happy hour on Wed at 6:30pm. The place is tiny and you really want the bar seating. It was 3 of us so we sat at the table in the back which was weirdly pointed towards another table — ok, I guess they envision some sort of communal dining. It’s a vibe but def. lacking privacy. Both Japanese and pickled martini were good but I don’t think they were $22 good. I ordered them thinking that they’re $12 due to happy hour and the waitress never mentioned anything until we got our check and were surprised to see both of them being at the regular price. Basic courtesy would be to make it clear. All of the snacks—boquerones, razor clams, scallops—were delicious, although $27 for a can of clams made me weep with memories of getting same thing in Barcelona for just a few euro. The worst part was waiting for oysters; I get that this is half-priced happy hour so I can wait maybe up to half hour, but ours came 45 mins after ordering. Kind of unacceptable. Oysters were small but tasty. Good deal if you can get in on it at the start of the HH."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdEtTRTZnRRAB",
            "text": "🔥🔥🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEX191d1pREAE",
            "text": "Cozy intimate contemporary bar with tasty small plates and delicious cocktails"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCak9QenJnRRAB",
            "text": "ngl good food and ambiance, but they charged an extra $10 to my card and never responded to my messages and email (they don’t have a phone number), so be careful and check your card statements\n\nupdate: they got back to me after i wrote this review (1 star), so i’m bumping this back up\n\nupdate 2: i went back and wasn’t charged extra, the oysters are solid"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNHNlNXJ3RRAB",
            "text": "Love it! Such a vibe! Great menu - I love the Gilda and oysters"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MzhLNkt3EAE",
            "text": "Great food and martinis. Best dirty martini I’ve had in a while."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0cS1iVGxRRRAB",
            "text": "Awesome spot for martinis and seafood. Had the oysters and the clam dish, was introduced to a ‘perfect martini’ and it was exactly that!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0Z0lDYWd3RRAB",
            "text": "the seafood platter was amazing. good date spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdnJfdVFREAE",
            "text": "An intimate local cocktail bar with a well-curated selection of drinks. Their drinks menu is very extensive which was nice to see. My favorite drinks were the Shiso Painkiller and Paper Plane.  We also got the cheesecake, which was perfection <3. Great happy hour deals - they also have a \"nighttime happy hour\" which is from 10pm-12am! Suuuper friendly and helpful staff and good vibes overall. I would love to come back for oysters next time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NFBMc0ZBEAE",
            "text": "Had this place on my list for a while, and finally got around to going last week. Did not disappoint. The seafood tower was incredible, including the oysters. Nice and fresh. Drinks were great as was the chorizo and peppers. Would definitely come back during their happy hour."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlN3RQVnR3RRAB",
            "text": "The best oysters, mussels, shrimps, crab salad, piquillos in Greenpoint and in NY so far (personally). The service was fantastic and fast and prices were reasonable considering the quality.\n\nI would recommend coming here during happy hour and enjoy some oysters and the 12 usd martini.\n\nI absolutely loved this place, the drinks and vibes are perfect. The place is not too loud. I would recommend this place for all sort of occasions. It’s simply perfect."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNzZLM3ZnRRAB",
            "text": "Fantastic bar & oyster spot. While I didn’t have a ton of their offerings, (just 2 or3) it was the perfect start to a night out with a martini and oyster happy hour. Had the bread & sardines as well which we liked to help soak up some of the alcohol. But had a nice experience & looking forward to coming back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcjRmSVJnEAE",
            "text": "Like? Yes very much. But then again we love tinned fish. If you do then this IS! the place to go. Just a lovely atmosphere near the water. But not only tinned fish....seafood tower that was just wonderful. I'm really looking forward to a…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycE9iS0lnEAE",
            "text": "Fabulous vibes and great selection of tinned seafood. The oysters were very fresh and plump, but some had not been cut all the way through on the shell side, making them a bit hard to eat. A bit pricey, but very fun with great service! They also have a happy hour everyday until 7pm, so I’ll definitely be back for that!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMWIybXhnRRAB",
            "text": "Greenpoint Secret Bar It's really good. The interior of the restaurant is decorated with a mix of 80's Japanese bar with modern style. The food is very good. I like the cocktails very much, perfect combination. I will definitely come back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cHNhejZ3RRAB",
            "text": "For some reason whenever I come to el pinguino it’s the perfect temperature, it’s golden hour, transmitter park is poppin off, and I’m on an absolute bender. I end up drinking one too many dirty martinis while make audible pleasure noises while downing the anchovy pepper skewers. The folks behind the bar really seem to love their job, the food they serve, and the drinks they come up with.\n\nThe first time I went they poured us a drink and then let us pop out to transmitter to have a glance at the sunset before even paying our tab. That kind of trust in the community is rare and beautiful.\n\nEl pinguino is a lil slice of heaven in greenpoint.\n\nThis writer pens this review begrudgingly because he doesn’t want this spot to blow up. Part of the magic is the intimacy. But because he wants the good people at the Pinguino to succeed he feels compelled to show some love."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOWNfUVl3EAE",
            "text": "Great place to chill out. If you order the combo which includes a dozen oysters, pozole, and those I can’t tell the names, the oysters price would be equal to the happy hour price. Sherry is so good, not to sweet, and martini, gorgeous. Great vibe and suitable for 4 people to share."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNF8yeUhnEAE",
            "text": "Amazing Spanish seafood! Sourced & presented really well, by people who care about the food and the place they work. Sample a few things from each area of the menu, you can’t go wrong. Bravo Pingüino!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1OEpyRkxnEAE",
            "text": "Cute bar with $16 cocktails. We got the oyster happy hour special and a cheesecake. The cheesecake was very dry."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OXF1T2JBEAE",
            "text": "Not a bad happy hour, cheap martinis and half-off oysters during happy hour (from $4 down to $2 each). Do yourself a favour and order a 'gilda' with your martini, it's a mix of olives, guindilla peppers and an anchovy on a toothpick and it's delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNWVTUlB3EAE",
            "text": "Great oysters! Great happy hour! Great service :) the sardines and tuna were super tasty. Have been here a few times already and will be back some more."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPenR5NW5BRRAB",
            "text": "the food and ambiance is great but the staff are a little flustered and seem to work inconsistently. they give away 5 person tables to couples that like to stagger and we were told there were no tables available inside- there was an empty…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyXy1fWTZRRRAB",
            "text": "I've been to the Asturias in Spain and San Sebastian. This place is perfect. Don't skip the canned Spanish cider, it's incredible. And you must without fail order at least one conservas (canned seafood). It's rare to see that outside of Spain. Make a reservation even on a Monday. It's a small space."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MS1pODZRRRAB",
            "text": "Very unassuming from the outside but a smashing spot for basque grub & gargle\nThey’ve txakoli by the glass and their happy hour is fantastic 🏏👌🏼…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOelBQdTlRRRAB",
            "text": "Just had cocktails and the seafood tower— don’t really remember the cocktails but the seafood tower was exceptional and would order it again. The ceviche was a standout."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOHA2akNBEAE",
            "text": "We’ve known this place since it first opened but never got a chance to go. Finally here! Really nice oyster for happy hour. I love the spritz drink as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWa01mb2ZBEAE",
            "text": "we went during happy hour and loved the oysters and wine. chill atmosphere, good service 🙂"
        }
    ],
    "reviews_count": 69
}