{
    "name": "Glasserie",
    "place_id": "ChIJf9j4STxZwokRc9PDhX2eoHw",
    "grid": "BK1",
    "address": "95 Commercial St, Brooklyn, NY 11222, USA",
    "rating": 4.5,
    "user_ratings_total": 921,
    "phone_number": "(718) 389-0640",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnME5VRTFSRUZCU21kNmIzWkZNM1p5Y1hGcWJFRRAB",
            "text": "This place is a gem! Excellent menu and service, Sadie was a great host and served. I ordered a highball Yamazuki, it was bomb!\n\nOrder more plates instead of less and you will leave content and won’t regret it 🤟"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRE1tSkpSVkp4WDFGR2RVMVhSRlZFWWtwdk1tYxAB",
            "text": "Very unique restaurant in Greenpoint the service and decor are excellent with the food being the main attraction small plates of very delicious food go with the hummus, duck and the Dorade you won’t be disappointed they have great beer from N.Y.S. Which was delicious"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bk1EUkVWVlZtV1RKdlh6STVVMHBPTjNwdU1YYxAB",
            "text": "Omg the pita"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNGRrOW9NRU0zZFZJeGJqQnJlbkZoV2tnNFkzYxAB",
            "text": "Great atmosphere and delicious food. Especially the potato cake (Sabich). Daniel gave us excellent service and hospitality. Will definitely come again soon!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRmRsQXlTR1ppTjJWMlZFVmFOMkZKUlVJeGMyYxAB",
            "text": "I went here for brunch -- their mezze is amazing.  I also went for dinner, and had a really nice experience.  All this to research for a birthday event that I threw here.  The drinks were amazing.  The mezze platter was so plentiful, tasty and extremely well executed -- they thoughtfully had cold dips and pitas and veg early on as guests arrived, then brought out hot platters of food while the party was going.  Guests couldn't stop talking about how good the food was.  Cocktails were amazing as well, really reasonably priced.  And finally the staff was so kind and really worked with me and my friends to setup the party!  Could not recommend this place enough for a nice meal or your next event!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reFFXRXlVV1JtYW5CNlFYVlBiemhtV21VMlZWRRAB",
            "text": "Fantastic takes on middle eastern standards. Try the smoked lamb schwarma and the heirloom cauliflower!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gc1QzRTJXbW94Tm01bVUxaFZPRlZIU25aNlVFRRAB",
            "text": "It was surprisingly a bit more pricey than I expected for Brooklyn/Greenpoint but I thought the food was excellent, I enjoyed my meal very much. Had the duck, shawarma, and bread, duck was particularly tasty.\n\nThe ambiance was very nice, although it was a bit too dark in my opinion but I guess that helped set the vibe haha. We were seated at the bar and the server/bartender was very pleasant and lovely throughout the entire meal. Really liked our dinner here!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twd2RWQjBRVTlvT1ZkNlRHZFZZbkF6WWxscVVrRRAB",
            "text": "Perfect restaurant in Green point for a romantic date. The food is so good. I really enjoyed the hummus and the beet salad. The wines by the glass are awesome, stuff is so nice. It's great during the week. Not sure about the weekends. I can imagine it gets crowded. They also have an outdoor space but due to weather we were eating inside. They also have a lot of vegan options on their menu"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNFZEWTVjMFpNY0ZkbWEySllhazkwYTBwRGJrRRAB",
            "text": "potato cake w eggplant (sabich) is delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRmQyTXdWMU5YVm1GQ2RHUlpUM1JrZW5kYU1rRRAB",
            "text": "Food was fine. Very overpriced for what you get, but nice atmosphere and cute vibe. Cute enough date spot.\n\nJust be prepared this place is credit card focused - this place is exact change only if you decide to pay with cash be prepared to only have exact change."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONk1tdzJkamc0VFhSaFRYZDBhV05VY0ROelNVRRAB",
            "text": "I have lived in south Brooklyn and then UWS for years, and this place was on my radar, but I always thought “it wouldn’t be worth the long trip.” Wrong. I knew I’d be in the area so I booked a table. This is now in my top 5 NYC restaurants. Each dish was so flavorful, bright and freshly herby. The falafel might be the best I’ve ever had. The ambience is on point - romantic old Brooklyn quality to it. Superb. Make the trip."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSlNVdFNlVGxZZDNCVWJsRmZZa0p0WDB4b1VtYxAB",
            "text": "It's ok, nothing really special. Generic Mediterranean and generic Brooklyn hipster spot. A little overpriced."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRlQxOUtXRVJITkRCbk1tOUJTR3hzWDJjMFExRRAB",
            "text": "Great food in great space and attentive service.  Vegan options!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padVoxWnhWSE5LVEZkRVYxbFJjamMwTWtORVJHYxAB",
            "text": "Really enjoyed the shashuka and challah bread. The shakshuka had fantastic flavor and was one of the best I've ever had.\nI liked the falafel which comes on a bed of tahini. The falafel were not dry and had good flavor. The tzatziki was a bit salty.\nThey have full bar and limited beer on draft. Prices were fair for location and quality.\nPrices were mezze items ($9 each), shakshuka ($21) and a beer ($9), this is fair pricing. Chill environment overall.\nService was good. They have indoor or outdoor seating. The design inside is very interesting. Bathroom was clean.\nI would recommend and will be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kb2NGWlpRbk5OTTBKU1NXbEZZelpmYkdWYWQzYxAB",
            "text": "Reserved through the Resy app and showed up to my reservation on time. I was charged $50 no show fee regardless. Tried phoning several times and sent emails with no response"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adlNIRk9aVEZsVVV0MldWVlJjM2xtVW1rM1NIYxAB",
            "text": "Outstanding service and food! Shoutout to Daniel, who went above and beyond to make our dinner special. He was so kind and attentive, and made us feel so welcome. Highly recommend the labne and maple baklava!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqN3JLUkZBEAE",
            "text": "Love everything about this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcWJ6RjBPR3hRUlRCallqbHlUalozUjNaQ1RVRRAB",
            "text": "Great vibes, great service. Bartender and cocktails were big time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaR1kweG1Na0ZXVDFoS2FtdE9lV0pNTm01VFMwRRAB",
            "text": "Love this spot in the north end of greenpoint, the food and especially the bread is super tasty. Service is chill but attentive Brooklyn, my waitress had an issue with her toast machine and somehow the order didn’t go through, we were all kind talked it out and she gave me 20% off the check a fair and balanced approach. I was just glad the food arrived because it was wonderful can’t wait to return! Get the dorade wow wow wow"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkZmRVOTJUMFYzTUU5SVZrMXVVakpTVlhSdmFsRRAB",
            "text": "The mezze feast is such a beautiful and delicious spread. Also got the shawarma and the little gem salad.\n\nGlasserie is a very vibey place for brunch! We shared amongst a group of 4. Service was fantastic and they made room for our stroller.\n\nIt’s about a 10m walk from the G train for those who aren’t in the neighborhood.\nI would definitely come again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJRGMwX3lBbk82MnhRRRAB",
            "text": "Had a great date night here! Pickles were a great starter as were the pheasant and duck cigars. After that things got even better..  the crispy quail with tahini sauce, crispy yams, and lamb kabab pita hit it out of the park 👌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUmNFbHhZa05OUzFkRk9UTTVkV2h6UkRScFluYxAB",
            "text": "We had the pickled veggies, lamb cigars 😍, yams, lamb shawarma and the quail. As an afterthought we got the honey almond cake with a salty apricot ice cream. Literally every dish was a banger! Drinks selection on point as well, great non/low abv options.\n\nAnd the vibe in late spring/early summer - music, open windows, mismatched furniture. Just chilled out.\n\nWe loved it for a date night, couldn’t recommend more!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFME9EaE1PQzFOUVhkdlYxaFJXVTVWUlVkTlZVRRAB",
            "text": "Just perfect."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZnZndFdCX3VyVEt3EAE",
            "text": "DELICIOUS meal - would highly recommend! We got invited at 8:45 and the kitchen closes at 9 - our server was amazing and didn’t rush us out. The food is so fresh with loads of fresh herbs which made it perfect. Highlights were the short rib special, sardines and alllll the dips and the breads were to die for. Highly recommend making it out to visit!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMbU4zTXJwNTlUUThnRRAB",
            "text": "Delicious Mediterranean spot in Greenpoint!\nThe brunch Mezze Platter was beautiful, fresh and tasty."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNkRfNjZjckpTU2R3EAE",
            "text": "Really great food and some interesting unique flavors"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbmN5Wjd4eG83TXFBRRAB",
            "text": "Kingly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYndxWmljbnRiVXFBRRAB",
            "text": "“Everything was great. The food was spectacular, the staff attentive, and everyone very friendly. The only thing I missed was someone looking after the outside tables, which made us wait a little longer than usual. I understand it’s May, the weather was unexpected, and there may not have been enough staff—but I know this wouldn’t happen in the summer! Overall, a 10 for the place, and I’ll definitely be back. Thank you!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnJxaXlnRRAB",
            "text": "A super cute cozy chic eatery with great food and service. There’s some tables outside that have lovely ambiance and it’s also very beautiful inside.\nFreddy was really helpful with introducing the concept and made great recommendations. He was very friendly and we didn’t once feel like we needed anything.\nNice music playlist, beautifully curated atmosphere, and the food was delicious.\n\nWe had the baba ganoush, halloumi salad, and beet salad to start and they were all so well balanced and refreshing. Highly recommend the baba ganoush.\nThe crispy quail was really well prepared, and the lamb shawarma was rich without being too heavy.\nSave room for the pistachio mousse to end."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNzdLQVpBEAE",
            "text": "Finally joined Glasserie for brunch on a beautiful Sunday. The restaurant was very cute with many design elements and decors reminiscent of the original glass factory. Tables are spaced nicely and don’t feel cramped at all. The host was lovely and sat us right by the big windows with lots of natural light. We ordered a bunch of items from the regular and specials menu, and they are all very good. My favorite is the poached eggs with chickpea and lamb merguez stew, it was absolutely delicious! The house made pita was also super fresh. The glazed lamb ribs were a bit too burned and fatty, but good flavor. A couple of service lapse such as no napkin on the table and no sharing plates, but otherwise a very pleasant experience overall. Will come back again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJai1xTE1nEAE",
            "text": "Great food, great vibes! Cant wait to come back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRak5YRjNRRRAB",
            "text": "They mezze plates were huge portions and so delicious!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNk1PLWtRRRAB",
            "text": "It’s a no from me. The food was only ok. IMO overhyped. Chairs were uncomfortable. Tiny portions.\nThere’s much better Mediterranean/middle eastern."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbE9Xem1nRRAB",
            "text": "Last night diner was Amazing! Thanks to the unique service & kitchen staff. They delivered a magnificent experience. Cheers 🙏🙌🏼 great food!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnckx2eEZ3EAE",
            "text": "Don’t come for the food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBazdETnpRRRAB",
            "text": "Very tasty vegetarian options! Strong drinks."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOHFiUFBBEAE",
            "text": "The food here is so good- ambiance service everything was 10/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbjVlOWdnRRAB",
            "text": "This beautiful, serene spot is a delight. The food is excellent and delicious; fresh and creative, and the ambience is perfect. Top notch bar and service. Don’t miss out!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdGR5OFNnEAE",
            "text": "Go. Seriously. We went with a group of six for brunch and every single person was raving about it for days after. Hits every mark - food (first and foremost), service, ambiance. Only ding is that it's a bit hard to get to but if you're already making the trek to Greenpoint, consider Glasserie a must."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMGRHNUZBEAE",
            "text": "Food is excellent but a little pricey compared to what I expected. The labneh was the size of a golf ball but is meant to be a shared dip? The restaurant is nicely decorated but the service didn’t feel super warm and there was a decent amount of pushback to make a basic substitution for an allergy. The substitution was ultimately granted but it would have been nice to be able to do it without an issue."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd18yNVZBEAE",
            "text": "Mi Amor trabaja duro y cocina rico"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdFpIX1h3EAE",
            "text": "Solid experience. Staff is always kind; food is excellent. Especially appreciate the spaciousness of the tables. Don’t feel like I’m on top of others. However their seats aren’t comfortable or stable. A woman actually fell back and almost hit her head on the table behind her. Thankfully the table wasn’t any closer."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbjg2RWJnEAE",
            "text": "Amazing! Food is delicious and has decent portion. Service is attentive."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdExUYWNREAE",
            "text": "This place always holds a top place in all Greenpoint restaurant recommendation lists, and it surely deserves it! The service was warm and welcoming, the food was exceptional! We had smoked eggplant piquillos with pita, it is one of the best dip we ever had. The daily special - steak blew our mind. Highly recommend to everyone."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNzl5ZTRBRRAB",
            "text": "Great food, but they moved our table after 15 minutes of being seated, the waiter recommended we order more after we ordered 2 dishes per person which was not needed, and they rushed us to order and promised to space it out but did not…. One of the worse service experiences I’ve had lately\n- Justin LoTurco"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNHItd293RRAB",
            "text": "They charge you for every single piece of pita bread. that is anti-mediterranean, lol. the food isn't flavorful and portions are small, I was really disappointed. better off going to huda's levantine, sawa, al badawi.. million other spots, if you want a real levantine experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYd3UtMTZnRRAB",
            "text": "Discovering Glasseria was a true gem! Located in the historic Greenpoint Glass Works building (1880), this Mediterranean haven seamlessly blends industrial charm with culinary excellence.\n\nOur dining experience was nothing short of superb! Fresh, high-quality ingredients shone in beautifully presented appetizers and dishes. Standouts included:\n\n1. Stunning shared plates\n2. Expertly crafted cocktails\n3. Thoughtful wine pairings\n4. Show-stopping maple-glazed baklava (a heavenly finish!)\n\nThe atmosphere perfectly complements the incredible cuisine. Glasseria's unique blend of history and warmth makes it a must-visit destination.\n\nIf you're seeking a memorable dining experience, look no further than Glasseria. Book your table and indulge in a culinary journey!\nRecommended for: Mediterranean food lovers, cocktail enthusiasts, and those seeking a unique dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbExpb1hBEAE",
            "text": "Lovely spot on Greenpoint for dinner. Tapas styled Mediterranean cuisine. Standouts were the chicory salad and the lamb shawarma which was basically a pita pizza with hummus and shawarma and salad. Very tasty. Also the labne and griddle bread was delicious! Skewers were fine but I wouldn't order again.\n\nBeautiful restaurant with lovely neighborhood restaurant ambiance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMzlEOWN3EAE",
            "text": "Ate on the outdoor patio for the first time and it was wonderful. There truly is no place quite like The Glasserie.\nBest Mediterranean food we've ever had. And the servers are amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdE8zdDFnRRAB",
            "text": "It was tasty. Service was good. Cute place. Mezze plate was nothing special. But it was cute in there.  The drinks were like an espresso martini but it was w coffee & some spice. Good for light bites. For me\nIt felt like something was missing on the menu but they execute well w what they have on there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMbVlXOEF3EAE",
            "text": "Amazing meal! The location is intimate and atmosphere was romantic. We had a great anniversary dinner, made special with complimentary wine. Their green tahini dressing was amazing! I would have licked the bowl. The lamb was so tender. We will definitely come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaZ0lQREtBEAE",
            "text": "Food 6/10\nExtremely salty, way too overpowering flavors in most of the dishes that just did not sit well together. The only thing I liked about this meal was the yams. The labneh was not bad, but both the baklava and cheesecake were excessively sweet, and the dips were pure salt. Quite an unfortunate experience.\n\nAtmosphere 6/10\nThe air conditioning was so weak that we were sweating and felt so sticky throughout the entire meal. My skin felt so sticky and uncomfortable.\n\nService 6/10\nQuite slow, laissez-faire hipster vibes."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMXJxa2V3EAE",
            "text": "Omg! I’m thoroughly impressed with the entire experience. From the EXCEPTIONAL customer service, to the food to the amazing wine….I really enjoyed my date night here.\n\nRachael was truly a delight. If you decide to dine, I recommend inside because of the music and just the really comfortable setting. Outside is also really nice too.\n\nWe were still a bit full from earlier but we had the chicken & Green Harissa, chocolate brownie and Maple Baklava. Wow … yum!! Don’t leave without these desserts. 🙌🏾\n\nTheir entire staff is committed to ensuring you have a good experience so if there’s something that you’re not too happy about, share it. They always appreciate the feedback. Businesses like this make me want to keep coming back to enjoy the experience and food but also to support a small business. :)\n\nDefinitely a five on my list. My water stayed full and they asked about dietary restrictions (a plus for me). I wish I had the appetite to try more items on the menu but I’ll be back for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMGRTMGJnEAE",
            "text": "Always wanted to visit this restaurant as it locates in a rebuilt industrial building.\nWe went on Mother's Day for brunch with total 6 people without advanced RSVP. No restaurants can take us, ended splitting to different restaurant.\nCame to Glasserie for 2, they sit us immediately. But no luck for additional table for 4. They tried👍👍.\nThe decor utilized open space rustic theme. Our server is very polite and gave us just right amount of time to review and order.\nFood arrived within 10 minutes window, which considerably quick.\nWe ordered their salad, 2 mezze Falafel & roasted eggplant. Eggplant's flavoring just right, Falafel is a bit salty.\nMain course is Quail, which takes on fried chicken version, good flavor.\nWith 2 fresh squeezed OJ, we settled with a $120 with tips.\nDownside is our seatings outside the restrooms.\nBut will give dinner a try to see if it is as good as the brunch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNk5EZVNnEAE",
            "text": "One of the best brunches in Greenpoint, hands down! Get the Mezze it’s perfect to split with 2-3 people. Ours came with falafel, hummus, baba ghanoush, labneh, pickled cabbage, beets, and pita.\n\nI got the iced coffee which was perfect. It was on the small side and no free refills, but delicious.\n\nThe waitstaff is all very nice and attentive, but not pushy.\n\nWe went with a couple of friends and their 7 month old baby. There were families there with their babies and children, too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbTVTVktBEAE",
            "text": "One of the best meals I’ve had in a while! We had the hummus, eggplant, falafel, and lamb and everything was great. Especially the lamb 🤤"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXLThUR0VnEAE",
            "text": "Cute modern Mediterranean spot with outdoor seating, good for a date.\nI was worried it was too trendy for its own good, but their pita bread alone is worth the visit.\nGet the Mezze Feast!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNnZyTFpBEAE",
            "text": "I’d give this a 4.5/5 if I could. Everything here is absolutely delicious. The reason I’m giving it -.5 stars is because the chicken, though delicious, was seemingly a little undercooked. The baked potato skins was a huge highlight. Very clever execution and each part — the potato skins, the fish roe, and the creamy sauce — was stellar. We’ve been a few times since our first visit, and will likely be back! The griddle bread was also to die for. A bit decadent, but absolutely, absolutely delicious. It also came with pre-whipped butter, which you really can’t beat. The service gets a 3/5 because we had a really great server that was awesome, and then the second time we went the server was super rude and not so great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtc1liNk1REAE",
            "text": "Absolutely fantastic experience, 11/10 would recommend. Went with 5 people and a reservation, seated immediately, had drinks and food. The chicken and tartare were standouts to me, but all the food is good. I love olives, but I didn't know how much I liked fried olives. Turns out - I love fries olives. If you are in Greenpoint, go here"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMnRmVlBREAE",
            "text": "Amazing amazing BRUNCH spot in Greenpoint. We felt in love with Glasserie.\n\nThe hummus, eggplant, falafels (so crispy), pita and crispy chicken +mimosa and espresso martini were so tasty and good.\nSunday 2pm was very busy, we made a reservation.\nWe spent about $60 each.\n\nWe’ll definitely come back!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bGNmSzF3RRAB",
            "text": "Love the place, the food is delicious and staffs are super friendly. They have outdoor seating with heater on(also provide blankets) The restaurant located on a very quite neighborhood, normally are not crowded. The hot cocktails are…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MDVmcjdRRRAB",
            "text": "I guess my expectations was too high before I visited, as a result, I didn’t see any supervise points that I will come back for.. plus, the portion was small which is fine, but it was overpriced.\n\nThe orange juice was $7. And was SUPER TINY.\n\nThe mezze feast was ok. Felafel was kinda over cooked but tasted good. Hummus was good. The rest depends. But the house pita that came together was delicious, I would recommend. We added griddle bread which was buttery and delicious but pricy! 4 thin and small slices costed $10. Not to mention the sourdough..\n\nThe lamb was kinda small and nothing special..\n\nWe were excited about the sweets. However, I don’t recommend babka. It came out cold and was dried, not moist.\n\nThe only thing the was the highlight I will say, cause they made the wrong order so became a services for us.. was the baklava."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMmRmdURREAE",
            "text": "A great bunch option. With a group of 4 we ordered the platter, shakshuka, and a side of sausage. This was way too much food next time I would just get the platter. Still a highly recommended brunch option.\n\nskip the sausage it was bad."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZNDZ6WGRnEAE",
            "text": "Love this place. Always a great restaurant to pick when we have out of town friends. It’s usually share plate style- which we love. The menu always changes so it’s always exciting. The breakfast/brunch is great too. Perfect with the family…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPLV96XzNnRRAB",
            "text": "Came across this place when walking through Greenpoint and was pleasantly surprised! Inside the restaurant has a great vibe but they do offer outdoor seating as well. The portion sizes are generous and the ingredients were all fresh. Definitely looking forward to coming back again and trying other options they offer!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cnFqS2FBEAE",
            "text": "We came here for lunch on a hot July afternoon and we absolutely loved it. Great food, cocktails and service. And it’s such a nice vibe/space. Can’t wait to return when I’m in New York again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLU9XdFlBEAE",
            "text": "I had a great Saturday brunch here, super cool industrial vibe with impeccable Mediterranean food.  Best falafels in NYC, incredible baba ganoush and pita, and very unique kanefe cheesecake.  I’m already thinking about coming back again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcXBmbXFRRRAB",
            "text": "This place is highly overrated. It's been on my list for quite some time, so I was hoping to leave a 5 star review. But, of the multiple items we ordered, only the hummus was superb. The chicken was under seasoned (awfully pricey for plain roasted chicken and it did NOT fall off the bone). The tartare was too salty and the roasted \"rosemary\" potatoes were too dry. I spent $240 for 4 total drinks and dinner for 2 people, which plays into my disappointment.\n\nIf you visit, do it for the vibe. Grab a couple cocktails and order the hummus. Then, go elsewhere for dinner. I gave one star for the vibe and one star for the hummus, which is indeed, very good (So is the pita bread they serve it with)."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMXZxbkN3EAE",
            "text": "After a few year living around the corner finally got a chance to visit Glasserie. Oh boy what an Amazing experience. As soon as we arrived we were met with top notch service. Rachel made us welcome beyond expectations. I will be back and…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNZzVtVzB3RRAB",
            "text": "Nice brunch spot at the far end of greenpoint. Mediterranean food. Think hummus and falafel. But fancier. Very tasty food. Lots of small plates for sharing. My lamb main dish was excellent. Different flavors, but all good. They make a nice spicy bloody too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOFphMHVBRRAB",
            "text": "A very good Israeli/ Middle Eastern restaurant. Everything we tried was good, except for the falafel that was a bit dry. I think the falafel balls are too big so the ratio between the outside crunch and the inside was skewed. Service was friendly and attentive but pretty slow."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5anZxRjVRRRAB",
            "text": "Overpriced and super pretentious with underwhelming flavors. Not worth it. The Shakshuka had no flavors at all, I’ve definitely had better before. Their coffee is disgusting: friendly staff even though I had to beg for milk and sugar on my coffee to the wait staff: also, not the best place to have a large party baby shower, totally broke the ambiance. Great wine list and yummy maple blaklava. Bathroom smells good, so yeah come for all of those three but not the coffee or food. Also super hot long dark hair busboy, would come back for that as well! 🤦🏽‍♀️🤡🤪"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOHFqNlZREAE",
            "text": "Wonderful meal! Pita and hummus were other worldly. Wait staff seemed a little stretched thin but had a wonderful demeanor and attitude. Ordered lamb shawarma and the skewers. Beef roll up skewers were my absolute favorite part of the meal. Would pass on the halloumi skewer, and I'm a cheese gal. Lighting and seating was well done but I could tell I was screaming at my fellow diners due to the sound. Wonderful night in the city for 4 with a meal and 2 alcoholic beverages and a few sodas (before tip) was about $250."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvNkpQR3BnRRAB",
            "text": "Perfect brunch - 7 delicious mezze at $25, each of them very tasty. Special mention for the pumpkin and marjoram labneh, but the apple and pistachio tabouli was also great. Tap water came often and the service was prompt generally. The setting is immaculately stylish without feeling austere or fussy. Really good all round."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNDZLREZBEAE",
            "text": "I came here with my husband, we loved the atmosphere and candle lit table. The drinks were cute and had good options for both of us, they kindly comped us for the drinks because we waited 30 min for our reservation.\n\nWe ordered the Labneh which came with a flakey bread. Next time I will try the hummus or smoked Eggplant because the labeneh was okay, the flakey bread made up for it. I loved the grilled branzino would definitely have that again, however we were a little disappointed with the chicken was a little dry and but the crumble of what believe was pistachio and touch of lemon was creative.\nNext time we will order a bunch of small plates instead and only one bigger main plate.\n\nLoved this place overall! Will definitely be back for the small plates and atmosphere!\n\nThank you!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMUxiLUlnEAE",
            "text": "Had planned a birthday dinner for a friend and made reservations for 9 pm for table of 5, which we were able to get pretty easily on a Saturday night. The restaurant feels like it's in the middle of nowhere, and there aren't any bars until you hit Manhattan Ave.\n\nThe hostess was friendly and seated us as soon as all of us were there. We ordered a few dipping sauces with bread and food was delicious.\n\nI ordered a Rabbit Salad ($20) which was just ok. At $20 I was expecting it to be packed with flavor, however that wasn't the case.\n\nService was excellent and they have some really nice cocktails. The place is relatively quiet so one can have audible conversations!"
        }
    ],
    "reviews_count": 76
}