{
    "name": "Hole In The Wall",
    "place_id": "ChIJzRBPAz5ZwokRd0AUXGm-2f8",
    "grid": "BK1",
    "address": "292 Bedford Ave, Brooklyn, NY 11249, USA",
    "rating": 4.8,
    "user_ratings_total": 3180,
    "phone_number": "(929) 295-8361",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OZlJXcEtORjlpZFc1clZIVlNOSFJHWkMwMWVFRRAB",
            "text": "food was wonderful. would go here again"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrdFJGQnhSVWsyY0ZrMVdGQlhYMFZIVkV4RFFVRRAB",
            "text": "Fantastic in every way! Loved it!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNFZGOVZlWGcyYkdOYVZFMDFTREpMZFc1Qk4xRRAB",
            "text": "I don’t usually write reviews, but honestly the staff here is very disrespectful. I came in just for a quick drink, sat at the bar, and waited 10 minutes  no one even looked my way. The place wasn’t full, but the bartender and staff were too busy chatting among themselves. Just want the owner/manager to know this is exactly how you’re losing customers (and money)."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcVNFYzBUWEJUYTBGUFJuVTBibFYwYVdSc01GRRAB",
            "text": "I used to like this place but the staff ruined it… last time we came in staff and bartender in particular was rude. We let it go. Passed by for a drink again tonight, it was quiet night so we said why not we ll give it another chance. Sat on the bar and the bartender looks at us, leaves his bar sits with his friend and leaves us hanging for 10 minutes no one came for an order so we just left. Never coming back again"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMWJHbFlVMDV1YjA1eVNURmljV2N0UVVzeWRYYxAB",
            "text": "Excellent food with great service. Highly recommend!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oc016UXlXWGRoVWtSd1lWUjROemQxY0hOWlZuYxAB",
            "text": "I saw a ton of 5 star reviews so I thought I’d stop in and try a salad. It was just ok. Servers and staff were kind."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRWRqRm9VbDlpU0cxQllYVTRXVUZFY25jdFprRRAB",
            "text": "Extremely mid experience. Started off with walking in and wanting to sit at the bar as a solo diner, was told it was a 45min wait to sit inside. So I said ok I will sit outside wasn't trying to wait, it was a brick and breezy 48 degrees outside. They have a covered eating are hut no heat on it. So while sitting in the cold the staff also doesn't want to be out there so the service suffers intensely. Had to ask for my coffee at brunch 4 times before I wa told they where brewing a new pot and thats why it took so long, all while not bringing a spoon or sugar for the coffee.  I ordered coffee first and got it last. My old fashioned and entree came out so fast as if it was somebody else's order that maybe got ran to me or someone declined it and they just rerouted to me.. either way it came out far to fast. Like under 8mins from ordering fast. Thats not enough time for the eggs to be as over poached as they were. The pulled pork Benedict is a solid dish make no mistake but it really came out way too quick. The old fashioned was good. Overall I think it's a dope concept for a restaurant but the details and execution that makes a restaurant great and repeatable where simply not in action today."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eVpUTXhla2hzTlZGT1J6ZGxZVUZsY25wS2QwRRAB",
            "text": "THE best service from Ross <3"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUlNqUnVkVGxWY0MxVlNsbG5ibDl1WkZsbFduYxAB",
            "text": "Small but interesting menu and a cozy setting. Wasn’t busy on a Thursday morning"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcGFYSmFSazg1YkdZMlNtWlhTMEpNUkRScldYYxAB",
            "text": "Great service!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKV1dVSmxNWHB4YmtOSE5UZGFVbEpvY0c5b1QzYxAB",
            "text": "Very good food, and costumer service"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQldXRkRRbmhRY2xsSlRqSmxMVmhKUkdZd1RHYxAB",
            "text": "Amazing team and SO easy to pay and split bill!! Highly recommend x great happy hour!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdldtTlpPSEpPTWxwSlUwdG9jMEpFVldnME9GRRAB",
            "text": "Service 11/10\nFood 11/10\nDrinks out of this world"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4d1EwZ3RMVGxZVGtWcVJHRlBMVmQ2TVVwb2FGRRAB",
            "text": "Great food, cute vibe, good service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVFkwbENhRFZWYlhGaU5FTXpZbWx4Vm05cGFGRRAB",
            "text": "Do yourself a favor and get the avocado toast!!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SVVtaENSakpIUlhoaVlXTk1PRnBhZVVzdGVXYxAB",
            "text": "Great service"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WU5WVndibkV6ZWpSMmRtNXdlbTFEZEd3NFYzYxAB",
            "text": "I love this place. Definitely coming back"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xneFgxcEtNVUYxUVdWTlpVOU1iM2c1TFd0NlgwRRAB",
            "text": "Great spot. Friendly staff, great food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jM1JsQlZjemRmZW5vMFFWbzRUV2xSUTFod2JVRRAB",
            "text": "Super cute brunch spot! We got here at 9:45 and our food didn't take long at all! Fills up quick so if your coming after 10:00, make a reservation!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTVEyMVROWEZuYkVwV09VMVNaalF5ZDBsMmMxRRAB",
            "text": "Carbonara was great! The corn made it unique."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTVlYQlJkbWd4VmprMVJYZDZVR2g0WmxsblRVRRAB",
            "text": "Too expensive for the tea time"
        },
        {
            "date": "1달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMFgweGxURUpVVjBGRVMzSktlSE5XYUdNeWJWRRAB",
            "text": "오믈렛 보단 파스타가 맛있네요 파스타 추천\n서버 두분 중 한분만 친절했어요"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVFRFNDVNak5pUVhkVE0zTklVSEpJY0VkbFNYYxAB",
            "text": "Really nice atmosphere!  Open and airy with good food and very friendly and excellent people that work here!  I had the smash burger which was awesome!  The food comes very quickly and is presented really well!  The gentleman that took care of us ruled and we will definitely come back!  Hope to try some of the other items on the menu!  Also, the bathroom is super clean and really well done.  If you’re in the area try this spot out for a casual meal, you won’t regret it!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WM2NreDJSbmMwVTJzMWFtRkRaVzV1TkdGSllrRRAB",
            "text": "What a cute place! I couldn’t decide between a few menu items as they all sounded so good, but decided on the pulled pork eggs Benny. SOOOO goood!! You should definitely check this place out and order the pulled pork eggs Benny. Had a great chat with the bartender as well."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeVJtSlVTVXhyVWkwelJuQlZXV2RUU1RWNVkyYxAB",
            "text": "The staff was quite welcoming and attentive. The dining area was partially filled with locals.\nWe shared two breakfast dishes, the salmon toast and the mushroom toast.\n\nThe Salmon toast was overseasoned due to all of the salty elements. It was also garnished with thinly sliced red Chile peppers. The poached egg was perfect. The bread was artisonal and freshly baked.\n\nThe mushroom toast was nearly perfect, albeit a bit more expensive than it should have been. The poached egg and bread were both nearly perfect.\n\nConsidering the fact that the dining areas were no where near capacity, it makes no sense that both orders were served on chipped dishes/bowls.\n\nTwo drip coffees with half and half were ordered. Unfortunately, they were both bitter and mediocre at best.\n\nI also didn't appreciate seeing that the floor under my chair was littered with food from the previous customer.\n\nThe menu has promise. Unfortunately,  the execution was not up to par."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoV05IVnRVbGN0WkVWcVNtcGFSbkV3TmtzemVrRRAB",
            "text": "I was pleasantly surprised by the sizes of the dishes. I didn’t expect generous portions since the prices are quite reasonable. However, I wish the bread wasn’t so dry. It would be better if it was slightly soaked in some kind of dip. Overall, it was a really pleasant experience and food is really tasty."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMWVGcEtPVzVXV2s1SE9HaFBSbE00UkdkQmJtYxAB",
            "text": "Lovely place to have a nice meal. Went with the kids and they prepped the carbonara on two plates for them, which was just the right amount. Have a cocktail, they were great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocVMwcHROVUpaWkdoTmVFZFJlbEI1YzFCS0xVRRAB",
            "text": "Food was really delicious. Tasted very fresh and our waiter was very accommodating. We didn't feel rushed, we were taken care of and enjoyed a nice brunch. We sat outside which was nice because it was quite loud inside"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eVgxZE9URWxzT0hGdVRGZFRaVlJGZVRRNVVXYxAB",
            "text": "Excellent brunch food. Staff couldn’t care less. Highly recommend coming here for the food, everything seems to be outstanding. The staff barely manages to squeeze out a smile once you’re about to pay $$$. Otherwise, they can’t be bothered to check whether there’s a free table if you come without reservation (seated at a bar although there were at least four free tables for over an hour when we were there and we asked twice to get a simple „no“)."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGT09VMVhTSEpoU0dWMFRIQTRkekZvZUcxWlZuYxAB",
            "text": "Came in at around 10am and it had a good amount of tables available so it was pretty chill. I got the Pork Benny and it was great! A perfect amount for brunch. And service was pretty fast! I’d love to try their avo toast next time! Thank you guys!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBelFrRjVWVEF3TWtGTk16VkJRMUp1VUdkWWFYYxAB",
            "text": "The breakfast here is amazing. During our stay we tried to go this place as much as we could, because it is just so good. We had the granola bowl and the avocado toast a couple of times, each time the food was delicious, the staff was friendly and all in all it was a good Experience! I highly recommend this place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMVZqTjJTRFZRZERGMlNXSnZiRmRzTVVKWVRuYxAB",
            "text": "Grabbed a quick bite at hole in the wall.  The menu was pretty simple.  They have indoor and outdoor seating. We chose to sit outside.\nNoticed you can make reservations ahead of time as some tables were already reserved.  The waiter was very helpful in suggesting drinks.  The food came pretty quickly.  We had egg, hash brown and cheese sandwiches with fries.  It was pretty good and light if that makes sense.  I’ve had other egg sandwiches that made you feel stuffed but for some reason the buns were fresh and light.  I definitely want to come back and try other things on the menu.  You scan the QR code to pay. Super quick and efficient.  Overall great place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNVJsazJiRXRLWlU0eGVVdFpMWGh5ZVY5VFExRRAB",
            "text": "Here 6/29/25 and had brunch. We were a party of 3 and Katie was our server. She was professional kind and really pleasant. We ordered the waffle, pork Benedict and avacado toast. Everyone enjoyed their food. The atmosphere was casual Brooklyn and it was a great option. Make reservations since they take them and we wanted inside so glad we booked in advance."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMVoxRnVUMDlqVTFKb1IyUndOMk4xUVhCVmNFRRAB",
            "text": "Solid brunch spot with good atmosphere and quick service. The service was friendly and they always refill the water quickly. I like how more restaurants let you pay the bill on your phone as well instead of waiting and asking for the check.\n\nI got the pork Benedict which was pretty solid but overly salty towards the end of the meal. I did enjoy the pieces of dill which gave a different flavor profile from the pork and egg."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Q2IwMHlNVTltUTFrMldIbHNibkpQYmxKQlkwRRAB",
            "text": "Loved half off wine Wednesday! The food was delish and i loved the vibes.\nI will def be back another day."
        },
        {
            "date": "3주 전",
            "language": "tr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWVZWSnFOMVJTYVRoSlNIaDBZMGhNYW05RmVGRRAB",
            "text": "Bedford ‘da yürürken dikkatimizi çeken restoran. Ortam ve kokteyller çok iyi. Menü değişmiş vejeteryan seçeneği az olsa da burrita salata iyiydi. Hamburgeri de bizim için veggie hazırladılar."
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTU5FNDRTVmRxVEdveVQzUklhRlpJZERaSmJVRRAB",
            "text": "Un super restaurant à Williamsburg ! L’ambiance est chaleureuse et conviviale, on s’y sent tout de suite bien. Les serveuses sont hyper accueillantes, souriantes et vraiment très gentilles, ce qui rend l’expérience encore plus agréable. Les plats sont délicieux, bien présentés et de qualité. On passe un excellent moment du début à la fin. Franchement, je recommande à 200% !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VONlZ2UEw2ajhuS3R3RRAB",
            "text": "Dinner menu and vibes is 👍🏼 👍🏼 but best part of my experience was our server Mira. She was super energetic and engaging throughout my whole time there but the kicker is she is from same country and same province as I. She is a great member for Hole in the wall and they’re so fortunate to have her.\n\nWithout saying I will be back sooner than later."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRFNsazBSbEJCYVcxbFNHOUxVRFZsUVVJM1lrRRAB",
            "text": "I ordered the salmon, and my bf ordered the burger. We got the flight drinks, and it was okay. It tasted like a watered-down drink with no alcohol. When our food first came in, a hair ended up on my food, and the salmon was undercooked. The waiter handled it well, but I was hungry and had to wait for my food to be remade. I ordered the truffle fries on the side, which are pretty good, since you can't go wrong with fries.\n\nAnyway, even though they tried to remake the food, and the service was not bad, I don't know if I would return anytime soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWFlWVjVRa1ZxUzBwZlp6bEtkekF0YVhkQ1RrRRAB",
            "text": "We came here twice during our holiday. We had the quinoa bowl and coffee and iced matcha latte. Everything - special the bowl- was delicious. Good spot to sit outside and watch the streetlife…. Definitely recommend this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eFVXeHRXbWhOZWtkNFQwTjNORWhFUlZsc1prRRAB",
            "text": "Friendly staff, gorgeous food, everything was special. The pulled pork benedict was glorious, savory, eggy magic. Even the gluten free bread was full sized & soft & yum. Shared with a friend which was my only regret - you’ll want the whole thing! Date or friend outing friendly. The interior has a lovely vintage atmosphere; there’s also shaded outdoor seating for people watching."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLamdsc2FidUl1RTVRRRAB",
            "text": "We visited this place for brunch. Although it was cold and rainy in May, we sat outside. They have a shaded outdoor area on the street. Indoors, the restaurant is busy, cozy and spacious. The service was timely and courteous. The Greened Out Smoothie was tasty, but could use a sweetener. The kimchi Scramble was interesting, but a bit dry because I opted out of the sambal emulsion. If you enjoy some spice, then I am sure the scramble would taste better with the emulsion."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNQ2hucTY3OTZhQlB3EAE",
            "text": "We were looking for a brunch spot that was dog friendly and came across this restaurant. Not only is the food good, they also have indoor and outdoor seating. They even provided our puppy with a bowl of water as we sat at our table. Highly recommend this place if you’re in Williamsburg and want to have a nice brunch you can bring your pup to."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMUlmdm53RRAB",
            "text": "This was my first visit here, and funny enough, it’s a spot I pass by all the time! I had no idea what was tucked away there. Definitely a hidden gem. The vibe is super cool, and the menu is surprisingly versatile—perfect for any time of day. It’s a great spot for a group outing since there’s something for everyone. I really hope more people check it out!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKTGlzSzc1c3BLbW1BRRAB",
            "text": "We came here to celebrate my sister's graduation. Abby the waiter was sweet and nice to all of us. She made us feel welcomed and made our experience great."
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNFdtOXZSMVEzU2poSlVsTlJXbUo0YnpNMGVrRRAB",
            "text": "Petit dej copieux, savoureux et original dans un cadre agréable et chill.\nLes serveurs sont attentionnés et souriants.\nBref, de quoi attaquer la journée comme il faut."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xR2IzRTJVbEJRWlRGdlZFRTVaR001TFhwdFJtYxAB",
            "text": "Had the cheddar omelette and then added some bacon and hash browns!\n\nThe omelette was great, maybe could have used more cheese, but overall great food!\n\nPricing wasn’t bad either.\n\nService was great! Very friendly and didn’t feel rushed either!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSeGFHeHNRVmR4ZFVKVFdqTmZiVUprT0VkVGVsRRAB",
            "text": "Fantastic brunch spot! We split the steak & eggs + kimchi scrambled eggs, couldn’t imagine a better meal in terms of vibrant flavor, heartiness, and nourishment. Would return in a heartbeat whenever in the area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQTFBfZkxla2ZENUJnEAE",
            "text": "The wait was a bit long because we did not make a reservation. However, it was worth the wait. Our waitress was Katy. L was very pleasant and took care of our table attentively and answered all of our questions. I would recommend this restaurant for a late brunch early dinner."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ2pwNV9yN0xUZGlRRRAB",
            "text": "Made a reservation for 11:15 on a Saturday and good thing I did because if not it would be a 45 minute wait. Ordered the chicken sando and the hash brown egg bacon sandwich (too much bread to filling ratio) the fries were seasoned excellently!!! My friend got the green smoothie and said it was meh because it was warm. Overall great brunch spot in Williamsburg"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5a1MxaExPRkpHVkdWcE9YZ3RVVjk1YVdvemNrRRAB",
            "text": "Overall, the food was average. The bowl was a big letdown. Usually, bowls come with the veggies and toppings arranged on top, but this one was basically just quinoa. The menu listed sweet yam, broccolini, seeds, and other ingredients, but if you look at the photo, you’ll see what I mean. the flavor was there, but I ordered a bowl, not a bowl of quinoa. I tried my friend’s burger too and it was fine, but nothing memorable. On the bright side, the service was great and the espresso martinis were excellent. Not sure if it was worth $60 the bowl and a drink."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWlRFRTBkSGxtYUZJM1lYaFRVbkJCU2xOdVRGRRAB",
            "text": "Went on a Monday. Was pretty dead, sat at the bar. The bar tender probably could have checked in on me more but I was patient. Burger was SO good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aYVNsOUZPRTQ0UWxoSmFYbFhUMFZPYkZscVlrRRAB",
            "text": "Love this place! Came with a friend after church and so worth it. She had the pork Benedict, I had the breakfast burrito 🤤...and we shared the dulce de leche waffles. In love, 10/10 will be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQWG05NXZxcUxLVDNnRRAB",
            "text": "Mariana was a wonderful waitress, and the food here is delicious. I visited for brunch. Will definitely return. Xoxo\n\nCream cheese waffles, shrimp rigatoni pasta. Will for sure order again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMDgzRHdBRRAB",
            "text": "Had an incredible meal at Hole in the Wall in Williamsburg! The burger was perfectly cooked, juicy, and packed with flavor—definitely one of the best I’ve had in a while. The Brussels sprouts were next-level, crispy and bursting with a delicious balance of sweet and savory.\n\nAnd let’s talk about the Getting Wet cocktail—dangerously good! Smooth, refreshing, and just the right kick to round out the meal. Highly recommend this spot for amazing food, great vibes, and a killer cocktail list."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMcWV1SXZWNGJHU3NnRRAB",
            "text": "Big Cheezy Burger was tasty but not $20 dollars worth of tasty. The Tom Cooler was also quite refreshing. Very pleasant atmosphere and friendly waitstaff. They use uncomfortable small metal chairs that seem to be the style right now which is unfortunate because it discouraged me from staying longer. In typical NYC fashion this place was charming and adequate, but not worth the price."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdGQxcG9jV2w1YkdZdFdHWkdSV3MzVlhsd2JrRRAB",
            "text": "I clearly asked for a brekkie roll with no bacon because I don’t eat bacon for personal reasons, and they still added it. When I brought it up, no one apologized, offered to remake the order, or even tried to make things right. It felt like my request was completely ignored. I shouldn’t have to double-check or feel uncomfortable about something that should’ve been respected from the start. Extremely disappointing service — especially when it comes to something as simple and important as honoring a dietary preference."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObFJtSllSR3RwVGtsSFVpMHdNREZXUlVOVFVuYxAB",
            "text": "Left disappointed. I wanted to like this place, but my experience here just wasn’t great. The host was rude and had an attitude. Even though I had a reservation, he refused to seat me because my friend -who was running really late hadn’t arrived yet. I explained the situation, but he just shrugged. No offer to help, no suggestion to wait at the bar. Honestly at that point, I probably should’ve just left.\nI decided to give this place a chance and try their food, so I found a seat at the bar on my own and got the blistered brussels sprouts. It was way too crispy and overcooked, I couldn’t eat it.\nA little more flexibility and hospitality would’ve gone a long way."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYUw2NjIyNnEzdzFBRRAB",
            "text": "Sat outside in the rain but it was fun! Great service and food. We had the avocado toast and smoked salmon. Great vibe here too!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCblFWQnJPVTAwWVhSM2VVZGhWMlYyYkZSU05WRRAB",
            "text": "Quaint little brunch place with classic breakfast options. The one thing I noticed was that the food came out extremely fast! But it tasted good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eFRFdzBYM2hpVUVORGJFUm9ZbFJEWjJwaVRWRRAB",
            "text": "I’ve visited Hole in the Wall in Williamsburg twice now, and unfortunately, the inconsistency in food quality has been disappointing.\n\nThe first time I went about a month ago, some dishes were decent like the Brussels sprouts, which were flavorful, whole, and perfectly roasted. However, the ribeye steak I ordered with fingerling potatoes and broccolini was a letdown. It was bland, looked cheap, and lacked any real seasoning.\n\nI gave it another try yesterday and was really hoping for a better experience. I ordered the blister sauce Brussels sprouts again, but this time they were bitter, over-fried, and some of the leaves were burnt completely different from the first time. I also ordered the chicken parm, and it was so salty I couldn’t even eat more than a few bites.\n\nUnfortunately, the inconsistency in the food makes it hard to recommend. The service and atmosphere were decent both times, but the food just didn’t deliver."
        },
        {
            "date": "2달 전",
            "language": "el",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaFZHVlZkRzVTYjNWemRqUkxTSHA0ZVc4elRWRRAB",
            "text": "Πολύ ωραίος χώρος, άψογη εξυπηρέτηση. Το φαγητό είναι πολύ καλό. Τα απογεύματα έχει Happy hour και όλα τα φαγητά και ποτά μπορείς να τα δοκιμάσεις σε εξαιρετικές τιμές."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNNmN6ZHo5Mkk3Vzd3RRAB",
            "text": "very cute corner restaurant with beautiful decor and lush plants everywhere.\n\ni ordered a matcha latte and their HITW breakfast burrito and my friend got a cheese burger. friend said the burger was good! my burrito was less good :/ i can't quite put my finger on it but something abt the chimichurri was off, and the bacon was cut thick and difficult to bite through.\n\nour server was very nice, and brought our food out soon after we had ordered.\n\noverall, i think i'd go back? i'd probably order something different though 😅"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJMkJ5OG1mMVB6ZDRBRRAB",
            "text": "Amazing service and food. Very relaxing atmosphere, will definitely come back. Perfect brunch place!."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wd01HeFVjWGxWY0hVeFNtZFJZMVJ5TjNBNFZVRRAB",
            "text": "First time in NY and finding this amazing breakfast place in Brooklyn. Amazing food and gluten free options as well! I even came back for a second round before leaving the city."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnc29TYnlRRRAB",
            "text": "Fist time here! So happy we stopped in. The food was surprisingly good. Obviously a chef back there. I ordered the OG burger was blown away by the quality and flavor."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205ZlpIZHFhemQ2VVRoMGJYZG9UbmhMZEhONlpWRRAB",
            "text": "One of my favorite spots! The food is always delicious and Kevin is the best. Come for breakfast, lunch, or dinner. You won’t be disappointed!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKcE1sSkhNVzVZY2tKUmFtY3dSbUp6Tkc5elVrRRAB",
            "text": "Nice brunch/lunch place.  Decent prices. Pleasant.  Quinoa mushroom power bowl fresh and tasty. Great fries.  Good Caesar salad. All in all a nice place to stop for lunch.\n\nEdit:removed a star when I saw my bill from paying at table with QR code.  Hidden service charge for using Sunday.  Hate that."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZko1YWVlNGRySGpnRRAB",
            "text": "Absolutely incredible. For the gluten free folks, their GF bread is the best ever. I got the avocado toast and it was amazing!!! The service is fantastic, ambiance is on point, and the food is great. Sad it took me so long to finally go but glad I made it!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dHVqWmFREAE",
            "text": "Lively vibe and good service.\nThis is a busy joint and reservations definitely recommended for weekend brunch.\nWe love it that they use sourdough toasts and my Kimchee Scramble was really good. I also like the Nutella Mocha."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNFBlRzVnRRAB",
            "text": "Super cute and delicious spot for a Saturday brunch! The food was amaaazing! Highly recommend the spicy shrimp vodka rigatoni (just the right amount of heat🤤) and pulled pork Benedict (sooo decadent)! Friendly and kind staff and a sweet, cozy vibe!✨"
        }
    ],
    "reviews_count": 71
}