{
    "name": "Frijoleros",
    "place_id": "ChIJl-SePCBZwokR4TtitxjHUbs",
    "grid": "BK1",
    "address": "131 Greenpoint Ave, Brooklyn, NY 11222, USA",
    "rating": 4.9,
    "user_ratings_total": 62,
    "phone_number": "(347) 384-2957",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MFJsZHNkbEI0TlRCSmVUTklVbkY0YkhVek9WRRAB",
            "text": "Every dish was delicious, the drinks were smart and unique and I'm already looking for an excuse to come back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTVNubERlVlJmWm5jd1UyUlJkbWxzYm1SUVEzYxAB",
            "text": "Fantastic restaurant! Came for brunch and the chilaquiles and pancakes were both incredible. Awesome ambiance and staff, everything we had was incredibly tasty!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMFgxRjVURWhVY2xJNWNrSnpSRm94ZUVod2QwRRAB",
            "text": "How do you describe perfection because that is what this inventive welcoming restaurant is. An impromptu night out for dinner in greenpoint found me at this pure gem. Reservations were booked, so I ended up at the bar where the bartender made me feel more than welcome. It was truly a pleasure to see him carefully create inventive well balanced cocktails and go out of his way to make sure my dining experience was pleasurable with wonderful recommendations. I started with the tomate salad. I’ll admit I’m not a salad person, but I never realized a salad could taste this delicious perfectly seasoned and dressed. I almost overlooked it on the menu, but I’m very glad I didn’t. This was followed by the gambas wonderfully spiced and cooked to perfection. All food comes out family style, but I’ll admit I did not really wanna share this one.\nAfter I had a huitlacoche quesadilla that I’m still thinking about hours later. And I finished with the mole Blanco.\nI do feel bad that my dining partner had to miss out on the hazelnut mole from what I’ve read was quite a taste sensation but I dont eat duck 🤷‍♀️\nDo yourself a favor and visit this culinary gem in Greenpoint.\nI know I will definitely be a repeat customer ."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWWVqaG1OSEZsWDBWVlRrSkpTV2wyVFhSSVRXYxAB",
            "text": "Amazing food and vibes! We stumbled upon this place and were not disappointed. Everything is super tasty and big enough to share. The bartender Jovany was extremely attentive and helpful and gave us a rundown of the menu. Will definitely come back to try more food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNGRYVjFWVTFFT0RCaVJVMHpVMEZVVjBKaVVrRRAB",
            "text": "This spot honestly feels like finding a little piece of Mexico tucked away — super warm, cozy, and family-style vibes from the second you walk in. The food hits all the right notes. You have to try the pulpo and the tuna chicharrón — both were next-level good — and don’t skip the tres leches with pistachio, it’s one of the best I’ve had. Drinks were just as impressive, top-quality across the board. My personal favorites were the gasified paloma (so refreshing) and the Holy Smoke margarita. Definitely one of those places you walk out already planning your next visit."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeWVHOHdkMlZxUWs5VmIxRlhOMVpmZDB4ZmRtYxAB",
            "text": "Frijoleros. Es un lugar incredible 😱😱😱wowwwww, ojalá mucha gente que opina sin saber realmente  el trabajo que hay atrás de una cocina, de una receta, de  la cultura mexicana, te puedo asegurar que cada plato , cada receta, es pensado solo en el cliente sale del alma cada plato . Ojalá mucha gente valorará el trabajo que  se hace al servir cada plato, fijoleros es un lugar donde puedes sentir el gran trabajo  y en cada platillo sientes  la pasión que le ponen. Y les recuerda algunas personas que comentan cosas negativas sobre algún lugar  no importa si es mexicano o italiano o etc.  pienses bien tu comentario por qué tras hay un gran trabajo,  y veas el trabajo , la pasión  que  se pone  en cada plato , en cada bebida 👏👏👏👏 sabiendo que estás en Ny,nada es barato así que felicitaciones a frijoleros por su pasión y gran trabajo que hacen👏👏👏👏👏"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR1gycFJiSFZCY2t0MVZ6WlVRa0k1WlU5bmJXYxAB",
            "text": "Frijoleros is absolutely amazing. The food and drinks are out of this world. It’s the only place in nyc where my girlfriend and I know we will have a great time every time. The owners have managed to create something really special, somewhere with incredible food, fantastic drinks, and amazing ambiance to boot at a ridiculously reasonable price. Give Frijoleros a try, and there’s a strong chance you’ll be raving about it too 😉"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oa1MwUlRZVWgwWDNaR1RsVjNXSEpvU2toclgwRRAB",
            "text": "Absolutely love this place!\n\nFirst of all Fabiola is a magician when it comes to cocktails. She’s made the menus at countless other successful bars and now that she has her own place the food menu is amazing to boot! If you don’t already know her, you have to come here and see for yourself (we travel in from Crown Heights every time).\n\nSome of my favorite cocktails on her current menu are the Taiyo, Sweet Short Sayings and Tomate o Tomate cause I love gin and a savory cocktail, but you can’t go wrong either way. As for Faby’s food, the octopus is literally the best thing I’ve ever had (we order 2 now every time we go) and the truffle quesadilla and fish tacos are to die for. The steak here too is absolutely delicious and worth every penny.\n\nNow this isn’t just Mexican food or mezcal drinks, Frijoleros is a unique fusion of who Faby is from the amazing ambience to every single item on the menu that she handpicks and designs to create absolute perfection. Faby is a master at what she does, so if you don’t come out here, you’ll definitely regret it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScU4wdEtYMGx1ZGxkNlZXcFJRMDlHVmtVemRsRRAB",
            "text": "Popped in for brunch since Google said they serve chilaquiles. I had that, the hamachi (with strawberries?!? Yum!) and a mezcal pepino.\n\nEverything was really good (including the playlist) and even with one person on service, she never missed a beat. Would certainly come back with friends"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b1N6aHBSV0pZWms1UldWUTFWa3BRT0U1WGNIYxAB",
            "text": "Best cocktails in the city, incredible menu of food. Hard to beat."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WS05sVTRVR2s0ZDNwalgxQjJSVkIxVFdGVWNYYxAB",
            "text": "How how how did this place get such great reviews??!!! I am SO bummed to have gone here for my bday dinner.\n\nDrinks were very good.\n\nSkirt steak for $40 was clearly precooked. Ordered it medium rare came out well well done and cold. Grey pile of mess.\n\nShrimps and clams extremely chewy.\n\nHazelnut Mole had a good sauce but very little duck and it was mostly masa.\n\nGuacamole never came out.\n\nServer never checked on us, asked if we wanted more drinks, etc. Took two hours for three small plates. Server was absent and clueless about hospitality.\n\nWhatever went on at this place tonight truly sucked. 2 cocktails, 1 beer and three small plates were over $100 not including tip."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNFN6ZzBlWGt0U1hSUlMwUlFZVGN6VkdKUFdtYxAB",
            "text": "Favorite new restaurant and now oxomoco is gonna have to kick it in high gear with this spot right across the street. In my opinion this place is better; around a similar price point but bigger portions and more zing. The flavors definitely pack a punch and every dish was unique. My favorite had to be the hazelnut mole. Don’t miss out on this spot. Only thing is the joint was empty…so let’s fix that!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSmFsSldiekk1ZEZoWWQwOHdXakU1UTBaaWRYYxAB",
            "text": "This place is strictly average, except the price point. Bold of them to open a Mexican place across from a Michelin star Mexican restaurant (Oxomoco). Feel like the prices were p similar to Oxomoco so wish I went there instead.\n\nI will say the cocktail I had was p good (clarified Japanese whiskey drink). But the man at the table next to me ordered the same thing and he immediately said it was awful and tasted weird lol so I guess it wasn’t universally liked.\n\nThe best dish by far was the octopus with beans. Very flavorful and spicy.\n\nThe quesadilla de Huitalacoche was pretty bad because they tried to make it some weird fusion dish. Drenched in truffle oil, so much that I felt nauseated. Also since there was so much stuff on it, it was soggy. I made my bf eat the entire thing.\n\nThe tacos also had strange toppings. We got the cecina and placero. Both had carmelized onions on it, which was a weird addition to me but my bf liked that. Also it was topped with the driest French fries I’ve ever eaten.\n\nAlso, I love chile relleno (which was in the placero) but the cheese was hard by the time it got to us so I was disappointed. I’m not sure if that one was left out a while.\n\nBut plus points for having fresh corn tortillas. Not sure how they could have that but completely adulterate classic Mexican food. Some call it creative but it just did not hit"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMGNUTlBSbU5RYVdKVVNqaE1ZVEJPUkVadGRuYxAB",
            "text": "Food is good. Service is slow. All in all is not deserved 5 stars. A bit disappointed about the drink. Don’t order that kombucha it’s worst 🥲"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFd1RUWlFaakpsTlVSelNWTkxNemt6UVVGYVVtYxAB",
            "text": "Not bad but better Mexican spots exist at the same or lesser price point so probably wouldn’t go back unless for a cocktail."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WU1ZtbzVUMHRKVlhkS2JXNXdWVnBJTVZaTmVuYxAB",
            "text": "Great happy hour! Yummy food and drinks at great price."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMVpUazROV1phUjFOaFRHTm5ja2xDYW1sNFFXYxAB",
            "text": "10/10! Will definitely be coming back the food was amazing. The pescadillas and tuna were my favorite. Plus the music was on point! (cumbias and rancheras)"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taZlp5MVlOM0poVFVwTGNuVmtNVmhoWkdKR1dtYxAB",
            "text": "El día de hoy fui con mi pareja a comer a este nuevo sitio la comida estuvo tan reconfortante todo estuvo delcioso , mi novia le encantoran  los cócteles  gracias delicioso"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSlFWbHFaamxGTldacE5uQktkR055Um01blVVRRAB",
            "text": "Delicious drinks & great service. The staff was very accommodating, the Mero Mole was my absolute favorite drink! We are coming back to try the food ☺️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scVVWZGxSVzFNZVVab1ZsUmxOMGw1ZVVSTWMxRRAB",
            "text": "The food is always fresh, flavorful, and satisfying. The burritos are huge, the tacos are packed with flavor, and the salsas are amazing. The staff is friendly and welcoming, making every visit a pleasure. It’s the perfect spot for a casual meal that always hits the mark!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaVRrbE1aMUp3VFV0RFREa3lNM1Z5VkZWamQzYxAB",
            "text": "Unique and tasty dishes paired with excellent service-what more can I ask for? Bartenders are friendly and make delicious cocktails.  Tasteful decor and great atmosphere.  10/10!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVlpVczFVMnhQUTNwbFNsaFBMV1ZLTjA5bk5XYxAB",
            "text": "Amazing delicious food. Like next level. Beautifully crafted cocktails. Wonderful staff. Everything I tried I was like thinking “what the dang frickin heck this is slamming”. Must try."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOd1kzaE1UekJRV1ZoR1RYZFlkM2cwZW1SdWFGRRAB",
            "text": "The food was PHENOMENAL. The drinks? Even better. The ambiance, vibe, architecture and the service were all wonderful. I asked a million questions about the menu items and I was met with patience and kindness. Brooklyn got themselves another neighborhood gem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUVUxOVdhRXRXVUV0R1Vta3lSV0Z0YURsRk9YYxAB",
            "text": "We absolutely had an amazing time here again. This was the second time I came, this time with some family. They all loved everything and we will back soon. The Tres leches of Pistachio is  AWESOME! fish tacos, the chicharron and tuna and avocado tostada… I’m forgetting the names of some dishes but We loved all of them. The service is amazing as well 🤩"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VFdXaFBNbXBCV21FMGNrMVVNWFJWUkROMWVGRRAB",
            "text": "Really extensive cocktail list, great food and service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaVVtTmxRMFoxYjA1blNVSmxVRFJaUkV0MmFrRRAB",
            "text": "So delicious !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RVFrTmxkREYwZFRSeVF6QmFPRGhUTW5oWVFrRRAB",
            "text": "Great new addition to the neighborhood! Great staff, delicious cocktails and the food is superb. definitely will be returning soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQ05pMDBPSFZWYUdkR2VFdG9SRTk0TVVkRFpVRRAB",
            "text": "Phenomenal food and staff. Brunch was so good - will definitely come back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoa1lrZzJRbWN3ZDFkemQyUlRlbWQwU1RkaFZtYxAB",
            "text": "Incredible meal!!!! 10/10 recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOT1gwMTJSall3TW5OdldUWTVPVVJaYTFGSUxYYxAB",
            "text": "We were thrilled to see a new restaurant with good cocktails and food options open in Greenpoint. In just a few weeks, Frijoleros has updated/expanded their menu, both cocktails and food, and it’s quickly becoming one of our go-to spots. The cecina tacos and truffle quesadilla are highlights but their new gorditas are also delicious. They have a really great selection of cocktails, mocktails, and soft drinks and the staff has been very welcoming and helpful with recommendations."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTFlXTmhSemhETlhaNFduZFFUWEpMT0RCelQzYxAB",
            "text": "We have come here twice now in a few weeks. They have struck a nice mix of inventive and traditional with their food and cocktails. So far our favorites are the regular margarita, gambas, gorditos, huitlacoche truffle quesadilla and the duck mole. I haven’t had lengua that tender in the northeast. They seem to be adding to the menu each time. I’m torn between wanting to give a shout out to a great restaurant and keep it is a hidden local secret."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKR01rZHdRbXBNYUVaaGNuTjNOVzFoZUZaUFRuYxAB",
            "text": "The cocktails were interesting, creative, and delicious. Well balanced and expertly crafted. The food was incredible. Probably the best fish tacos I’ve ever had. Also, loved the clams and shrimp app. Super addictive and bright flavors. Our server was knowledgeable and lovely. 10/10. Can’t wait to return!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOd2JHczBWelJ4T1VwNVFsRm1hMkU1TWxaS05HYxAB",
            "text": "Incredible food and cocktails. Gambas were so tasty!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5S2JtaG1PRmw2WkRadWNHMWtSRUZKTmpsQ1dIYxAB",
            "text": "Amazing! Get the fish taco!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaU1ZESm9lRWRUVDJ4V2JtcHlXVmgwUWsxemFIYxAB",
            "text": "Frijoleros is an amazing addition to the neighborhood! Cocktails are out of this world, food’s delicious, and service is magical!! So happy they’re in Greenpoint!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNFp5MWtTRlZmVnpGUE0zQjJXVVZRTXkwM2RsRRAB",
            "text": "Really great authentic food. Delicious flavors and a wide menu. The mole amarillo chicken quesadillas were amazing, as were the chilaquiles. Looking forward to coming back for dinner soon!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbE9VSXRSRlpQZWxCUVN5MDJaazh3VkUxdFIwRRAB",
            "text": "Excelente lugar para disfrutar de deliciosa comida mexicana. Es mi tercera vez que vengo en menos de una semana. De mis lugares nuevos favoritos sin duda.\nSúper recomiendo: Los chilaquiles, las enchiladas, todos los tacos !!!! Y las memelas, increíble todo 😍\nGracias a Liz y Faby por su hospitalidad!\nTienen happy hour de 12-6\nLa michelada, la margarita de pepino y la Paloma están delis!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaelFVaHVjalZNUlhkMFVVZHpibGxtVDBWUE1tYxAB",
            "text": "The food is absolutely amazing. One of the best tacos I’ve ever had, they take it to a next level. Their whole menu is insane, everything I’ve tried is incredible. The drinks are also delicious. Liz is always so welcoming and sweet!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMVdGY3RUVk5DVm10d2FVVTRhVFJ5Y2xoVVRGRRAB",
            "text": "New spot in Greenpoint with a great happy hour and good food! Don’t miss it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdE1EVnBPVlZ2WVVkWk0wOVJkR2hmZFV4eFMwRRAB",
            "text": "This is such a cute place. Love the aesthetic of the bar. We tried the mushroom truffle quesadilla, clam and shrimp cocktail, memelas, tacos placeros and omgggg the pistachios tres leche?!?! Wow wow wow. The food was delicious the service and drinks were exceptional as well. Definitely recommend!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSV1NrSk1ObFZIUkc1bVMzSnFUbkpWVVVkYVdWRRAB",
            "text": "Really good food, beautiful space, and really nice people :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nM1ZVdFpaVjlyWjI1WWQybDBRMVZTVlVWV09HYxAB",
            "text": "The cocktails are creative and as delicious as they sound in the descriptions, and they have some of the best corn tortillas I’ve had so far in NYC (they are made in-house). Staff is passionate and knowledgeable about the inspirations behind the items that make up the menu. Other things of note: Great happy hour program; bar, table and patio seating available."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbVJtdDFhMHh3VFhGT1FuVlJTME5JYWpSRlozYxAB",
            "text": "I tried almost everything on the menu, and every dish was delicious (Been there 3 times in 2 weeks). The drinks are great! Also had a few different ones. The bartenders and servers are so nice and welcomey you don't wanna leave. Definitely a great addition to Greenpoint. Instant favorite."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMVVIRnJUVEZmWkRKd1FtaGZOa3hwV25VdGRXYxAB",
            "text": "Everything is great!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMWNXNWhhRTVPZW1VMFptWjBOSEYzVEdwSVluYxAB",
            "text": "Great spot, cool decoration,\n🔥 music, polite service, excellent crafted cocktails,\nand yummy/fresh food 🤤"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCamNrUlRialJFYmpGTWJYWTNiVXR2TTBzd1FtYxAB",
            "text": "We discovered Frijoleros on Eater and decided to give it a try. The restaurant its clean, the service its great, our server was attentive, food and coctails are great. The drinks Señorita Jerez, Pepino, Fine Snap and Bonni & Clyde, are awesome! Also the food menu is a perfect combination of flavors. The Tuna, Shrimp & Clams, Hamachi Aguachile, Quesadilla de Trufas and the Tacos de Cecina, are delicious! We are coming back soon!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeGFsZDRTMDA1UTBGcmRucGtZbXh5YVdkS2RHYxAB",
            "text": "The food and drinks are absolutely fantastic! Such a great vibe, will be coming back again!"
        }
    ],
    "reviews_count": 47
}