{
    "name": "Greenpoint Fish & Lobster Co.",
    "place_id": "ChIJYVSQlUVZwokR3YMbMiZwhzE",
    "grid": "BK1",
    "address": "114 Nassau Ave, Brooklyn, NY 11222, USA",
    "rating": 4.5,
    "user_ratings_total": 944,
    "phone_number": "(718) 313-1913",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZdFEwa3pUazUwV2s5Q2QwRm1lVmx1TjFBNE1tYxAB",
            "text": "Great spot for some oysters"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNE5tSm5lRlI2U1RGUVJUZHNOVU56VkdNNWMyYxAB",
            "text": "My only complaint is that the portions are far too small for the price. If I order fish and chips, I want to eat more than 2 smallish pieces of fish.\n\nThat said, everything was great. The curry mussels were especially delicious and I commend them on cleaning the mussels. I didnt get a single grain of sand."
        },
        {
            "date": "1주 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbk1sOU9hbkJmVFVSRU5UUjFjbUZ5TWxwV2RWRRAB",
            "text": "O lobster roll faz jus à fama, muito bom! Também pedimos razor clams, que estavam uma delícia, e o tuna toast, perfeito! Só é um pouco caro, mas vale o gasto."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNE9YVnFibDlPUVZJMFdsVnhURU5vU2podlEyYxAB",
            "text": "This place taught me I prefer a warm lobster roll"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSlJGWmZkMU55ZUY5MGNWcHNORFozV2kxWFJYYxAB",
            "text": "I was visiting from Washington DC, they had the best seafood I've had in years. The scallops, words can't express, I had two orders. The fish, shrimp, lobster bisque, oysters, everything was simply wonderful and delicious. If you want seafood this is the place to go. I'm going back to NY just to dine there again."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVVdXaElNblZMWjNSclJGbDJSa294YWkxME1FRRAB",
            "text": "A craving for fish and chips hit us while walking through Williamsburg, and we wandered into Greenpoint Fish & Lobster Company. It turned out to be one of the best meals we’ve had in ages.\n\nPaige, our waitress, was cheerful, attentive, and genuinely warm.\n\nThe fries deserve their own review—piping hot, perfectly crisp, dangerously moreish. We ordered another round.\n\nThe fish flaked apart beautifully, the Thai mussels were plump, the Muscadet chilled just right. We left with a spring in our step.\n\nWe’ll be back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZelpHbGxNV0l4UTFONWVsOXJVbXQ0WkVaM1VGRRAB",
            "text": "Andrés and the other fishmonger helped me decide on some shrimp, wonderful quality and I got a great shrimp stock recipe too :) lovely sweet place and ppl"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOM2FGY3dUM3AzY0VKRWR6Rk1NWHBoZW01ME1XYxAB",
            "text": "Do yourself a favor and eat the freshest seafood in town !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSeU9YQXdWWHBDWXpkTVRFSklPSEpzVlVodk9VRRAB",
            "text": "BEST fish tacos I've had in my life (and I've eaten lots of fish tacos)!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaVRXUkJVRnBuY2pKeVEwb3dkakJFZG10dFRFRRAB",
            "text": "The fish here is very fresh, you will not be disappointed!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMFJGOXJXRnBLTWpST04ycHplbUZNVjNKQmJWRRAB",
            "text": "This restaurant exceeded expectations, the ambience and food were very great. All ingredients are very fresh. I highly recommend the oysters and the tuna tostadas, and I would go back to try more things!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSU1VbzRkbmsyYkdWRmVrOTRRbU01TldaeGJsRRAB",
            "text": "Great and creative fish dishes for reasonable prices with a great atmosphere, especially when you can sit outside!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTE9HbGlTamRoZVdWMFJTMW1jMWhCTm1VM2MxRRAB",
            "text": "Just go"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dFNHWXdVV3N6ZUhKR2JISk1aRXhhYW5sdFRYYxAB",
            "text": "Lovely outside seating, the service was on point but more importantly the food was even better. Soft shell crab special as well as the lobster roll were incredibly fresh, and reasonably priced for NYC. Highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKYWJrbElOSEpTTmxwTE5IUjJWVGhsU2swNWNYYxAB",
            "text": "awesome seafood bar with a lot of options"
        },
        {
            "date": "2달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZdGIxUkNWSEJJT0dJelNVRlRTMmRPUVdsamJIYxAB",
            "text": "走过吃过无数龙虾饭店，但这里的龙虾卷和生蚝做的非常地道，向同胞们推荐"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UE9XeHdlR2hZUkRKbk5YRkZXRmxoUkV0b2NIYxAB",
            "text": "Food is pretty good but a little expensive for what you get, and I'm more so talking about the less premium fish dishes they offer. The sashimi isn't good either, so I'd skip altogether."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMlVqRm1TbEZmUVcxUU0xaEVZMk4yZWpjd2VsRRAB",
            "text": "Five stars for the shrimp cocktail. The lobster roll was good, but the shrimp cocktail was the best I ever had."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbU9VUkxZbEZ5ZVU4d1pqbFJUa1kzY1V4VVdWRRAB",
            "text": "Oysters and fried fish were tasty and fresh!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSFZITlZSRk0zVkVsTmVuaFNWa1JxWm5CdVMwRRAB",
            "text": "The minimal selection menu is simple but outdoor seating, the servers kind of forget to check in for water or if a change of an alcoholic upgrade.   Smell of sewer from the vents blow but I recommend eating inside to feel the smell of seafood and watching the food magic is made.(Dinner and a show in 4D)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaYVdGcFJWVm94TUVKNFZUZHRZVGgwTW5ac2IyYxAB",
            "text": "Absolutely loved this place! I tried their amazing oysters, which were from Prince Edward Island and sooo fresh, and lobster roll. Everything amazing! Also loved the place and service. Would come back a thousand times!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbVRsQjFNR2N4ZVdWNWFXRnVSalZrV2s1SmEwRRAB",
            "text": "Pedimos ostras para 3 personas en la Happy Hour que costaban a razón de 2 dólares cada una. Pedimos 3 Lobster roll que nos encantó. Uno con mayonesa y los otros dos con mantequilla. Probé ambos tipos y me quedo, sin duda, con el de mantequilla. Me resultó increíble. Tiene trozos grandes de langosta y está metido en un pan brioche con mantequilla, la mezcla es riquísima. Además acompañan con ensalada o patatas. Muy muy recomendable. El sitio es pequeño."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sYVYybHBOa2hhYVZObVVuaGxUV0pQVGpJNFNIYxAB",
            "text": "Fantastic seafood! The spicy salmon and fish sandwich were outstanding, and the clams were absolutely delicious. The staff was friendly and attentive, making the whole experience even better."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eVRuSktPRk4xWmxaV1RrcHVjMGt6UlVad1EzYxAB",
            "text": "East coast Oysters were super fresh. Loved the steamed whole lobster with drawn butter. Will come back again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbFEyUlpVSFV4U1U5cVlsOU5YM0p5WWxsMVFWRRAB",
            "text": "I ordered the shrimp cocktail with the horseradish dip and it was delicious. I also tried the fried breaded dry scallops  which were pretty plump, and the breadcrumbs were nice and crunchy, not greasy. The green salad was not only visually appealing but it had a nice crisp crunch on tasting. My wife enjoyed the raw Prince Edward Island Oysters, and crab cakes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVVNsSnNZV0V3TTI4eVIxOVRZaTFWUlhWdldHYxAB",
            "text": "Pricey but service was amazing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSkxUQnZSRGRGWW5kdmIwczFOV3REVmxGbVEzYxAB",
            "text": "Love the lobster!!\nStaff was great!!  Very attentive and helpful!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210aVFYUmlNWGhOVTBzelJUQnRZVkZCV2xZNVlsRRAB",
            "text": "Perfect little restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUVRuRkpZV1IzVWkwMVNYUkNRVTkyTnpCTlZWRRAB",
            "text": "One of my absolute favorite seafood spots in New York!\nI honestly love this place it’s become a go-to for me and my girlfriend. We came by on a Friday around 5 p.m. and tried all the specials for the day, plus some oysters. Everything was incredible. The seafood here always tastes super fresh and flavorful you can tell they really care about the quality and taste of their dishes.\n\nThe atmosphere is cozy and welcoming, the service is always on point, and the area itself is great to walk around before or after your meal. This spot never disappoints. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdFVHNUhiVmxRWm01TU9EQjRhVFJCYjJwbmVXYxAB",
            "text": "Great fish & lobster place in Greenpoint.\nWe had been looking for just such a restaurant since our favorite, Pearls Oyster Bar, in the Village , closed in the pandemic. I think we found it with this very busy spot in Greenpoint. There are about 4 tables inside, twice as many outside and 5 seats at the bar. We started with New England clam chowder & lobster bisque, both excellent, fresh oysters, 2 lobster rolls (loaded with lobster meat & came with fries or a salad) and tried a crudo sampler, which was the big hit: absolutely delicious! it was 3 types of raw fish with olive oil & salt. Service was well intentioned but a bit slow as the place was packed. We washed it all down with some IPA brews. They also have a small market where you can buy things to take home. (Make sure you make reservations.)"
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSmFrZ3haMms0ZW5SQmFIQkdSemxJUTNnM1JFRRAB",
            "text": "C’est l’endroit où je vais pour acheter du poisson à Greenpoint. Le poisson est très bon, les vendeurs sont très gentil, l’endroit est petit et on peut acheter le poisson à l’entrée et manger sur les tables au fond. Il y a également une petite épicerie"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podlluRkhZMHRFYTBOa1ZrbEZVVmxZV1RCeFIzYxAB",
            "text": "Claire was amazing! She was super knowledgeable about menu items, steered us in the right direction to round out the flavors on our table, & took care of us with a smile on her face. The food is great but the service really pushed it over for us."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkV2RUQk1VMGw2U0Y5MU0ydGxXV3ROYWxwRk4wRRAB",
            "text": "Went on a Friday evening during peak hours with a reservation for 2 at the bar bc Im not a fan of sidewalk dining, and I wanted to ensure that we'd be inside. Hostess was accommodating about seating, thanks!\n\nWe were so so saddened that they were out of the raw scallop by the time we ordered, but the server did a good job of explaining their specials and we ordered the fried scallops instead, which were so tender and juicy they hardly needed dipping sauce! We also had the fish crudo, east coast oysters, mussels, and the lemon caper broil. All was so fresh and delicious. I really appreciated the light and complimentary sauces/seasonings that allowed the seafood to shine through. We topped off our meal with a cute little key lime pie 🍋‍🟩\n\nPricing was honestly very fair for the quality. The workers were efficient, sanitary, and friendly. The vibe inside the restaurant is well curated but not too intense or kitschy. We will definitely be returning!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5d2QyRkJORmxoVERWUlNtSkNha1JJYUMwek1uYxAB",
            "text": "Great HH oysters and wine!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSlNua3lMV2g2Ym5CNU9WRlFNVlpDY1RGUFJVRRAB",
            "text": "I don’t usually eat fried fish when dining out. My grandmother set high standards. That said, this place has some excellent fish and chips. Their hot sauce takes it to another level. I’ll definitely be back next time I’m in Brooklyn."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPaUFzTjJ4b0xUdVlnEAE",
            "text": "Unbelievably delicious. Get the soft shell crab if they have it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeWNYaHFiR05MWlhNNFZqVnhOMGx3UmpOb01WRRAB",
            "text": "Host scoffed at us for not reserving tables and sat us at the bar. The tables were empty throughout our meal and remained that way after the check."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNWRXOWlTVlZrYVZBeVRHeEZOMVV4VUY5RFYwRRAB",
            "text": "Loved this spot for lunch!\nI had a daily special - soft shell crab sandwich - and it was delicious. Perfectly crispy and soft at the same time. Fries were also great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNFNFVnZWR2R4UWkxRWVuQk9OVWhMVkhRM2IzYxAB",
            "text": "Loved the East coast oysters they had"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1YWFrTm9TMDV3T0VsS1ZqSlZWVU50ZEhJd1VVRRAB",
            "text": "The place is amazing and the food is great, but they really need to check their staff. Most of them are great, but we had a really bad experience with someone that really doesn’t understand the industry she’s working in and has a superiority attitude not suited for a restaurant. All over a mistake made over the post-net that they were not handling correctly. A shame as it’s top food and quality."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RE5rczBRa3MwTWxCclNuUjFNM05NVVdWUFFYYxAB",
            "text": "The best fresh seafood market and grill, a neighborhood institution. Terrific service, shouts to JV"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxR09UUm1ZamRhZGxWMVdHbFFWek5xTWt4WGRFRRAB",
            "text": "wow. just wow. i mean, wow. all i can say is wow. wow."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aZlEzY3RSaTFrUjAwemNuQkdUbU15Ylc4NVlVRRAB",
            "text": "The staff is incredible, the vibe is SUPER high, and the food is even better. Emily rocks, and every other person there I talked to who was working was A+"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQlpuZFlRVEpoUm5kSlgzTnZPVTE1YzBOclprRRAB",
            "text": "Hot lobster roll with butter was excellent!  Fries were good too.  I'll be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CR2EzZEhUbFZXWTNvelpFSXpOSFIyV1dwc1dVRRAB",
            "text": "Been coming here since they opened many moons ago, for both the small market and the excellent kitchen in the back, one of the few places that gets excellent soft shell crab as well as super fresh oysters, daily specials spice up the menu and inviting happy hour specials that run a decent length of time, see y’all soon, great work"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKdXktYXJROC15Nmp3RRAB",
            "text": "Great Fish sandwich and razor clams"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLRFItYnVSZ1lXekNnEAE",
            "text": "Over the weekend, my husband and i went to this restaurant for the first time as I saw it on Google with a high rating of 4.5. I like to share my experience here. The food was generally good but the portion of the dishes did not match the price. I had a lemon caper broil for $26, but the portion was really small from the fish to the brown rice. I am not a big eater but this dish did not fill me up despite we had a cup of soup, half dozen of raw calms, and small size of Caesar salad ($10 in a small rice bowl size). At the end we still felt that we needed one more dish so we order shishito peppers to meet our satisfaction. Finally the waitress who served us was not very warm and friendly, she did come by to ask how we were doing but we felt that she sounded programmed, her tone was emotionless and her greeting was a bit cold and, she was in rush to tell us the special of the night then was hurry to push us to order... in the end i did not think the waitress deserved our 25% tip and we didn't do it. Sorry we will not go back again. It is not worthy for us to pay over $190 for all the small dishes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObXJfX09qN3ZTQ0RBEAE",
            "text": "Great location, Super Friendly Staff. Service is superior. Lots of flavor! Heard the hype about the place. How could you not love this place?"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNN29fLV9NdDVLc0x3EAE",
            "text": "One of the best places I enjoyed on my NY trip!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMWRqM0dREAE",
            "text": "존맛\n가격은 현지 물가 기준으로 해피아워까지 끼면 엄청나게 비싸다는 생각은 들지 않는다\n해피아워 굴이 진짜 최고 이렇게 맛있는 굴을 먹어본적이 언제인가 싶음\n뉴욕에서 만나본 서버중에 제일 친절함\n브루클린 갈 계획이 있는데 해산물 좋아하시면 꼭 한번 가보세요\n\nAs I said, keep up the good work!!!"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaE9laDZBRRAB",
            "text": "홀랍스터 뿌수기가 쉽진 않지만, 정말 신선하고 잘 익힌, 맛있는 랍스터를 먹을 수 있는 곳. 랍스터 분해에 능숙한 사람이 아니라면 랍스터롤을, 능숙하다면 홀랍스터와 분해를 위한 장갑을 요청하세요..!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aE9iSk5BEAE",
            "text": "Sat in outdoor seating yesterday, service was amazing. Our food came out fast and was SO on point. The lobster 🦞 rolls were chunky and buttery. The mussels and oysters also very tasty. Can't wait to go back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMHVDTjd3RRAB",
            "text": "Unfortunately the quality of seafood is not so great especially raw fish. If you expect real sashimi quality, this is not the place for you. Lobster roll is ok, but the price and quality is not matched.\n\nService is ok, but you can tell they care about efficiency not hospitality. Relaxing atmosphere with unstable tables."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzLXV2WXB3RRAB",
            "text": "Been here before and the seafood is always very fresh. This time I wanted to try their lobster roll and it didn't disappoint. I ordered both the Maine (mayo) and Connecticut (butter) lobster roll. Both really good and just depend on preference. As a side I got a salad with one and fries with the other. Salad was very refreshing and fries were exceptional as well. This continue to be my go to place for seafood in NYC."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBczRhNUZ3EAE",
            "text": "Dinner Review: Really good fresh fish dishes obviously. The prices are reasonable for the neighborhood and for what you’re getting.\n\nThe Lemon Caper Broil was pretty good. I didn’t taste too much caper, it was mostly lemon butter sauce over fish and rice. However, it reminded me of fast casual chain “California Fish Grill.” That’s a positive thing.\n\nThe Fish & Chips were fried perfectly. The fries were good. The tartar sauce had a Polish twist, very oniony. Not the best tartar sauce.\n\nThe Green Curry Mussels were delicious and fresh. Everything was great besides the green onions garnish. When was the last time you had a green curry with green onion?\n\nThe Key Lime Pie was amazing. Gotta get that.\n\nGrocery Review: High quality fish at a good price. North Brooklyn doesn’t have too many fish markets, so this one really is the top pick. I would recommend this to anyone who’s trying to get fresh fish or seafood for a nice homemade meal for sure. They also have pretty cheap oysters."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuOC0zc19nRRAB",
            "text": "I visited Greenpoint Fish & Lobster in Brooklyn and had the Lemon Caper Broil (local fillet broiled in lemon caper butter, served over brown rice and parsley), while my friends enjoyed the Lobster Roll. You can see my plate in the photos—it was absolutely delicious! I do wish the portion was a bit bigger, but it was fair for the price. The service was friendly, and overall, it’s a charming spot in brooklyn that's definitely worth a visit."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2al9hSU1REAE",
            "text": "Wow! I had the Tuna-Ham Sandwich and my wife had a Lobster Roll. I never knew cured tuna was a thing! Outstanding, and my wife has swore off \"that food truck\" Lobster Roll after having it here! So fresh and delicious. The Oyster's were great and perfectly shucked... juicy, salty, plump and spot on!\nGreat restaurant and amazing food. Get outta Midtown people and head over here for truly inspired seafood!\nI can't wait to come back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMjc2QmdBRRAB",
            "text": "This restaurant felt cozy and clean. Our server was very friendly and gave us fast service.\nEast Coast oysters were fresh and reasonably priced. Lobster roll was so delicious - mayo was perfectly balanced with big, fresh chunks of lobster. Will definitely come back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfamY3REZnEAE",
            "text": "Visited here on a summer day and had a lovely spread of fresh seafood. Lobster roll is definitely a highlight but the crudos and the oysters shouldn’t be missed as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIemVxejZRRRAB",
            "text": "The perfect place to come for a summertime early dinner. I hit up their happy hour for their oysters and for $2 each they weren’t bad - East Coast from Maine and decently briny. But the star here is their lobster roll and it delivers. Chock full of fresh lobster in butter served on a perfectly toasted brioche bun, it hit the spot! I will return!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ01lYnh3RRAB",
            "text": "I’ve been here a few times and love it more and more with each visit! The seafood is so fresh and tasty and I’m happy to support a business committed to sustainable seafood sourcing. The service is also superb. The outside dining is perfect on a summer evening and the high tops provide a low key intimate setting."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBalAzeTN3RRAB",
            "text": "The seafood material is fresh 👍\nThe chef’s overall taste is very sour.  👎Everything is 20% more sour than it should be: lemonade, fish platter.\nThe host pays a good attention toward regular customers, but almost neglects the new customers. 🤏"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIM2MydnFBRRAB",
            "text": "Came here last week for brunch mistakenly thinking that I would be able to choose my own fish from a fresh selection like at a seafood market, but it was just like any other seafood restaurant where I had to choose from a pre-determined menu. I got the oysters, clam chowder, lobster toll, tacos, shishito peppers, and key lime pie for a party of 2. Ended up barely touching the food because it was so bland. Key lime pie came with a strand of hair straight out of the kitchen so the server had to get us a new one.\n\n1 hr after leaving the restaurant I started to feel sick… and then threw up all the food I had for lunch. I’m not sure what it was that gave me food poisoning but I believe it’s either the clam chowders or the tacos. Never coming back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadmYzMUVREAE",
            "text": "This place is one of my lists of restaurants I want to go. During the day especially, early afternoon was a good time to go without line and craziness. Happy hour is from 12-6PM but for the drinks is only 4PM.\n\nI got 2 glasses of Muscadet, 1/2 dozen of east oysters and 1/2 dozen of clams. Also got cup of small chowder. Food is fresh and service is good. I just wanted to try to get to know if I will bring more friends for fresh seafood. Overall, the place is good and recommended come during the day, not on weekends."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveV9POXVRRRAB",
            "text": "This is a seafood forward restaurant with a fresh fish market in the front of the venue it has bar seating, a few high tops and an outside shed weather permitting The fish  is as fresh as you get in N.Y. Matty our waitress was exceptional she explained all the dishes with a perfect description of all leave room for the Steve’s key lime pie straight from Red hook"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOE1UNERBEAE",
            "text": "Really delicious food! Everything we tasted was delightful. The Brussel sprouts and fish cakes were just incredible. Cute “foodie” atmosphere. Feels like a “if you know you know” type of spot, which is a vibe. We sat at the counter, but there are also high top options, as well as outdoor seating. Service was ok- not super warm, but friendly enough. We waited for quite some time to be greeted and seated by our waitress. But luckily, the employees handling the fish at the front of the shop were friendly and helpful enough to get our waitress’ attention for us after they saw us getting impatient."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKa3ZyME9REAE",
            "text": "Awesome! We had lunch there on a Wednesday so it was not super busy.\n\nOctopus salad was incredible, tuna tostada unique/delicious, and the cod fish cakes were good but not great. The dishes were larger than we expected - we were stuffed when we left. Cheers to the waiter who told us it was happy hour even though it was like 12:30pm and just for being fun. Would 100% recommend for a casual, fresh fish oriented meal. The market looked a bit expensive, and the swag is great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMkxhaG5nRRAB",
            "text": "Cute lil spot with counter seating. Happy hour starts at 12pm for them!!! Good variety of wines and beers. Not much red. A few of the dishes didn’t list what kind of fish they use, like the tacos, sandwich or fish cake. All of the food was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUclltandnRRAB",
            "text": "A must try place, all the food we had was excellent. I recommend the tuna burger in particular. They have “happy hour” all day until 6pm with 2$ oysters and $6 beers and some selected $9 glasses of wine. Its worth coming to greenpoint just to eat here ✅. Only negative is that theres only one bathroom and inside theres only stool seating. No regular tables inside. Outside though they have a ton of regular table seating."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGbTRPQW13RRAB",
            "text": "Recommended in timeout magazine and exceeded expectations. Lobster roll was overflowing with lobster.  The fried fish tacos were equally as amazing with a perfect combo of toppings. We also had  white and rose wine which was on there happy hour for $9 a glass. Great experience watching the chef cook our food too from the table."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aVBLQW5BRRAB",
            "text": "Great seafood spot I came across this weekend. Plenty of outdoor seating, attentive staff, great variety of of fish on the menu. The ceviche and the fish tacos were the standouts, but everything was really good and fresh. And I could eat oysters all day. 🤣"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueXBXb2ZREAE",
            "text": "A perfect choice for a Sunday lunch.  Lobster roll (a standard treat) and fried scallops (a special) were my top of the day. Great seating outside once more. Nice service, but kitchen had some unexpected delay. Will definitely come back again: the fish&chips plate looked great."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN29lSjVnRRAB",
            "text": "Great place for fresh seafood.\nI ordered Lobster Roll and Clam Chowder. All foods are great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLVpQSTJnRRAB",
            "text": "TLDR: this place is great for certain things. Maybe a quick takeout lunch like a lobster roll. I’d stick to the simpler items on the menu.\n\nTried this place for dinner. It started off pretty strong, but by the end we were on the fence about the place.\n\nTo start, there was lots of seating. The we ordered a bunch of items, and they were hit or miss. I would recommend the caesar and the crudo. My husband enjoyed the lobster roll.\n\nWe didnt love the octopus salad or the tacos (spicy, but had no actual taste besides being spicy). The table next to us loved both those items though— just a matter of preference I suppose.\n\nThe reason I am giving it a lower rating is that the food was SO SALTY. We were both up all night as a result of how salty the food was. I’ll also note that there was only one server. And while they were very sweet and nice, they were probably stretched too thin. Very forgetful, inattentive, etc.\n\nI’d go back, but only order the simpler items on the menu next time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaekxtMGxBRRAB",
            "text": "Absolutely amazing, one of our favorite places to visit when in NYC. Been here twice and great service and amazing food each time. The warm lobster roll rivals ones I’ve had in Boston and the oysters and mussels are delicious! Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMnJMWWtRRRAB",
            "text": "My nephews' first time having lobster rolls. They loved it. They especially liked the perfectly toasted buns 🤣\nStaff are nice and friendly."
        }
    ],
    "reviews_count": 76
}