{
    "name": "STOWAWAY",
    "place_id": "ChIJAVpqh6NZwokRJOer8_6ArM0",
    "grid": "BK1",
    "address": "159 Greenpoint Ave, Brooklyn, NY 11222, USA",
    "rating": 4.4,
    "user_ratings_total": 199,
    "phone_number": "(917) 612-3260",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsM09WUXRRVGczTFZsUVUxODFVa0pJU0U1TFEyYxAB",
            "text": "Amazing steak and eggs. Great place and service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWWJreFRlVFo0ZEZCUFlsaFZSekpTY21kRlduYxAB",
            "text": "Searched for the best bloody mary in the area on a Saturday and the googles recommended this little gem.  The regular bloody was amazing with perfect horseradish spice.  Miles the bartender and  all other things, along with our other server, were so welcoming.  Miles was a death metal music aficionado who was a funny kind person. I never give reviews but this place was amazing.  The food was incredible the chef at this place is sooo talented…from the south.  We had his homemade sage breakfast sausage and the salmon/hashbrown dish with a jammy chilled egg and the best relish on it. One of the highlights of our trip to Brooklyn."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONVIxWnRORU5tUTBabmJuSkhVaTFXYlVwcVVGRRAB",
            "text": "This is a really great little spot. It’s one of the only restaurants I’ve tried in the city that can give Bubby’s a run for their money for breakfast. Amazing scratch breakfast cooking, delicious biscuits, pancakes, hand formed sausage patties with the perfect amount of sear/char. Eggs cooked perfectly, I got mine over medium. I love that they do the same”McDonald’s” style hash-browns, perfectly hot snd crispy, perfect for mopping up your eggs or gravy.\n\nIn this day and age, $25 for a breakfast in the city is pretty standard, but this spot is nothing but standard. I’m really glad we found it, we were in the neighborhood and needed a brunch spot close by.\n\nIt’s pretty small inside and probably fits 30 people max. They have a nice bar with brunch, cocktails, and the food came out quick. I like the nautical theme, they had a cool map on the wall that was just NYC waterways. A nice little touch.\n\nWaitstaff friendly and efficient. Will be back for sure."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UFJFdG9kVWxaTFdNMGRYRlRUbWM1WVdkQ1dHYxAB",
            "text": "Best service I’ve had in a long time and the food is always good. Thanks to all the servers on October 5th."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WlVGazFjSEl4UXpseGNsUkZiSFo0WlRCdmRrRRAB",
            "text": "Everything was 10/10. Service, food, atmosphere. This place is the whole package. You can tell that everything on this table was made in house.\n\nPictured: fried chicken thigh biscuit, side hashbrowns and side mushroom gravy. Whole plate pancake (one of the best pancakes I’ve ever had)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTmQzSkdXWFJmUkRoT2NreEtMWFZPVWxabE9FRRAB",
            "text": "Great place with a lot of southern classics! Love the grits and crab roll, as well as the warm and friendly atmosphere"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wa1pIVk5TM2xHWldwbGN6aFZVVUo2ZVdGbFdsRRAB",
            "text": "Such a cozy little spot, the food and drinks were delicious. I order a Fried Chicken Sandwich and for cocktails i order a Palmetto Moon and Calypso."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWmVqWmZZbVJFZVhNMWJWOWpXbFpVZUMxWmRtYxAB",
            "text": "Fresh oysters,  original drinks and great vibes! Loved sitting at the bar Miles and Marisa where super attentive while still totally chill. What a nice reprieve after walking through Brooklyn. If you happen to walk by here I highly recommend stopping by and grabbing a drink."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RVUyUnpRVEZyTm1OcFUwdHJhMlJsWXkxRVNYYxAB",
            "text": "Went here for the first time today everything was amazing from the atmosphere, service, and the taste of food. My only issue was time it took to receive the food …it was well over 40 minutes and the place was dead empty I was surprised. If they can work on that, this is easyly a five star place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tka2QybE9MV05oV2pnek1tTnNNRzVEZDNCV1oxRRAB",
            "text": "Delicious food and very friendly staff😃 Good vibe of this place, the music and a huge portion of your ordered dish can really make your day🙃"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNVduUldMV3R2WDJWTU5DMUpPVlo0WXpKWE5rRRAB",
            "text": "Everytime we come into the city we go here. Friendly staff, chill environment and AMAZING biscuits and gravy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWFZUbDNXVXRTWHpWUk1rRjFTbVJVWkVwV01uYxAB",
            "text": "It was okay! I loved the decor and the homage to NYC. I ordered the bacon egg and cheese on a biscuit. The biscuit was soft, bacon and eggs were perfectly cooked but it lacked overall flavor and touch of salt. Hashbrown was crispy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWmJuWm5VV0ZyV0VKZlRWVTJVa1ZyU2xsS2VsRRAB",
            "text": "Cool space with good happy hour offerings. No AC so it is pretty hot, but hey, $1.50 oysters is awesome."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGR1J6UjJSM3BJTFhWWFZtdHRkVkpmVEhGMVFsRRAB",
            "text": "I stand corrected. I was just there for my second visit and it was really nice. The staff was attentive and kind and warm and the food was good.  I’ll be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKX3h6b1dHM2Y2SnBnRRAB",
            "text": "Very good food the pancakes were excellent. The chicken biscuit was very good  and the blueberry pancakes were delicious."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPWDE0ZHoyajVXbVlnEAE",
            "text": "Chill, intimate spot for a casual breaky. Tables fill up fast. Pro-tip: get in before 11am for a table. Otherwise you’ll be forced to wait for table or hit the limited countertop for the bar. It’s definitely worth the wait for what it’s worth."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOckVqNF9mdDdfaEp3EAE",
            "text": "This place needs Gordon Ramsay"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZi1wcF9DcE9EMW53RRAB",
            "text": "No gatekeeping, Stowaway is my favorite neighborhood breakfast and a great all day cafe. Love the pancakes as big as your head and the egg and cheese biscuits. The best staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQRDI4ZlA0aWJHendBRRAB",
            "text": "Come Stow away, come stow away with me! Couldn’t resist the temptation, but on the real, if you ever find yourself needing to break fast and enjoy a little hole in the wall, a rustic ambiance, and very friendly service, Stowaway serves. Tucked away in Greenpoint, Stowaway came up on a top ten list of places to check out and TikTok hasn’t let me down before. If you’re lucky to get either Miles or Sasha, you’ll be in good hands.\n\nOf course the food served; started off spitting a blueberry pancake (pizza style); perfect size for three. The cake was made fluffy and the blueberry compote had that right amount of warmth and gooey. We each got one of the biscuit sandwiches and they were definitely a several steps up from any that you would get from Fastfood. A soft biscuit, perfect scrambled/runny eggs and a good southern sausage. I took a step further adding a side of remoulade at Mile’s recommendation; 🔥 choice. Also, stacking my hash brown on my sandwich, 👌🏾.\n\nNote, they don’t do reservation but we got there round 11-12pm and they was seating for the three of us, but don’t dally.\n\nAnyway, I’ll have to comeback and try some of their specials of day. The shrimp and grits across another table looked pretty good.\n\nEither way, this is definitely my type of vibe I want as I break fast, so let me stowaway again on my next visit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdXRXYXNRRRAB",
            "text": "Delicious brunch!\nThe shrimp and grits were the most delicious dish I have had in a long time. The mushroom gravy biscuits, cocktails, Farmer's platters etc...were all excellent.\n\nThe venue is tiny, no reservations, but well worth waiting if you can't be seated right away.\n\nDefinitely one of the best brunch spots in NYC.\nIt took us over an hour by subway from Sunset Park, but after complaining for a while, we ended up subdued by the quality of the food and charm of the place. Service was quite friendly too."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvelBYZ3J3RRAB",
            "text": "This place is a hidden gem in Greenpoint. They serve big portions, so come hungry! My favorite thing here is the hush puppies, seriously, so good.\n\nLately, it seems like they’re getting more popular. Every time I visit, it’s a bit packed and there’s usually a long wait for the food. But honestly, it’s worth it. Just know going in that you might have to be patient. If you’re okay with waiting, the food won’t disappoint."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJby1hZC1RRRAB",
            "text": "Loved the vibe and service. And the breakfast looked Instagram stunning - however, the pancakes were completely flavorless, and the fried chicken was totally under seasoned … almost as if the chef doesn’t taste their own dishes. Hard to ruin some of the most tasty comfort foods but they did it somehow. I thought it was just a fluke, but looking back at the reviews, I see a common thread. Great ambience but a total disappointment in terms of flavor. Oh also check out the generic AI response to feedback - about the pancakes that everyone has complained about. If the business actually cared about their customers, they’d be much more responsive."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcVlXYkl3EAE",
            "text": "Service was great, I was surprised to see some of these reviews. Our waiter was super on top of it and food came out quickly, we were seated immediately even on a Sunday at 11:30am.\n\nThe biscuits were delicious, we got it with the jam and with the mushroom gravy. We also got the chicken and pancake combo. Pancake was not my vibe, much thicker and chewier than I was expecting, and the maple syrup tasted like the kind you get in a plastic bottle at the super market rather than real maple syrup like I was hoping for at a place like this. Everything else was great though!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRckpyTFZnEAE",
            "text": "The best southern comfort food in Brooklyn with an elevated flare.  Easily the coziest vibes in Greenpoint."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbk1TWUdBEAE",
            "text": "I hate do this because ive worked in restaurants and understand how challenging it can be to own/operate one and i usually never take the time out to give a bad review BUT i have to say this place was literally terrible. I got a bloody mary that was god awful, thick full of pepper and God knows what else,  my gf got an espresso martini that was not bad, not great but not terrible. The bartender drops the drinks, i have no straw, i ask for one he says o we’re out, we’ve been out of straws for over an hour now. Like yo SOMEBODY GO GET A BOX FROM KEY FOOD ACROSS THE STREET. It was not busy mind you. Then i ordered the hen house breakfast. It was 2 burnt to hell chicken thighs that i could not even cut through w my knife it was so tough and honestly inedible, the pancake was garbage, my gf got the chicken biscuit thing, had no taste, same for my dish. Neither of us finished even half our dishes. And we were really hungry we hadnt eaten all day at 3pm. Then she got their dirty martini w the oyster in it. It was disgusting and we both love dirty martinis. She took a sip, i took a sip, couldnt drink it. They didnt ask o hey hows your drink you want something else? Nope. They just took our half eaten dishes and full glass and charged us $100 plus tax and tip. They all seemed arrogant and like they did NOT want to be there, like they all had better things to do. But yea, place sucks. We only went there cause we were in the neighborhood and the menu looked good. We should have read the reviews first. The 1 and 2 stars AINT LYIN! And the crazy thing is as i read them i see them answering back and like apologizing for the same thing over and over again(bad food/service) youd think they get it by now but to each their own. Its in need of a complete overhaul if they want to survive in this market, brunch competition is stiff out there!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfby1xRXpRRRAB",
            "text": "So good"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmLTVQdmh3RRAB",
            "text": "One of my new favorite breakfast spots! I got the Shoreline and every bit of it was excellent from the eggs to the homemade sausage to the incredible pancake! I will be back real soon to also try their biscuits that look soo good. Highly reccomend this cute cozy spot with good music and good coffee and tea."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2clBLVXdBRRAB",
            "text": "edited rating to reflect the business response, truly wanted to like this place but in every way they disappointed.. right now to their response of criticism. an unexpected soggy salad is still a soggy salad that also made my toast soggy…\n\nTLDR; it looks better than it is, trust me.\n\nFirst, it was so hot and loud upon entering so we were immediately not loving the vibe. We came for sunday brunch and expected a more chill vibe but instead it was hot and blaring rock music - felt more like friday afternoon music and volume.\n\nservice: the guy who sat us turned away and then immediately came back to ask for a drink order, we had barely even sat down so how could we have looked at the menu. my partner ordered a cold brew then since he knew he wanted coffee but then the guy didn’t bring it for at least 10 minutes. Why the rush to ask for a drink order to not even bring it? overall the service was just really lacking — missing that southern hospitality i’d expect from a place boasting that they’re southern.\n\nI was hopeful that the food would make things better but it was beyond disappointing, which shouldn’t have been surprising as i grew up in the south and southern food outside of the south is rarely ever good. We even ordered fairly basic and still it just wasn’t good.\n\nshoreline plate: order fried eggs and got over easy, hash brown was pure grease, bacon was fine, and lastly the pancake was tough and leathery — i’ve never had a leathery pancake before but that’s the best description. It was hard to cut even with a knife and lacked flavor.\n\npimento cheese toast: i was excited for this and it was *fine* but the toast was served over a wet wilted salad so the bottom of the toast was soggy. not what i expected at all."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeHVYb01BEAE",
            "text": "I love it here, been here a few times for brunch, which is excellent. Brought my visiting parents for dinner during happy hour. My dad is a big fan of raw oysters, he housed a dozen. He ordered a clam and andouille sausage special and he was desperate for the recipe. My mom had the crab roll, I had the crab cake, and my spouse, the steerage burger. We shared hushpuppies and charbroiled oysters. Everything was delicious. Our drinks were also great. The staff is very kind and was very patient with my egg white in her cocktail, skeptical mom. 😂"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzczRETmV3EAE",
            "text": "Was excited for the happy hour deal and was sat at a table. The waiter explained it was a busy night, and he’d get to us soon. That was fine but then 20 min go by without any acknowledgment. Then, a group comes in after us and orders at the bar. He put in their order and made their drinks right away before addressing us. We kept wondering if he forgot about us. A second waiter came in for her shift and she didn’t acknowledge us either. We kept trying to make eye contact with her to get her attention, with no success. Left shortly after, hungry and disappointed in the service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzOVlxU3lnRRAB",
            "text": "Came for a round of drinks, the selection was good. Was intending to get some food but didn’t find anything that peeked our fancy so ended up leaving after our first round."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuaGJmQ2ZnEAE",
            "text": "Unfortunately the service ruined the experience. We DID enter with drinks we had purchased from a coffee shop down the street but we were seated and our orders were taken without any indication that we would need to finish our outside drinks which would have been understandable and fair.\n\nInstead half way though a waiter who was not our initial waiter came over to our table grabbed our full drinks and proceeded to walk away. Once I protested to this he said \"these aren't allowed\" and I told him no one had told us this and we are all ready seated and have ordered. He said he would allow me to chug the drink while he watched and take the empty cup.\n\nIt would have been completely understandable if he had mentioned that or asked nicely like I would imagine most seasoned waiters would have done but this whole exchange was very blunt and seemed to be a way to take out their other frustrations.\n\nThis is all unfortunate because the food was good but the I won't get to mention that because even after sitting with this for weeks I still don't feel right about how that transpired.\n\nI guess enter this place as the risk of the service ruining your morning idk. Pancakes were huge though!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMFkzNzl3RRAB",
            "text": "terrible service, wait times, food and management. go here if you want to wait an hour for your side of eggs. it wasn’t even that busy…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucllLbU53EAE",
            "text": "Food and service was exceptional! Will come again and again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuLUtMa3lBRRAB",
            "text": "Came in on a Sunday for breakfast for 2. Greeting was warm and first waitress was attentive and quick - much appreciated!\n\nUnfortunately we did wait for 45 mins after ordering. We asked another waiter for a quick status on our order which was met with a bit of defensiveness. There was not much proactivity or acknowledgement of the waiting time. We settled the bill for the drinks order and went somewhere else.\n\nOverall the first waitress was very attentive, but the kitchen seems to be seriously dragging its heels. 45 mins+ is a bit much of a wait coupled with the defensiveness."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNEpXdzJ3RRAB",
            "text": "How are you going to hover over my shoulder over an outside coffee but then not take my order after 40 mins of waiting. Mess.\n\nResponse: lol bye."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dDhTcThBRRAB",
            "text": "Where do I begin? Let me get straight to the point. I went to the restaurant with my three year old son. I placed my order immediately and it took an hour and a half for my order to come to the table. I only ordered one item which was hog breakfast. After one hour, my son noticed everyone’s food coming out, smelling great and started to be a little agitated. I comforted him with his tablet while patiently waiting. And half an hour later, my waiter brought me one pancake and stated that the rest will come out five minutes later the rest of the order come out. I was able to sit and enjoy my food for 15 tops before a young lady came over and started to remove the items off my table as I was eating. I was a little upset and I told her I was not done and she told me well if you’re not done I’ll leave it, but I felt a little agitated due to the fact of me waiting for over an hour and a half to eat and you’re moving items off the table as I am eating. She took my syrup and stated “it was only a little syrup in there,Syrup is free.I could just get you another one”. I did not like her energy at all so I said I could just get my bill to which she stated another couple paid your tab. I was confused as to who paid my tab, but the waitress walked away quickly with an attitude to get me my bill. I turned to a couple next to me and asked them if they paid my bill to which they responded. Yes and they enjoyed seeing me with my son have breakfast. I had a small conversation with that couple and explain to them that the wait time considering that I was sitting before them and three other people were seated after me were eating their food. It had my son a little bit whiny. I told a couple thank you they said no problem and left the restaurant. I began to prepare myself to leave placing  my cash tip on the table and the hostess told me that I had to pay my tab because I did not take the offer from the couple which I knew that they paid for me already. I did not argue. I immediately paid my bill with my Apple Pay and the hostess refused to allow me to complete my transaction on the Apple Pay device. I told the hostess I don’t get why you’re going back-and-forth with me when I’m trying to complete the transaction on the device to which the hostess replied “I don’t get it either “ with an attitude. That’s  just the hospitality of this restaurant. Let me get into the food pancakes taste like flour and water. The bacon was great. The sausage was good. The eggs was good. Nothing that makes me feel like I have to go back to get that taste or that feeling. At this point in my life it’s ambience of the location that I’m having brunch at but you have ok tasting and food and nasty hospitality. How long was this restaurant open? It could not have been open before the pandemic because it would’ve never still been open."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOMTQtaURREAE",
            "text": "Overpriced pancakes came out trash not worth your money dont come here $71 for 3 breakfast platters is absurd if its going to come out that bad"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3enZya05REAE",
            "text": "Please take out pancakes off the menu because it's the worst pancakes I ever had"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3enZ6bWN3EAE",
            "text": "Once of the worst pancakes I ever had In my life they need to fire the person who made the pancakes it's way too expensive for garbage pancakes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3enBTaUZ3EAE",
            "text": "A newborn baby can make better pancakes than this overpriced trash place dont come here make your own food at home because it seems like they dont care about how your food comes out"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3enREYUZnEAE",
            "text": "DO NOT ORDER HERE THE FOOD WAS TERRIBLE I ORDERED PANCAKES AND IT WAS CHEWY SPENT 24$ FOR NOTHING."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cUlLMGV3EAE",
            "text": "Stowaway has a unique pancake that hits the spot nicely. It’s served smothered in blueberries and has this caramelly butter on top as well - so delicious. The biscuits and gravy with shrimp put the meal over the top. Stowaway is a great brunch option if you like tasty southern cuisine 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaHFhNE1nEAE",
            "text": "I LOVE THIS PLACE! Such a gem in the neighborhood.\n\nBest $1 oyster happy hour Wednesday through Sunday. They also have an oyster martini. I go almost weekly at this point.\n\nThe brunch is pretty busy but $25 breakfast platter comes with eggs, hash brown, bacon, and sausage AND pancakes! Unheard of and worth the wait.\n\nAll the bartenders are incredibly kind and chill. Cannot recommend this place enough!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNm96TDVBRRAB",
            "text": "Portions are massive, servers were so kind to first find us seating on a busy Sunday then were attentive.\nSpecial shoutout to the hashbrowns"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydlBDa3JRRRAB",
            "text": "Good food, service a little slow"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbk52emdnRRAB",
            "text": "amazing southern food & oysters, a can’t miss spot in greenpoint - all the staff were incredibly nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMek5qUTFnRRAB",
            "text": "Long story short, this placed served us disgusting food after over an hour wait that contained multiple hairs. Added with the crazy wait times to get service, I am absolutely staying away from Stowaway forever. I suggest you reconsider trying this spot.\n\n3 of us came in on a Sunday, and were sat fairly quick but soon after that it all went down.\n\nFirst of all, the wait time for the food was unbelievably long. For some eggs, sausage and pancakes, we waited OVER AN HOUR. When the food did arrive, it arrived all sporadically instead of all together. Guess what we got last? Our eggs, probably the fastest thing to cook, somehow took about ~40 mins after getting our pancakes to get them. When the eggs arrived, they were extremely salty and inedible.\n\nThe worst part besides the waiting was the hair. We found TWO different hairs in two of our dishes, one in the syrup cup for our pancake, and another one under the gravy of our biscuit (pictured below). I was absolutely disgusted—I had to stop myself from gagging at the fact I had just eaten something with potentially a pub** hair in it. I feel so gross thinking that I could have eaten some without even noticing.\n\nOur server was really understanding, which was probably the only redeeming quality of the restaurant. Overall terrible standards of food, sanitation and quality. Never coming again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6a2NpdThnRRAB",
            "text": "The best Southern food in North Brooklyn — the portions are huge and delicious, and they have dollar oysters during happy hour. So glad to have this spot in the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cHJIZktBEAE",
            "text": "Came in June 9 and was warned there would be a wait for food as the kitchen was backed up. That’s fine with me but there doesn’t need to be a wait for you to take my order. We watched others who arrived after us place their orders while we waited. When the waitress finally got to us she was condescending and rude, I got the feeling she didn’t want us to be there. I wanted to try the food but didn’t even finish my drink. Had to walk out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMzdTY3VnRRAB",
            "text": "This place has the most amazing breakfast, but we came a little bit too late so we decided to indulge in the oyster happy hour! A bottle of wine coming with a dozen oysters, super fresh!\n\nI also got the muscles and fries and the pimento cheese dip, which my friends were fighting over until the very last bite. So many other amazing dishes I can’t wait to go back and try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqXzZXczZ3RRAB",
            "text": "Was seated immediately even on a Saturday afternoon, but took almost half an hour to get our order in. Waitress was mumbling and hard to hear, gave us attitude when we asked for an update on the food as it had been at least over an hour. Despite not being busy, they took forever with each dish, the side coming out first with the main dish following after more than half an hour. Fries were okay, pancake was fluffy but mediocre, and the biscuit with mushroom gravy was delicious. Overall, food is good but if you have anything to do that day go somewhere else, because you’ll be here for over 3 and half hours."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbXZEMnlnRRAB",
            "text": "The restaurant is beautiful and cozy with good service. The dishes were mostly delicious, but the Classic Shrimp Cocktail was expensive and didn't live up to its price. The food took a while to arrive at the table. Overall, it was an enjoyable experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNV9meUx3EAE",
            "text": "📍Stowaway, Brooklyn,NY. Sunday brunch done right !\n.\n.\n✅Top quality ingredients\n✅Extensive southern inspired menu\n✅Walk-ins welcome\n✅Great coffee\n✅ Full bar\n.\n.\nMy husband ordered the big breakfast and I had the crab roll with a side salad. The crab meat and the brioche was top quality.\nThe service was great. Highly recommended for a laid back Sunday brunch."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1czZyMEd3EAE",
            "text": "Southwestern bar and restaurant in Greenpoin Brooklyn. Beautiful place to hang out with friends and family. They have everything made in the house from biscuits and bacon to fry chicken and mushroom gravy . Mushroom gravy  was good but a little to salty for me. Wedge salad we got was crispy and fresh with good amount of dressing and candied walnuts. Staff was very friendly and helpful. I should go back there for happy hour for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMjhERDJnRRAB",
            "text": "Cozy hidden gem in greenpoint, great for brunch.\nEach dish had a very generous portion, which we appreciated. They also have dollar oysters every day wed-sun 4-7pm, which i'm excited about! Will return for the 🦪s.\n\nOne thing that turned me off a little bit though - when we visited for brunch on a Sunday, the service was very slow. We waited for an hour+ to get our orders and when we asked about it, the staff didn't really address it / apologize for it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSM2JfNXlnRRAB",
            "text": "In NYC, anecdotally it feels like there is an uptick in southern or southern inspired cuisine.  As far as brunch goes, few spots do it better than Stowaway in my opinion.  Everything was tasty and well made, with a wrinkle or two to differentiate from everywhere else.  Biggest advice I could give is that anywhere it says 'housemade', probably worth a shot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbU8zSlV3EAE",
            "text": "Came here for happy hour and had a great time! Oysters were great, drinks were boozy and delicious and bar tender was really nice. If we didn’t have to go to dinner after we would’ve tried more on the menu, we’ll have to come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbU5lUWhRRRAB",
            "text": "Excellent place for breakfast/brunch! The ambiance is lovely and the service was quick and very pleasant. Went here because I was too early for my crafting class.\n\nThe food you get for the shoreline breakfast is a lot and their proper Irish coffee is actually a proper Irish coffee and a lot of alcohol so you have been forewarn.\n\nAlso the few places that does veggie biscuit with gravy right.\n\nDelicious food and fair prices especially with what I have seen in brooklyn."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadDRPX0VREAE",
            "text": "Best brunch I’ve had in NY. The hush puppies with molasses butter have ruined all other hushpuppies and were a great appetizer to share. The pancake was huge, fluffy, and had nice crispy edge bits and the sage sausage and hash-browns were well seasoned and flavorful. Great music and overall atmosphere too!"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNjdYZXZRRRAB",
            "text": "Super brunch ! C’est super bon. Le rapport qualité prix est top. Les portions sont généreuses, le pancakes est énorme !!! Super service, la dame est adorable"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMGJucjB3RRAB",
            "text": "Only reason I'm giving 4 stars is because of the frozen hashbrowns\n\nI ordered the biscuit breakfast sandwich, that was great and highly recommended it. I was so excited for the side of hashbrowns and it's like a McDonald's Hashbrown.\n\nOrder the side salad if you get the biscuit sandwich\n\nAlso there homemade strawberry jam is divine!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNG9hRnpBRRAB",
            "text": "Great food and big portions. Small and cozy place. Waited around 30-40 minutes on a Sunday for brunch. Friendly service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUROaTZodRAB",
            "text": "Hands down to the best pancake.\nFluffy, light and thick! Also the shrimp grits were amazing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OV9XQ0RnEAE",
            "text": "Good American brunch places, servicing an assortment of biscuits, pancakes and platters. Rustic, eclectic, speakeasy-esque vibes. Friendly staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxc3NiUk9nEAE",
            "text": "Everyone at stowaway is someone I wouldn’t mind being trapped on a desert island with. From Clark, to Stephen, to Miles and Marissa (sp?) the back- and front-of-house folks at Stowaway are top notch. Delectable dishes, from tasty low country favs like hush puppies to full bodied raw oysters, are complemented by mouth tingling wines and a solid beer selection. The oyster shooters - with Bloody Mary mix and a choice of liquor shot - are feisty!\nClark is a friendly founder and a hell of a chef. Spot on with design and happy hour specials too. As someone from New Orleans living in Greenpoint, I can be picky about food and drink spots. This is my new local 🍻"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyeGVPZUNBEAE",
            "text": "I have a mixed feeling... Food was great, the atmosphere was great... The only distracting thing for me was there were so many flies flying... I don't know where they're from, but I hope flies will be gone by someday...🙂…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcXNIdnV3RRAB",
            "text": "Got the bacon, egg, and cheese biscuit with a cold brew. Everything was great! Very friendly staff, big portions, reasonable prices!"
        }
    ],
    "reviews_count": 68
}