{
    "name": "Di An Di",
    "place_id": "ChIJ2fdTNEBZwokRcAtK9PyqDAs",
    "grid": "BK1",
    "address": "68 Greenpoint Ave, Brooklyn, NY 11222, USA",
    "rating": 4.3,
    "user_ratings_total": 978,
    "phone_number": "(718) 576-3914",
    "reviews": [
        {
            "date": "17시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GQlVGQmhORFF3V1RaME5UaG1kR2x1TVVKbWFrRRAB",
            "text": "Great place with great vibe, their Pho is on point. Great beverages too!"
        },
        {
            "date": "20시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkb2JFUmplWFprWlVOZlZqVjFWREZmUVZSb2VGRRAB",
            "text": "It didn't feel particularly delicious, and the interior was not luxurious."
        },
        {
            "date": "수정일: 5일 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3emRhVmZREAE",
            "text": "Food is getting worse and worse. The menu is extremely limited. The main dish (pho) now features old beef, bland broth and instant noodle. I'm very displeased."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSU1XbHRPRkJMWVdSUlFTMTZNSGR3ZFZKeGRWRRAB",
            "text": "Love the food, vibes and service! Amazing vegetarian options as well!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSU2RtaEZZVWhTWTNwVWEydHBhMjFQY0V0clkyYxAB",
            "text": "Flavor of pho is okay but portion way too small for its price"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTlNXWklkVXhqT1VObVprTnBWRkpoWTBGS1duYxAB",
            "text": "Best pho in NYC"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUGFEZGlXR1Y1V0VFMGQxUTNWR2hYVW1OS1NGRRAB",
            "text": "I visited Di an Di on a Saturday afternoon for lunch after hearing many great recommendations, and it absolutely lived up to the hype. The food was excellent and a great value. We started with the spring rolls, which were fresh and flavorful, then shared the fish for two—truly outstanding. We also ordered the papaya salad, which I highly recommend; it was crunchy and refreshing without the overwhelming spice you often find in Thai versions.\n\nThe atmosphere was pleasant and inviting, with plenty of seating and a few high tables. We arrived without a reservation and were seated right away. Overall, it was a wonderful lunch experience, and I’ll definitely be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQ2JITkRWVzlmTFhkZlpFSlRXSEkzTVc1M1pVRRAB",
            "text": "Even the simplest dishes impressed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFM1Z6aEhMVzVGTVhOTFdHMXlRM2RUYW1ScVpVRRAB",
            "text": "the cocktails are pretty good however I have never experienced such awful service at a place that charges $16+ for a cocktail. When I ordered a 2nd round, the bartender used the same glass, same tiny melted ice cube, barely chilled my liquor, and handed me a warm drink, no garnish with a small melted ice cube (from old drink). Wondering what type of cross contamination happens when using a stirring spoon in a dirty cocktail glass.\n\nThis was during 4-5pm, and they had a total of 2 customers, not busy at all so I don’t understand the lack of care. Especially considering this was during happy hour and I chose to order a regularly priced cocktail.\n\nFood is 3 stars, after my weird experience with my drinks, Di An Di is a 1 star restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xneGVWcEhjM3BXYURWRFMydElZVXhaTjJwRlptYxAB",
            "text": "Do you have a ramp"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMU0yaHNkM2xwUVhKNVIyNU9aQzFIZDNWUk5FRRAB",
            "text": "Perfect choice for a romantic dinner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bVVYVlNNRVJpWW5sV1N5MDJXbGxuY0hBMWMzYxAB",
            "text": "We have returned for many dinners and the quality of the food is always excellent. It is evident the kitchen takes pride in what they send out.\nMake a reservation for the obvious busy times of day and week."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMVZHNWFablZPUkU0NWNWRmlhbEo0TlVGSFozYxAB",
            "text": "Stopped by for happy hour snacks and some beers. Vietnamese beer was a plus, the oysters and nem skewers were lackluster and did not feel worth trying. Overall a nice atmosphere but maybe the entrees could be more their focus."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210emIxWXlVRFZZVkdkVFQzbDRNa1F4TUZGTFRFRRAB",
            "text": "Great spot to get upscale Vietnamese. Everything we had was good.\nPortions seemed good too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMmNUQnlha0ZpZGxGTlpsSjBXV1JqWVUxVU1HYxAB",
            "text": "Sat at the bar for a quick beef pho and mocktail, ended up staying and chatting for an hour with the bartender Vera. Service was as amazing as the food. Don’t need to go to Chinatown for my fix anymore ✌️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNVF6SlZMVkF0WWs5ZlEwVkpVRmhaVUZCSmJWRRAB",
            "text": "The beef pho tasted cleaner than I expected and not like the homey taste I was used to growing up in an Asian neighborhood. Also I’m pretty sure they don’t typically put raw egg yolks in their broth and that’s something we Americans love. The water tastes like it was filtered and the atmosphere was honestly so fresh and green."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQ2QxTm1VV05tWlRWWlRUVXhSSGxzZG1zNVduYxAB",
            "text": "This place should be closer to 5 stars imo. Fantastic! I doordashed it a few more times the same week after my first time trying it and it changed my friend’s mind about Vietnamese food"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnXzhTY2JnEAE",
            "text": "Ordered from this place at least 50+ times now and have been in the restaurant 20+ times. Their delivery service has deteriorated and they consistently leave items out of every order. It’s appalling!\n\nIn addition, they started charging $3 for the egg yolk that was part of the beef pho during an egg shortage which is fair but they just kept it that way when there was no longer a shortage!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdU1sUTNMWHBDTW5KRVJrdENabkZqZUZZelJsRRAB",
            "text": "great pho, super fast, chill/hipster vibe."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaVdrWm5jMmx2Y25aa1dEQmliMjFGWlhGeGFGRRAB",
            "text": "Pho noodle is amazing. A little different tasty compare with other restaurants. Di An Di's noodle is much more tasty!! More chewy? soft? anyway 😁😁"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SYVJWQXlaMGR0YW13M2N6bFFkblZEYVRGUk1YYxAB",
            "text": "The menu at this place is very limited. My brother-in-law has been boasting about the \"Phở\" here as good. So, we tried it last Saturday evening. Inside the place looks trendy and cozy. The prices of the entrées and appetizers are pricey - $22 (Phở); $30 (chicken thigh w/rice [very oily]). We had (Nem Nướng-grilled pork Skewers) - it was ok.\n\nTo me this Vietnamese restaurant is more catered to non-vietnamese folks. The foods don't really have the true authentic Vietnamese flavors/tastes/spices.\n\nIf you want real authentic tastes of VN foods, you should go to Chinatown and there are many VN and Asian restaurants. And the prices are much less and getting authentic tastes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tack1rVmxNWFZqVEMxSFlVZGxiV0U1Vkhaek5HYxAB",
            "text": "all 10/10, impeccable service, AMAZING papaya salad + veggie spring rolls, and veggie pho was probably an 7.5/10–fresh and delish, just missing some different textures. maybe add tofu if you’re gonna order this, otherwise it gets a bit samey w soft mushrooms and soft noodles. Do not miss the cocktails, either! We loved it 🍜🍸💕"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWVJrczNSRm80TUZJMmVuVlRNMGRSWkV0NGVuYxAB",
            "text": "Really nicely lit and cozy interior. Loud open kitchen. Very good food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5SVJrSkdORE5VYVZWNlYyUXlhVWRqUm5neFdWRRAB",
            "text": "This broth was unique and very very aromatic, one of the best broths I have had. We came here on a Sunday so the Brisket sandwich on the menu and it was an amazing choice! It comes with a broth which I highly recommend trying. We also got the pho with an egg on top, the noodles were so soft and the meat just melted beautifully. Location was very clean, service staff were so attentive and friendly!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obWFrd3RaV0ZRYVRCMGNFSllNalJ1TTBKMGJVRRAB",
            "text": "Amazing food in a wonderful space. Shared the\nBun Dau Hu Cha Gio (should have gotten my own order!). The chicken pho was delicious, though the meat was not very seasoned. With a little extra basil and lime, it was a light and delicious serving. The fresh noodles were stellar. My party also got beef pho (also wonderful, though you will need to add lots of sauce to make the broth spicy if that is what you prefer) and\nBun Thit Nuong. We shared the coconut flan dessert on offer, which came with sliced nectarine and a truly unique sauce. I could've tried that flan anywhere and known immediately it was made by a Vietnamese restaurant - the sauce was very reminiscent of pho broth in all the best ways. I can't wait to return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneGVFRmpZMVZ5WlhsUk1tdHFWak0xU1hKeE5uYxAB",
            "text": "To me this is the best Vietnamese restaurant in NYC, I have lived most of my life in VN so I know real, authentic, good Vietnamese food. I've dined here several times and the staff has been great, especially one young Viet waiter who went out of his way to help us. The only minuses are the lady at the check-in could have been friendlier, and maybe they shouldn't charge for minor items like extra rice paper (well once you know it, you can just avoid ordering extra, so that doesn't stop us from coming back)."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25acFVEaExTVmx2UzBwRlVWbFhWbXBHTlV4eGFIYxAB",
            "text": "Food was pretty good - but not like amazing? Maybe my expectations were too high. I’d eat here again if nearby but wouldn’t go out of my way for it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V2FFNWxNSGR5Tm1kcVJYWXdlRFowV0hCelRYYxAB",
            "text": "Incredible food, great service - will be back again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMmRrUlFXR0Z1UVVod0xWa3ROR3RtVlhRNWVVRRAB",
            "text": "Pricier side but very delicious pho. Lovely vibe"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeWVHOHhOMHRGT0VKU1lubFlOMFpIYzFOcWFsRRAB",
            "text": "probably the best pho i’ve ever had in nyc 😭😭😭 very authentic northern pho 🫶🫶🫶"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPM1UtNnZOamIySUpREAE",
            "text": "I have no idea why we never tried this place before. The food is unbelievably good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcXV4cG5Da3Jmdm9nRRAB",
            "text": "Super great Vietnamese and lovely service. The make your own rolls platter is awesome and delicious"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPYkp0YXVQMzVpbl9BRRAB",
            "text": "10/10 experience! Food and drinks were incredible and service was on point."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQZWFocXZaNWRXeGlBRRAB",
            "text": "Really friendly service, our server recommended delicious platters to share and we tried their special cocktails, the “Clear As Day” was our favorite. The food came out fast. But it was a really hot day and they kept their front door open which made it really hot inside and flies got in which isn’t very sanitary. Their AC was on but there was a black residue falling from it which got into our water glasses and plates. The server kindly turned it off for us. But for the price of things, I wish they would fix these things."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOM2N2dEx0MEpIcV9RRRAB",
            "text": "What a wonderful experience!  The interior is beautiful. It’s really spacious with lovely natural lighting and plants everywhere.\n\nThe staff was incredibly friendly and provided lovely recs.\n\nWe got cha ca and thit heo quay cuon. The herbs were extremely fresh!  They don’t skimp on the veggies—the best part about any spring roll or vermicelli bowl in Vietnamese cuisine. The pork belly was extremely crispy and a perfect contrast in textures with the rice paper and banh hoi. Also please get the flan for dessert!\n\nExcited to return."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKYVAzUDNNdDZlRExnEAE",
            "text": "We discovered it on the Infatuation and found it to be a unique and tasty place to be. Loved the chill vibe and indoor garden style patio area. Great and delicious food and the service was great. Will be back for the pho!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWVQwOUdMVE00ZGpBdE5VMUJNVXhLYXpRM1ZGRRAB",
            "text": "I had dinner there with a couple of my friends and it was a delight. The food was excellent, we had the pork belly, oysters and a meat and egg loaf dish. It was flavorful, rich and served beautifully. The staff were so attentive and helpful. And on the way out we met the lovely chef, who handed us some garden strawberries with freshly whipped cream. I loved the experience and will absolutely come back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQM0luN2o2d1B1THhRRRAB",
            "text": "This restaurant was amazing top three in the neighborhood the bun thit is to die for and the cocktails are outstanding service was amazing"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMTDRndTJUMDdLQ1ZnEAE",
            "text": "Food was a 10/10!!! So authentic and delicious every time I go! I like the skylight on the inside of the restaurant. The waiter barely came to the table but the food was incredible so it won’t stop me from recommending this place and returning!! Love their food!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNSDBrdlNLN2V2MkdREAE",
            "text": "By principle they're getting 1 star because they don't communicate what people are allowed and not allowed to order on the menu. Wanted to get a smaller bowl of Pho as I like to try it different places but \"that's only for kids\" ... Less business for them – unlikely to come back for anything else."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNREp6OHlxektDWmpBRRAB",
            "text": "overpricd and overrated. the food was barely warm, pre-prepared, really mediocre.  Got a bottle of French red wine for $64 which was served chilled (which I guess some people like) but I think it was mainly to cover up the godawful taste. Like dishwater. The service was ok except that the second I put down my fork there was a waiter grabbing my plate, I find it really obnoxious, I felt like they try to get you out the door asap. Never again. Amazing it seems popular."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJVy0tcjZGNE8zQmtBRRAB",
            "text": "In my mind I rate Di An Di 3 stars, but my heart gives it 2. Tasty dishes, great ambience, but I got home feeling cheated.\n\nWe ordered the papaya salad, crispy spring rolls, pork belly platter, and chicken pho (not pictured).\n\nMy friends and I were excited to eat here and we were off to a great start with the small plates. However, when the platter arrived, I was baffled to see the measly size of the pork belly slices. The way our sad looking pork belly was sliced was inconsistent with other reviews (see others' photos for a noticeable difference).\n\nThen we realized it came with 6 rice paper sheets for those 8 slices and when I asked for 2 more sheets, I was not informed that I'd be charged. If I had known, I would not have asked. It may have only been $1 extra (I could buy a whole pack with $3!!!) to our substantial restaurant bill, but when I found out after we left I was very displeased. Some may think I'm being a Karen with our experience, but they fumbled the bag with us on this. In this city that's overflowing with excellent restaurants, so much so that you don't need to return in order to try other options unless your experience was nearly perfect, I call it having standards.\n\nI know there are better Viet restaurants out there that don't have a gentrified menu. If I were to recommend anything, get the crispy spring rolls."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYnN1dURQNXBmOXJ3RRAB",
            "text": "Vegan options were absolutely delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQMkhuTW1tejR1Mk9nEAE",
            "text": "Marian (Friday night on 5/9/25) picked up the phone when I asked for seating for 2 (they had bar seating for two).\n\nWhen I asked whether there’s food service at the bar, she gave an off-hand “probably” and then hung up on me.\n\nI’m not going here again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ2Ffa0ZREAE",
            "text": "Not only was this food imaginative and delicious and reasonably priced, the staff was so cool. We had a friend run an hour late because of road closures and they were so understanding and didn’t give up the table and let us just chill and hang out. Truly an awesome brunch experience, gotta come back for dinner"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMnBDNjBnRRAB",
            "text": "The pho is amazing"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX0l1eEZnEAE",
            "text": "The only miss you’ll experience at Di and Di, is missing it. Been a customer for years, and it just continues to hit, even after you stop going for a while."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNzhEanZRRRAB",
            "text": "We ordered the spring rolls, chicken pho, and beef pho.\n\nThe spring rolls were excellent—fresh, flavorful, and definitely the highlight of the meal.\n\nUnfortunately, the pho was very disappointing. The noodles were undercooked, clumped together like a dense ball, and had a hard, sticky texture. The interior seemed raw, which made the overall experience quite unpleasant. We told the waitstaff about this situation, he offered a bowl of extra pho with bad attitude. He put the bowl of pho on the table then left.\n\nI’m only giving the star because of the spring rolls."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveTZqNTJnRRAB",
            "text": "The beef Pho soup was excellent. Great broth, perfectly cooked noodles and flavor all around. The papaya salad was also excellent, with all the right balance of flavors. We sat at the bar. Matheo gave us top notch service. We can't wait to come back and try some other great dishes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc19uUHpBRRAB",
            "text": "Nice vegan options (pho soup, spring rolls, tofu and noodles etc)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaXVXWGdBRRAB",
            "text": "After passing by this spot once, I had to come back to the area to try it. Always in the search of a solid Vietnamese restaurant in NYC, I believe that Di An Di has something really special to offer. The inside of the restaurant is spacious and there's lots of greenery + an open kitchen so it makes the place feel very inviting and open. Staff here is really kind.\n\nWe ordered the rice cake omelette, banh hoi platter with crispy pork belly, and sizzling turmeric fish. Everything was phenomenal. The rice cake omelette was almost exactly how my mom makes it and comes with super chewy rice cake, lots of veggie toppings, and a great sauce. The banh hoi platter came with crispy pork belly and lots of veggies and garishes to enjoy with your banh hoi as you roll it in rice paper. And, the sizzling turmeric fish is served with rice noodles, peanuts, fish sauce, and veggies for you to eat with. One small detail that I really loved was how good their fish sauce was here as many Vietnamese spots in NYC tend to have it a bit less flavorful. Definitely would come back here to try other menu items!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3c2VPa2x3RRAB",
            "text": "an absolute must-visit! From the moment you step inside, the vibrant atmosphere and beautiful decor set the perfect mood. The food? Simply incredible.\n\nThe crispy pork belly is a standout — perfectly golden, with a satisfying crunch and melt-in-your-mouth tenderness. Their pho is rich, fragrant, and packed with flavor, delivering that comforting warmth in every bite. The mustard rolls are so fresh and zesty, with a perfect balance of herbs and savory goodness. And don’t even get me started on the rice cake omelette — a crispy, eggy delight that’s both unique and utterly delicious.\n\nThe service is fantastic, and the staff genuinely makes you feel at home. Whether you’re here for a quick lunch, a cozy dinner, or a celebration with friends, Di An Di never disappoints. Highly recommend — you’ll be thinking about that pork belly long after you leave!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ejgybjFnRRAB",
            "text": "This place is a fantastic Vietnamese 🇻🇳 restaurant! 🍴Di An Di serves an incredible selection of delicious 🤤 dishes 🍽️ & definitely get the Fluffy Omelette 🥚 with Rice 🍚 Cake 🍥 and the Chicken 🐔 Pho! 🍜 The place is beautifully decorated 🛋️, staff 👨‍🍳 is super friendly, helpful, and welcoming, service is quick ⏲️, and the ambience is wonderful! I wish I knew about this place earlier!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeTlLMGRnEAE",
            "text": "Was very pleased with the food we had here.  I am never in this area and happened to be in the area for an art exhibition. The food here was def better than the art exhibition.\n\nWe know Vietnamese food pretty well after living in Saigon for 1.5 years… and Di an Di delivered on the  Bun Thit Nuong - which one of my favorites. The Pho and Bahn Mi were also delicious and so was Banh Bot Chien … I wanted to try the Bahn CEO but was already so full. We also had the Pho spiced flan… I am not a flan at all but this had a really nice flavor and consistency.\n\nService was a little slow but over all fine. Atmosphere was nice and chill.\n\nI would say I would def go back even though it is quite a journey for us to get here! Definitely satisfied all my VN cravings!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNjh5YkxBEAE",
            "text": "Food 8/10\nThe appetizer salad and spring rolls were flavorful and didn’t feel too oily or salty. The crunch on both of them really made me happy. Also it was 4pm so maybe I was just super hungry. The pork platter we got as the main was a little disappointing though, as the pork was so crunchy and hard that it kind of hurt my mouth to even eat it.\n\nAtmosphere 6/10\nNicely decorated interior, unfortunately there was a strong oil smell wafting throughout that kind of stuck to my hair and made my head hurt :(\n\nService 7/10\nSimple and efficient"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBczlmckFnEAE",
            "text": "We don’t usually hang out in Greenpoint because of the lack of good transportation but tonight we decided to go there. Picked the restaurant because we felt like eating Vietnamese. The atmosphere was nice but at times all the smoke from the open kitchen came in the dining room. Service was very good but the food wasn’t anything special. The biggest disappointment was the semifreddo dessert - it was a weird combo of ingredients and literally that took 20 min to become edible."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLU1mT1F3EAE",
            "text": "Love my experiences at Di An Di every time I visit. The food is delicious, the ambiance is always a vibe, and the service is friendly and efficient. Some of my favorite dishes are the crispy spring rolls, the banh xeo, and they used to have a fried chicken dish I would always get for lunch that I miss. It seems like their menu is starting to rotate, which is even more reason to continue to visit. The cocktails here are on another level too. The birds of a feather (basically a dill martini) and the faux pho (pho gin and tonic) are incredible and creative.\nAnd shout out to the manager Gavin, who I always see running around between the host stand, the bar, and the food, while still being super hospitable to customers. The service is a big reason why I keep going back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdks2NUxBEAE",
            "text": "made a resy for dinner on a weekday, loved it! we ordered the papaya salad, pork belly wraps, and their regular beef pho. their pho was extraordinary and very hearty - a unique taste :). this was more than enough for two people, was full over the pork belly! loved the pho and pork belly wraps but could’ve gone not getting the papaya salad tbh. they didn’t give enough of the crackers :(. def recommend the beef pho!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeDVUeDFRRRAB",
            "text": "You would think on valentines, this place would be more than an hour wait, but we were able to walk right in. The trick is to come in the morning. The ambiance was amazing, with beautiful plants, lighting, and modern furniture. The spread brought me back to a feast I had with my Vietnamese friend at her house when I was in grade school. The nostalgia wrapped me like a warm blanket. the modern twist was the passion fruit cocktail with condensed milk. YUMMMMM."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuenNTcHRRRRAB",
            "text": "comfortable modern spot with a good trendy interior and the food has its own spark on each plate. had the bun me with the pho and it had an interesting infusion of American flavor, the beefa had an egg yolk and the the spring rolls. each…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyOUkybi1nRRAB",
            "text": "Food was 2/5 and service was 5/5 so I’m\nA bit torn where my rating should fall. The dishes are great but the execution and final taste and texture was just off. For example, the noodles in the pho was overcooked and you could not even grab it with chopsticks. However, the grilled beef and house made hoisin and hot sauce were great.\n\nThe rice cake omelette (banh bot chien) was a bit disappointing. Rice cake was too soggy and needed to be crispier. The meatballs in tomato sauce tasted like a regular pork meatball with tomato sauce that felt like it came from a store bought jar. Was missing a special kick or aromatics that this dish usually has\n\nThe manager was nice though and service was great. So I feel bad writing a critical review but I am trying to assess the food from an objective view. Overall, I don’t think I’ll be back as the food was not memorable enough for me."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aTdxeHBBRRAB",
            "text": "Cute date spot in Green Point, Di An Di fits the bill. The decor and vibes make you feel like your in a hidden tropical oasis.\n\nThe drinks (rose colored glasses & cold smoke) are delicious and reasonably priced under $20.\n\nThe fried chicken appetizer had a unique fish sauce type glazed, which wasn’t too fishy but also unique. The pancake was also good with the soy based sauce.\n\nThe pork vermicelli bowl was delicious. The noodle consist was soft and bouncy without sticking together too much. The pork was charred enough to give you a bit of crunch on the ends with tons of flavor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3d3FtWXB3RRAB",
            "text": "Each and every dish was beautifully presented and served! Also really appreciate how staff gave us a rundown on how to properly eat some of the less commonly known dishes. I have never seen a fancy rice paper salad before coming here. There is an element of art to the food here that I love."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OHVYOF93RRAB",
            "text": "Best Pho in the city! The broth was so great - full of flavors, well combined with the little spiciness from Thai chili and the smell from scallions. I also appreciated that they treated the greens and whites of scallion differently. The rice noodles were fresh, not like soaked dry noodles. The precooked or grilled (?) beef slices also brought the pho a little wok hay that’s adding another layer of taste.\n\nWe loved the pho so much and went back in a week. Will definitely keep this restaurant on my fav list."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbDVDbkVREAE",
            "text": "Had dinner here, definitely my favorite restaurant this entire trip. The menu was a little small (I heard they may be renovating so that may change) but everything we ordered was so absolutely amazing! The waitress was incredibly…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bGJySTVBRRAB",
            "text": "We enjoyed our time here as it was clean, well ventilated, and staff were very nice. The food was good, but it didn’t taste like authentic Vietnamese food, so do not recommend if that’s what you’re looking for. If up for a fusion experience, would recommend! My husband normally doesn’t like Vietnamese food but this altered version was perfect for him. The vegan/vegetarian options were great and makes it a great spot for those with dietary preferences."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aS1qcnJBRRAB",
            "text": "This Vietnamese restaurant offers a pleasant atmosphere with a well-stocked bar, offering a wide variety of soft drinks to choose from.\nThe service is commendable, allowing customers to enjoy their meals indoors or outdoors.\nI particularly enjoyed the Pho Bo here, which is prepared in the traditional Northern style, resulting in a delicious and flavorful dish. However, it was slightly saltier than I would prefer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzekt1dzhBRRAB",
            "text": "I really enjoyed my experience at Di An Di! The food was phenomenal. Appetizer portions were a bit small and pricey, but overall, the summer rolls and the chicken wings were amazing.\n\nThe summer rolls were fresh and rolled to perfection. Served with this lovely cilantro green sauce. The wings were awesome - a tangy, sweet and spicy glaze over large wing/drumstick chicken pieces.\n\nThe pho was outstanding. Might be my favorite pho in NYC. Rich, flavorful, full bodied; this pho was it. Served with an egg yolk which the broth into a rich pho experience. The beef slices were thin and perfect. Really amazing experience and highly recommend."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabHB2bXVnRRAB",
            "text": "Quite disappointed with this experience. There was a lot of hype from friends and family about what a great chef was here and what a great job they did. The experience was underwhelming.\nWe arrived promptly for our 5:45 dinner. We placed our drink orders and waited. The waitress never came back for our food order. So one of the maitre D's stopped by and took the food order. Almost immediately, the papaya salad came out. Shortly thereafter, the beef salad came out. Still no drinks. About the time the omelette came out, and we asked about it, the drinks came over.\nThe service was quite rushed.\nThe omelette with the rice cakes was not really anything special. Just meh. The beef salad and papaya salad. We're both very good.\nWe also ordered Pho.\nIt was literally tasteless. It tasted like plain broth with noodles in it. It went over cooked chicken. The spices did not come through, nor did the fresh herbs. Really disappointing. We could have done better ourselves at home.\nWe really wanted to like this place. But my advice would be that it isn't worth it. Too many good choices around."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5X2Fub1dnEAE",
            "text": "Been here many time, the Pho used to be really good but the quality seems to drop recently. the beef is no longer tender and the noodles texture is off.\n\nNoticed one of the Asian guy server in the bar area talk with Asians in straight face but very friendly toward white guests, doesn’t feel like will visit again till things get improved."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxOEs3b19RRRAB",
            "text": "I've had mixed experiences here. The first time I came, the beef pho was not great. The second time, it was amazing, especially paired with their homemade sriracha and hoisin sauce. The third time I went, it was horrible. I ordered the chicken pho, which was very flavourless. My girlfriend got the beef pho, which was also lacking in flavour. The service was subpar too. Many tables who sat down after us got their food before us. I did enjoy the spring rolls though."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmb2ZtZkV3EAE",
            "text": "Modern take on Vietnamese cuisine. Spicy, fresh and savoury, a must visit in Greenpoint/New York! Great food for vegetarians, vegans and non-vegetarians. You eat so much, but don’t get full and tired, just wholesome. Also some great wines by glass."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1ajhmNy1BRRAB",
            "text": "By far one of my favorite restaurants in NYC! The food was fantastic, we enjoyed every plate we ordered. Our favorite dish was the Lemongrass pork bun bowl. The waitress was extremely friendly and super welcoming. The interior was also very pretty and felt very lowkey. 10/10 Would recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMa2V1S3BBRRAB",
            "text": "A solid place for “modern” Vietnamese food. I would recommend their fried spring rolls (top tier), their chicken pho, and a vermicelli bowl.\n\nThe fish lacked flavor but it’s a fun dish to eat. They give you spring paper rolls and you can assemble it.\n\nOverall I enjoyed my meal and would come back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodDllT2RBEAE",
            "text": "I was expecting more. The menu was limited to pretty “basic” Vietnamese dishes and I was hoping for more variety / uniqueness to justify the price.\n\nThe chicken skewer vermicelli dish was the most mediocre and I would not recommend getting it. The flavors lacked the “wow factor” and it really felt like I had paid $25 for a tiny chicken skewer and some bland vermicelli.\n\nMy favorite item was the rice cake omelette, it had a very chewy texture that I appreciate in food and I would recommend ordering it. The chicken and cabbage salad was good but pretty basic and the fried chicken was very sweet so if you want to order it just keep that in mind."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsd0lxRnB3RRAB",
            "text": "Delicious and affordable! We had the beef pho, roast chicken, grilled short ribs, pork and beef sausage, crispy spring rolls, papaya salad, and rice cake omelette. Everything tasted amazing and was presented beautifully. Honestly you can’t go wrong with anything on this menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPLXZDSGZnEAE",
            "text": "The place was very tentative to their customers needs. We booked a table for an earlier time and they actually called to offer us a dinner table, as long as we’re out by a certain time. That was a nice touch. The place is well decorated and the staff was quick. The food came out very quickly. Overall, the food quality is there. But the pho, a main staple, was just portioned too stingily. And that’s where they lost that star. You order a pho, you are to be satisfied. The broth was good but there wasn’t even enough noodles. The green 三色冰 drink was awesome. They got the essence of that drink and turned it alcoholic."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNkp1U0R3EAE",
            "text": "The place is nice and clean. The people are very friendly; we didn't have a reservation, but they found space for us. The service was very good and quick. After 5-6 PM, they don't sell sandwiches. As an appetizer, we ordered spring rolls that came out very quickly and were delicious. For the main course, we ordered the pork and chicken Do Nurong, and we loved it. An excellent place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqanFPbWRnEAE",
            "text": "The menu used to be much more extensive and I appreciated this spot for being one of, if not the only one, that does a northern style of prep, and I think they also homemake their noodles, but the quality seems to have dropped a lot. Almost just another posh restaurant w mid food now.\n\nThis most recent time I went the beef pho I ordered was decent enough, but for some reason the veg pho my friend ordered was sweet. My friend can’t rly eat sugar, so we asked if we could switch out the broth. They said they couldn’t but could bring a bowl on the side. I thought this meant we could just have both as it’s quite standard at more posh spots to strive for basic customer satisfaction and it’s weird to begin w that pho would be sweet, but they charged us $6 extra for the small bowl of plain beef broth🤦‍♂️. They also seem very inconsistent w the types of scallions they give. We only had shortly cut scallions vs many others had long thin&thicker cuts which would’ve been much more enjoyable\n\nThis way of doing business makes me not want to go back, besides the quality of food just being a lot worse now. I’ll probs go back to give it another try but I’m p disappointed as it is"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdlBlcnhBRRAB",
            "text": "I know there are probably better things on the menu to order, but it was cold outside and I wanted hot soup, so I got the beef pho.\n\nThe noodles were unusually short. I put the egg in the spoon and whisked it with the chopsticks, then mixed it into the broth to make it silky. The taste was fine, but I wish they’d put the sliced Hanoi chilies on the side (with the basil and lime) so that I could experiment with the flavors more. Spicy pho isn’t the typical default."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcG83RHZRRRAB",
            "text": "This place has made its way to become one of my favorite Vietnamese restaurants in Brooklyn, or NYC in general. This mostly attributed to the taste.\nThe bún thịt nướng (lemongrass pork bowl) was very flavorful, especially the beef; the mixing sauce added a nice sweet and salty palate. The oysters were good but not very memorable. The phở bowl was great flavor-wise but not sure why no Vietnamese restaurant in America like to use the authentic pho noodles in their pho bowl. The bánh tráng trộn (rice paper salad) hits all the right notes of an authentic one.\nThey also sell bánh chưng (Chung cake) during lunar new year, which is a plus. The cakes are quite small with little fillings but hey, this is the best you can get in NY.\nRestaurant is always busy so best to have a reservation. Price was quite expensive for the portion. Service was good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aGJ5ZlpBEAE",
            "text": "Upscale interior, delicious vegetarian choices and great service. We ordered the fried eggplant, tofu bahn mi, and their special - a Chinese watercress. My girlfriend lost a $100 bill and the staff was super helpful to get it back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXb051TXNRRRAB",
            "text": "Definitely ranks in my top 10 places to eat in the city.\n- Super cute decor ✔️\n- Innovative and mind blowing cocktails ✔️\n- Fun experience with good ✔️ Their Vietnamese pizza comes with scissors and it’s so fun to eat. And their sizzling mushrooms are like nothing else I’ve ever eaten - cheesy, crispy, combined with all other sides they give you to make your own roll, just pure bliss.\n\nMy favorite dish here is their baby mustard green rolls. The delicateness and softness of the mustard green leaves combined with the crispy and yet fresh filling with the perfectly flavorful sauce makes for an outstanding appetizer.\n\nSince the time we discovered this place, we’ve been here 3 times already in a month."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqaWY3cm1nRRAB",
            "text": "Absolutely amazing place. Highly recommend! Must try pho  when visiting New York. Food tastes on point and presentation on next level. Cozy atmosphere. Amazing drinks and cocktails. Igor is the man for all your fancy drinks on the bar. Highly recommend. Would come back for more. Keep up great job guys. Cheers"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeDlLTjFRRRAB",
            "text": "Really enjoyed visiting here. The large platter with the rice wraps was excellent, and we also tried all of their home made sodas which were delicious. Good service and fun atmosphere. I also enjoyed the pho and they had some great homemade sauces - I will say after visiting this somewhat upscale, young crowd / kind of trendy Vietnamese restaurant - though it was absolutely great - I did have a feeling of really wanting to visit a more hole in the wall kind of Vietnamese place - where usually I have found the best pho!"
        }
    ],
    "reviews_count": 85
}