{
    "name": "MADRE",
    "place_id": "ChIJAVTGb3pZwokRmKrpkrTn1NY",
    "grid": "BK1",
    "address": "214 Franklin St, Brooklyn, NY 11222, USA",
    "rating": 4.7,
    "user_ratings_total": 527,
    "phone_number": "(718) 389-8700",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oYWQzaHpYMmxrTWs1Sk5HVm5hVEZ3UVd0VVZtYxAB",
            "text": "Stopped by on a weekend afternoon for a light brunch. Ordered two cocktails along with the hamachi and a salad, the cocktails were strong, and the food came out clean and delicious. Really enjoyed the whole vibe!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcVMwaEdUSFZXUkhvMVkyUndlamh3YWtaVFEyYxAB",
            "text": "I’ve been wanting to come to MADRE for quite a some time so I finally snagged a reservation a few weeks before. First off, the vibe inside is so cool - I love how they used the lights to give an intimate yet fun vibe. The service was great and the food was good, just good however. The lamb chops were the best dish of the nights for us but tasted like good quality chops, nothing special. The flavors were okay but I wish they did more with the dishes. The drinks were strong which is a plus, you just need one for the evening. Not sure if I’d come back or recommend someone to come out of their way for a meal. Still a great place but the food was just okay."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odGNFdG5ZMnBJVDJsdExYSnphRkJVT1ZsblUyYxAB",
            "text": "Unfortunately host was extremely rude and decided to leave before trying food. Restaurant was almost empty at the time also"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMlJXUTNjV0Z1VkhWSmQweGhNR1J1YVhoSFRWRRAB",
            "text": "Great food, but it does feel very rushed"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adE0ybDZPV2RyZHpnelIxTXdkbk56YkhNeFIyYxAB",
            "text": "Great cocktails and even better food. Been here twice now, both times a great experience. I recommend the octopus but everything is great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeFUwTnVOWGRFVHpScVlsbHhhbmRWWmtKME5GRRAB",
            "text": "Incredible, will definitely return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSVN6VTFlVnB6VDJrd1ZFSlRWRUp6UW1OUFVtYxAB",
            "text": "Honestly was a bit dissapointed. Like many others, we had high hopes for this well marketted place. But the truth is the food and atmosphere dont justify the price point at all. The service was the only thing that prevented a worse rating, and even so, there was only 1 waiter and food came very slowly.\nWe spent 160 including tip and tax for 2, without getting any of the pricier items. The scallop aquachile had maybe 1 scallop inside and a ton of sauce. Striped seabass tasted decent, not great but decent, but only maybe half the size of what you would expect. Octopus was also decent, not great but decent, although borderline too hard to chew at the end bits. Overall the food was only average but the price was very unjustified."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbGVYSlpXVXhLY0RsUVUyOHpTRTkyYW1GeFZGRRAB",
            "text": "Very good food : we choose ceviche, octopus and pasta... everything was delicious including dessert: a chocolate soufflé. The wine: a Spanish white (from Galicia) aromatic and delicate"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aU2MyNTNTVWxXWm10WVFURnJjMXAxY0RKTFZsRRAB",
            "text": "They ran a fake, poorly organized \"block party\" advertised a big event. Then just sold cold food on the sidewalk. Poor signage telling you to order drinks inside, after waiting 20 minutes in line to order food, you go inside for drinks and they tell you the bar doesn't do drinks, you have to wait in line outside. Staff were rude, clearly poorly planned and no effort. Charged $15 for alcohol free 4oz pours of watermelon juice they called a cocktail. Wasted trip to Brooklyn"
        },
        {
            "date": "3달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQllYSlJSa05MYmtSWVV6UXlNMmhHVlcxVWFIYxAB",
            "text": "@lydieats 💕 One of those spots I would describe as “international” 😉 They combine a lot of flavors together that sound very interesting but also taste quite familiar. It’s tapas style so expect smaller portions. We had a bit of everything, and I’d say the starters were the most fun, cornbread madeleines, hamachi, & scallop aguachile were my favs 😋 Short rib had this school lunch flavor (can’t say I was a fan) and the sides tasted very basic. Soufflé was a standout and I just wish they had a fruity seasonal one. Overall solid but not super memorable 🤷‍♀️ Would probably prefer this place for brunch tbh. The space would feel so bright and sunny in daylight but for dinner, it got very loud.\n\n💕 cornbread madeleines $10*\n💕 croquetas $12\n💕 market salad $20\n💕 scallop aguachile $27*\n💕 hamachi $25*\n💕 short rib $38\n💕 papas bravas $10\n💕 miso brussels $10\n💕 soufflé $20*\n\n뭔가 인터내셔널한 느낌? 조합은 특이한데 막상 먹어보면 익숙한 맛이다. 타파스 스타일이라 양은 전체적으로 작고, 여러 개 시켜서 나눠 먹는 게 좋음. 스타터가 제일 맛있었고, 굳이 추천하자면 마들렌, 하마치 & 가리비 아구아칠레가 괜찮다 🙂‍↕️ 쇼트립은 약간 급식에서 나오는 스튜맛? 이건 패스. 수플레는 맛있었는데 초코 말고 시즈널 메뉴였으면 더 좋았을 듯. 브런치 때 오는게 더 예쁠 것 같긴하다! 디너는 너무 시끄러움."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGYWRHaHBUbmt6T1ZSYVoxSkdhVW8wVDB4UFZIYxAB",
            "text": "This place has officially become one of my favorite summer brunch spots in Brooklyn. The ambiance is perfect and the service was just as impressive. Our server was absolutely amazing: friendly, attentive, and her recommendations were spot-on. We tried the octopus, oysters, and croquetas, and all three were fantastic. Everything was flavorful, well-portioned, and beautifully presented."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aWEwMXVaMWhrWjFOcmJUazRVVTE2UjFwcGQxRRAB",
            "text": "Food was bland and poor quality. Overpriced and trying too hard. Server was nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVFlWVm9UV3hEVVZaM2NsRjZURXRET1RCZlVYYxAB",
            "text": "I heard great things about this restaurant and finally came to try. The food was delicious and the staff was really helpful. We got 3 starters and it was enough for 2 girls for dinner. We each got a cocktail, and the final price was $99 - a bit expensive but worth it for a nice night out."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLV1dtdWpRNTZiRGxBRRAB",
            "text": "Amazing service, delicious food experience, attentive service, and great wine!! couldn't have asked for anything better evening!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNT2t5cERQeHB2QkRREAE",
            "text": "Good food, but could easily be better. Papas bravas not crispy enough, octopus could use lemon and more sauce, scallop aguachile could use less sauce and more scallop. Oysters and croquetas were pretty good though."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKaUNoYy1TMktpWlV3EAE",
            "text": "I have had this establishment on my Hit List for almost two years and I finally got to go. Unfortunately, it disappointed me greatly. I came for brunch, so I cannot speak for the quality of their dinner dishes. However, the items my party and I ordered were absolutely atrocious. We started out with the croquettes, which were incredibly salty and just tasted like Annie's mac n cheese shells. We also ordered the cornbread madeleines, as recommended by our server. They were a 6/10, yet still the best item that we ordered LOL. The server claimed that they had a good combination of sweet and salty, but the sweet part just really did not come through. It was more just cheese and jalapeño, no cornbread flavor at all. For entrees, we ordered the chilaquiles & wagyu burger. The chilaquiles came with two chorizo sausage pieces. TWO. It was a bummer! At that point it was just tortilla chips. We complained and the server gave us a whole side plate of more chorizo. The wagyu burger.... hard pass. I was impressed that a restaurant could make WAGYU meat DRY. The patty crumbled apart and it was gray, an indication that it may have been reheated and frozen before. The burger collapsed upon the first bite, and it was just an unpleasant experience. The fries were also undercooked and barely had any crisp. Refer to the photo-- they look like RAW potato! I had not put in a complaint because at that point I felt we were just asking too much from a mediocre establishment. We also ordered half a dozen oysters at the beginning of our meal but the server forgot and upon asking if she should bring them out, we were already so disgusted by our meal that we kindly asked to just remove the oysters from our order entirely. Will not be coming back for brunch... or even dinner. What a waste of $120 out of the wallet!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMSHdsZFMybzdtLWVnEAE",
            "text": "Tucked into the ever-evolving food scene of Greenpoint, Madre stands out as a vibrant and refined Spanish restaurant that hits the mark on flavor, ambiance, and creativity. From the moment you walk in, the warm, rustic-modern decor invites you to settle in and prepare for something special.\n\nThe menu is thoughtfully curated, and three standout dishes made the experience truly memorable. First, the sea bass – perfectly seared with a delicate crisp on the outside and buttery, flaky texture inside. It was served with a subtle, fragrant broth that elevated the dish without overwhelming it. A beautiful example of balance and restraint.\n\nEqually impressive were the papas bravas, a must-have for any tapas lover. Madre’s version is both classic and elevated: crispy on the outside, fluffy within, and draped in a spicy aioli that delivers just enough heat to make each bite addictive.\n\nBut the dish that stole the show was the hamachi crudo with blood orange. A stunning plate both visually and in taste, the brightness of the citrus cut through the richness of the hamachi, with hints of herb and spice tying it all together. It’s the kind of dish you remember long after the meal is over.\n\nService was attentive but relaxed, and the wine list had smart Spanish selections that paired beautifully with the meal.\n\nWhether you’re a Greenpoint local or just visiting, Madre is worth the stop. It’s a fresh, sophisticated take on Spanish cuisine that doesn’t try too hard – it just gets it right."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKM1J3YmJuNnJlTFRnEAE",
            "text": "Went for dinner to celebrate my husband’s birthday! I must say that the food is amazing, we left the place feeling so happy, food quality is great, full of flavor and perfect portions. Service nice and friendly. Definitely recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb3Jmd3RRRRAB",
            "text": "A time was HAD! My husband and I joined my cousin and her partner for brunch at Madre and we could not have been happier with the restaurant choice.\n\nAs we all know, food and drinks at brunch will literally make or break the flow of conversation and great vibes✨!! And at Madre, thanks to the superb service, exceptional cocktails, and fantastic food - we literally were all extremely happy, had amazing conversation and left very very satisfied.\n\nIf I had to give a shout out to a few of our favourites from brunch it would have to be: the Gambas Al Ajillo, the Brown Butter French Toast and the Octopus!! Yummmmm!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMS12LXh3RRAB",
            "text": "WWow, the vibe here is just amazing! The food, cocktails, atmosphere, and staff were all so fantastic. You've got to check it out!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNjhQWm9RRRAB",
            "text": "Overall, I had a really strong experience here and I would definitely recommend this place for brunch with friends or date! Ambience is really nice and the food is tasty. My only critique would be the drinks were pretty small for their price and I didn't feel there was much alcohol in them. Nonetheless, I would recommend to try! Would be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbllPVEpREAE",
            "text": "I've had this restaurant on my go to list for awhile.  It did not disappoint.  I went for Brunch.  The Croquetes were delicious.  The Gambas Al Ajillo were good but needed something to balance it because it was heavily seasoned.  The French Toast was also 😋.  The cocktails were tasty.  The prices were reasonable.  The service was really good.  The restaurant is pretty.  The bar has a lovely mural.  I would definitely be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc1lpMmRnEAE",
            "text": "If my taste buds could write a thank you letter, it would be addressed to MADRE."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMGFTX053EAE",
            "text": "Brussel cabbage, octopus were my favorites. Spicy Madeleine was also interesting."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbUplNGV3EAE",
            "text": "Muy lindo la verdad che"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRN0tpRlRnEAE",
            "text": "Every dish was flavorful, refined, and made with quality ingredients. The octopus and cornbread madeline’s were my favorites. The ambiance was good, the space was nicely decorated, and service was convivial. 10/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbHRUT1B3EAE",
            "text": "this restaurant was on our list for a while, came here to celebrate for a galentines brunch! ordered eggs benedict, wagyu burger and their french toast with gelato to share with the table. their brunch menu is extremely small :(, i got the wagyu burger and it was really heavy. i couldn’t finish it and it was alright! but their french toast was on a whole diff level - loved every bite, perfect touch of sweetness and aesthetic :)."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncHB5QkhREAE",
            "text": "This place has been on my list for a year now. The food was so fresh and tasty. still dreaming of the pasta and cornbread madeleines..\nI would definitely be back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncXRPdVlBEAE",
            "text": "Came here on a Saturday night to try for the first time.  Food was Ok at best.  Hamacihi was good. Croquettes were ok.   The rest of the meal was average and nothing to go back for another time.  We sat in a corner table that faced an unattractive wall that had a door and lane looking pineapples on the wall and not to mention the line for the restrooms was right in front of us.   It felt like a hotel restaurant with a lack luster entrance and the sever acting as hosts.   Very unimpressed and average experience for $100+ per person.   Brooklyn needs NYC food and service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMGF1ajdRRRAB",
            "text": "Came for dinner and was very very happy with our experience. Croquettas, miso brussel sprouts, scallops, octopus, short rib All amazing. No skips. Cocktails are original and delicious. The service was shockingly good. So many people always checking in. It's a well run establishment. Can't wait to try for brunch!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfLUthNXp3RRAB",
            "text": "I love this place! The dinner prices are a little high for what you get but the vibe is great and food is excellent. I’ve wanted to try them for brunch but there aren’t any vegetarians options (and the menu is pretty small to begin with)."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOTlxUDVRRRAB",
            "text": "One of the best restaurants in Brooklyn. Ask for recommendations (LOVE the fluke crudo) and try everything you possibly can, and must get the seasonal soufflé for dessert!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2djVTS1RREAE",
            "text": "Favorite local spot for modern tapas. Very unique take on traditional fare. We enjoyed the array of raw dishes (scallop and hamachi), very memorable. Great service and relaxed atmosphere."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bUw2dlNBEAE",
            "text": "Sunday brunch at MADRE is not to be missed! I started with a refreshing Mimosa and an intriguing non-alcoholic cocktail, “Bring Me A Shrubbery,” which was a unique blend of flavors that prepared my palate for the feast ahead.\n\nThe food was nothing short of spectacular. The Gambas al Ajillo had just the right amount of garlic and chili kick, while the Hamachi was perfectly complemented by Japanese eggplant and Calabrian chili. However, the stars of the meal were the Cornbread Madeleines (deliciously buttery and impossible to resist), the Wagyu Burger (surprisingly lean yet packed with juicy flavors), and the pièce de résistance, the Brown Butter French Toast. This French toast, served with roasted bananas, strawberries, toffee, and ice cream, was hands-down the best I’ve ever had.\n\nBrunch here is only available on Sundays, and it’s worth planning your weekend around. I’m already looking forward to my next visit."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cjRmRHd3RRAB",
            "text": "Excellent food, great service and cocktail menu, but save room for the manchego cheesecake. It’s To. Die. For."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aHItZEpBEAE",
            "text": "Had dinner here last Saturday night. Everything was spot on. I got the Sea bass, not a big piece but very tasty. Loved the fries for a stater along with the croquettes"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2a3VXN0Z3EAE",
            "text": "The experience and food were very underwhelming especially considering the rave reviews. Portion sizes are ridiculously small for the price, like the croquetas. Some parts of the octopus had a bitter taste and the texture wasn’t great. Out…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2X1BDekhREAE",
            "text": "Amazing place to go for drinks and a bite. Servers and bartenders are very nice and helpful. Andrew isobel and Jakub were fun to talk to and have a laugh! One of the best restaurants in Greenpoint."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dkwtMkt3EAE",
            "text": "Excellent food and service!! Andrew, Jakub, and Isobel were very amiable. I reckon one of the best in the greenpoint area."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQLWZxYjdnRRAB",
            "text": "A bit confused with the high ratings. The croquet’s were too salty. The octopus was highly rated but it was too rubbery and felt overcooked. I genuinely almost spit mine out. The french toast was pretty good but don’t believe the social media hype. For the price and quality, i’m so disappointed and will never be back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcll1Y2FnEAE",
            "text": "we try to go to madre at least a few times a year and order as much of the menu as we think we can eat in a sitting. the cocktails are always innovative and delicious. the service is incredible. the food, however, is what keeps us coming back. the menu changes frequently enough that by the time you're reading this none of the items i could mention would be on the menu, but everything is expertly prepared, thoughtfully plated, and, if past experience is any indication, absolutely delicious"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeFk3ZV93RRAB",
            "text": "Been coming here over the years but a few  things changed which was a bit disappointing. We ordered the croquettes, aguachile, octopus, and mezzelune. The food was a lot saltier and the presentation of our food was somewhat lacking. Each dish left a dry and salty aftertaste. The mezzelune we had a few months ago is a completely different dish now, which we were sad about because that was one of the best we’ve ever had. Yesterday, all our food came in small bowls that seemed put together last minute. The presentation we got made our first visit seem like a michelin star experience. Maybe yesterday was a busy and unlucky time to dine but nevertheless, the food was still tasty and our bartender was very kind."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYZ2J5TVFREAE",
            "text": "Walked in on a Saturday night for dinner and was able to grab seats at the bar without waiting. The truffle croquette, black sesame praline scallops and steak tartare were definitely the highlight of the meal. Service was very attentive and everyone was super friendly. I also like that we didn’t feel pushed to order drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdm9LNlRnEAE",
            "text": "Everything was a 10/10. Literally the best dining experience I've had in a while. Food was amazing, service was incredible. Can't wait to try their new menu when it's released."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucC1MaDlRRRAB",
            "text": "Amazing experience here! Food was great, server was friendly and professional. Overall A+!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubllHdTh3RRAB",
            "text": "Amazing food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN0pDa3F3RRAB",
            "text": "I came to Madre for brunch to try a few of their dishes that I’d seen online. The restaurant itself is super cute so I was excited when I got there. Upon getting the menu and ordering what I could, I realized that the menu had changed and a lot of what I wanted to try was no longer offered or was different. The waitress explained that to me and I was fine with it. The black truffle croquetas were amazing. My boyfriend ordered the burger which we both liked. I ordered the salmon and eggs benedict. I did send it back because it wasn’t really to my liking but again, wasn’t their fault. The manager (unfortunately didn’t get her name) came over and let us know that our entire meal would be comped because of the changes we weren’t expecting! They also sent over free dessert! It was so incredibly kind and unexpected. We were beyond impressed by the customer service and plan to go back to try their dinner just because of that. That level of attention is hard to find these days which makes Madre a stand out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcUxMUTlRRRAB",
            "text": "Creative menu and amazing service. Went with friends to celebrate graduation and we ordered maybe 9 dishes. Everything was phenomenal and very fresh. Croquetas, chicken, soufflé, and oysters were my favorites."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIa2R1TW1BRRAB",
            "text": "Unfortunately soufflé no longer on the menu. Food was otherwise great, and ambience was pleasant. For some reason it still did not reach my expectations (which were quite high)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIa0lYQTZRRRAB",
            "text": "Many better options in GP. Odd vibe being in a hostel like hotel lobby and overpriced for what it is. Creative cocktails and dishes, but doesn’t hit flavor wise."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3b3JfSXBRRRAB",
            "text": "Really lovely place, with a creative and unique menu. Fresh flavors, exciting presentation, and kind service.\n\nThe dining room is lovely, and would be a really great place for a dinner date or a friends dinner with plates to share. I went with a few friends so we could try as many things as possible, and it didn’t disappoint. Have some wine, order everything! My favorite was the aguachile!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdDdfSmlRRRAB",
            "text": "My recent dining experience left much to be desired in terms of taste, although the place itself isn't bad. The menu, unfortunately, focused on some questionable combinations that didn't quite hit me.\n\n📌 Ambience\nLocated within a hotel, the restaurant exudes a charming European ambiance. The decor is lovely, and the bar seating is particularly inviting--ideal for a relaxing cocktail after a long day. The open window feature adds a delightful touch, creating a pleasant atmosphere with a mix of locals and hotel guests. The vibe is lively, with some good music and a friendly crowd, making it an enjoyable place to unwind.\n\n📌 Service\nThe service was outstanding! Our server went above and beyond, showcasing professionalism and helpfulness throughout our visit. She recommended the Aperol Spritz, which was perfect (as perfect as if I were in Piazza San Marco, in Italy).  She also suggested an equally impressive non-alcoholic cocktail, highlighting the restaurant's excellent selection of non-alcoholic options. Her attentive and involved service truly enhanced our dining experience.\n\n📌 Food\nThe food, however, raised several questions. The menu features some unusual and not entirely successful combinations.\n\n◼︎ Chicken Liver Mousse: This dish was average and overly fatty. While not terrible, it didn't compare well to other versions I've had.\n◼︎ Ceviche: The inclusion of peanuts was puzzling. While the Tigre de Leche was delicious, the roasted peanuts felt out of place and needed to be picked out.\n◼︎ Truffle Croquettes: These were delicious and a safe choice on the menu.\n◼︎ Octopus: This dish was a disappointment. Mixing octopus with chorizo and an overwhelming amount of garlic resulted in a combination that was far from tasty.\n◼︎ Dessert: The desserts were delightful, easily the highlight of the dinner\n\nMy main concern with the food was the unbalanced nature of the ingredients and weird combinations, which left me feeling very thirsty afterward--this is always an important indicator of a poor, unbalanced recipe.\n\n📌 Overall Experience\nOverall, my experience was mixed. I feel like this place is only as popular as it is due to its social media hype. The ambiance and service were commendable, but the food left much to be desired. Would I return if I lived in the neighborhood? - Probably, yes, for a drink for sure. Would I make the effort to visit if I am not from the area? - Probably not. The unbalanced and disappointing food would likely deter a repeat visit.\nWhile the experience wasn't entirely bad, the food imbalance was a significant letdown."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1NHZmTXhRRRAB",
            "text": "Was really excited to try this place given the strong reviews. The vibe of the restaurant is very nice with the tropical plants. Our waitress was also very helpful. The food was just alright, croquettes were good but the cauliflower purée was quite salty. Our mains - the tile fish and octopus were both well prepared however they were accompanied by chickpea salad and some squash & salsa salad that were both very sour. Maybe it would’ve been better with some basic roasted potatoes or just anything not that tart. Oysters were good. Chicken liver mousse had a weird taste."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNnNTc2lBRRAB",
            "text": "The meal underwhelmed given the social media hype. They have switched their menu for the summer and some of the new dishes did not deliver.\n\nThe tuna ceviche ended up lacking the punch and balance of flavour you would expect from a solid ceviche. The strawberry flavours overpowered the tuna.\n\nThe $2 oysters were solid and the cornbread Madeleines were excellent.\n\nHowever, the Eggs Benny was quite disappointing with a dried out muffin bread.\n\nThe bananas French toast to end was a solid dish.\n\nHowever, the meal had too few winners to make it an enjoyable experience. Also, the service was under par with dishes coming out in no relevant order. The cocktail recommendation was disappointing being cloyingly sweet.\n\nOverall, it seems the new summer menu has rough edges and there is a lot of room to improve before it becomes worth your time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeDZUdkNBEAE",
            "text": "Was excited to come, but honestly pretty mid. The pork was cook really well though. The apps were forgettable. The souffle was okay.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOHZDckJREAE",
            "text": "I recently visited MADRE for brunch, and it was an absolute delight! Although I initially came with high hopes of trying their soufflé (available only during dinner), I was pleasantly surprised by the diverse and delicious brunch menu. The black truffle croquettes were a crispy delight bursting with truffle flavor, and the signature octopus dish won over even my friend, who isn’t typically a fan of octopus, with its tender texture and perfectly seasoned taste. The dessert French toast was a dream come true, topped with both tide sauce and vanilla ice cream—utterly decadent and satisfying. The staff were incredibly friendly, adding to the warm and inviting atmosphere. MADRE has definitely become my new favorite restaurant in Greenpoint, and I can’t wait to return for another fantastic meal!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c3F6SzdRRRAB",
            "text": "Friendly staffs, good vibe, and beautiful dish presentation. We ordered a range of dishes and they were tasty. Reason for 4 stars is because we were quite rush to order although there were plenty of time between when we were seated and when we were supposed to give up our table (~2hrs). We ended up leaving an hour before we were supposed to give up our table anyway since we are usually fast with our meals. Another reason is although the food were delicious, it was standard of what we would’ve expect from similar restaurant. Still worth a visit for a good time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeU02U1NBEAE",
            "text": "Food and service for brunch time are amazing. Recommended. Have to come back for dinner. The croquettes were great as others have stated. The chicken mousse liver was surprisingly good. They even gave us extra bread when we ran out without us prompting. Superb service.\n\nThe Egg Benny was very fluffy and flavorful. The Octopus is a must try. There are other items on the menu that we have to taste next time. Good experience. Perfect for dates. Bar seating is recommended if you need anything in a jiffy or asking for recommendations."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocWFDSXV3RRAB",
            "text": "I love good cooking and even more if it is accompanied by a good wine or an innovative cocktail.  It is really fascinating to find a place where you can experience a true gastronomic adventure.  Each dish is a perfect combination between food, history and culture.  I also highlight the exquisiteness and the fusion of the ingredients.  I am falling in love with this place.  Thanks to each of the people who made this gastronomic experience possible because the service and the accompaniment were incredible."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDLU5lbHNRRRAB",
            "text": "Everything we ordered was delicious. The outdoor seating is lovely and well lit. Service was incredible, everyone was very friendly. Definitely recommend the octopus, liver mousse, agnolotti, croquetas and eton mess for dessert.\n\nThe octopus was cooked perfectly and paired well with the sauce and corn. I loved the chicken liver mousse, the pickled vegetables rounded off the flavor very well. Croquetas were very creamy and truffle-y on the inside, so good.\n\nThe Eton Mess dessert was so delicious. The corn bread added a mild saltiness to the dessert that went perfectly with the ice cream and blueberries. I loved it.\n\nThe chicharrones were good, but I wouldn't say it is worth it.. they are kind of just pork rinds with cheesy cheeto flavoring.\n\nAll of the cocktails on the menu were delicious. I especially liked the gin and tonic.\n\nOverall, a little pricey for the amount of food you get but everything was delicious and on point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cHEtZlRnEAE",
            "text": "Had an amazing experience sitting at the bar at Madre. This place has it all. Great cocktails, food, wine and attentive service. Chris was our bartender and even though he was very busy, he didn't miss a step, understanding what type of food and drinks we'd like and making great suggestions. My wife and I shared a few dishes and also sampled each other's drinks, with everything coming out superb. We really enjoyed the oysters with the strawberry mignette, the agnolotti and the chicken. Oh, and the cornbread. Finished everything off with a banana souffle desert. Will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNXZHZFFREAE",
            "text": "This restaurant deserves a Michelin star. It’s that good. The food was absolutely delicious. Their ceviche is on par with the best high end Peruvian kitchens. The skate fish entree was so flavorful yet light and perfect for springtime. The chicken had the perfect balance of smoky (bbq) and tangy (salsa verde). Just top notch cuisine. Also, beautiful presentation. The staff are all super welcoming and accommodating. I also loved all the greenery throughout the airy space. I’m so thrilled I got to try this and highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxa2VIN0dnEAE",
            "text": "I had been following Madre on Instagram for a year dying to try their food, so I was so excited when my friend made a reservation. We showed up and immediately were taken care of; they even brought us champagne for my friend's birthday. We had the most beautiful table set up, the service was immaculate, and the food did not disappoint. All of our servers gave incredible recommendations, were extremely kind and helpful, and the general manager Jean Carlos provided us with one of the most special meal experiences we have ever had. I will be telling everyone I know about how amazing our night was. Definitely plan on heading back there as soon as I can."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxckozaU5nEAE",
            "text": "Everything was well executed. The menu is fairly compact but done well. I much prefer that than the extensive menus that barely do anything good...\n\nWe had two complimentary dishes that night, an appetizer with chips/dip and also a miniature creme brulee. Both were great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbl9YRHhBRRAB",
            "text": "Blown away by the exceptional food and quality of service. True professionals in every sense of the word, at the highest level of care for what they're doing. They were super accommodating to our 2 year old daughter who it should be noted had 2 birthday cupcakes earlier in the day and was on a complete rampage - harassing fellow patrons, dumping water on the table, sprinting outside at a moments notice - but not even that chaos could hinder this experience. The only thought that would take the experience to the next level (other than a babysitter) is a more intentional playlist, but that's a nit on a 10/10 evening."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGaGRmM3V3RRAB",
            "text": "From being escorted to our seat to walking out full and happy. This restaurant gives you exotic flavors. The happy hour oysters are delicious. The cocktails have a unique blend of bitters and creativity. Highly recommend trying both brunch & dinner menus."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLczhyeUhnEAE",
            "text": "Amazing service and food. In short, we will definitely be returning soon to try other dishes and their brunch menu. Everything was delicious!\nWhat we liked the most is the octopus and Cornbread Madeline.\n\nThe oysters were so refreshing and tasty. Will definitely order a dozen next time!\n\nThe portion is definitely bigger than we thought. I was uncomfortably full by the end."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNnBiQkVnEAE",
            "text": "The food here was very good, and the service as well. But it did not quite live up to the hype. Perhaps we had our expectations of such too high. My girlfriend and I lived down the street and passed this place every day, and it was always very busy. We had to book a reservation a good amount in advance. Our favorites were the octopus and the ceviche. The chicken was a little bit too salty. But we really enjoyed our experience. We’d probably go back and we’d recommend it to others as a Greenpoint favorite."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLXI2Mm1nRRAB",
            "text": "This place will wake up your tongue. So many different flavors and textures in the meal. This place is an experience.\n\nCame for my birthday and everything we ordered was SO good and presented so beautifully, the salad, mocktails, etc.\nThe wait staff was really attentive and nice as well. Still dreaming about the whipped butter 🤤🤤🤤🤤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bWVYSUR3EAE",
            "text": "What a lovely surprise for a Friday night!!\n\nI showed up by myself without RSVP and asked to be seated at the bar, the staff was beyond friendly.\n\nWhat you see on the photos is a scallop dish that’s off-the menu but I was lucky enough to try because a friend of the Chef was sitting next to me and I asked if I could have it too, they were so nice to me and let me order it :))\n\nAbsolutely delicious.\n\nMy main was the lobster agnolotti which was heavenly and balanced.\n\nFor dessert I had the chocolate mousse because I really wanted to have a glass of chartreuse on the rocks as digestif, thought it would pair well.. I wasn’t wrong,  but the best part is that the staff hooked me up with the banana pudding (with horchata) and my mind was blown. Perfect Friday Night. Fin\n\nCan’t show enough appreciation for making my solo date so wonderful! Hope to be back soon.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bE8tVWdBRRAB",
            "text": "Madre was a super fun experience to try - the highlight of the dinner was the fluke ceviche and the strawberry banana soufflé; and I don't even like bananas! I thought the cocktails were average at best, the one I got was all ice so that felt like a ripoff. But, chicken liver mousse and the octopus was excellent. I would return to Madre, but with a little more focus on trying new dishes and avoiding the cocktail I had and I would try something different besides the Kurobuta Pork as I thought it was average. I expected more flavor there. Service made up for it with free potato chips (some of the best I ever had) and the crème brûlées. All in all, solid experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMWVQT2xRRRAB",
            "text": "Madre! It was amazing.  I tried to walk in the night before and it was too busy, so I made a reservation for tonight and the hostess remembered me and gave me a nice table! She is very sweet and welcoming.\n\nThe food is unique and the server helped me choose some of their house specialties.  I'm a Chef in the Caribbean and was blown away by the flavors and presentations.\n\nWhat stole the show was the service though... The GM Giancarlo (sorry if I spelled wrong) went over and beyond to make me feel and home and all servers and busers seemed to work very well together as a team.\n\nHighly recommend Madre to anyone looking for a wonderful dining experience in Greenpoint."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2ejhUZFRBEAE",
            "text": "Good food and excellent service! Tile fish was really well balanced with flavors and ingredients. Everything on the plate really went well together. Corn and Brussels sprout were yummy and went really well with mains. Everyone else in the party were equally satisfied with their dishes. Definitely recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPM3ZIVVpnEAE",
            "text": "Decided to try Madre on a Friday Evening.  Staff was kind and courteous.  The drinks were delicious, I tried “An Uneasy Partnership of Coyotes” it was exquisite. Loved the flavor combinations of every dish, especially the black garlic with the pork and morels. Recommend to those who want to excite their palette."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aTczVjBRRRAB",
            "text": "The entire experience was exceptional! I live in the area and finally made my way over for dinner. I wish I had went sooner. The people made this a night to remember. It’s the details that matter the most. If you’re looking for a great place to have dinner, a great vibe, exceptional service and insta worthy yummy food then this is the place to go. Date night, girlfriend hangs, it caters to all. I started the night for a work meeting, had my 7 month old with me for a bit. The team immediately helped to put our stroller away safely, provided a high chair and nice cover for the chair and they brought him sliced bananas to the table. Again, exceptional experience. Thoroughly impressed. Will have to come back to try their brunch.\n\nThanks to Armando and team for the wonderful experience. 🙌🏾"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdnZ5VXpRRRAB",
            "text": "Had a fantastic dinner here last night. $2/oyster happy hour deal was a pleasant surprise, and they were really good. All of the other food we got was very delicious. Fluke ceviche, caraflax cabbage, and octopus were prepared and presented really nicely. Service was great. Table was a little small and close to the one next to it, but other than that, great experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLdXN5X1hnEAE",
            "text": "MADRE is officially my new favorite restaurant in Greenpoint! Amazing service and staff. Every single dish we ordered was a 10/10. The flavors were top notch, atmosphere was so warm and romantic. We will definitely be returning!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydVBieVBnEAE",
            "text": "pretty solid brunch experience, great service and enjoyable atmosphere. we ordered everything to share, and  personally i loved the ceviche and cornbread, the daily special pulled pork and eggs are great too! beware portion wise some main might be appetizer sized. would recommend and come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGdmFySExBEAE",
            "text": "Madre in Greenpoint truly exceeded my expectations. As someone who tends to be skeptical about restaurants endorsed by food influencers, I was pleasantly surprised by Madre's exceptional quality. The food was an absolute delight, boasting a unique and delicious flair that made every penny worth it. What stood out even more was the generous portion size of most dishes.\n\nI must highlight my favorites—the sweet potato lobster pasta and the truffle madame croquets were absolutely outstanding. The staff were incredibly accommodating, making the overall experience even more enjoyable. If you manage to secure a reservation, consider yourself lucky; I highly recommend it! If you live rather far away from here, I still say it’s worth the trek.\n\nAnd let's not forget about the desserts—simply fantastic! Madre in Greenpoint is a culinary gem that I'll undoubtedly visit again."
        },
        {
            "date": "1년 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0bDZHOVh3EAE",
            "text": "私のお気に入りのお店です。\nジーズンでメニューが入れ替わりますが、私のお気に入りのオイスターとクロケットはいつも置いてあるお思います。\nサービスもよく、お味も良いです。\n夏シーズンの週末は、店頭で食事を販売していました。\n\nIt's my favorite store.\nThe menu changes depending on the season, but whatever you eat is delicious.\nThe restaurant has good service and a fun atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbUxUWEpnEAE",
            "text": "Ok so found this place on tik tok and it actually lived up to the hype. Went for brunch and would highly recommend. Every dish we got we loved. Here’s what we got:\n\n- cornbread Madeleines: definitely worth it, great start to the meal\n- croquettes: I usually don’t love truffle but this is a well made dish where nothing overpowers. Would def get again\n- fluke ceviche: definitely the most out there thing we ordered. Would get again if looking to be adventurous\n- burger: one of the best burgers I’ve had in greenpoint in months\n- French toast: holy mackerel this was the best French toast I’ve ever had. Looking for a sweet brunch? Get this\n- Octopus: this is great, and their marquee dish from what I can tell. Light and refreshing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNDhQUzNRRRAB",
            "text": "I took my MIL for brunch at madre and we both were blown away. The food was incredible. The octopus was cooked to perfection and the fluke ceviche was literally the best I ever had in my entire life. I’ve worked as a cook for 10 years and every restaurant I’ve ever worked at, we always had a ceviche on the menu. This ceviche was something I’ve never had before. Please, whatever you do, ORDER the ceviche. If I’m being honest, I would travel JUST for their ceviche. It’s that good. My servers name was Armando. I remember his name because he was that kind to us. He was busy with other tables but he still found time to check on us many times throughout the meal to make sure we were doing good. Madre is the perfect intimate restaurant to visit. The food is amazing and the staff is realllly nice! I can’t wait to go visit for dinner"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbHFHWTRnRRAB",
            "text": "the most fantastic brunch you could dream of. must get the octopus and french toast. absolutely unreal. the french toast is the largest slice of brioche topped by a delicious toffee heart attack and caramelized banana. octopus add some health and wellness to the meal and is so tender and balanced with the sauces. must go."
        }
    ],
    "reviews_count": 83
}