{
    "name": "21 Greenpoint",
    "place_id": "ChIJp4jIhmpZwokRabZfKVJPoBY",
    "grid": "BK1",
    "address": "21 Greenpoint Ave, Brooklyn, NY 11222, USA",
    "rating": 4.4,
    "user_ratings_total": 338,
    "phone_number": "(718) 383-8833",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbllrTmxTSEIwVEZocFR6TldORWhIVW5GUVdFRRAB",
            "text": "I brought my cousin for her birthday and she really enjoyed the food and the service. The food is so delicious, my favorite is the Rigatoni with the lamb and the Tres Leche dessert. We will be back, I mean its by 2nd time dining here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUVFsbzFUa0ZrTmxkV1QwTjBWbWxWV21aRmFuYxAB",
            "text": "By far, the best chorizo breakfast burrito in ALL OF NEW YORK. The bartender Max is a sweetheart.\n\nSincerely,\na Mexican guy from the southwest (I know my burritos)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0dGFtRnFRVWxXY0VGWWMxWTVlbmRWTTNwb1lVRRAB",
            "text": "Omfg this place was the perfect place for my bday gathering! I had Scott as a server and he was literally the most absolute amazing server I could’ve asked for. Like I wanna be his friend. The burger was to die for and the bartender need to leave restaurants and open up an upscale bar bc the drinks were amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMGNEQkhkbHBVUlZjMk9WOTJSMnBWT1ROc1FuYxAB",
            "text": "Took 90+ minutes to get food. The waiter was lovely, management was terrible. Wish I could say the food was worth it, but tragically not. Want to believe the kitchen was understaffed but not confident that was the case based on what…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wclJWTkZMVlp2U0d4TE9XVkpZV2xHVTJSYVpIYxAB",
            "text": "Manager has no idea what they are doing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCR1NYRXRTM1pCVmtOeVpsbGZiVlo1ZG5WbVpFRRAB",
            "text": "Just came here to say the roasted chicken dish is the bomb - deep spicy flavors w the zip of roasted peppers and those dreamy, creamy mashed potato’s. Probably the best chicken in the neighborhood I’ve had recently. Well done, guys"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkZlJYcE9iM1ZQYW5kYWJqTTNjM28xZFZabVZIYxAB",
            "text": "I've been coming here since it was River Styx and it's my favorite place that's stood the test of time. Used to be the only spot on GP ave. I like to sit at the bar and order dinner sometimes with someone, sometimes solo. It's generally easy to get a spot at the bar and I like that. Bar reservations should be illegal. The food is good and the menu changes, service isn't pretentious! What else can you ask for?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWlkzWTFTREZ5WDFsdVJHcEVWMlJ5YlhkU1VGRRAB",
            "text": "My brother took me there in May for the first time. Had wedge salad and roasted chicken. Came back this past weekend while housesitting for him and got exactly the same thing. Love the dressing on the wedge and the long hots is a nice touch on the chicken. Phenomenal place. Will be going back in the fall."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4S2F6WmZUbXhMVUVkSWJraHZkVXB4T0RSbGQzYxAB",
            "text": "Came here for my birthday and it was amazing. 100% worth it and everyone is great here"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLZlQ0NXZrbVl6aE1REAE",
            "text": "Okay wow the clam-am slice (only served on wednesdays) I devoured instantly. It was incredible. They also took a classic wedge in a simple way that made me beg for more. Better yet, add on incredible atmosphere and service (we had Scott he’s a great vibe).. Yeah yeah you can say I recommend :))"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQVFhoTnF6Z2U2YnlBRRAB",
            "text": "Obsessed with this place - love the bar seating, love that you don’t NEED a reservation and even if you need to wait you eventually get a seat. Food is incredible - and while I LOVE the chicken (truly), we must must must bring back that life changing pork chop !!! will be back soon :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYm95UFNMekppWDNnRRAB",
            "text": "One of my favorite places on Earth"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdW95ekV3EAE",
            "text": "The chicken was wonderful. Very moist and the seasoning was excellent.\nAlso, the wedge salad is first rate. It has a very interesting bite to it as well."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaVpXZkFnEAE",
            "text": "Good food, love the Wednesday pizza night.  Great focaccia!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMS1UV0JnEAE",
            "text": "Food and service were fantastic"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJalpMdDVBRRAB",
            "text": "had an absolutely gorgeous dinner with my husband here. our server Scott went above and beyond, with their service and recommendations. cannot wait to come back! many thanks to the entire team at 21 Greenpoint."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eE4yM0RBEAE",
            "text": "This place is a hidden gem! We came with a large group and was impressed with the service and food! All the dishes were great, the chicken was a standout. Perfectly cooked."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcjhLcE1nEAE",
            "text": "Fantastic food and amazing staff. Everything on the menu reads as familiar, but then you get it, and it's so much better. Can't recommend this place enough."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndjhlZWp3RRAB",
            "text": "Best burger on earth! Love the staff and the atmosphere"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMExubVd3EAE",
            "text": "Excellent food, wonderful service and a fantastic location. Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN01ydTR3RRAB",
            "text": "21. Greenpoint truly stands out as a restaurant in Brooklyn that cares about its menu and gives it their all. The owner is one of the sweetest people, and I’m so happy that this place exists."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdU1lbDVBRRAB",
            "text": "Great service and vibes. My one complaint is I don’t think the huevos ranchers was gluten free but it’s my fault for not confirming.\n\nThe bar was setup with Sunday papers, which was a nice touch, and everyone was really friendly. It seems like a place with a lot of regulars for good reason.\n\nWe will definitely go back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcHNubm5RRRAB",
            "text": "Amazing and that’s says a lot. Sunday 2pm we had brunch everything was 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNV9HaEJ3EAE",
            "text": "Great vibe.  Friendly staff. Good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYazZEYXZRRRAB",
            "text": "This spot is a gem, good people and good vibes. Spaghetti Meg Ryan 🫶🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOGFtXzF3RRAB",
            "text": "Great American bistro!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaHBPQjRBRRAB",
            "text": "Waiter with the mustache and hat was not friendly nor helpful when we asked questions about the menu. He seemed inconvenienced anytime we asked something and it made for an unpleasant experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucksydmR3EAE",
            "text": "This is my go-to spot when folks are visiting NYC because it’s consistent and delicious! We’ve probably eaten here at least 20 times over the last few years and tried most the menu. It’s all delicious but they have the best burger in NYC IMHO, a great vibe, excellent drinks, and incredible staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuM2FHbVJBEAE",
            "text": "I had the clam slice. It was delicious, decadent and very filling. Perfect for dinner al fresco in late September."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdE52TDdBRRAB",
            "text": "I ate the nachos, burrata and the pasta. Dinner for two with no alcohol was about $90 including tax and tip.\n\nNachos were good, but skippable.\nBurrata was a grand slam! The bread that it comes with was also just spectacular.\nThe pasta and meatballs was also delicious. Meatballs were skippable but the pasta was not.\n\nI'd come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bDhiUkJREAE",
            "text": "Can't reco this place enough. Food was phenomenal. Service was amazing. Vibes were great. I came here after my courthouse ceremony/wedding and the owner gave us champagne on the house and hand delivered all the food to our table. The pizza and clam bread thing...... I will never forget. It's burned into my memory. Will definitely plan to come back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMHJMSDJRRRAB",
            "text": "We love it! It’s our go-to neighborhood spot. The spicy spaghetti with breadcrumbs, the fish, the hot dog you can casually order on the side of any meal, the service - we love it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyOUpYbVJBEAE",
            "text": "Regretfully, this place has gone downhill. A fun evening with friends was soured by a very disappointing experience at 21 Greenpoint. With a 2hr plus wait time for our pizzas the management was very defensive and unapologetic, taking the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycEpDZXVRRRAB",
            "text": "Sadly an enjoyable evening with friends became a very disappointing experience with over 2hr delay to make 3 pizzas. Management decided to spin it that such a wait is totally acceptable. Very poor experience and unlikely to return with so many other great local places opening up in greenpoint."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbHVDWHRnRRAB",
            "text": "Nice restaurant for dinner"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6Zzd5NGpRRRAB",
            "text": "This place used to be so great! We used to enjoy bringing family and friends to 21 Greenpoint, but after the past two experiences we can no longer recommend it.\n\nLet's start with the great parts of 21 GP: great decor, exceptional wines, killer burger, nachos that are flavorful w/ generous portion, the fries and dipping sauces, and the shrimp and grits!\n\nOverall the quality of the food seems to have slipped over the past 6 months. Burgers have come out noticeably overcooked. Nachos have been soggy when they reach our table. But the main dealbreaker is the drastic drop in the quality of service. On our last two visits we have waited for over 45 minutes to get our food. The last visit was the worst. Our server was impossible to find for a majority of our visit and was obviously overwhelmed. We saw basically the whole patio around us get seated, get all of their food, and cash out before our mains even got to us. When asking what kind of water we wanted we asked for sparkling and did not realize that it was $10 bottle (not a huge deal, but let us know). After a 40 minute wait post-appetizer cleanup, we asked where our food was and we were informed by another server that it was \"up next\". When we finally did get the check (had to ask the other server before our server brought it) there was no acknowledgment of the wait or service. Nothing. Unacceptable at this price point with so many other great options nearby."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdDUyWFlREAE",
            "text": "Great spot. Drinks are amazing. Must try the olives+canned fish. It's shockingly delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMDdqendBRRAB",
            "text": "Always an amazing meal and top notch service! My never fail happy food place ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURELXBEWDlnRRAB",
            "text": "Cool little place near water. Not sure if going for the neighborhood crowd or if this will be a destination. Regardless, worth taking a look."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeUl2NUJREAE",
            "text": "Wednesday pizza is epic. Might be my fave in Brooklyn!?\n\nService could be a bit friendlier/ welcoming. It's cold and breezy inside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MVpfZ1R3EAE",
            "text": "We love this place, great food, great ambiance, and great staff. Their attention to details is what makes the difference."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdFpMN29nRRAB",
            "text": "21 Greenpoint is Brooklyn gold! Warm atmosphere, friendly staff, and mouthwatering food. Great spot for a cozy dinner, a great ‘date night’ option, and a nice place for a Sunday brunch."
        },
        {
            "date": "1년 전",
            "language": "om",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROOWJPSlpnEAE",
            "text": "Meg Ryan Speghetti! Yuuuuuuuum."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxeWJ5WGx3RRAB",
            "text": "A solid bar with a nice ambiance and great drinks. I got the drink with fennel in it and it was very good."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsenFLM1BBEAE",
            "text": "Classic American fare that is a bit expensive for what could be considered upscale bar food. The nachos were tasty but served mostly cold and the steak frites was okay but could have had a bit more flavor, but the peppercorn sauce they serve it with helps give it some taste. The service was super and the best part of the experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbXJ2OTNBRRAB",
            "text": "Great beers and meatball appetizer...the Focaccia bread is 🔥🔥🔥"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGbzR6SDF3RRAB",
            "text": "Great spot we had a family dinner of 6 and were graciously hosted. Great spot for some light meals and good ambience"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1c2RHMFZREAE",
            "text": "Bring back the gumbo guy!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dGZYZ0pREAE",
            "text": "Amazing space with great food. The focaccia is insanely good, don’t skip it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1X3FlTERBEAE",
            "text": "Sadly it’s not the same like with my last visit in early 2020: back then it was fantastic.\n\nTonight:\nToo soft spaghetti\nDry meatballs\nTomato Sauce way too spicy, burning everything down"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNHBiQmt3RRAB",
            "text": "The service was pretty good, the food was mostly great, the ambience was the biggest detractor for me. Too loud and too busy—but that’s not really under control of the staff. The -1 star is because the crispy artichokes were WAY too salty and the saffron aioli that came with, though good, didn’t pair well with the artichokes at all. The focaccia was incredible - a must get. The sauce it comes with is kind of like a red pepper paste vinaigrette  and I wasn’t expecting to enjoy it but it was great. The bread was also good dipped into the saffron aioli. The chicken was super moist and well cooked with an excellent crispy skin and tons of garlic. All around a good experience!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKemZEalRnEAE",
            "text": "At the end of Greenpoint Ave, just before Transmitter Park is this amazing and delicious chill spot. Sitting outside on a cool summer day, people watching and having a delicious cocktail was perfect.\n\nThe food was delicious and very well plated. Service was friendly. All around positive vibes in this place. Plus I came to find out Bill Murray sometimes pops in to guest bartend or work as a waiter. Nice perk since his son owns the restaurant. Enjoy!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOS0zbUJnEAE",
            "text": "Came here for a late brunch with a couple of friends and it was very chill. The place is bigger than it looks on the outside with nice sky-lighted seating in the back. We got the wedge salad (3.5/5), jalapeño cornbread (4/5) breakfast bowl with veggie chorizo (4.5/5) and shrimp and grits (4/5). Everything was solid, overall a pretty solid brunch place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSb3FMN2VnEAE",
            "text": "Pretty much everyone in our party wasn’t impressed by the food. The place is beautiful and ghe decoration is really really nice. Very interesting perhaps for a drink or two. Maybe going here for brunch wasnt the best experience. Staff…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1M29LVllBEAE",
            "text": "One of the best brunch places in the neighborhood. Great ambiance and really amazing food. We got the wedge salad, the shrimp and grits, and the jalapeño cornbread. Everything was great, but the cornbread was probably the best I’ve ever…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMmE2SVZREAE",
            "text": "This place is truly one of our ride or dies. There’s always something new happening with the menu, the cocktails are great, the staff is super friendly and best of all, the interior is gorgeous. Come here for a early drink at happy hour and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdFpHZll3EAE",
            "text": "This place is cozy and beautiful inside, but the food falls flat. While I was excited for the mahi mahi dish, I was disappointed by the lack of flavors. The churros were a nice touch, but could be easily found elsewhere. The wine, however, was the best part. Not sure I’d go back because the food is pretty average."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNThYMlFBEAE",
            "text": "Brooklyn has so many new and interesting restaurants opening up everywhere, it is not easy to keep up. The name of the restaurant is the address of the restaurant, makes it easy to find and to remember.\n\nIt was pretty packed, and seemed rather small. They had a bar right at the entry, and very small amount of seating... But, we discovered they actually have more seating in the back with bigger tables! The back room was very nice and cozy, quiet and relaxing. Well, until this room got filled up.\n\nWe ordered a few items since we were all hungry. We got a Special Pizza of the Day, which was white pizza with mozzarella, permesan, and pepperoni. It had quite the punch from the chili flakes, good and spicy!\n\nWe also ordered a Market Fish, which was Scottish trout. The fish was very much like salmon. It had great mix of fish and sweet watermelon!\n\nThe last item we ordered was Pork Chop New York. The pork chops was nothing like I imagined, and quite tasty! The meat was packed with flavor with perfect amount of seasoning.\n\nFor dessert, we asked what the “Seasonal Cobbler” is, and we were told it is apple and pear. It came out piping hot, rather small but since we were full, that was ok. It had some rosemary that added aroma and flavor which was quite pleasant. It was not too herb-y but just enough.\n\nI was used to getting ice cream with cobbler in the past, but their cobbler does NOT come with ice cream. So, we added order of ice cream as well. We chose Vanilla and Blueberry Olive Oil ice cream. The ice cream came out first, and it took a while for the cobbler to come out. So about the time the cobbler finally reached our table, the ice creams were gone…\n\nThe service was good and friendly. We were taken care of nicely, felt welcomed in a relaxing atmosphere. It was a good find on the restaurant, with good food and service. The price point is rather high, though."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcE5iMzJnRRAB",
            "text": "Called to make reservations and the guy on the other was incredibly polite. Who ever seated us, also polite and welcoming. The server was attentive and knowledgeable. Service was beyond great. Food was very good, not earth shattering, but very good. The shrimp ceviche I found tasted too much like olive oil. I wouldn’t get that again or recommend it. I got the pork for dinner and I thought it was really good. My girlfriend got the tagliatelle. It needed salt but otherwise good. The drinks were really good. Really good. Overall, nice local spot that I would definitely go back. The bar next door is also a good place to check out"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbk9DTGNnEAE",
            "text": "Mussels are great. Burger is mediocre at best. We also tried the lettuce boats and they were borderline cold. Decor is really nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyci1Eakl3EAE",
            "text": "Loved the atmosphere here\nThe workers were all very nice and informative\nThe inside seating is beautiful\nThe food was good.\nI loved the spaghetti Meg Ryan’s sauce. It was amazing.\nJust wish the roast chicken had more flavor ."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRX2ZUYl93RRAB",
            "text": "When i ordered, I think the manager overheard me contemplating getting a pizza or some other app. Because I’m of the opinion that there are too many restaurants today that have pizza on the menu. Like a true New Yorker I prefer mine as a…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlM1BMWG53RRAB",
            "text": "really cool spot with a very chill aesthetic. solid brunch selection. really enjoy the use of a wood fire grill to be used for other things."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzOGJhS1Z3EAE",
            "text": "Amazing and cute brunch spot, the breakfast pizza was incredible and the 21 breakfast was as well. Great service and coffee!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVemVIbHNnRRAB",
            "text": "gorgeous location, remarkable food, excellent cocktails made by Jen!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyXzhXY19BRRAB",
            "text": "Favorite restaurant in Brooklyn. Great food and drinks, owners super friendly! Go on wednesdays for pizza !!!! 10/10"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3blpIZWtRRRAB",
            "text": "Cool space with a frequently rotating menu. The selection for vegetarians isn't that extensive."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhM0w3UVVREAE",
            "text": "I don't know if I can say something is underrated when it has made it into the Michelin Guide, but I feel like this place is underrated.  The menu is well thought out and all of the dishes are really well done and sourced.  We have done two…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbXJUbWJ3EAE",
            "text": "I usually don’t leave reviews on restaurants. However the reviews that are posted are entirely misleading, and inaccurate. Had the reviews accurately reflected the quality of the restaurant we would’ve never dined here in the first place. So in the name of full transparency, here it goes.\n\nMy fiancé and I came here to cap off an amazing night. But little did we know we’d be dining at the most remarkably underwhelming restaurant in all of Brooklyn.\n\nThe service was dramatically slow which was laughable considering the restaurant was virtually empty. We waited a little over an hour for our food, and when it finally arrived it was a colossal disappointment. Calling the food bland is honestly an insult to bland food. No, it was more like dissatisfaction was the only seasoning they had in their spice rack that day. They have zero business pricing their entrees the way they do.\n\nOh, and Don’t even get me started on the restroom. Straight up disgusting.\n\nIn conclusion if you have the option to go literally anywhere else, do yourself the favor and skip this one."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdHNxRkZREAE",
            "text": "So I love the space itself and the cocktails are great. But for dinner I had the smoked mushroom pasta and there was just too much liquid smoke in it or something because it was not good. I was with a group and everyone agreed that it was no bueno.  The other stuff I tried was good, especially the pizza so maybe I ordered wrong. I'm sure I'll go back and if my food is better I'll change my rating because the space is great.\n\nEdit: came back for brunch and had a much better experience so I’m giving back a star."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHaWFLM3RRRRAB",
            "text": "I took my girlfriend here for a birthday dinner and WOW what an amazing time.\nThe staff was on point, funny, and charming.\nThe food was perfect. Drinks delicious. They made sure she got a happy birthday…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOF9LUzRBRRAB",
            "text": "Decent, not great, food in a space that has kept the same decor through the last three iterations of restaurants. $32 for a plate of pasta and then they ding you with a credit card “service fee” when it’s time to pay - never disclosed up front. The best was the snotty comment from the server when I asked to have the fee removed when paying cash. Over $100 for 2 appetizers and 2 entrees - no drinks - before considering any tip. Come prepared to empty your wallet."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNmZMSEJnEAE",
            "text": "Such an awesome gem in Greenpoint. Had a delicious brunch today. So much flavor and and staff was exceptionally cheerful and made great suggestions. The warm pancake with blueberries is heavenly. Highly recommend. Ask to sit outside if weather permits. Owner is super nice and came to our table which made experience even better."
        }
    ],
    "reviews_count": 73
}