{
    "name": "Paulie Gee's",
    "place_id": "ChIJuc8AM0BZwokRtpm2S66ltsE",
    "grid": "BK1",
    "address": "60 Greenpoint Ave, Brooklyn, NY 11222, USA",
    "rating": 4.6,
    "user_ratings_total": 1659,
    "phone_number": "(347) 987-3748",
    "reviews": [
        {
            "date": "16시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVGNGTTVaamd6Um1rNFNVNDNVekZpT1VwaFNVRRAB",
            "text": "Pleasantly surprised by this spot. Looks like a casual bar, but serves some great pizzas. We got 3 pizzas for 6 people which worked great. The spinach pizza was great.\n\nFriendly staff too"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aWRVSTJNRVpEY21ObGFHWnNSWEl3VFdzM1ZIYxAB",
            "text": "Solid pizza spot by the pie in Greenpoint"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kT1YyTnlTbVpoZG1kNk4wMUllVVpWVmpORFNXYxAB",
            "text": "I got a spinach pie tonight.  Absolutely incredible.  Best Pizza I've ever had. I'll be bringing my family here soon."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZlJIZDVXVFEwUTIxdFJEVk1iRFYwT0hGb1ltYxAB",
            "text": "Beautiful space and nice service but have to be honest the pizza was very mid. Super greasy and soupy and literally two little pieces of basil both on only one slice. Crust was not crispy. Maybe today was an off day but I was not impressed especially for the price"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cWRUbDJNekJJUWtOVWJISnZSazVzYjBoS1puYxAB",
            "text": "My favorite pizza spot in NYC. Never fails."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVVUwZ3lSSE5HZFRsbExUaFNYMWR2VjBnNFVGRRAB",
            "text": "The food was delicious!! Such a cool, hip vibe"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneFdtWm9NazFMYjFKWFJ5MU9XbUppZG1seFVYYxAB",
            "text": "Several pizzas at our table of 7 and everything was delicious.  Highly recommend the dessert seen on the Jimmy Kimmel show.  Very good."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeFJHOHdhbWc1VEc5aGVtNTZiMWh4YjNReWJXYxAB",
            "text": "We were there for a late lunch and ordered a pizza, beer and the homemade limoncello. The pizza was delicious and you must try their limoncello. We'll be coming back for sure :)"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWldYcENPSFZFV0hsWFZuQjFXRzFWTVVWR2JtYxAB",
            "text": "Vegan pizza here is really dank. Some of the best I’ve had. Also a really nice arugula salad."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213eFRsOUlWek5vZUVKRFNVTXpTbEZvTFhGUVYyYxAB",
            "text": "Best slice in Williamsburg, better then industrie, fini , best pizza , chrissys etc. Neopolitan, delicious dough, inventive toppings, perfectly cooked. Can't really find fault with it and it's half as expensive as it could be."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWU5TMXdSblExVEcxa1R6QXhVVnBDTjNWQ1JHYxAB",
            "text": "Honestly their crust hits.\n\nRecommend ordering a second to take home.\n\nCute vibe, really fast service, and the staff were very kind.\n\nWould definitely go back anyday..."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNU0wVjBWVEZTTkVGU1p6WlljbXBUUTNoNlgyYxAB",
            "text": "Amazing wood burning pizza!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdExDZ0hBEAE",
            "text": "Best pizza in Greenpoint!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oM01tTjBiV3Q0UzB0d1VERjZPR1JPWVhoQ2RVRRAB",
            "text": "I've eaten pizza all over the world. Showed up here for a late night snack and night cap. My mind is blown. This might be the best pizza I've ever had. Brick oven, wood fired deliciousness. Good job, guys."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMmMzaHlTbDluWDJzNE5HSkxjSFZZVkhWaWJWRRAB",
            "text": "Vegan slice and a Coke. Heavenly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSUVUzZEZWblZDY2pCaFowSlJMWHBEY0haV04yYxAB",
            "text": "We come here for the vegan pizza for which they have multiple options. Nothing boring either and there is different kinds of mock meat (sausage, pepperoni).\n\nLove the interior of the restaurant. Service has been consistently good both times we’ve been here. Portion sizes are great. Pizza is so good I have to control myself and not want to order two pies for myself!\n\nMy only suggestion is to offer one or two vegan apps as well.\n\nDefinitely one of the top places to get vegan pizza in the city."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdVpFMXhORlIxYUd4QlRXaFlhRE42WDFKU1RWRRAB",
            "text": "Always so good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treVUxZGZhMUJNWWpSZmRsSldRazh5YUhkaGVHYxAB",
            "text": "LOVE this place! Incredible pizza and kind, attentive staff. My husband & I hosted our wedding afterparty here and it was truly unforgettable -- great food, drinks, vibe, and support. 10/10 recommend!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRFoxOXBNa2t4V0dObGNtWnZXbTluUkUxaVFrRRAB",
            "text": "Great pizza and it’s not to expensive pretty affordable! Nice atmosphere and very nice pizza"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNlMwWklSME5JY1cxRWJtWm9TRmRNUlc1aVVrRRAB",
            "text": "Rude staff, mediocre pizza, expensive prices"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMVVrNVpWMU5pTFZKNGNHOVFjUzFtZW5BNVlXYxAB",
            "text": "Que rico todo!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxblVtRndjRTR0ZFdjM1NURTBRbVpVWDA5bmFXYxAB",
            "text": "Best pizza shop in Greenpoint Brooklyn"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGelNtbHFRVU55VVZkM1UwVldjMWwzTlRSaVZYYxAB",
            "text": "Legit coal oven delicious pies. Fun service from local staff. There's a reason why it's at top of so many lists. Sitting down at the restaurant was also pretty darn civilized."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdWNtaGtjMEpaY2xWdldVUm1XUzAyWjBSemIxRRAB",
            "text": "Wonderful place to grab a quick, delicious, oven fired pizza. Several delicious vegan pizzas on the menu! Their house made sausage seitan is delicious! Back of house and front of house worked as a team and were incredibly kind and efficient. A great place for a family meal!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kamMzTkJhQzB5Umxob1dXNU9PRU0xVlVONlEyYxAB",
            "text": "🍕 Paulie Gee’s – Greenpoint, Brooklyn, NY\n⭐️⭐️⭐️⭐️⭐️\nOne of Brooklyn’s best-kept secrets? Paulie Gee’s, hands down. This place doesn’t just serve pizza—it elevates it. From the moment you walk into their rustic, candlelit space, you know you’re in for something special. The vibe is hip, the staff are passionate, and the menu will have you drooling before you even sit down.\nWe ordered two pies and that was it—I was done in the best way possible. The dough is soft with just the right chew, the crust has that perfect crisp, and the toppings? Creative, fresh, and full of flavor. As a vegan, I felt seen. Their vegan menu is stacked with options like house-made vegan sausage, cashew ricotta, and Numu mozzarella. No compromises, just full-on flavor.\nParking can be hit or miss depending on the time, but it’s worth the hunt. Whether you’re plant-based or just pizza-obsessed, Paulie Gee’s is a must-visit. Trust me—I’m vegan, and this place is the truth.\n\nBoomsauce Scale:\n🗑️ B – basura (trash)\n😐 BS – basic (come on! Try harder)\n👍 BS + – better (Yo! That's better)\n🔥 BS ++ – best (alright! Alright! Alrightttt!)\n🌟 BS +++ – Amazing location! now that's boomsauce!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdlR6TnJjV04xWnpsMmRWY3hUSHA0WVVOM1pVRRAB",
            "text": "The Pickleback Martini is fire. Get the Arancini and you have to get the hellboy and the margarita as well. Pizza doesn’t flop and has a great chew to it, probably my favorite Neapolitan I’ve had. Definitely stop by if you’re in greenpoint!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRFQybzNNQzB0YmpsTE1WQkpiVmRCTURKUk9WRRAB",
            "text": "Great spot! Fun pizza combos and welcoming decor"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUGJFZHBWRU5mZVhSVlQxa3hhSEpXVkVSV1lVRRAB",
            "text": "I’ve been going to Paulie Gee’s for years, which never disappoints me. Lately, I’ve mostly just grabbed slices from their little joint around the corner for a quick fix, which is always solid. But with family in town this weekend, I finally made a proper reservation to sit down at the OG spot in Greenpoint and have a whole pizza experience. And still so good!\n\nPaulie Gee’s makes Neapolitan-style pizza, and it does it right. In a city flooded with pizza hype and constant “best-of” lists, crowning one king is impossible. But judging by the original Hellboy pie, it’s up there. It's sweet, spicy, crispy, and soft—just a perfect combo.\n\nThe restaurant itself is super chill. There is no scene, just good vibes, good pies, and a cold beer. It's the perfect spot to hang with friends or show off NYC pizza culture to visiting family. Depending on your crew, they’ve got different pie sizes, and while they have other menu items, my advice is to skip the distractions and stay focused on the pizza.\n\nOne standout worth calling out: their fennel vegan sausage. Even if you don’t usually go for meat alternatives, give it a try. It’s packed with flavor and a perfect option if you’re trying to stay veggie without missing the “meatiness.”\n\nAgain, NYC pizza is a crowded game, but Paulie Gee’s has been consistently great for years, and that says everything. If you haven’t been, go. If you’ve been, go again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNFZ6ZFNYemREUVROU05rTmxVaTFFV1RJMlpHYxAB",
            "text": "I tried the Bill and Sal's Excellent Adventure IPA on draft and was not disappointed. My gal had a Paulie Colada which substituted amaretto instead of rum and she loved it. The Daniela Spinachi with the tomato sauce instead of just white was absolutely delightful.  The arancini was amazing with the melted mozzarella inside and tomato sauce outside complemented it so well.  Our server, Jordan was warm and welcoming, super attentive, and so on her game. The flexibility on the sauce was a big deal and made for an even better meal. The atmosphere is classic old nyc brick and wood with pizza related cultural artifacts.  Oh, yeah, easy street parking! Are you kidding me? C'mon. Loved it and will absolutely be back."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SQk0xWnVjWEpRYlZRd1RFdG9PSFpmWkhGZk5tYxAB",
            "text": "I’ve been here many times over 10+ years, it was always very good…sad to say but it seems to have fallen off. I’m seeing in other reviews that they changed mgmt, which probably explains it. I recently went with some family visiting from out of town for lunch and got two pies, a ricotta/arugula and a magherita that the menu said came topped with fresh basil. Check out the pic to see how much actual basil the pie came with 😂 Also the tomato sauce was super bland. There was four of us, our server recommended we get three pies but we figured we’d start with two and take it from there. Suffice to say nobody was really interested in a third. Service was decent but we were one of only two tables and our server forgot one of our drinks. Unless you’re craving a vegan pie there’s better pizza options nearby these days."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKSEtnNHI3aTdTS0lREAE",
            "text": "Okay, I just had dinner here and must confess that I have mixed emotions.\n\nI’ve dined here dozens of times so will try to be balanced here.\n\nOn the positives, the service was very good and friendly and the atmosphere remains generally intact from the ‘old’ Paulie Gee before the mgmt. change. The Hellboy pizza continues to be a showstopper! The expanded menu looks interesting, though we sticked to the classic pizzas that we generally order.\n\nThat being said, there were a few things that were unusually below par. One of the pizzas was significantly burned. I know that Neapolitan pizza will generally have a little burn on the edges but this one was just too much. We order a vegan pizza but it was extremely dry, it clearly needed more tomato sauce. Finally, the dough in general felt more dry than it used to be, giving the pizza a more crunchy feeling vs the more chewy and puffy dough it once had."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZXUyZDZtcEs2VVNnEAE",
            "text": "Had an absolutely delicious dinner in the bar area tonight. Ordered Sal’s meatball, a green Caesar, the Hellboy and a Bubba Guy pizza. Everything tasted sensational and came out at a perfect pace to enjoy with a bottle of red. The wine list was easy to navigate and had something for everyone including some baller wines. Paul was an excellent server, the playlist was groovy and the vibes were super good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLVN3TnVGeGJ1TDlnRRAB",
            "text": "Best pizza"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLQ3hsXzY3OHVtQld3EAE",
            "text": "The pizza was incredible straight off the menu! And our server Sienna made sure we were well taken care of the entire time! I’ve been revisiting Greenpoint with my wife often recently and we always make a point to swing by Paulie Gee’s for dinner."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdUF3UDY1eC1IcFBnEAE",
            "text": "Amazing food, James is great and makes a fantastic paper plane!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaHFQY3JRRRAB",
            "text": "How the service has changed from what it used to be. Pizza used to be amazing, now it’s mediocre at best. Coming during the day and not allowed to eat inside."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvakxqWnJ3RRAB",
            "text": "After filling yourself with good cheese, dough,and meats it's conveniently located next to a park so you can pass out from the food coma."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNUtDWGpnRRAB",
            "text": "Great pizza, great vibes. Thank you Paulie Gee's staff for treating us visitors so great! It was our first time in New York and our cousin said we had to try the food at Paulie Gee's. We were glad we ate here and the staff was incredible."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcmJYaEhBEAE",
            "text": "Food was delicious!!! Loved the eclectic flavors of the different pizzas! 10/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvd1pQbzFBRRAB",
            "text": "Good, but used to be much better. Pizzas not shielded by hot honey are not that flavorful."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMkpHRzFBRRAB",
            "text": "Delicious pizza. Their signature pie is only good if you don’t mind the salty and sweet together."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbjRmU3RRRRAB",
            "text": "Solid slice and if you are lucky you can sit in the booth in the front and really get the vibe."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbXVITUJREAE",
            "text": "Paulie Gee’s is the Best 🍕"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdE1pTmFREAE",
            "text": "Hellyboys go cray"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNklEWTNRRRAB",
            "text": "Some of the best pizza in New York City"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dDliMkRnEAE",
            "text": "The vegan pizza was so good, the best I have ever had! In fact so good that when they handed it to me I thought it was not vegan. I recommend the Hellboy. I will be back every time I visit Brooklyn. Maurice took my order and he was really funny and kind!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b05UYVhBEAE",
            "text": "good ambience with low light and a table right next to the oven.  pizza’s were unique but not fancy (off putting imo). staff was friendly, helpful and jovial.  would definitely come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRd3FmMzhBRRAB",
            "text": "The best pizza I’ve tried in Brooklyn so far !"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNU5feWhRRRAB",
            "text": "Amazing servers and phenomenal pizza! Their espresso is also amazing... plus, they're open late and live music!!! So glad we found this gem."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnem8tTVhnEAE",
            "text": "Awesome pizza and vibes! Def worth visiting and type of spot where I'd love to bring my friends from different town"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvOGJ2clRBEAE",
            "text": "장기 유학생이라 뉴욕에서 여기 저기 많이 먹어봤는데 여기 진짜 맛있어요👍🏻 한국분들 여행하시면서 괜히 비싼데 가서 맛없는거 드시지 마시고 여기서 합리적인 가격에 맛있는 피자 드세요! Hellboy가 대표 메뉴이니 이건 꼭 드셔보세요! 매운데 달콤해서 처음 맛보는 맛있는 맛일겁니다👏🏻…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnbjZiMzlRRRAB",
            "text": "피자의 도우가 맛있고, 피자 메뉴의 선택폭이 굉장히 다양해서 좋다! 물론 맛있다!!"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDcFlqbXRnRRAB",
            "text": "가격도 저렴하고 직원분들도 친절해요 분위기도 넘넘 좋습니다 bb"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNXE3UlZBEAE",
            "text": "The restaurant had a rustic feel, low lights, nice art. Customer service was okay. The pizza was $23 for a 12” with 6 slices. The dough wasn’t too quality, tasted like all purpose flour, very chewy, flimsy and the crust did NOT have a crisp. The restaurant perhaps is cutting costs and not purchasing bread flour or double zero flour which would give a much better foundation and crust. I would not return for the pizza until they use better quality flour. The good thing was the Saratoga water, but it costs $8. The alternative is tap water and they didn’t say filtered tap water. So my date night experience could have been better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dDczY29RRRAB",
            "text": "Great atmosphere and pizza. The pizza tasted so fresh and we loved the recommendations given by the server. Would come back again! Highly recommend getting the Hellboy's Pizza. The hot honey was such a game changer."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNE92TEVBEAE",
            "text": "Paulie Gee’s in Greenpoint has that classic rustic feel—dim lighting, wooden tables, and an ambiance that’s cozy but nothing particularly memorable. The menu leans into creative topping combinations, some more successful than others. I tried the “Red Hot Cherry Jones,” which, despite the name, wasn’t hot at all. The touch of honey added an interesting twist, but after a couple of slices, it became a bit much. The “King Harry” was even less remarkable—totally forgettable.\n\nThe real letdown, though, was the dough. Chewy in a way that suggests a less-than-stellar flour selection, it lacked the quality that would make the crust stand out on its own. It’s one of those places people go more for the vibe than the food.\n\nThat being said, Paulie Gee’s has its charm. Opened in 2010 by Paul Giannone. Over the years, it’s built a reputation for inventive pies and has even expanded to other locations. But at the end of the day, all the history and ambiance in the world can’t make up for a pizza that just doesn’t hit the mark."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOUs3aFlnEAE",
            "text": "Above average wood fired Neapolitan. I just wished crust could be bit more crispy. Must get the “Hellboy” and their OG Arugula salad. Good choices of cocktail and wine. My server, she was extremely polite and responsive.\n\nParking in the area is somewhat difficult and meters up till 10pm."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKN2VHNGdnRRAB",
            "text": "It was an exceptional experience at this delightful pizza place. The dining space was spacious and inviting, complemented by a vibrant atmosphere, jazz music, and tastefully dimmed lighting. We indulged in the Hellboy pizza, featuring a delightful blend of spicy honey, and the Ricotta Da Vita pizza. Each bite was a burst of flavor, with fresh toppings and perfectly baked crusts. The addition of pepperoni and creamy sauce provided a delightful texture. I wholeheartedly recommend this place for pizza lovers seeking an unforgettable dining experience."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbUlIYW1nRRAB",
            "text": "Super vibey at night and has all the makings of a cozy, warm, casual bar and late night spot. The pizzas are fantastic, but pricey. Each is the size of a personal pie and around 20-25$ which seems expensive for the area and NY in general.\n\nService is fantastic and the atmosphere is nice to hang out with a group. Will definitely try the slice shop but this is also a nice option to dine in with some friends, if you’re looking for that kind of spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiZ0xXRkRBEAE",
            "text": "Amazing pizza and place ! By far one of the best places to get drinks and amazing pizza. The crust has a great undercarriage. Very little flop on it. The sauce is perfect to the cheese ratio. Definitely will come back the next time in nyc. Stop in and have a beer and a slice !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhX2FmNGt3RRAB",
            "text": "Good pizza. Get there right at 5 because it fills up immediately. My only knock on the place is there are too many options on the menu. I love pizza, probably more than the next guy, but choosing between 20 or 30 different varieties of pies is nearly impossible. That being said, you'll be happy with whichever one you choose. The staff is friendly. A place you need to try.\n\nPizza Adventures: Destination #129"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dU8zVzhBRRAB",
            "text": "Excellent pizza and vibes! I was able to make a reservation for re-opening day which was a super busy and fun atmosphere. It took a little while for a server to take our order but we were patient and the pizzas came out quickly. We ordered the Hellboy (fave), Ricky Ricotta with vegan sausage, and added the Grapeful Dead because we were curious about the pickled grapes (unique flavor). All very delicious pies with perfect crust and unique flavors/toppings."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUN2RLbHN3RRAB",
            "text": "Paulie Gee's is one of my favorite pizzerias in New York. The touch of honey added to many of their pizzas, especially Mike's hot honey, is a game-changer. Be sure to leave room for desserts; both the flan and the tres leches are delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUa0lqYUlREAE",
            "text": "The server was so nice and helped us with recommendations. The food was great as well! I just need one more trip to try a few other things on the menu lol. Definitely recommend 10/10\n\nWe ordered the mikes hot honey wings, Ricky ricotta pizza, tiramisu and rainbow cookie sundae. For the drinks I had the Paulie Colada so tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyLTh6REhREAE",
            "text": "To be transparent, went to Paulie Gee's to listen and enjoy Hannah Ray Teal and her band! Rare opportunity to hear a rising star in a very intimate space in Brooklyn! Her show was awesome and please look her up on Instagram and Spotify.\nHowever, Paulie Gee's totally added to the experience. Had a Vegan Pizza, which was literally one of the best pizza's I've ever had (Vegan or not) Coupled with some tasty cocktails, all served by a friendly and engaging staff! This is a 1st class operation all around and really a genuine 5 star experience. Go to Paulie Gee's soon and live your best life!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMEpyekFnEAE",
            "text": "Sat for dinner (table of four) on a Saturday night after about 15 min of wait. Order experience very smooth—all done on the phone.\n\nOrdered three pizzas, a side of marinara, and hot honey sauce. One of the best dine-in pizza places in Brooklyn. Make sure to ask for hot sauce as well!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieTR5ZHZRRRAB",
            "text": "At Paulie Gee's in Greenpoint, Brooklyn, we had the pleasure of indulging in two standout pizzas: the \"Bubba Guy\" and the \"Ricky Ricotta.\"\n\nThe **Bubba Guy** featured a delightful combination of pineapple, jalapeños, and savory meats. The contrast between the sweetness of the pineapple and the heat from the jalapeños created a vibrant flavor profile, enhanced by the smoky, savory meats. The crust was perfectly charred, adding a delightful crunch and an authentic wood-fired taste.\n\nThe **Ricky Ricotta**, on the other hand, was a masterpiece of creamy ricotta, fresh arugula, and flavorful sausage. The ricotta provided a rich, smooth texture that paired wonderfully with the peppery arugula and hearty sausage. This pizza had a balanced, yet indulgent feel, with a crust that was both chewy and crisp, offering a satisfying base for the toppings.\n\nPaulie Gee's not only delivers on taste but also offers a cozy and inviting atmosphere, complete with quirky decor like the \"Eat Spaghetti to Forgetti Your Regretti\" sign. It's a perfect spot for pizza lovers looking for both classic and creative options. The pizzas are thoughtfully crafted, ensuring a delightful culinary experience with every bite. Whether you're after a sweet and spicy kick or a creamy, savory delight, Paulie Gee's has something to satisfy every craving."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIc05iWmNREAE",
            "text": "I love this place. The servers are always nice, they’re open late and they have many vegan options (nice dairy-free cheese: numu & follow your heart)!! Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEOFA3RnpRRRAB",
            "text": "Delicious, hot out of the oven pies in a cozy wood paneled old school spot. They have espresso martinis on tap but we opted for the wine - all reasonably priced by the glass and super tasty!\n\nBetween two people we shared the DelRay (their version of a pepperoni) and a white kale pie. The DelRay was a juicy and savoring slice with perfect tomato sauce, and salty greasy saucers of meat. They have chili oil and chili flakes which only help magnify the flavors. The white kale has a base of a nut-free kale pesto with cheese and garlic. This one was a sleeper hit. I usually don’t like white pies but this one blew my expectations.\n\nWe also had a tres leches cake which was soaked in sweet milk and had a sponge texture. Not my favorite dessert but it could have been that I was so full at this point.\n\nI can’t wait to come back and try my pizzas. Might be my favorite sit down spot in NY for pizza 🍕❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeThXdmx3RRAB",
            "text": "Went 3 times over 3 weekends and each visit was fantastic! Great atmosphere, wonderful food and and overall a good time. Our third visit was extra special because we also had the chance to have a conversation with Paulie himself. Thanks for the pizza, the chat and the two limoncellos from Paulie🍕"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlLWFiQkZBEAE",
            "text": "Went Paulie Gee's withe the entire family. The place has a cool old school vibe. Dark wood soft low lighting. The staff was friendly and helpful. The food was really good. Six of us split two salads and four pizzas. The pizzas are around the size of a personal pizza and are wood fired. The pizza were delicious. The wine list wasnt huge but perfecta perfect fut for the munu. Definitely a cool place to go hand and enjoy the food."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNM09UVEp3EAE",
            "text": "Hands down the best pizza I have had in NYC so far!!\n\nThe place is dam cool too, starting with walking through the big wooden doors that make the place lol like it's closed. Always lively with a great ambiance this place rocks as a get together with friends or on a nice date.\n\nShout out to the really friendly staff that made everything amazing and even to Paulie who she round checking everyone was happy.\n\nNow all I have left to do is pass out from the huge amount of Eric food we just ate."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhOElyOFF3EAE",
            "text": "There was a lot of hype for this pizza place. It didnt open until 5 so we got pizza from their slice shop around the corner and ate in a nearby park.\n\nWhen we got to paulies it was just before 5 and there was a line waiting to get in. Everyone was immediately seated and i watched a billion more people walk in and get seated so im guessing the space opens up in the back.\n\nI didnt love the cocktails we ordered. There are a million choices so maybe nexttime i will. There were lots and lots of different toppings, many of which seemed odd. Our selection was delivered to the table super quickly, and it was great. Paulie gees is brooklyn pizza for brooklyn people."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwZzVhR1JnEAE",
            "text": "The best Artisan Pizza in NYC! Hands down our favorite. Perfect crust on each pie. Just the right amount of crunch with a doughy feeling.\n\nThe Hellboy is our favorite. We get at least one every time. Make sure you try out some orders from the online menu as well. The Cherry Jones is another favorite.\n\nIt’s a dimly lit place. I wish it wasn’t so dim. You’ll have to be comfortable with sharing tables with other people. It’s just the NYC feel when you have so many people coming.\n\nIt’s very busy. Put your name on the line and go for a walk to the waterfront or shop local while you wait."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJdXVyZmpRRRAB",
            "text": "Their vegan pizzas are awesome!!! There is a line on the weekends so come early. I got the Chopt Til You Drop vegan pizza and it was delicious. The pies are personal size pies. I like the vegan pizzas here than the non vegan pizza. My friend got the vegan sausage which was delicious. The service is good too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbEpYWmtRRRAB",
            "text": "I’ve been coming to Paulie Gee’s for over ten years now and it is one of the very few restaurants where everything is consistently great: excellent service, the atmosphere is wonderful, and the Neapolitan-style pies are fantastic. Still a 10/10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbXEycEx3EAE",
            "text": "Got here early and got a spot for dinner! Ordered the Vegan Wild Honey, the Better Off Veg, and Mo Cheeks. All of the pizzas were delicious! Loved the flavor combinations. Friendly service. Something to note is that it’s kind of loud (bar type atmosphere) which was not bad but something to keep in mind."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvMHBqdXNBRRAB",
            "text": "Good quality pizza and pleasant ambiance.\n\nUpdate: I was here today, I can understand if pizza is slightly charred but the pizza was too charred. The owner was confident that it was exactly how it was suppose to be, but I’m not so sure.\n\nHe said it was not burned but to me if it’s black it’s burned and this was too much even for the “Neapolitan style.” I can understand if the crust was a little blackened but even the basil had turned black. For one, it’s very unhealthy to eat anything that’s blackened because it means there’s a lot of acrylamide and other carcinogens. Moreover, the pizza tasted like it was smoked, burnt. It was not like last time I was here.\n\nHopefully the owner considered making some adjustment to how they’re cooking the pizzas because this seems like an easy fix.\n\nAlso music was way too loud last time I was there."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzekxEWjlBRRAB",
            "text": "This is our second time here and we will continue to keep coming! The hellboy pizza is delicious and the honey ice cream with pecans is a must have! My boyfriend doesn’t have a sweet tooth like me and we almost had to order a second one! If…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dnRiUkNREAE",
            "text": "Hands down the best Neapolitan styled pizza I've ever had. I drive almost an hour from Westchester to enjoy this pizza. I tell everyone I bring that this is the best pizza they'll ever have and  time after time their expectations are blow out of the water. Yes the lines can be long sometimes, but put your name down and grab a drink from the wide selection of draft beers or go walk along the water front and out onto the 200 ft peer that puts you so close to Manhattan that you can almost grab it.\nOne time I visited Paulie Gee's with my girlfriend and she wanted to try Ricotta Be Kidding me, but they were out of sausage.  Our waitress suggested we try it with the Vegan sausage. We were reluctant to try it, but gave it a shot and oh my goodness Vegans you have it good here. The Vegan Sausage didn't even taste Vegan, it was that good.\nYou can tell the owner Paulie loves what he does as he happily walks around from table to table to converse with his customers and makes sure they are enjoying themselves.\nI recommend bringing a few people with you so you can sample more of the menu because everything is top notch and flavorful."
        }
    ],
    "reviews_count": 80
}