{
    "name": "Eagle Trading Company",
    "place_id": "ChIJ1XgwOD5ZwokRn-AHoZDr_d0",
    "grid": "BK1",
    "address": "258 Franklin St, Brooklyn, NY 11222, USA",
    "rating": 4.6,
    "user_ratings_total": 472,
    "phone_number": null,
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGa2FrUjNjMjkwUmtGR01UUlJTbGg2ZDFOTGVYYxAB",
            "text": "If you do find yourself this deep into Greenpoint Eagle Trading Company is a great place to seek out breakfast. I know the name sounds like they sound be selling raw denim or something but in reality they slang great breakfast sandwiches and burritos. Normally I live a toasted tortilla on my breakfast burrito but this really worked w/o that so no harm no foul from me. The matcha and coffee were also good too."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xod1IwWkphV1IzZFd4RlJWbHpjbTFVVVZoTFUxRRAB",
            "text": "Super solid food, strongly recommend the chorizo breakfast burrito. Also I saw what I believe was the owner make sure a gentleman who looked like he needed some help got fed. Feels good to support a local business that pays it forward. 🤍"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NNFJsUndSRUZsUjJScWJYZG5lVlZ0YTBaQ1IzYxAB",
            "text": "Incredible wraps! Friendly service. Great vibe to dine in"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aVlrNW5UREZrUm1kYWNrUm5hSFY1UzJKQ2NrRRAB",
            "text": "Absolute best breakfast/lunch spot in Greenpoint. Amazing menu. Our go-to order is a tuna wasabi melt, tomato soup, and breakfast burrito. You really can’t go wrong with whatever you order. The staff are so friendly; the owner Sam is the nicest. Cute vibe in both winter and summer (when they add outdoor tables). Just couldn’t love this place more."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TWREbEVTMWhmVDJVdFkwdEJWV0ZwVWpCek1IYxAB",
            "text": "Very nice place with very nice people working there. Thanks a thousand times. It was an every morning pleasure. Can’t wait to be back. ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Vk1XRkdOa2hyYVZsbFIzUTRUazlTTFVOVk1GRRAB",
            "text": "Favorite iced coffee in the neighborhood. 1 pump of vanilla, 1 pump of coconut...it's lit. Also, don't sleep on their chorizo burrito. Staff is always pleasant. Huge fan"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSZlkxcGhTa1p6UkZkM1VuaGFTRmwyVDBoNVVXYxAB",
            "text": "Guys WUT is going on. There has been hair in the food the last two times we have ordered. Such a bummer because we liked this place but literally cant do it anymore 😭…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNGFXWm1kRm96ZW1SU1VrdE1aSEJCTW1WWFJIYxAB",
            "text": "Lovely local cafe with ample seating and a healthy brunch menu. I love their matcha lattes💚"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQ2RWODFOa3hUVFdwQ2RVbERaMUpFZFVKM1ltYxAB",
            "text": "Takes a half hour for a take out sandwich. Leaving this review to remind myself not to do it again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaVIzQlhabGczUzJSalJtRlZPR3AxYnpSMGNsRRAB",
            "text": "Perfect place to work from in the neighborhood. Stellar hospitality."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaa1gwNWpjRmQ2TTBwRWNESnJkVlJTYlZWelZHYxAB",
            "text": "The employees here know how to make a good bacon egg & cheese"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OV2VsbzVOekZGVW1Wbk1GQlRZamw0TUZKSloyYxAB",
            "text": "I’ve lived in Greenpoint for two years and can’t believe I hadn’t tried this place until now. This place knows how to make a proper breakfast burrito. The coffee was great and so is the vibe of the place. I’ll definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVlRrcGFORzU2Tm13MFVWOHhWbWg1T1V0bk1YYxAB",
            "text": "What a find! Delicious food (proper aged cheddar), everything is really super fresh. Great coffees and lemonades as well. Super clean inside as well & everyone is really friendly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RNU16VktkMWx2TUZBeVZ6TlVaRGt4YlMxbmQxRRAB",
            "text": "This coffee shop has very good coffee and lemonade :) also, the sandwiches, wraps and tater tots are delicious! Definitely recommend this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLajBrWW5GcTdUMF93RRAB",
            "text": "Iced chaga and chicken parm for the win!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNnM3dG1NdmRIM1l3EAE",
            "text": "Food was great! Lots of options. Garage door walls were open so we could enjoy the great weather."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJNzZrOTY2c1BDUHRRRRAB",
            "text": "I’ve been ordering from Eagle for about a decade. I’ve spent thousands of dollars here.\n\nOut of hundreds of orders they’ve made made 3 mistakes in which the owner and staff immediately fixed.\n\nThe delivery bikers are super nice too."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb09DRm1nRRAB",
            "text": "the best breakfast burrito !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ2NiTlZBEAE",
            "text": "Great coffee! I am visiting Brooklyn and sometimes have trouble finding good coffee during my travels. But this place did not disappoint :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOXY3bDNnRRAB",
            "text": "Great food and employees work here. Always very accomdating and go above & beyond to make sure i have a positive experience. I ordered food once and it was delayed and they remade my order so it wouldnt be cold and the manager delivered it with a free coke! Thank you eagle trading. truly a staple of the greenpoint community!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3a0xTa3B3RRAB",
            "text": "Super impressed with their kale chicken Caesar wrap, delicious! This place is low key and the Service is awesome. I’ll be back to try more of the menu."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRaTZMYXF3RRAB",
            "text": "Stopped by to grab a coffee, enough space for ppl to dine in.\nWhen I was ordering, the first staff I talked to was happy with my question about their food menu. Fortunately another person came up and answered.\n\n☕️✨🥛Cappuccino was super creamy, and the flavor was rich and bold. Great coffee."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbVl5ZUdBEAE",
            "text": "I started going there simply because I was working a few doors down, the food is top notch, fresh and top quality ingredients, i live 40 minutes away on Long Island and I often take the ride just for lunch with pleasure. The owner is probably the most genial person I’ve ever met, I’ve never had the slightest complaint, My favorite place by far"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbzVXN093EAE",
            "text": "Best place in Greenpoint for lunch, great people too!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfLUxmLWN3EAE",
            "text": "It’s not absolutely terrible but is not recommended for a sit in brunch. The door is always left open in freezing winter, the food is heavy and unsophisticated. Decor isn’t great. I am European though so my expectation of food is higher than the average New Yorker. I will say the orange juice is fantastic though."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOFBlVXR3RRAB",
            "text": "The tomato soup here is amazing! Great bowls too. Overall 10/10"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2N1BxZDZnRRAB",
            "text": "I don’t know how I haven’t posted a review here yet considering I come here every other weekend.\n\nThe staff here is great, super friendly and the foods great too. I really enjoy their bagels and their sandwiches. When I’m not feeling well I can always count on their chicken noodle soup and orange juice, freshly squeezed in the morning.\n\nTruly such a Greenpoint staple. Highly recommend this spot for breakfast and lunch!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdmNiMmZBEAE",
            "text": "Guilt Tiping Establishment?"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQc3JPbS1BRRAB",
            "text": "Quick and hot, and delicious. I got the Eagle breakfast burrito and my husband got the chorizo breakfast burrito, both were amazing! Also, we ordered to go, and waited outside, and they brought our bag out to us as soon as it was done. Highly recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzay1ta2VBEAE",
            "text": "Awesome. Pet friendly. Quick service. Great spot for a weekend breakfast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdTV5ZWpBRRAB",
            "text": "I stopped by to get an iced latte for work, so I didn't stay in the cafe. There are a few seats and tables available. The staffs are okay. The iced latte was also okay."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeTRLMjJBRRAB",
            "text": "Great food, great coffee, cool smiling faces working there!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYLXRTekxnEAE",
            "text": "New York‘s best „go to“ comfort food and easy going feel good cafe & brunch place. Perfect coffee, beverages and highest food quality. Delicious everything. Tasteful, classy music. Perfect place. Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMU1YVWhnRRAB",
            "text": "Great food and great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaUlXdW53RRAB",
            "text": "Great coffee and breakfast foods. Plenty of vegan options, but I do wish they had a vegan pastry. Really close to the water, and plenty of outdoor seating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNud05pMWhRRRAB",
            "text": "A delicious selection of a menu, tasty coffee, and a great atmosphere, what’s not to love. Definitely one of my “Greenpoint Greats”"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeTREdG93RRAB",
            "text": "Great place for breakfast, brunch or a quick drink. It is really popular."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdEt6Ujl3RRAB",
            "text": "Overall amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3anNIdWhBRRAB",
            "text": "A perfect spot with friendly people and plenty of breakfast/lunch options!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRaTZEcGpBRRAB",
            "text": "Decent breakfast eats and coffee. They often have really nice baked goods by the front counter. Staff is friendly and accommodating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aEo2YzZRRRAB",
            "text": "Would be 5 stars but they need to fix that squeaky ceiling fan!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicUtQQmF3EAE",
            "text": "Stopped in during a bike ride home.  Plenty of bike parking along the side walks.\n\nThey were close to closing but the staff didn't make me feel rushed and seemed genuinely happy to have me. Super clean inside and they have a good menu of items. I opted for the crispy fish sandwich with fries and ice tea.  To my surprise, I also got a delicious chocolate croissant on the house.\n\nPortion was good and the food high quality with spicy ketchup. They have nice outdoor seating with umbrellas and was kept very clean.\n\nGreat service, great food and great ambience. Definitely recommend."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaDlMZmhRRRAB",
            "text": "Great food and coffee nice friendly owner and staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycU1TOFJBEAE",
            "text": "They have the best coffee and it's hot. The cashier is a Gem. They take care of you here as if you're Family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMlp5ZTNRRRAB",
            "text": "This was a pretty good coffee place with a great vibe. The open windows made my coffee extra enjoyable as I watched people stroll down the street. The muffin was good as well."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScUtqODZ3RRAB",
            "text": "Lovely lunch spot, especially for something on the healthier side. Love their Arnold Palmers -- the perfect balance of sweet & citrusy sour!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOUtDOWl3RRAB",
            "text": "Would be 5 stars but they need to fix that squeaky ceiling fan!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MHR2TllnEAE",
            "text": "Didn’t try their food but the coffee was good. There wasn’t long wait for it and cashier was polite and nice. Definitely recommending if you’re in the neighborhood to stop by for a coffee."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNHZ1bGdRRRAB",
            "text": "Most down to earth coffee shop in the area. The owner/manager(?) is great and it’s reflected in how kind and courteous the staff is. They have great prices for this area and for the quality of the ingredients, not to mention such a variety of options! I have yet to try something I didn’t like.\nMy only wish was that they were open earlier so I could stop by before work🙏"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdzdmd293RRAB",
            "text": "A really good matcha latte, and great service! A good spot to get some work done."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5elBLTlZnEAE",
            "text": "I was in the neighborhood getting my hair done and my stylist recommended this spot. The turkey bacon avocado sandwich with cheddar was amazing! The sandwiches are served on a fresh baguette with a side of cholula. I highly recommend this place. I also got a pistachio latte (incredible!) I highly recommend."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMVBQT3RBRRAB",
            "text": "Not only is this a great coffee spot, they make a fantastic breakfast sandwich and burrito. The only downside is that they don’t open till 9am.\n\nUpdating with a lunch suggestion. Their wraps are delicious and super fresh!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dnIzM3RnRRAB",
            "text": "Solid neighborhood cafe with plenty of options. I ordered a bagel breakfast sandwich and chorizo breakfast burrito to split with a friend while pescatarian friend enjoyed the fish sando and fries. Decent quality for the price, friendly service, and good amount of indoor/outdoor seating. Highlights were the Cholula packets and arnold palmer!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bEticTFRRRAB",
            "text": "Good coffee and cozy atmosphere but I was disappointed that my $10 burrito had multiple hairs in the wrap. Disgusting. And there was one that I had pulled out before this picture too - it was way up in the burrito too - no joke. I also…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dDV5U2dnRRAB",
            "text": "I was disappointed after reading all of the good reviews. Food in my opinion was quite mediocre but the prices were pretty high. On the bright side, the person who served my meal was very pleasant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMTVUMjhRRRAB",
            "text": "First time trying Eagle Trading Company, i was looking for a coffeeshop in Greenpoint for a bite and to do some work, my friend that lives few block from it sent me here.\n\nThe vibe is nice, love the bike hanging in the wall. I was not impressed by the food, my avicado sandwich looked old and didn’t taste fresh."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3NHF5bk93EAE",
            "text": "Rustic looking coffee and sandwich store. The staff were super friendly and the food was reasonably priced. One minor complaint was the sandwiches are served in a basket rather than a plate, giving it more of a ‘diner’ feel than a cafe or restaurant. That being said, it tasted great so no major issue."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbnRpWHpBRRAB",
            "text": "$$$ THIS IS A NO CASH BUSINESS $$$\n\nCoffee coffee here is phenomenal!\nExpensive but really good food.\nEverything they use there is a quality product\nThey are what you would call a successful business\nthey’ve been around for as long as I’ve been working in Greenpoint about 10 years.\nThey’ve changed the menu quite a bit from the last time I was here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbTltXzN3RRAB",
            "text": "This has become our go-to spot for a quick and chilled breakfast/lunch. The servers are always friendly here. The menu is varied and they're very accommodating with alterations too. The coffee is also pretty good! There are 6 or so outside…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhd2RtTmtnRRAB",
            "text": "A wonderful welcome at this cosy cafe in the green point. A great place to enjoy a bite to eat and a coffee. The owner greeted us like long lost friends. The whole staff couldn’t be friendlier and they seem to know everyone. I watched the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtaWJMTTl3RRAB",
            "text": "Trendy, cosy, and tasty coffee place with good coffee and wide verity of fresh sandwiches. Staff were friendly and the place looks amazing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPLWR5d1RnEAE",
            "text": "Peach iced tea is so good! Breakfast is affordable and delicious, love the location and the outdoor seating."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZNDV5QTdRRRAB",
            "text": "This place is great for families with kids in tow. The space is large, it’s served canteen style where you order and sit wherever but they will bring you the meal. The food is always good here no matter what you pick. Iced mochas were our thing for a while here. Philly cheese steak, buffalo chicken wrap, the kale Caesar is delish"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1a3VLemh3RRAB",
            "text": "10/10 for food, coffee, and customer experience!\nSam and his crew run a very relaxed and welcoming spot.\nIndoor and outdoor seating. WiFi. Easy conversation. Cater to special dietary needs with care and attention — always have gluten-free bread!\nSam, the owner and a friendly British guy, has curated a breakfast/lunch menu that has something for all tastes and requirements — the food is consistently top quality!\n\nThank you to Sam and crew (shout-out to Brianna and Fran!)"
        },
        {
            "date": "2년 전",
            "language": "de",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNkw3bTVRRRAB",
            "text": "Tageszeit: Samstag morgens\nPersonal: mega freundlich\nPreisklasse: leicht erhöht\n\nBewertung: das Essen war gut.. Die Portionen sind nicht die Größten.\nNach zwei Speisen war ich angenehm gesättigt."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3ekpHRFhBEAE",
            "text": "My favorite lunch spot. Wonderful sandwiches, great coffee, kids love it and there is outdoor seating on the quiet street. Curry chicken is great as is ham and Vermont cheddar. Nothing is to heavy and the décor is great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcUppdTJnRRAB",
            "text": "Good coffee. Mediocre food. Also for $9.50 at least give me the other half of the sausage patty."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLcXEzeFBBEAE",
            "text": "Wow this place really went all out with being Covid safe. They talk through a little speaker which makes it easy to hear when your order is up. The employees are great. The food is great. Some nice outdoor seating. I’m definitely coming back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrbThQR2FREAE",
            "text": "Really great place to chill out, work or enjoy great good. Family friendly spot with cheerful people. Love their espresso and  breakfast burritos."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVenRELTRnRRAB",
            "text": "Here from the NW, staying close by and wanted a coffee for my morning joe. Great Coffee, Food and service. Will be coming back before I have to leave."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaE5ySVpBEAE",
            "text": "One of the best coffee shops I’ve found in Brooklyn. Great breakfast burrito and coffee. Usually you can find a spot to sit. I want to thank the manager for being so kind to refill my coffee after I accidentally dropped it! My only wish is that they opened and closed an hour earlier/later! Usually it’s 9-3."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNThUT3hnRRAB",
            "text": "I eat here almost daily. The coffee is good. The salads are good. The sandwiches are good. The breakfast bowl is a great healthy and varied meal. The staff is friendly. The space is pleasant.\n\nOrder my secret menu item, “The Nick Lunch Face.” It’s two hardboiled eggs, half an avocado, a bed of spinach leaves and tater tots for ten dollars. I made it up and ordered it so often they made it a secret menu item."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnN3IyeUZBEAE",
            "text": "Stopped by here for breakfast today. Great food and atmosphere at good prices. Place was clean and the staff and other patrons were friendly. Thumbs up from me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOck1ER1RBEAE",
            "text": "Love this place! I order lunch from them at two or three times a month. My favorite is their vegetarian chili, it's delicious. I also really like their bbq chicken wrap. Their tomato soup and grilled cheese is phenominal if you ever have a craving for it."
        }
    ],
    "reviews_count": 74
}