{
    "name": "Wanpaku",
    "place_id": "ChIJ-x1MTMhZwokRrlXD4wA2VMI",
    "grid": "BK1",
    "address": "621 Manhattan Ave, Brooklyn, NY 11222, USA",
    "rating": 4.5,
    "user_ratings_total": 401,
    "phone_number": "(718) 383-3139",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodlFqaFVZVGhNTWpCTlVFbzRkV28zUTFnd2MxRRAB",
            "text": "It used to be my favorite ramen spot, one of the best fries but unfortunately something happened recently, change of menu, not sure if staff/chef changed, but suddenly the fries were coated in some super salted spice, ramen that used to be strong flavor was over salted, and chilli oil which used to be top notch was just tasteless and again super salted and not spicy like it used to be, as a bonus I got food poisoning. No thank you"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obmIyaHBlVUpOTUVodmJGZzRiR2hSU3kwdExYYxAB",
            "text": "This is one of the best ramen in the area.  Flavors are well balanced and deep in texture. A variety of Japanese whiskeys, beers, and sake. Food presentation is enticing. Highly recommend wanpaku for their ramen dishes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbFEzRXphWFpZVms5dFRsSktWRE00UVZwNVUxRRAB",
            "text": "Delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SalRrc3phMlp6TURoZllXZG1YMDFpVkZJMlJXYxAB",
            "text": "Cute space and you can tell they care about the food that comes out. Everything smells great and beautiful plating. In talking with the team it’s nice to hear it’s becoming more farm to table - you can definitely taste the difference from other places in the area. Loved the heirloom tomatoes dish- definitely feels like summer in a dish with the pink tangerines! (Pictured ) they also have a cool looking bar hidden in the back that was packed. Would highly recommend if you’re in the area - worth the visit 🙌🏼"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bk1FTk1OMk5QZEZGME1HOXRPVko2UjNaaFMwRRAB",
            "text": "The spicy pulled pork ramen is insane, y’all… I went for a bowl in 90° heat the other day which should show how good it is!! Dine in at the restaurant and hit up the Hidden Pearl afterwards for a cocktail!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kd1V6bFFhREF0Y0UweE9YcEJjekpWVkZWdE9HYxAB",
            "text": "I tried the cold ramen at Wanpaku and it was such a unique experience—unlike anything I’ve had before! I expected it to be more like cold dipping soba, but it actually felt closer to a poke-style ramen with cuts of salmon, tuna, cucumber, octopus, ikura, etc; on top of ramen noodles and then you pour the sauce over the dish yourself — mixed with the radish, seafood/mint topping, it was really refreshing and flavorful.\n\nThe ingredients could have been a bit fresher, but overall I enjoyed the nice interior, the food was refreshing, and the staff were friendly and welcoming. Definitely worth trying the cold ramen for something different!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQ1kxRTBTemczZUdoc1FXVlRhM2xoU3pOVFVYYxAB",
            "text": "wanpaku was excellent absolutely excellent can’t beat this"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWllVNW5ObkpDY1VsM2JVWmhjV2hWVkdkc1ZrRRAB",
            "text": "Really good place! They have Chirashi cold noodles which is fresh fish with noodles — absolutely 10/10 highly recommend if you can find it! They give you a ton of seafood too.\n\nHave to come back for some of the other options, everything looked great and the interior did too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMYnlxX2Fva295dGFBEAE",
            "text": "solid food for a somewhat reasonable price but the tip recommendations are uncomfortable/borderline egregious (lowest recommendation $10 on a $45 bill??)."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLN3p1cTdIdWM3aVFnEAE",
            "text": "Nice small location , Ramen is pretty Good could use a little more flavor in my beef Ramen . Edamame was tasty and service was on point."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQSEV1cldncHNxYnJBRRAB",
            "text": "10/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOWFlbHRBRRAB",
            "text": "Their ramen is sooooo salty!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNHNLM3VBRRAB",
            "text": "Super solid ramen spot in Greenpoint! We’ll definitely be back. The noodles and charred pork in the ramen were especially good. The truffle fries were fine, not a standout for us. It’s nice they have a selection of cocktails from the hidden pearl that you can order from the menu."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcnRQVWdBRRAB",
            "text": "FOR EXPERIENCED EATERS: DO NOT COME HERE!!!\n\nFood: Extremely Bland and Little Amounts\nService: Alright, but chased us out for tips\nAtmosphere: Depressing but Romantic?\n\nIN DEPTH\n\nFood: Ordered first thing on the menu, one with pork and the other with chicken. Both meats were extremely dry and had little to no flavor. Both also had a burnt taste, which ruined the experience. The ramen noodles were okay. Soup base was HORRIBLE. Extremely bland and ruined the taste of the whole dish and the bok choy because it's supposed to be a supplemental ingredient. Egg was alright, but nobody could mess up an egg. Also got takoyaki, but depressingly, I paid for 5 takoyaki for 7 bucks. Didn't even use takoyaki sauce. They had some disgusting sauce made with barbeque sauce and yuzu mixed together.\n\nService: Service was alright and always filled water whenever they could. I only gave a 1 star rating because I was planning to give a cash tip, but before I had the chance, they rudely came to me and asked if they wanted to charge service tip to card or cash. Therefore, it earned them a 1 star.\n\nAtmosphere: Was exactly what it was, depressing and romantic. Cool temperature lights and a dim atmosphere gave a depressing vibe, but they also put a candle that seemed out of place but felt romantic. The place is very clean though."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Z3UtdTdnRRAB",
            "text": "By far the best karaage in nyc. Try the hidden pearl for cocktails in the back also"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3al9Ed0VnEAE",
            "text": "Mistreatment of delivery workers."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbHVTWWRBEAE",
            "text": "From the moment we walked in… A+++, server DUKE went above and beyond for me and my wife. Besides the great service, the food was out of this world, the appetizer was delicious and the ramen was so rich and flavorful… Definitely coming back soon with me and my wife"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN3BtS193RRAB",
            "text": "Though ramen is there thing, I wanted something that would feel warming and rejuvenating after lots of incline runs.\nThe curry was fantastic. It was exactly what I needed. Lots of sauce and MSG."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnc2F5WmxRRRAB",
            "text": "Best Ramen in Greenpoint"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnemFxY1Z3EAE",
            "text": "Wow!! おいしい！！！The chicken ramen here is so good, especially with the roast chicken on top. Highly recommend the truffle cheese fries as well they are crispy and amazing. Came for lunch and it was definitely crowded but got a table right away. Service was fast and very friendly. 11/10 for authentic Japanese food!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXJqUGtnRRAB",
            "text": "Can’t be more disappointed with their ramen. I ordered Shoyu Ramen which was said in the description “with a marinated egg” but turns out not only the portion looks like a kid size with its noodles only filled the take out bowl to 1/3, but also there’s no egg in it, and it only comes with 1 tiny piece of vegetable.\nAlso, there’s no utensils in the bag despite being requested."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBXy16bTV3RRAB",
            "text": "Light and delicious shoyu ramen. Noodles were very fresh! Different add in options. Edamame was really nice. Bar/speakeasy in the back! Worth checking out for Ramen and drinks"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbHJtUllnEAE",
            "text": "This place goes straight to the top of my list of NYC ramen. The cleaner lighter kind, modest on fat and salt broth is delicious. Chashu is clean, meaty, and has a wonderful amount of charcoal-like grill taste. Noodles are plum. Very well composed dish that you don't have to stand in line for. Spicy chicken karaage was awesome too."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOUx5QnBnRRAB",
            "text": "Amazing ramen on a cold day in NYC. It is located right by train station and needed a good hot dinner. The Shoyu ramen is their signature dish and had that with Chicken and a Kakuni bun to start of as an appetizer. I even had room for dessert - mochi ice cream, the 2 flavors I chose were strawberry and vanilla chip. Great place to eat solo, with a friend or a nice date spot."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfai0yZXF3RRAB",
            "text": "Broth was pretty good, decent amount of noodles and pork. Chili oil was meh, not really worth the extra dollar. It's still a good spot."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdG8tc2dBRRAB",
            "text": "The do quite a variety of Japanese ramen and izakaya style dishes. The shoyu ramen was solid and a decent value - no real wow factor but it was tasty.\nThe Chicken Karaage bowl was good good too. It is more of neighborhood spot than a place to travel for. The bar in the back however was awesome and worth the trip!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdDVQckhBEAE",
            "text": "Very nice Ramen spot in Greenpoint, with a good selection of drinks, and izakaya items. Karaage, octopus balls, ramen all taste great. They have space can fit group of people, so it's good for friends hanging out as well."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNWZfS0RREAE",
            "text": "Amazing sundae.\n\nThe spicy karage and the spicy ramen were underwhelming. We went to the speakeasy in the back, the Hidden Pearl and the ambience is incredible. The drinks were really interesting. The star of the night was definitely the sundae. Well presented and delicious.\n\nThe staff were all super friendly."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Njh5aTJnRRAB",
            "text": "Great Japanese spot in Williamsburg for ramen and other bites.\n\nThe Shoyu ramen with pork was good and the chicken sandwich was decent, but wish the fries were just a little bit better.\n\nExtensive menu, would be interested in coming back to try other items. Heard good things about the karaage and curry."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dDd1X1lBEAE",
            "text": "Sleek spot for ramen. The staff is very nice and accommodating. The beef miso ramen was good but the cucumber salad was pleasantly really refreshing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aXYyeFZREAE",
            "text": "Delicious food, very good drinks and friendly staff."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MUpIb0VnEAE",
            "text": "Ramen was decent and a solid option if you want to satisfy a craving for it in the neighbourhood. Service was quick and friendly."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2d0tLTHlnRRAB",
            "text": "food isnt bad, if ur in the situation in which, for some odd reason, greenpoint restaurants are full, this place does the job. isnt super expensive.…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcnI3UXdBRRAB",
            "text": "Great spot. They have a cool speakeasy in the back that had fantastic drinks."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbmNMQ3lRRRAB",
            "text": "Great spot with delicious food! Super accommodating to our allergies."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdjZfUmdnRRAB",
            "text": "The spicy chicken was very tender and delicious\nOne of the best ramens I’ve ate\nrecommend the pulled chicken/pork"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzZzdPa09REAE",
            "text": "'Wanpaku' –the name– conjures up images of  a young boy licking his lips over a big spread of way, too many, dishes...\nGreat name!\nOverall, I like this bustling little place where the staff was friendly and fast. My decade of Tokyo dining places closer to Asian fusion, not very Japanese, but sometimes you find gems there, right?\nThe beautifully portioned, spicy chicken karaage was tender, and the meat perfectly cooked. But I would go try the regular karaage–not spicy– as the sauce was a bit much.\nThen had their classic ramen: the noodles were great but the soup was way too rich for my blood.  Cheese? Can't say that it didn't (kind of) work but I will go back and try the shyou (soy sauce) version next time."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZzduSmhBRRAB",
            "text": "Went for Happy Hour, got the spicy fried chicken, parm black truffle fries, muscles and a couple of drinks. I thought everything was just ok. Seems like a good local spot for a quick bite."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbVl5aTFRRRAB",
            "text": "Had amazing experience here for dinner, service was great, food was flavorful and the waiters and so kind. Excellent experience with delicious food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIajVYV3FRRRAB",
            "text": "chicken tan tan ramen, karage rice bowl, beef rice bowl, spicy tuna rice appetizer. every dish ordered is a 10/10. customer service is 100/10. must come here and try it yourself."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bzl1cU9REAE",
            "text": "We’ve been coming to Wanpaku for years (our my kid is obsessed with their ramen and asks for it weekly). The restaurant is super clean and cozy (and kid friendly with a great happy hour). We always have the best service - accommodating, polite and friendly. Tonight we ordered delivery and there was a small error on our order (first time we’ve dealt with a mistake from them in all the times we’ve been). When I called, they immediately remedied the situation and went above and beyond to make sure we were satisfied. This kind of customer service will keep me and my family coming back to Wanpaku again and again. The ramen is delicious and usually our go-to but all the items we’ve tried have always been great also."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dVlyZ0NREAE",
            "text": "A solid Japanese restaurant with some interesting and well-done twists on familiar classics, though at a premium to some other restaurants. Not one of the top ramen spots in the city, but it hits the spot if that's what you're looking for. Really liked the flavor of their donkatsu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eVBYYWJ3EAE",
            "text": "ordered fried chicken and spicy tuna rice with mochi ice cream.. the fried chicken tasted delicious and had a flavour mix of Korean and Japanese sauce.. the tuna rice came with a unique and tasty soy sauce.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3OExYZDVRRRAB",
            "text": "Love this place! So cute—perfect to stop in for ramen, love the crispy rice with tuna on top. My husband and I also love the curry dishes. Servers are so kind and drinks are also really tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieWVySFdBEAE",
            "text": "amazing curry!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURienNlRGVREAE",
            "text": "Awesome shoyu-based ramen. The broth was so rich in flavor, it was probably one of the best I have had. Chashu and other elements of the ramen were also very tasty. Atmosphere was also nice and service was fast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNib2JTS25BRRAB",
            "text": "You gotta get the curry. The curry here is so fire. Everything else is whatever afai remember, but the curry. It's where I go for that thing. I suspect this restaurant is owned and operated by Thai people, not that it matters, but I'd really like to find out at some point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid3NhOGRnEAE",
            "text": "Service not good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaDhDeVV3EAE",
            "text": "Nice unassuming restaurant located in the heart of Greenpoint with lots of different eateries around.\n\nWalked in and only had to wait for a couple of minutes for a table.\n\nThe decor is minimalistic and reminds one of the late night Izakaya’s in the heart of Tokyo. Seating is limited and the place was busy.\n\nWe ordered various Yuzu cocktails, Shishito Peppers, Chicken Karage, Squash Fritters/Balls?, Nori Fries, Beef Miso Ramen and more.\n\nThe staff is kind and polite and the service was quick.\n\nTaste wise we really liked the Peppers and the Chicken, Ramen was meh…\n\nWould surely like to come again and try a few more cocktails and drinks from their extensive menu…\n\nP.S. One of the CLEANEST Restrooms You will find - absolutely squeaky clean. Kudos to the staff for taking such good care…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaExHV3VRRRAB",
            "text": "The vegan ramen is amazing!!! Loved it so much."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMGFDNTF3RRAB",
            "text": "Really amazing happy hour! I got the edamame which was so savory and delicious and the karaage chicken. The chicken was pretty spicy so I wouldn’t recommend if you are sensitive to spicy food.\n\nThe restaurant is rather small but we didn’t have problems getting a table on a Wednesday night. The servers were very attentive and made sure our drinks stayed full."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkeUtYNU13EAE",
            "text": "Another one crossed off the list. I wanted to visit the speakeasy portion of restaurant but because of my flight, I had to settle for HH lunch.  Top to bottom, everything was great. The spicy karaage, cucumber salad, and spicy chicken tan tan ramen were highlights. The broth was creamy and rich, truly divine. The crispy rice with spicy tuna was unexpected but a really good dish. Very beautiful space. Can't wait to return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybktmZTBBRRAB",
            "text": "Definitely one of the best Japanese restaurants in Greenpoint. Buns and gyoza are spot on, the karage is juicy crunchy, cooked to perfection, the ramen is extremely flavorful and their yuzu soda is to die for. The place is gorgeous and intimate and the service super good, but you guys need to do something about the doors. Why can't you just close the second door, the one on the actual sidewalk? It's quite annoying to feel this cold air straight to your back every time that someone gets in the restaurant, especially during the winter."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN2RuRG1nRRAB",
            "text": "Takoyaki: not crispy, two small pieces of octopus/squid per piece… disappointing\n\nBeef curry: only sauce contains beef. We added shrimp. Curry sauce is thick and good. However shrimp batter is too thick. Not too crispy.\n\nKatsudon: soggy katsu drenched with sauce."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdDVUNzJnRRAB",
            "text": "Recommend the cold noodles for summer for those who love a good bowl of ramen but can’t stomach a big bowl of hot soup in the summer. Tsukemen is a touch salty for our taste but good if you prefer saltier broths.\n\nGood for kids and groups of up to 6."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURla01ocRAB",
            "text": "Wan Paku has a great ambiance and very polite and attentive staff. The Kakuni bun, honey sesame chicken don, and the mochi were all 👨🏻‍🍳💋\n\nHaven’t had the ramen here in years, but as soon as the weather breaks we’ll do Ramen run of all the Ramen hot spots in Greenpoint.\n\nVisiting again soon! 💯"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLTV6WEZnEAE",
            "text": "visited on a friday afternoon, good enough crowd but there's definitely still space.  the interior is simple, clean, and zen-like (i love the noodle / wave wallpaper).  i ordered the miso beef ramen --- and o lord, where do i begin... those slices of washu beef are heavenly, the fatty parts merge well with the broth, and the egg was fantastic (would order another one next time).  the addition of spicy chili oil is highly recommended.  service was great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMnJQZEx3EAE",
            "text": "There was plenty of seating when I walked in on Thursday. Ramen was solid, the restaurant vibe is nice / trendy. They have a handful of cocktails too (but we just ordered a Sapporo). Service was great and I will definitely be coming back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NG9IcDFRRRAB",
            "text": "Great place for happy hour.\nTheir Sake is very good.\nHappy hour items were totally worth the price.\nThe Sake Mussels were only ok, not as good as the other mussels.\nSeating is comfortable and it felt spacious inside.\nThe two bathrooms at the back are clean and well maintained."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtb3ZXdUF3EAE",
            "text": "Spicy tuna and crispy rice is all time my fav appizter. This time I sit at the bar close to the window. It’s so nice to see people on the street with halloween costumes. Btw, I have a shoyu ramen. It’s so nice. The broth is savory and wavy noodles is also cooked in a perfect timing. Lastly, friendly service from the waiters. Everyone has a cheerful smile all the time. Definitely come back !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNHFiNVJBEAE",
            "text": "I recently ordered a takeout meal from Wanpaku, hoping to indulge in a variety of Japanese dishes. Unfortunately, my experience left much to be desired.\n\nFirstly, the homemade pork gyoza failed to meet expectations. Not only were they served cold, but the flavor was disappointingly bland. The absence of the expected savory burst in each bite left me unsatisfied and questioning the authenticity of the homemade claim.\n\nThe egg salad sandwich, as depicted in the picture, turned out to be a letdown. The image did not accurately represent the actual dish, as it failed to mention the addition of lettuce. As someone who isn't a fan of lettuce, this unexpected ingredient dampened my enthusiasm for what should have been a straightforward and enjoyable sandwich.\n\nMoving on to the plain beef-based curry, it can be summed up as nothing more than a bowl of thick gravy. The lack of distinct flavors, coupled with an overwhelming sodium taste, left me questioning the culinary prowess behind this dish. It felt like a missed opportunity to showcase the richness and complexity that a well-prepared beef curry can offer.\n\nHowever, the one redeeming element of my Wanpaku experience was the spicy karage. True to its name, it delivered a kick of spiciness that added a much-needed punch to the overall meal. The delightful combination of flavors and the heat level made it the saving grace of an otherwise lackluster culinary journey.\n\nIn conclusion, my takeout adventure from Wanpaku was marked by cold and flavorless gyoza, a misleading representation of the egg salad sandwich, and a beef curry that left much to be desired. The saving grace was the spicy karage, which managed to salvage some enjoyment from an otherwise disappointing meal. If Wanpaku aims to deliver an authentic and satisfying dining experience, improvements are needed in the execution and representation of their dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbTdpY3lnRRAB",
            "text": "My wife and I decided to stop in Greenpoint, BK on the way out of the city since we wanted to skip the chaos and get great food. We stumbled upon Wanpaku, very fortunately! I ordered the Spicy Pork Bun and Spicy Karaage which were both incredible. My wife ordered the Spicy Chicken Tan Tan Ramen and loved it. I also had a great bourbon drink with honey which was excellent. So glad we came across this spot. We’ll be back.\n\nPlus the service was super quick and kind."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBamVyd1Z3EAE",
            "text": "Came here due to friend’s suggestion. Started with the apps of the peppers (good flavor), pork bun (tasty but not good balance of bun to filling), and Kara Kage (lack of seasoning and probably reason why they put salt/pepper on the side of the dish. Plus dip and lemon). Also ordered a side of scotch egg but it was barely seasoned, which is probably why it’s only on the menu with the curry. My main was the Washu beef ramen, which was tasty and the ramen to soup ratio was pretty good. The cha siu pork in the Shoyu ramen was excellent but, although the chicken broth was very clean, it lacked any depth of flavor.\n\nWhen ordering ramen, apparently even though you ask them not to include some of the mentioned toppings, there is no substitutes so if you want something else it is added on as new toppings and they charge extra for it! Makes more sense when other places have bare minimal toppings and suggest you add extra.\n\nTo be honest, based on the whole experience I probably won’t come back again any time soon. Especially since we have so many other places in NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbnQzMFB3EAE",
            "text": "I wish I could focus on the atmosphere, service, or how the food tasted — unfortunately, I have to focus on the fact that 2 out of the 4 people that visited the restaurant had severe food poisoning the next day (I’m one of those people). We visited after a girls’ spa outing, had had lunch at different places, so the only common denominator was the ramen. We also ordered two different dishes, so my concern is that it’s not some rogue ingredient but the overall kitchen sanitation and safety. Will not visit again.\n\nUpdate after the restaurant’s reply:\n\n“Thank you kindly for the gaslighting attempt, definitely will not visit again after your reply. All of us being over 30 years of age, we know not to handle stuff with unwashed hands or lick surfaces at public places. FYI, norovirus is most commonly caused by improper food handling, so I’m not sure bringing it up is a wise move on your part”"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbGNEMmhBRRAB",
            "text": "The Sutamina Ramen was spicy and flavorful. The service was great and the wooden furnishings gave the interior a warm feeling. Being close to the G train and a number of bus line enables easy access by public transportation."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBcUlXNUF3EAE",
            "text": "A newly open Japanese ramen-tapas restaurant. The service is attentive and nice, the environment is comfortable, but the food is mediocre. I ordered okra for appetizer, a vegetable curry for main dish. It tastes like the ready-to-eat package you can buy from the stores."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOUxQWTB3RRAB",
            "text": "Decent Japanese spot in the neighborhood. There was a bit of a wait when we came but it wasn’t too long. Loved the pumpkin appetizer and the entrees were solid as well. Will definitely come back for lunch!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N2F6SnBnRRAB",
            "text": "Delicious japanese food!\n\nThe beef curry was so rich and densely flavored! I just wish there was a little more meat.\n\nRamen was also delicious. We got the basic flavor which was spot on.\n\nThe okonomiyaki as an appetizer was also good!\n\nThere is a hidden bar in the back which looked neat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNDZMWmtnRRAB",
            "text": "Best Shoyu Ramen I had in a long time. Everything from the firmness of the noodle, lean/fat ratio of the pork belly, to the richness of the chicken broth was perfectly executed. Wife had the Spicy Chicken Tan Tan Ramen and that was excellent as well. Can’t wait to return and try the other items on the menu."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZanRTNmJREAE",
            "text": "Cute and modern ramen spot with a speakeasy discreetly tucked away in the back - this place is great for dates or smaller parties for food. Musts: the kaarage, fried oysters, kakuni pork bun, and I personally suggest the spicy pulled pork ramen over the classic."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaak1MRFpBEAE",
            "text": "Great atmosphere and delicious ramen. The pulled pork ramen was delicious! I was able to get a reservation for a group of 6 on a Friday night with late notice. There’s indoor seating and a couple seats outside as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6Z2NhLWpnRRAB",
            "text": "Food was amazing! Literally everything I ate came out pipping hot and tasted amazing! Drink were also amazing! Servers were so kind and attentive! Great Atmosphere! They have a speak easy! 🤫"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSMTVIWFNBEAE",
            "text": "Food is really good here, portions are the right size, octopus app, spicy cold ramen, and Japanese curry were amazing👌🏼 limited seating inside, small narrow restaurant, but service was good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpdDYzS2JBEAE",
            "text": "I'm a ramen addict so take my advice and definitely give this place a try! The vegan ramens are so good and I think this was the first time I ate every single thing in my bowl! They also have ramune soda and other japanese dishes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdHBMSlhBEAE",
            "text": "What a fantastic little find.\n\nEverything felt perfect from the moment we walked in — friendly service, instantly brought out appetizers and drinks, excellent cocktail, rich and flavorful broth, perfectly aldente noods, properly marinated egg, and just the right kind of decor to match the experience.\n\nWill be back to try their curry and other apps."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbFpxUU1REAE",
            "text": "Gem of neighborhood, Wanpaku is a lovely Japanese eatery with great performance-to-cost ratio. The shop is clean, modern with a Japanese accent. I like their lunch sets a lot. They are large portion. The main dish is delicious and every…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyeGRUNWtBRRAB",
            "text": "I ordered their tsukemen since it’s not that common to see and I love it. Overall it was good, the egg was amazing.. well flavored. The pork belly was good and I love the chicken I added on!…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwLXIzbWR3EAE",
            "text": "What a surprisingly delicious ramen spot!\n\nEveryone must order the spicy fried karaage, tender chicken fried perfectly then generously coated in a sweet and spicy sauce. On top of that, it was a healthy portion size.\n\nFor ramen, the bbq beef rib is a must. Huge beef rib with meat, most places just give you a bone for decoration but not here. The broth was creamy in all the right ways. Next the noodles were cooked perfect and that’s really important for a good ramen.\n\nFor a small spot in greenpoint, they do it right here. I will be back very soon, very very soon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdGZYR2RnEAE",
            "text": "After stumbling across this place I came here for my first meal out in the new year. I would highly recommend coming here as the Curry was fantastic but man these edamame might have been the best Ive ever had"
        }
    ],
    "reviews_count": 79
}