{
    "name": "PEEPS KITCHEN at Scrappleland",
    "place_id": "ChIJi0Ap8k9ZwokRJLOizIwQ-sc",
    "grid": "BK1",
    "address": "1150 Manhattan Ave, Brooklyn, NY 11222, USA",
    "rating": 4.9,
    "user_ratings_total": 329,
    "phone_number": "(929) 295-0081",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbU9IRXlPWGRUUldsc2EyczVZWEY1TVZGUlMyYxAB",
            "text": "The chicken we had last night was absolutely incredible,  perfectly cooked, flavorful, and easily one of the best meals we’ve had in a while. The staff was super friendly and helpful making the whole experience even better. Can’t wait to come back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMllraFRUelYxWTJaR09HTkJRbnB3YmxkcFlXYxAB",
            "text": "Their chicken is fresh, crispy and I love the sauce selection. You can’t go wrong with the shrimp. Very polite and a great service. I always look forward eating here"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podWJHOUtUV1F6TFdsamFGVkZZMU0wVWpkYWEzYxAB",
            "text": "Amazing addition to Scrappleland. Being that I don’t drink alcohol, I was excited to see food being added to this location.\n\nThe cashier answered all my questions about the food, and was able to describe everything in a great detail that let me know what to expect from what I was ordering.\n\nFood was AMAZING. I’ve never had chicken this crunchy, and the sauce that they were smothered in was sweet but had a slight underlying smoky kick to it. The seasoned fries are some of the best fries I’ve had in the neighborhood.\n\nThis will be a staple in my rotation of late night eats in the neighborhood."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Z1BiVVl3EAE",
            "text": "I’m Korean. I can confirm that this place has THE BEST fried chicken in NY."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SS1FWZHlOVFY2TFdKbVFteDNURzV6VkhWUlVYYxAB",
            "text": "so glad they found a new space!!!!! love these guys, always so so friendly"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMFNYVlVXR05YYWxOMWEzVnJkazl0WDBaUVFrRRAB",
            "text": "Straight up the best Korean fried chicken available in Brooklyn.\n\nAmazing owners, fantastic recipe that's crispy and juicy, and now at an amazing new location.\n\nIt's so popular you had the entire neighborhood pop out and show love for their new location at Scrappleland.\n\nYou def need to come try their chicken 💯"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VWJGOWhjRE5ZTkV4V1FVcFhkbVJVTXpGYVQxRRAB",
            "text": "This place stands out through performance. Every dish impressed me at PEEPS KITCHEN. Each dish provides plenty and everything tasted wonderful. This demonstrates ideal customer service execution. PEEPS KITCHEN holds its ranking in my personal restaurant guide."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbU9VUnBWR3hGYTNkMmRYVmtVV05aZUZwYVQxRRAB",
            "text": "I had Peeps delivered last night and, oh my lord, is this good chicken! It was so juicy, so flavorful, so fresh, and so CRUNCHY, even after it'd been in a delivery drivers bag for a half an hour.\nEvery bite was so delicious and satisfying. Honestly maybe my favorite fried chicken ever. I can't wait to eat it again!\nMy understanding is that they're moving to Scrappleland soon. Scrappleland is a pinball bar in Greenpoint with great beers on tap, friendly staff, and a ton of pinball machines.\nRock on Peeps. Keep up the great work."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KM1JVczRORGxFTFdoUU9HeHBhbmhEWDJVNU1XYxAB",
            "text": "Crispy crunchy chicken. It literally tastes as good as it looks. This place consistently makes great fried chicken. It’s well seasoned, the meat is still juicy, and it’s still crunchy even after bringing it home. We eat here religiously once a week!\n\nHighly recommend the padak chicken and the drumsticks!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWFYzWllNbEJDTWtnMVJGQnBZMVpLWlVVMFNtYxAB",
            "text": "5 stars all around for the padak and the owners!!!!! <3 <3"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TWNrdENjbEJ6VlRGNVRVMW1aSGh0U200MGFGRRAB",
            "text": "Wow, never knew this was here. When i pass this place its usually driving. Anyway I get the crave for Korean and fried chicken at that. Pretty limited options in greenpoint. Well that was until I saw this place. So i take a walk with the wife and check it out. We meet the owners, a husband and wife, and a few of their workers. Super nice, chatted the whole time we waited. Started as a COVID business and they do a lot of takeout/delivery. Talking and listening to their background was super cool too. Its their business to share so I won't write it in the review.\n\nImportantly, on to the chicken. Fried galore. We got the combo A. The chicken is fried and you choose the sauces separately. The chicken was fried perfectly with a crispy outside but moist inside. The sauces were bomb too, wife got soy garlic and it was heavy garlic in a way that I liked but also different and maybe more korean then the other korean fried chicken spots. I got the sweet and spicy and it delivered on those notes perfectly.\n\nUnfortunately they are moving further up in GP to Scrappleland which is sad for me but a better spot for them. Either way I recommend this spot and will be back again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdFozRmxSRU5vZVZKVk9XaHZVR2RETUVVNFluYxAB",
            "text": "Good Nice"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SFZqa3lOMk5tYVZaT05WcGxWWEZmV0RCWVpYYxAB",
            "text": "The chicken here is absolutely insane—I’d give it 10 stars if I could. I’m Korean, and honestly, this tastes even better than most chicken I’ve had back home. You can tell the oil is super clean, the batter is incredibly crispy, and the meat is so juicy inside. It’s just unbelievably delicious. I’m so grateful to have a spot like this near my workplace. You can really feel the owner’s passion for chicken, and they’re so kind too. On top of that, the price for chicken of this quality is unbelievable. I can’t believe it’s this good and this affordable.\n\nThis place deserves way more recognition. Trust me and give it a try! I had the Padak chicken, fried wings, and Gang jeong, and all three were next-level. But the fried chicken especially?\nAnd make sure to get the sweet & spicy sauce on the side with the fried chicken—it’s a must.\n\nYou can either pick up your order or eat it out front on the benches since there aren’t any tables inside. Also, keep in mind that because everything is made with such care, it takes about 20 minutes for the chicken to come out. Totally worth the wait—enjoy!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KblluVlhjRFYxVG5OelFqUlhRbVZsVVRGaVJXYxAB",
            "text": "Truly amazing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVWJIQlpOWGhPTjJsM1RGa3RYMVJXWWtZNGIwRRAB",
            "text": "Love this place. Best fried chicken in NYC hands down and the kindest owners. Can’t recommend enough."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaFJHeENORzV0TWtKdWVGVkNSM3BuU1VaVlMxRRAB",
            "text": "The chicken was so crispy and juicy!! Each wing/drum was also decently big that it was so worth! I'm getting hungry looking at the photo again TT\nOwners were also super friendly!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSmFIa3lXbVp0TWkxWFVWWjNRVFF4V0VwdmFXYxAB",
            "text": "Seriously, next level. I've had a lot of fried chicken and this is top."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTU5tTkxXSHBaY0VSd2JFOVBjbnBHZFhndGRHYxAB",
            "text": "I love this place. I picked up one of the combo meals and couldn’t believe how much food came with it. Definitely more than I expected! The chicken was everything I love: super crispy, flavorful, and clearly great quality. They know what they’re doing.\nThis is now my new go to spot whenever I’m craving fried chicken. Goodbye Popeyes! The only thing I wish is that the larger combos came with a side or 2 included or a beverage, it would just round it out perfectly. But still, so worth it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNVUyUnZUelpVYWtwNFZHOHpWbUpQY0Y5Q00yYxAB",
            "text": "Perfectly crispy juicy fried chicken! The drumsticks are huge - literally the size of your face. The scallion sauce and the sweet spicy sauce are both good. I think it’s worth the price but there is kind of a long wait because the place is run by a couple & they’re the only ones working (super lovely couple!)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMWNrcDBMVkZFUWpGVU5YbGtNbHBpTldaalZWRRAB",
            "text": "I’m from the south, and I can say that this place is the best fried chicken I’ve ever had in New York, let alone the northeast. The owners are great people too- so attentive and kind. Love this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcVZEa3ljRkI1WW1sU1ZtbHhTa2R1VGtFMFQxRRAB",
            "text": "Truly the best Korean fried chicken and a gem in the neighborhood. It takes a little while since everything is made to order but totally worth it. Also, the owners are so nice!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMMkZxSXo1M1lteHZ3RRAB",
            "text": "Korean girl here and this place has the best korean fried chicken ive had my entire life and i have grown up with lots if korean fried chicken coast to coast. Try their padak!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTWJHRXdRbVo2YTBwdmFFVmxkM2xTTmxwNFVGRRAB",
            "text": "Made with love"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJenp4OUhDOUpPMUlBEAE",
            "text": "Peeps is hands down the BEST Korean fried chicken in New York!!!! the pa dak and gangjeong combo hits every time. this place is a true gem."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKYUpfNTNYcC1ya0Z3EAE",
            "text": "Delicious, takeout only fried chicken! They cook it on the spot, so it takes about 25 minutes. The portions are large. Solo is probably enough for more people. I really enjoyed the padak chicken. It was a bit more refreshing than the thighs."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLenZ2NWZHbl9iWDRRRRAB",
            "text": "Hole in the wall serving insanely good fried chicken. Truly spectacular chicken, crunchy flavorful coating, delicious sauces. The owners are also very sweet. Peeps is somewhere I will be going all the time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKLXFvc3poMGV6Qkh3EAE",
            "text": "I came late at night made my order and for my brother lol the chicken was really crispy and fresh the garlic soy sauce very good . THEEEEE SANDWICHES OMG DELICIOUS it reminds me like some honey mustard flavor. Will return to taste the other food :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLN1h6NTNfbU5TX21RRRAB",
            "text": "Chicken thighs were unreal"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNT1FyTjNkejhING5RRRAB",
            "text": "Crispiest, most juicy fried chicken. Our favorites were the wings, but you can’t go wrong. Delicious sauce and sides, and extremely kind service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbU0yTGdnRRAB",
            "text": "Couldn’t get into the Snail but looking for a great place nearby? Looking for takeout fried chicken with a couple of outdoor benches to accommodate your immediate street chicken eating needs? You literally cannot do better than this place! The Team running it is amazing and the fried chicken is very fried. It’s exactly what I was looking for. The chicken sandwich is delicious and so are the dumplings!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbXA3T2R3EAE",
            "text": "TAKE OUT ONLY"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMThqRTZRRRAB",
            "text": "Best chicken wings around! The gang jeong was amazing as well. We were greeted at the door and they were very friendly. 10/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvODhPb3JBRRAB",
            "text": "Peeps is an absolutely amazing spot for chicken. Food is incredible every time. The food quality is only surpassed by the amazingly kind owners who are just about the nicest people you would ever meet. They will call to tell you when your order is ready and always greet you with a smile. I was absolutely crushed when they informed me they would be closing at this location. Even if they are going to move far from my home in Greenpoint, I hope they can find a location to serve their amazing chicken, but more importantly keep a business going for two incredible people who run this family run business. Thank you Peeps. You are the best!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaWZIVTBnRRAB",
            "text": "Honestly, once you've had Peeps, why would you want anyone else's chicken? It's seriously that good. The scallion chicken is just beautiful. Atmosphere gets three stars 'cause, hey, it's carryout only and maybe where you take it is beautiful and comfortable or maybe it's ugly and irksome, but either way, the chicken will be amazing. (The owners are also VERY nice and have a really interesting story.)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJckwyZEdnEAE",
            "text": "Peeps Kitchen is my TO GO TO Korean fried chicken place.\n\nThe chicken here is SOOOOOO crispy and crunchy. I ate it in bed and took a nap. I left the chicken on my nightstand, I woke up after my nap and ate the rest. IT WAS STILLLLL crunchy. I said WELL DAMN.\n\nTheir scallion sauce is a must have with their chicken. Their prices are fair since the pieces here are huge. The thighs in my opinion are the best. The thighs are super juicy and crispy. Honestly just writing this review makes me want to order Peeps very soon.\n\nThere is no place to eat which is the only downside to this place. It must be ordered for pick up or delivery. But honestly I have eaten Peeps Kitchen in the area and ordered through delivery. It's amazing either way. After Peeps Kitchen I seriously wrote off every other Korean fried chicken place in NYC. Every other Korean fried chicken place in NYC is dead to me after Peeps Kitchen, I'm such a fan. This place is differently a hidden gem. I LOVE PEEPS."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJck9iUEtnEAE",
            "text": "Fried chicken is insanely good!\nSweet and spicy sauce was also fantastic\nWill be going back again!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcktySk9nEAE",
            "text": "best fried chicken ive had in new york. everyone was so nice as well! thank you!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bnNLUHNnRRAB",
            "text": "Dank"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cnZHOHdnRRAB",
            "text": "Small hole in the wall with homemade vibes"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcEp2Yl93RRAB",
            "text": "Such an memorable experience- just visiting from london-  I told the owner that I came to the area from soho specially to try the chicken as I’d read the good reviews online- she then gave me 2 other flavours to try in addition to what I’d…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRajlUbW9RRRAB",
            "text": "The crispiest chicken ever… love the padak scallion chicken. 🤯🤩😋🥹 also love the auntie working there… she’s the sweetest"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRd0lDNUV3EAE",
            "text": "Super small. Super good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaDRYU3RnRRAB",
            "text": "The best fried chicken! Sandwich is massive and easy to split between two people. Dipping sauces are all incredible. The owners are so so so nice and always a joy to see. One of my favorite places"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdjhuaHd3RRAB",
            "text": "Wow incredible and the owners are so charming."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMGZiWUpREAE",
            "text": "We got the gang jeong and regular fried chicken (thighs), brought it home and had it with rice and kimchi. Both were extremely delicious. The thighs were juicy and tender. You need to eat it hot out of the fryer - it’s takeout only so pick up is the best option. Order in advance because the food is made to order and they get busy on weekends!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMExLNkl3EAE",
            "text": "This place is incredible—hands down my favorite spot for chicken! The staff is warm and welcoming, and you can tell every dish is made with care and love. Be sure to call ahead or place your order in person for the best experience. And whatever you do, don’t miss out on the chicken sandwich—it’s a must-try!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfcGI3cnNBRRAB",
            "text": "Gangjeong chicken is so good and the people who work here are the nicest people ever. Love them and the place"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMFltdjFnRRAB",
            "text": "This place is consistently incredible. The family that runs this is so kind. Portion sizes generous for the price and just delicious"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeHVPb0dBEAE",
            "text": "Not the best price for chicken but sure tastes really good. Surprisingly good mozzarella sticks too!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOWJER2hBRRAB",
            "text": "hot, fresh and crispy! juicy inside unlike a lot of fried chicken in nyc which can be tasteless and dry. sweet couple who made it with love"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMmNLZ3lRRRAB",
            "text": "The best chicken sandwich I've ever tasted, served alongside fries so crispy, they'll make your eyes roll back in pleasure. This hidden gem, run by the most welcoming owners, might have a small wait and a slightly higher price point, but the reward is a flavor explosion that will tantalize your taste buds. Highly reccomend this place!!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdnRyZ2NnEAE",
            "text": "I ordered the gang jeong solo, and this chicken was absolutely amazing—on a whole other level! The owners were incredibly friendly and so sweet, which made the experience even better. I’ll definitely be visiting again very soon!❤️ 사장님 너무 맛있어요!! 또 방문하겠습니다:)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcFp5dW93RRAB",
            "text": "I eat a lot of food. If you're wondering if you'll get a lot of food, you will. But more importantly, if you're wondering if the food is good, it was phenomenal. The chicken sandwich is the best fried chicken I've ever had and the Gang Jeong was super tasty. This was chicken done right. Staff was also very friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURONDgtU1pnEAE",
            "text": "the most fresh and crunchy yet juicy korean fried chickens I've ever had in nyc! We didn't even order any side sauces, it was already juicy and packing in flavor. The owner is this sweetest korean couple that runs the whole place on their own so wait time might be long but def worth it. So I rec ordering ahead/online because it's take-out only and space is tight with no seat to wait. We got their combo set A and they gave us 2 big and heavy boxes of huge chickens and they did not cheap out because the 2 of us couldn't finish all of it. He even gave us extra wings because of the long wait and he said the wings were small that day (they were not lol, they were big). We didn't want to get the fries because we saw it was just frozen fries but the chickens are always made to order and burning hot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z0xPeGdBRRAB",
            "text": "The best chicken in the city. It was so tasty and aI can tell it is made of fresh ingredients. The peep ganjeong was really good!!! Strongly recommended. We will come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUc3JTSnNRRRAB",
            "text": "Today I picked up some chicken here, and it's the best Korean-style chicken I've had in New York. The owners are super friendly, and the flavor is absolutely fantastic. I live in LIC, but I'm definitely planning to make this a regular spot for my chicken fix! What are you waiting for? Go ahead and place your order!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5N3JpTmtRRRAB",
            "text": "Crispy, flavorful chicken with delicious sauce, nice people running it, incredibly good takeout, highly recommend if you’re craving fried chicken. Portions are so generous too! Really nice salad and kimchi too…I got this after getting a tattoo and it was a semi-religious experience. 10/10 will be back, I now love this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1a19ISHlRRRAB",
            "text": "Ordered the chicken burger and a large of the Gang Jeong chicken and was simply blown away! The food here is amazing - tastes homemade in the sense that it’s not too greasy or salty. The burger was huge and I loved the scallions and the sauce that went into it. The chicken was everything I dreamed it would be and more - coated in a thick sauce which was the perfect combo of sweet and savory  The large size was way bigger than we expected and was shared among four people. I will definitely be returning! Keep in mind that this place does take out only since there’s no seating area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1aHBUbGFREAE",
            "text": "OMG I’m in love!! I’m obsessed with their gangjeong - sweet and spicy Korean chicken. Chicken is crispy, saucy, sweet, and heavenly! It’s doing all the right things good chicken should do.\nTheir portion’s huge too. We ordered large and it came with two full boxes. It’s first time ordering from Uber eats and I’m so happy there’s a legit place serving awesome 양념치킨!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxMWMyV3pRRRAB",
            "text": "This is a take out only spot. Ordered the Korean fried chicken wings with the sweet and spicy sauce. Would definitely order the wings again! Wings were crispy and sauce was good. The only drawback is that you have to pay for the sauce separately. One of the top places in the Greenpoint/Williamsburg area for Korean fried chicken wings."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIanJlZDdRRRAB",
            "text": "I tried Peeps Gang Jeong and Padak. They were pretty good. You have to wait about thirty minutes so it’s better to order in advance maybe since it’s only take out place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPd04tUmh3RRAB",
            "text": "This chicken shop is run by the sweetest family ever and the chicken burger is incredible! So crispy, HUGE, made to order, and the subtle but delicious sauce, scallions, and onions were the perfect complement. We couldn’t wait so we ended up eating the to go order on the bench outside. When they saw us eating with sauce dripping everywhere, they ran back inside to get us napkins! So sweet! If you’re craving chicken and in the area please support this local business!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLb2F5ZFhnEAE",
            "text": "The food here was among the best I've ever had, it's been some of the best fried chicken I've ever come to taste. I'm no official critic but ladies and gentlemen, anyone can clearly appreciate and understand the quality of this fried chicken. I was simply wondering around the street to see if I could get some food and I saw this place, I walked in just because of my curiosity. TO my amazement I had found gold out of no where. They're tagline on Instagram \"NYC's best kept secret\" is definitely no understatement, in one of the most strangest places to find gold. There is gold. Apart from the food here, they're service was the best I had seen around all the area. They expressed their joy and passion not just on the food, but as well in their packaging. While waiting, you could see up close their love into their packaging. Only among the best can this restaurant be put up with it. Definitely will be sharing this local secret around and keep coming back for their amazing fried chicken!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuXzhtVHN3RRAB",
            "text": "To start off the people in there are super super friendly and kind, now for the food this is the best chicken I’ve had in nyc the wings are literally fall off the bone tender buttery and crunchy outside, This is the first spot I’ve ever seen debone the thigh then fry it and omg it’s what I’ve wanted my whole life it’s completely outstanding."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNmVMWXpBRRAB",
            "text": "This is some of the best fried chicken in Brooklyn. My wife and I order from here almost weekly because of how delicious the food is. Everything is take-out only and cooked to order so the trick is to call your order in and then show up at the restaurant 30 to 45 minutes later and get it fresh out of the fryer. Also, our secret tip is to get a side of the sandwich sauce and a side of the Extreme Hot sauce, then put a teaspoon of the hot sauce into the sandwich sauce to make a delicious spicy sandwich sauce. I'm getting hungry for their chicken just writing this review..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbnRydUVBEAE",
            "text": "Gang Jeong is sweet & spicy and Padak is savory. Highly recommend! Keep in mind it’s takeout or delivery only. Thankfully even though I walked in thinking I can dine in we live close by and they had a fresh batch from a canceled order."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpeE1ULUVnEAE",
            "text": "I ordered 3 drumsticks and Peeps Gang Jeong (Korean style sweet sauce) crispy and juiiiiccccyyy. They also sent us sample menu to try with personalized notes. I am glad there is an authentic Korean style chicken restaurant in our neighborhood."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1NlBtWFpnEAE",
            "text": "Peeps Kitchen blew my mind. We were going to see a concert at Brooklyn Steel and so searched for restaurants in the area beforehand. The menu as well as the adorable art/paint job on the restaurant's exterior caught my attention immediately. We arrived to find the owners were the absolute nicest, most genuine people ever. I ordered a chicken burger and boneless wings with a sweet ginger sauce (I think, I forgot exactly what they were called), and my girlfriend ordered wings and mozzarella sticks. We went to a nearby community garden to eat and oh my god, on my first bite, I saw a vision-- a paradise made of chicken. Those wings were perfectly crispy with their breading and nuts and sesame seeds atop them and the sauce was just everything I've ever wanted on boneless chicken. And here is where I make a confession to the internet. I got halfway through my chicken burger when disaster struck. But let this be a testament to how delicious this chicken burger was. I dropped it. I dropped half the burger on the soil. I contemplated my course of action for a few seconds time and decided. I picked it up, got rid of a large portion of bun and dusted off the rest. And guys... I finished that burger with no regrets. The flavor of the burger gave me no choice in the matter. If you like fried chicken, you have no choice either-- you must come to Peeps Kitchen!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsejVPSEdREAE",
            "text": "Only does takeout and run entirely by the couple there. This place is one of our absolute favourites and easily one of the most consistently great places to order from. I always get the Gang Jeong Box but you won’t go wrong with any of it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5OXA3VF9RRRAB",
            "text": "Delicious food and very friendly staff/owners! Was thanked several times during my pickup, even by the delivery man while I was crossing the street. The packaging is also very nice (love the tray the dumplings came in)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dTRiVExnEAE",
            "text": "The gang jeong chicken is unbelievable! Their chicken is hand breaded and made to order and has the most unique crispy and chewy texture with a sweet chili style glaze."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURta012Rk5nEAE",
            "text": "Best friend chicken in NYC. We ordered the Pandak chicken to go and it stayed perfectly crispy. This chicken is made with love. 😍\n\nMake sure you call 30 minutes before as your food is made to order 🙂"
        }
    ],
    "reviews_count": 72
}