{
    "name": "Radio Star",
    "place_id": "ChIJMVIviv5ZwokRZOz215uVhGo",
    "grid": "BK1",
    "address": "13 Greenpoint Ave, Brooklyn, NY 11222, USA",
    "rating": 4.6,
    "user_ratings_total": 198,
    "phone_number": "(347) 799-1190",
    "reviews": [
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUU1XVlJaV1kwUmtzM2JFeFNXVWxDWWpsWFRrRRAB",
            "text": "Got the bill - looked through it for a few seconds just to make sure accurate and did a custom tip for 17% (minimum without custom was 20%, service was average). The waitress pulls the device away from me and rolls her eyes at me - was lovely\n\nUpdate for owner: no this is the right location I’m reviewing"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMWFHVlphVTlLV2pkT1dVaFFiMlYzWkdwT1EwRRAB",
            "text": "One of my favorite spots for brunch!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZdE4yVlpZMGd0T0V4WVIxWmlNVlY2ZUdSRlNVRRAB",
            "text": "Nice spot next to transmitter park. Outdoor event space. Good food great cocktails."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKb01uSlBiRFk1V25obWVFbDZjVUl4WWpKVWNHYxAB",
            "text": "Don’t go as a solo diner! They are very rude. Had tons of open tables in the back but couldn’t sit because I wasn’t with anyone else 🙂…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTWFFZ3laRWt3TWxoc2VGZHNjRWMwWVRKVFlsRRAB",
            "text": "Do not miss out on this place when looking for breakfast, lunch of dinner. Amazing food, great place to sit and chill out.\nTheir event space is top notch.\nDon't wait!!! RUN"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NU1ISnhXRUo2VTNabFEwWkxSbE5wUlZKQlJGRRAB",
            "text": "Small plates, delicious. Excellent wine selection. Chill vibes and “cool” atmosphere. Friendliest service I’ve received in months."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WV2EzbzFNM00zTFcwMWMzbHpVMjlMUTI1dlZWRRAB",
            "text": "Radio star is the best Karaoke place in the city!  Greatest atmosphere to just let it all out.  Wheather youre getting a private room or not, it's gonna be a blast.  Our server Danny was an also amazing.  He's funny and easy to get along with and is super helpful and informative.  I recommend Radio star as the go-to place to Karaoke!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WelYwVmlTVmhSTFd3NWN6TmZkVTV3TkVOMlFVRRAB",
            "text": "Awesome food with an old school diner vibe."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSlJuRm5Sak5EV21aVk1YbGxkVUZ0Ymt0VFpGRRAB",
            "text": "Best breakfast in Greenpoint. The ham and egg sandwich is absolutely delicious. The outdoor eating area is spacious and comfortable."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkclQyTkZRWGxJV1dWeE9WRkZkbTlrYVVsU1ZIYxAB",
            "text": "If you are coming with kids, I'd like to provide caution. I came in for the first time with my husband and two little ones. We were seated outside and it was a really nice seating area, except the service was a bit appalling. We waited over 30 minutes for food to come out, and by the time the food came out, my kids were antsy and starving. Before the food came out, I wanted to ask when we can expect food to arrive, and the server interrupted us. We also received the wrong dish and one of the dishes never came out. He was apologetic, but nevertheless, it was a messy experience that makes me very hesitant to return again. Or perhaps, maybe that was the whole point. To deter you from bringing kids?\n\nThe food was really good though the service was unexpectedly disappointing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdFpXWjVkVWxIUzFwblgxRnhSbVZyV0Vsd1NXYxAB",
            "text": "An unpretentious yet excellently cooked savory breakfast. (Overall assessment: 5/5) 🔥\n\nWhat I got:\nPoached eggs, harissa, and yogurt (5/5): Radio Star executes a masterful rendition of Çılbır, the Turkish classic recipe of the same ingredients, refined cleverly by touches of lemon and pan-fried sourdough. What appears to be a modest savory breakfast recipe is a textbook-perfect study of richness, acidity, heat, and texture: the poached eggs bring umami richness and creaminess, the Turkish yogurt adds a cool tang, and harissa brings complex heat and depth.\nRadio Star elevates the dish with an inventive twist: loose layers of lemon juice folded into the yogurt. The lemon juice punctuates the yogurt with sharp acidity and simultaneously surprises and refreshes the taste buds. A second well-judged addition is their pan-fried sourdough. Firstly, it was fried perfectly—golden edges and chewy centers made for a very satisfying tension—and secondly, in addition to the self-evident textural contrast that a piece of toast brings to a creamy dish like Çılbır, the oil absorbed into the crust made the dish all the richer and more aromatic.\n\nOverall, I greatly enjoyed this nourishing, filling-yet-not-heavy, breakfast meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kR1dsTlVTbTR5UTFkVVJXaGhkR1JUVFhKWFRtYxAB",
            "text": "Very eclectic spot with great drinks, awesome bartenders, and a cool selection of food. We loved the spreads. And the bread you put them on."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSU1qZHdMVEZ1TjNkamNXbDNibUV6TlVGNU0xRRAB",
            "text": "Amazing environment especially sitting outdoor area during a good weather. The food was very late but the attitude of the servers were kind and understanding. The food was delicious and surprisingly it tasted like Asian influenced. The only downside is that everything is a bit overpriced."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNWRYQTRhbkJIVWpsV2ExZDRUblpGZUVoT2JrRRAB",
            "text": "Chill restaurant serving up small bites (toast and cured meats) with a nice selection of cocktails & beers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSFQyaGZOMTgxZVRKMVdETXljbm90YjAxek9FRRAB",
            "text": "I had the mescal, scotch, coffee & ancho cocktail, it was well done. Also had some lamb sausages in a flaky pastry. They were playing exclusively D’Angelo so the joint was an absolute vibe. Great for patio hangs when the weather is right."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNVzV6OWpIcVlxZ3ZnRRAB",
            "text": "Radio Star is a great addition to greenpoint. Always a great neighborhood.  Better with places like this. Food is amazing.  Location is perfect."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJdm8yYWVvb192MzhBRRAB",
            "text": "Amazing spot"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPeVR4cm0zcGJEQnF3RRAB",
            "text": "Delicious and high quality ingredients, tasty cortado and friendly staff in a good atmosphere. What more do you want?"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNejNtdjZ0N2VYN1pnEAE",
            "text": "Incredible neighborhood gem for brunch! Highly recommend the Smoky Pork Griddle Sandwich and market salad combo. Wow wow wow!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPdkJnOFhibVAzMHZnRRAB",
            "text": "We had a reservation for 12:15 and were seated right away. Within 15 min the whole party of 5 arrived.  Anyone that came late did not get their drinks 🤷‍♀️\nWe ordered the jar spreads, two prosciutto specials, berry and yogurt bowls and 2 of the wedge salads ( one with smoked trout). We wanted the market salad but one of the guests is highly allergic to fennel so we opted for the wedge which we were told had no fennel. Sides of picked eggs and more drinks.\nThe food took OVER 1 HOUR to come out. Seriously? Barely anything on that table was cooked! The jar spreads should’ve been out within minutes of the order… all came at the same time, except for the salad with trout. However, a cauliflower quiche mysteriously made its way to the table.\nWhen I finally caught the attention of the waiter and told him about the missing wedge trout salad, he brought it out in 5 min. It was missing the trout… but it had FENNEL in it! I mean… really?\nIt wasn’t super busy, there were some empty tables and I would assume they would be ready for uptick in tables as it was Mother’s Day. I really wanted to like this place, but the experience was mediocre and the food was just OK.\nAlso, we were seated outdoors and the sun was beaming on half of the people and I asked if they could close the roof more to provide shade. They moved it by a couple of inches and half of our party was melting. My utensils were HOT from the sun. I would suggest having individual table sun umbrellas on the patio, that way the roof could be open and shade would be provided. Really just not a well thought out set up on the outside."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNdWgtdXZDdl9uWnd3RRAB",
            "text": "Delicious food and cute space, only downside is the no-show fee and the fact nobody answers the phone when you try to contact them."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMmVubjVRRRAB",
            "text": "Their specialty martini is insane and the staff is great"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaTZYOTBRRRAB",
            "text": "Amazing smoky pork sandwich, delicious drinks, great vibe in there. Would happily come back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdDQzU2d3RRAB",
            "text": "My friend and I sat outside on a gorgeous day, the outdoor seating is so cute! Already a great vibe early in spring a great place I will be frequenting this summer! We were there for brunch and the cocktails were great the Video Kills was a major hit. Perfect drink! We also tried a couple of the sandwiches and the market salad and it was all spectacular. I will be bringing more friends here!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva192LUFnEAE",
            "text": "Delicious brunch, friendly service, great space (indoor and outdoor), and a location right by the park on the river— what’s not to love?\n\nHad the poached eggs with yoghurt and harissa, and the smoky pork griddle sandwich. Both were very good— and nicely spiced. Not giant portions, which is always nice! Very good iced tea and coffee as well.\n\nHad tables outside and our pup was welcome, which was a bonus.\n\nHighly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMUlhUGhRRRAB",
            "text": "Great food & service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbE1fdUp3EAE",
            "text": "I can't recommend this place enough! The service was impeccable, and the waitress was incredibly attentive to our group. As for the food, we were a large group (10), and we decided to trust the waitress, so we ordered a little bit of everything. Every dish was delicious and full of flavor, and the cocktails were just perfect.\nThe restaurant had the perfect amount of Brooklyn vibes, not too loud, just right. Highly, highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3b0txUFJREAE",
            "text": "I rarely write restaurant reviews... But my partner and I had SUCH a nice time at Radio Star last night that I've gotta throw my opinion out there! We each got a martini (briney and delicious), and all of the food was amazing. It was a great, relaxed atmosphere, while not feeling stuffy. We didn't have a reservation but the (very friendly) host man sat us right away and made us feel comfortable, even though we were in kind of a rush to eat.\n\nThe whole place feels intentional and boutique-y, without feeling precious or oppressive. It feels like a place with thoughtfulness and care. Also, the vinyl DJ was great. Huzzah!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncm9ubTBnRRAB",
            "text": "I've come here for both breakfast and dinner and neither disappoints! During the day it's bright and inviting while during the evening it's moody and cozy. The cocktails are refreshing and creative. I dream about the radio spread on a daily basis but some other favorites are the bean stew and croquettes–but you really can't go wrong."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnanByQlF3EAE",
            "text": "We had a great experience!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMXY3dDh3RRAB",
            "text": "Awesome!!!!  Staff is great."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMXRhX1Z3EAE",
            "text": "Calamari are delicious, fun wine and cocktail list staff is friendly at all hours!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOHFxTk1REAE",
            "text": "Great atmosphere, fun and creative cocktails and friendly and accommodating service! I’ve gone multiple times and will definitely be back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOG9xaWVREAE",
            "text": "Immaculate food, atmosphere, and service. The staff were incredible and food just as incredible. I need those recipes!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOHZLX0pREAE",
            "text": "Wow wow wow new favorite brunch in Greenpoint!! I came with four friends and it was warm enough for us to sit on the patio but I’ll definitely be back to hang at the bar it’s adorable. I got the tofu griddle like our server recommended- incredible. We shared a salad too which was also a highlight. Shoutout our server Julia she was great with my friend’s gluten allergy. I’ll be back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOHZEZkd3EAE",
            "text": "The staff made us feel very uncomfortable since we went with our toddler daughter. They considered her as”half” a person.\nWe were assigned  the smallest table- although the place was empty-  and later those tables were occupied by 2 or 3 adults.\nThey made some basic potatoes for our daughter and emphasized that that won’t happened again….. which was a very dismissive comment-\nDefinitely not kids friendly- I still don’t understand how they have a high chair then."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc29qU1h3EAE",
            "text": "Really delicious brunch. The saffron cream cheese bun and cauliflower quiche are must gets. The house salad is also good. I was really excited for the ham and egg griddle sandwich but found it a bit plain and flavorless. Our server was awesome and had a really nice demeanor."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBX19UYmxBRRAB",
            "text": "Absolutely DELICIOUS food and coffee, in a beautiful cozy space! I loved sitting at the bar and chatting with the servers, they helped me pick what to get when I was indecisive. If I lived in Brooklyn I’d come here all the time!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMzU3ckt3EAE",
            "text": "Amazing food, Wine, Cocktails. Ambience is low key and intimate. If you come during the day the dining room gets lots of sunlight to break up the winter blues."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBa2VTRnVBRRAB",
            "text": "Awesome brunch spot"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNE9mWmJnEAE",
            "text": "Completely love this place"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOcTU2Rjl3RRAB",
            "text": "Came in once before work (around 8am) and they told me they were out of coffee. Came in another time and had excellent coffee and a truly inedible and very expensive quiche.\n\nEdit: to respond to the owners, it was overcooked and rubbery and tasted like burnt turmeric. My friend and I both looked at each other with confusion after one bite."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfODQ2OVdBEAE",
            "text": "Tasty and inventive food, carefully prepared and attentively served. Cool vibe."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdXQzRnhBRRAB",
            "text": "One of the best spots in Greenpoint / by the water. The food is impeccable, service is great, the coffee as well as cocktails and wine are spot on. A must visit if in the area ♥️ (tip: if you go in for 3:50pm/4pm you can try the lunch and evening menus) 🤤 suggestions: Saffron cream cheese pastry, the calamari, ham & cheese griddle, the radio jar & the potato wedges."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmb3ZYNmF3EAE",
            "text": "Fantastic food and service!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaDZHeThRRRAB",
            "text": "What a vibe.  Perfect spot for catching some sun and eating good food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bmJXNGZBEAE",
            "text": "Video did not kill this Radio Star! Great food, great service, great location. All the things. Basically tapas and cocktails, but exceptional quality. The chicken croquettes has just a hint of curry. The bean stew was my favorite. Like the critic in Ratatouille it brought back childhood memories. Delicious and nutritious. The bartender/ server was super cool and friendly. This location, right by Transmitter Park looking down the East River is perfect. All the things! Enjoy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MjZYaFhnEAE",
            "text": "❤️ Overview:\nMy friend and I went there for breakfast before going to the Yoseka Stationarty Fest! The food was overall good and the place was super cute!\n\n❤️What was ordered:\nFOOD: sweet saffron cream cheese pastry, country ham and egg griddle sandwich, merguez in a blanket\n\nDRINKS: hot green tea, unsweetened iced tea, and juice\n\n❤️Stand outs:\nSweet saffron cream cheese pastry\n\n❤️Would I come back/recommend\nMaybe - I would come back\nYes - I would recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWdGR5SXVBRRAB",
            "text": "Liked this new spot in Greenpoint.  I had a Feta Cheese Pastry.  It was too salty for my taste.  The cocktail I had was amazing.  It is called Cigarettes & Coffee.  The place is open for Breakfast, Lunch and Dinner.  The decor is simple but aesthetically pleasing.  Prices are reasonable for the area.  The service is good.  It's worth a try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsOXREY3pBRRAB",
            "text": "This place is so cute and so delicious! My husband and I went here for breakfast and everything we ordered rocked our worlds. The smoked tofu breakfast griddle and the feta pastry are must tries, but the chocolate cookie quite literally took our breath away. The spot is bright and beautiful and the staff is so incredibly sweet. Would HIGHLY recommend. Can't wait to come back to try dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqN3EtMGpRRRAB",
            "text": "Had Radio Star on my list for quite some time. Definitely highly recommend! Delicious griddle sandwiches — ham & egg griddle basically tastes like ham & egg wrapped in a toasted scallion pancake. Good cocktails. Loved the experience here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5OWZxWl9nRRAB",
            "text": "Super cute and cozy space with shareable plates and good cocktails/wine menu. We came in for a late dinner and shared slow carrots, the filo pie special of the day, and charred broccoli rabe which were all flavorful and delicious. Staff were knowledgeable about the wine and made a great recommendation. I’m looking forward to trying the breakfast and lunch menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcHEtNjl3RRAB",
            "text": "Amazing neighborhood spot! The bean stew is so good we ordered a second bowl. Griddle sandwiches are also very good. The staff are so friendly. Overall a perfect spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseXFMWDhnRRAB",
            "text": "Lovely, airy space & delish food!  Service was great.  I had the smoked tofu griddle sandwich, & enjoyed their chili crisp oil, which beckons on every table.  Had a nice pot of tea, Brazilian soundtrack… drooling for pastries on display…  I’ll be back!  Can’t wait for their patio to open come Spring."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsczRTbkFREAE",
            "text": "Big fan of Glasserie so I was really excited when Radio Star opened. Went last week and was not disappointed! I have allergies and they were super accommodating. Potatoes were delicious and so was the charred broccoli rabe. Will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMC11elZnEAE",
            "text": "Maybe sitting at the bar on a weekend evening is not the best idea. The food is mid and the service even lower.\n\nHow can you have 8+ cooks in the kitchen and only one bartender to service ~33 seated patrons? $4 for two thin slices of bread for your jarred condiments? Shouldn’t they already come with bread? Grossly overpriced across the board.\n\nRadio Star? More like Radio Sub-par."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiN083Qmd3RRAB",
            "text": "The space is beautiful, with a lovely ambiance and the bartender was nice and attentive.  We had the frozen margarita, which was delicious and that was about it.  I had the Ham & Egg griddle but they didn't have any ham because of the Listeria outbreak...fair, so I just ordered it with cheese.   As I took my first my bite, the griddle was very greasy which gave it a strange aftertaste.  He had the pork griddle sandwich was even greasier than mine, it was actually dripping.  Shortly after our food arrived, the bartender did ask, \"How is the food?\"  We both kind of shrugged but we weren't satisfied.  I barely had 2 bites and he had only a half of his sandwich.  Maybe you should offer another type of bread or croissant as an option?  I live in the neighborhood and love supporting local businesses, I hope next time will be better!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5b2Z6RE9nEAE",
            "text": "My first time at this coffee shop, I highly recommend to everyone in the neighborhood such a pleasant and cozy place to have breakfast or dinner.\n\nThey also dog friendly. 🦊👍🏼⭐⭐⭐⭐⭐"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxaWVydF9BRRAB",
            "text": "Fantastic new addition to Greenpoint! Crafty cocktails, delicious bites and super friendly service. This will definitely be a spot to frequent in the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYei03b25nRRAB",
            "text": "We got married in the outdoor section of Radio Star through the Glasserie Events team and had an incredible experience. We chose the venue because having good food was a priority for us and they did not disappoint. Many of our guests told us that it was the best food they had ever had at a wedding. We also appreciated that the space was beautiful and romantic without many of our own decorations. The team was amazing and brought such a fun energy to our wedding. The event planner, Emily, was a joy to work with through the entire process and we loved that she was so organized and communicative. We would highly recommend getting married here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsODhuamp3RRAB",
            "text": "I tried most of the dinner menu and everything was very flavorful and delicious. My personal favorites were the ginger squid and slow carrots!! The Video Kills and Pear Daiquiri cocktails were really great, too, definitely worth a try. The servers were kind and super cool to talk to and overall love that this new place opened up in the neighborhood."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkczhDOTJnRRAB",
            "text": "The space is beautiful. The staff are very nice and accommodating. We were excited to try this new restaurant. Unfortunately, the food gave my partner and I extreme stomach aches. I don't know what it was. Perhaps, a food allergy or food poisoning? We don't know.  The feta in a jar was too salty for our taste. We had to return it. I'd give it another chance - maybe it was an off night. I hope they can expand the wine list and/or provide bottle options too and more vegetarian options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeC1UMTZBRRAB",
            "text": "Just so super delicious, we ordered and at everything 😅 and it was blissful. Plus the cocktails were on point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNC15c1BnEAE",
            "text": "I had a great time at Radio Star.  I loved the design, the terrazzo, the collection of seating, the massive antique wooden back bar, and the green breast shaped lamps (vintage Italian?) on the bar top. Clearly someone that loves things as i do was involved in this space and it shows.\nWe ended up ordering half the menu, everything was delicious, squid and lemon potatoes, my god!\nI’m looking forward to trying their breakfast menu soon. Definitely worth stopping by!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURMejV0YxAB",
            "text": "We experienced a memorable, incredible meal here with impeccable service and drinks. The menu is a treasure trove of amazing small dishes that work well to share. The cocktails were superb. And aesthetically the vibe feels like a bright and bauhaus cafe. From the plants outside when we walked up, to the lemon custard-colored walls and terrazzo tilesb , to the antique wooden bar, everything was uniquely beautiful and without pretension. I can’t wait to try breakfast here…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNseFpPaVJnEAE",
            "text": "Wonderful little spot I visited with a friend for lunch. Great atmosphere, good music and space felt cozy and sunny (lovely greenhouse vibes). Charlie was a darling and made great recommendations as our bartender/server.  Attentive and lovely person. We stayed for few hours tried the house cocktails and pastries. All great .  Chili was delicious.  Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NUozN1NnEAE",
            "text": "vibes were on point! food was spectacular. the best cocktail shrimp i’ve ever had. lovely space with both indoor and outdoor space. right next to the water, so great spot for pictures."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiLW9MQ1FnEAE",
            "text": "I loved this little gem of a place so much and am so glad I discovered it. So quaint and cute and a chill vibe all around and loved the ambiance. The pork griddle sandwich is legit to die for and I found my new obsession 😍 bartender was such a vibe I loved her!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIX01pM2NREAE",
            "text": "Went here for a date and it was the cutest and coziest spot! Exceeded expectations with amazing food and fantastic drinks. My favorite dishes were the sautéed calamari, merguez, and ALL the jars/spreads they have. Would come back here again for date night, or girls night out."
        }
    ],
    "reviews_count": 69
}