{
    "name": "The Blue Light Speak Cheesy",
    "place_id": "ChIJ6xMKycJZwokRWUUQVrahitg",
    "grid": "BK1",
    "address": "158 Green St, Brooklyn, NY 11222, USA",
    "rating": 4.9,
    "user_ratings_total": 298,
    "phone_number": "(929) 337-6025",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCU1VXOUxMVWh0WTJaclNWSk5jbFJ1UVRJelMyYxAB",
            "text": "Tucked away on Green Street in Brooklyn's Greenpoint neighborhood, The Blue Light Speak Cheesy is the kind of unpretentious breakfast spot that feels like a well-kept secret—cozy, inventive, and utterly addictive. What started as a pop-up grilled cheese operation back in 2014 has evolved into a beloved rotation of elevated breakfast sandwiches and specialty coffees, served in a tiny indoor space with ample outdoor seating that invites lazy weekend lingering.281d29 Open Mondays through Sundays (with Tuesdays off for good measure), it's the perfect low-key fuel stop for locals and visitors alike, especially if you're craving something far beyond your standard bodega bagel.\nThe menu rotates daily, keeping things fresh and exciting, but the stars are always the hearty, cheese-forward sandwiches built on house-made bagels or buns from partners like Orwasher's. Standouts include the classic Speak Cheesy—pasture-raised scrambled eggs mixed with chives, sharp New York cheddar, and a kick of sriracha aioli, all piled onto an onion poppy seed bun for $12 (add avocado or impossible sausage for a couple bucks more).f793fc On Wednesdays, don't miss the double-decker breakfast tacos: two handmade tortillas (corn and flour) fused with cheesy refried beans, griddled cheese crisps on the outside, and a fluffy filling of eggs, soyrizo, herbs, radish, and avocado that delivers at least five textures per bite—think elevated Taco Bell magic, but with premium, local ingredients.756e90 Recent fans rave about the green eggs and ham-inspired special (pesto scrambled eggs with scallion cream cheese and pickled onions on an everything bagel for $14), calling it a \"peaceful patio breakfast\" highlight in this hipster haven.870d4f Pair it with their smooth specialty pour-overs or cold brews, and you've got a meal that's equal parts comforting and crave-worthy.\nyelp.com\nService is warm and efficient—expect quick chats with owner Andy about gluten-free options (they've got bread swaps covered) or today's rotation—while the vibe is casual and dog-friendly, with that quintessential Greenpoint chill: think mismatched tables under string lights, no reservations needed, and a crowd of freelancers nursing lattes alongside families on strollers.90b026 It's not flawless—some longtime fans miss the old Burrito Thursdays that got axed earlier this year3c4085—but at these prices (most items $12–14), it's an absolute steal for the quality and creativity. If you're in Greenpoint hunting for breakfast that punches way above its weight, make this your first stop. 9.5/10—worth the hype and the inevitable return trip."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeGFuWmplWFZ5T0djNVR6STRURFUxYkRCV1dVRRAB",
            "text": "Top-tier breakfast sandwiches with plant-based sausage and cheese options, a rotating menu, real craft beverages, and a hardworking and thoughtful team that crushes it every service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbU9XYzFYekJGWTNKSmJYbGZSRlJ2VEhJMGRWRRAB",
            "text": "Lots of potential, especially with great breakfast sandwiches and coffee options. Think they just need to sort out their operations as they have limited staff and it’s not clear how to wait for your order (especially if you’re outside) and find seating. Vegetarian friendly, and would corn back to try more options."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3elRIWkVZMlJwWkVabVVYTmlObXBNVURGeU1uYxAB",
            "text": "ok, love this place. the hours are much too narrow. I work late and long hours. By the time I’m awake and need breakfast, this option is not available!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRdFRHZEZhRXhsU1doQlh6RTRSVXhmZFdoWWJGRRAB",
            "text": "Hands down the best breakfast sandwich and mocha I have had in my 11 years in nyc"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeWNUaEVNMk53ZWtack9VdEZTRlZpZEdaVVVHYxAB",
            "text": "I was so excited for the breakfast burrito but it’s truly 80% lime pickled cabbage which tasted so sour. I took it all out and was left with about a 3 bites of the burrito. I thought it would be an even amount of cabbage and other ingredients. That being said - the 3 bites I had were absolutely delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25waU4xaGxWVWRtZHpaQlV5MVNUVEoyYldSNE5VRRAB",
            "text": "Spectacular"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TGJsazFjV28zUVZGeE5rdEZkMWMzUzFjMGNVRRAB",
            "text": "Incredible speacialty bagels, with gluten free substitution options"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUGRGWXpVWFpOVEVZdFYwUnNTM2MxWWtocVdYYxAB",
            "text": "A small cafe with a rotating curated menu that hits the mark.\n\nThe Blue Light Speak Cheesy is a highly recommend for its food and drinks. Today’s menu only had 3 food options however each one sounded fantastic.\n\nI got the Mama’s and Papa’s (which can also be made Vegan) and my wife got the Green eggs and Jam.\n\nBoth were delicious and starved on a light and fluffy poppy seed bun. I liked the spice that the chimichurri gave the sandwich but would have also been happy with the sweetness of the green eggs and Jam.\n\nWe also got the Maple Palo Santo latte Hot and the Pumpkin Spice Latte Cold.\n\nI like the subtle notes of the maple in the palo santo and the PSL was one of the best ones I’ve tasted recently.\n\nHighly recommend checking it out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMFFXTlFjMU5zTURsU1FucGlObW95U1VkQ2JtYxAB",
            "text": "Is it worth the hype? Sure, 1 time. The line moves somehow fast, the staff is friendly however the sandwiches are pricey for what they are and do not contain any meat, like bacon or ham…\nI wouldnt go back just because of the prices, we had 2 sandwiches, it came out to $17 each with tip&tax."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeFF6Vk5ia3RLUjBRM2NUQkhkREV0TFU1c1pHYxAB",
            "text": "For teens and adults only. No kids Menu but that's fine. Must try Saturday Menu.. Salt N Pepa Jelly the BEST👍🏻"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQ0xVd3hTWEpFWldKdWR6bEpUMnBQY1dWRVIyYxAB",
            "text": "Trust me that I say this place offers the best breakfast sandwiches in all of NYC. I’ve tried almost every one & my favorite has got to be the Fling + impossible sausage. The homemade poppy bun is deliciously buttery & just super well made with all the ingredients. Amazing coffee as well. Workers there are super friendly & food comes out fast!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psU2JWUllWMUJJZW5Nelh6RmxNRkEwYzJob1YwRRAB",
            "text": "best bfast sandwich i've ever had!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNUxURkZhM3BGVWxNNGVYbGlia3hFTVc5VFRFRRAB",
            "text": "There are only bagels on Saturday… my bagel was $14.50 (before tax/tip) and only had 1 egg on it. The flavors were interesting but given how lacking the fillings (protein in particular) were at that price point, I would skip this place."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCYVgzVjBjMFJYVGs1eVRuaE9VV3RQUjFOSFVGRRAB",
            "text": "The food here is just phenomenal. We had the Fling and the Salt n Peppa Jelly sandwiches, and both of them blew me away. Fluffy eggs, incredible brioche bun, tasty sauce. Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aYU5VdENYMGxLY2taM2VHOXFlazlqVG5ZNE0xRRAB",
            "text": "I was looking for a breakfast sandwich and coffee at a place where I could sit down and do some work. Stopped by here and was floored by the beauty of the staff & sandwiches. Aux went crazy!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214ZlptMVljbVpaYlc1R1NFaEhaV2xNUlZkcE9YYxAB",
            "text": "Great food with GF and Vegan options available daily.\n\nWhen we went, bagels were Saturday."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRVJXWm1TM2h1TjJONFNuQm1WRzh0TlZaaFJYYxAB",
            "text": "My favorite breakfast of all time! My husband and I come every week and it never fails 😍…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTVJFMUZPRzVxY0VKUVkybFZaRUZqY1dRNWRuYxAB",
            "text": "Great spot! Delicious breakfast food and lovely atmosphere. They also have gluten free and vegan options."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNVYxTm5UV1JWVEc4NVpFNDFURTUwT1cxcVIyYxAB",
            "text": "We strolled into The Blue Light Speakeasy on a sunny Saturday morning, and the wait for outdoor seating was totally worth it. Their rotating breakfast menu caught our eye, and we were excited to dig in.\n\nWe ordered the Biscoff Rip-Off and Rosemary Macademia Matcha - both were expertly crafted and delicious. But the real showstopper was 'The Mama's and the Papa's Bagel'. Hands down, one of the best bagels we've ever had - flavorful, delicious, and utterly addictive. We're already planning our next visit!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSk9WTkNYM0UwUkY5YVVEUlZhbkYyVDJSUVRHYxAB",
            "text": "I LOOOOVE this cafe so much! Their chai latte is heaven! Their staff are so sweet and well dressed! I love their vibe when you walk in, you will feel so welcomed!! PLEASE GIVE IT A TRYYY"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRldYSmlhV0pzZEZkcU1IQjBWMVpYYTIxdVYzYxAB",
            "text": "This place is a vibe in itself."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveVh5MXpTV2xUUkZOdmVIazBNMk5UZHpKUGRuYxAB",
            "text": "Refreshing outdoor sitting arena,they will bring your food\nGreat service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPeTRsb0MwaGJMa1VREAE",
            "text": "incredible breakfast sandwiches— love their sunday menu as well!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOZkFoS0hSNmZuNmxRRRAB",
            "text": "Blue Light speak Cheesy has by far the best bagels I've ever tasted and they have great drinks as well. Took us about 30 mins to order, not alot of seating but the outdoor seating helps. 10/10 for me can't wait to eat more bagels!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOU01uOVM0dV9xa1h3EAE",
            "text": "Their breakfast sandwiches are actually insanely good. 10/10 all around!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQem41TFhYMUxEbjdnRRAB",
            "text": "Not gonna lie the burrito was gas"
        },
        {
            "date": "4달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMMlZfYW5ucDVlOXRBRRAB",
            "text": "요일마다 메뉴가 다르고 난 수요일에 방문해서\n타코를 먹었고 정말 맛있었다\n매일가서 있는 메뉴 다 먹어보고싶다"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRlJXOVdWVE5NWWtSbmMzQXliRFJUWWpSaE5GRRAB",
            "text": "Delicious breakfast sandwich and specialty coffee. I really liked it and would go back for sure. I think they change the menu around but not sure"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLdm02dm5yNEt2SDhBRRAB",
            "text": "I finally tried the breakfast sandwich named  The Fling and man did did it deliver. The best breakfast sandwich I’ve had in a long time. Service was very fast. The bun they use is outstanding. It’s like a brioche/kaiser bun. The crispy onions bring the whole sandwich together."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKREdzX0s4b0p6TUpnEAE",
            "text": "The hype is real. Best egg sandwiches in greenpoint."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKbTJsTW5BbFBPSk1BEAE",
            "text": "Best breakfast in greenpoint. Food is bomb. Service is great, they are always super friendly and keep the line moving fast. Love you guys!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbU5tcDNJaWNxNjZRRRAB",
            "text": "DO NOT EAT HERE!!! Unless…you want to experience one of the best (if not the best) breakfast sandwich of your life!!! My wife and I stopped by a week ago to see what this little spot with the wacky name was like and since then we’ve been back 3 times. Their green eggs and jam is litttt! I didn’t a realize that a little onion bagel smothered in jam and stuffed with perfectly salty eggs and goat cheese could change my life…\nBut it did…\nEspecially when washed down with tangerine juice! I’m mad we are no longer in greenpoint or else you’d have to roll me out of here!\n\nAlso the staff are super friendly!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKUGt3Tzd5a2J2OXl3RRAB",
            "text": "Amazing breakfast sandwiches on Sundays! Their specialty drinks are incredible too. Can’t wait to come back for burritos."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKbW9fZHJ2bl9mNXZBRRAB",
            "text": "This place is amazing for breakfast or brunch — everything is just right, from the friendly owner and staff to the delicious sandwiches. It’s rare for me to actually feel excited just to be somewhere for a sandwich, and even more rare for it to taste just as good every single time. The coffee is also great — I love the pistachio milk latte, but they have other tasty options too.\n\nI’ve been coming here for years and just realized I never left a review. I think it’s because I selfishly wanted to keep it my little secret — my go-to spot for the best sandwich. But now I’m finally sharing it. I hope more people come and enjoy the amazing food at BlueLightSpeakCheesy.\n\nThank you for being part of our lives!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZWpyWjJqX29IS3FBRRAB",
            "text": "Crazy good breakfast sandwich. Wish I could have that in Montreal 🥹"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNRG5ydi14emFpM1Z3EAE",
            "text": "I went yesterday to try the sandwiches of the day and arrived closer to 12:40pm and was the 2nd to last sandwich ordered (they run out!)\nI got the Marisa Explains it All sandwich and the Maple Lavendar Latte, and they were both so excellent. I'll definitely be coming back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VONzgxS0RFMHB1NEJ3EAE",
            "text": "Super sweet staff, delicious food, some indoor and outdoor seating. Loved it. I’ll be going back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNNmgyWi1Wbm82VzhRRRAB",
            "text": "Perfect, tasty bigels. I truly recommend 👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYi1xYjMwLUt2RXVRRRAB",
            "text": "Great service. Amazing buns."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2JMajlBRRAB",
            "text": "Wow one of the best breakfast sandwiches I’ve ever had.\n\nAlso did it GF and the vegan cheese. Which is always a score for me when restaurants offer the combo.\n\nThe pistachio milk honey latte was amazing too and the fresh tangerine juice.\n\nCan’t wait to come back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveFltaWlnRRAB",
            "text": "Quite possibly the best breakfast you’ll find"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMlltV3lBRRAB",
            "text": "Friendly people, amazing food. Their food is consistently delicious. The Salt N Pepa Jelly is the best breakfast sandwich I’ve  ever had."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvd2ZteWl3RRAB",
            "text": "The food here was honestly great. We ended up getting the fling with avocado, the fling without avocado, and the herbie Hancock.\n\nThe onion poppy brioche bun slaps! Probably the best the bun I’ve had in a while. The poppy seeds and the butter flavor was delicious.\n\nThe sandwich disappeared so quickly! I was ready to go back for another one. The fluffy eggs were amazing! The siracha sauce was also very muted which made for a perfectly flavored sandwich\n\nThe herbie Hancock had a fried egg and more green heavy flavor. Delicious from what I tried!\n\nWe also got their rosemary macadamia matcha latte and a Cortado. I feel like the flavor of the rosemary didn’t come through enough but that’s just my opinion! Otherwise very delicious!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ2E2QWV3EAE",
            "text": "A true joy with every bite."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cllLbmdBRRAB",
            "text": "** The Burrito has returned, and so has my fifth star**\n\nI am holding my 5th star ransom until you bring the burrito back, you have taken from\nme my one source of true joy and happiness. I haven’t been this sad since Obama left office. This is not satire"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvemFXWW13RRAB",
            "text": "The onion bun makes this the best breakfast sandwich I’ve ever eaten, and the beverages are all delicious."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJX0xhMzNRRRAB",
            "text": "The Blue Light Speakcheesy\n\nLayout/atmosphere\n*Five seat counter; five tables; tables on sidewalk\n\nFood/drink\n*Herbie Hancock (fried egg, avocado, dill havarti cheese, basil aioli, pickled red onion & arugula) on onion poppy bun - Good, bordering on very good; soft roll; egg/avocado creamy, gooey texture\n*Macadamia Mexican Mocha (TCHO dark chocolate, cinnamon, vanilla, brown sugar and a hint of spice with espresso and macadamia milk) - Good; got the cinnamon & brown sugar"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eDl6YUtREAE",
            "text": "The “green eggs and jam” is soooo good. But it’s only available on Sundays 😩\nMake it available every day!!…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dS1yRHVRRRAB",
            "text": "Creative and tasty breakfast sandwiches! I recommend the salt n’ peppa jelly, which I liked more than the Marisa Explains It All (pictured) that I got last time."
        },
        {
            "date": "10달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MUpET2RREAE",
            "text": "진짜 맛있어요ㅠ-ㅠ 너무너무 맛잇어요\n브루클린 가시면 다른곳 가지 말구 여기서 아침 먹어주세요 제발요! 또 먹고싶다 이거 먹구시퍼서 윌리엄스버그 다시 가고시플 지경이에요"
        },
        {
            "date": "10달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2emQzbE5nEAE",
            "text": "정말정말정말 인생최고 샌드위치집!!!\n뉴욕감성으로 맛있다는게 아니고 진짜 인생최고샌드위치임!!! 무무무무조건 무조건 무조건 방문 초초초 강추 ^^♡♡♡♡"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbDRhTFJ3EAE",
            "text": "I was told by someone in the know that this place has \"the best breakfast sandos\" and they were 100% correct! This place has amazingly tasty breakfast sandwiches. Also the coffee selection is superb and the staff is super nice.\n\nThere happened to be a line when I got there but it moved along quickly. I finally entered and ordered. There was water while we waited. The \"Biscoff Rip Off\" - cold brew and chai and biscotti - was the perfect taste and flavor while waiting. Plenty of indoor and outdoor seating but I went home to eat. Wow, every bite was something special and incredible. The Green Eggs and Jam, and Burrito Bun were my favorite. Tummy full, mouth happy, perfect start to a relaxing Sunday. You should too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6X0lUOTFnRRAB",
            "text": "Great find. Bagels where so good. I had the No-Cho. Perfection. Service is great, they brought food to table on the outdoor seating area. Maple Lavander latte is delicious and they add fresh orange zest. (Could use a little more lavender)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1c1lIVkN3EAE",
            "text": "I will visit this place until I try all of the meals and chose my favorite one. You have to try honey pistachio late. It is so good, not to sweet but so tasty. People working here are so friendly and polite. This place has so calm energy.\n\nI have to say the burritos are much better than tacos."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMXR5RjNnRRAB",
            "text": "I went two days in a row if that tells you how much I liked it!!! Tried one of the bagels and then a bun. Also tried the Mexican mocha which was amazing! Everything was so delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3b19lMTdBRRAB",
            "text": "Excellent breakfast sandwiches, creative and simple menu, friendly service. I’ve been a couple of times but my absolute favorite was the everything bagel sandwich with jam! Can be hard to find a spot on the weekend but most people don’t stay long so if you wait it out you can get a table or eat outside."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4ajREWGF3EAE",
            "text": "The concept of this place is genius. Only one breakfast item each day. The food is incredible. I got a breakfast sandwich on an onion brioche bun. It had local blackberry jam, goat cheese, and fluffy spinach eggs omelet inside. I’ll be dreaming of this breakfast forever!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1NktDNjVnRRAB",
            "text": "I recently had the pleasure of visiting The Blue Light Speak Cheesy to try their Thurs breakfast burrito.\nThe eggs were nice and fluffy without being the only flavor which is something I enjoyed because some places just throw scrambled eggs in a tortilla and call it a burrito. Next I enjoyed how the cheese and chipotle aioli added a bit of spice to the dish. Finally the tortilla was toasted to perfection\nIn summary it's evident that care has been taken in crafting this dish. Whether you're a breakfast enthusiast or just looking for a hearty, satisfying meal to kickstart your day, I highly recommend giving this breakfast burrito a try. It's a delicious, on-the-go breakfast option that's sure to brighten your morning."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQM29TSERREAE",
            "text": "Honestly one of the best breakfast sandwiches I’ve ever had. Got the Fling with impossible sausage.\n\nI also had it with their green hot sauce, which was great."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LWVPYzhnRRAB",
            "text": "Been following them on Instagram for a couple of years and finally had a chance to visit today. Our breakfast was delicious. Loved my Herbie Hancock! Wish we lived closer, we’d definitely be back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQLXMyekJ3EAE",
            "text": "Super yummy vegan breakfast sandwiches on the weekend.\n\nThey have an ever rotating menu.\n\nMenu doesn’t outright list vegan but they can make almost any of their offering vegan usually. Love going here for breakfast on the weekend.\n\nJust beware sometimes the lines are very long."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdnZ2UGpRRRAB",
            "text": "The Bluelight Speakcheesy crea sanduches tan creativos y deliciosos. Me encanta que cambien en tipo de comida todos los días, siempre manteniendo un variedad dentro del tipo de sanduche del día. En particular, me encantan los buns del domingo, son tan listos por haber pegado cebolla crujiente al pan con crema, hace que la sensación de morder te resulte tan satisfactoria. También me encantan las bebidas de café, las cuales también cambian con la estación. Finalmente, los empleados siempre son muy simpáticos y no se duden en ayudar!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NGZXUkZnEAE",
            "text": "Best breakfast in the neighborhood. Menu rotates daily, check the website for details.\nYou can’t go wrong with any of their sandwiches, tacos or burritos.\n\nThe coffee shop is back open and you can now sit inside and they kept their covid era outdoor seating. Coffee options are great too. They close around 1 or 2 each day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuckpTVEd3EAE",
            "text": "I would give more stars if I could. „Fling” deserves an Oscar! Our go to place in Greenpoint to grab something delicious and filling. They also serve great seasonal coffee ❤️🙏🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuOG9MQzRBRRAB",
            "text": "Ok they have delicious sandwiches and coffee! I tried their “fling” sandwich with impossible bun, cheddar, egg and sriracha aoli. Also tried their macadamia Mexican mocha. My order was great and prices are decent too!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dnZmZ1pnEAE",
            "text": "Came here for Sunday bun day and ordered everything on the menu. The egg in all three were so fluffy and soft, but my favorite was probably the burrito bun (pro tip: add some hot sauce to it when we got home). The green eggs and jam was the most unique flavor though, the salty and sweet combo was really good, but personally the goat cheese was too heavy for me so early in the morning. If you love goat cheese, you will love it. The fling + impossible burger was good, but the impossible patty was a bit dry. We also tried the biscoff ripoff, which tastes like a dirty chai and comes with a biscoff cookie. Will definitely come back to try the bagels and tacos on the other days."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabnJQY2t3RRAB",
            "text": "These breakfast sandwiches are fantastic. High quality, large portions and the team there are so nice. The hot sauce is particularly good. They are also willing to amend items if it's not too late in the day (e.g. removing aioli, which is don't eat). There's a good amount of indoor and outdoor seating, and there is a water bowl as well as treats for dogs. We love doing a long walk up from Williamsburg on the weekend."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdjhpSUl3EAE",
            "text": "Delicious breakfast spot with rotation specials throughout the week.\nUpdating with the Saturday bagel special which was insanely delicious 🤤\n*Don’t sleep on the specialty lattes either"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwck56cUNnEAE",
            "text": "Best brunch place in town period. What a delight it is for vegans as well- everyday they have a different menu! Both the bagel sandwiches and burritos are the tastiest I’ve had.\n\nYou gotta try this! It’s worth every bit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3di1QelR3EAE",
            "text": "My wife and I used to come every wednesday for the tacos as a breakfast date. We moved away last year, and if we happen to be in NY visiting family, we still stop here. That should be enough said."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobjlDXzdBRRAB",
            "text": "I got the Marisa Explains It All and it was superb! I don't even like eggs very much, but they were so fluffy and perfectly done that I enjoyed them in this sandwich. The food also came out in about 3 minutes. Would love to come back!"
        }
    ],
    "reviews_count": 72
}