{
    "name": "Leroy’s",
    "place_id": "ChIJbfyMKL9ZwokRNaAxnXt-zs0",
    "grid": "BK1",
    "address": "195 Franklin St, Brooklyn, NY 11222, USA",
    "rating": 4.5,
    "user_ratings_total": 240,
    "phone_number": "(929) 298-0051",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSVl6Qm1lbGQ0UVZSUVpFRm5hekJRZWpOQ2IzYxAB",
            "text": "Loved it!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdFMzaEpZVWwwZVZGMFZIQm1TWHBZZW1Ga05rRRAB",
            "text": "Attentive Staff, Delicious Food, Great Cocktails. ☺️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVVMxOWtSRlExYkVsUFh6VXdMVW95ZGtsMFJXYxAB",
            "text": "Fantastic service and the level of cocktail making is off the charts. Always a solid choice that deserves 5 stars."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bFpGRnZVSGxGWkhobFFrWjFRVmhRUmxKT09IYxAB",
            "text": "I had the most delicious dinner experience here, to share we order polenta sticks, scotch eggs, tuna poke, brussels sprouts, grilled little gems (MY FAVORITE THING), the fish sandwich (another favorite) and a brownie for dessert. Everything was so deliciously tasty and well made, every dish had so many different flavors. Totally recommend this place and be back very soon. Also everyone was so friendly and attentive 🩷"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUFYzQlFTREpyZGxkek5sZHBWSHBUYkdGbGRYYxAB",
            "text": "Very cute !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNk1uVkxiRVZsYTA0emF6TjRXbTEzWmpoVGEwRRAB",
            "text": "We stopped in for dinner tonight and were blown away by both the food and the drinks. We started with the artichoke hearts, followed by the burger and steak sandwich, and ended with the brownie for dessert. Every bite was delicious, and the service was just as impressive. We’ll definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SalpqVkNaalZzTW5aclRpMWphMGx0WlhsWFZsRRAB",
            "text": "Drinks were good and fast, food was fantastic, we will definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25acWRrcFJXa2N4UlZNMVdqSjRla3A1YmtWRE4yYxAB",
            "text": "The bathroom is shockingly gross for such a cute place, but the food and drink was pretty tasty."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbmVGQlFka2hzVDB4d1ZXUTNNVmgzVDFnelZGRRAB",
            "text": "Enjoyed happy hour at the bar. The staff were really friendly and helpful. The bartender even thanked me for mentioning my gluten intolerance and was very accommodating with our food order. We got the grilled Caesar and tuna poke bites which were very tasty. Would like to come back again for a proper meal. Cocktails were also good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjellWWmhOM2d4WTJoUVNHVXpjemhXV0d4amJIYxAB",
            "text": "Love love looooove this place. The staff really make the experience. Great dirty martini and ceaser"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQam41cmZSdnNmbmdBRRAB",
            "text": "Good and drinks excellent, sat outside was perfect. Staff was a little forgetful, was ignored at the bar and then people were sat before us outside. We also asked for one of our fries order to be honey hot, didn't happen. Nothing too bad to complain about while there, still a lovely experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKT2QwNHZVOExtdS1RRRAB",
            "text": "Such a warm and inviting space to enjoy a drink and/or meal. Our group came to Leroy’s and were treated impeccably and devoured a number of dishes - the cauliflower, artichokes and lamb were standout!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQR204cnlobWYtcUtREAE",
            "text": "Reason for 4 stars and not 5 is ridiculous price of 5 ounce pour of white wine. $17 for a shot of Pino Grigio. Burger, curry cauliflower and grilled artichoke were great. Service was excellent but $34 for two glasses of wine is crazy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaGVYbHVRRRAB",
            "text": "Food not great.  Service fair.  Atmosphere not great.  Ordered dinner special, which was smaller than appetizer portion.  Disappointing at best.  Appetizers, only okay.  Probably won't repeat."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNnRmcC1nRRAB",
            "text": "Good place in Greenpoint. It was very loud inside but they have nice terrace outside. Burger was huge and well cooked. Great service and hospitality."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNFpmVmtnRRAB",
            "text": "Nice restaurant/bar.  They have a horseshoe bar.  I sat outside, which was nice.  The service is good.  They have a good hh.  The Smashburger with fries was very good.  The prices are reasonable.  I want to go back and have their hh oysters and try their Sticky Toffee Pudding."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbHRUaXpBRRAB",
            "text": "Leroy’s is a great American Bistro! I highly recommend the burger, the chicken sando and the chiquelitas. The scotch egg was fire."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMkx5aGhRRRAB",
            "text": "best martini and burger in the neighborhood! also the playlist is always spot on - such a good environment. truly one of my favorite spots in the neighborhood!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaUtQdlhREAE",
            "text": "Food is terrific. Cocktails not so much. Worst Bloody Mary I’ve ever had"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnXzdyeXJRRRAB",
            "text": "My server is always really nice but we come here every Friday and the dude with the glasses is always so rude, I always say hello and for someone who comes here and spends weekly you can be a little nicer. Never smiles and just was so unaccommodating this time around, I come because my two year old daughter loves it here and we’re usually out within the hour. The burger is mediocre anyway."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndmFERm9BRRAB",
            "text": "BEST BURGER IN GREENPOINT! Leroy’s is a hidden gem that delivers an incredible burger experience! I tried their double smash patty burger, and it was absolute perfection—crispy edges, juicy center, and packed with rich, beefy flavor. And the shoestring fries are FIRE! Although the burger stole the show, we started with the Scotch Egg, Brussels sprouts, chips and dip--which were all super yummy!, and washed them down with a few of the best martinis we've had in NYC. The service was friendly, the atmosphere was inviting, and the food? Next level. If you’re a burger lover, Leroy’s is a must-visit! 🍔🔥"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaEozcFZ3EAE",
            "text": "Crab Rangoons are so so so good"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcXYtWTNnRRAB",
            "text": "Love this place. We have been there several times. Love the cocktails and the healthy food with fresh veggies. Service is very good, nice vibes."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBaEl2X09nEAE",
            "text": "Loved this place and everything about it.  Great addition to Greenpoint and highly recommend it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MTlLYXJBRRAB",
            "text": "Soo good!! Our group of 5 split a ton of stuff on the brunch menu and especially loved the burger, chicken sandwich and biscuits and gravy. Drinks and service were great. Definitely recommend and will be back!!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbGZQblp3EAE",
            "text": "Always a great time, food is very good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNW96UzVnRRAB",
            "text": "Good vibes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudlp1b0pREAE",
            "text": "They made sure that our special moment is ruined with the way acted\nGreat bartenders though shout out to them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudmQyWDR3RRAB",
            "text": "Very bad  service , very rude"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudmEyX2xBRRAB",
            "text": "Great food , great drinks but unfortunately the manager is a bit racist and make the whole experience a little bitter.Tbh when i pass by and see he is not there i would have a drink and a snack but unfortunately the color of your skin matters there. God bless you"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOFBqX0tnEAE",
            "text": "My favorite place for great food and drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURIdjQ5bxAB",
            "text": "Good food, good drinks, good vibe. But the bathroom is not fitting the standards of the rest of the place. That’s it. If the bathroom was nicer it would be 5 stars. I still like coming here though. The artichokes are so good, our favorite dish on the menu. Get them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIaVpxVHVnRRAB",
            "text": "Great place for some drinks to chill and chat, as well as a great DJ on Fridays"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIazhMTkp3EAE",
            "text": "Great for a date night! Excellent cocktails, burger and fried chicken sandwich."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIb3FHM3RBRRAB",
            "text": "Decent all around. Basic relatively upscale place with standard food. Maybe a bit overpriced, maybe not relatively speaking. Good vibes inside. Drink was good. Very good Brussels sprouts."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NzhtVF93RRAB",
            "text": "This place is truly a gem. Service is amazing. The food is good and bartenders are true mixologists. So many bartenders in NYC forget about customer service and just expect a 20% tip. No, but these guys go above and beyond to ensure you leave a tip with joy! I was so happy leaving a generous tip. The place is a good upscale restaurant experience for a good date night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OTVUQ2pBRRAB",
            "text": "Very cool bar, extremely tasty menu - both food and drinks. Awesome spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ3RfTzVnRRAB",
            "text": "Perfect neighborhood spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiZ3ZxbVBnEAE",
            "text": "Live near here so thought I’d give it a go. Had a look at the menu online and booked a table for two. Guy who served us didn’t know the menu, as I wanted some extra toppings on my burger. He said that was only lunchtime, but I told him that the online menu said it was for dinner. He was adamant that I was wrong. I was actually right. Beer selection is not on the table menu but actually scrawled on a mirror on the wall. That’s ok, but we weren’t told that initially. Between bringing us our food and me eventually asking for the check when we were ready to go, our server didn’t actually come near us. Not once. I’d wanted another beer as my lady was sitting enjoying her cocktail, but eventually decided not to, as our server was always busy elsewhere. Our experience of our time there, was reflected in my paltry tip. Which is how it should be. Won’t be back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeEkzc1B3EAE",
            "text": "I’ve been here before and I had an amazing dining experience in the past. We are Greenpoint locals. My boyfriend and I decided to come back here again for our 3 year anniversary and our dining experience was terrible. The restaurant was empty except for the ppl at the bar having drinks. We were seated at a 2 seater table by the window. It’s summer time and it’s about 87° outside. The window seat was so hot. It felt like the heat was coming from the floor. There was another couple who came in after us and was seated next to us. We waited about 10-15 min before our drink order was taken but the waiter took the couple’s order next to us first. Which was very strange because they came in after us. The waiter then took our drink order and appetizer order. We were still deciding on our entree. Our drinks and appetizers came out but brought to us by a different person. The waiter did not check up on us once. He was on his cellphone, scrolling or texting most of time. When we were ready to place our entree order the waiter was standing in the corner looking down at his phone. He walked by us heading outside while still looking down at his phone. I had to knock on the window to get his attention. Which is super frustrating. We placed our food order and one of the cooks came out and switched out our water bottle for a colder one and he asked how is everything. We told him the food is very good. The food here is delicious but I’m so sad the service was so poor. I wanted another drink but the waiter never came by to check on us again so I wasn’t able to place another drink order and I was so frustrated that I didn’t even want it anymore. We waited another 15 min to get the waiter’s attention to close out. Again he was on his phone and not paying attention to us. We finally closed out without ordering dessert which I would’ve loved to get but after this experience it was pointless. I don’t think we will be back here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycDZIWnhRRRAB",
            "text": "Nice lil spot, a bit pricey but decent food and good cocktails."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyczVLRWlBRRAB",
            "text": "Favorite place ever, visit twice a week - amazing food and the friendliest staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeTRPM2J3EAE",
            "text": "Amazing atmosphere and great food. The honey-do-list cocktail was phenomenal. Shoutout the manager Wilmar he helped me out with a special request. 10/10 will be coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6eFpXeE1REAE",
            "text": "An underdog of nyc burgers… it’s simply incredible. Juicy Double patty smash burgers with excellent sauce and the fries are great too. Drinks are creative and tasty. Hidden gem"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6LXZTVHV3RRAB",
            "text": "Bobby is simply the best! He knows how to treat his customers. Chicken sandwich was incredible! One of the best spots in Greenpoint"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKM05EZmx3RRAB",
            "text": "Nice staff, food is good\nStill a great place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqci0zbG1nRRAB",
            "text": "It’s a whole vibe ❤️❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeFl5VUJREAE",
            "text": "Needed a place to unwind between appointments and this place was perfect.  Drinks were well crafted and food was tasty.  Loved the service and attention."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd002d1dnEAE",
            "text": "I celebrated my 40th birthday here and it was amazing! From the moment we walked in, we were greeted with great energy and enthusiasm! It was all uphill from there. The food was delicious, the drinks were perfect, the music was perfectand the overall experience was incredible for our group of 12! Thanks to everyone at Leroy’s for a wonderful evening!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5NS0yN09BEAE",
            "text": "We came to have a dinner with our friends tonight - a 6:30 reservation for four. At around 8:10, when we were done with the main courses, the waitress came by and asked us if we would like anything else, like a desert. We obliged and happily ordered desert. A few minutes later, the waitress hastily brought our check before the desert came out, and told that us that while the desert was on its way, the restaurant would need our table in the next nine (yes, precisely nine) minutes for the next party. I asked if were supposed to just scarf down  our desert when it finally came out and was told - \"yes\". I did try to protest - we were never informed about any time limit, and why were we offered a desert in the first place if the restaurant needed our table so suddenly? I never got an answer, but I suspect it was to charge us another $25. The desert was mediocre, by the way, as was the rest of the food. When we were leaving, nobody was waiting for our table. Oh, and nobody apologized, but I guess they didn't have any time for that."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwel9xTElREAE",
            "text": "Me and my husband used to visit from time to time this place. This Saturday we decide to take a brunch with some eggs. We didn't wait long and had a really delicious meals. Three colour potatoes and bun with bacon and egg, this was so yummy! I had a two hard shell tacos with sunny eggs and meat with salsa, spicy and delicious! Highly reccomend this gem spot of bars in Greenpoint because of their cousine and great staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcmMtX2hnRRAB",
            "text": "Great neighborhood spot. Can’t go wrong with a seat at the bar. The bartenders know what they’re doing with the cocktails and can easily make something off menu.\nThe menu has a lot of strong comfort food items while also offering vegetarian options.\n2nd time here already! Have a feeling this will become a favorite local spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKM1B1MFpnEAE",
            "text": "I think it's my favorite bar in the GreenPoint area.\nJoe is not just a great bartender but also a good human being with a great sense of humor.\nChicken sandwich and the burger is a bomb.\nBrussels is awesome.\nJoe remembers my drinks and that’s so cool.\nChef Nahiyan is a homie.\nWilmer the bar manager also a fine-cut Gem."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlZ0xlT2Z3EAE",
            "text": "Everything is so good. Tuna poke, mushroom toast, and muscles are my favorite. Vibe and layout in this place is 👨🏻‍🍳💋…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eko2cVZ3EAE",
            "text": "Friendly and laid-back vibe. Disco music playing was a huge plus 🎉\nDelicious oysters,  head-on prawn special was yummy, and the French onion soup was incredible.\nBehind the bar was Anna, who was lovely! Happy hour drinks were on point!\n\nWill be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcU9MVXh3RRAB",
            "text": "A small but honest restaurant with very well cooked and interesting dishes. I must say that the prices were very good as well pleasant and polite service. I recommend it and I will definitely go again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcm8ybldBEAE",
            "text": "Fried chicken sandwich was the draw to come here and it was delicious. Love the vibe of this place too, great for happy hour and dinner on the early side. Perfect spot up in Greenpoint."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1b09YdXhBRRAB",
            "text": "Great spot for delicious cocktails and food! My friends and I went on a Saturday afternoon for drinks and apps. Their weekend happy hour drink special is wonderful, with lots of fun drinks to choose from for a reasonable price. Our favorite…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkOUwyZTdRRRAB",
            "text": "Came here for brunch on a Saturday w/o a res and had no trouble being sat right away. Bloody Marys were so good pretty spicy and flavorful. biscuits and gravy were delicious and so filling"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtczdtLXdnRRAB",
            "text": "i saved all my calories today for a banger dinner and the poke and burger did not disappoint. hard to even say what one was better. i love the little crispy rice 🍚 the burger, man, the two patty smash burger was it for me. i had to pace myself because every bite was that good.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxby1Ub3pBRRAB",
            "text": "Great music and service.  Had the burger and fries.  The fries were delicious.  The unique round bar is the center piece of the place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacHVhNERREAE",
            "text": "Really good food and cute place but the service was slowww. Asked for a coffee 3 times before I could get it. Had to go up to the bar to get sugar after asking the server twice more for it and not getting anything."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldFpUbFN3EAE",
            "text": "Yummy food with amazing service. It’s a lovely neighborhood spot. The chilaquiles was flavorful but not heavy. French toast was great too! Will be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdkkzdWNnEAE",
            "text": "Love to come here for the hot chicken sandwich. Delicious! Everything from the staff to the food is fabulous! Great HH cocktails too :)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NU1DSmJBEAE",
            "text": "A really enjoyable experience. Good food, good service, great atmosphere. Make a Resy it can get busy during rush hour."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdTZfMzZ3RRAB",
            "text": "Came here for drinks and some bites. Had a great time — the drinks and food were great. Bartenders were friendly. The played great music, too. Will be back, and would recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyZ1lfY3NRRRAB",
            "text": "Leroy’s is amazing, the food is so delicious and the drinks are inventive and tasty. Highly recommend sitting at the bar. The servers are friendly and chatty, as well as those sitting around you! If you want a more quiet experience, the tables are also very cozy and private. A great place to come back to time and time again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bEl2bnlnRRAB",
            "text": "The spicy tuna poke was outstanding. I definitely will be returning to this establishment. Chill atmosphere, great service, and impeccable food. Very happy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtd09TLVlREAE",
            "text": "We had an amazing experience all around at Leroy's! The food is phenomenal -- I was with a large group and we shared most everything on the menu, and each dish was delicious and unique. The veggies are out of this world (which I especially appreciated!). The drinks were also extremely tasty. The bartender really seemed to be having a great time making unique cocktails for our group, and had a real passion / pride for each round, explaining the drinks and curating next drinks for our table. Equally good was the restaurant itself, with one of the most unique U-shaped bars as the center piece and cozy tables surrounding. The music was rocking (not in a loud way, but in a super fitting to the atmosphere way) and whole staff was a pleasure to be around. 11/10, will go again. For friend reunions, hot dates, parent trips and more!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0cDZ5bjR3RRAB",
            "text": "Love this place! Their Happy Hour smash burger is simply the best. Pair it with a martini and you’ve got yourself a perfect night. The curved bar is great for people watching, if that’s your thing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNzkzelJ3EAE",
            "text": "Leroy's is amazing!! We went on a Saturday for brunch and tried several things on the menu that were delicious and beautifully served. The Biscuits and Gravy are the best I've ever had, and I grew up in the deep south. The fluffy, buttery…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkXzhtRGJ3EAE",
            "text": "This is one of my favorite bars in Brooklyn, everyone from the Chef who is amazing and really cares about the food produced to the manager who has looked after us so well.\nI think this has the best blend of everything also they play the best music of all the bars in Greenpoint."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeE9PRnZ3RRAB",
            "text": "Leroy's has the best burger I've had in NYC. It was so good, I convinced my friends to tag along the next week and now we're setting up plans to go every week. The food is delicious, the drinks are amazing, and the atmosphere is comforting and elevated. This is def one of the best places to hangout with friends or come solo for a good meal. See ya'll soon :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbXRuM1VnEAE",
            "text": "Most delicious meal I’ve had in NYC! The Chicken Liver Mousse was delectable, the drinks were perfect, too. Lovely environment and customer service.\n\nP.S. we left our umbrella here 😆 we’ll come by tomorrow to pick it up!\n\nThank you!"
        }
    ],
    "reviews_count": 74
}