{
    "name": "NURA",
    "place_id": "ChIJYzpV4SNZwokRfX0a28jsH5Y",
    "grid": "BK1",
    "address": "46 Norman Ave, Brooklyn, NY 11222, USA",
    "rating": 4.5,
    "user_ratings_total": 779,
    "phone_number": "(347) 672-1222",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210d1kzZEdVbkoxWDFWb1JXTm5PVmxtYzNkNVVsRRAB",
            "text": "We had our wedding at Nura and it was the most incredible night! We live in Greenpoint and have eaten dinner and brunch there multiple times, but to host our wedding there was beyond my wildest dreams. We wanted a non-cookie-cutter wedding that still had elements of tradition and Nura’s event planner, Mel, worked with us to bring our vision to life. During the planning process, they were so easy to work with, and it was seamless every step of the way. Skip to the big day and it was the most beautiful space, full of sunlight, greenery, and the most amazing food and beverage service. We had 110 people for the ceremony and reception, and the transition of the space was seamless. No one ever waited more than two minutes for a drink at the bar, and the food was coursed so perfectly all night long. We did not want a sit-down dinner, but we wanted our guests to be full and satiated with their amazing food. We have received so many compliments on the insanely amazing food and so many people have said, “I’ve never had food that good at a wedding before!” My compliments of the staff are endlessly positive and I can’t thank them enough for being the perfect hosts for our big day. We can’t wait to be back for dinner again soon!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNFJWTm5SMWhpVlMxMVFVUlZOVGgzVGtOWlNWRRAB",
            "text": "They have a warm environment friendly staff clean environment and etc"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tselJrNDBhVWhXUkU1RVNGTnJaR2h4VXpKak1WRRAB",
            "text": "The sea bass was the best item, even better than the lamb. The coconut dessert was also a top experience. The waitress was odd, giving side eye looks and being obviously annoyed when someone in our party asked to taste a wine and she was being kind of sassy. I mean she’s human and we all have our off days, so don’t fire anyone over it, but still impacted our experience. We ordered 5 items, 2 large entrees. The atmosphere was lovely, and decorative."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKbE1qSk9RbDlWZFhCbFFrcEpUbFZZUVROM1QyYxAB",
            "text": "We went for my boyfriend’s birthday dinner and got the $80/per person prixe fix dinner. The portions were on the smaller side (2 lamb dishes for 8 people, 3 bass dishes for 8 people + other small dishes) but everything tasted great and we were pleased with the offered selections. The naan was pretty outstanding and the bass dish with Swiss chard & ceviche with pomegranate I highly recommend. We forgot that one of our guests had a shellfish allergy and they gave a swordfish skewer app on the house, which was generous and a very sweet touch. Overall great atmosphere and service. Thank you again!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cVVISk5Zbk0zY3psU1lYZG1RMmxMYkZSd1JVRRAB",
            "text": "Excellent experience from start to finish. An intimate, distinctive ambiance, well-made cocktails, and flavorful dishes. Strongly recommend for anyone seeking high-quality drinks and food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GeFVVdFplWFUyVGpoNGNFMDROamRHWHpKMk1FRRAB",
            "text": "Nura has a cozy, inviting vibe and the food is really tasty—flavors are bold without being over the top. Service is friendly and laid-back, though a few dishes could be a bit sharper. Still, it’s a solid spot for a relaxed meal and worth stopping by."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SR1ZYWnVRV0p0V1VSNk1HVlVkR0ZVZGxkWFgzYxAB",
            "text": "Omg the best customer service and the food was delicious thank you"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGelJVbGFWa3MxU0U1dFZ6WjNaMVpLYW0xUGJHYxAB",
            "text": "Food, vibes, all of it. Great spot, highly recommend."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNFEyVTFjM2hIWW1aV04xRlJNbTV4VFdwcGVHYxAB",
            "text": "Disappointed and shocked by how we were treated because of a service dog.\n\nWe were a group of four people (All immigrants, including a Black person) and one service dog, and we were asked to leave the restaurant after the dog barked. The person who seemed to be the manager, with short hair and glasses, spoke to us in a very rude and angry tone, saying that “a service dog doesn’t bark” and that if it did, we would have to leave. The anger and irritation in their voice were obvious and made everyone at the table uncomfortable.\n\nWe had already ordered our food, and just as it was about to come out of the kitchen, the same person came back and, once again in an unpleasant and harsh tone, told us to leave immediately. The dog barked only once, not repeatedly.\n\nI completely understand that the staff might have the right to ask us to leave, but the way it was handled was unprofessional, disrespectful, and unnecessarily aggressive. My husband even asked if we could at least wait for our food to arrive, but the person insisted that the dog had to leave right away.\n\nSo we simply stood up and left. No arguments, no food, just disappointment.\n\nWe live in the neighborhood, and this was our first and unfortunately our last time at this restaurant. We are all human beings and deserve to be treated with respect, empathy, and tolerance."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bmVFUnRiR2RPTkVOWmVIWjBiM3BoWWtWS05VRRAB",
            "text": "Naan and dips were so good. We got the Carrot and Yogurt dip and they did not disappoint. Sweet potatoes were also a standout"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKd1MxbzJSbk5VYUROMlJHVldhRWg0UzIxdE1GRRAB",
            "text": "Truly one of my favourite restaurants in New York! The food, service and ambiance is impeccable! Went for dinner the other night and got a fantastic array of dishes - my personal favourites included a swordfish skewer with dated and their sweet potato. Then to top it all off, I had mentioned wanting to try their clarified margaritas after seeing it at the bar and our waiter brought us a taster! Truly fabulous dining experience highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMlRVOXVMVTlMY0V0clpGZEZlaTF6YlRaUFdIYxAB",
            "text": "first of all, a huge shout out to our lovely waiter aceyyyyy 💫 you truly made it a wonderful dining experience. he guided us perfectly for our first time at the restaurant, and every single dish was phenomenal!!! you know you found a gem when you want to start bringing all your loved ones here. i can’t wait to share this place with many others, and i am still dreaming of the basmati rice and the mussels…. chefs kiss 🤌🏻"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeGFHaDZOeTF6ZGtaNU4zSllVeTFNUW1wbUxXYxAB",
            "text": "This place is an absolute disgrace. Nura is not just a bad restaurant it is a racist and humiliating experience waiting to happen.\n\nThe first time I came here, I was ignored for fifteen full minutes. The waiter, Anthony, walked back and forth to every other table but mine. When I finally asked what was taking so long, he couldn’t have cared less. His attitude was uninterested, dismissive, and flat-out insulting. When I told him I was leaving, he didn’t apologize, didn’t care, just smirked and said “ok, don’t worry about it, you don’t have to pay for the water.” Imagine that level of contempt for a paying customer.\n\nA decent manager convinced me to give this place another try. That was my mistake. Last night proved beyond doubt what kind of establishment this is. I asked for a booth. I was told “booths are only for special occasions.” On a Tuesday night, three booths sat empty while I was denied. Minutes later, white couples in jeans and t-shirts were seated in those very same booths. My girlfriend and I were dressed up, celebrating, and if anyone fit their so-called “special occasion” requirement, it was us. But we weren’t white, so we didn’t count.\n\nWhen I brought this up to the manager, she couldn’t have been more indifferent. No attempt to fix it. No acknowledgment of how blatantly discriminatory it was. Just another layer of disrespect on top of an already insulting night.\n\nThis isn’t bad service. This is a pattern. This restaurant has a history of treating people of color like second-class customers, and the staff and management clearly think they can get away with it. It is garbage. It is racist. And it deserves to fail.\n\nBrooklyn is filled with restaurants run by people who actually respect their guests. Spend your money there. Do not give one cent to Nura.\n\nEDIT : Response\n\nDiversity on staff does not equal respect in practice. A restaurant can be staffed by women, people of color, and queer folks and still treat guests in a discriminatory and dismissive way. My lived experience as a paying customer was one of being ignored, excluded, and disrespected. That’s the bottom line.\n\nSo no, my claims are not “baseless.” They are firsthand. And if Nura wants to lecture customers about how “hurtful” accusations of racism are, maybe they should focus on making sure those accusations aren’t true in the first place.\n\nNura’s attempt at a defense only proves my point: this is an institution that will gaslight you before it ever apologizes or admits fault. Which is why I repeat this place is trash, and it doesn’t deserve your business."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVFgzSlBNWGR0TmtOb2NqZEtWVzFuY1VsVlZXYxAB",
            "text": "Food was good! Came for brunch and the curry chicken sandwich and avocado toast was the crown favorite.\nThe grilled cheese was also great as the salsa sauce was the perfect pairing.\n\nI will say- they did forget to make one persons entree but it was comped as an apology. Additionally, please be careful with allergies! I do have a shellfish allergy and was told everything on the menu was fine. They offer ceviche which contains scallops. Of course I wouldn’t order it but please be careful with wording, some customers may not know the dish or read descriptions - you never know right?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNVowSllXWE0wTVZoVFEyZGFiM2szUm1WU09YYxAB",
            "text": "Wonderful place!\nThe staff is so sweet and professional. The atmosphere is great from the bar to the toilets.\nMusic was great. Upbeat not too loud. Lighting is amazing and attention to details.\n\nThe ceviche was my favorite! The salad and the chicken were amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMmJYWXhPVXBRT0haWU5HOUNNR0pJUm5Ga05VRRAB",
            "text": "Great restaurant. Beautiful space, excellent service, incredible food. American-Indian fusion. The curry fried chicken sandwich on focaccia is one of the best fried chicken sandwiches I have had anywhere. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSVEybDVZM0V5U1RCMGFXdzVhVlZwZVZGTVZrRRAB",
            "text": "The most delicious bread and dips you could ever ask for, great atmosphere for a group dinner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWU5WVlFla0pWUW5neloyUkJkRGxZUlU5MFRsRRAB",
            "text": "Great place. I was worried about the limited menu choice before I went but needn’t have as the food was amazing. Best naan bread I’ve ever had, could’ve just kept on eating those fluffy charred clouds all evening. Great cocktails too. A must visit in IMHO"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaFNtVk5kVFkxWlRWNFVYRkVVbGRTZERGRVZtYxAB",
            "text": "great food.\nexcellent drinks.\nCool environment.\nService is overbearing and intrusively attentive. They rush you out ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Jd1JFMXFkVVp6ZERaeU5XeHRjR00yUzNodlJGRRAB",
            "text": "Had a great experience at Nura! The food was very good—flavorful, well-balanced, and clearly made with care. Service was efficient and friendly without being overbearing. The space itself is also really nice—stylish, comfortable, and inviting. Overall, a solid spot for a delicious meal and a great atmosphere. Definitely recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMlZYVnFjaTFPYldwaGNqY3RjRVZuVmt4QlIwRRAB",
            "text": "I went on Tuesday for a special occasion and food & drinks were so great that I came back again Saturday. However, the seafood tasted not fresh and fishy the second time around. It  was a little disappointing that the quality of the seafood was inconsistent. Everything was cooked well and service also is top notch. Just wished it was good the second time around!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obFYwMURVM1puV1VjMmRsOTZlV0pwZEdwdVNWRRAB",
            "text": "Had such a great experience at Nura! The drinks were spot on and the dips were absolutely amazing. Everything we tried was fresh and flavorful. Can’t wait to go back and explore more of the menu!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sV1ZYWk1SMGhPU0hRM2FrNXNkRkExZDIwM1dIYxAB",
            "text": "Came here on a Tuesday night and had a great dinner. Ordered the Watercress Salad which was amazing! 10/10 Loved the textures and flavor of the celery root and pickled green tomatoes.\nThe real stand out was the Naan! IF YOU GET ANYTHING GET THE NAAN! Best naan I’ve ever had!! Fresh, hot, soft, buttery and delicious! 12/10 Most naan is okay and the dips help take it over the top.  Not this naan. Incredible on its own!\nWe got the yogurt and green chili hummus and they were both very good! 9/10\nNext we had the prawns which we a little undercooked and the heads seemed a little raw. Also the sauce was very citrusy and it seemed to overpower and take away from the flavor of the prawns. 6/10\nThe swordfish skewer was cooked to perfection and great if you enjoy the sweetness of a breakfast dish like waffles. The bacon seemed to overpower the flavor of the swordfish which seemed a shame bc it was amazing on its own. The dates also add that extra kick of sweetness. A good dish just not up my alley. 7/10\nThe lamb shank was also cooked perfectly, but lacking in any standout or distinct flavor on its own. The puree, yogurt and herbs were where the dish shinned and if you got a bite with everything it was good, just seemed as if the lamb was there for protein and as the sidekick. Would have salted a little more to help. 7/10\nLastly we got the bass which was yummy but also not as unique or delicious as the apps. 6/10\nAppetizers were the standout of the place and would come back for the salad, many plates of the naan, and the swordfish."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNlowbGpjVlJZVjFoUVFXeHBaRGhPWnpGUFIyYxAB",
            "text": "Waiters in this restaurant are not knowledgeably about their own menu and ingredients in their dishes.  My daughter went here last Friday (8/8/2025) for dinner with her friend.  She mentioned all her allergies which is nuts and sesame seeds to the waiter and asked for his suggestion as to what she can eat.  He suggested few items and one of them was ok.  But other one (roasted carrot with whipped tofu) and the whipped tofu had tahini in it. She ate just tiny bit of the dip and felt sick.  After few mins, she had a full blown allergic reaction which is life threatening and ended up in emergency room with issues with breathing.  When asked the waiter what does the dip had and she found out that it had Tahini and the waiter didn't know that Tahini this information.  This so unacceptable.  Tahini was not mentioned in the menu and according to the server their own chef supposedly has nut and sesame allergy.  How Ironic is this? so if you have any health issues, please be careful about this restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMGJrSnJOVGhET0VSYVdFcEtPREZWV0V4dlIzYxAB",
            "text": "Excellent breakfast"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNWRqRnFjbEZDTkZwSE1EZzJabVZYUldWeGVsRRAB",
            "text": "Very warm lighting inside -- would be great for a date night. Their naan was one of my favorites, I would skip on the roti. I got their carrot dip which was pretty good but a little bland. Lamb ribs were also good -- a little fatty but the herb salad balanced it all out pretty nicely. The swordfish skewers were also great, the dates really added a nice balance. I think most dishes here lean a little on the sweet side, which I didn't mind but something to think about if that isn't your preference."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swM2JGWjZkMDlEWTNnNFdVeERlVkJxUnpaeU4yYxAB",
            "text": "Everything about this place was so delicious and the space was incredible but I couldn’t get over the fact that I was paying $5 for a single piece of naan and $7 for a single piece of roti. We also ordered one of the skewers which was over which was $15 but it was just one skewer. Seems like we overpaid significantly for that as well. They said all the plates were to share, but how do you share a single piece of naan, the size of your palm and one mushroom skewer??? Also, the waiter never asked me if I wanted another drink… so service felt a bit inattentive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaGVHNVpVemR5Y2xodWMxWnVXVFpZYTFKcVNuYxAB",
            "text": "One of the best restaurants in the city. The vibe was incredible, food was amazing and service was outstanding. Highly recommend for date night or catching up with friends. The naan is to die for ⚡️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OV1J6QklZelpRV0MxcmIybHFRbXgwZG5OSGVsRRAB",
            "text": "Amazing ambience amazing food and service was great too. Servers are super friendly and a great place to have dinner!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRlYwNXdlRXg0WWpOb1JEQmhPWEZFT1doRk1rRRAB",
            "text": "Great food, great service but it should be a CRIME to make your waitstaff work in a 90 degree restaurant — cant imagine what the kitchen is like. Even more disturbing when the interior looks like it was given above average consideration."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odWIzcHVMVlZoVVVkTlVYRnNlVEp0ZVU1SlVGRRAB",
            "text": "Some of the dishes were really delicious, others were just good. For the prices and the tiny portion sizes, I’m not sure we would return despite there being a few highlights. I understand that the concept is shared plates / small bites, but as some point the dishes are too small to be shared. We came with four people and would argue that three is the maximum number to split each plate with since some of the dishes are three pieces each. For example, there were three pieces on a swordfish skewer, so two people are left splitting one cube of swordfish. Every dish left us wanting more but to the point where we never got satiated with the dinner. That being said, if you’re going here then we would recommend the naan, yogurt, hummus, ceviche, swordfish skewers, the mussels, and the basmati rice. The lamb was also good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNVEzWTRNbGRpTFRaSE1IbExTRzFzVlRseVozYxAB",
            "text": "Best naan ever! Bass and basmati were amazing. Havent had a meal so amazing in a long time. Gin drinks were perfect too."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMFRYQXRTRGhFY1dFelNteEdORXhhUm10Tk4yYxAB",
            "text": "We came here on a Sunday early afternoon and had one of our best recent dining experience. We live close by so we went in hoping it would be a gem and it absolutely didnt dissappoint. The garlic naan might just be the best we’ve ever had. The mussels were very fresh and not sure if it’s the season but the flesh was super fat. The sauce it was cooked in was also very very good. Dipping the naan in that sauce was straight heaven. We also ordered the rotisserie chicken, which we thought was a bit pricey at first but man, it was cooked to absolute perfection. Crispy skin, JUICY all throughout, with grilled lemons and a decent sauce. The service was also phenomenal. Our server had great energy, and provided us the perfect balance of attentiveness and space.\nThe vibe of this place is also top notch. The modest exterior is only hiding the spaceous, modern, and elegant interior.\nOverall, we could not be more thrilled about this find and will definitely be coming back to try their drinks and sea bass dish! Highly recommended for an absolute treat."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tad1pUZ3lkMTkwVGpGTmRsZGhRMm80Y1dzNVoxRRAB",
            "text": "Really well done space is great and staff was exceptional"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdFVWWnBSUzFSZFVoWFpXeG9ObXhaWjB0NGNVRRAB",
            "text": "I came here for dinner and had a wonderful experience. I ordered the naan, green chili hummus, watercress salad, basmati rice, Japanese sweet potato, and the whole black bass. Everything was flavorful and prepared nicely, but the sweet potato was a standout."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSFNYSmpjMlJxVUZCWVlWUldUekZ3WW5kT0xVRRAB",
            "text": "It is impossible to tell what the hell is going on with the menu. What is a big plate & what is a small plate? I know it’s ambiguous to try and be cool buf it’s super annoying.\nI wound up having a piece of bread and four pieces of dried chicken for my dinner?? And it just really sucked. I eat restaurants all the time, but I just couldn’t get my head around what the hell they were trying to sell me. Food isn’t bad if you can figure out what the hell kind of food you’re gonna get. Drinks were ok $$$"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NFZEbFJaV1JSVDI1UldUUlNWRVZuVUZveE5WRRAB",
            "text": "Loved it here. Beautiful interior - food was delicious and very reasonably priced. Fully recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMGVVTXhMV2hTVFdWa2EwRkllV1JwYzNOTFYxRRAB",
            "text": "Good experience"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweFNUUnRRV1p0Ym5kWVRGOHllRzF1WVhab01sRRAB",
            "text": "4th time here and every time I leave well satisfied, the staff right out of the gate are well prepared friendly and relaxed. The decor is really well thought especially as it used to be Gabriela auto body repair. The lighting the exposed kitchen and furniture are all well thought out. The food is just great really I would say it’s like upper middle not too fancy but right before it in a good way. Everything is great I’ll post some pics! If I’ve been 4 times you should have been here already! Kudos nura"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWemJXTkpOVkkyWnpKSmMzSkVRbTFmYzBaSU5tYxAB",
            "text": "This place was absolutely lovely and the staff were even better! Kira and Shawn (sorry if its misspelled) were amazing. They were kind, and their energy was just all great all round. We ended up staying longer than we thought and ordering more because of them. Place was beautifully decorated, and lots of ample space. Staff made me feel genuinely appreciated. Thanks so much for the amazing service and I hope life treats you well to you both!!\n\nWrote this review late as we were here a week ago almost. Definitely come visit if you haven’t already!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RFIydFdOM05SZUdsNFJ6SndaVE14TURWalRHYxAB",
            "text": "Ive eaten here several times and it’s always a treat. The menu changes seasonally and you can tell the chef really cares about flavor and texture. Some dishes are naturally better than others. Beautiful setting and friendly servers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMcmttYmo0d19qZzZ3RRAB",
            "text": "Atmosphere and service stands out. Apps & drinks are great, BUT their main dishes like lambs didnt wasnt really great. (Didnt even take photo.) Also, they got rid of bread basket so had to order parker rolls & naan individually. Naan is to die for, you can skip the parker rolls."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VOLWZ5ZjNjeTh5WVNREAE",
            "text": "I came here for a friend's birthday for the first time in a year.  Nura is a frustrating place. It’s beautiful—undeniably so. The space is light-filled, thoughtfully designed, and feels like it should be a haven for great food and warm hospitality. Instead, it feels like someone handed a stunning restaurant to a group of white finance bros who see hospitality as a performance and vibe as a brand campaign.\n\nThe energy in the room is strange. What used to feel communal and vibrant now feels performative and exclusive. There's a bro-y undertone that’s hard to ignore—like everyone’s in on something you’re not, but that something is just mediocre cocktails and loud flexing. You get the sense that the staff has to perform friendliness for a clientele that doesn’t actually respect it.\n\nThe food? It's fine. Occasionally good, rarely memorable. But any dish, no matter how well-executed, gets drowned out by the overall energy—like the restaurant is more concerned with being Instagrammable than genuinely welcoming.\n\nWhat’s most disappointing is that Nura used to feel like a neighborhood gem, a place where you could bring friends and feel like you belonged. Now it feels like a pop-up networking event for venture capital interns and their Hinge dates. It's not that the clientele is just young or affluent—it’s the total lack of soul behind the polish. It’s whiteness as aesthetic. Bro culture in natural wine clothing.\n\nIf you’re looking for warmth, depth, or actual hospitality, go somewhere else. Brooklyn has better."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPXzR1Wi0teW9teWRnEAE",
            "text": "This place flat out rocks"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKaXMtWXpQbklTbUh3EAE",
            "text": "Celebrated my birthday here this past weekend and I was beyond impressed. We’ve dined here before but the experience was perfect this time, amazing food, incredible staff, and an overall genuinely wonderful time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWFZ2N25Qb1otUjB3RRAB",
            "text": "Great ambience and delicious food, hostess and waiters very friendly and accompanied"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMNk91NzIxa0lYbTlBRRAB",
            "text": "Nura restaurant\n⭐⭐⭐⭐ (5/5)\n\nNura restaurant offers a cozy atmosphere with friendly staff. The menu features classic comfort food—think creamy pasta and juicy burgers. My chicken Alfredo was flavorful, though the portion was slightly small. Prices are reasonable. Service was quick, but the place can get crowded on weekends. Great for a casual dinner!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPYlRxdERiMnFhU3Z3RRAB",
            "text": "They were very accommodating for gluten sensitive folks, and the food was amazing. Everything was good, but the sweet potato was easily my favorite. Excellent mocktail selection for non drinkers."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMcVU3NTJtaWFHYWhnRRAB",
            "text": "Mixed experience at dinner last night. We were a party of 7 and ordered much of the menu. Food was a mixed bag. Starters were small-portioned for the price but generally excellent, in particular the buttery pillowy naan/roti breads, garlicky labneh, roasted carrots, super fresh fluke crudo, deliciously smoky farro, refreshing pea shoot salad and tender Japanese sweet potato. The green chili hummus was mid -- it had a strange gloopy texture. Things went downhill with the mains: the whole roast chicken (a steep $80) was well cooked but had little flavor... it was covered in a delicious bbq-like sauce, but that wasn't integrated with the bland chicken. And the lamb ribs ($34) were borderline inedible - basically all fat. Beautiful airy space, good service, nice drinks, but demerits for high prices, small portions and limited/unimpressive mains."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdklvN2JLMXZEYWR3EAE",
            "text": "Really really excellent food service and atmosphere. My favorite Mediterranean place"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbF9DZDlRRRAB",
            "text": "빵 칵테일 모두 어썸\n재방문 의사 120/100"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueTRmdmx3RRAB",
            "text": "맛있어요."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMm9PQzJnRRAB",
            "text": "First time to NURA and it was amazing, came for brunch. The interior is gorgeous. We had the BEC and the Creole Coconut Curry with some fresh squeezed OJ. 10/10. Just a heads up, they don’t have an espresso machine but they do have coffee. Our server Alex was very good! They also have this super cute sitting area in the front left area. We will definitely come back for another meal."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbU0yWkJBEAE",
            "text": "Warm and welcoming service. Many dishes offer a unique twist on traditionally Indian flavors. We thoroughly enjoyed the dips, naan, and mussels. The prawns and black bass while well prepared,  were slightly overcooked. Overall a great spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNud2V5MkZREAE",
            "text": "Wow I LOVED this place! Especially loved the small plates to share concept, as I tend not to finish my meals whenever I eat out so this was really perfect for me.\n\nFood was EXCELLENT, I especially loved the red snapper, the chicken, the lamb, and the bread + the dips (yogurt dip especially)….so essentially everything I ordered LOL. Also want to note that the red snapper tasted very fresh and didn’t give off a super fishy smell so that was an added bonus.\n\nThe restaurant itself is also absolutely beautiful, so open, and the ceilings are high. Lots of plants and light. The ambiance and styling is just really well done.\n\nService was also lovely, they checked up on us regularly and were really helpful when we asked questions about the menu."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcTdyVlhREAE",
            "text": "I’ve been here a few times now and have always had a great experience. The food is top notch, as are the servers and the drinks. I really like the decor and the set up of the space. When I went recently, it seemed like they’ve done away with their array of breads that they offer to accompany your meal, which is really unfortunate. Please bring that back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdzlLeV93RRAB",
            "text": "Love this place! The food, the drinks, and the design are all excellent. They have created a warm, vibrant atmosphere with plants everywhere and beautiful dishes. Their breads and dips are delicious. I do wish they give 2 per order as we kept having to place more orders of bread. But the naan is amazing, the lamb was so tender and flavorful. Finally, the sticky toffee pudding was the best dessert I have had in a while. We will be back again soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubGJQWGZBEAE",
            "text": "Good vibes and cute restaurant overall with good service. Drinks were overall good and not too expensive.\n\nFood was overall too salty, the set of dips had potential though. Braised lamb had good texture but the flavor wasn’t there (vegetables were too salty but the meat was flavorless). Roast chicken was good. The grilled shrimp, lamb kofta and mussels were all decent. Nothing really stood out."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJamR5cEZnEAE",
            "text": "This is a world food dinning establishment grabbing flavors from all walks of culture. Delicious food, large space, beautifully decorated with Lucious plants. Great hang for date night or group hangs."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUN3NW9oZxAB",
            "text": "I’ve been to Nura several times now through different menus and have consistently been impressed by their food, bar menu, service and ambiance! I can always count on anything that’s grilled to be 10/10. Most recently we had their marinated mushroom skewers which were great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMDZQRnpBRRAB",
            "text": "A great dining experience with an array of different dishes!\n\nIt’s hard to find a good enough word to describe the lamb kofta! Warm, comforting, delicious, savory, delicious.\n\nThe garlic coriander naan was also spectacular with the three dips. Enjoyed keeping the extra sauce for other dishes that hit the table!\n\nRestaurant has great ambience also. It’s very dark, but with candle lit tables and decorative table settings.\n\nThe sweet potato ice cream was a perfect dessert! The graham cracker crumble and marshmallow fluff really piece it together into a perfect bite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MWVyZjVRRRAB",
            "text": "I can’t praise Nura enough. I had reserved a large birthday dinner, but on the day of the event, half of us tested positive for COVID after a group trip. The restaurant, especially Rachel from the front of house, was incredibly understanding and gracious, helping us reschedule. When the night finally arrived, it couldn’t have been more special. The space is stunning, with high ceilings and a warm, modern design that set the perfect mood for our celebration. The table was flawlessly set, and the timing was impeccable. As for the food—it was absolutely delicious. Nearly everyone at the table commented on how fantastic their meal was. The bread basket with dipping sauces, roasted chicken, lamb meatballs, and snapper were all outstanding. I’m pretty sure everyone in my group left as a new fan of Nura."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucF9YcWdnRRAB",
            "text": "Great spot for brunch they have a lot of seating so I would assume even if it's busy you won't wait long. The design of the interior feels bohemian yet warm even with it's high ceilings. But most importantly the food was good! Almost everything on the menu looked wonderful and it has something for everyone. Go check it out!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbDlQNnRBRRAB",
            "text": "Loved every single thing about Nura. I wished I could photograph the smell. Intoxicating! The decor and serve exemplary. The food- even better!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkakpiM1hBEAE",
            "text": "Nura was an amazing spot to have date night and our server, AC, was absolutely amazing.\n\nAlthough the portions were a little underwhelming— the food was really great and plated to perfection. The dishes were simply crafted yet satisfying and delicious.\n\nThe open kitchen concept was beautiful, as well as the bathrooms and all the decor.\n\nWe did have to wait 45 minutes after our reservation to be able to sit at a decent table, but nonetheless AC definitely made up for our wait time.\n\nThank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaXQtODZRRRAB",
            "text": "Nura has a wonderful vibe inside, great for a nice dinner. The drinks were tasty and unique. overall I enjoyed the experience however there was nothing standout about the food. The dips and bread were a standout for sure, but nothing groundbreaking. Lamb kofta was the standout dish of the evening. I’d recommend checking it out for a good dinner but if you’re looking for more unique flavors/ dishes you may want to look elsewhere"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcmRfLXJRRRAB",
            "text": "The restaurant has a very exotic and modern atmosphere. Food is seasoned with all sorts of herbs and spices and not for those who prefer more “safe” foods. We went there during brunch time, so it was a twist on typical brunch items, lots of eggs. I actually really wanted to try the dinner menu but didn’t realize it wasn’t an all day menu. The service was really nice, our server was cool, nice to our toddler, and said the funniest things even though he wasn’t trying. Overall was a good time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSb2NlNmlRRRAB",
            "text": "Have been lucky enough to dine both at Brunch and Dinner service - both are different and incredible (you must go for the different menu items)! My friends and I are self proclaimed foodies and are constantly trying new restaurants in the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOem9iLUh3EAE",
            "text": "I’d been wishing to come here for over a year and finally made it - Nura exceeded my expectations and I truly enjoyed my experience. It’s a great spot for sharing plates, a first date, or just a casual meal. They have a gorgeous central bar, side lounge areas where folks gathered for drinks while they waited for a table, and cute tables tucked between foliage and lights. The lamb kofta melt in your mouth and the candied coriander in the fluke crudo was especially memorable. Lastly, the honey tamarind ribs were a top notch way to round out our meal. Also kudos on the creme brûlée being perfectly balanced with orange blossom essence and not overpowering at all. Will definitely be back again soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIX0lQQlN3EAE",
            "text": "Stunningly great restaurant in all respects, especially food with the sweet potato and red snapper dishes being delicious, creative and original. The lamb kofta and the lamb main dish were also 10/10 and the naan bread is definitely worth it!  Exceptionally nice service and beautiful restaurant. Do not miss this one."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMFpfRlNBEAE",
            "text": "Incredible food, great service, and a very fun atmosphere. Big fan of the twist on Indian cuisine, with familiar flavors, but still new. The green rice blew me away and the scallops were cooked perfectly. Definitely recommend checking this place out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNWVLWUtBEAE",
            "text": "fantastic meal through and through! the lamb sausage was INCREDIBLE. it came by itself first which we thought was funny, but it really did not disappoint. we went for brunch, and we definitely want to return for dinner. the golden bun was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbjdIVDZRRRAB",
            "text": "Nura is a delight. The food is fresh and flavorful. There was cilantro in everything which made this Texas girl very happy. If you’re into savory drinks, try the chefs kiss, you will not be disappointed. Love the open atmosphere and all the plants. Breathe easy while eating clean 🙌🏼💚"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNGFPNlZREAE",
            "text": "Every time I have had the opportunity to eat in Nura, it has never disappointed. There are a variety of dishes for sharing and the entrees are equally well portioned so that there is enough to share. While there are no bad options on the menu, the grilled prawns are a must."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5LW8tX0V3EAE",
            "text": "Le lieu est beau et très bien décoré. Nous y étions pour le brunch du samedi matin. Je recommande l’american breakfast qui est bien servi pour le prix. La viande et les pommes de terres sont bien assaisonnées. Le panier de pain est un peu cher pour ce qu’il y a dedans, enfin surtout pour un français :)"
        },
        {
            "date": "1년 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbWUzRU5BEAE",
            "text": "ニューヨークに来たら必ずおすすめしたい店！\n私のマストでベストなレストラン🍽️\n店内も広々とした空間で観葉植物やインテリアも素敵！まじ映え。そしてどの店員さんも笑顔で最高のホスピタリティ。気持ちよく食事を楽しめる。品数が豊富なのでシェアできる4人以上で来るのがおすすめ！\nどれも美味しいんだけど目で見ても楽しいし、日本にはないニューアメリカンスタイルな斬新で新鮮な感覚を味わえるので是非大切な日に！\nナンと3種類のソースがあるんだけど笑えるぐらいうまい。本当美味しい予約必須店です。\n女子旅の方に本当おすすめ！写真撮りたくなる店だから少しお洒落していって欲しいな♡"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ejRqOUtnEAE",
            "text": "Super gorgeous spot with good food. The bread basket is delicious, just wish there was more bread for the price, but I guess it’s cause of the dips which were great as well. The sauce on the prawns is very good. Actually kept it to put on the rice dish haha. Ribs are very tender as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOUpmYjB3RRAB",
            "text": "Incredible dinner!! Amazing food and really cool ambiance. Perfect date night spot. The food was so unique, innovative and delicious. Really unique flavors that I’ve never tasted before. The prawns were amazing, the pork and grits is a MUST, and ribs were incredible and the breads and dips were unreal. HIGHly recommend this spot. Best dinner I’ve had in a while!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwd092dWRBEAE",
            "text": "Concise menu. Get the bread and dip basket. Share a protein and a salad. The green rice is excellent but hard to mix in as a side with the breads (so many carbs). Loved the salad but the menu said “grilled lettuces” and it was one lettuce type and not grilled.  The dressing was🎯. The space … swoon! Such a gorgeous room. So cleverly divided by the central bar with seating for for dining. The lounge is hip and seamlessly connected to the room even though you’re tucked out of the way from the servers who cover the huge space as a very cohesive team. Fantastic, inventive cocktails, terrific wine and beer list too. Friendly service - casual, upscale vibe. Nary a fussy element in sight."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4b3Z5dVdBEAE",
            "text": "5 stars for the beautiful space, food, and spot-on recommendations from our server Curtis. The breads and dips, grilled prawns with passionfruit butter, and clams in carrot broth were so so good.\n\n-1 because unfortunately it’s not kid friendly at all. Everything on the table is extremely breakable, there are no high chairs, and there is no effort to accommodate children."
        }
    ],
    "reviews_count": 80
}