{
    "name": "Ashbox",
    "place_id": "ChIJRdQCQTxZwokRhnuh3R7NGts",
    "grid": "BK1",
    "address": "1154 Manhattan Ave, Brooklyn, NY 11222, USA",
    "rating": 4.7,
    "user_ratings_total": 196,
    "phone_number": "(718) 389-3222",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbVRrOUxSR3RWZG10clpsVTJSVlJXTjNaeFpuYxAB",
            "text": "Very sweet chef. Delicious food. Homestyle, affordable, and heartwarming."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdVJsWk1kM2RpWlRrMFFsSXljRXRtU25kMlJHYxAB",
            "text": "A neighborhood gem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4blRHOUNkM2R5YTB0WlJIWmlRV3RrUlU5alJHYxAB",
            "text": "Fresh, fast and amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVFp6WnJRazV0UlhKUGJGVXdibUZaVGxob1ZtYxAB",
            "text": "Got to support a local. Amazing woman. Working on her own."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNFpsWllaVXN6YTI5RVV6ZEJhbEV5V0doeFJWRRAB",
            "text": "So amazing love the onigiri"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeU4wMDNhMWRJWldKU05FdElXSGxmWDJwa2JsRRAB",
            "text": "Love this place, quintessential Greenpoint staple and one of the last remaining amazing locally owned shops. Highly recommend coming for the great food, cozy ambience, and to support an amazing owner."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcGVrUkNTRlUwUkdKWVlXTjNTazV2YkdSQlRWRRAB",
            "text": "A no nonsense place for Japanese food. Made fresh, incredibly well priced and delicious. They open in the morning and close when they sell out. Be sure to check it out. Small portions but worth it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaTZhN2ZREAE",
            "text": "Delicious and quiet lunch spot."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaDd1bHZBRRAB",
            "text": "Please update your hours on Google! I came here and you were closed. But I love you"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbHZ2RDdBRRAB",
            "text": "Came here for lunch, and loved it. It’s been a while since I’ve had a comforting and tasty lunch like this. Ordered the tuna poke, soupy rice with salmon, iced lemonade green tea, and an egg sandwich. All simple, clean, and flavorful.\n\nYou wait in line and she will make the food by each order. The food comes out fairly quickly.\nI read a sign in there that said the cafe will close early if they’ve sold out. We came earlier in the day but something to consider if you’re going closer to closing time."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOG9mT0F3EAE",
            "text": "Was there for the first time today and ordered a takeout as I wanted to share the lunch with my spouse who caught cold and stayed at home. I got us a salmon onigiri, a tuna mayo onigiri, a miso soup and a spicy mushroom soup.\nI loved the neighborly atmosphere. This place is all about comforting homemade food and feels like gentrification never happened here. The bathroom is not available, you’re not allowed to speak on the phone, and it is is open until the daily supply is sold out (which can be anytime). Not something you see very often, but totally understandable especially if Yoko (the owner) runs the place on her own.\nAs for the food - it was simple, fresh and tasted very good. I was like: well, the chef knows everything about the balance of textures and tastes. Definitely coming back for daily specials and hoping to become a regular!\nBTW @ashboxcafe on Instagram has all the updates."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2czh5eU5BEAE",
            "text": "Authentic and from the heart ❤️ the NY way"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MnV6OUxnEAE",
            "text": "I was on the phone speaking softly and almost whispering (I'm mindful of not speaking loudly in there) and I was told very rudely by the owner to step outside when speaking on the phone. First of all, it's a coffee shop and not a library. There isn't a policy on not speaking on the phone in coffee shops. I would also have appreciated that she would have said something more politely instead of being rude about it."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzLVpHSEJREAE",
            "text": "I really love the food here (ive been twice) but almost every time i go they are closed and the hours dont match whats on google. It closes at 2pm on saturdays btw, not 4.\n\nEdit: I went on a Monday and closed at 3. (I got there at 2:55🤦‍♀️)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaXFTanFnRRAB",
            "text": "Had my startup business office right next to it. Used to go there every week until we moved to another place. Came back to green point after 10 years and see them still open. 5 stars for them, me and the memories."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcnJibHZRRRAB",
            "text": "Ridiculously good. Fair price. Unique 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuXzRqTmhnRRAB",
            "text": "I love ashbox cafe"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuc3FhWi1BRRAB",
            "text": "love ashbox!! definitely a hidden gem in north GP but very worth it. the owner is so sweet and we love supporting her and her restaurant weekly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbWJtSl93RRAB",
            "text": "The food is so good. This is a great option for a healthy, fresh lunch in Greenpoint."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyN3ZHazVRRRAB",
            "text": "Went in to grab some quick lunch takeaway, ordered two seaweed raps, the food was super tasty!\n\nShe also got them made fairly immediately so if you're looking to stop by quickly to pick up something for lunch I would highly recommend.\n\nPrices are also very fair."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bXR2Z0l3EAE",
            "text": "I can always count on my lunch here to be fresh and made with love.\n\nI've been here countless times, gotten the same things over and over (poke, onigiri and tofu) and am always baffled at how delicious it is.\n\nVery grateful to have this place as a lunch option. Just be patient as the owner is the only one running the place and it can take some time to get your order in during a rush. Worth the wait nevertheless..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6aHN5UWN3EAE",
            "text": "Made to order so it might be slow to get your food but the food is delicious. Think healthy japanese meals and snacks. Delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqemRuMzZBRRAB",
            "text": "Great spot for lunch or brunch and the onigiri salmon rice balls is on point"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5NzkzamN3EAE",
            "text": "Always has fresh and healthy foods. Menu changes daily. I recommend following/ looking at the owner’s instagram @ashboxcafe for menu.\n\nThe owner does not always check ashbox’s Yelp/ Google so the information presented isn’t always accurate.\n\nAshbox is currently open 10 am till sell out. Closed on Sundays."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMmNTek9BEAE",
            "text": "This place is wonderful, it’s all too to but get the turkey and a coffee!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxNDZlcUJREAE",
            "text": "Great food, feels very homey. Wish the hours were more accurate though it’s always a 50/50 chance it’s open when I stop by."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOVlfenJnRRAB",
            "text": "A proximité de l’hôtel, nous avons choisi Ashbox !\n\nLa décoration est toute mignonne comme tout, convivial, calme, j’aime beaucoup les plantes et les objets sur les étagères,\n\nJ’ai pris du tofu avec du gingembre et un onigiri avec du saumon et une limonade chaud avec du miel, c’était très bon, léger et sain. Il est possible de manger sur place et de prendre à emporter,\n\nL’accueil est très chaleureux, Madame est très gentille. En repartant, nous avons oublié un bonnet et un tour de cou, elle a couru derrière nous pour nous les donner.\n\nSi vous souhaitez manger japonais, je vous conseille Ashbox !"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWMThDZlZnEAE",
            "text": "Restaurant japonais très accessible avec un petit côté discret, calme et apaisant. La responsable est adorable et ses plats sont délicieux. Ses prix sont raisonnables.\nÇa vaut le coup d’œil !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWdDl6OXdBRRAB",
            "text": "Not even open"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWLWZISS1RRRAB",
            "text": "One of the reasons why my neighborhood is better than yours."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4Z19mTHRBRRAB",
            "text": "My favorite lunch spot in all of Greenpoint. Homemade Japanese food with quality ingredients. Not to be missed!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvM3NUMXJBRRAB",
            "text": "Ashbox is my favorite place in Greenpoint. Been living here for a long time. It is my go to for a perfect, healthy, yummy lunch. Everything is made with love. And I'm always so happy after my meal... knowing I have just filled my body and soul with good, nutritious food. I've yet to try something here I haven't completely loved. Prices are very reasonable.  It's perfect."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabGFQb3BnRRAB",
            "text": "One of my most favorite little Japanese spots in Brooklyn! The owner is so amazing and sweet plus all the foods are incredible!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNTR6S19nRRAB",
            "text": "Kind place with great food"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSLUlyZDhRRRAB",
            "text": "Ashbox is a truly wonderful and unique dining experience in New York City.  The cuisine is Japanese in inspiration, but with thoughtful, playful and delicious accents from a broad range of other cuisines. The food is exquisitely and personally prepared for each diner.    Its open hours are clearly and prominently posted.\n\nPlease do NOT post a one star review if you have not actually eaten here and cannot read her prominent signage with her open hours."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdU0zWGdBRRAB",
            "text": "Really not understanding these reviews seeing as I've lived across the street for two years and the place never seems open for business. The rare times I do see people inside are what appears to be during food photography sessions"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKd1BxVVR3EAE",
            "text": "Delicious Japanese home cooking. Everything we ordered was fresh, flavorful, and light! Will be coming back regularly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMXVyc0tBEAE",
            "text": "Japanese home cooking, focused on takeout with a very small eating area. The store-owner does everything by herself, so it’s not a fast operation but she does make everything on hand as you order it.\n\nThe store has been blocked off mostly except for a few tables in the front - no bathrooms or wifi, mostly a quick stop for people to get their lunch. Prices are very reasonable, recommend getting 2-3 things since they’re on the smaller size."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbnFmbDBnRRAB",
            "text": "Super cute small shop offering a variety of Japanese dishes. Only serving take out at the moment but there are two chairs outside.\n\nI got the tuna poke cup and ochazuke (tea rice). Both cups are customizable in terms of toppings. Really like the purple grain rice that came w both snacks.\n\nFood was ready in 3 min when there’s no one in front waiting!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcE9tNy1BRRAB",
            "text": "I started working around the corner and this is my go to spot for lunch. Her food is the closest thing to a homecooked meal; always delicious and flavorful. Be sure to follow her Instagram page to find the daily specials - my favorite!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtZzY2Yk93EAE",
            "text": "I've been feeling icky from too much takeout but also too tired to cook so this was perfect! Everything felt light and flavorful. I recommend getting 2-3 items bc the portions are small (the prices do reflect it)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdGJuZkhnEAE",
            "text": "A neighborhood staple!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtZ2QzemFREAE",
            "text": "Authentic Japanese home cooking! So good, fresh and beautiful."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlLS1ITU1nEAE",
            "text": "Magical Japanese food. That’s it 🪄"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMWVTOFlREAE",
            "text": "Clean and delicious food! Prices are great and while the portions are a bit small, the flavor makes up for it.\nI was told that they will no longer be doing dine in but there are a couple benches and chairs outside that you can sit on if the weather is forgiving!\n\nOrdered: Yuzu vinegar drink, salmon sandwich and tuna poke"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bmZHWDJ3RRAB",
            "text": "Quirky little Japanese restaurant, lots of snacks and meals. Take out service only"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1LXI2d3JRRRAB",
            "text": "Had the worst diarrhea of my life after the spicy tuna bowl. 0 star."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbThDNC13RRAB",
            "text": "Very fresh very healthy food, a tad expensive but well worth it as a nice quick lunch to get you through the rest of you work day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaGJlNnpnRRAB",
            "text": "excellent neighborhood cafe. japanese fluffy bread, onigiri, good lunch specials and just good juju."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMydWVlMzZ3RRAB",
            "text": "Very very special place!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLclBqVzZRRRAB",
            "text": "Grabbed a soupy rice (like porridge or congee), topped with pickled radish and mustard greens! The savory umami flavor was incredible and the mixed grain rice was cooked to perfection. I will absolutely be back. A great lunch or pick me up…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpZ2R2THR3RRAB",
            "text": "This spot should have five stars. Amazingly fresh & delicious food every time. The owner is doing all the work herself throughout this covid era & is incredibly sweet every time I stop by for lunch. You can tell she puts her heart into her food.\n\nIf you follow Ash Box on Instagram you can see what special menu items she’s working on, & she finds a happy medium between comfort food & healthy options. It’s also sold at affordable prices for a good portion (e.g. $6.50 for a spicy tuna poke), & way more filling than expected for the 12 oz cup.\n\nOf her regular menu options, I love her egg salad sandwich, the hibiscus tea + lemonade, & the spicy tuna poke bowl. The pictures I took are from a to go order, but don’t let it fool you. It’s so good!\n\n(Spicy Tuna Poke, Shrimp Curry, Hibiscus Tea + Lemonade, & a Seaweed Shot!)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdmVLQVZREAE",
            "text": "Got the spicy tuna and salmon sandwich. Both were very good. Highly recommend."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3a3ZUaUxBEAE",
            "text": "So very fabulous! An absolute must to stop and eat! I am going back just to eat there! Food is made to order and fabulous!  Atmosphere friendly and quaint"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4djlfa1dBEAE",
            "text": "My new favorite lunch spot. Simple menu (I've only gone since C-19), but very delicious, nicely prepared, and fresh. My favorite is the tuna poke bowl. The soft tofu with ginger is delicious too. Expect a little wait as the owner prepares…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2X0ppY2NnEAE",
            "text": "Delicious, healthy and authentic Japanese cafe run by a lovely chef. Really high quality food. Their constantly changing specials ensure that you always have the option to try something new. A true neighbourhood gem."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXd3RMbW5nRRAB",
            "text": "If you’re in Greenpoint you have to go to Ashbox if you like Japanese food. It’s home style cooking and you must get the sushi rolls. I also love the rice soup with plum but there are lots of options of combinations such as tuna or salmon…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbjlqMjRRRRAB",
            "text": "I cannot say enough good things about this place. The food here is perfect. Every item is thoughtful and prepared with love. I believe that the food is so good because of the love and care put into the menu. Yes, you may have to wait a few…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRaWVfZG53RRAB",
            "text": "This place is great for lunch. The portions are small but the prices are right. They have lots of special options not on the main menu (healer drink and the avocado wraps are a personal favorite). Took, the owner, is a breath of fresh air on the daily.\n\nGood iced coffee too! You need to check out Ashbox!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3d2VmNnFnRRAB",
            "text": "I love this place. Just simple delicious Japanese home cooking meals. Always enjoy their onigiri rice balls. Current, my favorite thing here is their homemade apple cider."
        },
        {
            "date": "13년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnb3FlZnlRRRAB",
            "text": "Amazingly tasty food - not possibly to accurately describe but I'll try anyway. I had the salmon avocado wrap and my wife had the kelp avocado wrap - we immediately ordered the same again due to their intense tastiness. Coffee was great and tea was real Japanese matcha. Go now if you're a local, move house if you're not."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdGVlVzdBRRAB",
            "text": "Lovely quiet space. Yummy food.\nThe onigiri are large and tasty. You can order different fillings.\nThe sandwiches are simple but the combination of flavors are very good."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzalpfVUFREAE",
            "text": "The egg salad sandwich and rice balls are to die for. This spot is an absolute gem. Peaceful and off the beaten path, it serves as a local and intimate home for people who are seeking a quietly refined Japanese-American style lunch."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMGJtX2pnRRAB",
            "text": "Amazing mom and pop style Japanese cafe. Large tea selection and delicious coffee. Large menu full of sandwiches salads and small Rice balls and rolls. I tried the avocado and kemp roll; simple and very tasty"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdmVuRE1BEAE",
            "text": "an adorable, quaint brunch spot for a refreshing cup of iced lemonade earl gray and a japanese happy rice bowl made of avocado, spring mix, nori, and a drizzle of yuzu over rice. a lovely treat for a health conscious, yet delicious meal."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXaWUyVEtREAE",
            "text": "Delicious breakfast options!  The 3 onigiri (miso, tuna, and salmon) were made fresh.  The ochazuke both tasted and smelled great.  Definitely will return."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvLU5qc0xBEAE",
            "text": "Charming place with simple yet delicious food options for quick morning grabs. Will be back many times :-)"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRODl2NmxBRRAB",
            "text": "Don't get me wrong, I LOVE the food here. The best Japanese American healthy on the go quick stop I can think of. The ladies who run this place have no concept of customer service good business or courtesy however when it comes to nickle and diming you for every little think extra. Don't bother asking for a little of anything on the side even just spicy mayo or say like scallion (which would be and is free at every other Japanese restaurant I've ever been to) as they'll want 50¢. Horrible experience when it came to asking for a little extra kimchi (which I was willing to pay for of course) but They insisted they could only do another whole order. This is not McDonalds or Applebee's where everything is set by corporate from on high. They act like they have no control over pricing. So bad experience on that end is my complaint here"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcTZhMmVBEAE",
            "text": "Yoko is the best.  She weaves love and care into every dish and you can taste it.  It’s worth the wait.  What a gem!"
        }
    ],
    "reviews_count": 69
}