{
    "name": "Kub Kao",
    "place_id": "ChIJ46r72EpZwokR42h_EmRsntY",
    "grid": "BK1",
    "address": "988 Manhattan Ave, Brooklyn, NY 11222, USA",
    "rating": 4.9,
    "user_ratings_total": 40,
    "phone_number": "(917) 909-0347",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1b05HdE1SM0phUjFnMVREWnFRVFJyZWtnNWVGRRAB",
            "text": "I’ve only been here twice so far, and both times even with it being carry out, I said that it’s one of the best meals I’ve ever had in my life. The spicy basil fried rice is out of this world. Fresh ingredients, out of this world flavor, immaculate chefs with accommodating and kind employees. My favorite Thai restaurant I’ve ordered from, and nothing short of one of my favorite restaurants in NYC. I look forward to eating at the restaurant someday."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMmJ6ZG5kVm90VFdSSE1sbGhZbEJhYTNsTWExRRAB",
            "text": "Fantastic food, very flavorful and balanced. Portiond are generous and service is phenomenal. Will definitely return and encourage everyone to try it 😊"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paYU56ZHFaelZpZWpWblN6QldaVTFaYmxGSFEyYxAB",
            "text": "Favorite Thai in NYC!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U2VtWnJZMWhRTkRCMlpIRlJhbUZqVnpSYVZWRRAB",
            "text": "Very very tasty and the manager is so nice. We enjoyed the salad for something different and refreshing"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZelNUZG9VRzg1YmpoRWIxbHdhRkkzUW1oWllVRRAB",
            "text": "Food was phenomenal and the restaurant was so kind and accommodating about our allergies and substitutions. 10/10 would recommend and come back! 😍"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bVYyTlFTa1Y2YWtaMGQxbDZXbVJHU3pBMlNVRRAB",
            "text": "The food here is fresh, delicious, and well seasoned. Much more traditional Thai with a variety of options I’ve never had before. Super friendly owners, and there’s always a table…. For now :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjelNYUTRUa0oxWVU1UVlWaFNXWFF4U25kWGVrRRAB",
            "text": "I can’t say enough good things about this place! The curry puffs were absolutely amazing, perfectly flaky on the outside with a warm, flavorful filling that was both comforting and packed with spice in all the right ways. You can really taste the care and freshness in every bite.\n\nThe service was impressive. The staff went above and beyond, genuinely friendly, attentive, and quick without ever making you feel rushed. It’s rare to find a spot that gets both the food and the hospitality so right.\n\nHighly recommend, I’ll definitely be back for more!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeVQzUlpZM1JDZFY4MmFUZzJUVEF6ZFU5M1FrRRAB",
            "text": "Absolutely phenomenal dishes. Greenpoint has had more than a few spots pop up as of late which are lacking any kind of palpable soul in exchange for focusing on what attract influencers. Kub Kao hits the mark in every way that counts. I can taste the love with every dish. The staff is warm and attentive. I will be back many times over to experience this absolute delight again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dU0zWjJZM2N0TldaVWJFOXpTVlJxYzBWalIzYxAB",
            "text": "Delicious Thai food and recently opened. The staff is super friendly and open to feedback as they are in soft opening. They give good recommendations if you're not sure what to order. They have some of the typical Thai-American takeout dishes but also have some dishes I haven't had at other Thai restaurants that are great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNFRVOXBSUzB0YmsxcVREQnliMmx4TWtsUVRtYxAB",
            "text": "The Pad Kee Mao was so delicious I ordered two more to go for my family! 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVM2NrbHpXVmgyV0hWNk9XcHFTSEZQTVdkMGFVRRAB",
            "text": "Generous portion. Family style Thai food. Gem 💎 in the Greenpoint neighborhood 😍. Duck curry was my fav. Will visit again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MGJVWXdVRWhNUjFWMmMwODNhMWxxYVU5ck5YYxAB",
            "text": "Having lived in Greenpoint for nearly 20 years, this is definitely my favorite new addition to the neighborhood food scene. I've had thai food all over the world and this beat everything. We had the Pad Prik King, the Pad See Yew, the Tom Kha fried rice, the steak salad and some fantastic appetizers and everything topped the next. The service was so warm and easy, and the ambience was super relaxing and comfortable. I will be back regularly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSlEzWk9VRkJ2V1U5V2JYSkdVMnQ0WDAwME5rRRAB",
            "text": "Amazing spot! Wish I took photos to share. Some of the best thai food I've had in Greenpoint. I had the seafood pad kee mao (drunken noodles). My husband had green curry with chicken. We shared the chives pancakes and curry puffs with some of our friends. Everything was excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oa1IzTnVXazVqV0dJdE5tRlNaVTQ0YzJoTVJIYxAB",
            "text": "Lovely staff, great food. Most expensive, but also the best thai in greenpoint."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twd1JuVnpTM2RzYzJsUVoyVnlTV1JYUlVwNWRuYxAB",
            "text": "Kub Khao is so good! We tried a mix of dishes and loved everything, especially the gyoza, fried wontons, and chicken pop. Portions were perfect for sharing, the space felt really welcoming, and the service was excellent. Can’t wait to come back 🤍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVk5GQnNUSGx0YTFCMFVUQk9PVko1WVdWYU4yYxAB",
            "text": "great food and owner is super kind"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeVZIaEVWMHRoVjJKT05HcDRUWGxPVGtsbFVXYxAB",
            "text": "Really excellent Thai food. Might tie with Amarin Cafe for best in Greenpoint."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GU05tSjZNVUozZG5WWmVITlFNWEJFYWxCQ1ZsRRAB",
            "text": "GOOD FOOD. I will come back many times."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKS1MxWlNaVE52WmxRMFZqQlVkSFJEVkhVM1pYYxAB",
            "text": "What a hidden gem! We went when they had a soft kitchen opening and got the pad see ew and green curry. Both were so flavorful and much better cooked than your typical Thai take out joint. The food tasted special here. Go give it a try."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWWJYSjRaek4wT1V0cGNtRjVNVU5FV1U1ZmRYYxAB",
            "text": "Came here a few times. Every dish is delicious and takes you on a trip back to Thailand. The staff here are super friendly and will make sure you have a special dinner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMU9EaHFYMGgwUkhWUk1uUmZRelpWWmxGVFQxRRAB",
            "text": "Contender for best Thai in greenpoint…?\nV generous meat portions in the entree dishes. Get that protein into ya"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b1lsTTJWMDlaYWtSYWNVVmxURUpSYmxJMVlsRRAB",
            "text": "Ate their green curry and it was amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMk5XNTZkRTVDVkZOdlFqUmxTWGxSVUROUVkwRRAB",
            "text": "BEST thai spot in greenpoint!!!! If you like chicken satay the Thai Rama is a must try, the most delicious savory kinda sweet peanut sauce with tender chicken over rice. Their Pad See Ew is also unique, you can tell they don’t just use soy sauce so it has more depth of flavor. Thai dumplings are also a must get (fried), but everything we tried was good (duck pad thai, wontons fried, thai tea, spring rolls)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUFVGcFpUVzk2Ym5KMFFVdFFaa3RHTm5sUlZFRRAB",
            "text": "Chicken Pad see ew (spicy 2) was delish! New favorite Thai in Greenpoint"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SlprTlJielF4TkZneU4wdEVSR2xDVEdwbWRuYxAB",
            "text": "This was one of the best Thai restaurants I've been to in the last few years! Everything on the menu looked amazing so my friends and I ordered several appetizers and main dishes and we loved it all! My favorite was the Ba Mee Pu Moo (egg noodles w/ crabmeat, pork rinds, & sauce) - so perfectly balanced in flavors and textures! Service was also fast and friendly and the decor/lighting gave really chic yet cozy vibes~ Absolutely recommend giving this place a try!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4aWRYTnNOVTV0VW5GMU9WQjBhVTVIUm1NdGNYYxAB",
            "text": "This authentic Thai is a gem to Greenpoint neighborhood. I went there for dinner with my friends and every dish was so delicious. Menu had a great selection of appetizers. Crunchy enoki mushroom, the zesty papaya salad was so refreshing, and I absolutely loved the chive pancakes and curry puffs: crispy and flaky yet soft and jammed packed with flavor! My go to is the Massaman curry, and the beef fell off the bone! The flavor profile of curry came out so perfectly that though I was almost full on apps I wanted to inhale the entire bowl. My friend, seafood lover, got this amazing dish of shrimp.\n\nAmbience is calming and mix of sleek and subtle decor and cozy lights. Service is warm - they treat you like family!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSYU0wRm5PVmh1ZFRkV2IxcGtRVEJsUWpaUGNsRRAB",
            "text": "Great date night space. The Thai food is very good, I ordered the Noodle soup and it was very flavorful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbFoyazBZVzF3UldGd1MwVnRaRkpmZHpWYVNIYxAB",
            "text": "Mid. $20 for a very under-sauced and under-flavored pad thai, unfortunately. Apps were OK but overall overpriced and nothing stand out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeVZHWkVObXhqYzFwS1pVdGpSRTExYzE5a2NuYxAB",
            "text": "Fantastic food! Great flavors and lovely staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neE4yOTZVbmRvZDBrNE9VbzBabFpmVkVkQ2RXYxAB",
            "text": "Delicious thai food! I asked them about a dish I really liked that wasn’t on the menu, and they made it for me. Extremely flavorful, very kind service, coop vibe. Highly recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUFZVNW9SblZWY1RObFZ6WlNZVjlTTkZkMVEyYxAB",
            "text": "Love this new spot! The food was so fresh and the spice levels were perfect. Will definitely be making this a regular in my lineup."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUVVFZzJhMVZaWlZZemN6aEVZVzVITUZwRGVHYxAB",
            "text": "Delicious khao soi and really nice staff!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOYWNIb3lRMVZUU25sVWMzSk1jaTEwYm1aNE9IYxAB",
            "text": "“Every dish was full of flavor, made with fresh ingredients. The staff were friendly and attentive, and the cozy atmosphere made the meal even more enjoyable.”"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWc1ptc3ROaTFIVUdSbFRESXdNMlZhUlZSaFIwRRAB",
            "text": "The stir-fried holy basil with minced meat and a fried egg tastes just like having it in Thailand. Another dish I love is fried rice with Chinese sausage — it looks simple, but the sausage is so delicious when cooked in fried rice. Next time, I’ll go back to try more dishes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toS1pWTXlUa2Q2VFZaUVZFWmZOMWxPYnpCclQxRRAB",
            "text": "Kub kao is our new favorite place. Great atmosphere, speedy service. The food was fresh, and delicious, I can tell it was made with care. We had the fried spring rolls appetizer Chicken Basil and a thai fried rice with shrimp to share. The chicken delicious with the spicy sauce, the rolls were crunchy and also delicious with the plum sauce. The rice had fresh ingredients and Jumbo shrimp . My husband got a Thai tea and couldn’t stop raving saying it was so delicious. We will for surely be coming back. Keep up the great work!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdWIyWndaelU0TVVaU2ExRlpaUzAzVUc5b1ZHYxAB",
            "text": "KUBKAO offers delicious food and a warm atmosphere. The lemongrass spare ribs are tender and flavorful, and the Khao Soi is rich and aromatic."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMmJGQlZjR1ZxTUhSS2RtSlhkRzlTWTNsM2VFRRAB",
            "text": "If you’re looking for authentic Thai comfort food with a modern touch, Kab Kao is a must-try.\n💚 Delicious food, great vibes, and heartfelt service — what more could you ask for?"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsa1YwZEVWR3BHVDNBNGFsWjZjM1ZMTUd4RFpFRRAB",
            "text": "The food is really good and the staff is super friendly"
        }
    ],
    "reviews_count": 38
}