{
    "name": "The Noble Wine Bar + Restaurant",
    "place_id": "ChIJHRyf_LxZwokRyRAn0OrJP0w",
    "grid": "BK1",
    "address": "148 Noble St, Brooklyn, NY 11222, USA",
    "rating": 4.8,
    "user_ratings_total": 118,
    "phone_number": null,
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMkxUbFdRWEJCUjBkWmFrdEtkMmN6U0hSSlgzYxAB",
            "text": "One of my favorites in the neighborhood. Delicious small plates, exceptional service, and a really interesting wine selection. Thanks to the manager Niccolo for his warm and friendly help as my fiancé and I prepare to host an event here!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacFV6aFNiekZRVkVSdVJWZFZRakpWTUZKaVRXYxAB",
            "text": "Noble has a charming and welcoming ambiance that's perfect for a relaxing meal with friends. The food was fantastic, and the cozy decor really enhanced our experience. We especially enjoyed the live music, which created a fantastic atmosphere throughout the evening. It's definitely a place worth visiting for a great night out!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeExVUktOSHByTkRNNFZGWmhPRk0xTnkxb2NHYxAB",
            "text": "Really wanted to love this cute spot we walked by. In fact the waitstaff and food were wonderful until a gentleman (presumably the owner or manager) came to deliver a dish and inquired about our party size. He mentioned that he might need us to consolidate to a smaller table if he needed the other half, which is completely reasonable. We joked that we were three people (the pup is with us) and his response was  a snarky \"I'm in the business of selling tables!\"\n\nFrom that moment. The energy and vibe of what was a wonderful late summer afternoon on a patio- was ruined. The food is great, the snark - unnecessary and quite unwelcoming."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cmVEZFRRamRNVG1kc1QzSTRlbTlEVURGR1VsRRAB",
            "text": "The food here turned out even better than I imagined, interesting, unique, and full of flavor. It struck me as fine dining quality, but without the stuffy environment you sometimes have to navigate for similar caliber meals. The vibe was welcoming and relaxed, and to top it off, the owner personally came by to say hello, which made the experience feel even more genuine. In a city of fast food (burgers and fried chicken) at high end restaurants The Noble is more based in traditional fine dinning in my experience. Fair warning, the portions are a bit on the small size, but what it lacks in size it makes up with flavor and skill."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsd2JYbFJUM1ZCVGpacmEweENXbXBVZUZGS1dIYxAB",
            "text": "Amazing food, wonderful atmosphere, and excellent service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTVdGRmhjRFJDU2twSGQwaEJWMlZwYVc5SVRIYxAB",
            "text": "Good wine and delicious small plates!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSlJtZEhUa1ozVDFaRU1rdElWVEpxTTJKNlZHYxAB",
            "text": "Just let you know, dogs are welcomed!\nOverall best wine spot in Brooklyn!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUFZWWkpjR1kwUmtKM01FMXVWMU54U0U1SU9XYxAB",
            "text": "The highlight of the evening was definitely the oyster cart pop-up by The Wandering Shucker — fresh, flavorful, and a fun surprise.\nUnfortunately, the food at The Noble fell short of expectations. We ordered the sundried tomato tapenade, which turned out to be a single-serving portion (though we weren’t informed when we mentioned we’d be sharing). It was dry and lacked flavor. I had the braised lamb as my main, and while the lightly steamed watercress was a nice touch, the lamb itself was underseasoned and uninspired.\n\nThat said, the atmosphere was cozy and welcoming, and the service was excellent throughout. I’d consider coming back — next time, I’ll try the Arayes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRGVGZDFRMmR0UVhCVFVIaFdWRTVYU3pkWFZWRRAB",
            "text": "What a magical energy this place has. Perfect and quite outdoors sitting (rare to find in Greenpoint).\n\nFood was very good! Reminded me one of the best restaurants I’ve been to in Greece. The kitchen definitely has high standards. Service was so kind and very down to earth."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSV01VMWxWblZ3TVhwcVFYTmxjR3g0YldSSE9VRRAB",
            "text": "What an amazing little gem! 🧿\nIt's hard to find a good restaurant that offers a great and affordable wine menu. The food is fresh, well-prepared, and truly on point. The best part is the outdoor seating area. You can really feel that it's a family business, as everything is done with great care.\n\nThis has become our new favorite spot!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWM2NUVXhPWFJqT0d4b2JXNWZaRlZ6U2xKUlJrRRAB",
            "text": "The Noble is easily one of Greenpoint‘s best hidden gems. Tucked away on Noble Street in Greenpoint. It’s on a quiet corner in a more residential,  historical area. The building, the design, and the vibe are everything you want from your neighborhood bistro. The outdoor dining in the summer is everything. Umbrellas are up to provide some good shade. The wine is fantastic and you can’t beat the roasted corn and watermelon salad. The menu changes seasonally, Rick – the owner is always on the floor and is the perfect host. I always leave the Noble feeling very lucky to live in Greenpoint And grateful that there’s still people out there like Rick that like to make a small neighborhood community driven restaurant.  Look out for all of their weekend specials. The oyster pop-ups have been great, the live jazz is fantastic and I look forward to going in for a Spanish tapas night."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaEszWXF3RRAB",
            "text": "The food is awful - there must be fake reviews here to have 0 bad ones and such great photography. Yeah, it looks lovely inside, but my god those tiny, salty, fatty chicken nuggets on cardboard that they call a shish kebab are an insult. The rest is tepid supermarket food. An absolute joke.\n**Update -  not sure what the manager is talking about, I'm very much a person. Just look on Reddit r/Greenpoint - they have a lot more dissatisfied customers in the neighborhood, yet few reviews here. But glad to hear that they've taken the garbage chicken off the menu"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkblRrMHlORFpUWlUweFNFNWlTV0pWZURKYVMyYxAB",
            "text": "Amazing food, wine, and music. Rick is a great guy"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdFIyc3RRWEp1UkY5aFprdEJjV1Z1V0VzeU5sRRAB",
            "text": "Wow. What a great venue to drink wine and enjoy good company and great music. Ricky is the man."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQeVZnX1BUdTc2YnZ3RRAB",
            "text": "Probably one of my favorite bars in brooklyn, really good proper outdoor sittinf ( with so many trees!) pretty good food and cool interior"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbnNyWWpIMElLWkt3EAE",
            "text": "What a wonderful small plate dinner. Excellent wine list, especially for lovers of eastern Mediterranean varietals. First class service from our sever too!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZXRyUHE3eWMtREhnEAE",
            "text": "I recently visited The Noble with a group of friends, and we had an absolutely exceptional experience. From the moment we arrived, the staff made us feel incredibly welcomed. The service was attentive without being intrusive, and every member of the team went above and beyond to ensure our evening was smooth and enjoyable.\nWhat truly stood out was how accommodating they were to all our food preferences and dietary needs. Whether it was allergies, vegetarian options, or just personal tastes, the kitchen handled everything with care and precision and the food was delicious. Each dish was thoughtfully prepared and beautifully presented, and it was clear that quality and customer satisfaction are top priorities here.\nThe ambiance was warm and inviting, making it a perfect spot for both a fun night out with friends or a more intimate dinner. I can't recommend it highly enough. We left happy, full, and already planning our next visit!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPWEpwWjdtNl92cWN3EAE",
            "text": "If you find yourself in greenpoint make sure you stop by this quaint and charming restaurant. The food is incredible and the atmosphere and service are equally as great. the plates are small but sufficient with bold and contrasting flavours (perfect for sharing). We got the halloumi, octopus, arrayes and pea dip. Fantastic wine selection as well. will definitely be back here!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLMnRoN1NheU5QM3NBRRAB",
            "text": "If I could give ten stars, I would! My partner and I held our small wedding and reception here about a month ago and the whole experience was stellar. Throughout the entire planning process, Rick, the owner, was incredibly accommodating, responsive, and helpful. He made great recommendations on food and drink, and his advice was essential in planning the day we hoped for.\n\nThe event itself was perfect. The serving team was lovely and attentive, the ambiance was picture perfect, and the food was delicious. We ended up getting several passed canapes, and for the main meal, the salad, octopus, lamb, and cauliflower. People raved about the food! The wines were the cherry on top.\n\nWe can't wait to revisit The Noble time and again, and I highly recommend it to anyone considering it for an event or even just a meal."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZk0xWm5Qd05tZkhnEAE",
            "text": "This was a remarkably wonderful place to host our celebratory event. We will have the memory to treasure for years to come due to the amazing collaboration of Rick the owner, the professional and nice staff, the passed small bites and share plate main course--which guests loved, great wine selection, and inside and patio decor and atmosphere which created the perfect setting for our party of 30. The food was delicious and creative, a real treat! Thank you to The Noble!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLTEZzdl9FNkpxV3pnRRAB",
            "text": "I attended a wedding here and it was perfect! The food, the ambience, the outdoor space, it was all fabulous. Kudos to Rick and Niko and Stephanie and the whole staff. A very special occasion."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPWE85YUtpaU1TTkpnEAE",
            "text": "zucchini fritters and strawberry dessert were the stand out!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLR3V5TzYzbDZhRE53EAE",
            "text": "What a lovely little nook in the heart of Greenpoint! The wines were some of the best I have had and the food was solid! The staff were amazing and a special shoutout to Nico and Ricky for being so welcoming and conversational. Will definitely be back!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaG9yMFVREAE",
            "text": "Very good food but we were advised to get 4 dishes and definitely wasn’t enough. Sadly after an hour after first ordering we received the ‘larger’ dishes.. it was too late to order more. So, order more than 4 if you’re a late table!\n\nAlso try sitting outside as it was crazy loud inside.\n\nGiving it 5 stars though as it delicious, not a high price point and the staff were lovely. They also had good non-alcoholic options for drinks."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaWVyX0xREAE",
            "text": "INSANELY good !!! Finally got to try the Noble on a Friday night with friends and we thoroughly enjoyed all the dishes. I especially loved the halloumi and sea bass crudo (the honey & citrus added perfect balance of flavor). Ambiance was very intimate and service was excellent thanks to Claire. Merci :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaVpURm13RRAB",
            "text": "Loved the food. I strongly suggest the halloumi, sea bass crudo and the arayas."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcjQzbnNBRRAB",
            "text": "Great vibe in here, had a nice glass of orange wine while two jazz guitarists played live"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqem9PUFNnEAE",
            "text": "Excellent breakfast with an avocado toast and French coffee. Highly recommended."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcmE2TGh3RRAB",
            "text": "We decided to finally try the Noble and, unfortunately, it was a huge letdown. I am a vegetarian and ordered a dish that was described as tomato dip with bread and nowhere did it mention it had sausage/meat and the waitress did not ask us for dietary restrictions before taking our order. After trying the dish and realizing it tasted odd, my boyfriend (non vegetarian) had some too and confirmed it was meat. I called it out to the man working there who seemed like the owner/manager and he did not apologize or try to make it right in any way. He just basically said it has meat and walked away. We ordered two other dishes and they fell flat as well. We left hungry and unsatisfied with a $112 bill (the meat dish that was not taken off the bill)."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfamFtTzNBRRAB",
            "text": "Fantastic meal and fantastic service. Came as a walk in on a Saturday night. Waited 5 minutes and was seated at the bar.\n\nThe food was excellent and the service was top notch. Great vibe and if you’re in the neighborhood looking for dinner, this is a great place to walk to."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfejRfUTJ3RRAB",
            "text": "Such an incredible neighborhood spot - great wine and service. Can’t wait to continue coming back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd1BIeFJnEAE",
            "text": "Excellent all around. Tucked in on a resi street with great ambience, delicious menu and gracious service. So happy this has been added to my neighborhood!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmXzYtS25BRRAB",
            "text": "Love love love the Noble - relaxed and cozy vibes, and delicious food and fabulous wine!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQMXJ1anZ3RRAB",
            "text": "Charming, warm interior. Great service, waiter went beyond expected with wine tastings. Food was great, the Arayes was one of the best dishes I’ve had this season. Cost very reasonable. Will be going back soon."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOMmJTX1FBEAE",
            "text": "The Noble is an incredible, cozy little gem, nestled on an adorable street in Greenpoint. Ordered a bunch of items on the menu, and each one was genuinely delicious. Standouts include the goat cheese dip, the halloumi, zucchini fritters and mastic pudding. Can’t wait to go back. Bravo, The Noble!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYM29UQmdRRRAB",
            "text": "Came here with my visiting parents and sat at the bar. Great vibe/music, food was extremely flavorful and you can tell the ingredients are sourced intentionally. The lamb dish, zuchini fritters, chocolate torte all amazing. Rick the owner is awesome. The Noble is a 10/10!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYN0pxakpBEAE",
            "text": "Everything here is perfection for me. I love the design of the whole place, especially the light concept in the evening. The service is really nice and everyone there makes you feel at ease. Almost like being on vacation just right outside my doorstep... I had the Mastic pudding today and loved it. Definitely will be back for it. It was not too sweet and had a really smooth texture. Well done 👍🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYN0txMFNnEAE",
            "text": "Absolutely loved everything! From the food, wine and the vibes inside. Perfect spot for a night out in Greenpoint. Highly recommend trying the lamb.  We will be back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueS1LTDJRRRAB",
            "text": "Such a warm and inviting hidden gem. I love the fact that this is easily accessible off the beaten path with incredibly unique food and tasteful wine and beer pairings. I couldn’t recommend it more and am so excited to come back. Highly recommend for people who want a unique bite and bev."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuczRxWnhRRRAB",
            "text": "We came for an early dinner. The soujok is really good and so are the arayes. Definitely recommend the mastik dessert."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINHZuQjZRRRAB",
            "text": "Very cozy and romantic spot with great ambiance and style. Owners are very attentive, food was delicious and the wine menu was really good. Had a really good night at the Noble and enjoyed the service and menue a lot. Felt like a true neighborhood vibe with connection."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURING9xbnFRRRAB",
            "text": "Had a great night at The Noble. The crudo + arayes were the standout dishes for me. The crudo had really intentionally crafted complex flavors and fresh ingredients. The arayes was very well executed. The pine nuts and toasted pita gave the dish the perfect texture.\nWe also had the summer corn salad, very herbaceous and fresh. The lamb was filling and the watercress added a lot of unique flavor to a classic dish.\n\nNico was our main waiter and he was very accommodating despite the restaurant being short staffed that night.\n\nAll in all would love to come back & try more!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIam9maWRBEAE",
            "text": "Amazing new spot. Will definitely come back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOHRLOGV3EAE",
            "text": "Great food, great atmosphere, great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMU5xSlZnEAE",
            "text": "an instant new favorite spot! music, food, wine, ambiance, were all top notch. the owner and bartender were so so kind and friendly. i can’t wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIa09HS2VREAE",
            "text": "Visited tonight, such a great spot we can’t wait to come back. We’ve lived in GP a year and this tops the list for us on a nice little night out in the neighborhood. Wine was great, and they let us sample a couple. But the food surprised us most. We tried the summer corn salad, cauliflower, Areyes, and halloumi. It was a great mix of bites and felt more healthy than heavy/fried. I’m vegetarian and felt they had plenty of options. Hit up for their patio before it’s too chilly."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUaUt1bzJ3RRAB",
            "text": "We made a reservation for 5:30pm on a Tuesday and when we showed up at 5:15 the restaurant was totally closed. No sign on the door, no notification via Resy. No phone number to call. May be permanently closed.\n\nUPDATE: We tried again and were able to have a great evening. Good happy hour, nice wine, well made and presented dishes and great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeF9udmpBRRAB",
            "text": "Cute little restaurant with delicious food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUc1BIR3V3RRAB",
            "text": "Love this place.  So cute.  Delicious food.  Surprisingly good wines.  A gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbThYdEd3EAE",
            "text": "Music to my taste buds."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc1BPcnlRRRAB",
            "text": "It’s a 10 people!!! From the outside you can tell this place is going to be special, and that translates to everything inside as well. It feels cozy and comfortable, but also elegant and beautiful.\n\nThere was not a single low or even mediocre moment in the meal. We tried the Seabass Crudo, the sun-dried tomato tapenade toast, halloumi, zucchini fritters, grilled shrimp and sipped a perfectly matched wine recommended by Niko. Recommend trying them all.\n\nThe hospitality here is phenomenal as well, thanks to Ricky and Miles. An instant favorite. Amongst many Greenpoint greats this one stands out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNXZ1ckVREAE",
            "text": "The hidden gem I’ve been looking for in Greenpoint! From the ambiance to the delicious food (most try sea bass crudo, and mastika dessert) to the natural wine selection, this place has it all. Staff and service are incredibly knowledgeable and friendly, will definitely be back soon to enjoy more from the menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWM1lIckRBEAE",
            "text": "If I could give six stars I would. This place is absolutely fantastic, and I highly recommend it!\nAmazing food, wonderful service, great vibe and atmosphere. 👏"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsOF9xWTZRRRAB",
            "text": "The noble is such a chic little gem in green point. Located in a gorgeous tree lined neighborhood with an unassuming exterior. I loved the little details from the unique floor tiles to the luxurious hand soap in the bathroom. The wood detailing throughout the restaurant is stunning and makes the place feel warm.\n\nThe food. We loved the char octopus, and the pickled onion marmalade was spectacular. The zucchini fritters were amazing super interesting and graded rather than just zucchini fries. where the Noble really won for me was the sauce, sauce for every dish was thoughtfully curated and left you wanting more I’m a big sauce fan.\n\nThe Turkish wine was super unexpected and exceeded any expectations I had. Will absolutely go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbEszcEd3EAE",
            "text": "So happy to have The Noble in the neighborhood. It really is as good as the reviews are saying. The crudo and the branzino were standouts."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxM3V6Q1lnEAE",
            "text": "We've had a wonderful experience every time we've been to the Noble so far. The food is excellent, the vibe is fun but not to loud, and the service is fantastic. We even walked in on a Friday night without a reservation and they were kind enough to find us a table for a quick bite. We love this addition to the neighborhood and recommend it to everyone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OXBIS3FRRRAB",
            "text": "The service is excellent; there was a small mixup with our reservation and it was fixed easily and quickly. The food is delicious, especially the savory goat cheese dip, slightly sweet grilled halloumi, and the perfectly cooked octopus. I'll definitely be going back asap."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbHBhUVl3EAE",
            "text": "What an amazing experience. Friendly and kind staff. The owners are amazing! But when it comes to what makes a restaurant great, the food!!! The food was so magnificent. The chicken is a must have. The beet salad was one of the most amazing beet salads I’ve ever had. The fritters, be sure to just order at least two orders right off the bat! I will be returning for dates and parties"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsX3FDTlFnEAE",
            "text": "Beautiful new space in the neighborhood with incredible food, wine list, and phenomenal staff. Owner was lovely. Looking forward to frequenting a wonderful restaurant just steps away from our door. Hot tip, try the octopus and custard dessert!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dE1YQVRREAE",
            "text": "The service,the wine, and the food are all fantastic. Such a great spot and at a very reasonable price point. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdFlQcFFnEAE",
            "text": "Everything about The Noble was absolutely amazing. The restaurant is conveniently located on a super cute tree lined block, only two blocks away from the subway. The inside decor is very warm and cozy. The owners are very nice and welcoming, and the service is impeccable. We ordered sea bass crudo, seared halloumi, zucchini fritters, chicken shish, kofte and grilled octopus. All were super yummy. And for dessert, I strongly recommend mastic pudding :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0d0ltcHh3RRAB",
            "text": "Loved it. The ideal neighborhood restaurant. Had the sea bass crudo, zucchini fritters, kofte, and mastic pudding. Everything was tasty and well executed. Wine selection was great. Service was attentive and thoughtful. Will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZ0p6aW9RRRAB",
            "text": "Love this place. The owner is super chill friendly as well as the bartender, Nico. Both are incredibly knowledgeable about their wines. Food is excellent too. Music is spot on and lastly, the vibe is perfect!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZ2MyQnZBRRAB",
            "text": "Amazing experience. Great hospitality.  Wonderful new addition to our neighborhood. Sea bass crudo, zucchini fritters, chicken shish and mastic pudding was  amazing. We came after a late brunch and still finished everything."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsa2RERXZnRRAB",
            "text": "So thrilled to have this new restaurant in the neighborhood. The service and food were both outstanding. We had the sun dried tomato tapenade toast, sea bass crudo, chilled shrimp, and zucchini fritters, and everything was delicious. The space is beautiful -- definitely the best new spot to have opened in Greenpoint in recent years!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMDZMZzRnRRAB",
            "text": "If you want a smaller, more intimate restaurant, look no further than The Nobel. This place checks off all the checkpoints; restaurant ambiance ✅, wine ✅, food ✅, music ✅. Go, sit at the bar, talk to Rick. He’s the owner of whose live in nyc for 30+ years. 5/5 definitely get the dessert, the octopus was 🔥🔥🔥 too."
        }
    ],
    "reviews_count": 66
}