{
    "name": "TØRST",
    "place_id": "ChIJlaFjTURZwokRvsN6V805OEk",
    "grid": "BK1",
    "address": "615 Manhattan Ave, Brooklyn, NY 11222, USA",
    "rating": 4.7,
    "user_ratings_total": 1565,
    "phone_number": "(718) 389-6034",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTmJrRTNTRVUxWm1GUFNWYzNOVU14WW1JMVpIYxAB",
            "text": "I visited this Place Last Night with my Date. It was an awesome experience all the way. Lovely Hosts, guests and an incredible good list of beverages. Will Return soon!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWVNqZElUVlpyVkRaQ1RqVlNNVEJZZFZWRFJGRRAB",
            "text": "The best place ever. Service, clientele and beer is the most top notch in the industry."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZc0o2T2dRRRAB",
            "text": "The food is a little pricy (though excellent). I like the beer selection and the bottle list also. One gripe - they don’t often update their online lists, and I do find it difficult to get a beer when it’s busy. The bar design crowds you out.\n\nEdited Oct 2025 - added photos."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dlBYSUVBEAE",
            "text": "This place is one of my favorite beer bars in nyc. Great tap selection and delicious food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWk1tMTBVRkZEY2xOaU1YSlVaRGRJVUhCa2RYYxAB",
            "text": "This is one of my favorite bars in Greenpoint. Insane tap list. Such a cool vibe inside.\n\nCan sometimes be a bit too crowded, since the inside is a tad small, but on off-hours there is tons of space. Always fun to get seasonal Maine Beer Company on tap. Lovely spot.\n\nBartenders are very knowledgeable. Also, they have much more than just beer, at the delight of my partner. Will keep coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVGJFcDVOVEo1YzNGa2VGVjFlR2xIVVZkcGVGRRAB",
            "text": "We paid $11 for sourdough that was several days old and over fermented. It was basically a crouton. We couldn’t eat it. The drinks were cool. They shouldn’t have served that bread."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTloyNXpSR1l0ZEhGcFZ6RktlVE5tV0hacFRuYxAB",
            "text": "Fantastic beer, atmosphere, and bartenders. No notes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkZk5qSTBZaTFYTVRSRFlrZ3pTbmhKUkRjMFJHYxAB",
            "text": "Staff is super friendly and the drinks were amazing as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeE5YZFhPRFJNWm1kdE9HcE9PRWxvVEUxRGMxRRAB",
            "text": "Great selection of beer and wines and the service is really good. Nice atmosphere and aesthetic."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQ00zTkhOM3BPUXpoclNHMWFXSFZ5TTJwRFRXYxAB",
            "text": "Hello Tørst, been a minute"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSVdqSlRNMlJ2WTJ4S2RVVTBVVzl2TTBrNVNHYxAB",
            "text": "I make it a mission to come here anytime I'm in the nyc area.\nI enjoy wild ales/lambics/funky sours. They also have an excellent happy hour and a good frozen espresso martini."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pod2NFeEZkSGRCYjJjdFVEVnZjR1YzVERWdGFHYxAB",
            "text": "I had an amaziiing experience hosting a private event at Tørst, the biggest gathering I've ever organized for about 40 of my friends!!! The vibe was amazing, the staff was incredibly kind and friendly, and they served our catering promptly and smoothly. The whole event was a success, and I’m so grateful we chose to have it there! Oh, and their fried chicken sliders catering was sooo good!! Still thinking about it now hahahah 😆 Would visit again and highly recommend hosting your private events there!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GV1J6WkRhVmQ1Tm5scU5tTjZaVkYyUkhSa1ExRRAB",
            "text": "Place is great good service too , really good happy hours"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RNWVXaDJibVZyTWxRelNIaEtPRGRKWkVRd05YYxAB",
            "text": "Burger was rockin, wings slaps, staff friendly and just great time. Would definitely come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SblVEbGlkMHhaVms5blZWTnlNV3h6V1ZWblVIYxAB",
            "text": "Great beer and wonderful atmosphere, the décoré is like being back in Norway!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dU5tVnRaRVpOWlV0b1ZubHBjbFJ3YVZKTk9GRRAB",
            "text": "Great bar and awesome service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdFJ6ZE5jV2hrYVRKdlRuUnViM0F5YVRaNGRFRRAB",
            "text": "Beautiful atmosphere and great selection of beer"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNeXQ5X19ENDVuRGJnEAE",
            "text": "Got to try both the Alchemist Dark and Light side by side — absolute treat. Beautifully balanced beers in one of the best-designed bar spaces I’ve seen. The vibe here is dialed: clean, modern, but still warm and welcoming. Service was great, picked up a couple of Alchemist stickers, and left already thinking about the next visit. If you care about beer, this place should be on your list."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPV20tZmY4dHNxSXlnRRAB",
            "text": "My husband and I hosted our wedding welcome party at Tørst this spring, and we had a great experience. All of our communication was over email, but Bartley was incredibly responsive and easy to work with.\n\nWe rented out the back space of the bar, which was perfect for hosting our guests. Tørst has a great selection of beer and wine, and the atmosphere was exactly what we were looking for, which was laid-back with great vibes.\n\nThe staff was also amazing. We had a big group, and they were so kind and accommodating, even with a larger-than-expected crowd.\n\nThank you to the whole team!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLVEEtUEhGdjlhRVRBEAE",
            "text": "Awesome beers on taps, can try here top BA stuff, also a lot of good wilds. Place is often full of people. Good place to visit, being in NY"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJbnBoX1duanZxYzZ3RRAB",
            "text": "The bald bar tender working behind the bar drinks a lot, which made my friends and I feel uncomfortable :("
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNVFNtZlNseXNDNGVnEAE",
            "text": "Very good restaurant and very nice service 👍👍👍👍👍👍👍👍👍👍👍👍👍👍👍"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbkh2TWZWOC1DRklREAE",
            "text": "Probably the best beer bar in the city. The mecca for NERDY beers, you want a hard to find brand they have it there. The food is also amazing and the service is outstanding."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcDVLYjZ3RRAB",
            "text": "Me and my boyfriend came here on our first date and it is very gay friendly which is awesome! We had such a great time and drinks. Highly recommend this spot . The only downside is when I got my 2nd cocktail at the bar a big spider dropped down and drank it then spun a half web because it was drunk . What the hell !! Good spot though"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNl9YaDBBRRAB",
            "text": "This place is an absolute hidden gem. Please run there right now!!! It's a bit small inside, but the vibes are great and the food is next level. I've been back here now handful of times for the wings and the burger and every single time I leave fulfilled. LOVE THIS PLACE! Thank you Torst team x"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaGZpNklnEAE",
            "text": "Service is abysmal, waiters try to push you off tables and make the whole experience unpleasant. Would recommend any other bar in Greenpoint over this one. Only good point is the beer selection."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaExYdUh3EAE",
            "text": "Food menu leaves things to be desired but the beer is great"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMDVTMFFBEAE",
            "text": "Loved the beers that they havr to offer here.  They were featuring a Mexican brewery called Hércules. The bites are also pretty good.\n\n5/5"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdDVUVTZnRRAB",
            "text": "Great vibes and services. Very smooth and easy for private events too."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMU1ESUt3EAE",
            "text": "Good cold beer. Good warm service.\n\nLarge variety of beers and wines on tap. Highly recommend - though be wary as can get vary busy and chaotic."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNjZIMHVRRRAB",
            "text": "It's hard to find a better tap list in NYC than here. They keep their list current on Untappd, so check it out before you head over. The can list is fairly current."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdHQzVTRnRRAB",
            "text": "Great beer selection."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdDQyUHJBRRAB",
            "text": "Amazing selection of beer, some are rare find. Staffs have great knowledge with their menu and very helpful when you can make your own decisions. Love the atmosphere, food also tastes very good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdnRidGtBRRAB",
            "text": "(Nov 2014) Uber cool high tech mod fitout and no shortage of opinionated beer nerds (complete with obligatory cult brewery t-shirts). Even at 2pm on a Sunday arvo. Doesn’t quite have the warm of a traditional US bar but still pretty…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmZ3Bud2tnRRAB",
            "text": "SUCH a stylish spot! Great beers, great staff, great decor. Would absolutely love to return!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbUtMWUpnEAE",
            "text": "This place is great. Bunch of really interesting and unusual beers. A really nice space to drink in too. Great bar in a really fun neighbourhood."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMl9UZXBRRRAB",
            "text": "Had a phenomenal time at the NYE event. Incredible service, great beer and an all around good time. It was lively with the crowd but not crazy packed and was still pretty easy to get around. Kudos to the staff, very well done!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaGJMYW5BRRAB",
            "text": "The lemon soda for N/A lovers is fire!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmc2V1cmRBEAE",
            "text": "Local and international selections of craft and widely not available beer with seasonal offerings and a cute food menu along with some non-alcoholic choices.\n\nNot all too bad !"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNnFqdlZBEAE",
            "text": "The new kit sign outside and TV in the bar go against what I loved about this bar. It was in my mind previously a 5-star review, but now I’ve docked one star to make it 4."
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MllHV25BRRAB",
            "text": "Excellent choix de bière.  Décoration originale."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3ck42NUF3EAE",
            "text": "This is one of my favorite bars in Brooklyn and it is because of the staff! The bartenders are what make this place the best, Delina, Alana, Jenna, Phil, and the bar backs like Norm always make it worth coming back to! Whatever they are getting paid is not enough because they make the place what it is!\n\nI love the changing menu of food as well, as there is always something new to try! Currently (August 2024) the oysters and lobster roll are my top faves."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdHBXWmlBRRAB",
            "text": "I may have went at a rowdy time, but I wanted to try the frozen martini. I give the food and non alcoholic spritz a 5/5, but left disappointed on the martini."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdUo3Q01REAE",
            "text": "They always have very delicious beer selections, and vibes is very nice and chill"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNXFlVEtREAE",
            "text": "Awesome drink options. We came for the burger; however the bread was a bit too sweet and it overpowered the jalapeño jam and dijonnaise. But good experience overall"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYN01id0tnEAE",
            "text": "Expected more Scandinavian beer options but vibes and service were good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNTZHWjlBRRAB",
            "text": "Good drinks. Espresso martini was solid and i love the ananas sour!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMWZDRmxRRRAB",
            "text": "Went on a whim and I’m glad I did. They have an amazing selection of German and American micro brewed beer plus some awesome happy hour prices. If you live in the area or commonly come to Greenpoint, make Torst a stop on your travels. Friendly staff and reasonable prices make this a must visit for any beer and wine aficionado in your life. You won’t regret it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuel9mUklREAE",
            "text": "Beautiful list and service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOGRIYlhREAE",
            "text": "My friend loved the curry dog and the frozen are delish."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbUkzQTZRRRAB",
            "text": "맥쥬 종류가 많아 궁금했던 맥쥬가 한가득!\n맥주 좋아하신다면 꼭 와보쉬길 친절한 직원분과 로컬분들 덕분에 뉴욕의 마지막 밤을 인상깊게 마무리 하였어요! 재방문의사 100%🍻"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwbm9ydFhREAE",
            "text": "치킨샌드위치 매콤달달하니 아주 맛있어요. 강추"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdU9fNHRBRRAB",
            "text": "맥덕이라면 와봐야 할 필수코스"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdDdTaER3EAE",
            "text": "I finally tried this Danish Bar.  They have a long draft line and rare bottled beers.  They have some good cocktails.  They have a limited food menu.  The happy hour is good.  The place is sleek and modern.  I liked the different colored classes hanging from the ceiling."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeDhqek9BEAE",
            "text": "The place is full of European Vibe!! The decoction is super simple but elegant. They have 21 variety of taps and a lot of Great wine and beer. I just love the dim light and music with good taste of drinks. Bartender in there is super friendly and make you feel comfortable. I just feel like love it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsbFB2QUhBEAE",
            "text": "I've been wanting to try this place for months and made time on this trip. Beautiful bar with an inviting and helpful staff. It was a Monday afternoon, so not too busy.  The selection of beer was really good with a solid HH (perfect if you want to try a more expensive brew)."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpbXFiMHdBRRAB",
            "text": "Ate here with friends for my birthday and it was incredible. The staff was so friendly. We sat in doors and I felt perfectly safe because of their Covid prevention policies.\n\nWe had the burger, the fried chicken and the pastrami and all of them were cooked to perfection and each tasted just as good as the other. The beer nuts were not great, but other than that, amazing. I will be returning."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1a2NHel9BRRAB",
            "text": "Interesting craft beer bar in Greenpoint. My friend and I actually not a fan of beer but somehow, we give a chance to try. They also have small menu of cocktails and wine with some promotion (you have to check on somewhere in the menu.) The bartenders are friendly and love to talk if you have any question about their beer even wine. I try ANOMALOUS (frozen) very sweet, a glass of Red (chilled) Uivo Renegado.\n\nI couldn't believe they in business for 9 years, every time I pass by this place I always feel this bar is new."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwaG9yZ0l3EAE",
            "text": "Great beer bar, makes you feel like in the heart of Copenhagen with great ambience music and style. Free WiFi, clean restrooms, knowledgeable staff whom are really helpful but it can get crowded. Food menu really small but the dishes were amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcTZmTTNBRRAB",
            "text": "Excellent beer bar with wide selection esp niche beers. Love their brewery spotlight events. Impressed they carry so many lambics (Cantillon..Tilquin )on their extended menu. Can’t wait to come back for their Cantillon event and also try their food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibHZDNjBBRRAB",
            "text": "Stopped in to get out of the rain - loved the Danish hot dog and tried a great beer and a cider. The frozen espresso also martini looks great, lots of people were ordering it, although I didn’t get it.\n\nRelaxed, aesthetically pleasing vibe and great service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2MS1hV05REAE",
            "text": "They have the trifecta: amazingly deep selection, offer 5oz pours, and list the menu on Untappd.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyajl2Y2hBRRAB",
            "text": "Such a great burger spot in Greenpoint, Brooklyn . Their menus is constantly changing . I got their DRY-AGED BURGER, SMOKED TOMATO JAM, GRUYÈRE, SPROUTS, RED ONION, TOASTED BRIOCHE BUN. And we all shared BURRATA…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNS1pUUJnEAE",
            "text": "A really cool beer bar with some good selections and a small but delicious food menu. Don't sleep on the dry-aged beef and mushroom burger, it's one of the most underrated burgers in the city"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnN3JiZXZ3RRAB",
            "text": "Good place to try different beers. The staff was fun and knowledgeable about the offerings. They offer each drink in three different sizes which is nice if you just want to try something for the first time. Small food menu with snacks and appetizers, I would just go if you want to grab a couple drinks."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN3R6NFhnEAE",
            "text": "Definitely one of my favorite bars in Greenpoint! Super friendly staff and the food is absolutely phenomenal. Best fries I think I’ve ever had and their chicken sandwiches always on point."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZMnByRkZ3EAE",
            "text": "This is my new favorite craft beer spot in Brooklyn! Great selection of beer, limited but intriguing selection of food (we had the Prime Beef Tartare and Rhubarb Granita). The place was packed on the Saturday night we visited (as expected) but the service was excellent - prompt attention at the bar and food came out timely."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVeEtXd2R3EAE",
            "text": "Hands down the best beer bar in Greenpoint, if not the best beer bar in Brooklyn. Always a phenomenal tap list, super beautiful interiors, and great bartenders."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbE9pTzNBRRAB",
            "text": "The selection of beers is good, but the food was extremely heavy. We were ignored for long while the staff chatted with people at the bar, and had to \"force\" the taking of our order. Also, there were 12 degrees C in NY, and the place was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcUtybGF3EAE",
            "text": "Excellent and extensive selection of beers and ales. Food is surprisingly good, especially the chicken wings and cheese plate. Staff are friendly, attentive and decor is stylish and fresh for the area. Bring a date!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDd2VUYmd3RRAB",
            "text": "5 star cell toon of beer and chefs creativity. Elevated cuisine, surprising combinations, superb performance. Must order the burger. It’s texture is airy... I never had a burger done this way before."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMweXZpeFdREAE",
            "text": "Incredible selection and good seating. Food was good and atmosphere was fun! The staff was very helpful and friendly and we were served very quickly. 10/10 will come again!"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRd1pXck9nEAE",
            "text": "The best meal I've probably ever had... The atmosphere is so intimate and food is so fresh and meticulously curated. It's readily apparent why they received a Michelin star!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNWJPXzJnRRAB",
            "text": "Food is small (clearly european, not american size), the beer is good"
        },
        {
            "date": "3년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXZ0xmdFhREAE",
            "text": "Muito bom, comida e cervejas melhor ainda.\nComemos o peixe cru e o hambúrguer e tomamos umas 6 cervejas diferentes, todas ótimas.…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncWFQSWZ3EAE",
            "text": "This place is amazing. The atmosphere is cool. They have great beer on tap. The food is delicious. If you were standing in front of the door, you'd still have no idea you were at Tørst. It a gem!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtd296Z0pREAE",
            "text": "Always a fun time visiting Torst for a quality afternoon day drink with your beer geek buddies. It's always nice to start with a couple drafts, then dig into the extensive bottle list.\n\nLove the lighting inside and knowledgeable, friendly staff. It can get busy, but the folks behind bar keep it moving and keep a good bar flow."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnZ3ItUXBnRRAB",
            "text": "Arguably the most well-curated selection of craft beers on draft that you'll find at any given time anywhere in the city. Knowledgeable staff, great music, and lots of industry folks are always on hand."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwMHRDS1ZBEAE",
            "text": "The beer selection is very impressive! The long bar makes you also enjoy the experience better and gets you more curious with the beer list having the view od the tap and menu board. The first one I had was Rustic Ways and it got me to order 2 more rounds"
        }
    ],
    "reviews_count": 79
}