{
    "name": "Bernie’s",
    "place_id": "ChIJ5T7dN_ZZwokRKJxbtcuO9lw",
    "grid": "BK1",
    "address": "332 Driggs Ave, Brooklyn, NY 11222, USA",
    "rating": 4.6,
    "user_ratings_total": 581,
    "phone_number": "(347) 529-6400",
    "reviews": [
        {
            "date": "22시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSVNGQkJVSEJVUkMxalYyazBhbDlNV2paVGRIYxAB",
            "text": "It's a very cozy place to come with a family"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUGJEaHRMVlkwVTJ4NlVrVTVUMlZEVDFVMmNVRRAB",
            "text": "Amazing burger!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSWJWaGZPQzFaUzNCTGNFcHJaMnhRYVZCRlMyYxAB",
            "text": "We were able to sit down right away at the bar and received excellent service. The staff is incredibly friendly and easy to talk to. And the food was soooo good. The chop salad, burger, vinegar chicken and brownie sundae all tasted amazing. Everything tied together to make a worth while experience. We will be coming back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKQlUzVXpkVXBpVWtORlFUbGhNek5HVVRWYWNHYxAB",
            "text": "Bernie’s do simple food incredibly well because it’s all made from scratch with quality ingredients. Ribs and chicken parm are best you will have anywhere. The quality of service really sets it apart though, we go there with kids and staff always make you feel at ease, which is rare for a busy restaurant in NYC. It feels homely in the big city. Our favorite place to go whether it’s a date night or family meal"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReVNrMXdUR28xWkdkUFUwdHZWREZsZW1wUFJWRRAB",
            "text": "I love this place. The portions are massive and i wish i could have tried everything. It’s a warm and cozy that makes you wish it existed more places"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eFRIcGxZMkpMZDAxb2RURTBkVlozYTJOeVJsRRAB",
            "text": "I get the hype around this place now. Bermie’s has a nice casual atmosphere, great service, and generous portions of great comfort food.\nI ordered the burger, and it was outstanding—a big, perfectly cooked, juicy patty stacked with fresh toppings and served with some nicely done onion rings. And if you’re there on a weekend, don’t skip the tiramisu. It’s to die for and honestly better than what a lot of Italian restaurants serve. The only downside is how popular this place is. They don’t take reservations, and by the time I arrived around 6 p.m., the wait was already about an hour for a seat at the bar. They were turning away larger parties not long after. So definitely get there early, and if you’re coming with a group, maybe have a backup plan. Overall though, a great night and a place I’ll happily return to."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNWRTMVJWMjQwYzJwWVF6VkphVkpmVmpGeWVsRRAB",
            "text": "One of the best burgers in NYC!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWk1UTkxWRE52YmxCTmJXSkllRXBhWmpGUlRuYxAB",
            "text": "Amazing food, grumpy but helpful staff\nLoved the homemade chips and the onion dip! Soooo yummy\nAlso the eggplant Parmesan was the best I’ve ever had! The Piccata sauce was also unreal 🤤🤤\nThe drinks were just ok, and not an impressive number of options"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKd01tcFZjMkZRVFhoQ1VsWk5VMnRsV1hocE9WRRAB",
            "text": "CUTE LITTLE PLACE TO DIP IN AND DIP OUT. I HAD THEIR WEDGE SALAD. THE SLAB OF BACON WAS MY FAVORITE PART OF COURSE. I SAT AT THE BAR- SERVICE 10/10. HAD 2 DIRTY MARTINIS 🍸 THANK YOU"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjdFlqRm1Xa05NUTBkbVRTMTRlbFZLTUZwa04zYxAB",
            "text": "Rachel rules weeeeee"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRFJsVkJNRkpOWTJwdmVETlVZM1ZzVVhKSk4yYxAB",
            "text": "Perfection.\n\nAs my girlfriend likes to say, this restaurant is a “pure expression of someone’s vision”. Whoever made this knew what they wanted to do, and they executed on it perfectly.\n\nEvery detail is well thought out.\n\nThe ambience is perfect for the vibe, perfect colors, perfect lighting, perfect seats, perfect floors, perfect tablecloths, and the best touch of crayons and a sheet of paper to draw on while you wait for your food.\n\nThe food is amazing. The best vinegar chicken and burger and chips and dip and desserts I’ve ever had. Every dish is a 10/10 here.\n\nThe service is spectacular. Perfect for the vibe. A neighborhood spot with amazing ambience, food, and service.\n\nBernie’s is an experience you won’t find anywhere else. It’s a perfectly executed vision. It’s that neighborhood spot you dreamed about in reality.\n\nMy girlfriend and I can’t stop going here since we moved to NYC. I’m a bit scared giving this review since it’s already so busy, but they deserve it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsU05rMVVhMnh5ZUZKeWIyUTNNMDVMTlZsSGFFRRAB",
            "text": "I suppose a host could be nicer and cooler than Matt but I can’t imagine how.\n\nAfter pulling up a stool and having a beer while waiting street-side, we got a great table and had an amazing meal.\n\nAlex, our waiter, was fantastic, fun, and efficient.\n\nThe burger was great. The mozzarella sticks, too. Save room for dessert and get the lemon icebox pie.\n\nFantastic experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pka1MwaGZabWx4TTNSVlNqVldhM1JSUmtoWFJrRRAB",
            "text": "Love Bernie's, wish i lived closer or they took reservations. It was fun having drinks on the sidewalk while waiting for a table, the martini was spot on. Everything we had was like the best version of that dish I've had. Onion rings, mozzarella sticks, baked clams, the wedge salad, the cheeseburger, all were delicious. I want to come back to try the ribs and vinegar chicken"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSFNFSjFNVFF4TTNsdGMwMXhielp2YlMxd1VWRRAB",
            "text": "Disgraceful service. Woman working started barking at me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNVlrVlNNMUkzUkZacGJsQlljazVuYkd4MlptYxAB",
            "text": "This was my second attempt to go to Bernie’s. The first time I happened to stumble on he restaurant and wanted to give it a try but was too hungry to wait an extra 1 hr 30. This time I drove out the way fully expecting to wait because I knew from my previous experience how busy it was. I went to greet the host who was one rude and off putting, and asked me if I had put my name down after I asked how long the wait was. And once I replied no, he said they were booked for the night and the weekend at 6:00 in the afternoon. It is absolutely bizarre for a restaurant to have no reservation system, and expect customers to come right when they open to put their name on the “list”. How are people supposed to know if the restaurant is packed out or not? I don’t know if it’s the racially element of not fitting into the clientele but the you guys have to do better. It is obnoxious and off putting."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUWVFOUlMVzFHYWxCWWMwZE1TekZVVjBFd1JXYxAB",
            "text": "One of the best burgers in NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkZmJGRTNVbU5tVWw5bWRXdENUMHBaVFU5UU5WRRAB",
            "text": "Awesome spot with a nice simple menu, easygoing vibe and the best vinegar chicken you will ever have!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdk5tRm1RbkJFTWtsb2F6SlhjMnh1YW1oMGRYYxAB",
            "text": "Really great staff and food! Extremely helpful team member at the bar who assisted with our order.\n\nWill definitely return!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbk56WmZhMGRPYmxJMGVFaG5WbkZSWVVsdmRWRRAB",
            "text": "I live close by but don't come here very often, it can be hard to get a seat. We slid into the bar the other night after a bit of a wait and ended up having a great night. Food is reliable the vibe is 100. Bartenders were in a great mood kept + my wine glass topped off without asking. Hospitality is really 10/10 idk it's a dying art. Keepin the locals happy :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVWJtdHZXbkpvVjNCS05GTnNPVVU1YzNwWkxXYxAB",
            "text": "Bernie’s is a technicolor dream wrapped in a red booth. Cozy up with a classic American burger, chicken parm, or that glorious vinegar chicken with that fine, delicate crisp on the skin and grilled vegetables your Nonna can smell from heaven, paired with a frosty stein or a stiff Manhattan that whispers… Brooklyn never *fully* died. Bonus: there are crayons on the table, so you can channel your inner tortured 3rd grade artist while you wait for your plate of joy.\n\nAnd just wait for the wait … oh, the wait. Yes, you’ll wait. On a Friday, the line wraps around the corner like it’s handing out free kombucha. But it’s the most New York thing ever—standing next to a guy in a vintage Mets jacket discussing film grain with a girl in cowboy boots and a Baby Phat puffer. If you wake up the next day with strange bruises … those aren’t bruises … they are ironic tattoos.\n\nGo for the chicken, stay for the crayons, leave with a warm heart and a weird drawing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVk1sWkVaR0Z6VDFKS01uaHBRWFExVlRKT05GRRAB",
            "text": "The wedge salad was great and the vinegar chicken was awesome. I really like this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM05YaHlWVEZFU0ZsZldIUnlOMWMyZW1aUWQxRRAB",
            "text": "Good burger!\n\nAlso tried the octopus and the chicken parm (great for a fall/winter day IMO)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVmNGSkliRzlhZG5OaFlXSmljWFZpZDBaM1NuYxAB",
            "text": "Came here to try cheeseburger but here was much more going on. We enjoyed to be there, eating-talking-looking around. Such a happy energetic vibe <3<3<3"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTFMxSkJMVEZCTjI1aVpGcE9iMUpSYlhoSlUyYxAB",
            "text": "Great atmosphere and great food!! Excellent service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRFgxQlFTSE4yTmkwMmQwcEhVRmRwVkVsdlRWRRAB",
            "text": "I’m sorry it’s just not as good as people say I’ve been several times now thinking the next thing I try will knock it out of the park. The vinegar chicken is fine, the chicken parm is weirdly below average, the salads are simple so even tho they’re p good it’s hard to pay $25 for a caesar salad i can make fresher and better at home …."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTlFWazViblJtTFdsU1JWSnJhMncxUVVKVE9YYxAB",
            "text": "What blast.  Stopped by on my way to jfk and they squeezed us in.  Great service and food. And T shirts. The chicken with peppers and the eggplant parmigiana were delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWc01tOU5OMFI1ZEdnMU1raDJPUzFvVDNKRFRYYxAB",
            "text": "10/10 arrive early, order Negroni or a martini if you wish, enjoy the chatter of locals in this destination neighborhood restaurant while highly encouraged to share with friends also a incredible place to enjoy solo."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kYVRERkpNRlZGYVU1RWQwSndUVWhOUkRGSmVWRRAB",
            "text": "Matt and Michaela were absolutely amazing. Such great energy. Kept us laughing the whole night. We sat outside in the rain and they kept us wine and dined and dry all evening. The drinks, food and company were absolutely amazing. We will definitely be back. Aisling, Kinga, Taz, and Adam love you guys! From Ireland and San Francisco with love 🧡🧡🧡"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMGVVOUJXV2RqUjFBeFVUQXlXVFpFUTJkcGQxRRAB",
            "text": "Meh... We got the burger and it was just okay—same with the fries. Nothing stood out. $74 for two average burgers with Coke and tip? Plus you have to wait an hour for a table. Not worth it for me. There are better options around."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KR01IVkhkbmcxUkRacVF6Y3ROMVZqTkhSV1FXYxAB",
            "text": "Oliver, Alex and Rachel were so accommodating to our group last night! Bernie’s is fully the cheers of the neighborhood and they and the back of house team make it all the more special. Thank you for everything ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONlNuVnVUVmQ2V1VKaGEwWkNhV00xY1V0dFYyYxAB",
            "text": "the server was weirdly rude right off the bat (the tall guy with dark hair) and impatiently told us we need to order food right that second, then never came to check on us again. the other servers were also really meh. the food was very medium and everything was extremely overpriced. also there was no air conditioning and it was 90 degrees out 😭😭😭"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQ0xYbHhWMkpQWWpnNFJDMHlVMW8yVHpkQk1YYxAB",
            "text": "Incredible service and chicken Parm."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdFMxcG1aSEUzYmsxT1dYQjVOek5DWDJJMVpVRRAB",
            "text": "so yum"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTlNVdGlSbEZaVGtGeFQyZFphemhrY0VWamVVRRAB",
            "text": "Love this place! Sat at the bar, loved the bartender Jason. Will be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcms0clN2b2ZtS3lBRRAB",
            "text": "Have been there a handful of times and always had good food and good times.\nGot there on a Monday @ 5p when they opened figuring we would get a table easily … only to find a line halfway down the block.  We still DID get a table but it was close!\nGet the chicken parm and the mozz sticks."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPMlQ1UGYwNV9tUjlBRRAB",
            "text": "The best"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOSFUwdjN4bzZXNGdBRRAB",
            "text": "Great restaurant snd food! Well worth the wait.\n\nSince the restaurant is so popular they have rules to manage demand. PLEASE READ THEM BELOW. It may seem odd to a newcomer but it works since they bring in so much money every night.\n\nFor those of you who have not yet dined here the following rules do apply. Read them ALL to have a great time.\n\n1. They do NOT take reservations. Instead you MUST show up in person to be seated OR to be put on a waitlist.\n2. Your WHOLE group MUST be ready to be seated or you will NOT get a table\n3. The waitlist from rule 1 does NOT begin until the all the tables are full from first seating\n4. You CANNOT reserve a time slot but don’t worry. IF you get on the wait list you are guaranteed a seating HOWEVER this can vary from 30 minutes to upwards of 2+ hours. At times this can increase to 3 hours+ if the restaurant is busy. Feel free to relax at the park or walk around the neighborhood.\n5. Due to rules 1-4 it’s recommended that any large groups arrive early BEFORE 4 PM to line up for seating/waitlisting. You can order drinks during extended waits and they have stools you can sit on.\n6. There is a VERY limited window for optimal times. Too early an arrival and you are having dinner at 4 or 5 PM. Too late an arrival and you will get a call back time between 8 or 9 pm. The restaurant does close at 10 so if arriving too late you may not be able to be seated or even waitlisted.\n\nTrust me the FOOD is WORTH THE WAIT!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLeVl3b0NFdWNfTjB3RRAB",
            "text": "We had a wedge salad, a cheeseburger and a chicken parm. All 3 were great but the wedge salad and the chicken parm were exceptional.\n\nThey have a separate waiting list for the bar btw and the bartender who is managing the line is SUPER FRIENDLY, PROFESSIONAL and HELPFUL. They are lucky to have the guy working there for years!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONFZrNDNSVmRNWWpSelZsWklWamRwWkhWQlEyYxAB",
            "text": "One of Greenpoint’s best. Burger, mozz sticks, vinegar chicken…the French onion dip is low key the best item. Don’t miss it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMVDc2OE9SNGYzdkpnEAE",
            "text": "My wife and I were in the neighborhood grabbing drinks when we suddenly got a craving for a burger. Bernie’s popped up as one of the top spots, so we decided to check it out—and I’m glad we did.\n\nWe were greeted right outside by two friendly guys who were super welcoming and accommodating. They sat us at a small booth for two. The ambiance was exactly my style—red and white checkered tablecloths, candles on every table, and a cozy vibe throughout. They even gave us crayons to draw on the white paper laid over the table, which added a fun, laid-back touch.\n\nOur waitress was kind and attentive, but we already knew what we wanted—the burger. It came loaded with shredded lettuce, pickles, onions, and a side of their amazing sauces that really tied everything together. The sesame seed bun was fresh, and the fries were thin and perfectly crispy.\n\nWe also noticed the table next to us had what looked like a chicken Parmesan, and it looked phenomenal. We’ll definitely be back to explore more of the menu."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNSFpxcExIOU1PU1FnEAE",
            "text": "Sigh. I honestly understand the hype. I am perpetuating the hype of every other nyc restaurant but good is good. Burger, fries, sundae, MOZZARELLA STICKS, and VINEGAR CHICKEN. All excellent but especially the last two. I was so so full. The margarita my bf had was whatever so you can skip that. Probably good if you’re into beer but I don’t drink that. The coke. lol they got a good syrup. That coke HITS. Especially with a squeeze of lemon. We ended up getting three they were so good. The baby back ribs were a bit tough so I would skip that as well but flavor was good. I honestly can’t wait to go back and try the buffalo wings and the chicken parm but we were beyond stuffed. Honestly wasn’t a bad wait. Should up about 25 min before open on a Sunday and got in easily. Looks like all the people who came when up to 15 min before open got in immediately (or sat outside) once they opened at 4. I know waiting in lines is so not New Yorker of me but it was definitely worth a 20 min wait."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObU0zSXVWc0ltZll3EAE",
            "text": "Incredible food! The ribs are an absolute must-try. If you can swing an early dinner, you’ll beat the rush and avoid the wait. The staff is warm and welcoming, and the whole place has a great local vibe."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPV3hnUFQ1Z3ItbG1nRRAB",
            "text": "This place is no better than Applebee’s.. I really don’t get it.. with 2x the price too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQdkozX2ZNNHVqRU9nEAE",
            "text": "This place was not as good as people online said it would be. I had a very nice server who was very nice. For that reason, it is not one star. The food was not very good, and it was very wow expensive (very)! I ordered the ribs,  burger, wings, and mozzarella sticks. They all were not good and very expensive! If not for our very nice server, this would be a one star. I cannot recommend this place to anyone who likes food or money. Besides our nice server, this place would receive only a singular star. But, because our server was nice, it gets two."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeG9mRXV3RRAB",
            "text": "Absolutely fabulous and worth the hype! Great vibes, delicious food & drinks - get the ribs for the table to share!! Impeccable service - 10/10."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMnV1QTZ3RRAB",
            "text": "We were seated after 10 minutes on a Thursday evening. The staff was really kind and service was fast. We ordered mozzarella sticks which were good, burgers also good and two other chicken dishes that were meh. This is a good spot for a meal when ur in the area if you can get a table but I wouldn’t go back, it’s pricey. Just ok overall."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNUliYzhBRRAB",
            "text": "We are obsessed with this place. The fries were amazing, the vibes were on fire, our server was great and all need to get the martini!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdXZEWXFnRRAB",
            "text": "No extra frills, solid selection of food.  Solid cheeseburger and fries. I'm obsessed with the chips and dip. I could bathe in the lemon pie it is so good. I don't think I've tried anything I didn't like here. I'm sad that there is not a takeout option."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMnJhVFlnEAE",
            "text": "Where magic happens! Good food, good people, good vibes #respect #good #favorite"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMHRyNlVREAE",
            "text": "Bernie's is the best. Service and food are amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6Nzd5QjRBRRAB",
            "text": "6 star review if possible. Everything is top notch.\n\nBernie’s has become green points. Best neighborhood bar for great drinks and spectacular comfort food. They are only open Tuesday through Sunday for just a few hours each day but every minute packed with people. They do not take reservation however plenty of outdoor seating while you wait. Best to get a drink while you’re at it.\n\nWhat else can I say aside from perfect place to kick back, enjoy and have fun."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbzUtS0p3EAE",
            "text": "Very solid meal. Classic American dishes than came out well seasoned and delicious. They only do walk ins and there are not many tables so expect a wait, but it’s worth it! Loud bar at night but we sat outside and it was great. Will come back for the mozz sticks, ribs, and chopped salad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMZ29XTVJREAE",
            "text": "Came to Bernie’s for a friends birthday. We arrived at 6:30 and waited till 8:15 for a table for 5 (call us suckers for waiting). We were seated in the darkest corner near the bathrooms, but hey, let’s see what the hype is about.\n\nOff the bat, the waiter is so rude and douchey. Bad attitude and unaccommodating. We ordered the mozz sticks ($17 for 5) and everyone got burgers ($24 each).\n\nFood wise, the mozz sticks and burger were nothing special. They tasted great, but then again, not hard to mess up a burger and mozzarella. I would come back to try their other items.\n\nOverall, slightly worth the hype? Need to investigate further, but the expensive prices… I don’t know"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aGJqLWtBRRAB",
            "text": "Must arrive 15-20 minutes before they open in order to secure seating. Otherwise, there will be a wait and if you come later in the evening, they will likely tell you they’re fully booked for the evening. FULLY WORTH IT.\n\nIt’s a no frills, delicious, dinner spot. The burgers live up to the hype and my god the sundae is incredible. Absolutely scrumptious and delightful. Their martinis are also 10/10 and 100% hit the mark. Caesar salads are a shared plate, massive and mighty. We are waddling out with one button on our pants unbuttoned, and we’ve never been happier.\n\nArrive early and hungry."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeTdQc3NnRRAB",
            "text": "I live close by and see a line everyday so I thought this place must be heavenly. So we decided to put our name down but only came back to a meal that’s quite disappointing. We ordered the famous mozzarella stick and I really don’t get what’s so special about it. The caesar salad and cheeseburger were both mediocre, however the vinegar chicken was pretty great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcHN2LURREAE",
            "text": "LOVED IT:\nCeasar Salad.\nService. Oliver the host was friendly and accommodating. He put us at the perfect table with the perfect timing. He was so pleasant to communicate with.\nLiz was in and out, making sure we had what we needed.  Michaela, our server was attentive and kind.\nThe atmosphere: hopping neighborhood vibe.  So fun.  Buzzing with humans enjoying good food and good company.\nLIKED:\nThe burgers. Classic yummyness. Same with the fries - classic pencil fries."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeU9YSS1nRRAB",
            "text": "Bernie's, a popular burger joint located next to McCarren Park in Brooklyn, is a must-try for any burger lover. With a bustling atmosphere and limited outdoor seating, expect a wait for a table, but it's definitely worth it. Their delicious burgers are sure to satisfy, and the overall vibe is energetic and inviting. Just be prepared for a potentially crowded scene."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMHBmV1dBEAE",
            "text": "Food was really delicious ! Everything was packed with flavor - GET THE CEASAR SALAD!! Best dish second to the vinegar chicken - really cozy vibes was a great time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd2FxTEtBEAE",
            "text": "Got there at 6 on a Thursday, waited 2 hours for a table for 2. Mozzarella sticks and ribs were amazing. Wings, burger, and ice cream sundae were fine. Service was great, and I loved the atmosphere, it was loud as hell so some people may not like that but I have no issue."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbm9UTUN3EAE",
            "text": "Been wanting to try this spot for a while! They don’t take reservations but you can join a waiting list in person. Arrived around 8:30pm on a Thursday night and got seated about 30-40mins later for 2. They have a separate waiting list for the bar but requires you put a card down. The atmosphere and vibe is top notch and feels like an old school ish bar. I heard the burger was incredible but thought it was a very solid 4 out of 5. The chicken parm was incredible and not as heavy considering it doesn’t come with pasta. Cesar salad was super good! Worth giving it a try if you live in the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkX2FQRXBnRRAB",
            "text": "What is there not to like about this place. Fall of the bone ribs. Best mozzarella sticks ever and don’t even get me started on the Caesar Salad. The fries are to die for. If you want to step out of you comfort zone (like I did) And try the Grilled Octopus"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd2ZHdlh3EAE",
            "text": "Bernie's is a neighborhood gem that never disappoints. The food is delicious, perfect for sharing with friends. The service is top-notch—every server is friendly, hilarious, and makes you feel right at home. And let's not forget the martinis—hands down the best in town. It's the kind of place you'll want to return to again and again, and I definitely do! People have stopped asking me what I did over the weekend because they know - I was at Bernie’s!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NktiU2FREAE",
            "text": "I can’t rate the atmosphere because we sat outside, although it was chilly. They didn’t have any tables available indoors. We had the shrimp cocktail, burger, wedge, Mozz sticks, and martini. Do yourself a favor and ORDER THE MOZZ STICKS. These were the biggest Mozz sticks with the longest cheese pull I’ve ever had. So delicious."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbjVxSndnRRAB",
            "text": "One of my favorite restaurants ever!\nEverything at Bernie’s is delicious and the quality hits every single time. My go-to is the veggie burger and you can swap out fries for a salad (the Caesar salad is so good!). Make sure you get there early as they fill up quickly! No reservations, walk-ins only.\nYou can never ever go wrong with a night at Bernie’s."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaU5ELU5REAE",
            "text": "Great little neighborhood place. Show up with your whole group, or you will be waiting at the bar. The food was delishious and the beer was cold. Staff was smiling and great. Love it. Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaUlyTkh3EAE",
            "text": "I went there Sunday just 20 minutes before they open and there was already a huge line, but we were able to get in when they open the doors. Everything is good just a little bit too pricey but the vibe is impeccable and the martini delicious. I would go back for a special occasion."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1Ni03b2FBEAE",
            "text": "This is an upscale version of Applebees but way better. Amazing food, great service. We started with mozzarella sticks, clams. And of course a burger. One Ceasar salad to share. We loved it and we will be back again for more."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSalppSDVBRRAB",
            "text": "I'm actually quite happy that Bernie's doesn't take reservations! On a packed saturday night we walked in and put our name at the bar while we got a drink and waited. We were sat in about an hour and had a great meal and time. It's very lively and has all my comfort faves. My only downside would be that prices felt high but I suppose that's new york for you.\nMust orders include the shrimp cocktail, mozzarella sticks, baked clams, cheeseburger, chicken parm, and brownie sundae :)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNGFUanVBRRAB",
            "text": "Tucked away on Driggs right behind McCarren, Bernie’s has an intimate 90’s local bar vibe with incredible dishes.\n\nThey do not take reservations, we waited around 35 minutes for a table for two. Well worth the wait. Once seated, the staff was attentive, friendly and helpful.\n\nWe ordered the wedge salad, mozzarella sticks and baked clams to start and shared the burger as our main. We finished with the brownie sundae.\n\nGreat date spot or just for a really good meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCaTZxU0ZBEAE",
            "text": "Great spot! They've got those mozzarella sticks you can only find at an ice rink. 🔥 Eggplant Parm and burger really good. Super nice friendly staff and bartenders. An excellent orange wine.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidWU2NlJBEAE",
            "text": "I didn’t make the reservation, but from what I heard from my friend it’s a bit of an ordeal to get a table.\n\nThat said, the vinegar chicken might be the best chicken I have ever had. It was so moist, the vegetables were deliciously unctuous, and the jus was just the right amount of sour.\n\nEveryone else at my table got a burger and loved them, but I think my dish was the real winner!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdGQ2OExnEAE",
            "text": "Staff mostly didn't seem to care about customer comfort. I'd stop in on a whim if nearby and space permitted, but other than that I don't see the point. Food was fine but forgettable. Good dirty martini, though."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxM3V2VVl3EAE",
            "text": "Bernie’s has all of the lived-in character of a classic neighborhood joint, with high quality food and ice cold drinks. The burger was juicy and flavorful and the fries were crispy. The Caesar salad was fresh and bright. The mozzarella…"
        }
    ],
    "reviews_count": 73
}