{
    "name": "Dar525",
    "place_id": "ChIJyaPHBE9ZwokRve8gtGX8BNo",
    "grid": "BK1",
    "address": "168 Driggs Ave, Brooklyn, NY 11222, USA",
    "rating": 4.7,
    "user_ratings_total": 518,
    "phone_number": "(718) 389-0003",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeGFVdE1XbVJoZFZndFNDMWxRM0Z6UWxCdFVrRRAB",
            "text": "Lived in Greenpoint for 8 years and always love Dar, especially their vegetable kabab platter (I am vegan). Went to their other location on 231 Malcolm and it was great too!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSmNtZEJaVkZtUzBGbVNXRnJPR2M1VUZwUlRrRRAB",
            "text": "Picked up food for the first time.   It was made quick without any long wait.  It all starts with the brioche bun which is perfection. Next, the scrambled eggs are a masterpiece. The fries and tomatoes and ketchup assembled with everything makes for what could be my new favorite breakfast sandwich."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsclYyaDVPWEZXWjFZNGVsOXhXbFpYVDI1eFRYYxAB",
            "text": "Really lovely quaint spot! We ordered take out and it was tasty. The service was what blew me away though. The guys were really friendly and helpful. We had a big catering order and they were nice enough to help me carry it out to the car. While I was waiting they offered water and I was able to wait at the bar spot. Very friendly!!! I would come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxblMybElZa1J1VVU1VldVeFZjMVpqVTNVMFlrRRAB",
            "text": "The portion is great. Falafel with tahini tastes great. The spicy dipping sauce has a hint of sourness in it and reaches a good balance."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaa2VqZGlRbDkzYUdwcFpHRjRTbUZUVEdoclEwRRAB",
            "text": "I must say Masood was amazing, food was yummy, served hot n fresh."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MWVtbEpYemhsZUdSaVdqQndUeTF5ZDNOMVoyYxAB",
            "text": "This was my first time at this location in greenpoint. I've been a fan of the WB location for years and years. The only thing I was sad about was the breakfast pizza was not on the brunch menu.  Other than that everything as always was perfect. Great job!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KR1N6aGhXVEpNVFVWUVowNDBNM2gxWjJoWWNXYxAB",
            "text": "The food here is excellent with beautiful presentation and large portions and the staff are nice and helpful. It’s very affordable too for what you get, so 10/10 recommend as a great spot for lunch or dinner in Greenpoint!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toemRrMTNTRVl0ZUhKR1RHcGlTMEp3WkUxVmFsRRAB",
            "text": "The tomatoes were the best part of the meal"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdVgyWlNaMlpmYTBoQ1NYcG9abU5TV1hCVFNHYxAB",
            "text": "Cute place, never busy, good food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cFlWSjBUREV5YkRWV2JtOW1ZM0JqWlVWSmJtYxAB",
            "text": "Fantastic food and incredible service. All the staff were extremely polite and attentive. Will definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWFpXMUNVbGh6YlMwdFQycDRWa3BvV21OSVQwRRAB",
            "text": "Everything was so good that I forgot to take more pictures haha. The strawberry lemonade though....superbbbb. and the trio meat thing...definitely recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NmNqUk5MV0l3WldWWFEyWXRRbVZHVjNRd2JtYxAB",
            "text": "Delicious every time!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkd1pFMUJPVlJPVFVwV1NsOXpPVUpSVlRaTFZtYxAB",
            "text": "Chicken bowl & falafel platter were delicious, flavors were on point and portion size is generous for both dishes. Loved the pickled veggies that came with the falafel platter and the texture of the falafel was great. Service is kind and friendly too! Will be back :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcUR5YkR2XzhtcVlREAE",
            "text": "Delicious, attentive service, affordable and lots of vegan options."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYVIxYWFjNmZhMVl3EAE",
            "text": "I ordered food from here yesterday as a part of a Meal Train for a friend who recently had a baby. She unexpectedly had to go to back to the hospital, which meant I needed help rescheduling the order.\n\nBecause hospitals are the way they are, my friend was stuck there all day. I think I rescheduled my order with Dar 3 or 4 times. Every time I called they were so accommodating and kind. They never seemed frustrated, and were always patient, and did everything they could to make sure my friend was fed.\n\nI am so grateful for their help yesterday. My friend returned home to a well timed and delicious meal. I cannot say enough good things about Dar's service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdWRuNnFWbHVPYWF3EAE",
            "text": "I was pleasantly surprised by the taste and quality of the dishes. Truly delicious and incredibly authentic. It felt just like a beautiful homemade meal!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZWtzNnVvaXVMM2hBRRAB",
            "text": "What a cute venue with a great vibe and super attentive staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLaWx5clhxNDhUOXlBRRAB",
            "text": "I had a chicken shawarma wrap that was delicious. I just wanted a quick bite and it was perfect."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbXBydEtCcl92UTVnRRAB",
            "text": "Cozy neighborhood gem with filling portions and a lovely vibe."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURva0lmME53EAE",
            "text": "We did the bottomless brunch on a Sunday and it was really fun. For $36, you have one main course and all you can drink Bellini, mimosa, sangria and beer. I think what made the difference is that the staff were proactive in pouring us drinks. Huge thank you to the staff, we shared a nice moment"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNzY3dTZRRRAB",
            "text": "Amazing meal! The food and service never disappoint. We got the mixed platter which came with so much food. So happy to have this place in the neighborhood."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNzRiMU9REAE",
            "text": "We had a wonderful dinner here! Amazing service, cozy, inviting atmosphere, and the food was excellent. An A+ neighborhood spot that never disappoints. Always a memorable time!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcjluSWJ3EAE",
            "text": "Don’t be fooled. The tagine is NOT authentic.\n\nNothing memorable."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJc19Lb0VBEAE",
            "text": "Tasty food, but bone chips in the kufta kebab. Please grind the meat with more care, as it's inedible to be chipping my teeth on small white bits."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNGZfU0RBEAE",
            "text": "Very cool newish neighborhood gem. Small and cozy place with really vibrant & relaxing vibes. Staff are really nice & patient. Great variety of menu options, authentic middle eastern flavors, many dishes to chose from,\neverything tastes delicious and super fresh. The full bar is also a great addition to the site makes your time there even more enjoyable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdG92d1VBEAE",
            "text": "This place is top tier!! Lunch specials are worth every penny!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOHA2dG9RRRAB",
            "text": "Authentic, homemade food. Excellent prices. Really nice server. The vibe is warm and exotic, even better at night. Kippe was tasty (but a bit too drenched in oil). Beef kebab was just right: perfectly seasoned, perfectly cooked. Added mousaka and it was more than enough for two people for about 50usd in total."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bzkzX0pBEAE",
            "text": "Old friend and I went out for dinner- two aps and two entrees. Wow! Such flavors, and cooked so perfectly. Plus the host and service were friendly, chill, and we truly had a great meal in a beautiful space. I hope this place stays for a long time!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneHFYeml3RRAB",
            "text": "Really delicious meal. The chicken soup is perfect. It’s very cozy inside so it makes for a great spot to catch up or have a cute date. The park is also a block away for a nice walk after. Highly recommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbEttUXZRRRAB",
            "text": "Best lunch specials mon-fri"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfODRfc21RRRAB",
            "text": "great neighborhood spot! delicious food and lovely service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaEp1cHlRRRAB",
            "text": "DAR525 is an absolute gem in Greenpoint, serving authentic Mediterranean cuisine with a unique Brooklyn flair. We stopped by for a late lunch and were blown away by the incredible flavors and stunning presentation of every dish. Highly recommend! Five stars all the way!\n\nThe vibe inside DAR525 is moody, beautiful, and effortlessly cool—perfect for a relaxed meal or an intimate dinner. The staff was super friendly, attentive, and professional, making the whole experience even better.\n\nHere’s what we indulged in:\n•\tTabouleh\n•\tM’subha:\n•\tGrilled Halloumi Salad\n•\tChicken & Rice Bowl\n•\tChicken Shawarma\n•\tBabaghanouj"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdk5fVDVBRRAB",
            "text": "Dar offers a Middle Eastern, Mediterranean-inspired culinary experience that seems to resonate quite well with local and returning patrons. It's been a while since i made my way back to this place, and I kind of missed it this holiday season.\nWhile the effort by the staff to deliver an authentic experience is evident, there are several opportunities to elevate the dining experience, starting from service to the food itself.\n\nAt places like this i almost always order the safest choice - a signature shawarma dish. If they can get this one right, the rest should easily follow.\n\nAnd so it was. The choice of a small and shallow rectangular plate to serve chicken shawarma is a commendable attempt at modern presentation, but it falls short in execution. The arrangement of food felt overly crowded, detracting from the visual appeal and elegance of the dish. Opting for a larger, round, or oval plate would allow the different foods to \"breathe,\" creating a more inviting and refined presentation, and dining experience.\n\nYes, it was a cold January day, and the food being served at a cooler temperature significantly detracted from the experience. Chicken shawarma and jasmine rice are dishes best enjoyed warm and aromatic; eating it at cooler temperature diminished and muted their flavors and depth - which was a notable letdown. Shawarma, in particular, is known for its bold and intricate seasoning; the one served was underwhelming, leaving the dish feeling one-dimensional.\n\nThe sides of hummus, baba ghanoush, and garlic whip were creamy and well-prepared, but their robust flavors overpowered the more subtle chicken shawarma. Sides should enhance and complement the main dish, yet here, they competed for attention rather than supporting the overall harmony. Furthermore, the pita bread, served cold, fell short of expectations. A warm, soft pita would have provided a more cohesive and enjoyable experience.\n\nIn conclusion, while the dish was almost visually appealing, it missed the mark on several small but critical details: wrong plate size, cooler food temperature, seasoning, and balance. Addressing these elements could elevate the meal from a good attempt to an outstanding dinning experience, transforming what is almost authentic into something truly exceptional. Locals would love it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmb3R6QTl3RRAB",
            "text": "Love this restaurant! Reliable for lunch and dinner. Great food and cocktails, with some fun happy hour deals! The Mezze platter is always a go to."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmM1BqX2tnRRAB",
            "text": "Food is delicious. I’ve been there a few times and never had any issues. It’s a cute place. So, why the one-star rating? Well, on January 3rd, 2025, I ordered the veggie kabobs platter and ended up getting food poisoning from it. Im writing this review from my bathroom so please eat at your own risk!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NXY3Tmt3RRAB",
            "text": "Mediocre food. Just tasted like mass produced food items heated up."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdTc2bnBnRRAB",
            "text": "Very good food. Very authentic, Mediterranean, good service, good desserts. Very reasonably priced. I'll definitely be returning here again. You got to try it."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQOWZMeHh3RRAB",
            "text": "My favorite local restaurant by far. Consistently fresh, delicious and fast. Family run, good vibes all around."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNud1p2N2tnRRAB",
            "text": "We loved loved loved the food and atmosphere. The food was\nso tasty -We ordered 3 dishes to share and it all was delicious. The spiked hot tea was great. All in all this is a real gem in Greenpoint."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQanZpNXBBRRAB",
            "text": "I got the chicken tagine and it tasted off so I only had a few bites. I didn’t say anything at the time because I figured I was just being picky, but then later I got sick with food poisoning"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMElPMlZBEAE",
            "text": "Their pistachio flatbread is beyond delicious, and the stuffed grape leaves were the best I ever had. It's a beautiful little restaurant with a European flair. The service was wonderful. The restrooms were large and clean. It's a gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNU11eDNRRRAB",
            "text": "Everything was great about this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeWR5ZVN3EAE",
            "text": "Love this place but main waiter sold us 3 glasses of wine on a Thursday for 15 each when the bottle of 55 is 50% off. Williamsburg location has honest waiters."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYa3ZQRTVnRRAB",
            "text": "Ordered takeout and I requested for the vegetables to be taken out from their chicken wrap when I opened it up all the vegetables were there. It wasn’t really a hard request - waited 30 mins just to be disappointed with average food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuXzgzb0F3EAE",
            "text": "Wonderful experience; delicious food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNm9DSWpnRRAB",
            "text": "I used to live right next to the Greenpoint location for years and I would frequent there for so many dishes but I am compelled to leave a review now because the service, which has always been great, was outstanding tonight. I have since moved out of the delivery range but still order from Uber eats. There was an issue with the app as it had changed some details and it looked like I couldn’t get it delivered but the manager (Ala I think) went above and beyond to help me. We eventually found a solution but he was so kind and so helpful. He worked on this issue for at least 20 mins all so I could have my favorite chicken soup. I’ve never had anything from I didn’t love."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbE51MDV3RRAB",
            "text": "The best chicken soup in town!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NS02WEhREAE",
            "text": "Favorite place in all of Brooklyn to have brunch been going here for over 8 years ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMkxpanFRRRAB",
            "text": "Amazing food! Even better service! 10/10 can’t wait to come again soon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINFB1V2lRRRAB",
            "text": "Love the food and the servers were very attentive to us. Such a great vibe in there!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd0k2UElnEAE",
            "text": "What a wonderful delicious experience I had at Dar 525!! To start I had the Syrian Rolls.  Though I knew it would be to much food I ordered the Dar mixed plate so I could try multiple items from the menu (Chicken Shawarma, Kafta & Lamb kebab)!! Beyond excited to have leftovers because it was amazing tastes to the pallet!! To take home but not without giving a small taste first I got Basbousa & Baklava definitely not making it home!! The food wasn’t the only thing fabulous truly the service by Mazen and Sherif was absolutely superb! Eating solo allowed me to observe them and though they were busy they gave such adequate time and attention to each customer! The Kitchen does an exquisite job presenting the food as you can see in the pics minus the one missing roll that i jumped on before grabbing a pic!! I eat to enjoy food and this was truly an outstanding experience!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMazRfMThRRRAB",
            "text": "Fresh, delicious and authentic. What more can you ask for.  Beautiful menu. And they  serve between traditional lunch and dinner hours. Perfect after 18,000 steps of walking around Brooklyn."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCemZIbWFREAE",
            "text": "Really wanted a burger. The Dar Burger delivered. Ok so I walk by this place all the time and from the outside it simply never seemed appealing as it’s pretty dark and gives off a bar/pub vibe. It decided to come in and the low lit space is pretty with dark blue walls and brick accents. It is not what appears to be from the outside. I ordered the Dar burger which is a house blend with lamb. Being that I love lamb and this is a Mediterranean spot it fit and it was delicious. The bun held well, the flavor, the aioli, the feta along with pickled beets and pickles were just a great combination. The sweet potato fries were perfect and crispy on the outside. The service was great. I can’t believe it took me so long to come in and will be back to try more items."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHX0xidTZRRRAB",
            "text": "One of the nicest meals I’ve had in the past couple years. The ambiance is perfect, the decor is gorgeous, the people who run it are so lovely, and the food is divine. We ordered a messed sampler and kibbe. Every part of the dish was so delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cUx6ZWF3EAE",
            "text": "I really hate to do this but this needs to be addressed. The pricing is unreasonable for some of their items. I ordered a Sheppard salad which cost $9. The container was half the depth of my finger and had one solitary olive. I called because I thought I made a mistake with my order - but the person I spoke to confirmed that indeed this tiny salad was $9 - even he agreed that it was expensive for what is given. Very disappointing and unreasonable."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbDltTkV3EAE",
            "text": "Went here after Italy beat England in Euro 2020 finals and it was 5 adults and our 22 month old. At around 6:30 pm the place was relatively busy and outdoor setup is pretty good. We sat outside in one of the exclusive outdoor booth. From seating perspective, my only suggestion is I wish they do something about mosquitoes which constantly kept biting me.\n\nFor Tapas and Dips, we got the Muhamara ($6), Batata Harra ($6), and Pan Fried Cauliflower ($6). For mains, I got the Veggie Pita Wrap ($9). Food overall was absolutely fantastic and is perfectly priced! The Pita wrap is on a slightly thicker side, that's my only criticism.\n\nSpecial shoutout to Elsa... one of the cutest hostess/staff we've ever seen. A single dude in our group totally fell for her!\n\nService was excellent and our excellent food arrived within 25 minutes of ordering."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtcjZ5LUh3EAE",
            "text": "Great restaurant with a Mediterranean vibe. Dimmly lit, cozy. With Turkish lanterns. Great to chill with friends. There's a bar. Staff are very attentive. Food came out very fast. Had the kale and Fallafel bowl. It was excellent."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMlpPSVJREAE",
            "text": "Our experience having dinner here was great. Price was reasonable, the portion was huge, and the staff were kind and friendly. Although there are things can improve, still recommend the place. We ordered the 🌟5 dips, the falafel platter and the two dessert baklava and basbousa.\n\n🌟highly recommend the dip! And just get 5. My favorite was 🥔Batata Harra, the potato. It came with pita bread and the price was really friendly. Although the pita bread was too thin and not that chewy enough for me, the dips were amazing, you can even save some to eat with rice from another dish.\n\nThe falafel platter was huge, and I liked the rice that came together a lot. Well flavored. The hummus was great too. We added the lamb kebab on the side. A little bit too dry but the cucumber yogurt sauce was good.\n\nThe things that I will not recommend are dessert. Baklava was soggy already when it was served. And the taste of basbousa was a little bit dull."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdGZxU0tREAE",
            "text": "Absolutely exquisite meal from start to finish. Literally amazing authentic food, great ambiance, and kind servers. Will be back! Thank you!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaVp5dDVnRRAB",
            "text": "My favorite place in greenpoint!! I always get the falafel and beet bowl & a kafta kebab. Their mezze plates are all to die for, all dishes are extremely fresh, they have vegetarian options, are fairly priced, and the service is impeccable!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMmFDRWZnEAE",
            "text": "The menu has so many incredible gems anytime of day. To-go or eating in, the portions are huge enough to share. Mazen is so hospitable you’ll feel like you’re at home sitting around the table with friends. Highly recommend Syrian rolls."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwdE5UYTN3RRAB",
            "text": "I only gave 4 stars because a burger and fries is $13 & it doesn’t even come with a can of soda.\nThe food is well prepared, presented properly and on time.  This is my 2nd time ordering.  I like it. I had the Dar Burger & sweet fries."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPcUpLMTlnRRAB",
            "text": "Looking for a quiet Saturday dinner with some great flavor.. Dar 525! Wanted something different for dinner and stumbled on this place through my impeccable google searching. Upon arrival the music set the whole atmosphere for dinner. The staff were super attentive and made the experience that much better.\n\nNowww the food!\nStarted off with Batata Harra and pan fried cauliflower.. as per reviews. Seasoning/ flavors on point. Everything was served in minimal timing as well.\nFor entrees Lamb platter and chicken kebab platter! From the hummus to the pita every thing meshed and ate very well. I left feeling very pleased with my choices. If you want something homey and flavorful .. it’s this place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4LU9XZmhRRRAB",
            "text": "Delicious food with a fun atmosphere. Staff were all extremely friendly! Great customer service. Highly recommend"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMEpPdU1BEAE",
            "text": "This is an amazing place! Delicious food, very nice atmosphere and not crowded (at least not on Sunday afternoon). The prices are good, food is authentic and even hummus seems to be made here. There’s happy hour from 12pm to 7pm, during…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzbzdhN1pnEAE",
            "text": "really yummy food and the service was great. Cocktail menu was on the smaller side and mostly Prosecco based. Really interesting imported beer menu. The atmosphere was also very nice, and deceptive as the outside looks just like a regular bar!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cWQyTnN3RRAB",
            "text": "I ordered the Mediterranean breakfast for Sunday brunch. Left feeling very full and satisfied. Food is spiced and flavorful. Nice brunch spot by McGorlick Park in Greenpoint with south Mediterranean-style decor"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtb19iWE13EAE",
            "text": "Enjoyed my lunch 🥗 special. It was a lot of food for one so now I have leftovers for tonight. The food was tasty and the server was very helpful. I will certainly come back when I am on this side of the town…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MHJxOF9BRRAB",
            "text": "Ordered the lamb platter for takeout. Got cold food and the worst cuts of lamb I’ve ever had. It was mostly fat and cartilage. See picture attached. $30 for this garbage."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMTVYMEdnEAE",
            "text": "Great food. Brunch specials really good. Excellent place"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpaHZYaVdREAE",
            "text": "My friend and I got the chicken shawarma and kafta kebab platters which were both delicious. Their desserts were amazing as well. We will definitely be returning!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdG9xVUp3EAE",
            "text": "Great food and service! We came here for brunch and it was yummy - I got the herbed eggs and merguez and others got the meze sampler. I saw some other diners got the breakfast pizza which looks amazing too.The bread is baked fresh to order and definitely a star here. Worth paying a visit here for any meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREc3FfTkR3EAE",
            "text": "My partner and I have been eating here since we moved to the neighborhood. We love going for Sunday brunch and it is truly the best hangover cure.\n\nThe food is always delicious and more-so, the staff here are so kind and accommodating.\n\nThank you guys for being so lovely and feeding us! Highly recommend you go eat here. Always a treat to sit outside in the sunshine and dip into some hummus."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4a2YtSmJBEAE",
            "text": "It’s hard for restaurants operating during COVID but Dar525 is doing an awesome job. Lovely outdoor seating. Servers wearing masks and being respectful of distance. Delicious food and grewt prices. The portions are really big too. Our bill for two at brunch with drinks and food was 40 bucks. Will definitely come back. Thanks!"
        }
    ],
    "reviews_count": 74
}