{
    "name": "Breeze",
    "place_id": "ChIJayMXxXBZwokRq41Uj462dS0",
    "grid": "BK1",
    "address": "595 Manhattan Ave, Brooklyn, NY 11222, USA",
    "rating": 4.8,
    "user_ratings_total": 439,
    "phone_number": "(212) 718-0797",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eVFqbE5Vbm8yY0dKT1NUZGxOa2R3Y1ZkRE5HYxAB",
            "text": "Delicious food, cool Greenpoint vibe. Anything with more than one pepper next to it is going to be SPICY, but worth it if you can take some heat! Cumin lamb and soup dumplings were incredible and everything came out quickly, but we never felt rushed."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMk5tbFZjRjlpY0d0d1kxQlljMDlZV2xwRGFFRRAB",
            "text": "This place is so underrated with a beautiful atmosphere and some of the best Szechuan food in the neighborhood. So many incredible vegan options and the happy hours is a steal including both alcohol and some dim sum plates. Sesame cold noodles and mapo tofu were standouts. The non vegans also loved the pork soup dumplings and duck bao."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaVIzbG1XaloxUkdsWVRqSldYMFZZTTBOZmNWRRAB",
            "text": "The dishes taste very artificial (the same taste as from instant food packets), the cocktail was too sweet.  Both the dishes and the drink came out super fast, which could be a sign that they are premade.  Service and vibe was enjoyable for young crowds.\n\nTake this information as you will,"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdFowSnNNRVZpU1hONmNFTnRhMmN3V2xWRVMyYxAB",
            "text": "Amazing experience. Noah and Chris were amazing. Everything was amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZM09HaFRhMFJzTmxkbk1tUkdTR3RUTVhsemQzYxAB",
            "text": "Came here for my anniversary dinner and was blown away by Breeze (pun intended). Easily some of, if not the best Sichuan food we’ve ever had. I got the Winter Frost #2 cocktail and I wasn’t sure what type of flavor I was expecting but it didn’t taste like what I expected in a good way! The cocktail had a mildly sweet, light but depth in flavor profile.\n\nThe ginger sauce green beans were some of the best green beans I’ve ever tasted. The sauce they used was addicting. Second favorite item was the diced chicken with chili pepper, which was super spicy but absolutely delicious. But to be honest all of the dishes were home runs! I was just here last night and I’m already daydreaming about coming back to try more dishes.\n\nAlso the service was exceptional. The restaurant was full and there were only two guys to cover the front of the house (the hostess, waiter, bartender, and bus boy). They definitely had their hand fulls but still were efficient. Since it was our anniversary dinner they ended up surprising us with a pumpkin rice cake dessert on the house which we thought was the sweetest gesture. I couldn’t have been happier since I absolutely love rice cakes 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taclFqSm9kVTFJTFZaME1uVk9OMjF6Y1ZOaGFuYxAB",
            "text": "I’m very happy I chose this."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WlN6QTFkVVZJYW5wNVNtcENhbGhCVWt0ZmMxRRAB",
            "text": "good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTGVrMXFNVGgwTFRoMWEwSjJka1ZVVldOcVVIYxAB",
            "text": "Amazing!! Allen was our bartender and he explained how he came up with the concepts for the drinks, they were incredible, as was the food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVemFWRkliRkpuY3kxdWJVNDFUMFpMV0UxcU1IYxAB",
            "text": "Best Sichuan in Brooklyn! The food is truly fantastic. I’ve ordered from Breeze many times, and it’s always delicious, never disappoints."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214a2FGUmtaR1E0ZFZJeGQyVXhXR2d3VFhKVlZVRRAB",
            "text": "this lunch deal box was magnificent!!! so much food and delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVU9WOHRhbWw1VTNsVVdtTlpSV0pSUTBaVU0yYxAB",
            "text": "Came in with a bunch of friends when they're closing and one of the best Brooklyn nights I've had. Food is amazing and people made it even better"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzdFFuVTRiRzlVYkdvelJHZFRiRkl6TVhOaWNXYxAB",
            "text": "Beautiful spot. Excellent food. Generous with the tea refills. Kind staff. I highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUmJFOHdhM1l3VW1GUVQyZ3hiVlZFTVVVM1IxRRAB",
            "text": "Best scallion pancakes in nyc"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcWNHNUdhM1ZNWjNsb2FWUjRVRjlwUm5CUlFYYxAB",
            "text": "Tasty food and nice ambiance. Good spot for larger group dinners too"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMVdqSklaelZsWW5WS1MwYzNhbEZaV1VGS1IwRRAB",
            "text": "Spontaneous choice as the restaurant we tried going to didnt have any tables. I would be upset if we didnt ended up here. Every food dish was really good. Mapa tofu, soup dumplings, lamb chop, chicken dish i forgot the name of"
        },
        {
            "date": "3달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1c2IwNXJhM1JDU0hsM1JFUlNWMnBJTUdRelRFRRAB",
            "text": "調酒好讚！食物好吃！音樂好聽！氣氛很好！"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNGFuUjJhVkI0WjFKSlNrMWlTRkJ0Y0ROS1NVRRAB",
            "text": "Really great Chinese. The Kung Pow Chicken was more flavorful and rich than I've ever had before. Shredded beef & chilis were awesome.\n\nAnd holy cow, try the espresso martini. The earl grey infused vodka is an amazing touch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1ME5rSlFkMkpVYmpGdGJFbE1WWEZmZW5CTFExRRAB",
            "text": "Amazing happy hour that runs from 12-7 all week! The prices are very reasonable and the cocktails are incredible. The food options are also really good and reasonably priced."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bmRtSm5iRU14TW1jemNraEtPUzFHVVhrMGFuYxAB",
            "text": "The food was immaculate. We celebrated a birthday and they surprised us with a sweet, that was discounted from our bill. The music was also good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdFZFcG9ia1pwVmtKaWFtTkJjWFJ5V1d0bVRsRRAB",
            "text": "Perfect date spot, the interior is quiet and stylish and the general vibes are peaceful and relaxing. We had the cold sesame noodles, dan dan noodles, pork soup dumplings, wontons in chili oil, scallion pancakes and the kung pao chicken and everything was incredible! I really wanted to come back after last time and I am so glad I did. My friend loved the orange wine as well. Can't recommend enough! Would also recommend a res if you are going on the weekend the seats can fill up - rightfully so!"
        },
        {
            "date": "3달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbWIxOXhabGhDWWpaQlNuRndZV2RYVHpCRmRGRRAB",
            "text": "烤鱼特别好吃，环境幽雅。"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVk9FSXlObVV4UzBkR1FuSktZMWcyVVhGMmIyYxAB",
            "text": "I honestly don’t have words to describe the flavor at this place. Breeze is hands down my favorite spot in the neighborhood. Every single dish I’ve tried has been absolutely delicious.\n\nThe Mapo Tofu is a solid 10/10, the Pork Ribs with sliced potatoes are flavorful and comforting, and the Tomato Curry with Tofu… my god. It’s one of the most delicious things I’ve had in a long time. The more I eat, the hungrier I get every bite just makes me want more. It’s a full-on umami bomb.\n\nThe vibe is great, the service is fantastic, and honestly, you can’t go wrong here. Whatever you order, it’s going to be amazing.\n10/10."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201eFdqbG9WWGg2WkVFMmNuYzBTM2N6WVRSaFJFRRAB",
            "text": "Time of meal: 7:30PM\nParty size: 3\nHow hungry I was: 7/10\n——\nMouthwatering chicken: 7/10\nCrab tofu: 5/10\nEggplant with garlic: 8/10\nDiced popcorn chicken with chili: 9/10\nValue (price): 5/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOS00wUnFhMjEzWVdsalNWQTRPVVozWlZjNWNHYxAB",
            "text": "Was my first time here. I tried the Winter Frost cocktail. Delicious! 💎"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScmEyTlpaRGhLVGxCRE1UZHVVMXBQV2xOVGVXYxAB",
            "text": "Stylish and minimalist place with truly delicious food. The dim sum we had all came out very good. Our server was exceptionally attentive and friendly. It wasn’t busy during lunch which allowed us time to enjoy food and catch up."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZeU5sbFVZVVpQWW10Mk9EZ3phMTlaZEU5RlNtYxAB",
            "text": "Extremely good food and large portions. We ordered additionally duck to share but this was definitely too much."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaWRqVjVUMEkyUWxsUFIzVm1kazVOY0U1dVVVRRAB",
            "text": "This place is AMAZING! So happy we found it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcmJ6cXlDbzZEWUxBEAE",
            "text": "I’m still thinking about the Sweet Plum Pork Ribs. Sooo good. The Spicy Cumin Lamb is not for the weak. The SPICE IS THERE, but it’s hard to stop eating once you start.\nDef a must try. Service was a 10/10. This might become a regular spot for me."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SZlNIbzFibFJ1Tm5CRlgxaDVRakpGUkhKVlYyYxAB",
            "text": "Our favorite Szechuan food in the area for both dine-in and takeout.  Eggplant and dan dan noodles are amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKbnRtZTJlcHZPUndnRRAB",
            "text": "Delicious delicious pork soup dumplings, will return to try more!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMWFqUTRhREY2VjJrNFJYTjFUbVpZWHpsd1lrRRAB",
            "text": "A year later and I’m still thinking about the Dan Dan noodles"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQTFl5NkR5MFoyMHdBRRAB",
            "text": "Everything was fantastic! Great food, affordable considering today’s prices everywhere, and staff was friendly/on top of things. I appreciate the pepper scale of spice on the menu as I like spicy food but the person I was with is less of a fan. Don’t skip the mouthwatering chicken. YUM."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM2FqZHpPVkZoTVZGemVHWXlWRnAyTTA5bk5XYxAB",
            "text": "Good quality Sichuan cuisine, every dish was great, and the ambience was nice too."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPNnFrOGU0dnBUTTZnRRAB",
            "text": "Their food is so good. My partner and I got tricked with 4.5+ star restaurants in NYC multiple times with bad food, but Breeze is not one of them.\n\nWe had siu mai with duck egg yolk, which had sticky rice, and it was full of flavor and had great texture. We got crab tofu and spicy and sour fish stew. Two spice levels were quite spicy for us (even though we usually handle spice quite well), but still very tasty. Their cocktails are very good as well, especially winter frost."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSWEzZ3hSVVZrWm5wMlRWVXhNVlp4VkZOS00yYxAB",
            "text": "Great food, atmosphere and service. Great for dates and also hanging out with friends. Lot of bars nearby to pop out to after."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNcnBfWS1tcC1mRTBRRRAB",
            "text": "The restaurant offers solid Chinese food, though I'm not sure how authentic the Szechuan flavors are since most traditional Szechuan dishes are known for their bold spiciness.\n\n- Winter Frost #2: The winter melon tea brought back nostalgic memories for me. It was enjoyable and refreshing.\n\n- Crab Soup Dumplings: These were unfortunately underwhelming. The dumplings had barely any soup inside and were quite dry, which was disappointing.\n\n- Tea-Smoked Duck: A strong contender! The duck was juicy, flavorful, and a satisfying choice overall.\n\n- Shredded Beef with Green Chili: It was good, but not outstanding. Despite requesting extra spiciness, the heat was missing, which was a letdown.\n\n- Pumpkin Glutinous Rice Cake: A delightful surprise! The flavor was balanced and not overly sweet, making it a standout dessert.\n\nI would definitely return to explore other offerings on the menu, as there are plenty of intriguing dishes to try. Service was excellent!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPdkpnNDJzNzdpUnJBRRAB",
            "text": "We got there at 8.30ish on a Sunday.(3ppl)\nLast call at 9.16 (restaurant close at 10pm)even before we get the last dish, smoked duck got served with 4 buns so I ask for 2 additional and the answer was negative. Unfortunately 6 deliveries went out after the last call and a cup of rice was served to the table next to us(probably friends of the manager).\nFood is good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKVFpvOTdIZ2I3MVp3EAE",
            "text": "Service was rushed and poor. As soon as we arrived we were told we had an hour and 15 minutes before they needed our table back. When I pointed out that their website said an hour and a half they blamed it on a different server overbooking the restaurant but refused to do anything except maybe let us sit at the bar after.\n\nFood was very underwhelming and inauthentic. Barely any szechuan peppercorn flavor or spice. Cocktails were all overly sweet."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMX21fdDZtbnFmYUFREAE",
            "text": "Perfect and authentic.   Highly recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKS0Y5T185eXJIbVVnEAE",
            "text": "Came here with a group of 6 people and we got to tried a lot. Highly recommend the Tomato curry, Dan Dan noodles and oyster king mushrooms. The vibes were really nice too for a summer night."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQXzA2ZEdLbTUzS0Z3EAE",
            "text": "Beautiful Place, lovely food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbVBrc1RJNExmVDB3RRAB",
            "text": "Best food we had on our girls trip. We went to a different well known and popular Chinese spot in Manhattan the day before, the food at Breeze was infinitely better. 1000% would be back again.\nTheir level spicy is real!\nThe aesthetic was also very chic and welcoming.\nThe playlist was *amazing*."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKdjRqYWE5bU5yM1l3EAE",
            "text": "I want to give this place a higher rating, but nothing was spicy! Ordered spicy dishes, they weren't that spicy, the sechuan peppers barely had any kick to them.…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQeml6Yl9DODRlVzR3RRAB",
            "text": "Alright hand-pulled noodles but the scallion pancake was so greasy it made me sick. Great drinks (very expensive though), skip the food. Much better options in Chinatown and Queens but the neighborhood is what it is."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd1lhbnpRRRAB",
            "text": "Sichaun place comparable to BoFA but feels a little more high end and the food a little better. Only complaint is that it is incredibly loud inside, like unusually so. But still one of my fave Chinese restaurants in New York."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJM1lIWDRRRRAB",
            "text": "This was my second time visiting this restaurant, and just like the first, I ended up ordering way too much food—even though I could barely finish it all!\n\nThe standout dish here is definitely the spicy bullfrog—it’s a must-try. Unfortunately, every time I go, it’s already sold out, so get there early if you want to try it!\n\nAnother dish I absolutely recommend is the Tibetan-style lamb chops—so unique and flavorful. And don’t miss the classic “fuqi feipian” (sliced beef and ox tongue in chili sauce)—it’s one of their signature dishes and insanely good.\n\nJust thinking about it makes me want to go back. Totally worth a visit!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaXZDRnV3RRAB",
            "text": "Amazing spicy cumin lamb!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJakpPaE5BEAE",
            "text": "Our favorite local spot, fantastic service, delicious food, amazing ambiance, we go there like once a week haha"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eUpMUTh3RRAB",
            "text": "Great happy hour and prices, portions are good for sharing"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3czdhS01BEAE",
            "text": "The crab tofu with salted egg yolk blew my mind! I love egg yolk, and this dish was perfectly salty and creamy. I didn’t taste much crab, but I didn’t mind it that much. The sweet and sour fish was also delicious, though I wish it had a bit more tang. The string beans were pretty standard. Overall, it was a great experience."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmenZLSWJREAE",
            "text": "Highly recommend! Better with a group so you can try more dishes. Everything was good. Also appreciate the accuracy of the spice level on the menu. 1 pepper is nice 2 peppers is heat. If you do not do well with spice then no peppers is for you. Staff is very nice and friendly. Want to go back to try more things."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdUs2M1FnEAE",
            "text": "Hands down, the best restaurant for Sichuan-style cuisine! I was impressed by the flavors and the presentation! The level of spice wasn’t much i absolutely loved the noodles even my mom that doesn’t eat spice food and she loved it! The ambiance is great also the drinks were so good! Highly recommend it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeE9UNGpRRRAB",
            "text": "Grateful for a decent Chinese restaurant that is clean and elegantly decorated. Tofu and chicken dish were very good. The beef stew was more of a beef soup and on the oilier side so wasn’t our favourite. Dumplings were pretty good. Would definitely return and recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbHFUZWlnRRAB",
            "text": "came here for a weekend brunch! we ordered their tea smoked duck, crab tofu - we absolutely LOVEDD this dish and devoured it 🤤, stir fry cauliflower, siu mai w salted egg yolk and dry pot ribs with potato salad! loved the ambience as well - super aesthetic and cute inside, felt super cozy as well. would come back again to try diff. dishes!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeE1iVkRBEAE",
            "text": "It was Christmas, and I was worried because I didn’t see a lot of Asian patrons. There’s a certain worry about upscale restaurants serving Chinese food to predominantly white clients …\n\nBut my worries were misplaced, because the food we ordered were, wow, so delicious. We enjoyed the fresh meet peach cocktail greatly, and the Sauvignon blanc worked incredibly well from the 口水鸡 to the lamb chops. The bullfrog was not gamey at all. And the smoked duck was well done. Highly recommend all the dishes in the attached photos.\n\nWould definitely come back!\n\nOh and please get the 酒酿汤圆, I loved the 酒酿and the sesame 汤圆was a great accompaniment"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNnUtbzRnRRAB",
            "text": "One of the best dining experiences that I have had in a long time . The atmosphere and vibe is so sinple yet so thoughtful going in . The decor is very clean and modern . The natural light from the windows and the beautiful lights inside are so pretty . And plenty of plants . I had the eggplant in garlic sauce as well as the scallion pancakes and that was one of the best eggplant in garlic sauce I have had ever . The seasoning was just so tasty . Scallion pancakes are always delicious . My nieces also had the pork buns, crab soup dumplings , fried rice with pork and fried rice with shrimp and they both really enjoyed their food . It’s a nice place to go with friends and family get a few dishes and try them together . Our servers were kind and attentive . I literally have nothing bad to say about this place . Keep doing your thang Breeze !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MUwyMG9RRRAB",
            "text": "the best thing here was cucumber salad. the crab tofu was good but not outstanding compared to many Chinese realstaurants that have this menu in nyc. The fish and dumpling was dissappointing it said the fish sauce is spicy bean paste which…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbi1ySnJnRRAB",
            "text": "Fantastic find for anyone into Szechuan cuisine. This place has a cozy feel , like you’re stepping into a traditional Szechuan teahouse. The menu is a mix of Szechuan classics and dim sum - a variety that caters to different tastes. I tried the Dan Dan noodles and the Tea-Smoked Duck, and they hit the spot. The flavors are bold and authentic. The staff are also friendly.\nWhether you’re a local resident or a visitor to Greenpoint , this Szechuan gem is a must-visit for those who appreciate the fusion of tradition and innovation in a culinary masterpiece.\n\nFeaturing\nDan Dan noodles\nChicken with chili sauce\nTea smoked Duck\nCrab Tofu\nSautéed King Oyster Mushroom\nFish Blossom\n\nDessert\nIce Jelly\nRice Wine Soup\n\nCocktail\nWinter Frost\nSummer Breeze"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqM0tPZ0NnEAE",
            "text": "Really good Chinese food, and amazing craft cocktails. We had the spicy bean paste fish and the crab soup dumplings. Soup dumplings were flavourful and freshly steamed! The drinks we tried were the Juno, Fresh Meet Peach and Winter Frost. Would come back just for the Juno, it was umami, well-balanced and just all round delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWOTdXTUhREAE",
            "text": "Had a friend recommend me this place for being the BEST sichuan restaurant he's ever been to and had to try it. Ended up coming twice in one week!\nThe decor is so clean and nice, the servers are friendly and the food is amazing♥️ I think the price point is so reasonable for the quality of the food too.\nThe Fish for Two dish is HIGHLY recommended and the Pea Shoots too! I seriously can't get enough of these dishes. Going forward, a little more variety in the cocktail menu would be nice!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabzlhN1hBEAE",
            "text": "Very legit sichuan food! We got stir fried pork with green pepper and pea shoots. Both are delicious. I wish the size of the pork dish could be bigger though.\nService is good and the restaurant is also very pretty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiaXNxWVpnEAE",
            "text": "We got the Stir Fried Chicken with Chive Flower and the Shredded Beef with Green Chili and it’s pretty easy to see why this place is so highly rated. The food was flavorful and satisfying. The service was quick and kind. The portions were on the smaller side but they didn’t leave you feeling overly full which is nice. The prices were more than fair. If you come very hungry be sure to order a few things."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbktDLTBRRRAB",
            "text": "Everything we got here was delicious and the atmosphere was warm and welcoming. Really enjoyed the chicken with truffle sauce."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIa2NiMTB3RRAB",
            "text": "Absolutely loved this place. It’s one of those spots you know you’re gonna come back to cause the food is excellent. So flavorful, satisfying, and comforting Szechuan food! Highly recommend the dan dan noodles and the kung pow chicken dish. Also their dumplings were fantastic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkZ2ViOWh3RRAB",
            "text": "Looking for traditional yet modern style Chinese food the Szechuan way? Look no further and stop by Breeze Hexu in Brooklyn. Wonderful friendly staffs greet you with a smile and explain their dishes while you look at the menu. Order some alcoholic cocktails, appetizing appetizers, delicious entrees, and a cool-you-off dessert to make a fabulous meal complete. Feeling adventurous? Try their warm cocktail called “Dance In The Heavy Snow.” Be warned; it may not be for everyone. The spicy cumin lamb is a must try. Not gamey and super tender with blasting flavors. Spicy and sour fish stew is also super appetizing. Feeling hungry now? Grab a table at Breeze Hexu and spice up your meal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWczhfdFV3EAE",
            "text": "Take out review!\n\nGreat taste, cumin lamb was exceptionally well made. Price point was comparable to Antidote and BOAF.\n\nFelt that the Dan Dan noodles were slightly weird and not enough oil/stickiness with them. Wontons also were just average, could have used more peanut sauce/flavor.\n\nKung Pao chicken was very good and had a kick w/o taking over too much of the flavor.\n\nWill do it again for take out if there is a takeout, a restaurant to explore for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOZ2JxaUpREAE",
            "text": "impeccable service and great vibes. but food was underwhelming, maybe it was just that night, but out of all the dishes we ordered, tea duck was dry, dumplings was no better than store bought frozen dumplings. shredded beef pepper was ok. overall wasn’t impressed, i’d give 3.5."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOHVXQkp3EAE",
            "text": "Breeze has one the best Szechuan dishes I’ve had in the Brooklyn area. I normally travel to flushing to get authentic dishes at a fair price. Breeze blows it out of the water with every dish they offer. A great ambience and excellent timely service. Should be packed daily, I tell everyone about this place. Highly highly recommend you won’t be disappointed.\n\nHave had:\nSoup dumplings with and without roe\nChili oil wontons\nDan Dan noodles\nScallion pancake\nKung pao chicken\nVeg fried rice *favorite over pork fried rice\nHot beef soup *Szechuan authentic spicy*"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNTZqcjJnRRAB",
            "text": "Breeze is hands down one of the best Chinese restaurants in Brooklyn! The dishes and cocktails are packed with immersive Asian flavors, delivering a unique and memorable dining experience 🤩\n\nThe interior is cozy and beautifully designed, making it a perfect spot for both date nights and gatherings with friends. The staff is incredibly caring and attentive, adding to the warm and welcoming atmosphere.\n\nEvery bite was a delight, and I can’t wait to come back with friends for another amazing meal 👏"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNEtIV1JREAE",
            "text": "Pretty recently opened Szechuan Shanghai fusion restaurant at Greenpoint, tried mostly Szechuan dishes this time. Chongqing chicken and beef in red paste stew could both use more heat. Fried rice and crab tofu were delicious. Tea smoked duck really infused smoky flavor. Whole fish could use a bit less sauce. Overallna great meal, looking forward to come back to try the dimsum side."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBN0w3TEtnEAE",
            "text": "Everything we got tasted great and well-spiced. Loved the eggplant, spicy mungbean noodles, and fried shrimp."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bU03UVZBEAE",
            "text": "Nice restaurant. Ordered crab soup dumplings, pan-fried pork buns, kungpao chicken, fried rice, and stir-fried cauliflower. Very flavorful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dGRmRHZ3RRAB",
            "text": "A true gem of Sichuan delights sending tingling sensations straight to your taste buds. A sultry and classy atmosphere perfect for a second date or surprise visit from your step-mom — the vibes here are top notch. Recommendations are the Ma Po Tofu (best in NYC) and Diced Chicken with Chili Pepper, both providing a one-way ticket to tingle town."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGOHBEeFJ3EAE",
            "text": "小籠包 had no soup in it. But the pork was good. 皮蛋 dish was good too, but overall the meal was nothing spectacular"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdFk2RUx3EAE",
            "text": "Great food, great service, authentic taste. They also give pretty big portions, it made the experience feel even more worth it. We had the salted egg tofu and the spicy beef soup. Delicious! Will be coming again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaGVtMFpBEAE",
            "text": "We ordered four dishes for three people & this was plenty of food! Each dish was really good. We recommend the shrimp fried rice. The interior was very clean & aesthetic. Service was great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcjh1REtBEAE",
            "text": "Ok you have to come here for the weekday lunch specials!! portions you can definitely get full on, at a very reasonable price. Dinner is pricier but still worth it for the ambience and attentive service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdUlMcTlRRRAB",
            "text": "Had a wonderful experience at Breeze. Sat at the bar with my friend, and entrees came out within minutes. The food was delicious and fresh. Our server Allen was incredibly helpful and warm. Will return soon! Thank you again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicjQ3eURBEAE",
            "text": "This is my favorite Chinese restaurant in this area (or maybe New York)! I have been there 3 times in the past month and I tried different dishes every time. All of the dishes are good! The environment is nice and price is reasonable. This is my go to place when I feel like to recharge myself and make myself happy with some spicy food! I highly recommend chili oil beancurd, spicy cumin lamb, dry pork rib pot with crispy potato, bean paste fish, string beans with minced pork and egg yolk 烧卖"
        }
    ],
    "reviews_count": 79
}