{
    "name": "Hide & Seek",
    "place_id": "ChIJ5x9XaIpZwokRl3nSTwXki6A",
    "grid": "BK1",
    "address": "593 Manhattan Ave, Brooklyn, NY 11222, USA",
    "rating": 4.6,
    "user_ratings_total": 182,
    "phone_number": "(917) 909-0670",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMFdtWXhOMnMzYzNOUmVIbHZiSEJFYjBjNWNYYxAB",
            "text": "Great place to hangout!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNk4zWkJaR1JJYm1oc1VURklaVUZhUm5WZlRuYxAB",
            "text": "One of my favorite spots to stop by for a coffee and work a little in the morning. Great service! The morning barista is the nicest! :)"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONlVqSTBZbVJQVlRoRFdIbFlXazA1ZURWMlpWRRAB",
            "text": "It would mean the world to me if you opened your coffee and tea all day so I can have some for late night work!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRk0zTnRaMnhDTmxSSGFUazJVbGhSVkRscVZrRRAB",
            "text": "love hide and seek! Cass was my bartender the last two times i've been and is so personable and attentive and makes a fabulous tequila soda."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MGMyTkNSbEZITUVNeVJrRjRRazVFZUdOeFpsRRAB",
            "text": "If you’re looking for a place to eat and relax, this is a great option! There’s also lots of natural lighting, plants, couches for lounging, and overall cozy atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsV05IaHlTVVoxV0UxRVRURk1iR1oyUWtKYWVGRRAB",
            "text": "I’ve been here on multiple occasions, not only for the incredibly cozy, laid back aesthetic and interior vibe, but for the duality of bar and cafe…That being said, the bartenders/barista really make or break the experience. There was a dark haired man with a beard, and glasses the first time I visited. He was welcoming, well-versed and very pleasant — a professional bartender. The second time I visited, a person with fair skin, tattoos, piercings and a cleanly-shaved head made me the most incredible iced vanilla latte in the afternoon.\n\nMy recent encounters have been far less charming. A blonde bartender with bangs incredulously eyed my id, muttered something under her breath, and then used a jigger to fill my glass of wine— nothing wrong with this except for the fact she under-filled the jigger each time.\n\nA similar experience I had before feeling the need to leave this review, the bartender with a short dark pixie cut chastised the patron before me for their lack of tip on one drink, and told them to order something cheaper if they can’t afford it—bad vibes! In hospitality you win some you lose some; chastising adults won’t make them more inclined to tip you or make them want to tip the next! I then watched as she also followed the blonde bartender’s suit and under-filled the jigger each time to pour my glass of wine. I guess you have to catch the right workers on the right days lol, it’s a mixed bag. Also no happy hour on fridays, instead opting for sun-thurs. Interesting.!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWWNtUnZWVUpOWW5jMVIwUnRXVTE0Wmw5ZlYxRRAB",
            "text": "The atmosphere is lovely and I’ve been here a few times, the atmosphere and drinks are what bring my friends and I back to this place. The first few times I came the service was good but last night, the woman working was someone I hadn’t been served by before and hope to not see again. Last night (Monday Sept. 29) I came with two of my friends and the woman working (young with blonde hair) was extremely rude. She was judgmental and made a snarky comment about our ages when checking our ids. She rolled her eyes when we were asking simple questions about the menu and just made it seem like we were burdens standing in front of her. We got some drinks and food then sat down in the middle area. Eventually she walks by us and drops and breaks a glass right by us and does not apologize even though it startled us and was maybe a foot away. Also I’ve had the food here before and it was good but after eating here last night I’ve been feeling unwell all night and morning and I’m not sure if it was food poisoning or what. I’m leaving this honest review because this is a fun place to go to with your friends or alone with a great seating selection and a great atmosphere but it would be a lot better with employees who are actually nice to guests."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BNFNuSk9kRkkwTVZOVlVsSkpVak5mY2tOVGJuYxAB",
            "text": "This place is different from others. Recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4ME1tZGFRbFpQZHpjd05HTnpha2xmWDJ4bVRrRRAB",
            "text": "Cass was an incredible bartender. Her customer service was amazing and her vibes were truly 10/10. Definitely looking forward to coming back here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CalZGQlVkVGxOZFd4RWFYVlhZMmMyVVhaWU9IYxAB",
            "text": "Racist establishment. Got treated rude! Hot dog place was welcoming but the people at this place was bad. I stayed iced an hour to wait for a seat. They let people that didn’t have reservations in before me. Then said because I’m by myself. When being by yourself was a crime or less paying. Yea avoid this place at all cost!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWFJsaHpWbXh0ZEhaVlN6Sm5aWGxZVjJST1ZWRRAB",
            "text": "I ordered an espresso martini with titos vodka. I can appreciate an espresso martini made with real espresso. The bartender was nice, the space is clean, and has chill vibes; I'd definitely come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RWNuSmFPRkJpVkdsemR6SjBjbU5YWVU5NE1tYxAB",
            "text": "One of the best cafes in the area. Good espresso and the atmosphere is eclectic, comfortable, and unique."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsV2VIUmFaRzlQV1RZMk1teE1jRGN0Ukc1T2RGRRAB",
            "text": "Love it. Everything about it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMk5EZE9aM0EwUldscFJIVndVVVpNTVY5cWEyYxAB",
            "text": "Best coffee shop to work at!!!! Or just sit and read! Incredible vibes and tons of games if you want a chill night"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RM1VWWjBUbTVsZGkxZmRsSjRXRkI0Vmkxd2NYYxAB",
            "text": "Awesome place too ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMk5IZDFNa0ZRU0dOR1EzRnVOMUY1YnpKa1gyYxAB",
            "text": "cass makes the best espresso martini."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214U2RXODRVekY0YTFCTmNFbEtNbWhSWmkxUFduYxAB",
            "text": "Came here many times, all the way from flushing to support a bar that used to be great. Tip every single time and the FIRST time I don’t, me and a friend are chastised for not doing so. A certain tall blonde bartender thinks they are deserving of 10-15 dollar in tips for 4 mins of work… interesting.\n\nAnyways don’t waste your time, so many other great bars on this street with people that really deserve a tip. “A bar” for cheaper drinks, twins lounge for tastier drinks and better vibes. Hide n seek is a hit and a miss unless you like watered down drinks then be my guest."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMllXeGtUVVEzY205ek16RlhkRGg2Y1VJeGRWRRAB",
            "text": "Cute and quiet place to sit and have a drink. Espresso martini was delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdUsxTHZJcV9LTUxREAE",
            "text": "Cozy cafe with lots of sofas and comfy chairs, it’s a lovely place to meet people, work or sit and read. Homemade strawberry and hibiscus iced tea was delicious. There was one person that appeared to be running the show on a busy Saturday afternoon but she was so friendly and kind despite it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMX1h0TTcwbk5PbWtBRRAB",
            "text": "Great place but the barista in the afternoon shift on Fridays (specifically on June 6. 2025) was extremely rude and so self centered. She made a mistake telling customers that were in the place for hours who spent like 70 bucks that the bathroom is for customers only. Then she proceeded to brush it off. She was also talking bad about the previous barista who was very respectful making derogatory comments about her sexual orientation.\nReally bad. At least do it in private.\n\nThe place overall tho is amazing. I’ll go back. It’s my favorite. Good food and good drinks."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLU2ExZWpxLUw3TDVRRRAB",
            "text": "10/10 iced latte - great service and cool vibe in there!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJSGc0c0Mwa042M2xnRRAB",
            "text": "Such a hidden gem, surprised that it is not way more packed - been here twice now and always has seating. Large space in the back and has board games. Cafe has lots of teas, coffees, sandwiches, salads, alcohol, etc. the sandwich and salad were incredible! (Kale Cesar & the turkey Dijon)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKdU1vTzNUbTU2aEx3EAE",
            "text": "A most excellent experience. It's large and spacious. Very good, coffee, food, and a vibe. Lots of room to work from, live jazz Wed evenings.\n\nPolite and friendly staff. Clean bathroom.\n\nYou can't go wrong. Look at my photos. If in the area looking for a work space or chill place. Well, it's right here. Highly recommended."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPaWRqcG11X0xQc3FBRRAB",
            "text": "A very interesting interior layout. Colorful. A bit quirky but in a nice way. The vibe you get is positive and electric. We didn't try the food but just had proseco and a cold coffee drink. Ambience was what brought us in. Really cool and staff is super friendly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMll1R2Z3EAE",
            "text": "Chill spot in Greenpoint with great coffee, tasty empanadas, and a cozy back lounge. Perfect for working during the day or hanging out at nigh, especially with DJs on weekends. Friendly staff and cool vibes all around. A neighborhood gem!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOE1pMGl3RRAB",
            "text": "I went with my wife and baby to meet our friends and their baby. It is a vibrant, positive space with enough room for both of our strollers without inconveniencing other patrons. I just ordered an iced tea, but the barista was very friendly. She was wearing a Blue Velvet cap and we had a brief chat about movies. We all had a wonderful time and will definitely be returning."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaDZuMzZnRRAB",
            "text": "How decorative this place! Come to try cocktail and enjoy the ambience!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMFk3ZDVRRRAB",
            "text": "We loved visiting here! The service was excellent. We went for a friends birthday and they ended up giving us a private room. Our waitress was very attentive and always comed in to check on us and asked us if we need anything. The cocktails and pasta were definitely delicious"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJd09LM0tREAE",
            "text": "The he go-to place for work, especially during non traditional hours or to hand out with friends, socialize, play board games and more. The space itself is huge, thoughtfully and beautifully designed. Great menu and they serve coffee through 4p. This is def my new go-to"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaHFybFpBEAE",
            "text": "Awful smell ruining the whole vibe of the place. Smells of deep fried food and very suffocating."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneXFYNjBBRRAB",
            "text": "Love the place. I'm happy I found it before home showings. I'd love to come back to work and evening to relax."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNjk2SkpBEAE",
            "text": "the most amazing atmosphere to work and vibe. glad i happened to just stumble upon it"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBeWEtMmtRRRAB",
            "text": "My friend and I cohosted a birthday party here for 40-50 people and it was so lovely! We were able to reserve space with a cash bar and no minimum, which we really appreciated. The space felt super cozy, the cocktails were great, and they…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMGFyNUxnEAE",
            "text": "I highly recommend coming here at night when they’re serving alcohol, it has an incredible vibe (and playlist) but visiting in the morning to get a pastry and coffee is just as nice! The seating arrangement can be hard to find an open and cozy spot, but it’s very homey and cozy! Great spot to grab a drink and chit chat with friends, and great prices!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMXZ5bF93RRAB",
            "text": "I've been here on a Friday night with a group of high school friends, there was no one there yet around 9pm and the DJ was playing early 2000 bangers bc he picked up on our millennial vibe. The bartenders gave us free shots for my friends bday and the vibes were great.\n\nI've returned during the day and had a nice latte, people were hanging out / co-working. Will definitely be returning!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBN09hNTd3RRAB",
            "text": "Cute vibe. Good beer prices. Nice live music!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfd2F1WW1RRRAB",
            "text": "Absolutely lovely place, staff are super friendly and kind. Will definitely visit again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfd2VPRWtnRRAB",
            "text": "Barista lady in on 1/16 was amazing!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbV9LdHNnRRAB",
            "text": "Cozy yet airy coffee shop where the vibes are perfect. 10/10."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNWRMZVJREAE",
            "text": "Closed when it’s suppose to be open."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2enNmVGl3RRAB",
            "text": "Great drinks, wonderful vibes, gorgeous interior, and very nice live music. Perfect for a chill study night or an intimate date."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzODlDcmlRRRAB",
            "text": "This is your ultimate 3rd space destination. I’ve never been so comfy hanging in a space. They have good food and drink for any time of day. I love coming here both morning and night. I have never experienced a space quite like it. The atmosphere is UNMATCHED"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeGR6MGl3RRAB",
            "text": "Probably my favourite café/bar in all of Greenpoint!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzLVpDa0dnEAE",
            "text": "Went to sip on some matcha here and do a bit of work on the laptop on a Fri afternoon.\nThe cafe is absolutely beautiful, there is flower like decor and a pretty couch area in the back and wall wooden shelf with plants. The service was also great and the barista was v personable. would definitely return if in the area!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaHVYVFVnEAE",
            "text": "The bar needs help! Extremely slow service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzckx6VzJ3RRAB",
            "text": "We arrived around 6pm to get some work done, and this spot has quickly become one of my favorites. It’s spacious, has WiFi, and offers a great variety of drinks, from coffee to cocktails. I ordered a hot cider to warm up, and it was so deliciously sweet. Plus, there was no line when we got here, so service was super fast. I couldn’t gatekeep this spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdU1IaW5BRRAB",
            "text": "Wonderful atmosphere and music playing - love the hanging plants and wall decor piece. Found this highly rated spot while visiting from Philly and it did not disappoint!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMklmZjlnRRAB",
            "text": "Very creative looking space — albeit uncomfortably overheated. Unfriendly barista wasn’t interested in serving us unfortunately. First attempt: Shirley temple — “we actually don’t have that” despite it being on menu. Second attempt: any recommendations for something similar: “No.” Third attempt: Hot apple cider - “I can’t serve you that because we don’t currently have the cider heated up, and I’m not going to heat more up. ” Cool, dude. I then asked him what he actually was currently serving and he became defensive and rude. We left."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuejl1STlRRRAB",
            "text": "Great music (though too loud); cute environment and decor; bad food and coffee, taciturn service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuanNyTGh3RRAB",
            "text": "Outstanding coffee and cocktails"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5cF9ieFNREAE",
            "text": "My favorite things at this spot were the artwork and the plants.  I didn't try the food.  I had a Hibiscus-Strawberry Margarita and it was 😋.  This is a good spot to work on your laptop.  It's a café and a bar.  The prices are okay.  I'm glad I checked it out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5M2FtUzF3RRAB",
            "text": "There wasn't much espresso options towards later the day ( cold brew container was low but probably had 2-3 glasses worth)\n\nThe decorations are on point! The place has a lot of real plants everywhere.  The couches were comfy( not sure how often they are cleaned but they didn't smell).\n\nThe tables by the wall had outlets.  The front of the place is more brighter while back felt more speakeasy.\n\nI got the detox juice.  It tasted like a typical green juice\n\nOn a week night, street parking was easier in comparison to the other parts of Brooklyn. I was able to park right in front."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MDlYZUtnEAE",
            "text": "Hide and Seek coffee shop is a great addition to the neighborhood! The massive space has beautiful artwork and comfy seating lining every square inch.\n\nThe staff is super inviting and friendly too, making for a warm and welcoming experience.\n\nIt would also make a great date spot in the evening since they serve cocktails too.\n\nThe americano I had was excellent. I’m excited to try the food over the next few weeks as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaGNqeExBEAE",
            "text": "I'm from Korea, and I couldn't pass by this café as I was walking down the street. I had a latte and a donut during the day, and it was really delicious. I plan to go back in the evening for cocktails or wine. The taste, the friendliness, the atmosphere - everything is perfect."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKanJyQzlBRRAB",
            "text": "Overall rating: 5\n\nI ABSOLUTELY LOVE THIS PLACE. I already knew I was going to like it because I’m a huge fan of 4,5,6. But I didn’t realize how much I was going to be obsessed with it.\n\nThe plants, the artwork, everything. I love that they have QR codes for each piece of art to find the artist. I love the space & greenery. I’m curious to see what it’s like at night,  but I’m very happy in the day.\n\nKnowing that I live in south Brooklyn and the hour commute it takes to get here, I will still be coming back when I need a new change of scenery. Highly, highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0NFlTNklnEAE",
            "text": "The most beautiful cafe / bar / lounge. A true Brooklyn gem. Coffee, food, and cocktails are good. Staff is fantastic. Dj rotation is on point. Game night is a vibe. Definitely a spot to put in the regular rotation. Doesn’t disappoint. Never misses."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcmRxRXpRRRAB",
            "text": "This place has the most thought out and interesting interior design I've seen in ages. Beautiful art throughout, comfortable and chill furniture and lighting, and the drinks! So good. It's also a cafe in the afternoon which I will definitely be returning to to sample their espresso."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbG91cmR3EAE",
            "text": "Literally the cutest cafe in Williamsburg! Beautiful spacious cafe with ample room for seats. A nice display of food on the bar counter. Art pieces with easy to scan QR codes.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdzVxOFdBEAE",
            "text": "Definitely the vibiest spot in Brooklyn. I tried their iced caramelLatte that was strong and delicious. The art is insane and also QR code to find out more about it! Plenty of seating and staff is friendly too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROcDZ6T0NBEAE",
            "text": "100% I’ll be coming back here ASAP. Atmosphere is immaculate, plenty of cozy seating, and great food + drinks. Staff is so friendly too!! Definitely a gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWOS0zZkpnEAE",
            "text": "Such a hidden gem! My favorite local bar going forward for sure🫶\nHip & artsy vibes, love the furniture. DJs on the weekends. The bartenders are super friendly and the cocktails are so good too!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUQ1MGZZSBAB",
            "text": "Baristas was super cool and drinks were wonderful. The vibes were perfect for chilling and working during a rainy day. It reminds me of the cool cafes in Copenhagen"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNXV2TEh3EAE",
            "text": "This place is just so beautiful . It’s fairly new and I’m glad I was able to go . It’s a cafe during the day and after 4 pm is becomes a bar but it’s a bar with plants and couches and beautiful lights and I loved it because I’m a person who doesn’t like stuffy bars and my back is on someone else’s back . You have individual couches like it’s perfect for someone who’s on the chill side . The music was impeccable and so chill and groovy I just loved it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dk9XcEJ3EAE",
            "text": "The coffee shop has a wonderfully atmospheric decor, creating an imaginative and cozy space for both work and relaxation. It's highly recommended for those seeking a place to work, unwind, and engage in conversations."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNE5UdGdRRRAB",
            "text": "This place is mad chill.\n\nCame in for a coffee and sat down for a bit. The ambience of the cafe is very nice with so much art and murals around the walls."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeXJTX09REAE",
            "text": "One of those spots you want to gatekeep cuz it's such a hidden gem but I love it here so much, I have to share and want them to thrive! I loveee the ambiance and decor, music and vibes. They serve coffee, teas, and unique + delicious cocktails which makes it a perfect spot to chill with friends or work from. **The cherry on top is that they're dog friendly (as long as they don't hop on the couches). :) One of my favs!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ejhiQnlRRRAB",
            "text": "The exact kind of bar I want in the world. Couches, plants, cool vibes, big space, great drinks & service. Very new spot and I haven't come by for the coffee shop work vibes yet but I plan to"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MEpLdlJBEAE",
            "text": "Very nice place. Been there in the morning, the food is very tasty... They serve excellent coffee."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkLXFfR0J3EAE",
            "text": "Looking for a spot to enjoy some excellent drinks, vibe out to great music, and be surrounded by a wonderful staff and great atmosphere? Look no further! This place has it all - come on in and see for yourself!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdXRldWd3RRAB",
            "text": "I love this place and the staff!! I’ve been here many times, solo and with friends.\n\nGreat place to do work, catch up with a friend, read by yourself. And it’s a community space so I’ve been to a storytelling event hosted here :)\n\nHide & Seek strikes the balance of being simultaneously stunning and cozy with its many couches, vibrant walls, and of course the picturesque backdrop with plants, lights, and more.\n\nI usually get the latte or cold brew, and they had this blueberry drink that was delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKODl1UFR3EAE",
            "text": "Best hang out spot ever I wanna live here and move in. You’ll have your greatest ideas and your most profound inner epiphanies by spending time on the couches and treasure chest ottomans in this immaculately artistic wonderland"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEb2ZqQzBBRRAB",
            "text": "One of my favorite places in Greenpoint. I've come here during the day to read and hang with a nice cup of coffee, and at night for a drink or two. The hibiscus margarita is my favorite!"
        }
    ],
    "reviews_count": 72
}