{
    "name": "Oxomoco",
    "place_id": "ChIJ__-z7kBZwokRezHqB39zBLI",
    "grid": "BK1",
    "address": "128 Greenpoint Ave, Brooklyn, NY 11222, USA",
    "rating": 4.5,
    "user_ratings_total": 2284,
    "phone_number": "(646) 688-4180",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWlpYZGlSRGRTYm5aMFZ6UjRNM2xDZWpKRGJtYxAB",
            "text": "Being my first time in New York City I was taken to a quaint little Mexican restaurant in Brooklyn. Now coming from Los Angeles where we have exceptional Mexican food all over the city. Try some outside of California is a bit of a treat. Oxomoco has some very good dishes on an elevated level. They use high quality ingredients for all there dishes lending to elevated taste. The fish tacos were great tender flaky fish with a nice not too spicy slaw on top. Chips and salsa that had multiple levels of heat you get five salsas to try. The crab tostada was nice a flavorful and the wagyu beef cheek were tender with a nice mole sauce. They also have a nice mix of tequila and mezcal drinks for you to choose from. The menu is small but has something for everyone. All the dishes we had were very delicious and the atmosphere was great. Indoor and patio dining is available. Oh make sure you make  reservations so you don’t have to wait if you want inside. If you’re in Brooklyn swing by and give them a try. You won’t be disappointed."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMlduRXhZMWxWYVY5V2FuYzRVMEpWU1VrMkxWRRAB",
            "text": "Always so delicious. One of my favorites!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONVRtWjZja2hFWlRSSVJIVTVka2hqYlRWbk0xRRAB",
            "text": "Big step down from a few years ago. Much more expensive and overpriced than before."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONFgzRnFla0U0TUhsSk5tVnpNRTVuTkZweFMyYxAB",
            "text": "Love this place!"
        },
        {
            "date": "1주 전",
            "language": "tr",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcFdFVlVOVlJXT1cxcFFsOVNjMGt0YldoV2MzYxAB",
            "text": "Michelin yıldızlı bir restoran tavsiyesi üzerine gittik. Maalesef rezervasyon talebi yoğun olduğu için pazar saat 17:30 a ancak dışarıda yer bulduk. Tabii ki dışarının atmosferi içerisiyle bir değil bu yüzden dışarıda yemenizi tavsiye etmem. Menü oldukça kısıtlı steak taco kötüydü et çok sinirliydi ısıramadım mantarlı rakı nispeten daha iyiydi. Tavuk efsaneydi ama fiyat lezzet dengesi kötü. Mutlu ayrılmadım."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NWRYUnNURWRHVFc4elNFTkNkVlJyVkRJNVoxRRAB",
            "text": "Food/Service was amazing."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcGRUaHdURWxyTWxwblkxQTJiSE5MYjB4ZldFRRAB",
            "text": "Nice place in a pinch. A little too foo foo or bougie for our taste and not a great menu selection. With that stated the flank steak tacos were delicious. The chips and salsa were anything but, its chips and sauces. It was different but very good.\nAll in all pretty nice place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUVVuQmphbEE1TUV4cGVsQldhRmROVmxsRFVrRRAB",
            "text": "I really wanted this place to be amazing - it just wasn’t. We had a reservation for 8:30 and didn’t get seated until 8:55. The service was honestly pretty dismissive and inattentive. When we paid at the end we felt like she just wanted us to leave and felt unwelcome. The food, however, was worse. The guac and caeser salad were good and we were excited for the rest of the meal. Sadly, we still don’t even know if the shrimp torta was good or not. That should not be a question. The tacos were okay but the flavor combinations didn’t make sense and simply didn’t work together. The steak was tender and the fish was fresh, but aside from that, there were no redeeming qualities. Overall, we have no idea how this place has received good reviews - let alone a Michelin star. Comparatively to other Michelin restaurants, this spot sadly is at the bottom of my list and we will not be returning. Again, we wanted this place to blow our socks off and left disappointed and unfulfilled."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSU9VMTBWa3AzVEdaa1dYSkhkSGxXZVRadWRYYxAB",
            "text": "Honestly not good or worth the money. We got seated 20 minutes past our reservation, the waitress was rude and seemed to not like our table and the food was average at best. My boyfriend and I were celebrating our anniversary and the waitress checked in on us MAYBE once and when we tipped 20% she gave us a “…thanks…” before quickly walking away. Totally set the mood of the night off as we felt like a burden to her. The food was alright, we couldn’t tell if we really liked anything which was disappointing at the price point and hype. The guac and salad were good, but the shrimp torta, steak tacos, and catch of the day tacos were just not. I don’t usually leave reviews but after +$215 it’s a huge disappointment to myself and my partner. Would not go back between the service and food especially at a Michelin standard."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWGIwaElTV0puVDNSRE1ubGZVR2x4T1hZMFZYYxAB",
            "text": "Best Mexican Restaurant in New York and with Michelin Star. Food and environment are excellent"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aM2FXY3hTVTFaUmtjMVkyVm9VaTFEY25GMVIzYxAB",
            "text": "Came with friends and was blown away by the ambiance. The lighting and ascetic was beautifully curated. Every dish was well balanced with incredible flavors and textures. The presentation was beautiful and the service was perfect. Dont skip on the desserts, well worth the indulgence. Oh and check out the bathroom, Disco ball!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUGRtbExSV05RZDJobmFIVTVNMDB6VDBwTE5tYxAB",
            "text": "Modern, elevated take on Mexican classics, this is a fun and vibrant restaurant for couples and big groups alike."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MWVUbGZMVVZXZEZoeFUwNVZNVVpqUVMxbUxYYxAB",
            "text": "Food was good, but restaurant was unable to adjust for spice levels. Lots of gluten free options. Too expensive for what it is - will not go back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dmRVcDFaME5CUWxwM2MybFhaVXR4VUhrdGRVRRAB",
            "text": "Amazing food and service! Highly recommend!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwT1VrRTJNMU4xVjJobFpWazJOekpDZURocFVYYxAB",
            "text": "Honestly, the food was decent, the manager ruined my experience, they refused service because I had 2 drinks prior. I wouldn't have minded but the bad quality of food for the price combined with the slow and unpolite service made me wish I went to a food truck instead. At least then the food would have been better and the service would have been more polite."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMUxYQTBSV2haTmxoa1MydGZSa2RWY1dWemQyYxAB",
            "text": "Continue to love this place. Great drinks and food!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Vd2JHZDBNeTFuY0daMllqbGpXRXhaVldKS2JGRRAB",
            "text": "Amazing food and flavors always! Love this spot!"
        },
        {
            "date": "2주 전",
            "language": "bs",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMGFFOXVRVkpsWkhreFFUQTFRVUowWVhWNVZuYxAB",
            "text": "Beef Welington je bio odličan sve mi se svidelo u ovom divnom restoranu"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSVdrZGZWRVZMVUhaRmFuQXllRTl2Y0cxQ1NWRRAB",
            "text": "I didn’t even get to experience the food because the attitude of the hostess was so rude that I decided to leave. When I arrived, I explained politely that the person I was meeting would arrive in 15 minutes and that I was totally fine waiting. I simply asked if I could wait at the bar. She said “no,” which I understand might be a rule — but the way she said it was unnecessarily harsh. It was just a simple question, and the tone of the answer completely ruined the experience before it even began. Sadly, I left without getting to try their food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214M2NWVlNhSEJYY1V0aVpsOXFTek5EUkhwTmJXYxAB",
            "text": "This was my first Michelin-star restaurant and what a gift it was. I’m pregnant and didn’t feel limited by the menu at all. The mocktail was dynamite, the crab tostada was out of this world. My husband and I came here for the cochinita pibil to recreate our honeymoon and it might have been better than what we had in the Yucatán. These were the best tortillas I’ve ever had in my life, and the pork was indescribable. Even for how good the pibil was, my husband still loved the kampachi aguachile best of all. He said “it’s like it was engineered in a lab to suit my tastes”.\n\nWhat a treat. Amazing staff. Cool vibe. 15/10"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCV1Eyb3RYM2wxUlZJeGJISjBSSHBSYlZkMFFWRRAB",
            "text": "Every day I think about the Tuna Tostada. I love it. Btw, service is great, good music and beautiful place to go with your friends."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVlZXTklTbWhxUmxkRVJXdFlZWHBUVmxKVFZHYxAB",
            "text": "Incredible!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNE1uSlhhMnBxYTJJd1NFeFBjVWt6VnpsM05sRRAB",
            "text": "Food is okay, but the overall menu didn’t create the wow - we want to come back effect we anticipated. Went with a group and tried a bit of everything"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WT2FqZFBZVkJhVkRkQ1VucFNOakUzYVY5ZmFIYxAB",
            "text": "Went to Michelin one-star Oxomoco last night. Affected north bk hipster service eg. Vague descriptions little attention. Forgot to remove dairy from one of the entrées and had to remake it. Then he told us there was another entrée that he had on hold for us that he was not sure if we wanted it now. This is after we had a full conversation of whether two starters tacos and an entrée was the right amount of food for us to have and he said it’s almost too much. Trying to push the $55 Carnitas entrée was ridiculous. Also ridiculous was to sell two Siete Legyas blanco tequilas on the rocks (which is a $49 bottle) for $21 per drink! And finally charging me $3 for hot sauce was petty.\n\nOverall a good restaurant, a fun, loud and vibrant place with tasty food, but not Michelin star worthy. I’d give it a solid 4.3/5 stars."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbmVXWnViRmRuUlVGWWNsTktXbXRhYWpaR0xWRRAB",
            "text": "The guacamole. And our server was very pleasant."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poclNGcEpVMHRSTjBwNGNIZG5TemhsUkRGWk1IYxAB",
            "text": "Fun lunch spot! Wasn’t “blown away” & feel disappointed when they won’t just give you a good amount of chips/salsa 😆. Overall food was pretty good! Sesame horchata was excellent. Would certainly try again!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUlVpMWZNM053Y2kxc04xUk5Wek10VjJkU1RWRRAB",
            "text": "I don’t understand how this establishment has a Michelin star. It should not.\n\nThe aggressively unfriendly service and taciturn bar is embarrassing to the treads of the tires who should represent the brand.\n\nI’d rather skid off the road."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taV01IaHRUVkJIUTNGZlNVRnFOVE5YWlZNM1JrRRAB",
            "text": "One of my favorite weekend brunch spots, & our server John’s was 10/10"
        },
        {
            "date": "1달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRlQwaGZZazlCTVhjNGNtdFBhMk5zTVc5bGFGRRAB",
            "text": "好吃😋\n就是排队有点久"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poc1ZtSlNUVk5SYTA5NU5WQmpiRVpDZUdOVldXYxAB",
            "text": "This experience eats like the most authentic Mexican resto in NYC. Food was simultaneously inventive and traditional. However, the vibe kinda threw me: so laid back there was barely a pulse. I’m down with casual, but between the roll-out-of- bed t-shirts and the air of indifference the staff, while kind, distracted from the overall intentionality and precision of the cuisine. The owner on site didn’t seem to mind. So while the food is exciting, I just wish the vibe matched it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eFlrbFhkM1UwYm1NeFIwMTVkQzFUTUdkWWNHYxAB",
            "text": "Fantastic experience.  The food was phenomenal, the service impeccable.  Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bGJuaFNUV0l5UjIxbmNUQm5UWHBzUVhSa1pGRRAB",
            "text": "Amazing spot. 100% recommend! Our server, John, made my husband’s and my experience so much more special than we expected. Upon walking in the door, it felt like seeing an old friend after not seeing them for a while. Doesn’t stop there, the food was incredible! The squash tacos were so surprising and delicious, and the tortas were to die for! We’ll definitely be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25welNIWTBTV05tZEdjeVpuQTFUR2hIYmpOM2MxRRAB",
            "text": "We had a great brunch at Oxomoco! John, our server, was amazing and helped curate a personal experience for us! We can’t wait to go back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSVoxVndhVGxTUVdSSFEwZGtiRk0yVmtwNE1tYxAB",
            "text": "Went here last night tot a 930pm ressy. Unfortunately one of the 2 bigger entrees (chicken) was sold out. A little disappointed because the only other entree is the pork or tacos , which come in 2 (not very filling) . Atmosphere was great. Drinks were bomb. But selling out of food on a Friday night was a downer. Will return ( will get an earlier reservation haha ) to try the chicken . They no longer have the wagyu beef"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SblVGOURUR3hoWDFCTlNYZEhTR290YXpCbFRXYxAB",
            "text": "A must try spot for sure. I WISH I took a pic of the best appetizer, the tuna tostada 🤤🤤🤤🤤🤤. I’m any case, if you’ve been meaning to try this place then you need to do so. All around great culinary experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRWNqaFJTVkkyVWtsQlZtNVdkVWQwUW5KeVVYYxAB",
            "text": "Absolutely amazing and the best server called John whose recommendations were superb. The bartender called Marico made great drinks too. An absolute must if you’re in Green point"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMWVrZFdaMkZqTjFCdVRVZEZMWEZMUzJoTmMzYxAB",
            "text": "Date night yum!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMFpraEdTVWhQVWs5RmVHY3paVFpEYmtGRFMyYxAB",
            "text": "We had the most incredible meal here. Were we hungover? Yes! Was John the most perfect server who helped us make decisions like “I already put the guac in for you” and “the tuna tostada is a non-negotiable.” Also yes! Order as much as you can, everything was truly amazing. Ps: the bathrooms are a disco party. What more could you want?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVUxUTjJhMDE2TjB0c2VuTm1ORTk1Um5CWVFWRRAB",
            "text": "Excellent food and staff. The drink menu is great with many NA options. They are also happy to modify drinks to make a mocktail version for you. The short rib was a meal highlight and don’t sleep on the desserts. The ambiance and staff are amazing. This is definitely a must visit restaurant! Shout out to Chef Justin, Chris, and Edith- you guys rock!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5T1RURXdXbXh4VFhZMWRsOTJUM3BNYkZJelpHYxAB",
            "text": "Service and atmosphere are top notch. The food was amazing. I enjoyed the steak tacos that were cooked to perfection and loaded with flavor. The salsa flight was very nice, and my favorite bite of the year was the caviar tuna tartare. Wow so so so good. Also their take on the mezcal espresso martini was the best I’ve ever had."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25relMwNW9TbVI0UmtSMlFYSjBRMW8zWDNJMlZYYxAB",
            "text": "We enjoyed a delicious lunch here today thanks to our server, John, who helped us understand the menu and gave us excellent recommendations. We loved both the tuna tostada and the guacamole with smoked cherry tomatoes. I wish we had room for a dessert because they sounded fabulous."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NVVrbEdiMU5uVURaWlNIVmhZalJ6YVdvemQzYxAB",
            "text": "Do you like purple tostadas? If so, this place is for you, because the majority of our dishes were served on, or with, purple tostadas."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSS2ExQTJUMWM1YW5RMlIwNU5iR3hRTjNGQlUzYxAB",
            "text": "Amazing experience. The food is exceptional."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNGVUX1RnEAE",
            "text": "Speaking as an industry veteran here!... The Hospitality IS impeccable, and WARNING!!! the Sungold Taco may cause actual tears of joy! So be careful who you eat it with to avoid embarassment... The berry dessert was both beautifully simple yet complex, and Ultimo Adios!  is one of the best cocktails in NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMFMzUk9Xbk5yVVVVd1MxOTZjSEJoUm1ndGNWRRAB",
            "text": "We visit Oxomoco every time we visit New York City and our lunch here this time was unforgettable.\n\nWe ordered our beloved tuna tostada, along with several other dishes - an honorable mention, the squash tacos. Absolutely devine.\n\nAsk for John to be your server, what a memorable experience he gave us, from start to finish. John had fabulous recommendations, even offered drinks that would pair well with what we wanted to order."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbnZIcHVnRRAB",
            "text": "All good Mexican food, nice ambience. Great combinations and execution on every plate. Our server at the bar was great. The tuna tartare and lamb tacos that he recommended were great. The bass ceviche was fine, but the flavors a bit muddled, some as the chocolate cake. The black sesame horchata was a fun innovation. Reasonably expensive for the quality."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sblkxOW5PWFpKYkRkcmFEbEllRzAxWVV0MVJsRRAB",
            "text": "Deliciosa comida mexicana, la chef María Barriga es lo máximo. Te atienden súper bien y todo el tiempo están dispuestos a contarte más de lo que te comes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbWNuQk5WM1Z1Y0dkcE5ETklMVmhRUlRsV1EyYxAB",
            "text": "Unbelievable lunch, the service from John was superb, 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRmQydFFNME40UVhsdVQzZFZWbVE0ZHpsM1FVRRAB",
            "text": "Walked in with no booking and was thrilled to be able to find a table.  The food was some of the best Mexican I have had in a long while, the staff and service was excellent (my 7 year old kept commenting on how nice our waitress was), it was a great experience and they are well deserved of their Michelin recognition.  Thank you again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcVoyTmtRa3RDTWxJNFZXSTJSM1p4Y1hwaWVFRRAB",
            "text": "I had a very disappointing experience at this Michelin-starred restaurant. After waiting an unusually long time for our dishes, we were given peanuts and a sesame horchata as compensation for their tardiness. I found a fish bone in the sesame horchata after finishing the drink. This is a serious food safety issue.\n\nWhen we reported it, the staff took the bone away “to check.” Almost all the servers were called into the kitchen and they were in it for about 5 minutes. We believed that they were talking about this issue, so we waited for the result, but instead of any explanation or apology, another staff member came over pretending not to know what had happened and simply asked us to pay the bill. She even began with “How’s everything?” When knowingly that we questioned about the fish bone. When we questioned her directly, she repeatedly denied it was a fish bone after we told her that it was a serious health hazard. She just rushed us to pay the bill.\n\nThis lack of accountability and honesty is shocking, especially for a one-star Michelin restaurant. No acknowledgment, no explanation, and no compensation were offered. For an establishment with such a reputation, this is completely unacceptable.\n\nWhile we were waiting for their answer in the restaurant, the staff kept on holding out the POS machine, we paid the bill without asking for further explanation. But we weren’t satisfied with the they dealt with this issue. We wish to receive a more sensible and respectful response as we leave this review."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNFbnFDZmtBRRAB",
            "text": "토요일 점심. 마가리따(스파이씨 맹고&미모사), 슈림프 세비체, 램 바르바코아 퀘사디야, 스프링 피 틀라유다. 최종 101불 계산.\n\n음식은 괜찮았고 신선한 재료 좋은 느낌이었으나 주변이 너무 소란. 이젠 정돈되지 않은 분위기를 감당 못하는 늙은이가 되어버렸음... 화이트들 많은 캐주얼 식당/펍 치고 일반적인 데시벨인데 거북함. 서빙도 좀 투박함. 양 작은 편."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRb1plZkZnEAE",
            "text": "지인의 추천으로 함께 방문\n분위기, 음식 전체적으로 너무 훌륭했음"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrM2J5UU1BEAE",
            "text": "인생타코맛보고왔습니다. 정말맛있어요"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRU56QjBhV2h3VGtGaFFXMWZhVVZRYUVSNk5XYxAB",
            "text": "We’re so glad we went out of our way to experience Oxomoco — this one Michelin star gem is absolutely worth the trip. From the moment you step inside, the bright, airy space transports you straight to Mexico. It’s laid-back yet elevated, with a vibe that’s both welcoming and effortlessly cool.\n\nThe food is a celebration of authenticity and freshness. We started with the guacamole, served with warm, blue maiz tortillas straight off the comal — simple, but unforgettable. The tuna tartar with caviar was a surprising standout — delicate, flavorful, and unlike anything we’ve had before. And the steak tacos with tender, caramelized onions? Incredible. Each bite was perfectly balanced and deeply satisfying.\n\nThe agave selection is beautifully curated, and the cocktails are a highlight on their own — each one tasting like a love letter to Mexican flavors and craftsmanship.\n\nIf you’re into thoughtful, vibrant food that feels both familiar and innovative, Oxomoco is a must. We’d go out of our way again in a heartbeat."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Rek9VcGhXV3h1UzFBMlF6ZDVYMEZRWTBwTk4xRRAB",
            "text": "This restaurant is Great!  Two things- spicy salsa will catch up with you even if you're sure you're fine at first (I'm a weak, white boy from the Midwest, so even Mayo seems too spicy at times to me). 2. The bathroom is AMAZING!\n\nNo really.  Go.\n\nThe service is Lovely!\nThe dishes are great (it's NYC and good, so expect it will cost more).\n\nRecently they had some ventilation issue, so their menu has rapidly pared itself down. (Hence 4-stars on food, not 5- I really wanted to try their other offerings!)\n\nRegardless, look at these dishes!\n\nRelish in these cocktails!\n\nBEHOLD!\nOXOMOCO"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWblpVeHhSR1JEVDBGS2JXRTJValZuU2tzd1YxRRAB",
            "text": "Beautiful place with outdoor seating. Great cocktail bar and delicious modern Mexican food. Not cheap at all but amazing flavors from a top kitchen. Service was good. Didn't hover, very knowledgeable and helpful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdWNHUkhabXhJUW0xWmVFeHBNMEpEZG1GNlgzYxAB",
            "text": "Perfect from the moment you walk in till you leave! This is one place you wouldn’t want to miss if you are ever in Greenpoint or in NYC. Every singe item (as shared in the pictures) on the menu is sublime. Words cannot describe the experiences I had here. So I just let my taste buds take over. It is a very popular restaurant, so reservations are definitely recommended. BTW, the guava margaritas are addictive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONmJuVk5Ra0pZVEVaNGMyczVaR2wyY0hwelgxRRAB",
            "text": "Whewwwwweee did I enjoy myself!\n\nFirst of all, it's gorgeous, so sunshine-y and green. We sat at the bar and the service was great. We ordered the cantaloupe slushies and they were so, so good! They weren't overly strong + they mix them themselves, just a few ingredients. The guac was a little small but delicious. The pork tacos were pretty expensive for 2, I thought, until I tasted them. WOW, so good. We were so busy catching up, we didn't realize they'd closed to get ready for dinner. They emphasized we hadn't overstayed our welcome, we could stay as long as we needed.\nAnd the disco-themed restroom + playlist? Excellente"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPVEJxTzZrN1BPM3NRRRAB",
            "text": "Dinner at Oxomoco in Greenpoint was a memorable and well-rounded experience. From the moment we sat down, the warm atmosphere and attentive service set the tone for a great evening. Each dish we ordered—from the guacamole and tlayuda to the tacos, steak, and dessert—was thoughtfully prepared, flavorful, and beautifully presented. The meal flowed smoothly, with a balance of bold flavors, comforting textures, and a clear sense of care behind the cooking. The lamb tacos stood out as a favorite, but every course contributed to an overall sense of satisfaction. Oxomoco manages to feel both special and approachable, making it a place worth returning to."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNHZpUmRREAE",
            "text": "Joined for brunch for the first time and food is amazing. Extremely flavorful tacos. We got the charred beet ones and lamb ones, both sooo good and the lamb ones were fire. The potato dish was good but nothing special either. Will definitely come back and try dinner as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkZlJsSnVXRWxNTlRVMFJVVTViRFZOZFVWcU5tYxAB",
            "text": "Tasty but expensive for the portions. $28+ for two small tacos is a big ask when the flavors are busy and it doesn’t leave a memorable impression. $25+ for one tostada. $20+ for a bowl of guacamole with 4 chips and maybe 1 avocado’s worth of guac…\n\nMenu is small, no chicken entrees and only one vegetarian entree.\n\nInterior design is beautiful and service was good, but for the price we left hungry and had to head elsewhere for more food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbkxfNDd3RRAB",
            "text": "This is the best Mexican food I’ve had in Brooklyn so far. They absolutely deserve that Michelin star ⭐️\nThe service is excellent, and the food is absolutely delicious. The ambiance is nice too, though it can get a bit noisy indoors—something to keep in mind if you’re looking for a quiet dinner. I totally recommend it!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSFdtOVlOR1JSWjBocFJHcHFhVnBsYVhsVlpXYxAB",
            "text": "Everything from the moment we walked in, to the moment we left was exceptional. The decor was very inviting and the staff were very friendly. We had the lamb tacos, swordfish tacos, and chicken entree. The lamb tacos were exceptional, the swordfish tacos were other worldly and I want more as I’m sitting here writing this. No question as to why this place holds a Michelin star."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcllqQllUMWxsYW5wbWVXRkhhVmh1U0UxRU1IYxAB",
            "text": "Service, atmosphere and most importantly food was spot on! We had the chips and salsa,  catch of the day tacos and their special which was red snapper tacos that was a shareable. Everything was seasoned and cooked beautifully. We will definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GV2IzSnViMmc0VEZkMVMxQkpjVkYwVUc1SGVWRRAB",
            "text": "Oxomoco is a Michelin-starred gem in Greenpoint that truly delivers on flavor and atmosphere. The space is beautiful and welcoming, and the food lives up to its reputation. Ended the meal with the chocolate cake for dessert – rich, moist, and absolutely delicious. A great spot for a special night out."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocGREaGFVMVExZUdwbVZIRTVRbTlRV1hGV1oyYxAB",
            "text": "Came here for dinner recently on an early Sunday night. It was a bit of a hassle getting a table without a reservation, though I think the hostess on duty was new. We split the tostada and guac (excellent), papas bravas (excellent), Caesar salad (ok), soy tuna tostada (excellent), swordfish tacos (excellent), lamb barbacoa tacos (very good) and wagyu bavette (basically a DIY taco situation, very good). Service was fine. The interior is beautiful. Honestly our initial reaction collectively afterwards was surprise they had a Michelin star. It was a very good meal but didn’t feel like a great value for the money."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReWVUTkxjMVp4UlhSclpFdHBWM2x4TVZOelNGRRAB",
            "text": "Have been here twice over the years and absolutely loved it - though I will say a few things have been cycled out of the menu though I imagine the new additions are just as delightful. I would highly recommend the caesar salad as the lettuce is perfectly crunchy, the dressing tart and punchy, and the crumbs on top add just the right texture. The tuna tostada and pollo a las brazas are both great. I've had two different tlayudas - both great though not sure which they have available now. ALSO, the salsas are wicked spicy though a wonderful topping to a the extra crispy totopos. I'll definitely have to come back soon but would highly recommend! Also, the chocolate cake is divine!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaktPbUZBEAE",
            "text": "Absolutely wonderful experience overall. The food was absolutely flavour filled treats and so were the cocktails ! The Smoked Mango and Mole popcorn are the perfect sides to their stunning Guava Margarita! The tuna Tostada was an absolute flavor bomb and so were the shrimp tacos l. Almost wanted to order one more of those but wanted to try the desserts and that was absolutely the right call as they were awesome! The strawberry and Cream was tantalizing and the Tres leches infused with Mezcal was light and hit the right spots! Excellent dinner overall!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NUszUE9nEAE",
            "text": "After having the chocolate cake for dessert… I immediately ordered another one. No exaggeration it was that good. The ice cream on it, the mousse. Insane!! The swordfish and lamb tacos were delicious! The meat was seasoned so well. Also got the tuna tostada and the mushroom tlayuda. Loved everything. Drinks were great too."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcF9qU0hnEAE",
            "text": "It's a Michelin Star restaurant for a reason. Its elevated Mexican food without being pretentious. The food is top notch,  the service is top notch, and I love the ambiance. The Soy Marinated Tuna Tostada was just so good 🤤. My second favorite was the Lamb Tacos. The smoked mango for starters was just as good. The Michelada was fireeeee.\n\nNot the biggest fan of the shrimp tacos and the milk cake tho.\n\nStill coming back tho!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5b2JpMDJUSFp4T1ZwUFYxWklTbnBRVFU5MmJVRRAB",
            "text": "Really great guacamole, smoked mango, swordfish, lamb, and crab. The nopalito was bonb must try. I went pre fire so the menu was a bit different. Also got the other frozen drink and tuna tostada. It was also good but not as good as everything else. We got two nopalito it’s refreshing and spicy and perfect. Guac was so complex just not enough chips for me lol. Great dinner. And staff was quite accommodating"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMS1EYzlnRRAB",
            "text": "Me and my family visited Oxomoco for the first time last night and absolutely loved it. We took a chance and came without a reservation, and they were luckily able to seat us really quickly. The guacamole with smoked tomatoes was insanely good and they have a great selection of drinks (the frozen Ixmand was delicious). I got the lamb barbacoa tacos and my parents got the swordfish. Both were phenomenal. The portions were slightly small but very satiating. Our waitress was really amazing and super knowledgeable about all of the menu items. The interior is beautiful and the ambiance on the patio is perfect. Overall, the quality of the food, the service, and the setting is totally worth it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxT05EaEZZM0J6YmpRMFJrZHdlbnBmYjJGNWRsRRAB",
            "text": "My entire experience was truly exceptional—worthy of a five-star rating. I entrusted the bartender with selecting my entire meal, and his choices could not have been more spot-on. As someone who tends to be a discerning critic, I was thoroughly impressed and have only positive remarks.\n\nThe tuna tostada was outstanding—perfectly balanced with a subtle heat and a flavor profile that was both rich and refreshing.\n\nFor the main course, I had the swordfish tacos. Swordfish can often be served overly soft, but in this case, it was expertly prepared—meaty, flavorful, and perhaps the best I’ve ever had. The al pastor seasoning complemented the dish beautifully. I would gladly order these tacos again and again.\n\nFor dessert, I indulged in the classic chocolate cake, which, while rich, was nicely offset by the accompanying ice cream. I paired it with a carajillo—an espresso martini infused with orange zest—which elevated the finale of the meal perfectly."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bF96RTZnRRAB",
            "text": "Beautiful restaurant and overall good food as well, a few things I recommend would be: smoked mangos, tuna tartare tostadas (Asian fusion), fried shrimp tacos, and the chicken.\n\nTbh the desserts were a little disappointing but the overall dining experience was good."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfZ19yVUpREAE",
            "text": "I finally decided to try Oxomoco and i did right. Food was delicious, Cesar salad and Tuna tostada are top notch, must highlight the black sesame Whorechata ahua as well, and the Michellada was meh.\n\nStaff were very attentive and friendly. Loved them all. Maria was very funny and lovely. Regina and Catalina taking care of us at all time.\n\nLast but not least. I love the facilites, taking a poopie was very fun."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJMkl5NWVlaXJtSDJRRRAB",
            "text": "I've walked past Oxomoco many times before finally deciding to make a reservation. I arrived on a Sunday evening right when they opened, and to my surprise, there was already a line outside. The restaurant is small and cozy, with a mix of tables, bar seating, and a chef's counter.\n\nUnfortunately, I didn't find the staff particularly welcoming. One staff member, in particular, seemed like he wasn't enjoying his job, which was a bit off-putting.\n\nNow, onto the food! Each taco order includes two tacos. I'll preface this by saying I eat a lot, and despite being warned about over-ordering, I went all in--so here's the rundown:\n\n- Chips and Salsa: A must-order! The chips were freshly made, incredibly crunchy, and perfectly salted. The variety of salsas and sauces was impressive, and every single one was absolutely delicious.\n\n- Oxomoco Guacamole: A classic and well-executed dish. The guacamole was fresh and flavorful, made with whole heirloom cherry tomatoes and served with a side of chips.\n\n- Mushroom Tlayuda: Skip this one. It's essentially a thin-crust mushroom pizza with red sauce, but the flavors didn't work well together in my opinion.\n\n- Coctel de Mariscos: This is similar to ceviche and had a tasty, flavorful sauce. However, the portions were small, with the seafood cut into bite-sized pieces.\n\n- Swordfish Tacos: Soft, tender, and cooked to perfection. A solid choice.\n\n- Shrimp Tacos (Special): Outstanding! The fried shrimp was slightly charred, flavorful, juicy, and absolutely addictive.\n\n- Pollo a las Brazas: This was the juiciest chicken I've had in a while, with fantastic flavors. The crispy red rice it was served with was a great accompaniment. It's a generous entree, likely half a chicken, and well worth ordering.\n\nAs for the drinks, the cocktails were just okay, and the wine menu was limited with not many options. I also noticed that some items listed on the online menu were unavailable in person, which was a little disappointing.\n\nOverall, I'd come back for the chips and salsa and to explore more of their taco options. However, it's not a spot I'd go out of my way for unless I was already in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1b2IxSm1TMnBsZUZsWldGRlpPVlpxWTBOVlZGRRAB",
            "text": "Delicious food. We got the Oxomoco Guacamole, Soya Marinated Tuna Tostada, Cochinita Pibil, a couple of cocktails, and the chocolate cake."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb1p6NDlnRRAB",
            "text": "Excellent Mexican food. We came for lunch and got all 3 tacos (pork, beef, lamb) and the tuna tostada to share. Ended with the Mexican chocolate flourless cake for dessert. Portions were very generous on the protein! Don’t underestimate the amount of food for the menu price. Quality was very high and so well delivered. Food was beautifully presented and the restaurant smelled great like palo santo wood. The bathrooms are disco themes and super cute. There is an indoor and outdoor covered patio section as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VORE11cm5hcW92R2pBRRAB",
            "text": "Had a spectacular meal there yesterday. It’s pretty easy to get a table for lunch. I got the Tuna Tostada and then the Flank Steak taco and for dessert a strawberry flan(?).\nEverything was amazing and I’ll be back soon. Service was superb as well, thanks John. The Salsa Macha was one of the best I’ve had. I bought a jar to take home. This place is worth all the hype. Big fan."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeVMydFJjRU15YlhnME1Ib3hha0Z0VEhscGRXYxAB",
            "text": "PLEASE SAVE YOUR MONEY AND TIME DO NOT COME!\nIf I could rate this restaurant, a zero, I would starting off with the service which was horrible. I don't understand how it is a Michelin star restaurant with that type of people working there They seem to have no experience whatsoever in service. I was so excited to come and try this restaurant because it's a Michelin star restaurant which I think it is not up to the standards of a Michelin star restaurant.\nThe American Waygu was a 0/10 extremly overpriced, I ordered it medium and it just tasted like burnt meat. Disgusting. Not to talk about the potatoes with the chimi sauce they were also burnt.\nThe Barbacoa tacos were disgusting. The only good thing I tasted in this restaurant were the swordfish tacos , which I will give a 7/10 just because I think they were a bit salty. The drinks were a 5/10. my bill was almost $400 and I can assure you I can get tastier tacos in a food truck."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRZ28tdERREAE",
            "text": "This place is amazing! I recently visited for the first time, and the food completely exceeded my expectations. Every dish was beautifully presented and packed with flavor. The tuna tostada, in particular, caught me off guard—it was so fresh and perfectly balanced that I couldn’t stop thinking about it. The atmosphere was warm and inviting, and the service was excellent. I’ll definitely be coming back to explore more of the menu!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJXzlMTFpREAE",
            "text": "I have to say this restaurant was absolutely delicious!! So glad we tried the only Mexican Michelin star in New York!!!\n\nWe went here for our anniversary and were very pleased! Our reservation was for 9 and our table was ready exactly at that time.  Service was fantastic! Our waiter was really friendly and very knowledgeable about all the food items.  He answered all of our questions about flavors and portion sizes quite thoroughly which made our decisions easy!\n\nTheir tequila and mezcal varieties were very extensive and they had great cocktail options as well! For appetizers we decided to choose the smoked mangoes, tuna tostada, and the punta verde caesar.  All were so tasty and had such amazing flavor, we even ordered another tuna tostada!!  I would say we felt the mangoes were more of a snack/dessert and not an app but we were not mad about it at all because the smokiness they were able to get into the mangoes was amazing!\n\nFor the main course we went with the lamb and swordfish tacos (it comes with 2 each).  They are average sized, nothing too big or small especially since we ordered so many appetizers between the two of us!!  Both dishes were so flavorful!! I would highly recommend trying everything you have room for since the choices we made were bursting with so much flavor!\n\nWe chose the Oaxacan chocolate cake and the tres leches for dessert.  The cake and ice cream had a strong espresso flavor, maybe because I don't drink any coffee/espresso at all but it was still very tasty.\n\nOverall this was a very affordable Michelin Star restaurant and we were extremely pleased with every aspect of our dining experience.  We would absolutely return to try more menu items and highly recommend paying them a visit if you are a fan of big, bold flavors!!\n\n(The photos are not great sorry.)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYXgydDZKNi1pcS1RRRAB",
            "text": "Writing this mainly to rave about the flourless chocolate cake. It was so delicious - my partner and I thought god was in the kitchen whipping the dessert up. This is a must try!!!\n\nOther highlights include the Spring Tlayuda, which was a big tostada with a pea base. I’m glad we gave this a chance, because it had a rich umami taste that I enjoyed a lot. The lamb taco was also incredibly delicious, and the meat in each bite felt like it was melting in my mouth."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbE8yejNRRRAB",
            "text": "After reading all the reviews, I ordered what most people said was their favorites. I got the smoked mango, chips and salsa, tuna tostada and swordfish tacos. Every thing was excellent!! The smoked mango was served slightly warm, I wasn’t expecting that but I quite enjoyed it. The salsas felt more like sauce but they were tasty.. the real mvp of that dish was the corn tostadas!! The tuna tostada was immaculate and the swordfish tacos were scrumptious. The corn tortillas were so soft!! The only thing that I didn’t really care for was my drink. I ordered their Mocktail and it was rather disappointing… kinda bland."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbW8wdnE0aUxTUmNBEAE",
            "text": "Great food, fantastic service. We went with the beef and lamb tacos, the polenta French toast, and the tostada. I’d recommend 2 dishes per person and you’ll have a little room for dessert."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbk83Q2NREAE",
            "text": "This brunch was among the best Mexican food experiences I had in NYC. All the flavors were spot on, and the drinks were on par with the food. I was skeptical about what to expect at a Michelin-starred Mexican restaurant and got a very nice surprise. The menu has a decent amount of choice (from lighter bites like chips and guac to a more filling elevated burrito), while offering quality ingredients and a modern touch on classical dishes. The ambiance felt casual with a touch of chic, while still welcoming you to enjoy comforting Mexican food."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNGNuZ1l3EAE",
            "text": "Went for my birthday and as probably the most hyped up restaurant in greenpoint, it did not disappoint. Our Server (Paco) was the best of the best, our food was to die for, the special, tempura tacos, stole the show, but the lamb tacos were a close second. Drinks were nothing to lose your mind over but very solid. Desert wasn’t insane but full of flavor. all in all, this place was phenomenal, they also have a $20 take out burrito I’m very excited to try."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRU4wZFRWWFJFVlhSQ1FXTTFZMU5mWTBkUVVFRRAB",
            "text": "This was such a treat! The food was excellent as was the service. The tuna tostada, brushed with savory chili crisp, was so good we ordered a second. Other standouts were the spring tlayuda, the beef tacos and lamb tacos. Many gluten free options - including the flourless chocolate cake."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNWJXdEN3EAE",
            "text": "Just visited this restaurant without knowing it had a Michelin one-star rating, but the moment I walked in, I fell in love with the cozy atmosphere and comfortable seating. We sat at the counter by the kitchen, which allowed me to fully enjoy watching the chefs in action—an experience I always appreciate when dining out.\n\nI highly recommend trying the Caesar salad. While it was slightly too saucy for my taste, the roasted flavors were unique and delicious. As for the chicken, I noticed a lot of reviews mentioned how juicy it is. From my seat near the kitchen, I saw the chicken sitting on the grill top for a while, but to my surprise, it was tender when I tried it (not juicy tho)The sauce had a distinctive, slightly bitter flavor that paired well with the rice it came with.\n\nThe guava margarita is a must-try—it was fantastic! However, I found the guacamole just okay. Overall, the service was excellent, and the restaurant’s ambiance is warm and inviting. I’d rate it 4.5 out of 5 and am excited to return to explore more of the menu."
        }
    ],
    "reviews_count": 89
}