{
    "name": "El Born",
    "place_id": "ChIJmyZIT0RZwokRRbbmt850gmY",
    "grid": "BK1",
    "address": "651 Manhattan Ave, Brooklyn, NY 11222, USA",
    "rating": 4.4,
    "user_ratings_total": 776,
    "phone_number": "(347) 844-9295",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCR00wTndPWGhSTVZjeVNFczRlVWRPVlVGMVNWRRAB",
            "text": "Loved this place! Cocktails were amazing and the service was super attentive. My favs are  the paella, the garlic shrimp and the steak tartare. Can’t wait to come back!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOaWg2ZDZlLWRpSjR3RRAB",
            "text": "2025 Update: I’m not sure if there’s been a change in management or chef, but our recent visit was incredibly disappointing. All of our go to items were off - salad in particular was so salty, it was near inedible. While gambas and mussels were under seasoned and bland. The steak tartare was room temp and strangely sweet, first time we did not enjoy or finish our meal.\n\nOriginal Review: El Born has been a go to tapas place for many years now. Great neighborhood spot with cozy vibes and friendly owners. Food, drinks, and service are consistently good. The squid ink paella, gambas, kale salad are staples for us. We never feel rushed dining here, a lovely evening is always guaranteed."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSVFWRXlkMFZZUzNaTVoyVnhPR2hHVGtodlYyYxAB",
            "text": "This restaurant earns its reputation. I located this good restaurant through Yelp reviews. I can't stay away for long. Employees help out, avoid airs, and show genuineness. All dining needs are addressed here."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poV1dEVnBZekpaWkdweE5pMUtSakJrU0UxVlpsRRAB",
            "text": "Food is not very tasty. Drinks were good tho!"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNFoxcEhWa2Q1YmswelltWjFXbXB2TlVoQ1dVRRAB",
            "text": "La comida estuvo ok, buen sabor porciones razonables. No pude probar la paella ya que la mesera no ingresó la orden después de unos largos 30 minutos nos dijo que teníamos que seguir esperando otros 15 minutos más.. las mesas que llegaron después que nosotros  su orden salió antes que nosotros.fatal, hasta que no mejoren el servicio las meseras difícil volver, no muy grata experiencia."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNVJEZHpUazV0ZVdSblNXZENWSFJSYjBOeldYYxAB",
            "text": "Love El Born – every time I eat here the food is spectacular and the service is always on-point, friendly, and attentive. Each dish is thoughtfully prepared, full of flavor, and beautifully presented, making every meal feel special. The atmosphere is cozy and inviting, perfect for both casual dinners and special occasions. I always leave feeling satisfied and excited to come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdGNFZDBRM2xSU0hsTk1tVjRiM0V4Wm1GMFNWRRAB",
            "text": "Our experience here was thoroughly enjoyable. El Born serves meals at the right moment. The layout suits group meals well. All personnel perform admirably. I moved here not long ago and was pleased to discover this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SVowODRkazh0ZW1kNGRVNVZTbGRzY1hZeVNHYxAB",
            "text": "Service is fine, food is disgusting, I have no words.. what’s the point of adding grapes to the uncooked scallops, and worst octopus I have ever had.. paella is just fine.. and got 7 mosquito bits after the dinner…the picture of foods looks fine, but when you taste it, you’ll just know it’s all wasteful and meaningless.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWVdrdDBjbEJMY0RreVJVeFFlblZ2YVRSMVpXYxAB",
            "text": "Amazing mouthwatering food, spectacular customer service and cozy atmosphere!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVFdWSnBOVXhIV0hwck9WTkxWRFZXWWtsWGVuYxAB",
            "text": "Such a disappointment. We sat in the garden but went back inside after seeing 3 rats within 5 m. The first rat was ok we thought but then number 2 arrived and then my daughters and I didn’t want to stay anymore. The manager was very casual about it.: « oh yes we have an exterminator coming twice a week but there’s nothing we can do about it . They come again»!!\nSo maybe if the food was great, we would forget about the rats! But the paella was a major disappointment !we ordered 3 paellas!  It came in a frying pan, mostly dry rice with 3 shrimps, 3 mussels and an octopus tail!! Unbelievable that it would be called paella and was way overcooked and overpriced. We ordered another fish dish because this heap of dry rice was not OK to eat alone. Paella is supposed to be rich with different sea foods, moist rice and sauce. There was not a bit of sauce !\nThe only thing we enjoyed was the wine and the tapas ! I’m never going there."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCYVFXMUZZMGRqUzNoRGJESjNPREZpTkhKc01IYxAB",
            "text": "Mediocre at best. Jamon was low quality, Barbaras bravas were under seasoned, gambas were just okay, and the WORST was the rancid and warm steak tartar. Only decent thing was the croquetas. Service was good though."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoS2F5MXdlR0ZCYUc1RlppMXlWMGxMZURWc1FVRRAB",
            "text": "The happy hour individual sized paella makes this place a no brainer to go to."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbllUa3dSRkZ5ZUdGMk5uTldTR0ZGVm1KWE1tYxAB",
            "text": "Nice place with good plates. Perfect for big groups and very lively and fun! I recommend their prix fixe menu for big groups and for brunches"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeE1USk5Xalp4V0hWQ2Rtc3dTM0pwYjFscU1HYxAB",
            "text": "Particularly enjoyed their croquette and paella!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twd1VHSlNkSGxUYVVFMVYzZHBVRWRHVG5ScWNFRRAB",
            "text": "Amazing tapas spot!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzd1kyMXJUVWh6YVdoMVdrdHNVa1phU21kTmNXYxAB",
            "text": "seafood (squid ink) paella was delicious - great servers and atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbE9WSnpWbUU0VldwWWExVnFhek54VnpsR2RHYxAB",
            "text": "Love love\nLove this place. The food was so good. Sangria was great. The staff were so attentive and nice.  Can’t wait to\nGo again."
        },
        {
            "date": "3달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNVJFeGFkbEJyWDBoa2VFbEdXamRCWlRWbGJtYxAB",
            "text": "Heerlijk gegeten"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabVoxUm1SemhZYkRsRVZEWnlhVUY2ZFRsSGIzYxAB",
            "text": "I really like this place, come back often.  The staff is wonderful, food is consistently good.  They have good specials.  I love the unlimited Tuesday tapas, and the Wednesday paella special.  It's a good neighborhood spot to support."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVlRHcENObVo2WXpkTFYxOHphM0JpYVVoV2NWRRAB",
            "text": "Croquettes are the best I've ever had, great wine selection and the paella was delicious. Will be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5amVUaEVieTFsVlZJNE1YQjNTMlZRZGpKeWEzYxAB",
            "text": "It’s good! Great service. The happy hour deal is 4-11(?) pm for two hours order unlimited tapas for $19.99 WITH a drink purchase. My total came to $38 for a beer, white wine, and the happy hour. (Tip not included in this) so it’s a little more than I want to pay for apps and a drink, you have to order a lot of tapas to get your moneys worth, the cheese tapa was the favorite. Potato’s were good too. Croquettes - cauliflower than ham- decent. Everything else ok! Wine was also fine. I probably won’t be back because I’ve eaten each dish at least thrice. But it’s a good place if you need to meet someone and you’re in this area - I wouldn’t go out of my way for it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TFFrZFdNVEpqVW5KWWMyeE1NV3MzVG1KdGJVRRAB",
            "text": "We ordered 5 tapas, and one by one it kept getting better AND BETTER. Ordered a couple of cocktails as well, chef's kiss again. The vibes were immaculate and the bartender was pretty chill too. 10/10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20welUyZEhiM0ZzUm05MWJqWndUM1puTWs4NWMzYxAB",
            "text": "We got there 10 mins after our reservation and they had given up our table. Then had move us a table next to a loud party of 8 ! ( mind you we’re two people) they were the loudest table in the restaurant. It was so bad our ears were ringing and waiting a half an hour for our food and ask to move to another table and come to find out it was the owner and her friends at that table which is really inconsiderate. Mind you this is a 7:30pm reservation on Thursday. Food was hit and miss. Seafood was good fresh. However will not be going back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV01qTXRRM0IyTWpsYU1HRkhTRW8yTmtsVFdWRRAB",
            "text": "Croquettes and patataa bravas are good but that isnt hard they are both fried carbs its hard to mess that up. Everything else was mediocre and unmemorable. We had carpaccio, kale salad and something else. Really not good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNVoyOUpXbEJuY1hwaVR6WjRXSGd5TUZKcWFXYxAB",
            "text": "Amazing atmosphere, food, drinks, vibe."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPUDVob3pHb3BlakhnEAE",
            "text": "This place was great, the food was awesome and the atmosphere is very cool. Highly recommend the short rib."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPdUI1NHFIem9xWnp3RRAB",
            "text": "Please get the paella- ITS A MUST!!! We also got margarita pitchers which was worth it and the octopus. I would love to come back here for the paella though and with a larger group of people!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKNm93cHJIOXVQWkx3EAE",
            "text": "Had an amazing lunch at El Born, they never let us down. Perfect little patio out back for those gorgeous summer days (dog friendly too, huge plus!!!!!). Amazing food, good drinks, great atmosphere."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMSHgtcUxCZzRYZVdREAE",
            "text": "Excelente! La comida, el servicio y el local hacen de este restaurante una opción ideal para disfrutar de una bonita velada en NY."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNGUyOGpRRRAB",
            "text": "Super buen ambiente para un sábado en NY por la noche. Nos atendieron muy bien y la comida estaba riquísima. Tapitas para compartir. Si alguna vez volvemos a NY, repetiremos!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM0x1X0dnEAE",
            "text": "Recommend the squid ink paella and Tapas Tuesday. Excellent date spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdVBHeW5nRRAB",
            "text": "A Truly Exceptional Dining Experience at\nEl Born\n\nFrom the moment I walked in I knew I was in for something special. The warm, inviting atmosphere set the perfect tone, with cozy lighting and tasteful decor that strikes the perfect balance between upscale and comfortable.\n\nThe service was flawless—friendly, attentive, and genuinely passionate about the menu. Our server Sarah offered excellent recommendations and made us feel right at home."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNzdYVDV3RRAB",
            "text": "I just moved to greenpoint and this my new favorite spot!! Shout out to my server Sarah she gave me the best customer service! I can’t stop raving about this spot"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvejc2X1pnEAE",
            "text": "i came in on a slower sunday afternoon/early evening after walking through greenpoint. i got lucky enough to sit during happy hour and was kindly helped by Sarah and Jonny who suggested their favorites in compliance with my (many) allergies. i appreciate the time they booth took to ensure my safety. the croquettes and braves we’re delicious and then i had the happy hour pallela as well. overall this was a fantastic experience, and i will definitely come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNTU3VXlnRRAB",
            "text": "My friends all seemed to enjoy the food, but I clearly stated I was a vegetarian and accidentally ate chicken that was in my paella. When I brought it up, the server was snarky. They did eventually remove the dish from the bill, but the service ruined the experience for me. The vegetarian tapas I tried were good, but I will not be returning."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaUxUNk1BEAE",
            "text": "One of my favorite places in the neighborhood to grab a drink. Love the spicy mezcal cocktail. Came in for Sunday dinner. The stand out dishes of the evening were the Brussels and ribs, so good! Loved our server Sarah, she was sweet and had great wine recommendations for our meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaTl1YzZnRRAB",
            "text": "We came with a group of 8, so we decided it was simpler to order the chef's menu. This was a great decision! We received so much food and a great selection of options. The brussel sprouts managed to be original in flavor, and the selection of Spanish meats were awesome. The best part was that we received all three paella options, AND all of them had the crispy bits of rice. This is how you know the paella is authentic.\n\nWe tried several gin cocktails that I would recommend, including El Pepino and La Pomada.\n\nService was a bit confusing at times as we were never clear as to who our main server was. This would not have been a big deal except for our drink orders were forgotten a couple of times until we asked the status, and we had two members of our party with allergies which we wanted to ensure was communicated to each server who waited on us.\n\nIt was a small, bustling space, and we were grateful for our large group being tucked into a corner booth.There did seem to be some construction going on somewhere in the building or next door though because there was noise going on throughout the entire dinner."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOGVfS3BBRRAB",
            "text": "I love coming to El born ! The staff, food, and drinks are amazing!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNm9yU013EAE",
            "text": "Brunch is always a good time , food and service always excellent . Definitely will be back for the red sangria 🍷"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNnZLLVNREAE",
            "text": "This is my favorite restaurant for weekend happy hour! I fell in love with the squid ink paella. The service is always polite and the food is delicious. El born never disappoints!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcXRQZ2NBEAE",
            "text": "Love coming here for the  weekend happy hour .  El born is  located in a great neighborhood . Definitely one of my favorite tapas places so far in New York City. Stand out dishes include the paella , shishito peppers , and cod fish . Service and ambience 10/10 !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeXR6X1RREAE",
            "text": "Favorite place for small bites and delicious cocktails. Doesn’t matter who’s behind the bar I know the suggestions to the execution will be amazing. My favorite dish to get is the Octopus. Delicious. Never over cooked."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMHNpV2lRRRAB",
            "text": "I cannot say enough glowing things about this restaurant. I come for the amazing food and high quality drinks, and I stay for the incredible hospitality and wonderful staff. I have been here for multiple different occasions- dates, catching up with friends, seeing family, etc. and each time this restaurant has exceeded the expectations. The paella is one of the best around. I love it here!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdEoySjFRRRAB",
            "text": "I ve been living in Greenpoint for over 10 years, and El Born is hands down my favorite restaurant in the neighborhood. I love everything about it—the atmosphere, the warm lighting, the cocktails, and most importantly, the food.\n\nElena, the owner, is one of the sweetest and most welcoming people you’ll ever meet. The staff is always attentive, and the service is just great—it really makes you feel taken care of. I love coming here with friends to enjoy a glass from their amazing wine selection and share some delicious tapas. It genuinely feels like being in Barcelona on a random afternoon, enjoying good company in a familiar and cozy setting.\n\nThe food is consistently incredible, and they have a super cute patio—I can’t wait for the warm weather to arrive so I can sit outside with a nice cocktail or a glass of wine. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaE9ITGJREAE",
            "text": "Super small portions for the brunch préfixe. The tapas were good but presentation should be improved. The amount of food was not enough to be full by any measure. I left feeling hungry; for the amount of money you pay per person (around 45$ pre tip) you’re better off ordering from the regular menu. The entrées were very small portion as well: « avocado toast » should be on tapas menu tbh. Also would suggest skipping the dessert; the flan was not good. Anyways, service was not good and I did not have good experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNk1yaFh3EAE",
            "text": "I don’t understand why this place isn’t more popular. Food? Excellent. Service? Quick and punctual. Ambient? Super chill and comfortable. My date and I tried 5 tapas and had two drinks and the quality and price were both excellent. I highly recommend El Born and will definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OFBDRmNBEAE",
            "text": "very good but the food needs more salt"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNDlmTG5nRRAB",
            "text": "Fui una tarde de la semana al happy hours con mi hermano,y fue nuestra primera vez y nos encantó,  los tragos y las tapas la atención muy buena, estuvimos sentados en la barra, es un lugar pequeño acogedor  limpio tienen happy hours de 04:00 a 06:00 los días de semana y los fines creo q una hora hasta las 05:00. Volveríamos a probar los platos fuertes."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdThqY3VRRRAB",
            "text": "Great spot, especially for a group dinner. Loved the seafood paella and just sharing different tapas. Great authentic food!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmai1qRnhRRRAB",
            "text": "Can’t go wrong with anything on the menu, such a cute place with great small plates"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaUx6Z0Z3EAE",
            "text": "Le Born is an excellent restaurant that serves tapas in a Barcelona-style small plates, cocktails and wines. I loved their sleek, exposed-brick space which makes the atmosphere quite pleasant. A bit dark but all good. The food was so delicious. Each plate had its exclusive taste and presentation. The staff was very friendly and professional."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeXFudzRRRRAB",
            "text": "Love everything about this place! Highly recommend their happy hour. We tried the wine tasting which did not disappoint. The croquettes, sardine tapas and especially the paella were exceptional. I am coming back to try their other dishes. The staff were very friendly and I loved their decor and vibe"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMWFuNjJBRRAB",
            "text": "El Born is fantastic if you’re looking for an authentic Spanish tapas spot! It actually felt like I was in Spain, there were a handful of diners there that I could hear speaking with Spanish accents. They have a great selection of Spanish wines and the food really helped transport me back to Spain ☺️ would be a great date spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGeXQ2d2t3RRAB",
            "text": "A delicious taste of Barcelona in Williamsburg. The authenticity of Barcelona infused our meal here. We ordered the Chef's Menu and this chef was so generous.\n\nPlate after plate of tapas came pouring forth from the kitchen. Each one so delicious. And by the time I felt like there was too much food then showed up the big pan of paella. Every mouthful, every taste was so good.\n\nThe service was friendly and prompt. The dining hall is narrow and very long with an awesome garden in the back. Every seat was taken and with good reason. Very fair price, especially for this virtual trip to Barcelona."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMHFHclJREAE",
            "text": "Un lindo restaurante, tenia una consulta por el sector y buscamos algo donde almorzar,  así que nos encontramos con el lugar y fue una agradable sorpresa, pedidos 2 entradas que son tapas ( pequeñas ) y una paella para compartir en el menú dice que tiene calamari, pescado, mussels y algo mas...  la nuestra no traía calamari... pero nuestro mesero nos explicó después de traerla que la salsa que tenía era hecha con calamari 🫠 mmm ok (perdón por mi ignorancia). Siento que comí arroz en tinta de calamar con pescado, pero igual me gustó!\nRegresaré a probar las demás a ver que tal, si encuentro mi favorita.\n\nEl lugar es pequeño y agradable, tienen brunch que se ve bien por el precio, también tienen una mesa comunitaria si quieres ir con un grupo grande. Te recomiendo que hagas reservacion si vas con varias personas. Nosotros no la hicimos pero solo fuimos 2."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OHJTZUhREAE",
            "text": "It was an amazing and unexpected Monday discovery of this Barcelona-style tapas bar, abundance of super creative small plates, delicious cocktails & well selected wines were served fast enough and with cheerful attitudes! The place is quaint, yet sleek, added charm with exposed-brick space. Greenpoint in Brooklyn keeps on surprising with culinary delights! I highly recommend this restaurant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqb1oyY3FBRRAB",
            "text": "Came here for a birthday brunch and got seated on the patio in the back. Thought the patio was perfect for a large party, indoors would be more fitting for a smaller gathering. The mushroom croquettes and the paella were great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtd1lET29nRRAB",
            "text": "An experience we thought would truly be great turned out to be not so amazing. The menu items are extremely pricey. The octopus, well tasted like it was dipped back in the ocean before serving. The mushroom dish was hard and unsharable. The drink menu is good at best.\n\nThe service is lagging and the server was a bit unfriendly. The decor is tasteful but the music was too American for a Spanish/Spaniard tapas restaurant. The music at times was off putting and we ended up going elsewhere for a more relaxing ambiance.\nBathroom was clean.\n\nThe place has weird acoustics. It can get really loud very fast. I would check this spot but would use the above for guidance."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNktEVEtBEAE",
            "text": "So glad that I finally visited the place. The experience was great although I can tell they have limited staff. Kinda need to wait a little bit since everyone is busy there, they are kind and welcoming.\nThe dishes were good, I highly recommend the ✨veal cheeks! It was well done!! Melting in your mouth with creative sauce.\nThe only dish that I think it could be improved is paella. The seafood was not a lot and the taste can be more layers but not only saltiness.\nStill, a great place that worth to go for tapas!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSM2NIcnlnRRAB",
            "text": "This spot is truly exceptional! From the lovely ambiance to the friendly and welcoming staff, every detail was thoughtfully executed. The menu is expertly curated, and each dish is a delightful experience. I thoroughly enjoyed every aspect of my meal and cannot wait to return for another visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6c1BMNFFREAE",
            "text": "TLDR: El Born is a Spanish spot in Greenpoint with tapas, rices, etc. It is nice to have an option that's not all the way in Manhattan and something other than Boqueria. Gambas and Montadito were our favorites.\n\nWe tried this on a Friday. It's a cozy little place and very dimly lit, nice for a date night or an intimate conversation. There's the usual run of Spanish tapas but a few twists on things.\n\nOur two favorite items were the Gambas and Montadito. The shrimp is de-shelled, the oil is chock full of garlic slices and overall the flavor was solid. The shrimp itself was cooked well and plenty of bounce to the bite. The Montadito was a crostini basically with a beef carpaccio, manchego and artichoke. Classically Spanish and what's not to like.\n\nThe Bravas potatoes were interesting. They were served on top of each other, more crispy smashed style and a dollop of aioli on top. Enjoyable but I personally prefer the smaller dice and the traditional way.\n\nThe squid ink paella wasn't bad and at $50 for a pan for 2, very fairly priced. There was a good amount of seafood in it, my only gripe is it was a bit wetter than I'd have liked. I like that socarrat fried hard on the bottom, I want to struggle to hold the pan steady as I scrape that goodness off the steel.\n\nNonetheless, a decent meal and a good option if you want some vino and small bites."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxcXAyZUt3EAE",
            "text": "I had an amazing experience at El Born! The classic Spanish tapas on a Friday evening were outstanding. The service was impeccable, and the ambience perfectly captured cozy yet upbeat Spanish vibes, all in the heart of Greenpoint. The ribs were an absolute highlight, easily the best I've had in a while."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleThmejlRRRAB",
            "text": "Pros: the tapas were tasty, the sangria was perfectly on point. The bottomless menu is worth it for the price. The service was nice and polite.\nDates wrapped in bacon are to die for.\nCons: the seating situation is uncomfortable if you have a group of 5.\nThe desert was too bland and not good at all. The menu is actually confusing for the bottomless and it’s restricted to 1 per table basically which was weird and really confusing the waitress said herself ..yeah it’s a bit weird..\noverall nice little place for a short while."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdzlTQTJBRRAB",
            "text": "Great date night spot. Most dishes were outstanding such as the tuna tartare, carpaccio, the oxtail, and the croquettes. We could have passed on the patatas bravas and the avocado."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSb0s2T2p3RRAB",
            "text": "One of the best brunch places (and deals!) I found in New York. Bottomless mimosas and sangria, a choice of four tapas dishes from a wide selection offered, a choice of two entrees or a paella for the group, and dessert all for $35 a person?! Wonderful service from staff and the back outdoor area was perfect for my group to eat and talk."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaHFuMzhnRRAB",
            "text": "Great bar/restaurant.\n\nWent for tapas at the end of their happy hour and I was surprised by the excellent prices.\n\nFoodwise, with my wife we had the cheese platter, charquterie platter, tortilla espanola and the croquetas. The best was the tortilla espanola with the rest being okeyish.\n\nSangria was good, they also had a great selection of beers (not many draft though) and wines.\n\nService was very friendly.\n\nWould recommend and will come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNy1YUGpnRRAB",
            "text": "Met up with friends for brunch at El Born and was so impressed with how wonderful the food was and how they handled our large party with ease. The brunch pre fixe was a DEAL! Will definitely be back soon to try more dishes but the squid ink paella was a highlight."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzZzQ3eTBnRRAB",
            "text": "This place is actually a wonderful, chill spot. I’ve been a couple of times in the past month and the quick highlights of it are fantastic Spanish tapas, a great cocktail menu(with a variety of delicious gin and tonics), and a really great…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXay1qbXNBRRAB",
            "text": "El Born is a favorite of mine. I have been here on several occasions and the food has always been consistent. This place has a great variety of tapas and also has paellas.  So many good staples here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyemNxN1BBEAE",
            "text": "Delicious drinks, helpful staff and good food.\nCame here on a Tuesday and stumbled upon a “Tapas Tuesday” special - unlimited tapas (from a selection of 5ish), 2pp at a time. Also ordered a couple meat dishes to round out our dinner. Left full and tipsy - the perfect combination!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhamNXVDRRRRAB",
            "text": "I cannot emphasize enough how GOOD the food was. I got the bottomless brunch option with one friend.\nFrom the tapas to dessert, literally every single thing was so AMAZING, the flavors, freshness and overall quality of food was 10/10.\nThe price you pay for the quality of food and service was definitely a steal, it was so reasonable I was wondering if I was even in New York anymore. This place will not disappoint."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dDZURFRnEAE",
            "text": "Very skimpy on seafood squid ink Paella with barely any seafood. Two pieces of shrimps and a tiny bit size piece of fish and couple of clams and couple of mussels. These ingredients are not costly at all. They could do better with this dish! This is two orders of seafood paella with four small sized shrimps and one piece of squid unbelievable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNseEl5MFZnEAE",
            "text": "My husband and I went for the Tuesday deal on tapas (unlimited small plates until 9pm from a specific selection), the place was buzzing, absolutely great vibes. The salty peppers were phenomenal, as well as the patata bravas and little anchovy bruschetta. The let down was the paella, way too much squid ink, it was so overpowering that we could barely taste anything else. Plus both the rice and the fish were really overcooked and chewy and overall not that much flavorful. Drinks weren’t good either, too sweet, and not spicy at all (they were supposed to be). The restaurant is cute and cozy and the service nice.\nIt’s a great place to go to on a Tuesday and the tapas deal is definitely good, but they should really work on their seafood dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMblp6MVlnEAE",
            "text": "The vibe and atmosphere was super fun! Service also super nice!\n\nFood was not as special or good as I thought it would be. Solid place to try but would not need to come again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPenNmeG93RRAB",
            "text": "Really enjoyable. The menu names are actually in Catalan not Castilian Spanish which is interesting. It is authentic to some degree. The dishes are either really good or just what you’d expect. Service is fast and accommodating. Enjoyed my time here and would come back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyc3V2LUZREAE",
            "text": "Everything is delicious!! Paella is of course amazing but the tapas are surprisingly impressive as well! The meat tapas are really outstanding!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleU9lc2lBRRAB",
            "text": "Don't go for the brunch deal if not for the cheap drinks. Tapas is good quality ingredients, but the pictures are servings for two, $70-90. The portion for a full brunch is ridiculous (yes, for tapas), but there is a good doughnut place next street. Sunday morning the service was busy and lazy (eg they added credit card fee without asking if I'm paying cash, took 30+ mins to take orders, forgot dessert). Mimosas and sangrias were fun. We were really confused about the two pieces of cheese (1 of the 4 tapas choices), the half dessert or requiring family style orders instead of tapas (well, the portions explain it, serving one tapas instead of two)."
        }
    ],
    "reviews_count": 77
}