{
    "name": "Rule of Thirds",
    "place_id": "ChIJaQRXYuRZwokRHjAN5MkBizY",
    "grid": "BK1",
    "address": "171 Banker St, Brooklyn, NY 11222, USA",
    "rating": 4.3,
    "user_ratings_total": 1516,
    "phone_number": "(347) 334-6684",
    "reviews": [
        {
            "date": "12시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cVJEVnZibDl4YUVzNE9IbFNOSE42Y1V0TWNsRRAB",
            "text": "Favorite restaurant in all of NYC!\nFrom Carolina, Lauren, Chris, Fede, Niv & Raya — the sake, food (literally everything), and service are next-level.\n\nHands down the best dining experience — every drink and dish is spot-on, and they’ve got tons of allergen-friendly and vegan options.\n\nMust-try: the Sakate wing with egg and rice, salad, and mushroom skewers."
        },
        {
            "date": "23시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNWFUQjJiVlptWkV0S1JuTnhMV1ZyWkRZdFFWRRAB",
            "text": "Been here 4 times, never disappointed once!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MlZXUlZSa1JtUjIxRWNFMHhkelF3Y0ZoalJsRRAB",
            "text": "Why did I wait so long to try the food here? The food here satisfies something deep inside. Every extra item tasted delicious, featuring spices outside my comfort zone. The staff displayed remarkable friendliness and willingly addressed all inquiries. I recommend this restaurant wholeheartedly."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxb1YwRlNaWGRUUkMxWFowTmpYM0pIUVZSa1dGRRAB",
            "text": "Best dinner I had in Brooklyn"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNVJsTkVjM2t6Y2xCTk5sZ3RZWG8zWDJRdGRsRRAB",
            "text": "Finally got a chance to visit Rule of Thirds tonight. All the staff were so friendly, and my server Julio was incredible! Everything was delicious and really reminded me of the amazing food I had in Japan. My favorites were the chutoro sashimi, wagyu sukiyaki, and the white sesame soft serve. We spent about $110, and it was absolutely worth it. Can't wait to go back soon!"
        },
        {
            "date": "1주 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaU5FVXpOMHM0VDFkRWVGVkJlSEJqZDFSWlVFRRAB",
            "text": "맨하탄에서 벗어나 한적하고 멋진 공간\n실내와 테라스 모두 좋고\n브런치부터 간단한 사케까지\n일본 음식을 힙하게 풀어낸 레스토랑입니다\n음식들 비주얼이 감각적이라 사진찍기 좋고\n직원분들 모두 서비스 친절했어요\n시그니처 메뉴인 케키(수플레)는 꼭 주문하세요!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FeU5sRlpkVWR6Y1dsVU1Ib3pUblIyVjBGV1MyYxAB",
            "text": "Great place for a wedding"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTWVWcEtlVXh4WDB0UlkxbExOVTF1VmxoRGVXYxAB",
            "text": "Can you fall in love with a salad?\n\nRule of Thirds is a place that reminds you a bit of love—with each dish being an affirmation of this. The staff is the embodiment of the thought when it comes to fine dining that each day is an opportunity to make someone’s day. It is my opinion that dining companions include your server and the other team members who help them bring the experience to life for you. Particularly, David, Nick, and Priscilla are all fabulous dinner (and brunch) companions.\n\nNot one dish leaves you wanting. Each one a delicate exploration of flavor. Whether it’s a warm or cold dish, you’re left with a warm soothing sensation.\n\nDining, like many experiences, is a channel through which we who live in modern society might regain our humanity and pleasure, moving away from modification and optimization.\n\nRule of Thirds is one of my favorite restaurants. In a city of constant revolving choice, that is saying something.\n\nThe miso soup is divine and unique. I’ve expressed enough an utterly indescribable love for their hot honey salad. Try anything with mushrooms. And, of course, all fish dishes are made with the Japanese flair and artistry.\n\nFor the sweet tooth: the grilled mochi cake is surprising and a welcome new flavor to the tastebuds. The sesame soft serve is divine—in the summer or winter."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aU01rSk9SbTVXZWtsWFpXSnRYMHgyUnpneVUwRRAB",
            "text": "Awesome Japanese breakfast in a cool space ( inside and out). Not too noisy. Heaters outside are strong. Lots of gender neutral bathrooms, and one accessible restroom.\nWe will be back for dinner"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNE5HRlNlRTVEVDBGV1kzRkpUVGt6VWpCd01tYxAB",
            "text": "Rule of Thirds is okay—the drinks are decent and the food is fine, but nothing really stands out. The vibe is relaxed and the staff is friendly, but it felt a bit hit-or-miss overall."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeVptcGZkRzF2YUZSYU9XZGhZMUpxVUdSNVdFRRAB",
            "text": "Amazing service and atmosphere.\nFavorite dish was the chirashi (smoked roe was amazing)\nThe branzino was ok- flavor was unique but thought it wasn't evenly distributed in the dish.\nThe mazamen had great texture and using three types of noodles was innovative, but the sauce lacked the seafood \"umph\"\nTuna and nori were edible but not flavorful.\nThe food here is decent but not amazing. The presentation was really nice as well. Overall thought it was a bit overhyped and overpriced."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ga1NFRTJXRlY1VkhBMmNGa3pPVmRXYWxGNmJIYxAB",
            "text": "One of my favourite restaurants in the area! Rule of thirds consistently has a great menu, friendly service, in a beautiful setting!\nLast time I was here, got the corn salad and mazemen (faves), karaage and tuna tartare, as well as the hamachi collar and pork katsu. Highly recommend everything! And if you’re feeling like drinking, the house special sake and cocktails are great."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNd2NVSk9ZMEpRTjI1Uk4yUkRTVzFJY0ZsUVExRRAB",
            "text": "Rule of Thirds is a superb modern Japanese restaurant. The skewers are flavorful, the fluffy umami pancakes are incredible, and everything feels thoughtfully prepared. Beautiful decor and a relaxed, welcoming vibe — brunch and the breakfast set menu are especially worth trying."
        },
        {
            "date": "4주 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGT1pqTlVjVE4yVms1ck5tMUNjVzlJTmxjMU4yYxAB",
            "text": "جداً تمام"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSVJtWlpiVVZwV0RkQk5qSlZNRUZ2WlhaTFluYxAB",
            "text": "I don't get the hype. The space is beautiful, but the \"courtyard\" is under this tent which makes it look sort of like a camp on battlegrounds. The food is ridiculously overpriced. We ordered a katsu sandwich which was $22 but they said they had \"no ketchup\". What brunch serving establishment has no ketchup? And then the tuna appetizer was merely a small ball of tuna meat and a few slices of seaweed, barely worth $16. I had to prompt the waitstaff several times for my drink order and they only brought it to me finally when I asked once more at the conclusion of my meal... I cannot believe the matcha and hojicha are from tea bags, and that it costs $6. We came in for a light bite after hearing great things but ultimately very disappointed that the total rang up to $60 for an obviously overpriced meal; the cherry on top was the tip screen shown with suggested \"20, 22, and 25%\" options..."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Q1N6UjFlR2hJYlhkb1l6SjVWVVZDVG1kNk9IYxAB",
            "text": "We recently were the floral designers for a weddings here. The event space is really beautiful and deserves a highlight.\n\nThe venue coordinator was clear and good at communicating to vendors. The staff was respectful and kind and made everything easier. All of the behind the scenes magic you want to hear about when looking for a venue. :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKa1pUQklZMHhVTFZoRGQyUnZSMFZ0Vlc4d1gyYxAB",
            "text": "Had a 2.30pm reservation and arrived early at 2pm. Checked in and asked if we could be seated early, the hostess said “yes, shortly.” Ten minutes later, we checked in again and got the exact same vague answer. After waiting around for half an hour, we were finally seated at 2.29pm, basically our original reservation time.\n\nIf they couldn’t accommodate us early, that’s fine and we completely understand, but just say so. Instead, we were strung along with empty reassurances and zero updates until we chased for them ourselves. Really poor communication and a frustrating start to the meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OZk5FTXlOVmN3TlY5T01uWnVWSFoyVkVWelJFRRAB",
            "text": "Good but expensive. $50 per person for 3 dishes before tip. Nice interior, very airy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201U05tRkdjakpqTW5odVlWRlFjbWhxWmtSdmJuYxAB",
            "text": "I had high hopes coming in, as the restaurant always has served memorable meals for me. Unfortunately, my experience today was concerning. The pork cutlet I was served was significantly undercooked in the center — still very raw and pink — which poses a serious food safety risk.\n\nWhen preparing a dish like tonkatsu, presentation and flavor matter, but so does ensuring it’s cooked properly. Serving pork at this level of doneness is not acceptable, regardless of how good the breading tastes.\n\nI hope the kitchen takes this feedback seriously and improves their quality control, because the atmosphere and service were otherwise fine. Until then, I would advise caution to others ordering pork here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMFZXUnRZWFZ4Ym5nd1RUWkhUME5TVmw5VmVrRRAB",
            "text": "Today we went to Rule of Thirds for brunch, and unlike our previous dining experiences where the server is knowledgeable and welcoming, that was not the case this time. The server seem to be very remote and unfriendly. Needless to say, we were disappointed. And this is so out of character for this restaurant, which is one of our favorites in Williamsburg."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbmRDMVRObWMyU1dGbmMwVmllbU5OWkdWS1UxRRAB",
            "text": "Always an excellent time at Rule of Thirds. The decor and atmosphere is beautiful. The staff especially Joanne is very knowledgeable about the food and explains it well. The food is just delicious. ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeFl6TTBSWGRZTm5Sc2MxcHZSM0p5WlROSmNVRRAB",
            "text": "Loved the atmosphere for dinner more than the food\nThe chicken Karaage is my favourite on the menu"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcFRYcFViM1Y1WmxoWk0zVkdTR1pJUTBFM2JYYxAB",
            "text": "Had the most incredible meal here with a small group for a work dinner. From start to finish, our server cultivated an experience. We did the duck and it did not disappoint. We had some sharables to start and we never felt rushed. The quality and portions were abundant. We will be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sZlRUWTFSSFJETVhGMldGTXhiRnBrYWtWTE5HYxAB",
            "text": "No misses - on their famous brunch or delightful dinner courses- except for me not taking any pictures of the food minus the ice cream (was occupied with chowing DOWN!). The flavors lean umami with rich underlying complexity from fresh herbs and other sources. The mead and veg are cooked well.\n\nThe service is courteous and attentive. The interior design is peak - I want to know who the designer is!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSldXMHpObDlpVEVWd1V6bHpkM1JzWlVka1MwRRAB",
            "text": "Steller as always. The style is meticulous and very intentional with everything from the staff, to the decor, to the food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSVFTMVpPWGQ0TkdOVVYyaFBhbXRCU1dOS1gzYxAB",
            "text": "Vibes were immaculate. Food was extremely yummy. Cocktails were top notch. And the servers were soooo helpful and friendly. The server really helped guide me through the menu and pick the perfect dishes that matched what I was in the mood for. So many unique and fun cocktail options. Would absolutely come back here.\n\nWalked in Wednesday at 7pm and there was no wait for a table for 2."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aelRWQlJUR3RxY1c4MGFHWkpkWE5LWkc5UFEwRRAB",
            "text": "Interesting dishes, real Japanese food, everything's very stylish, I can't understand how come some guests posted poor reviews, it's unfair to such a nice place. Worth visiting, you'll enjoy for sure!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVFEwVlBNR1V0UlZWV04zb3hXSGh2ZGxCVlduYxAB",
            "text": "We got married at Rule of Thirds a couple of years ago, so it’s become our anniversary tradition to return. This year was extra special as it was our first restaurant outing as a family of 3 with our 10-week-old. We booked a 5pm reservation to keep things easy and as always, the team here was warm, welcoming, and so accommodating. We never once felt out of place with a baby in tow. The food was fantastic as always, but it’s really the staff that make this place so memorable for us."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMFJtd3djamxqV1VFMFZFdE1jMFZDWlhkd2VIYxAB",
            "text": "One of the best great staff and lovely place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcmNVWk1WMkp0YVVwa05UWkZUV3RHZFdKd1ZHYxAB",
            "text": "Food was good. We enjoyed the gyu don and pancakes. Would love to return and try their drinks. HOWEVER,\n\nThe experience here felt really strange and uncomfortable. While waiting to be seated, we were given menus. Once seated, the hostess came back and insisted on taking them away. When we asked if we could keep looking, she snapped “no, your waitress will bring you one,” in a very irritated tone.\n\nThings didn’t improve once we were seated at the bar. Our server (blonde, ponytail, several ear piercings) came across as aggressive and unfriendly. She snatched the plates away the moment we finished, slammed new ones down, and responded very sharply. The overall attitude felt unnecessarily rude and off-putting"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc2FEZGtYMmRyYkVSWldsUnJNRU5HVWtGaGRsRRAB",
            "text": "Super yummy, loved the soufflé pancakes (although def share it with friends), had the chicken katsu sando which was delicious as well. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMVFVWlVWbmhZTnpOWVRtcERhR2g1VTJKUFVuYxAB",
            "text": "It’s a little loud but super good food and always consistent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seVozRk5ibWh6TkhNd0xWUm1ia1ZJVUZsMWRuYxAB",
            "text": "This was an amazing find! We came here to celebrate our anniversary and the staff prepared a little greeting card which was so thoughtful.\n\nThe food was amazing - we ordered the Wagyu Sukiyaki and the Grilled Hamachi Collar, both were delicious. The Summer Corn appetizer was great. The dessert, particularly the Sesame Ice Cream was fantastic.\n\nOur server Yuyu made our experience wonderful; she took the time to give us her recommendations and was altogether just a lovely person."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNVRHOXVhVEJXY2podVlubDNabXBXYUdsYVFYYxAB",
            "text": "Beautiful space, especially the outdoors part. Food is expensive but really quite good. Surprised the rating average isn’t higher, tbh.\n\nRecommend the wagyu soup. They add the bone marrow in in front of you - it gets infused in the broth and then you can taste it in every sip."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNMk5XRmlhbGM1WlRKWWNrRkNRamRNTTI0M1ZGRRAB",
            "text": "The food is pretty bad, go to Konban if you are craving katsu instead. This place doesn’t do it right at all"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sM09USnlTVmN4YkZSUU5ucDNVMUZpVUcxUWRGRRAB",
            "text": "If you know, you know — Rule of Thirds is one of those Brooklyn gems that feels hidden until you step inside and suddenly you’re transported to Japan. The atmosphere is otherworldly, like slipping into a different universe the moment you walk through the door.\n\nJulio took incredible care of us from start to finish. He guided us through the menu with thoughtful recommendations and helped us order dishes that blew us away. The duck heart was perfection, the chicken meatballs were rich and comforting, not to mention the wagyu (especially with the extra side of marrow — highly recommend!), and the frozen cocktail was both fun and delicious. Just when we thought it couldn’t get any better, Julio surprised us with sesame soft serve that was the perfect ending to the night.\n\nWhat really stood out, aside from the food, was Julio’s hospitality — he explained what to expect, shared details about the dishes, and made the whole experience even more special. Honestly, why book a flight to Japan when you have this kind of magic right here in Brooklyn?\n\nCould not recommend Rule of Thirds enough — it’s the kind of place you’ll want to keep going back to, and one you’ll never forget. (The physical plates themselves are super cute too!)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVlRubHdOMlZFV2pSS2JtOXZNR1Z3ZDNaT2FtYxAB",
            "text": "First time visiting this unique place with my bestie, and it truly felt like stepping into Japan. The interior design is stunning. rustic touches mixed with modern details, and the ambiance is cozy yet vibrant.\n\nThe food was on another level. I tried the fried chicken katsu and the soufflé pancake.. both were absolutely delicious, with perfect textures and flavors that stood out.\n\nThe service was exceptional, super attentive without being intrusive. From start to finish, it was a delightful experience. Highly recommend if you’re looking for a unique Japanese dining vibe in the city!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVFYwRkJhSGgyUW1wQ1UydHZORTloYTJwMWIzYxAB",
            "text": "Weird experience here. They claim to be dog friendly and we have a small dog (6lb maltipoo). When we sat down I gave her some water out of my cup. Someone (maybe the manager?) then came up and was upset saying that they’d have to throw away the cup and that she needs to drink out of a bowl and also that she’s not allowed to touch the table. I understand maybe it’s a health code thing - but his attitude was bizarre and unfriendly. They also said we were not allowed to sit in a booth with her. Which again I get it, but the vibe felt very off. If you don’t want to deal with dogs, just don’t allow them.\nRegarding the food the best thing was the potato smash - truly delicious\nThe pancake is definitely an overhyped social media dish\nThe karaage chicken was overcooked and chewy but had very good sauce and flavor.\nOverall probably won’t return just because of unfriendly staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSalRXTnhabWg0UjBRMlVWWjJUalEwTTBGSlVsRRAB",
            "text": "Came here on a Sunday at 12:30 with a reservation for a party of two. We were able to get a great pair of seats that looked into the kitchen which was a lot of fun. Our orders were promptly taken by the wait staff and they were helpful with any questions we had about the menu. The karaage was crispy and was drizzled with an awesome tartar sauce. Great appetizer! I got the chicken katsu sando which was large, crispy, and was complemented by the soft Japanese milk bread. The mustard, mayo, and radish was a fantastic addition to this sandwich. We were too full to order the enormous soufflé pancake, so we went with the sesame soft serve which was a great dessert to top off a very enjoyable meal with. Definitely recommend trying this place if you’re in the area!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNTzF0SnJPa3RPdzdRRRAB",
            "text": "The pancake was delicious and unique! Only available for brunch and not dinner though"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNVQzbHBNMUkwVnkweU9HSXlaMGh4UnpkUVRYYxAB",
            "text": "Seems like everything is on the sweet side, overpriced, but I do like the service and friendliness of the waitresses!\n\nIn response to Lauren =) I was hoping to try some of the dishes I've seen in customer photos, but I noticed they are only offered on your lunch menu. So I was disappointed. Maybe those popular item should be offered during dinner as well since they are so popular."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTWNteHZhRGxVVHpWRlZIcHNXRkZQVjA1UWIwRRAB",
            "text": "Aesthetic place. The outdoor setting is beautiful, and the Japanese soufflé is good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSFoyTmxVSFl6VVdoNVZVMXRPVkptYXpZNFFrRRAB",
            "text": "Very cool location, great vibes and lovely food! Highly recommend if you can get a table"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscE9GcFlNRjk1VVZwQlprWkdWVVZpYVhkRmVXYxAB",
            "text": "Wonderful experience. Food was great, service was 5* and cool atmosphere. Would highly recommend this spot."
        },
        {
            "date": "2달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WQ09FOXdaMnd0VVVSaVNEbGxNVFl0TUZRdGFuYxAB",
            "text": "핫케이크 먹으러 브런치로 왔는데 굳이 안먹어도 될 것 같고 오히려 치킨산도랑 콘 요리가 넘넘 맛있었어요!! 튀김 예술 & 빵이 넘 맛있었어요🤤\nBut please turn on the AC!!!!!!🥵🥵"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MUpYdU9nEAE",
            "text": "welcoming restaurant with vibrant indoor and cozy outdoor space, all food was delicious, small plates great for sharing, quality drinks."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MlRVNVVXRkJLYm05aE5rSmhRMDFvUVUxbGRsRRAB",
            "text": "Rule of Thirds is a top spot in Brooklyn. Came for a Sunday birthday brunch, and we were treated with grace. 1/2 our party was late and they were so accommodating.\n\nService: Excellent\nAtmosphere: Fun with modern industrial vibes with a super clean presentation.\nFood: Tasty, diverse menu, reasonably priced.\nWill come back for more."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcVpYVTVObk5ZV1RWdlpqaHlRbU5HUlRSRU5uYxAB",
            "text": "No fue lo que esperaba. La oferta de comida no era muy grande y lo que pedimos no fue gran cosa. No tienen el sándwich de tonkatsu ni el panqueue soufflé en horario de cena. El lugar y el ambiente muy lindo"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MU0wVlNORk51V2pONVdFVkNRVWgxYzNsUkxYYxAB",
            "text": "Not very clean."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMXZPUENREAE",
            "text": "A wonderful location to celebrate any occasion. The staff are informative and friendly. The cocktails and food exceeded expectations. It's notable that for \"kitchen counter\" reservations, you cannot see into the kitchen very well, however we were easily accommodated with a table instead."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSa1l6SDVnRRAB",
            "text": "서버분들이 굉장히 친절하다. 맛도 갠춘. 분위기 좋음."
        },
        {
            "date": "3달 전",
            "language": "zh-Hant",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWFMyMUdiMFpTZW5rM1JFUlNlVlpHY1ZGWlRVRRAB",
            "text": "Rule of Thirds 的環境確實很美，我們抵達時剛好趕上 Happy Hour 尾聲，點了幾樣 HH 的食物和雞尾酒。HH 的餐點表現不錯，但雞尾酒實在是淡到幾乎沒味道。\n後來加點的正餐類食物，感覺很普通，沒有特別驚艷的亮點。讓人有點困惑的是，週一晚上店裡生意卻好得出奇！\n不禁好奇是我們沒點對菜色，還是這家店有什麼隱藏魅力"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdlRFaEZkek5TV25kTWVrRlVORVF6VGxCNFRHYxAB",
            "text": "This spot is beautiful! The atmosphere is super chill, with a really nice outdoor area. The food was excellent; I tried new, exotic, and delicious flavors. Highly recommended! The sesame ice cream is incredible. It's ideal for going with friends and ordering lots of dishes to share."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVGQyODRMV2RFWVVsbU5EVjRVMWhyT1VSSFIxRRAB",
            "text": "Came here for brunch on a Saturday. Food was amazing and our waiter Julio was awesome. 30 minute wait around 12:30. Ordered the Japanese curry, fried chicken, cucumbers, tuna and nori, and pancakes. Pancakes were delicious and some of the best I’ve had. Would absolutely come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd1VEaERjVnB0VmtoMGNFZFlNWHAzV0RCeFVVRRAB",
            "text": "We had a good experience at Rules of Third, especially since we came to celebrate my birthday. The space is beautifully decorated with a modern touch, and the layout was thoughtfully designed. There’s a divider in the center that adds a bit of privacy between some of the tables, which made it feel more intimate. A sweet gesture was the birthday card they gave me when we were seated.\n\nWe started with the mushroom skewer, which was seasoned nicely with fresh herbs, and the duck hearts, which were cooked perfectly with a slight sweetness. The highlight was definitely the roast duck, which feeds about 3–4 people. It was brought out whole, then carved and served in three courses.\n\nThe first course featured sliced duck breast served with lettuce wraps and a variety of eight dipping sauces. Each one added a different flavor and made the dish feel interactive and fun. That said, one downside was that they didn’t offer to let us take all eight sauces to go, we were only allowed to pick three, which felt limiting, especially since the sauces were a big part of the experience. Since it was just the two of us, we ended up with quite a bit of leftover duck.\n\nThe second course was duck fried rice. It leaned on the oily side, but the presentation was nice—topped with two raw egg yolks that the server mixed in tableside. The accompanying sauce helped cut through some of the richness.\n\nThe third course was duck broth. While it had good flavor, it was overly salty and the portion was very small, not even half a cup. It would’ve been better if it came with something to balance out the strong seasoning.\n\nTo wrap up the meal, we ordered the mochi dessert, which they kindly brought out with a candle. I appreciated the gesture, but I didn’t really enjoy the flavor of the mochi something about it didn’t quite land for me.\n\nService was attentive and the food had creative elements, but a few details missed the mark. I’d give it a solid 3.5 stars if that were an option."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RFMxQkhRbUpMTWt0NE5HVkhRM1F4ZDFsU2RHYxAB",
            "text": "I had the absolute best time at Rule of Thirds for brunch. My husband took me for my birthday and the staff took care of us like we were rock stars. It was some of the best hospitality I’ve ever experienced at a restaurant. Our server, Julio, was a gem and kept surprising us with little goodies. A chef and a manager came out to speak with us about the food, and even brought us some wet naps when he saw we were enjoying our burger and it was getting all over our face! The food was exceptional. We loved the nonalcoholic mixed drink options (the melonade was insanely good) and our favorite dishes were the tuna tartare (a gift from our server! Ty!!!) and the wagyu burger off the secret special menu. You can’t miss at Rule of Thirds, and they really go the extra mile to make your experience a special one. Thank you for exceeding our expectations!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVmVUbEJlVEYyYkdGRVUxTXdUV3B6V0ZGTE5sRRAB",
            "text": "So much seating, yet always packed… a testament to how popular this place is! I love the aesthetics, and the service was super attentive.\n\nAs for the food: the smashed potatoes, chicken Katsu sandwich, and (of course) the pancake were all fantastic.\n\nI’d skip the Donburi, though- it was flavorless"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taM1pXWk1kREZvWldoa1NHdzBSbVo2ZVhVMk9HYxAB",
            "text": "Wonderful atmosphere both indoors and outdoors thanks to the wooden aesthetics. We walked in at around noon on a weekend and were seated at the bar right away (they also had outdoor seats but no a/c). The dishes were all great and affordable! The katsu sandwich was huge for only $18. The salmon was $28 but it was very soft and good quality. The drinks were $17-$18 which is also on the cheaper side for cocktails with a good mix of ingredients. Nothing feels upcharged and in fact they’re a steal for a place like this in nyc."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbzZpVzFRRRAB",
            "text": "I came here to celebrate my birthday and was absolutely blown away by how thoughtful and accommodating the staff were. They surprised me with a birthday card, complimentary appetisers, and even a round of sake on the house — such a kind and personal touch that really made the night feel special.\n\nThe staff were incredible: super attentive, friendly, and genuinely made us feel welcome from the moment we walked in. And the food? Absolutely delicious — every dish was packed with flavour and beautifully presented.\n\nI can’t recommend this place enough for a special occasion. Huge thanks to the team for making my birthday so memorable!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJTDc2LUd3eHVmYllREAE",
            "text": "A popular brunch spot in Williamsburg and finally paid a visit. The restaurant itself was well designed, airy, spaced well with lots of wood elements, and noise level also pretty good, you can have a normal conversation. The food was decent. Highlights were the sandos, and only the sandos. Both the pork and fish were great. The fried pork cutlets were very crispy and the pork inside was very juicy. The fish one was also great, and we loved the scallion sauce for it. I would recommend just getting their sandos. The rice bowls were alright, we got both the beef and the curry and they were okay, nothing special. We of course had to get the famous pancake, but honestly it’s mediocre. It’s thicker and more fluffy but also a bit dry. We got the black sesame ice cream to go with it and the ice cream was too sweet in my opinion. We also had an unpleasant experience with check-in. We arrived on time and were made to wait, and when we were told our table was ready, were taken to one of the outdoor tables when I booked indoor. When I told the host that I booked indoor tables, the male host was unprofessional, tried to gaslight me by saying that I “prefer indoor table”, and I told him it’s not a preference, it’s what I booked. We got an indoor table in the end but the hassle was a letdown. But our actual server, Sam, was helpful and friendly. Overall, recommend trying their sandos."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOLWYtWXV2a05mb0l3EAE",
            "text": "Was trying to come here for years to have their hottokeki pancakes.  I was finally able to get a reservation for brunch.  I must say it did not disappoint at all.  The pancakes were fluffy moist not too sweet and all around wonderful to enjoy. The size of a pancake it definitely feed a few people. Also got their kankuri donburi bowl. The pork was tender and moist. I would definitely come back here again for brunch."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJekxmY013EAE",
            "text": "My honest opinion.  My friend and I decided to go here for dessert. The menu felt overwhelming and took time for us to find something to order.  Just for it to be mostly drinks and a very small menu. The scallops and salmon were delicious but limited to maybe sundays.  The beef sukiyaki was delicious.  The chicken meatball felt mushy.\n\nThe item i would say don't get is the onigiri. It was delicious on the outside, but the inside was just mushed up rice that looked like leftovers. I couldn't finish it because it was that bad. Also, DON'T GET THE ALMOND BUTTER MISO SOUP. Someone in the kitchen got too creative, and that soup was nasty with a capital T.\n\nOverall, it is a beautiful restaurant and excellent service. I felt stuffed after the visit.  It is better suited for people who love to drink and have small snacks. Also, pricing for food is a bit questionable, but hey, if u got the money, spend it"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJb3REZnNnRRAB",
            "text": "Our experience at this restaurant was a bit mixed. The drinks were definitely a highlight, especially the non-alcoholic options — they were refreshing and thoughtfully crafted.\n\nThe food, however, was just okay. It was pretty pricey for what we got, with small portions that didn’t quite justify the cost. The macaroni was the standout dish — creamy, flavorful, and comforting. Unfortunately, everything else we tried felt pretty basic and underwhelming, especially considering the price point.\n\nAtmosphere was great, very spacious restaurant, service was really really good.\n\nOverall, it’s a nice spot for drinks, but we’d probably think twice before coming back for the food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LTVfWTlnRRAB",
            "text": "Truly a wonderful and unique experience. Pricey, but worth trying at least once. Innovative and delicious dishes, incredible ambiance, and attentive service all add up to a fantastic meal. As a group of 8, we went for brunch (had reservations ahead of time) and everything was wonderful. The fluffy soufflé pancake was a great experience, but I’d skip the side of ice cream, it’s quite a small portion. Thankfully the pancake itself is massive and was more than enough for 8 people to share.\n\nI went on to have the Japanese Breakfast Set, and it might be the best breakfast I’ve ever had. Between the fish, rice, egg, veggies, and almond miso soup, it’s actually quite a lot of food - but because it’s all so healthy and fresh, you don’t feel overly full. I’d come back just for the breakfast set."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214b09YaFNZMHRVUjJwWGJFdEZkVVJ3VVVOT1FrRRAB",
            "text": "Came here for the first time yesterday. The food and service were amazing! Me and my wife had a spectacular time here. Will definitely come back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNk5iTS1RRRAB",
            "text": "Extremely overrated!!! If the prices were half of what they are, it wouldn’t be so bad.\n\nFood was definitely just ok. Bland all around and portions are relatively small. They pack the donburis with rice with little content. Colors aren’t appealing either. Food only resembled Japanese cooking by name and not taste.\n\nEither they use poor quality tea or just not enough. Very milky with no taste. Servers came to try to take our pancake dish every 2 minutes. My guess is they were short on those plates. We still had a portion of pancake in there as well.\n\nI think people mostly come here to drink because there is a massive drink selection. Wouldn’t come again for food. Not a single Japanese chef spotted in the whole kitchen or staff. This is a Japanese restaurant ??\n\nAlso hate places that come up to you with their tip machine. Shameless tactic. 25,22 or 20%. What a joke."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MUxIWXV3RRAB",
            "text": "Had a dinner date last night at this spot that has been on my never-ending list of places I want to go. It did not disappoint. The cocktails are inventive and delicious. This is a great place to order a bunch of stuff and share, because of the level quality each dish has. It also has a beautiful and trendy atmosphere. I can see why many people have their wedding there. Make a reservation, it does get busy. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeXMzR1dBEAE",
            "text": "Came here for dinner and loved both the wide variety of food but also the high quality. The duck rice was my favorite but a lot of the small plates including the mushrooms were very good. The space is beautiful and Service is very friendly. Would come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbDZtdVZ3EAE",
            "text": "Year after year Rule of Thirds continues to be my favorite restaurant all-around.\nWhile it is on the pricier side, it’s also very unique. Most restaurants at this price range have a menu that, while good, I have seen before. This is most definitely not the case here, even the cocktails are oh so special—don’t sleep on the Lebowski-San."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M2ZucHlRRRAB",
            "text": "I wrote this review on Yelp back in September but just wanted to share it here as well. We absolutely loved our experience at Rule of Thirds! Even prior to arriving, I had emailed them about some special requests about pre-ordering the food and the timing and they were beyond understanding and helpful. After arriving, every server and worker we had encountered was extremely kind, especially Tiffany! She went out of her way to make us feel welcome and offered an amazing energy to lighten up our Sunday morning. On top of the good service, the food was just as amazing! There were 6 of us and we shared everything and left the restaurant beyond full. Some of the items we had were the Japanese breakfast set, the pork belly and the beef donburis, the chicken karaage, the tatsoi salad, and the soufflé pancake. It was so good that my family already asked on the same day if we could visit again this week! Now I’m planning on making another reservation for when I go back to NY next month!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmajR1TGhBRRAB",
            "text": "Absolutely loved the setting and atmosphere at Rule of Thirds when we stopped in for dinner. The service was also exceptional, and we loved every dish and drink we ordered (which was most of the dinner menu!). There were four of us, and we ordered 4-5 appetizers, then 4 mains, and it was the right amount of food. We also really liked their alcohol-free cocktails. It's an amazing experience we'd highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLR2Q2OTM4bzZtRGZBEAE",
            "text": "BEST CHICKEN SANDO I EVER HAD. It’s not even just okay, it was AMAZING— super crunchy and juicy. I came here for brunch and it was SO GOOD. The only thing is try to get there early or reserve because we had to wait awhile for walk-in. We also got the Souffle Pancake and it was amazinf as well, super fluffy. Cocktails were good too!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LW8zUjl3RRAB",
            "text": "The vibe and decor were good during our visit, and the place was buzzing with energy!\n\nFood-wise, it was tasty, but nothing left strong impression to me.\n\nIf you're looking for a place with a great vibe for dates or hanging out with friends, this is the spot. But if you're more into enjoying the food itself, I'd recommend going somewhere else."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcmN1WFpREAE",
            "text": "I’ve been here a few times and usually stick to the pancakes and sandwiches, which are decent. This time, we decided to try the gyu don and curry, and it was unbelievably bad. The beef was shredded, not fresh at all, poorly cooked, and had no good flavor — it tasted like frozen meat from a supermarket. It didn’t have any of the authentic Japanese taste we expected, and after just a couple of bites, we didn’t even want to finish it. And for $23? Extremely disappointing. Sadly, I don’t think I’ll be coming back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbjZhX1FnEAE",
            "text": "Japanese breakfast is good but could use some more toppings or fish.\n\nSoufflé pancake is essentially an Asian chiffon cake. Maple syrup didn’t do much for me but at first bite it def tasted like Asian egg cake."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3Z3VLUER3EAE",
            "text": "We went birthday brunch first time. place is so stunning and has private room outside. They had birthday card on table. So sweet.\nJapanese breakfast was so yummy and kids loved pancakes ( Japanese hottkeiki ) !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMFYwdFVjM0pPVGtWME5HaEZWemQ2YjNKZlJtYxAB",
            "text": "Etta was an amazing server - helpful, gracious, knowledgeable/passionate about the food. Kasujiru was a hit! Mazemen and white sesame soft serve are also good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJanR1ZklnEAE",
            "text": "Really beautiful restaurant with delicious food. Had the karaage - crispy and satisfying with thigh. The salad was refreshing and light - loved the yuzu vinaigrette. The crispy rice dish was a great soy flavor. Tonkatsu fried pork slices - sooo good. The wasabi is danger lol just dab it if you’re not a super spicy person! Very great spot for a small group or a pair."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3by1TZlZREAE",
            "text": "This place is truly considered a hidden gem tucked away in the heart of Williamsburg! Everything from the food, drinks, service and even ambiance, exceeded all of my expectations! The tuna was a standout as the fish was incredibly fresh and the texture was resemblant to butter."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYM2JmSWJBEAE",
            "text": "What a great place to try Japanese breaky!! Unique flavors my family and I loved, it was really refreshing to try something we’ve never tried before. The food was overall great! The atmosphere was simple and elegant, I enjoyed it. The service was good but lacked on remembrance on requests like sugar and what not. I’d definitely recommend this place to those who like to venture out and try new foods. If you’re a picky eater and are the type of person to order the classic breakfast at diners and brunch places, or ask for substitutions this might be not be the place for you."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBd2JQM013EAE",
            "text": "Rule of Thirds offered a phenomenal dining experience. Every single dish displayed the absolute love of food! Our favorite dishes (in no particular order) were the chicken katsu sando, the hottokeki, ajitama egg salad, and the roasted sunshokes. The service was fantastic as well, every staff member was incredibly attentive. And our server, Priscilla, was wonderful and we appreciated her knowledge of the menu when we were selecting our dishes. Overall, an 11 out of 10 experience. Definitely need to return next time we visit Brooklyn for all the new dishes for upcoming seasons."
        }
    ],
    "reviews_count": 81
}