{
    "name": "Milk & Roses",
    "place_id": "ChIJUymwHzxZwokR7PrGIBU3gz0",
    "grid": "BK1",
    "address": "35 Box St, Brooklyn, NY 11222, USA",
    "rating": 4.2,
    "user_ratings_total": 981,
    "phone_number": "(718) 389-0160",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SYVlVeFhiWEZ0TUhoM1dVaGpXV2xzYVV0bE1rRRAB",
            "text": "We went for brunch and loved everything about this place. The atmosphere is very cosy and we were nicely surprised by the quality of the food and ingredients. Will be back"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SFFVUnlaR3N6T1ZGSlNrTXRkakE1TUU5bk9XYxAB",
            "text": "This place outperforms all competition. The flavors were memorable. I plan to make repeated visits to this place. Milk & Roses worked well for our social gathering. The employees created a welcoming atmosphere."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMUxXTjVSakI2WTBWS2JrSjBjV2Q0ZG1sc1JsRRAB",
            "text": "I definitely wanted to try the food but was unable to because their device used to pay was unable to scan my card when swiped. Only come with tap to pay or cash!\n\nThey now gave a reply that I didn’t have enough funds which is totally disrespectful and untrue."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVGFqWmZZVkpFZDJNNGJVMTFVbGQ2YUc1eWJHYxAB",
            "text": "One of the most cozy and gorgeous spots in Greenpoint. Beautiful yard with open air and covered seating. Beautiful bar with vintage books lining the walls for a super cool antique aesthetic. Great wine and beer selection and plenty of good noshes to choose from. Above all that is the staff particularly the waitress/ bartender who served us yesterday. Top notch customer service. Definitely coming back here."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNVUxQnpkR2x0U1haWVdXSkpURzAwYXpaQ2EyYxAB",
            "text": "We had our small wedding at Milk and Roses, Susanne was incredibly professional and helpful with every detail. The backyard vibe, food, and drinks were amazing. The whole experience was beyond what we wished for and we are so thankful for it!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wblRIUkdRa0o2TTJaTWQxcG1XREJSUmxka2NuYxAB",
            "text": "I am going to make this my spot to go to and chill and work on my laptop, and to bring my friends"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNlVYWXhaMmxPY21Sa05HVlRlSEpWU2psamRrRRAB",
            "text": "Yesterday I had a last minute date night  in milk and roses. We came without reservations, food was sooooo good my cacio e pepe was beyond on point..  ,service was excellent... good job guys this is a way how the restaurant should be, thank you,mariamm for the best experience. Highly recommend cacio e pepe pasta and tiramisu."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSVdGUXlaMDFIVkZKdWJ6QlNUaTFGY2pKMVdtYxAB",
            "text": "Loved coming here!\nThe food was delicious, the place was so cute, and the staff was extremely attentive and so kind, went above and beyond to make sure we had a great experience here!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOak5VRTNZMXBOTXprd2RFdzBlWFJUT0VoWGVsRRAB",
            "text": "We just got married at Milk & Roses on Friday and let me just tell you… it was a DREAM!!! Not only is the venue stunning itself, our guests loved the warm and inviting atmosphere. The back garden made it super romantic, and versility of rooms made it fun for our guests. The food was exquisite, and the stuff was divine!! Working with Susanne made it so easy to plan for. We highly recommend anyone thinking of doing something unique and different than a typical venue, have your wedding there! You’ll never regret it and have the most romantic Brooklyn fairytale!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWlZFdHNXbFpYZG5SalUwTmpWbHBKYW5kWlVXYxAB",
            "text": "Delicious food, warm atmosphere. The service was perfect. An unforgettable experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMFV5MWZkVEZxTXpaSlRFSm1TbkpWWTNGZk1HYxAB",
            "text": "bad food AND bad service?! seems difficult but they managed to do it! the atmosphere is very beautiful which is the only reason i can imagine anyone is giving above 2 stars.\n\nit took like 25 mins for us to get a server, then they took forever to get our drinks (we just got champagne and the place was dead so not sure why but whatever), then they got our drink order wrong. we asked for our app then entrees (because they asked) then they brought out the entrees and had forgotten the app. all of this could be forgiven if the food was good because sure things happen and servers get busy (it was dead so they weren’t but whatever) but the food was BAD like so bad. like raw cauliflower served as a “cauliflower steak” and super thick chunky sauce served as “caio e pepe”. and all so expensive! no no no thank you sorry\n\nEDIT: literally who is managing this place and responding to people’s comments lol. if you’re looking to entertain yourself please read the 1 star reviews and the answers that these people are replying back. so unprofessional and insane they’re in business but honestly hilarious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaFVYSlVTR0ZyUkV4RVozVjZTR1owWVdOSGIxRRAB",
            "text": "Came here for my boyfriend’s birthday and it was the by far the best service we have received in the city. Our server Sasha was amazing, the outdoor garden was gorgeous, and the food was phenomenal. Will be coming back again soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVE9YUmlWM015ZWtkb015MWhNMmRXVGtvelJVRRAB",
            "text": "We love milk and roses! We have been coming here for the past three years and all the bartenders and staff are so amazing. The ambiance alone is so incredibly romantic. Food is always on point!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRlVVeFhUbHBzT0VkTWJqWkJlWGhrYUdFNFIzYxAB",
            "text": "Me and my wife love this place. great date nite spot, it is our go to when we want a nice intimate dinner and drinks."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ob2NVdGxSRU52ZHpOMU5VbE1SMHhqY1RFelpHYxAB",
            "text": "The food, drinks, and atmosphere are amazing. The lasagna-type dish is out of this world. The squid was excellent. The drinks were delicious. The outdoor seating had a ton of shade and the garden is beautiful. The service was soooooo slow. I would give it another shot to see if the service improves because it was so good. There were two servers. One was working her butt off and the other was folding silverware so read into that what you will. I think they have the opportunity to be sublime but they need to have a hard working team to make it happen."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSck9VdzRaVk5IYldsVVJreDNlakZWYXpOVlZYYxAB",
            "text": "What a beautiful restaurant with both parts cozy and sophisticated on the inside and European vacation on the outside.\n\nThe service team is so wonderful and kind and also share about how they are happy to work in such a beautiful space. Accommodating, courteous and overall joyful.\n\nLove coming here. We celebrated a birthday with7 people and it was so smooth and lovely. Thank you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQ2IzRmFhMkZFV1cwNVVGSjRlVkJrTVhneVYyYxAB",
            "text": "Beautiful rings!! Got a gorgeous set. Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poM2MwdFVWRk15WlV0MExTMWZkV3RpVTNkcVpFRRAB",
            "text": "From the moment we stepped into Milk & Roses, we knew it was the place we wanted to get married. The space is absolutely gorgeous, especially the garden, and the team is clearly a well-oiled machine when it comes to events. Susanne was wonderful to work with—super communicative and accommodating throughout the entire process. Everything ran so smoothly, from coordination with our vendors to setting up a rain backup plan (which we thankfully didn’t need!). Our guests raved about the food, and the staff on the day of were kind, attentive, and totally on it. We couldn’t imagine having our wedding anywhere else."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSVVHWkRNbmhTY0MxRmN5MWtRVmt5UVZSR1FWRRAB",
            "text": "Delicious and kind service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVlFUaEJTbGRIUzNRNVlXWlJkMGg1YmxwdGFWRRAB",
            "text": "I recently had the pleasure of celebrating my wedding at Milk & Roses, and I can't express how incredible the experience was! From the moment we stepped into the venue, we were captivated by its charming ambiance and beautiful décor. The rustic elegance combined with the lush greenery created the perfect romantic backdrop for our special day.\n\nSusanne and the staff at Milk & Roses went above and beyond to ensure everything was perfect. They were attentive, accommodating, and truly made us feel like royalty. It was clear that they genuinely cared about making our day unforgettable.\n\nThe food was absolutely phenomenal! Our guests are still raving about the delicious dishes and exquisite presentation.\n\nThe indoor and outdoor spaces allowed for a seamless flow throughout the day, and we loved being able to take beautiful photos in their picturesque garden. The atmosphere was magical, with twinkling lights and soft music creating an enchanting vibe.\n\nOverall, our wedding at Milk & Roses was a dream come true. I highly recommend this venue to any couple looking for a stunning location and exceptional service. Thank you, Milk & Roses, for making our wedding day one that we will cherish forever!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbFMyNVFOMGd5UVZSTlJXVTBUbEZoYVhCd0xYYxAB",
            "text": "Have you ever had someone look past you to ask the next person if they needed help? After I'd already had a formal appointment, my fiance and I came back to walk through and dine in, as we decided if we would book the venue for our wedding. The food was nice and I love the atmosphere. But the disregard and unprofessionalism was unreal and felt almost intentional.\nWe arrived and, were told it was fine to look around. After walking through, we waited at the host stand to be seated. As we stood, several minutes passed and we watched staff talk at the empty bar. Eventually someone approached us. We were shocked to watch that person bend over to the side, look over our shoulders and ask the person behind us if they'd like to be seated. After that person confirmed they were meeting friends, we were left once again for socializing at the bar. Since we no doubt were making faces and staring, eventually the person came back and almost made an excuse before seating us. I say almost because all she uttered was \"I thought you were\" THOUGHT WHAT???Another 5-10 minutes passed before receiving water. This was the cherry on top of experiencing a missed appointment by and receiving poor communication from the event coordinator then being ignored for about a week when just trying to get an estimate for the wedding."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRmMwWkxWMDVIUzNjeE9FMVpWSGxEZDJsTFptYxAB",
            "text": "Super tasty and freshly made brunch options. Atmosphere, the backyard is incredible, so beautiful. Service is friendly and efficient. Great option in the neighborhood!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KZmVUUjRWR015YVVSdVNXaEpXVFUyVW1waGNHYxAB",
            "text": "Very cute spot! The food was great and drinks were awesome!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeFlra3dTeTFWY21ndE5GTXRPWGg1ZFRSQlgzYxAB",
            "text": "I’ve been here twice and everything I’ve tried has been excellent—the Farmer’s Breakfast, Shakshuka & Applewood bacon, mimosas, fresh orange juice, and iced mocha. The food is consistently great, and the ambiance makes it even better. Definitely coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cWFtRk5TVWxhTkdsVWFsWTViVTR6T1Y4eVNXYxAB",
            "text": "The food was fantastic, great building and atmosphere. Sasha in particular was a super star. Her service and recommendations were great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padVVIRllVSGRaUVVWNmFIRllVVTVYVUVRNFQwRRAB",
            "text": "Nice atmosphere, delicious cocktails, wonderful staff🧚🏻"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVWNraERiSEZFYm5SNVZHSmtRWG96Ym1KaVExRRAB",
            "text": "This was genuinely the best meal I've had in my two years in New York"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RdE5GRm9Uak5tUkhGU1YxZ3dWMFZPVmxCWk1YYxAB",
            "text": "Gorgeous backyard, good food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTE5DMW1XVFo1TWtjd2J6WlVXbFZaT1VwbloxRRAB",
            "text": "This place is beyond gorgeous, the patio is so beautiful and the atmosphere is just *chef's kiss* I really like the chicken but i feel like aglio olio could've been slightly better. Servers are also super friendly and great service!! Totally recommend this place for a cute outing!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMeW8tTFRWbHFQMk5REAE",
            "text": "Atmosphere, aesthetic and service are impeccable!  Food is terrible."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMV2JrOEtqcl9qc3FRRRAB",
            "text": "I can safely say that Pasta Al Branzino is one of the best pastas I have ever eaten, so much so that I returned for the second time in the same week. The salads are delicious, as are the desserts. The waitresses are very attentive and kind"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJaWwwZm1jbzY3OFhREAE",
            "text": "Lovely atmosphere - like sitting in a library of a grand manor house. The food was excellent. I had the clams & pasta with garlic and it was delicious!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLM1BwWi1aOTRXSmVnEAE",
            "text": "I had my 15 year anniversary party here. The food, atmosphere were amazing and to top it all off the staff were so warm and friendly. I can’t wait to come back again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYjA4NjIyaE5fZkh3EAE",
            "text": "Despite some negative reviews, my experience at this restaurant was quite positive. The service was outstanding, with attentive and friendly staff. The food was delicious, showcasing authentic flavors, and the atmosphere was cozy and inviting. Don't let the bad reviews deter you; it's worth giving this place a try!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMWDQyTC0wa1l2cGlRRRAB",
            "text": "Very good restaurant in a decent neighborhood. Loved the Pasta with shrimps and cauliflower. Cocktails and drinks are also highly recommended. A bit more pricey but definitely worth the money.\nThere also is a very cute English garden in the backyard which is perfect to sit, eat and talk"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPeVRnUHpnekp6Q2VREAE",
            "text": "Booked a partial garden brunch buffet for the day after my wedding. Everything was perfect, from the food to the atmosphere. We planned everything on a bit of a time crunch, but Susanne, the event manager, was so accommodating and responsive even when our guest count and needs were changing by the day. She gave us much-appreciated input on menu (we got to taste our selections) and layout, and even spruced up the tables with a little decor as a sweet touch. The weather was perfect, but Susanne assured us that if it wasn't we would relocate to the equally stunning library. She took amazing care of us! We heard nothing but rave reviews from our guests, and we couldn't be happier with how everything went."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQSEw5dDZjMXMyM0pBEAE",
            "text": "Milk and Roses – A True Gem in Greenpoint!\n\nEvery time I visit Milk and Roses, I'm reminded why it's one of the best spots in Brooklyn. The food is consistently top-notch — always fresh, full of flavor, and beautifully plated. It's rare to find a place where every dish hits the mark, but this one absolutely does.\n\nSome standout favorites: the shakshuka is divine, rich and perfectly spiced; the potato wedges are exquisite — crispy on the outside, fluffy inside, seasoned to perfection; and the pear dessert is hands down the best I’ve ever had. Truly unforgettable.\n\nBut what truly sets this place apart is the exceptional staff, especially Ilona and Valentyna. These two are the heart and soul of the experience. They are absolute stars — professional, kind, and incredibly hard-working. Even when the restaurant is packed (which is often!), they manage everything with a smile, grace, and efficiency that’s nothing short of inspiring.\n\nIlona and Valentyna don’t just serve — they elevate the entire dining experience. It's not an exaggeration to say they are a huge part of why people keep coming back. In a fast-paced, demanding environment, they shine every single shift. Honestly, if anyone deserves a raise — it’s them. Without question.\n\nThe ambiance here is also unmatched — cozy, romantic, and full of charm. Whether you're sitting inside surrounded by vintage books and soft lighting, or out in the garden under string lights, it's a magical escape from the city.\n\nIf you're in Greenpoint and want unforgettable food, a beautiful atmosphere, and truly outstanding service, Milk and Roses should be at the top of your list."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKdko3UDJyNGJyU3d3RRAB",
            "text": "My husband and I came here to celebrate our wedding anniversary (in which we did in fact get married here too in May 2023) and had the most immaculate time. This place is such a gem. The ambience is absolutely beautiful and extremely rare to find a place so intimate and whimsical like this in the city. They have so many hidden nooks and cozy rooms, and not to mention the garden which feels like a little dream. (Usually they let you pick wherever you want to sit too, and like us they let us move from the garden to inside when it got chilly).\n\nI’ve eaten here for brunch and dinner and both are lovely - but the prawn cacio e pepe had to have been my favorite. We had brunch food at our wedding and all of our guests raved about it especially the bacon and French toast!\n\nThe staff is always so welcoming and laid back which I love for the intimate and European feel. This time for dinner we had Miriami and she was so personable and friendly and really made our night memorable!\nWhen planning our wedding we worked with Suzanne who was incredible!! Truly could not have done it without her, and the entire staff day of did an amazing job. I would do my event with them again any day."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdUZwTWZFNm9uaFBnEAE",
            "text": "Beautiful place with a cozy cottage atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMN0luci1DdWRLTVN3EAE",
            "text": "This place is adorable. It’s the cozy library  French European fairy garden cafe of my Pinterest dreams lol. Laptops allowed before 4pm . And they have WiFi. The affogato is sooooooo yummy!!  My servers were really sweet girls so cheerful and attentive. They have a huge seating area, and I imagine this is a super cute brunch place on the weekends."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKS3loN3VVdG96SEVBEAE",
            "text": "One of the Worst Dining Experiences I’ve Had – False Advertising and Disorganized Staff\n\nIf you’re looking for authentic Italian food, Milk and Roses is not the place. This restaurant is nothing more than smoke and mirrors with fancy-sounding menu items that have nothing to do with what actually ends up on your plate.\nI ordered what was described as a Panini with tuna. What I got was canned tuna salad with olives (which were not listed on the menu) slapped between two DRY burger buns and topped with arugula, How is that a Panini? It wasn’t grilled or pressed like actual Panini supposed to be\nAnother person in my party ordered what was described as a pasta dish with Branzino. Instead, they got chopped-up pieces of what was clearly frozen fish tossed into a flavorless, greasy pasta. Branzino is supposed to be served as a delicate fillet—not mangled like leftovers in a cheap pasta dish.\nThe restaurant manager claimed That this food is Italian and the restaurant is Italian and clearly I don’t know what Italian food looks like... I Go to plenty of Italian restaurants I’m surrounded by Italian Friends and family I’ve been to Italy the  only Italian thing about it is the menu food names.\nAn actual Italian walking in here would probably have a heart attack. There wasn’t a single authentic Italian dish. They even had Shakshuka on the menu—first of all, that’s Mediterranean, not Italian, and second, how do you mess up Shakshuka? They somehow did. It was literally canned tomatoes with two sad eggs cracked on top. As a Mediterranean woman, I was genuinely offended.\n\nThe service was just as disappointing. The staff was disorganized and clearly untrained. Our waiter didn’t seem to know how to handle basic service issues, and gave us attitude and when we complained, the manager—a Russian woman with a thick accent—tried to gaslight us by insisting that “this is how Italians do it.” Sorry, but how would she know? I asked her if she ever been to Italy she said no … She said the chef was Italian straight of the boat from Italy and he knows what he’s doing yet I peeked into the kitchen and the chef was clearly Mexican. Maybe she thinks whoever speaks Spanish is Italian?  So who exactly is deciding what Italian cuisine is supposed to be?\nTo top it all off, we sent back the food untouched, and for 20 minutes our waiter walked around the restaurant with the plates in hand, unsure what to do with them. And then they had the nerve to demand we pay for those cold, manhandled dishes. Truly appalling.\nSave your time, money, and taste buds. Milk and Roses is an overpriced, pretentious place that doesn’t even get the basics right."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNVHhnY210M2F2N2J3EAE",
            "text": "Delicious aglio olio and fave/asparagus salad served in a lovely courtyard - not so thrilled to see the lone and mostly-absent server do the NJ Claw while clearing glasses, twice, with her fingers inside them !¡ Use a tray maybe?"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQbmx4N2U3a3FqTWh3RRAB",
            "text": "Honestly, I never leave a bad reviews but this place was pretty bad. The shakshuka was eggs cracked in a can of crushed tomatoes. The branzino “filet” spaghetti had cut up branzino, not a filet and it was very very fishy. The Paninis are sad. Cute for photos but wouldn’t go for the food, maybe just drinks.\n\nEdit to response: Obviously I won’t come back, the food is nasty!! Most of it canned or frozen!!! The staff fights with you if you have a complaint, in what world would someone ever pay for something you wouldn’t eat? The menu is also very misleading, visit that. Preserved yellow fin tuna panini = canned tuna on hamburger bun, looks like the nasty patty from SpongeBob. Branzino ala Spaghetti is cut up fishy branzino in a pasta that has a canned sauce. The Shakshuka was two eggs cracked in a canned crushed tomato’s. The burger was the only normal thing presented, and even that was soggy and bland, not that interesting. Step up your game if you’re going to charge $25+ a dish. Focus and fixing your menu and food instead of trying to respond to every negative review. Would not even go again even if I were paid."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNFliVUhBEAE",
            "text": "I had such a great time at this restaurant! The garden is super beautiful and creates a really nice vibe. The cocktails were amazing — so tasty! 🍹And the service was great, super friendly and attentive. ☺️Can’t wait to go back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvb2VPRnNnRRAB",
            "text": "very cool interior & pretty garden exterior. our server valentina was sweet and amazing. with the aesthetic and name of this restaurant, there needs to be more detail work done. plates, tea cups, cups, etc should be delicate looking and match the vibe. it would also be cute if they had latte art and flower petals in it. roses even fake ones would look nice outside somewhere, maybe centerpieces on the tables too. small details go a long way. the food wasn’t great, but we enjoyed our experience because of the garden tables and our server. if they step up the details and food it will be way better!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMVk2VHRRRRAB",
            "text": "The atmosphere is actually so unique and beautiful here I really want to like this place. However when seated, they sat us in the back with a private party which felt invasive and awkward despite seats available. We waited for service for a while, waiting for just water and eventually left without ordering. It’s a shame because I live in the neighborhood and wanted this place to be a spot I visited regularly. I would be open to giving it another try considering I wasn’t even able to try the food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdVBPSGZBEAE",
            "text": "Perfect place for stylish dinner/lunch. The atmosphere is stunning with antique tables, wall coverings."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc0pEaEVREAE",
            "text": "This place is not only so cute but the food and drinks are to die for :) I had the pasta with lamb ragu and it was so amazing 🤩 service top notch! Highly recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcjdqX2dnRRAB",
            "text": "Beautiful restaurant!  Generous cheese plate, juicy burger, delicious pasta, fantastic cocktails, and breathtaking decor especially that skylight over the bar and red leather booths"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeW8tbENBEAE",
            "text": "It's a nice atmosphere and service is nice but the food is NOT good. They use the cheapest products, many dishes flavorless. There are much better locations to spend your money.\n\nEdit: their very agressive stance facing a negative comment confirms this is a place to avoid. I can tell the quality of what I eat, especially if it causes me a stomach ache. I can also assess the flavor of what is being served without having to manage their inventory. Thank you very much. I will be sure to pass the word around."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNnVITjZnRRAB",
            "text": "분위기가 너무 좋아요. 직원 분들도 친절하셔서 좋은 시간 보냈습니다."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNXF2WmRBEAE",
            "text": "멋진 분위기에 한적한 길에 위치한 가게도 좋았어요 맛도 있었지만 가격대비 양이 너무 작습니다 하지만 브루클린 분위기가 어울리는 매장이라고 생각해요"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaDRuTUZ3EAE",
            "text": "The atmosphere here is absolutely unique — perfect for a date night. Surprisingly, it wasn’t crowded on a Friday. We ordered the cucumber and pear salad, which was refreshing and interesting. The cauliflower steak was also delicious and a great option for those who don’t eat meat. The potato wedges were tasty as well. Our server, Maria, was friendly and lovely to chat with. The bill was moderate, which made the experience even better!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJck1TTkhBEAE",
            "text": "I had brunch here a few weeks ago while on a trip to Brooklyn.  Nestled in a quiet area, this restaurant’s entrance can’t be more pedestrian than the street itself.  If you walk by and happen to miss it, you would not be inattentive.  It is perhaps an intended presentation, so as not to judge the place by the glitz, but by its substance.\n\nEntering the space, one is beguiled and almost immediately transported to an English country manor ambiance.  From the wafting soft music to the sun drenched library, to the cozy fireplace and the grandeur of the hardwood floors, you can’t help but feel the very relaxing and inviting charm.  The decor and appearance are part of the regal experience and while the menu may not meet a gastronomes cravings, it nevertheless would be quite appealing to a variety of palettes.  In that regard we started with a shared stack of Pancakes and Strawberries, which were just delicious.  We then had individual servings, with the hearty Croque Pullman, a combination of quintessential breakfast favorites - omelette, toast and bacon, and then then the very appetizing Panino con Frittata, with mouth watering Gruyère, zucchini and caramelized onions.  The third dish was the Shakshuka which was a combination of two eggs sunny side up on zesty tomato sauce and bacon.  The food was as delectable as one could expect, and the service from the ushers to the servers was just outstanding.  Our server, Valentina was as cheery as the surroundings and was very attentive, which added to our great experience.\n\nIf you are in the area and would like to get a reasonably priced meal in a very charming setting, and not settle for the trite deli or take out experience, this would be a good place to try.  It is family friendly and in the summers there is an open garden section with seating in much demand.  I think you might find the overall experience just as fulfilling as I did, enough for me to return for another meal on my next visit."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdktUTkl3EAE",
            "text": "This establishment delivers an exceptional dining experience, combining stunning decor with outstanding food and service. Every detail of the ambiance has been carefully curated, creating an atmosphere that is both sophisticated and inviting.\n\nThe menu does not disappoint. The burger was perfectly cooked, flavorful, and well-balanced with fresh ingredients. The guacamole and chips were a standout—fresh, well-seasoned, and accompanied by crispy, high-quality chips. The avocado toast was equally impressive, featuring a generous portion of creamy avocado on well-toasted bread.\n\nService was fast and efficient, with a staff that was both attentive and professional. From start to finish, this was a top-tier dining experience, making it a highly recommended destination for anyone looking for a perfect blend of ambiance, quality, and service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMmVfelZnEAE",
            "text": "It has a very sweet concept. The garden is legendary. The atmosphere is 10/10. The server was very helpful. But the food did not suit the place. The food was too ordinary for the place. But that does not mean it was bad. It's just that the place is so magnificent that the food was dull."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncW9QN25BRRAB",
            "text": "We've been to this place almost 2 years ago and visited again for a Valentine's day. They had a nice pre fixed menu with many choices, which was already attractive. Everything was delicious especially burrata salad. Steak was also on point.\nThe wine recommended by the waiter proved to be an impeccable complement to my meal. Overall we enjoyed every piece of this evening, especially the romantic ambiance."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBd0p6OTlRRRAB",
            "text": "Delightful and delicious! The food was absolutely top tier. The service was great until it got a little busy and then we didn’t see our server for a very long time but other than that I highly recommend eating here. I came early evening on a Saturday and basically had the place to myself."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiLXNlVGlBRRAB",
            "text": "Overall rating: 4.3\nI saw this online and loved the decor. I went for brunch with a friend and was able to sit down immediately. My friend and I sat in the front and do we regret it. The service was non-existent. It was definitely very busy for only 3 waitresses including a hostess & bartender.\n\nTowards, mid-way through - we got an actual waitress and service picked itself up. We ordered a second time & got our food easily. I’d love to go ahead for maybe lunch or dinner. The outside space looked beautiful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b29XLVB3EAE",
            "text": "Tucked away spot in green point with great food, generous portions and very nice decor. A little bit pricey but I feel it was worth what I paid. I had the avocado toast and the presentation was really put together. I was worried it would of been not very filling but it was two slices and plenty of avacado. I wish the sour dough slice was a little bit more sour but that’s just my personal preference. Good date brunch spot. My partner order the large BLT and it was definitely large. Plenty of fluffy eggs with bacon and again more avacado. Really nice experience overall"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX1A2V2hBRRAB",
            "text": "We hosted our wedding at Milk and Roses. We were immediately drawn to the beautiful garden but were completely sold after trying the amazing food. Our guests were raving about how beautiful the space was and how it was some of the best wedding food they had ever had. The ceremony space was absolutely lovely, but the real magic happened after the ceremony. The space was transformed into a whimsical garden for our dinner and it was stunning! Leading up to the event, our venue coordinator Susanne was such a huge help in pulling off such a beautiful wedding. We met countless times to go over details and I really think it paid off in the end. We loved working with them and will be visiting the restaurant for years to come!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaGVhblV3EAE",
            "text": "I had the pleasure of photographing Amelia and Dan’s beautiful summer wedding here. The outdoor garden area was stunning, spacious, and full of charm, making it perfect for both the ceremony and the reception. The vibrant greenery, intimate seating arrangements, and elegant decor created a magical atmosphere that truly brought the celebration to life. Every detail, from the gorgeous setting to the lively energy of the guests, made for unforgettable moments to capture. This venue is a hidden gem for couples seeking a unique and picturesque space for their big day! ig @konradbrattke"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdTQ3RVlnEAE",
            "text": "One of the most cozy cities you can visit to sit in silence and enjoy the interior. When I came here, I immediately felt like I had unearthed a pearl at the bottom of the river, this place is perfect for a quiet break after work, or a date that will leave a good impression. You can sit inside in the library-style rooms or go out into the garden. Of course, the price of food and drinks will be higher, but it is fully compensated by the quality of cooking and the atmosphere of the place. Highly recommended"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOE9LWXRnRRAB",
            "text": "We were walking down the street and I randomly turned my head, catching a glimpse of an amazingly warm and welcoming entryway. We stopped in our tracks, and we're compelled to enter. Valentina was a wonderful, sweet and witty server and our drinks and food were all very scrumptious!  The atmosphere inside was magical.  Highly recommended!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NmRMMDFBRRAB",
            "text": "It’s very beautiful  , the coffee is great. The soup was not that good, but it was enough to to get me by. The bread was slamming. If I lived around here, I’d probably be here all the time. I will return , the out door looks great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiclAtdW93RRAB",
            "text": "Romantic setting for a date night!\n\nThe indoor and outdoor seatings are so charming and decorative.\n\nThe food is delicious as well. Very fresh pasta!\n\nWould love to come again when the weather is nice outside."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScUpmWHhRRRAB",
            "text": "Awesome cozy spot that serves delicious breakfast with friendly staff and excellent service.\nCASH only.\nMenu not sophisticated, the ingredients are fresh and organic.\nThe owner put appreciated effort in the decor, with part exposed brick and library theme with many shelves with books.\nBackyard garden is equally amazing.\nWill definitely recommend the spot for any group size and consider it for celebration.\nWould like to suggest the management for some jazz music in background...or even live."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2b0puNm13RRAB",
            "text": "Milk & Roses in Greenpoint, Brooklyn, is nothing short of a culinary treasure. From the moment you step inside, you’re greeted with an ambiance that feels both intimate and enchanting, blending rustic charm with a touch of old-world elegance. Whether you’re dining indoors surrounded by books and warm lighting or enjoying their magical garden, every corner of Milk & Roses is designed to make your experience unforgettable.\n\nThe dishes here are simply exquisite. The menu is a thoughtful blend of American and Southern Italian influences, offering something for every palate. The creamy polenta with poached eggs is a standout, with rich, comforting flavors that leave a lasting impression. Every dish is beautifully plated, showcasing the chefs’ commitment to quality and creativity.\n\nWhat truly elevates the experience are the cocktails. Each drink is crafted to perfection, balancing bold flavors with fresh, high-quality ingredients. Whether you’re sipping on a classic Old Fashioned or one of their inventive signature cocktails, you’ll be impressed by the thought and care that goes into every pour. The boutique wine and craft beer selection is also worth exploring, offering pairings that complement the meal flawlessly.\n\nThe service at Milk & Roses is exceptional. The staff are warm, attentive, and knowledgeable, making you feel welcome from start to finish. Their passion for creating a memorable dining experience is evident in every interaction.\n\nIn conclusion, Milk & Roses is a must-visit for anyone seeking a memorable dining experience in Brooklyn. With its savory dishes, amazing cocktails, and an ambiance that feels like stepping into another world, it’s perfect for a romantic date, a celebratory dinner, or simply treating yourself to an exceptional meal. I can’t wait to return and savor it all again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaGZiNG5nRRAB",
            "text": "I have never ever left such a bad review in my life, but this place is definitely worth it.⭐️\nThis is the worst service I ever seen, I’ve been to many places around whole country.\nStaff is rude and disrespectful. Judging people by the language they speak.\nThe food was bad! Duck was totally rare!!! You can see a picture. They used a paper cups for souse. Not even a glass. For such a price it’s a shame!!\nBUT!!!!! We ordered 14!!! Pasta and shrimp plates to go! When I opened boxes at home there was not even 1 shrimp in all of the first 5 opened boxes! Not even 1.\nGuys I’m sorry, for the prices it is unbelievable disgusting attitude. I never been so disappointed. Nothing can change my opinion.\nAtmosphere could be fine but rat 🐀 running around tables is not nice at all too. But that’s doesn’t even matter.\nEven restroom is not comfortable and I should to ask for soap. I mean. Not recommend this place at all."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMnBIUFdBEAE",
            "text": "I love this place for it's interior decor, it's chilled vibe at the same time top quality food.\nGreat spot for a date, birthday party with girlfriends or a larger group of friends or family or even solo. They have a beautiful garden in the back to enjoy lunch, brunch or dinner in fresh air.\nI had the croquet monsieur with scrambled eggs and bacon on top, my friends had a burger and shakshuka, all dishes were very tasty. Must come and try for yourself!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMU9uSkt3EAE",
            "text": "This place it’s so beautiful. I went there for breakfast with my friends.\nThe ambiance, the books, the decoration, the aesthetic, it makes you feel like if you are in little village out of town. The food was delicious and with a good variety of options. For drinks, our server recommended us an espresso martini and it was so good. Our server was very kind and attentive, she was always making sure we were happy and enjoying the food.\nDefinitely going back for a romantic dinner soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N3U2emtnRRAB",
            "text": "Beautiful restaurant in Greenpoint serving delicious food. Loved the back room and outdoor area, if possible, request to be seated there. There was some confusion with our party’s reservation but the manager rectified this, got our tables sorted, and personally took care of us for our brunch"
        },
        {
            "date": "1년 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eGRpekVnEAE",
            "text": "室內的設計充滿藝術氣息，牆上掛著藝術品與滿牆的古董書籍，與壁爐燃燒的熊熊火焰相映成趣。\n南義大利口味的義大利麵讓人回味無窮⋯⋯"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGN2VhcG5nRRAB",
            "text": "Such a warm, cozy and romantic atmosphere to experience! Unique and tasty drinks and food was simply delicious. If you have the opportunity, sit outside in their back garden to enjoy a fine meal with someone you love. 🖤"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdnZuaXl3RRAB",
            "text": "Loved the atmosphere. Super cute and cozy. Great cocktails. Pasta is okay. Octopus was overcooked. Service is good. Everyone seems pretty nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOW9xOVdnEAE",
            "text": "SOOOO beautiful place! Everything was incredible: decor, service, food and coffee. I LOVED my latte with almond milk! I highly recommend avo toast with poached egg and salmon. It was very fresh and delicious.\nDefinitely have to come back to this place, they also offer outdoor seating."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNHBENkp3EAE",
            "text": "This is the most adorable little spot! Actually it's not little as they have a huge backyard/ garden area. But when you walk in the entrance is snug, with a wooden piano and rows and rows of ancient books.\n\nWe popped in for a cocktail and they greeted us warmly and sat us at the bar. The cocktails are properly created. The \"Filthy Rich\" was perfect combination of sweet and single malt whiskey, great on a chilly, wet fall evening.\n\nThe \"Milk & Roses\" is light, sweet and pink! Delicious and would taste great on a warm summers eve.\n\nThe food menu looked incredible - pastas and salads, today are color coordinated apparently. Many thoughtful details makes this such an excellent local spot. Cash Only! Enjoy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5NnJMY1R3EAE",
            "text": "Susanne and the staff at Milk & Roses are absolutely fabulous. We've eaten here many times and recently had our wedding reception. It was the most perfect, beautiful and warm space."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScV95R3FRRRAB",
            "text": "This place it’s magical, a beautiful garden for a wedding or birthday party. We went for brunch but were a few min. late so stay for dinner, appetizers were good. However, the 4 pasta we ordered none of them were good, maybe we went on a bad day. I’ve never had a carbonara with fish. Other than that the services was awesome."
        }
    ],
    "reviews_count": 79
}