{
    "name": "Naked Dog",
    "place_id": "ChIJUfItHUBZwokRQLZURlrMYnk",
    "grid": "BK1",
    "address": "47 Java St, Brooklyn, NY 11222, USA",
    "rating": 4.6,
    "user_ratings_total": 660,
    "phone_number": "(929) 337-8096",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUk1DMXpaa1JmTnpjMlFtcENjVWxRUVVaVU1HYxAB",
            "text": "Rabbit cooked to perfection."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUVpFNXlWM3BrYzJabVJWUXdTa3BZTUVGcWRFRRAB",
            "text": "In love with this place!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcWFsUkNXRjlVUm1GelZFdE9hWEpxV2s5ZmFWRRAB",
            "text": "The best pasta with a super friendly staff. Great neighborhood place where they know the locals."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oM1lWRjZkMVJuVDBoSlNWaFRaems0TUdRNVVYYxAB",
            "text": "I’ve been here a few times and the food is fine, but after my last experience, I’m done. I lost my wallet and realized the last place I had it was at the bar. When I called to ask if anyone had turned it in, the person who answered was rude, dismissive, and made no effort to help. They didn’t even check the lost and found. It was a simple request, and the lack of basic courtesy was unacceptable. This used to be my go-to spot, but I’ll take my business elsewhere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeVNISktlRmR5VmpsNmJHNXNhVzFEZWxwclZsRRAB",
            "text": "The food and service was fantastic!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WFpYZzFkMnAyY1VsRVF6ZzRPRzEwWDJNd09FRRAB",
            "text": "Low key italian joint putting some good dishes together.  I enjoyed the suggestions and specials offered.  The drinks are superb.  Enjoy and taking a good breeze"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWmRISkhkRlJDUm5wcE0zcHNlRVZ1ZUhSS2RGRRAB",
            "text": "Get the ravioli"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSlVVeHNTa2xyVEVNemRXcGxlV3ROYWxoc2QzYxAB",
            "text": "Naked Dog in Greenpoint feels special from the very first moment—warm, genuine, and full of heart. The dishes speak for themselves: the Torretta di Melanzane and the Polletto were unforgettable, simple yet perfect.\nAnd if you ask about the name, you’ll discover a sweet story that makes you love the place even more.\nRecommended by an Italian—and that says it all."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFME0zSTNORlEwVFc5cVMzZG9RbXN5ZG5KMGVGRRAB",
            "text": "Nunzio and Paula were so lovely we can't wait to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneWNqSnhhVWhMZUdsVWVGcGpibkpHZEc4d2RWRRAB",
            "text": "By far the best restaurant in New York City"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WFFVeEhlVWRHUkY5WldXWjZTa2RTVUZoclUxRRAB",
            "text": "The food was decent, but definitely not spectacular—especially at $65 for just one appetizer and one entrée with tip, without any drinks. You can easily find better food at a lower price, or at least enjoy a more inviting atmosphere.\n\nUnfortunately, this place didn’t deliver on either. It’s located across the street from a quiet, industrial-looking area that felt pretty desolate. I won’t be back.\n\nOh and parking is tough around there."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RME1YUnFNVlZPUW00NVZVeDBUREF3VFcxRGFFRRAB",
            "text": "Actually super good. Not a pasta connoisseur but definitely one of the better pastas I’ve had. I also dined at another much more popular pasta restaurant called Misi recently and thought this place was much better in terms of taste. It was not too salty and super flavorful. Pasta was cooked to a perfect chewiness and portion was just right. There are some nice outdoor seating but because of the construction across the street, I recommend seating indoor for the time being. Definitely would recommend this place for any pasta lovers."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padlNGUjNTM1F3TlU1SmFISXlOMUJqU0U5UlFuYxAB",
            "text": "my entree had like 10 noodles"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wc2NVeEVSMDV5TTNSUVRVOTRUbTlRYjNCVVEyYxAB",
            "text": "Great service and vibes but food is just alright especially for the prices"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZakxDeEV3EAE",
            "text": "I was so excited to finally go after reading all the reviews but since I live nearby I kept postponing it. And it was a real disappointment, I really wanted to like this place but the food was just so mediocre, from bread, salad, pasta, I had zero interest in desserts after all the food we were served. Don’t mind paying $30 for pasta if it’s good but everything felt like some went to trader joes and added 0 value to it. Clearly this place just takes advantage of the location. The cocktails were actually nice but not the reason I go to Italian restaurant. No way I would recommend or go back, many other places that are worth going in the neighborhood, this ain’t it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMU02eVp3EAE",
            "text": "Hands down the best bolognese I’ve had in my life. I always take people here when they visit and want to try really great Italian food. Everything is great!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNWE2Zk5nEAE",
            "text": "Truly incredible meal. The strozzapreti was remarkable"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOFlPUnh3RRAB",
            "text": "Ribeye is a must! Delicious every time"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd3JXWTBRRRAB",
            "text": "Came on a Thursday night and it was very chill. Service is amazing and very quick. Loved the complementary bread. We had the Agnolotti and burrata. I would probably choose another pasta next time but it was pretty good!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRazUzUDdnRRAB",
            "text": "Great atmosphere and friendly staff. The calamari was excellent but the ravioli was pretty dry though so not my favorite. Hopefully it was just a one off as the other dishes I had were great."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRblp5Wjl3RRAB",
            "text": "Lovely neighborhood spot that has a very cozy ambiance and really decent food! I’m no pasta connoisseur but the food here is comforting and done well and perfect for a date night or little weekend dinner.\n\nI imagine the place looks very different during the daytime, but when we went at night it was very intimate and not too dark (which is my issue with a lot of spots). The staff is friendly and the food is good, nothing to complain about!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnZzVmYm9RRRAB",
            "text": "Thoroughly enjoyed the Spigola (fish) and Polletto (organic chicken)! Attentive service. Great dining!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBb2VUd09nEAE",
            "text": "The food was good, but nothing spectacular. The pasta was cooked well, but the sauce lacked depth. The service was friendly, but a bit slow. Overall, it was a decent experience, but I wouldn’t rush back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBXy12ek9REAE",
            "text": "Don’t be fooled by the name. This is a great Italian restaurant. The entrees were great, the appetizers were very good and the contorni (the sides) were exceptional. Not all restaurants are attentive to the sides. The broccoli rabe was perfect and the cauliflower exceptional."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdDcyQ0hBEAE",
            "text": "Lovely neighborhood Italian restaurant, with delicious food, good selection of wine and cocktail, plus friendly services and welcoming atmosphere. Love to come here with walking distance, and enjoy nice food and relaxing drink."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX2VubFBnEAE",
            "text": "I'm in love with the braised short rib ravioli. This has been my wife and my go to spot for new years eve the past few years and will definitely keep coming back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MnNUc19BRRAB",
            "text": "Everything was absolutely delicious! Great wine list too, and a beautiful, cozy atmosphere. Looking forward to coming here again :)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2X2NDQkdBEAE",
            "text": "Place is amazing. Food is amazing. Staff is amazing. We had our holiday party here and we brought cowboy Santa hats and even gave one to a waitress. This is the place to enjoy time with amazing people! Definitely recommended. Team Naked Dog"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aUl2NWtBRRAB",
            "text": "I have never been to this place. But I give it 5 . Because I can see that there people friendly and it looks very clean. And the people that I do see there look like they really enjoy there time there. . And it's not noisy there so I know there good with the neighbors . Glad to see a great place do well . Maybe I'll go there one day . But I don't drink so I not gonna make any promises ."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaXZmVkpBEAE",
            "text": "Ate here 2 nights in a row it was so good. Pork meatballs fabulous, roasted brussel sprouts excellent (seems to be a NY thing)  all pasta is delicious. Cocktail menu fabulous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzclA3aFBnEAE",
            "text": "Nice modern space, good for family or date nights. They get busy around 6-7pm on a Saturday night so plan to be on a waitlist outside. The aperol spritz first round was pretty good and then the second tasted like water. Also very ice heavy. We were sipping on our second round planning for a third and the waitress drops off the check because we said no to dessert, which felt assumptive (no question if we wanted another drink, or if we wanted the bill) and lost tip revenue on her part. There were two other tables open and no one waiting so i didn’t think they’d rush to turnover the table. Good place overall it was just a surprising rush out at the end of an otherwise nice experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYZ2RmM1ZBEAE",
            "text": "They were able to accommodate 10 of us for my wedding rehearsal last minute. Everything was amazing and food was delicious. Grazie!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMzdyYnF3RRAB",
            "text": "I’ve been coming here for many years. Food is always excellent. Best pasta and cocktails in the area. Prices have hiked up quite a lot though so we now go less often, but definitely recommend it for special occasions. Must try the olive oil cake!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuLUxLOTJnRRAB",
            "text": "Great food and a wonderful discovery! Everything we tried was delicious, and the quality was top-notch.\n\nThe only downside was that the service felt a bit rushed.\n\nStill, we had an overall fantastic experience and would definitely recommend it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIN2Z2cjFBRRAB",
            "text": "Somewhat of slow service given the weak flux of people at the time that we dined. The food was good however the home made pasta was very average."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMDduY2RREAE",
            "text": "Great restaurant - really good food. We enjoyed the Bruschetta and pasta choices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNILUxDWkRBEAE",
            "text": "An absolute treasure in Greenpoint. My wife and I can’t wait to live closer and frequent this restaurant more. The decor / atmosphere was simple, clean and lovely. Our waitress was very sweet and helpful. The overall service was very professional and attentive, keeping our glasses full and plates clean between each course! The chicken was unbelievable, probably the best chicken dish I’ve had so far in NYC. Order it asap. That sauce, wow…. The fried eggplant and burrata starter with parm and balsamic glaze was inspiring. The two pasta dishes we ordered were delicious as well and not too salty (usually restaurants are too salt heavy handed). A real gem of a place. Photo credit: wife “snake”"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eWJpSXVnRRAB",
            "text": "Not terrible but not amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aWJLbEdnEAE",
            "text": "Very average but convenient neighborhood spot. Expensive - pastas are in the same price range as the top places in city but are simply just not as good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiZzY2TkRBEAE",
            "text": "One of the best restaurants in the area. Always consistent in everything they do, from service, to food and drinks… simply amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOHNHOXlnRRAB",
            "text": "The food was amazing as always!  The staff treats you like family.  This establishment is a Greenpoint staple.  Highly recommend if you are in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiXzQtUnd3RRAB",
            "text": "One of our favorite spots in GP! It’s a neighborhood staple - the staff is friendly and attentive and the food is always consistent and delicious. We love the papardelle bolognese, roasted chicken, agnolotti and for apps - octopus and eggplant. Side of cauliflower is great too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMXEyMDJnRRAB",
            "text": "Great pasta but overpriced in our opinion"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOVphOXJ3RRAB",
            "text": "I came here for my birthday and loved it! We had the eggplant, short rib, pappardelle and some Hornet cocktails and everything was delicious. Staff is incredibly kind the GM came to talk to us and was so sweet. Can’t wait to go back for the short rib ravioli and new happy hour."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMLS11WDlnRRAB",
            "text": "Naked Dog is a neighborhood gem. I’ve been going here for years and I intentionally supported this place during Covid to make sure they stayed in business. The staff has always been helpful suggesting wine for my meals and they make a fantastic Negroni. Their spaghetti has some of the best sauce that I’ve ever tasted and make sure you order the eggplant for the table."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaDdHMDhnRRAB",
            "text": "Love this neighborhood spot! Do not miss out on the crispy eggplant and burrata dish to start. We’ve gone with a group and sat at a large table as well as just grabbing seats at the bar, a memorable experience every time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaDlINzJBRRAB",
            "text": "Naked Dog is one of my absolute favorite restaurants. It's always a huge treat to go. The Spigola is my favorite. Their staff, service and food...all incredible. Consistently welcoming and a true neighborhood restaurant. It's always on my recommendation lists when people come to town because it's the no1 gem of Greenpoint."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURMaC13MBAB",
            "text": "Food is amazing, staff is great, always a pleasure going here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMLTQzY0V3EAE",
            "text": "Been my favorite restaurant since moving to Greenpoint in 2017! Consistent, friendly, familiar, and delicious food. A neighborhood staple!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNDRiTHFRRRAB",
            "text": "What happened to this place? Naked Dog used to be my favorite establishment in Greenpoint. It has  gone downhill very fast, most especially in terms of service and even the food.This place used to be so welcoming, the food  phenomenal and the service was excellent.\nThe staff has changed completely and this place was not what it used to be. Don’t waste your time or energy."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMTVhUWJBEAE",
            "text": "관광객이 꼭 들러야할 곳은 아닙니다 ~ 😊스테이크는 무지 맛있었어요 !…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaTg3cjF3RRAB",
            "text": "Yeah, this place is great. Its amazing reputation preceded itself and they lived up to what we were expecting. Wonderful interior, just beautiful and clean. The service was truly top notch - helpful, friendly, professional. The food was all so freaking delicious too. The pesto on the bruschetta was simply divine - subtle yet powerful. The strozzapreti melted in my mouth. The drinks were delicious. Top notch everything and worth every penny."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREN2ItNl9nRRAB",
            "text": "What a hidden gem! I loved the chill neighborhood vibe and the bartender was great - starting me off with nice cocktail. The food was excellent - had the eggplant burrata to start and the short rib ravioli which was amazing! Very solid dinner!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoeWVDVHR3RRAB",
            "text": "We had such a great dinner here. All the food was amazing and the service fantastic.\n\nThe eggplant is just as good as everyone claims, is a must order. Then the fungi pasta we had was so perfect we decided to continue with la bisteca a la Florentina that was yummy and perfectly cooked.\n\nWe also loved the olive oil cake. Looking at the other tables, all looked great too.\n\nPotions are huge and it’s worth the price considering the portions. Looking forward coming back to try everything else!\n\nThe place is beautiful and the volume is great to have a conversation so it’s a great place for dates or come catch up with friends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1N2R5Ym5RRRAB",
            "text": "Super friendly service (they helped us make shade for our dogs and brought them water and a snack!). The portion sizes are great and the food is delicious. Try the bolognese sauce, it’s so good! Lots of wine options as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4djhDN3BnRRAB",
            "text": "Great pasta dishes! Very fresh and homemade! The bread provided was a bit cake-y and not what I was expecting. No reservations are accepted so I recommend dropping your name on the list prior to 7! On a Saturday night the wait is 15-20. Beautiful restaurant!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyeGJPa2lnRRAB",
            "text": "A hidden gem in Greenpoint serving delicious, gourmet pasta. We loved the ricotta agnolotti with truffle butter sauce and the strozzapreti with rabbit legs and pecorino, as well as the amazing roasted cauliflower with pine nuts and golden raisin. Unfortunately, the tiramisu was a bit too sweet and not enough coffee flavors. The service was friendly and the ambiance was lovely, without any pretentious crowds. The interior was cozy yet perfectly spacey, with decent bar seats."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQweU5laE5REAE",
            "text": "Good Italian fare, in friendly environs...\nThere are plenty of Italian restaurants in NYC, but precious few where you can get _actually_ good ravioli. Which you can, here. At a decent price too (for NYC, mind you!).\nThe rest of the pasta is hit or miss - in the sense that the \"miss\" makes it go from *excellent* to just plain \"quite good\", so yeah, you really should come here anyhow 😜\nAnyhow, add in a good wine selection, friendly staff, and location (if you're in Greenpoint!), and hey, you'll probably keep coming back!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3OHUySFBREAE",
            "text": "The best Tagliatelle (mushroom pasta) I'd ever had; ask to top it off with truffle - makes it even better. Great bar with a very cool bartender - good drinks too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPN1lLb3hBRRAB",
            "text": "Going to give it 5 stars for price point.\n\nDessert and pasta was phenomenal. Service was great!\n\nOutdoor seating could be a little more comfortable.\n\nOverall a great find."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcE83OGJREAE",
            "text": "Really great place. Service was on point. Food was equally as good. Didn’t get any drinks, but the bartenders were putting out a steady flow of good looking ones. I got the short rib and it fell right off the bone. Girlfriend got the ravioli with sage butter, I think I liked her dish even more. Stop in and eat."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpX05pUXpBRRAB",
            "text": "Incredible dinner and service. Only outdoor seating right now. Seated quickly. Delicious menu. House made focaccia served with dinner. Great bottle of montepulciano. Pulpo appetizer, tagliatelle was the highlight of dinner, beef short ribs…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZeXVfOFh3EAE",
            "text": "Amazing! Service was great. They served us some wine while it was too busy to sit inside so we got sat outside on the bench and both the main managers took care of us. Kept us updated (we went on a Saturday night and didn't have any booking so it was packed). Just that in itself is very rare nowadays! So well done guys!\nThe bartender (we ate at the bar) was very professional and quick to serve us.\nThe food was amazing! The wine was amazing and not overly priced.\nThe desert was delicious too!\nTop place! Top staff!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhNThQRF93RRAB",
            "text": "As a starter Polpo, great prepared octopus with small capers and crushed potatos. Highly recommend. Main dishes, bass and scallops with Kalamata olives and delicate tomato. For me, the star is one, ravioli with outstanding sause (like from Saltimbocca) parmegian cheese sauce and meat flling. If you want to feel yourself like on your vacations in Italy, visit Naked Dog and try this \"Italiano vero\" cusine!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbC0zMUpBEAE",
            "text": "The cutest place ! The food was absolutely divine and the service was impeccable I had such a good time there, & felt real relaxed with the ambiance around me. Highly recommend the place for a date night group get together or just meeting up for some amazing food"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURreTZleU1BEAE",
            "text": "Nice decor. Cool trendy restaurant in an industrial area.\nThough Not very accommodating. Was on a work outing and my boss wanted a change and they literally couldn't make any adjustments and gave her a salad with only…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScmVEVm5nRRAB",
            "text": "A really great experience. The vibes were really great. And the Torretta di Melanzane was one of the best appetizers I’ve had in a long time. Honestly can’t wait to go back and have it again"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2X1p6OUpnEAE",
            "text": "By far my favorite Italian restaurant in New York. All the pasta options are amazing but I would absolutely take the agnolotti if it’s your first visit. Best espresso martini in town too. The staff is kind, fast and really focused into service. I don’t rate them with 6 stars because I don’t have the option. 😍 you’re the best guys!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeUt1MGV3EAE",
            "text": "Great restaurant with ambiance and amazing service. The pasta was delicious and gluten free! Couldn't have asked for better"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhdE5HNm9nRRAB",
            "text": "Everything was amazing, food, decor and staff!!! Would highly recommend the burrata and the agnolotti! I need to go back and try the rest of the menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOGFlcW1nRRAB",
            "text": "I had eaten here several times years ago and had a great experience. Sadly, the most recent pick-up order I had from Naked Dog was incredibly underwhelming. 2 Pasta Dishes, and meatballs for $85. Ok, I can accept this when the quality is on point.\n\nTo summarize this experience I would just say bland! It appears all the food came unseasoned (meatballs included).\n\nThe Maltagliati had zero flavor, was overly dry...and there was just nothing there but the taste of..well.. cooked pasta. I'm not sure how this dish was prepared so poorly.\n\nThe Strozzapreti was the highlight of the 3 dishes, and it's not saying much. Again, just a tremendous lack of flavor overall. 2 Stars for the rabbit, but guys...where is the seasoning?\n\nPolpette Meatballs...again zero seasoning. Just incredibly bland!\n\nI'm not sure if they've perhaps changed chefs since I was here years ago, but it was a huge disappointment for an establishment that was once great, and seems to be fading away from it's former self.\n\nMy advice is save yourself some cash and check out Le Fanfare, Montesacro, Aurora, Ainslee, or Barano."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdHQ3T0R3EAE",
            "text": "For appetizers, we got salad and fried eggplant with burrata. Loved the eggplant with burrata. As a main course, I got chicken. Chicken was nicely crispy and delicious with veggies."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycjhpd09BEAE",
            "text": "Been coming here for over 5 years and it remains some of the best pasta in New York. Always friendly and great service and never once had a bad meal! Crispy eggplant starter, Ravioli main and Affogato desert are highly recommended.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsb01LR3hnRRAB",
            "text": "As good as it gets. My family and I came on a very busy Saturday night for a celebratory dinner for an birthday. Every aspect was perfect. Our server made our night very special. Half of us had never dined at Naked Dog, and she walked us through every part of the menu.  Beautiful wine service, and much attention to every detail.\nFrom apps, to mains, to desert, everything was exquisite. They even have decaf espresso drinks which really topped off our night.\nWe can’t wait to return, and we hope the lasagna special stays! Bravo Naked dog!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREck5qeHdnRRAB",
            "text": "I love everything about Naked Dog.\nThe food is wonderful, the entire staff are kind and amazing, and the vibes are super positive. A great place for a special night out or even just a few stellar espresso martinis at the bar. The bartender is the best around.\nTop notch place, with very unique dishes in a very comfortable atmosphere.\nThank you for everything, Naked Dog."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5eDk3bTVnRRAB",
            "text": "Visited this spot for a meal and gotta say, the ambiance is on point, really sets the mood for a chill evening. The pasta dishes are something else - unique flavors that kinda make you wanna savor every bite. I tried one with corn, sounded odd at first, but man, it was a treat. Though, I gotta admit, the prices are a bit steep, considering the portion sizes. Enjoyed the vibe and the food, but it's more of a once-in-a-while kinda place for me, not somewhere I'd frequent."
        }
    ],
    "reviews_count": 76
}