{
    "name": "Verge",
    "place_id": "ChIJu6YbaZZZwokRtXSsXVLTgOg",
    "grid": "BK1",
    "address": "159 Franklin St, Brooklyn, NY 11222, USA",
    "rating": 4.8,
    "user_ratings_total": 310,
    "phone_number": "(347) 721-3300",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnemVHNXlZWEZLUTFWWFRIQlZkWGwyZDNCM1dYYxAB",
            "text": "The sushi was unreal. Better than I expected. Can’t wait to go back!!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTk4xbExUWFZNVkhWTGNIRkpNVUU0ZUd0UVkxRRAB",
            "text": "REALLY COOL 😀 Our \"coolinary\" 🙃 experience at VERGE Japanese Restaurant was simply outstanding, delivering an authentic taste of Japan right here in Brooklyn NY. From the moment we walked in, we were captivated by the elegant and beautiful decor, which created a serene and inviting atmosphere.\nThe Food (5/5):\nWe started with the classic Miso soup, tastefull and really comforting food. The sushi and nigiri was incredibly fresh and masterfully crafted, with each piece melting in your mouth. The Donburi (Sake Don) was equally impressive—the salmon was extremely fresh and tender.  It's clear that the chefs here use only the freshest, highest-quality ingredients.\nService (5/5):\nThe service was impeccable throughout our meal. Our server was knowledgeable, very friendly 🫶 and attentive without being intrusive. They offered excellent recommendations and made sure our dining experience was flawless.\nAtmosphere (5/5):\nThe ambiance was calm but with good music making it the perfect spot for a date night or a special occasion. The subtle modern and Japanese-style decorations and sort of lighting create a peaceful environment that lets you focus on the food and company.\nOverall:\nWe can't recommend VERGE Japanese Restaurant highly enough. It is a genuine gem for anyone who appreciates authentic Japanese cuisine. The combination of delicious food, excellent service, and a tranquil atmosphere makes it a must-visit. We are already looking forward to our next meal here!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMlZUbG5RMjV5YlZkWWJ6aDJUa2REYjNsUFlsRRAB",
            "text": "Good sushi, great service and lots of gluten free options."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdVQzQlphSEF5VDNoMWFtOWFSSE5HU2xOcGVrRRAB",
            "text": "I’ve been a big fan of this restaurant around here! The Niguri platter and Dijon miso salmon are always a hit with me. The fish is so fresh, and the staff is super kind. The salmon was seared to perfection and seasoned just right. And if you’re lucky, Jack might pop out and show you how the phonograph works! It’s such a great vibe. Starters like the tempura shrimp and lamb chops are also amazing.  The steak was also a hit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGblJUQjFZMGhVZUdsemVYaEJXa2wxVGtsRWIzYxAB",
            "text": "Absolutely amaaaazing sushi very fresh very creative, delicious flavors. I’ve been coming here since it has opened and it has surpassed my expectations every time. Love love love, highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMVQzcGxRVUl6YWxGaGMzUmlXbXRzYTA1UlRrRRAB",
            "text": "First I saw the little beings in the edge of the window. Then, above them, bulbs that looked like rocks, floating mid air, dimmed, perfect✨\nI wasn’t sure it was still open but my Joshua went on to see if we could have a little dessert at this Japanese haven-the answer was yes 🙌🏻\nFrom the whimsically intentional decor, to the atmosphere that filled the room, the warmth and wonder was everywhere. And we were the only two people in there. Just a few sashimis and then one Kumamoto oyster for me. What a delight! Their fish was exquisite-just as the exuberant expression of when you’re feeling elated “fresh as a fish” goes. The oyster balanced originality with tradition in a complex, yet accessible unraveling to the palette, where your mind can find each of the ingredients meet each other and dance. The creaminess of Kumamoto really allows interesting alloys because of its texture. As I am writing all this, I do remember one more texture. The texture of the rim of the tea cups they served us a delicious Oolang in. Not only it looks like its own little ceramic pastry, but when you would bring it to your lips-Oh! What a triumph of design. Not only it tasted serenely warm, but it felt so luxurious on the lips-even a bit osé if I may 😋\nThe owner stayed with us after closing, telling us about how him and his wife open this gem in Greenpoint some time ago & how much love and precision they put into it. You can see their eye in every little corner of the place. From wonder to smiles, my eyes wandered softly the whole time we were there. How LUCKY 🍀 we were to have been in a place of excellence. Where taste met design, where they swayed along with sweetness & wits, creating a unique corner for you to feel what is the symbiosis of yin and yang ✨🙌🏻🍃✨🍂🪁🙏🏻\nFor all lovers of deep & quiet “wow”s…\nThank you 🤩🤗🥳\n🌬️🍣🫧💦✨"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toYVNHUlFibXB3UmxWVlRsQnRNa05KZWxsaVZtYxAB",
            "text": "Large tasty portions absolutely fresh and great service too"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNE1DMUxPRUUxY1ZKWmVFZHZaMm95TjJOaGNHYxAB",
            "text": "This small Japanese restaurant is cozy, authentic, and full of charm. The food is fresh, flavorful, and clearly made with care. The staff is warm and welcoming, making the experience feel personal. Great choice of sushi and sashimi. A perfect spot if you’re looking for a little taste of Japan in a relaxed setting.\n\nP.s. I would recommend the chef to offer real vassabi."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNVZtRmlNRlJ6ZEhKdFdqaHVhSEZEWTJSRVIxRRAB",
            "text": "Came here for dinner & the food was FIREEEEE 🔥This sushi spot is truly exceptional. With my refined taste buds, I can confidently say the food was nothing short of excellent. Each piece was fresh, balanced, and bursting with flavor—the kind of quality that sets a new standard. From the perfectly seasoned rice to the delicate cuts of fish, every bite was crafted with care. The presentation was beautiful, and the flavors were even better. If you’re looking for sushi that’s both delicious and memorable, this place delivers on all fronts."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMVdYaHJUbTlIVFZaTWVqRnpkekJSVWxwVllWRRAB",
            "text": "My girlfriend loves this place and so do I!"
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMVgwdEljak5LWVdoQ1FrUnFiV05IVEVaTE5IYxAB",
            "text": "Je suis venu ici par hasard grâce aux avis, je viens de manger les meilleurs nigiri de ma vie 🤯\nVraiment excellent ! Je recommande à 100%\nJe viens de passer 1 mois à NYC et c’est le meilleur rapport qualité prix de la ville"
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaGEyeE9Zekp6YkVsWFJYQm5MVXN4YlZBeldVRRAB",
            "text": "Exceptionnel vraiment !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NeWRUUTBaR1ZOY0RSTFVsWm1Rbkp3ZWtKTVdHYxAB",
            "text": "Arguably, the best sashimi in Greenpoint! Will be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bWJYUkhXSGhvTW5oUFpHeE9Obll0V0hkNFJrRRAB",
            "text": "Elegant restaurant with delicious food. Lovely interior. Great for lunch or date. They have great lunch menu. Stuff is very friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TFRtMWxaVWg2YjA1blNIRjFkVWhNVVZOWmJsRRAB",
            "text": "one word: extraordinary"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabmNqTjFTbTVVTUROTlZIY3hVR0oxZFdnM1JFRRAB",
            "text": "Amazing food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMFZXTmFiRk5mU1V0Mk9VRkNla053TTJoeFMzYxAB",
            "text": "Fantastic service and food and the nicest crystal glasses, like my mamma’s Waterford crystal set we were not allowed to touch as children 🧒"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdWRYZG9lVjluY25WTVNtdHpXbkJrVVRaQ1pHYxAB",
            "text": "Amazing sushi - they have everything unique and classic"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGek9XRk9lVkpzTmxSelVGVmpOVTlHYUZSWE1HYxAB",
            "text": "My girlfriend and I LOVE Verge - it’s our favorite restaurant in the city. Great atmosphere, amazing staff, incredible food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oaGNsaHpiMlp6VTBOVmEyUjFZMFkzVFdGWGQxRRAB",
            "text": "Incredible sushi, and unique flavors across the menu"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM1MxUmZNRXRyVVV0Tk5qSkpORXBFYUhsUU0yYxAB",
            "text": "Jack is the man! Great service and conversation. Made some Tennessee Boys feel welcome"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWFUySXpUbGRPUVVoNFJsSk9TMmxJWDNWS2RtYxAB",
            "text": "Great food great beer and sake great music great service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UU9HUnFiVGhmWjJwUFFuZG9TbVZYWmpsWVVXYxAB",
            "text": "The service was good, but I was really disappointed with the assorted sashimi.\nWe were told it would be two pieces per fish, but the sashimi platter arrived with overly thick cuts that hadn’t even been properly sliced.\nWhen we asked for it to be cut properly, we were handed a silver knife and told to do it ourselves — which obviously doesn’t work for raw fish.\nThe sashimi was far too thick and completely ruined the texture and flavor.\nIf you don’t understand authentic Japanese cuisine, please don’t serve it. It was honestly disrespectful to what real Japanese food should be"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VM2FHTk5VMDE0VUMwemVrdHdRVTFLU1RBdFYwRRAB",
            "text": "Ordered takeout from here and so glad I did! The sushi set offers eight pieces and a choice of maki or temaki ( roll or handroll). I like the spicy tuna roll with the crispy onions, adds a different texture and flavor. Each fish piece was soft, and well prepared.\n\nI will be back for more!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTFZGcFRZekpDUjBwcGVIbEllbDlZYkhCRVNFRRAB",
            "text": "The best experience, service and food ever✨"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLVDAydXJFbmZfUjlnRRAB",
            "text": "Kind server!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CblUwVXlSelJGZWpjMGVqaEtORmhOVVdSVlRtYxAB",
            "text": "I am waiting for long time no food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZWY4Sm5fck9MZ19RRRAB",
            "text": "Great staff excellent sushi 🍣"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNWEppY09NNWZDNnhBRRAB",
            "text": "I really enjoyed the rice bowl with eel — it was well-balanced and flavorful. I rarely eat kaiso, but this one was fresh and tasty. Definitely the best dish of the three we tried.\n\nNext came the salmon, breaded and served with a sauce that tasted like a citrusy Japanese mayo — interesting, but a bit heavy.\n\nWhat surprised me was that the premium sushi set came last. You’d expect it to be the highlight, but it felt like an afterthought. There were 10 pieces, all different, but the fish tasted a bit dry and lacked the freshness you’d hope for in a “premium” selection."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQWE5nZTNWcnVMaHdnRRAB",
            "text": "service is worst"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKaVN2OXFrNm9QNDJBRRAB",
            "text": "best restaurant in new york"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeHYtMlRBEAE",
            "text": "Everything was of high quality and fresh; loved the sushi premium selection: the sea bass was especially good. The Bansai drink was refreshing and the temaki was good as well. Great space and excellent service. Merci :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNnZEejBBRRAB",
            "text": "We went for lunch here and loved the food. My friend enjoyed the lunch special. I didn't try and order anything besides sashimi because of my food allergies. The fish was very fresh and delicious.  The restaurant was quiet when we went. The atmosphere is upscale casual. I judged this based on the decor, especially in the bathroom which was beautiful and clean."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbUt2UzF3RRAB",
            "text": "Was a delight and pleasant surprise.  I chose to explore this menu as they had just updated it for the summer.  The black cod was amazing and the tuna rolls were to perfection.  Recommend this place as they are looking to build upon what they have.  Will be coming back for mere"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSX3UySWlnRRAB",
            "text": "Update: April 28,2025\nWow, I came back after a long time and everything was super super good. They changed their menu and I'm just blow away by the quality and taste. I'm definitely coming back and bringing friends. I love everything I ordered and I ordered a lot.\n\nPrevious:\n\nThe ambience was superb, the service was attentive, the visual appeal of every plated dish was great… but the taste did not match the upscale place. My priority for a restaurant is the food. If I were to close my eyes and judge this place only by the food, I would’ve given it a 3 star. It’s not that the food tasted bad. It just tasted average with nothing sparkling my taste buds enough to make me go mmmmmm reflexively. For the price, you are paying for the ambience and instagramable look of every dish. I’d personally rather it be the taste."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJajVDYTZnRRAB",
            "text": "Such a hidden gem — really happy we came here instead of some TikTok place 😜 Jack took AMAZING care of us too 🤭"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNzhlZkZnEAE",
            "text": "This place is incredible. My boyfriend and I always do take out and end up getting the same thing during their lunch special and it’s been our go to sushi spot since we moved to the neighborhood but wow.. dining in and experiencing the other items on the menu… ❤️‍🔥we ordered the toro crispy rice, the soulmate roll and the Greenpoint roll (this one did something to me and it’s now on top of my list. Pls get this!)\n\nThe service was also 10/10 - Jake was our waiter and made our experience even more memorable!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaXJ2YWlRRRAB",
            "text": "Amazing food love the soulmate roll. Very fast service and great for takeout as well!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bzdiaGRnEAE",
            "text": "Best sushi in Greenpoint. Great date night spot and bar usually has seating or can accommodate when busy in a short time"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b0wzV1ZnEAE",
            "text": "Excellent sushi.\nAttentive, organized, respectful staff.\nReasonably priced food.\nCool, modern atmosphere without feeling pretentious.\n\nI love this place and will continue to come back!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMDRld19BRRAB",
            "text": "Food is okay but very overpriced."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMmVxZWZnEAE",
            "text": "I been going to verge since I moved to area it’s become one of my favorites, delicious sushi, salmon drinks and most of all the owners Chris and Yuki and team Alysa jack.\nIf you find yourself hungry early don’t worry they open at 4:30 daily."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMjZtUFBREAE",
            "text": "Best place to get chiraishi don. Fish are all fresh and the rice is flavored just at perfection."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbFBIODdBRRAB",
            "text": "Verge is now my favorite sushi spot in the neighborhood! I walked in on a Thursday night and was seated at the bar for dinner. Service and atmosphere was warm and inviting, and dishes were delicious and creative - very high quality fish and ingredients. Even the mochi dessert exceeded expectations! Love this spot and will return again and again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURna0tIZWN3EAE",
            "text": "Food is great, though expensive.\nWaited 58 minutes for the Sushi Premium plate, with no warning or acknowledgement beforehand; won’t be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXZIQWdRRRAB",
            "text": "Great food! Delicious!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndXNHYmNBEAE",
            "text": "Simply put this was the best sushi my wife and I had. The freshness in quality and creativity of each dish is what made the sushi next level.\n\nThe space is small and intimate, my wife and I sat at the bar top which wasn’t an issue. Very nice atmosphere and loved the decor. Great service to top everything off made this my number one sushi moving forward."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaW9EVk9REAE",
            "text": "I ordered on Uber eats for pick up. The pick up time was in 90 mins at 8pm. I showed up at that time (8:02 pm) and had to wait for over an hour for my food to come out. No one told me how long to expect and I just stood there doing crosswords on my phone for an entire hour waiting. Uber said I couldn’t cancel bc the restaurant had my order and I also did not expect an entire hour. I dunno maybe don’t do take out orders if it’s going to be 2.5 hrs and u waste someone’s time like that? Food was good though."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN0xpTU9BEAE",
            "text": "The rolls were phenomenal. The fish melted as you ate it. Will be coning back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcnN2SzZnRRAB",
            "text": "Salmon plate and chicken katsu dinner are so good for takeout"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfamZ6NlNREAE",
            "text": "If you like sushi. This is the place to be!\n\nFish quality: the freshness of the fish is amazing. By far the best sushi quality fish in greenpoint or Williamsburg.\n\nPortion: the sheer size of these rolls will leave you gobsmacked. There is a literal mountain of fish in every bite.\n\nFlavor: the flavors were simple but very delicious. The quality of the ingredients and the fresh ground wasabi let the simple ingredients shine.\n\nTakeout: I was so enamored after my first visit I ordered takeout the very next day thinking our huge rolls were a fluke but they delivered gigantic rolls again!\n\nValue: very reasonably priced for the portion size!\n\nCons: I want to write a bad review before everyone finds out about this place but I also want it to be open forever.\n\nI’ll be back soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdkxxYTN3RRAB",
            "text": "Best place ever . The food and service keeps me coming back all around ! Shout out to Chris for all my sake bottle recommendations! I usually come alone , but such a intimate and beautiful setting for a couple . Even a celebratory gathering with friends and family . As much as I would love this little place to myself , I think everyone deserves a chance to experience such high quality food and service !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwek1ySzZ3RRAB",
            "text": "We had an amazing experience here at Verge. Their sushi is fresh with high quality. The staff was very attentive throughout the entire time when we were there. I also loved the ambience there. A gem in Greenpoint, Brooklyn. Highly recommended Japanese restaurant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2clBTUTZBRRAB",
            "text": "Usually when Japanese restaurants do a full menu of composed dishes AND nigiri/sashimi it can be questionable but wow. Verge fires on all cylinders. Fish is fresh (uni was so good), dishes are EXCELLENT- really unique sauces and flavors, and the prices could totally be worse. Get the black cod appetizer.\n\nSpecial shout out to our server Jack who was SO fun, and took my gluten intolerance very seriously. Would go back 10/10."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaek52VWV3EAE",
            "text": "February 2024\nI wish my friend who introduce me to this great restaurant (her favorite place) still lived in the area because we will probably hang out at this place often. She moved to long island, and she gave me a gift voucher as a Christmas gift. I decided to use it on my anniversary, so the night went well and wonderful.\n\nThis time we enjoy a bottle of Kiku Nigori; nice unfiltered sake.\n- Toro Tartare; contemporary decoration, looks so much fun.\n- Paradise; fatty tuna wrap on uni and top with caviar and yuzu sauce (my most favorite)\n- Verge Rad carpet; suggest by our server, I just want something different and it is creative!\n- Sashimi Premium 12 pc; I get bigger set this time\n- Garlic Butter Ribeye Steak; cooked perfectly and I love it.\n- Lava Cake with Ice Cream; I always have room for dessert.\n- Hot Green tea; I guess not a lot of people order tea. It is actually more like rice tea than green tea, looks like make the whole pot but charge by cup.\n\nService is great, they still keep the standard, good quality fish and mix modern interior. Even the restaurant isn't walking distance from my apartment, but I still prefer to come here for good, wonderful sushi.\n\nNovember 2023\nAmazing! Good quality of fishes and food from the kitchen. I live nearby but my friend who used to live super close to this nice Japanese restaurant suggest that I should come and try. I thought it will be a big place but turned out to be small, cute, trendy spot. Vibe is good, I love the bar, maybe if I go by myself, I will prefer sitting at the bar.\n\nMy hubby who's super simple only wants Salman & Tuna Maki. Garlic Butter Ribeye Steak is so good, if you like stuff from the kitchen. I have Sashimi premium with extra sushi rice (side order) Them advertise the set to be like omakase quality. The price kind of high but I also like it as how good the fish is.\n\nService is good and friendly. When you come to real Japanese place or get service from Japanese people, it will be a character that if you are around long enough you can tell how different and unique, they are."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSamZIV1RBEAE",
            "text": "First impression is the quality of the food. I can almost taste the sea breeze from the table. I had Sashimi, can tell how fresh it is though the sweetness - like omakase. Sushi also great and you can taste the combination of rice and seasoning are well designed.\n\nBesides the food, the seating is elegant enough for dates. They got wide range of sake, impressive brands. Which also great for business talk to impress the client."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwODRxMVJREAE",
            "text": "One of the Best! Me and my friend didn't have a reservation but they accommodated us into their schedule anyway and I'm so thankful they did. It's a intimate dining setting with attentive friendly service and delicious food. The menu is versatile offering land and sea options. We got the fried rice and we ate every grain, it was so good, lol. The sushi rolls and fish were the best I've ever had. The freshness of the fish was everything. Melt in your mouth butter texture. We also ordered lamb chops which were seasoned to perfection. The beer was the perfect temperature and our waiter was so friendly and welcoming. I couldn't have asked for a better dinning experience and will always remember this place and look forward to coming back when visiting New York. I'd eat there everyday if I could, lol. Thank you!!! Keep up the great work and love for what you all do. It's appreciated"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwek5iVndRRRAB",
            "text": "This new sushi restaurant is worth a try. The place is exquisite, the food they offer is quite unique, and the taste is superb. The service is very personal, highly recommendable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNzdmMGF3EAE",
            "text": "Verge is a must-visit spot in Greenpoint for food/sushi lovers!! The food is AMAZING - fresh ingredients, creative and delicious dishes - delight in every bite! Cozy and modern vibe, super lovely staff - perfect for casual or date nights 💜.\nMy favorite go-to combo is the Greenpoint signature roll, Verge signature roll, and the sparkling sake. Definitely worth checking out!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdzUzam1nRRAB",
            "text": "This place was such an amazing find in Greenpoint!\n\nIt has good variety on the menu and the sushi was very fresh.\n\nThe beer and sake selection was good\n\nService was exceptional!  The vibes, decor and cleanliness was also 10/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNE1ITE5REAE",
            "text": "Went once and didn't have a reservation, but finally booked one and it was worth it! The hostess even remembered us from that one time we came and couldn't be seated.\n\nCrazy that there's a really nice Japanese and sushi spot here in Greenpoint. The crab cake was so good. All of the sushi and maki were yummy but not amazing, still good quality. Our hibachi steak was also cooked perfectly. The edamame had almost a popcorn flavor which was surprisingly addicting.\n\nSadly no dessert though. Definitely worth a visit. The staff is also fun."
        },
        {
            "date": "2년 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNXRlSDJBRRAB",
            "text": "老板娘人好好和我们聊了很久！\n原来所有的装修设计都是她一人想出来的.\n真的太棒了.吃的很开心又很欢乐！\n而且现在还可以自己带酒不需要开瓶费！\n什么神仙宝藏日料店啊！爱了！\n期待下次去吃到更好的海胆呢～"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4ak42RHdBRRAB",
            "text": "Came here on a Friday night with my sister on a whim.  The wait was only 30 minutes and definitely well worth it. We had an assortment of sushi, sashimi, and sake.  Everything we tried was beautiful and delicious!  Would definitely recommend the Paradise roll and Truffle Toro. Michelle was our server- she was amazing and had great recommendation!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzd2RxQ19BRRAB",
            "text": "Good vibes, amazing modern style sushi. Recommend getting the premium 10-15pc sushi, Katsu, Lamb, all the special rolls. Amazing spot in greenpoint to get sushi and some wine"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOXVmZVhnEAE",
            "text": "If you decide to visit this incredible Japanese restaurant in Greenpoint, Brooklyn, you'll be treated to an unforgettable dining experience created by owners Chris and Yuki. Their passion for exceptional food and welcoming ambiance is evident in every aspect of this restaurant, from the carefully crafted menu and exquisite presentation of dishes, to the stunning and cozy design of the space. You won't regret visiting this gem, where you'll be able to savor the tastes of Japan in style."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwek5yazVBRRAB",
            "text": "Although this restaurant is a bit smaller in size, it boasts a cozy and inviting atmosphere. What sets it apart from the sushi restaurants I've previously visited is its distinct and special menu offerings. The flavors of the dishes are impressive, and the freshness of the sashimi stands out. I highly recommend bringing your friends and family to experience this delightful culinary adventure."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaGZ2cG93RRAB",
            "text": "This place is truly a hidden gem and I wont be surprised if it evolves to become a premier sushi spot in BK\n\nFirst of all the staff were wonderful. We went on a night that was luckily not too busy. Our server was polite, attentive, and gave us great recommendations.\n\nThe ambiance is very warm and friendly. Place isn’t too big. Perfect for a good date night.\n\nWe started off with the paradise (Hokkaido wrapped in bluefin with some caviar). Nuts. 10/10 recommend. We almost ordered a second. Every other thing we ordered was fantastic. We got the toro crispy rice, verge signature roll, sushi premium (assortment of chefs choice of fish), house fried rice, garlic butter ribeye, scallop Maki, and toro Maki. Every single item was incredible. The fish was so fresh. The fried rice was excellent. I will certainly be going back!\n\nOf note! No cocktails. They do have a solid collection of Japanese beer. Not a beer fan but i enjoyed the ones I had!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWd19xWURREAE",
            "text": "Just tried the newest sushi spot in greenpoint. The food is exceptional, the fish quality is top of the line. The attention to detail is unmatched. Best pork katsu I’ve ever tried - it’s iberican pork … you gotta try this. This will be on the Michelin list. I Bet."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bk9LeW5BRRAB",
            "text": "This hidden treasure in Brooklyn offers top-notch sushi. The presentation is exquisite, and every dish was exceptional. The foie gras practically melted in my mouth! Paradise roll was truly heavenly- it was a whole bite of uni."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z09UTS1RRRAB",
            "text": "An amazingly cool spot with immaculate vibes and the most fabulous dish ware. Food was fantastic, highly recommend the salmon carpaccio, the verge red carpet (fish wrapped in pickled beets is amazing), and, if you’re there for desert, the lava cake was gorgeous, incredibly chocolately without being sickeningly sweet. Verge hit the spot for elevated cuisine without being inaccessible. The best nigiri I’ve had in the neighborhood that rivals some of the better spots in the city. Verge has done a great job of creating a fusion spot while still hitting the notes you know and love from traditional Japanese food. Highly suggest stopping in, I know I’ll be back soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MHBPNm1nRRAB",
            "text": "Came here for lunch with a good friend after I had ordered their sashimi bentos on ubereats a couple times. (Not sure if they still use disposable bamboo boxes but those takeout bentos were cute and tasty!)\n\nWe enjoyed the oyster shooter and our respective sashimi bowls for the dine in. Service was unobtrusive and prompt, although it was also a very quiet Saturday lunch—I was surprised it wasn’t busier. Def worth a visit if you live in Greenpoint/Wburg!\n\nNice ambience for business lunches or date night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoX1lMaFJ3EAE",
            "text": "Had the pleasure to eat at Verge during their soft opening. The ambience and service were impeccable. They offer unique Omasake style dishes and everything I had bursted with flavor. Excited to have this in my neighborhood and can’t wait to eat again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaXYtMllBEAE",
            "text": "I’m excited for you, I’m excited for Greenpoint. A slice of upscale Manhattan Japanese fare quietly enters Brooklyn. Thoughtful decor and plating, elegant lighting and atmosphere; Verge will shortly join the pantheon of local, future Michelin stars/nods that is Nura, Wenwen, and Bonnie’s. Chris and his staff are sure to delight. Sit at the bar and enjoy the show that is alluring food, come to life. Definitely go now before the waitlist gets too long."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMGNUSDl3RRAB",
            "text": "This place is beautiful! Just a gorgeous space with lots of brilliant artistic design touches. The food is incredible. Not just gorgeously presented but the flavor and texture and everything is so on point - the edible flower on the chu toro, for example was a burst of flavor.\n\nI mean I really hope the flower was edible. It was on top of the chu toro. I ate it, and it was delicious so I think I did the right thing. Fancy foods still confuse me at times. I digress, this place opened on Monday. The food, atmosphere and service was supreme. Can not say enough good things. Not average sushi, this is great sushi. Highest quality everything."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKM0xmRVRREAE",
            "text": "We had the most wonderful & memorable date night here! The food was absolutely superb—So much great flavor. The restaurant is beautiful, every detail is carefully crafted, and they play lovely jazz music—The perfect ambience. To top it all off, the service was incredible—Chris & Jack guided us through our meal with the utmost care. 10/10 we will 100% be back soon! Thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NGJHclVREAE",
            "text": "Verge is a great spot in Greenpoint offering all types of sushi and hot Japanese entrees. I really enjoyed the sushi menu because it varied from fusion style sushi with all different flavors to a traditional nigiri line up that was delicious!\n\nWe had the:\n- Verge Red Carpet which was a spicy salmon and potato crunch wrapped in a pickled beet\n- Truffle Akami Chu Toro which was a medium fatty tuna served in wasabi yuzu sauce topped off with shaved truffle\n- Soul Mate Signature Roll which was a spicy bluefin tuna avocado served in a heart-shaped roll, wrapped in more bluefin tuna and topped with beet crunch\n- Sushi Premium which was a fantastic nigiri line up\n- Seafood Magazine which was a shrimp, scallop & lobster tail medley accompanied by corn and asparagus served in a buttercream sauce\n\nEverything was solid - my favorites were the truffle akami chu toro, the soul mate roll and sushi premium!\n\n@nycfoodsnob"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMS1TMjVBRRAB",
            "text": "Definitely closer to 4.5, this place really is a little gem. First things first: the service here was so lovely and attentive, I would give service alone 5/5. The ambiance was also very cute and homey, the lounge music was a bit on the classical/formal side but nonetheless nice.\n\nNow the food, I was pleasantly surprised!\n- edamame butter (5/5): probably the best edamame I've had to be honest. Yes, it's \"just\" edamame but the garlic and butter flavoring is not to be missed.\n- verge red carpet (4.5/5): loved the creativity and texture of this one\n- Kani salad (4/5): solid and refreshing. Portion size was bigger than expected.\n- soft shelled crab (5/5): just yum, I could have eaten another one of these. Fan of the spicy Thai sauce too.\n- scallop maki (4.5/5): great flavoring, also thought the value here was good since it came with ~6 pieces\n- jalapeño yellowtail maki (3.5): wish they would have seared the jalapeño or added more flavoring\n- black cod (4/5): nice flavors with a nice variety of vegetables\n- soul mate signature role (4/5): very adorable in a heart shape\n- lava cake (4/5): solid, staple dessert\n- caramel pudding (4/5): it's more like a flan, deep caramel flavors, simple presentation.\n\nWe downed this all with a large hit sake, which complemented the meal perfectly. Would def come back to repeat a few of the dishes and try more of the menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENkliVlJREAE",
            "text": "AMAZING! Just left Verge and can't to write the review. It was my first time there. The food was delicious, nice atmosphere and excellent service. Can't wait to go back again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdkthZm53RRAB",
            "text": "Not just a sushi restaurant! Though the sushi is super fresh and delicious, be sure to venture into the other plates and bowls: the wagyu beef bites are small but tasty. A good selection of wines are available as well as other drinks, sake too of course. We ventured in at 6pm on a Friday and managed to get a table for 2, though it filled up pretty quickly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsNjREM213RRAB",
            "text": "Food, service, atmosphere, everything was genuinely so good. Staff was really attentive and nice, I visited around holiday season the ambiance is so cozy and warm I love how spacious the tables were too! We ordered:\nVerge red carpet\nSashimi premium (my favorite🌟)\nToro tar tar  (my favorite🌟)\nAkame Tuna rice donburi\nScallop shiyoyaki\nEmerald Octopus\nFearless authentic roll  (my favorite🌟)\n\nIf you’re in the green point area definitely check it out, there are soooo many nearby art galleries/ stores and cafes around so a perfect spot for all day date activity ☺️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M0wyVHZnRRAB",
            "text": "Everything is delicious; you can taste how fresh the fish is from the garlic shrimp to the rolls. The sparkling sake was so refreshing. Look forward to coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N0lMSjdnRRAB",
            "text": "Just stopped by for an early dinner on Sunday and had a very pleasant experience.  Wasn’t sure what to think of the place as a lot of new restaurants in Greenpoint have been opening that have no real soul or identity.  The menu is very large which is usually a bad thing, but we decided to roll with it and try everything from kitchen apps, to sushi apps, to skewers and rolls.\n\nEverything tasted fresh and well cooked - simple good quality ingredients make a big difference.\n\nThe tuna toro tartare (pic attached) was a surprising take on beef tartare and not the typical chopped up tuna with whatever sauce. This came with a quail egg and, caviar and gold flakes. Gold flakes aside, it was a tasty fun bite of food.\n\nAlso got the salmon and beets roll which were texturally enjoyable, tasty and healthy.\n\nSake we ordered was good, but a larger sake selection with some interesting options would be nice (maybe I’m spoiled by Rule of Thirds and Bin Bin Sake).\n\nOverall, would go back again and try many of the other items on the menu as it seems in this case, a big menu (when executed well) isn’t that bad a thing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaejcyMXVnRRAB",
            "text": "Their food are very delicious. food displayed are classic. I ordered sushi, soup and lamp chop. The food and source are excellently matched. Also their service is in top-tier."
        }
    ],
    "reviews_count": 83
}