{
    "name": "Wenwen",
    "place_id": "ChIJmcr2IF9ZwokRr-u_-UTxju4",
    "grid": "BK1",
    "address": "1025 Manhattan Ave, Brooklyn, NY 11222, USA",
    "rating": 4.5,
    "user_ratings_total": 610,
    "phone_number": "(646) 901-5644",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MWVWaG5UR0UzTUVkdE5WUjZTVkIwVVZCblZGRRAB",
            "text": "Taiwanese fusion! Love the interior. Food and drinks are creative and flavorful."
        },
        {
            "date": "1주 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wM1lqWnBWMVV6VlhWNFMwNUtRa1JsUWxrMlJrRRAB",
            "text": "滷肉飯跟炸湯圓大推 口味偏鹹"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRmNVRTJSSFJ1WTNSWlRVTlZiMGhqZWtKZlYxRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nI visited this restaurant on a rainy day, and it turned out to be one of the best decisions of my trip to New York! Coming from Toronto, where there’s no shortage of Chinese restaurants, I was truly impressed by how authentic this place is. The beef noodle soup was absolute perfection — rich, flavorful, and comforting. Every other dish we ordered was just as incredible.\n\nFrom the moment we walked in, we were warmly greeted and seated right away. The host and staff were attentive, checking in regularly to make sure everything was great. The entire experience — from the cozy atmosphere to the delicious food — felt genuinely welcoming and full of heart.\n\nHighly recommend this spot to anyone craving authentic Taiwanese food or just looking for a satisfying, well-prepared meal in the area. Definitely a must-try!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sakxTMU5URFZLTVdGYVMyTkZaa3N6UzJsZlpVRRAB",
            "text": "Absolutely gas the beef was so tender and the noodles were delicious"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbWIwbDVVbDlXVWtNM1lXdDJaVEpqV25Kb1RsRRAB",
            "text": "This place is amazing…wish i would have realized it was here sooner!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeU1GSlhORXhQVldOTGVrVldMVU5qYmxWWVZGRRAB",
            "text": "Food is very well seasoned and flavorful, some white rice is advised!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyb2FuTjNRRRAB",
            "text": "Lunchtime Noodle Sensation (But Skip Dinner!)\n\nI have to say, the lunch-only Beef Noodle Soup menu (available until 4 PM) was an unexpected delight! The broth was incredibly flavorful and rich, and the noodles were perfectly cooked. The beef in the standard noodle soup was already braised to perfection and very tender, and the extra steak meat we ordered on the side was also excellent.\n\nHowever, I must provide a big caveat: I had a very disappointing experience with their dinner service previously. Not only are reservations nearly impossible to get, and the prices quite high, but every single dish (and I mean every single one) was incredibly, intensely salty. On top of that, the service attitude was quite arrogant.\n\nVerdict: Highly recommend the Beef Noodle Soup for lunch, but proceed with caution (or better yet, avoid) the dinner menu."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adGFVZE9MWE42UjNoNWJHVm5iR05HVFUxMk4xRRAB",
            "text": "I came with doubts but left understanding all the positive reviews. Likewise, the staff shows consistent kindness. Good cooking, affordable menu and staff that knows how to treat customers. The prices at Wenwen are fair and they serve plenty of veggies. This place merits a visit."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcmVEbFdRM1F6ZVVVMWFEWnBPR0UwUjJ0S1RtYxAB",
            "text": "As a Cantonese speaker, I was very excited to hear old Cantonese music playing and see the poster of one of HK’s comedy legends. Not sure if that’s authentically Taiwanese but doesn’t bother me.\n\nThe food was very good and would love to go back and try other dishes. Service was fast but would not say anyone is rushing you so you can still move at your desired pace."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMVJtOUJiSFpLWmtvdGJIcHJkazlMU1hSd1NFRRAB",
            "text": "The place is super cool, I had pork over rice, the stew was greatly cooked with a lot of flavours, the egg was at perfection, yet I felt the rice was not enough to suck all the juices of the stew.\n4.4"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMk4yTTJUR0ZFY2xSRWREYzFNMDVqUlhwbmNVRRAB",
            "text": "The flavors work perfectly. This establishment feels comfortable. The workers are pleasant and truly accommodating. The meals here exceed expectations. I found a quality establishment and plan to return often."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205a1ozRm9UbUZuTUZsVk9WUTRkWFJZYlROa1VrRRAB",
            "text": "Best Taiwanese restaurant in New York, Best fried rice and best beef noodle soup and best lo ba beng and best salads...can't name them all but literally everything is super tasty and well made. Love that its just around our neighborhood so we get a taste like home."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OV2MxVm9lWEZOV1ZWdlVqWlJhbUZpTWxnelNHYxAB",
            "text": "It’s clear that the beef noodle soup broth was not cooked with bones, as broth should be; there is a flatness and watered-down flavor to the broth.\n\nThe beef shank is cooked perfectly, very likely with a sous vide, hence the perfect cooking in the texture."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNFUyTlJhM05NZVUwdGNHOWtYMlZDWXpBeFlsRRAB",
            "text": "Portions here are huge so be careful not to over order. Loved the lettuce cups and the popcorn chicken. Beef fat oil noodles were decent but a bit difficult to navigate. Drinks are pretty good here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twR2RYSmlTa0U1VFdSdWJEaFpZVkJVZVhrMldFRRAB",
            "text": "My girlfriend and I have been putting off eating at this place for a while until we had something to celebrate. We get there an we were not impressed with the food, and were even less satisfied with our service. The entire time we were there, I felt like we were being rushed out of the restaurant. Within the first 5 minutes of ordering, we got our appetizer. Not even 5 minutes later, our 2 entrees were also out on the table and made our table very cramped—I didn’t even finish one piece of the appetizer yet. Once we finished our dessert, we were given our checks without even asking for it. It felt very unwelcoming.\n\nThe food was okay, but the quality was brought down from the lack of enjoyable service. I mentioned earlier that the food came out all at once. This ultimately made our other entrees cold by the time we finished our appetizer. The fat from the cuttlefish and pork belly fish dish had coagulated, and I found it weird that it wasn’t served with a side of rice. I found myself reaching for my drink because of how heavy and thick the dish was after eating it.\n\nMaybe we went on an off day, but I don’t know if this experience justifies another visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRVdVdGpSVk5ZU0dkTlpEVmxlVGhsZUhaWVZIYxAB",
            "text": "Ordered it from Ubereats, I thought the standard beef noodle soup has eggs in it according the picture they put on the app, but it comes without any eggs.. soup base is half way satisfying and there is no option to order without cilantro. Disappointed, will not order again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cmNFeGtiMFZmTnpOVFNFVnZXbWRNVlZGU0xXYxAB",
            "text": "I don't know who Lily Flemming is, but dang are they owed praise for pioneering this fried rice at Wenwen. Try it with a pork jowl or a dozen shrimp. The consistent size of all the mix-ins, and absolutely blended flavor blew me away. “Taiwan dust\" on more things in life, please!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRVoyNVZhVnBNUlVkZlFsZzVjbGhuTTFScllWRRAB",
            "text": "This Taiwanese restaurant has a great vibe with fast service. The food, though a bit salty, is packed with flavor and the portion sizes are decent (wish the apps were bigger)\n\nWe went for a weekday lunch, so the menu was limited. While we enjoyed most of what we ordered, the pork chop rice was a miss, and we wished the noodles in the Taiwanese noodle were a bit firmer.\n\nNo outdoor seating."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMWJWUnBUeTF3YVV3MFJ6bFdiVVZDY1dOYU5XYxAB",
            "text": "Delicious and sometimes spicy, fast service, great for sharing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwS2QxODRUMjVVWVRsaGJWQnZWVW8yVDJvMFUxRRAB",
            "text": "As a white boy who loves to eat well I loved it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twYVQwdzRVemRaZG1FMGEySnRaSEJ0UlUxVmJWRRAB",
            "text": "Splendid. Delicious food, complex flavours"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MU9FeGFiVUUxWDJJMFMybDRSR2RsZEROa2NHYxAB",
            "text": "Cute little spot for chill vibes and good food. We got the fried tofu, I would recommend that. I liked that the most! I wouldn't get the chicken. I thought it was a bit dry. They only sell a few throughout the day, but you dont have to try it so don't worry about it if they sell out. Looked pretty, but only the dark meat part of it was good to me. Half the chicken was a little too overcooked. The fried rice was good 👍  a little salty for my taste, but helped with the dry chicken. The noodles were good. Definitely get the fried tangyuen, it was unique and i actually enjoyed the pairing of the chives with the ice cream and sesame with a bite of friends tangyuen. Yum!! Overall and good meal. Didn't have a picture of the noodles because it was pretty good and forgot to take a photo"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSFFuaERhWFJLV0ZkVmJXUkdSMTh5VTB4NFNsRRAB",
            "text": "Amazing food and great service. we had the shrimp floss  lettuce wraps, the pea shoot and tofu skin, and the beef chili noodle dish\n\nMy wife forgot she is a bit allergic to shrimp and that same night she threw up all of it, doesn’t matter, we will be back and order it again\n\n10/10 fully recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4c2NqTTFVV1F5TW05MVMySkNkRkJaV0UxeVFtYxAB",
            "text": "The menu is very clearly marked for most allergies, except for gluten for some reason? The staff was really kind and helped me identify the two things in the menu that they said were gluten free.\n\nI got the fried rice with pork, which they told me would be gluten free, and mid-meal I had to run to the bathroom. So, if you're gluten free, this might not be the place for you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdVNXVTNRalU0YVdVMVZqUm1OSEpPUVU5TE4xRRAB",
            "text": "Greenpoint gem! I loved every dish in this restaurant, especially the popcorn chicken. Fried rice is good, but I wouldn't get it again; it’s too simple for us. I would recommend the chilly noodles and steak."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSWN6VkhNVE5IVG5wcVUwTnVaMHRVU0ZsdkxVRRAB",
            "text": "Great food absolutely delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMlJVZHNTa2hZYzFoaFpHZG5kV1ZaVEd4T1EzYxAB",
            "text": "The chicken was truly enjoyable, and I appreciate the effort put into the preparation. Perhaps a touch more salt for myself would have been perfect. I found the dish to be satisfying overall, with a delightful texture. The culinary experience presented was certainly a positive one. Furthermore, I would really enjoy just a cuttlefish dish. It would be a welcome addition to the menu. I am looking forward to future dining experiences."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MVZsVkpZMkpHWDFaVU1XTXljMnh6YmkxcVdHYxAB",
            "text": "Really unique and solid food. The cuttlefish was something I've never had before it was so delicious and well cooked. In all honesty we came for the BDSM fried chicken and it was just alright. I wish they brined it longer and it had more salt but it was well friend nevertheless. The beef oil noodle was the highlight of the menu by far. Incredibly flavorful and well cooked. I'd come back just for that"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaWJIZHpUbVoxTFdsckxXNVNjRFF0WmkxSldrRRAB",
            "text": "the beef noodle was delicious! 😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQmJYZGxNRmgxYWw5VVdrNUZhalEzTTJreE9FRRAB",
            "text": "The lady who served us was very rude, no greeting when we sat down, no thank you after paid the bill.\n\nFood overall is Taiwanese fusion, not authentic Taiwanese food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvelQxbFNjemszY2t0VlV6bGhMVlpPUVVOU1dFRRAB",
            "text": "About a year ago, I kept seeing this Taiwanese restaurant called WENWEN all over Instagram with amazing reviews. As a big foodie, l'd always wanted to try it but never found the chance — until last week when I finally made a lunch date with a friend.\nThe restaurant itself is quite nice. The décor, ambiance, and lighting are all on point, and the place feels clean. I especially liked their bathroom\n- they were playing classic Taiwanese pop songs from the 80s and 90s, which was a cool nostalgic touch.\nBut... their service was really disappointing. The server had this cold, unfriendly attitude and barely paid attention to us. Maybe it was because he was the only one working during lunch?\nAs for the food, their lunch menu is very simple with just a few options.\nWe ordered:\n• Numbing Celtuce Salad\n• Braised Beef Noodle Soup\n• Lo Ba Beng(Pork belly Rice)\n• Sesame Cold Noodles\n\nThe Numbing Celtuce Salad was crisp, a little numbing, and tangy — I actually liked it, but my friend hated the texture and flavor.\nThe Lu Rou Fan was super average. The lean pork was dry, and the sauce was whatever - not very flavorful or appetizing.\nThe Sesame Cold Noodles... OMG, honestly terrible. The sesame sauce tasted like nothing — just a thick paste dumped over plain noodles with a few strips of cucumber and egg. I strongly don't recommend ordering this. One of the worst l've had.\nI didn't try the Beef Noodle Soup, but my friend said it was just okay. And then he said:\n\"Overrated.\""
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNmRrcGZhbmxUWmxsS1RGWnBPRlJYT0dWU1prRRAB",
            "text": "Fantastic Taiwanese food!  Great vibe, fun and interesting drink menu. Beef noodle soup is killer, so is the popcorn chicken and sesame noodles. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSVlWTnlkR1JTVjJjNFQzUTJhVGRQVWpKZlFWRRAB",
            "text": "Truly one of the best meals I’ve had in the city. We ordered two plates of popcorn chicken and two plates of beef noodles because yes, they were THAT good. Unbelievable flavors, will definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJU2N2Tmk4bHJxZ1FnEAE",
            "text": "We were craving Taiwanese and based on reviews, we decided to go to Wenwen. Tried to make a reservation but there wasn’t any availability so just walked in and we were seated right away given an option to be in the main dining area or the smaller and quieter one on the lower level. Turned out that the “quieter” one wasn’t quiet at all because the space was super tiny. We ordered and food literally came in 2 minutes which made us questions how and when it was actually prepared. Tried the Dong Bei Salad (\nWood Ear Mushroom, Tofu Skin, Napa Cabbage, Carrot, Cucumber, Cilantro, Peanut Chili Oil, Garlic), Peashoots w/ Tofu Skin and the Pork Belly & Cuttlefish for main. Food was good but nothing special. Our waitress was super friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbjk2LVh5eXEycTlRRRAB",
            "text": "Everything was so freaking good!\nPopcorn chicken was flavorful!\nThe beef chili noodles were so satisfying!\nThe dessert was immaculate and truly unique with its sweet and savory mochi black sesame ice cream."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLM1N6TDZWNmFHSktnEAE",
            "text": "Really really nice"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZUU4Y21RMXJMQ1dnEAE",
            "text": "Nice baking"
        },
        {
            "date": "5달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPck5yNTc1aGRTVFRBEAE",
            "text": "치킨 존맛탱….."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMLVlzNUh3NE4yRXBBRRAB",
            "text": "Finally made it here with a good buddy of mine tonight. Food was pretty solid, nothing proper mind blowing but still well thought out and tasty. Will return at least 1 or 2. More times to get to know the menu even better. Birds of a feather still rules my heart but these guys are a close 2nd"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJMk9nZUxjaU42d3ZRRRAB",
            "text": "As a restaurant, I don’t have major issues with it—but as a place marketed as Taiwanese cuisine, it left me a bit confused.\nThe Numbing Celtuce Salad was tasty, though I don’t recall ever seeing this dish in traditional Taiwanese cuisine. I was especially looking forward to the Shrimp Floss Lettuce Cup, but it lacked that signature stir-fry \"wok hei\" flavor that gives a dish real depth.\nThe Lo Ba Beng came with too much sauce, which soaked into the rice and threw off the texture. The FenZhen Pork was ok too. On the bright side, the Fried Tangyuan with Ice Cream was enjoyable. I’ve often wondered how that concept came about—it seems inspired by the classic Peanut Roll Ice Cream, but I’m not sure why they felt the need to change something that was already great in its original form.\nOverall, the food isn't bad. But to me, it feels more like a fusion restaurant than a truly authentic Taiwanese one. And because it doesn’t quite connect with the flavors I remember, I left feeling a bit disappointed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPN3dfWTNzMjlYSnNBRRAB",
            "text": "Great vibes and service.\nQuality dishes with attention to details were appreciated.\nAlthough not perfect by any measure.\nAnd I don’t believe that’s what they were going for.\nBDSM chicken was excellent, beef in the chili oil noodle was a little well done to my personal taste.\nBut overall a very pleasant and delicious dinner!\nHats off to the staff and ownership sharing true Taiwanese flavors to the neighborhood.\nWill be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJLWtzdnFpekt2c2NnEAE",
            "text": "Absolutely incredible. I just got the popcorn chicken the sesame noodles and the ice cream dessert. I really can’t wait to come back, it was all so awesome glad I finally gave it a try!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeF9XNUxnEAE",
            "text": "This place is so cute! I love their decor/atmosphere. Their dishes are sooo good. The authenticity of the dishes is on point. Some with a twist! Love it! The staff were extremely attentive. Our water glass was always filled. I love their professionalism and knowledgable of each dishes. The music brought me back to my childhood times ^_^  I would definitely recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNT3c0LUhjM3JiMkFREAE",
            "text": "Decent food...higher prices...nothing spectacular here"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcjczN1ByNXBESXhRRRAB",
            "text": "Good food and friendly staff. You can't go wrong with the popcorn chicken and the sesame noodles. The highlight for me was the San Bei GG cocktail though. So good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHYyUWpnRRAB",
            "text": "Went for Brunch, which had a different menu from dinner but still had a great time and everyone really enjoyed the food. We ordered the Tater Tot Dan Bing, Stuffed Shrimp Toast, BDSM Chicken Sandwich, Lo Ba Beng and Lil Flemming Fried Rice + Hertitage Pork Jowl. I don't think you could go wrong with anything on the menu but I recommend trying the Tater Tot Dan Bing, as it was very creative and flavorful."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cmE3Znd3RRAB",
            "text": "모든 메뉴 다 맛있게 먹었음!\n오픈시간부터 자리가 꽉찰 정도로 인기 많은 곳😊\n오전엔 브런치 메뉴만 가능한데 다음엔 저녁 메뉴 먹으러 가봐야겠다~"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MTlYYTlRRRAB",
            "text": "Food 9/10\nSolid Taiwanese food. 卤肉饭 was so gas and the portions were quite large too. The shrimp toast was also very unique, I liked the consistency of the shrimp inside paired with the crispy crunch of the exterior. The popcorn chicken was also quite a delight, with the right amount of seasoning that makes you want to keep on eating more.\n\nAtmosphere 9/10\nPlenty of natural lighting in the restaurant, with a good number of seats. I thought the menu was super cute too.\n\nService 9/10\nFriendly!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMWFhc0dnEAE",
            "text": "I didn’t know what to expect, but I gotta say this place is pretty good. The floss shrimp lettuce wrap is very authentic and tastes very good. The popcorn chicken and fried tofu were great as well. We also had the cold sesame noodles. The bathroom was lit, playing all the hit Chinese songs. Overall a great experience! Would come back to try more items !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMemMzTkNREAE",
            "text": "Came here with a reservation and a group of 5 friends! We were seated quickly.\n\nGood:\n- The food was all really good - the popcorn chicken was solid and I liked the flavor of the fried rice as well.\n- Chili noodles were tasty but not very spicy so it’s more a mild kick, great chewy texture\n- Food all came out really quickly\n\nBad:\n- A little cold inside, round tables were hard to make conversation at\n- We were charged incorrectly (actually were charged only for 40% of our meal) and we decided to go back to the restaurant and tell them about the mistake. Instead of thanking us or acknowledging it, they took 10 minutes to charge us the full price with no apologies or gratitude for waiting or coming back, which made us feel bad for doing the right thing, and now don’t feel great about customer support here. Just left a bad taste in the mouth\n\nOverall, the food was decent but felt bad about doing the right thing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqek52ZHB3RRAB",
            "text": "This is the full package when you’re missing home.\n\nAtmosphere in the back room is where you want to be if you want Taiwan vibes. In the front you got cute plants and warmth!\n\nThe service was wonderful, great suggestions and checked in kindly.\n\nFood was BOMB. We ordered a lot but probably could have done without the fries. Those felt the heaviest and I didn’t get as much out of them as I was expecting.\n\nThe tots rolled with egg pancake was a new move. I appreciated it because the tots were super crunchy so it provided a nice texture!\n\nEverything we got was great. And we ate it all!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINGZuZVpnEAE",
            "text": "Nice little spot for elevated Taiwanese dishes. While nothing was particularly amazing, all the dishes were very solid and well executed. Among the dishes we had, the fried tofu and popcorn chicken were the best. And it was among one of the most cohesive menus I’ve had recently, all the flavors in each of the dishes in sync with one another. That said, it is a relatively small menu and one I felt was geared more for larger groups with a lot of big sharing plates than for a couple. So not necessarily a place I could see myself returning to regularly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCek15WmhBRRAB",
            "text": "Incredible food and great service. The waiter we had was very nice and friendly. For bites we got the popcorn chicken and that was made very well. The crispness of the chicken was great and the sweet sauce it had went well. We also got the cold noodles, chicken sandwich, egg tater tots, pea shoots, and pork rice dish. All of them were super flavorful and great! We also had the sweet toast for dessert and that was very good. The toast was crispy on the outside while warm and soft on the inside. The flavors were amazing. Definitely come here for some good food!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnakkydUNBEAE",
            "text": "Hipster style Taiwanese restaurant. The savory soy milk tasted just like what I had in Taiwan (except 11-12 times more expensive). Brunch menu was a bit limiting for vegans or vegetarians but I did also enjoy the crispy tofu and the fly's head with lettuce cup made with soy beans. Food was on the salty side though."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUXzdLYnlnRRAB",
            "text": "A delicious (and well-executed) modern spin on familiar Taiwanese foods~\n\nMy party of 3 made a brunch reservation a little over a week out (after a couple previous last -second attempts to reserve)\n\nWe all really enjoyed the chicken sandwich, and hot honey popcorn chicken and the lo ba beng was so rich after being mixed together that I’m still thinking of the flavors a few days later. The sesame noodles were great, but did feel a little plainer compared to the rest of the dishes (which honestly wasn’t a bad thing, it was like a flavor reset?) I was also a bit surprised by the cream cheese inside of the shaved ice but really enjoyed that as a dessert!\n\nThe service was quick and the staff were very friendly! The wooden, brick wall, and plants in the interior of the restaurant was warm, and even the bathroom was an added experience as I can imagine the flashing lights, music, and listerine would all be appreciated during a night out.\n\nI’d love to come back again for dinner to get a whole BDSM Fried Chicken this time the next time I’m in NY 😋"
        },
        {
            "date": "8달 전",
            "language": "zh-Hant",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRZ2VYdWZ3EAE",
            "text": "食物普通、CP值不高\nFood was only satisfactory/mid for the price\n鹹酥雞有點太甜，而且每道菜都有紹興酒味\nThe honey in the popcorn chicken was too overpowering\n紹興酒雖是台灣特色但也不是每道菜都對味\n像松阪豬炒飯&牛肉乾拌麵都有紹興味很奇怪\nThey added Shaoxing wine (famous Taiwanese wine) in a lot of the dishes that Taiwanese people typically don’t. Seemed like it was to cater to the non-Taiwanese audience rather than making original/authentic Taiwanese food\n鱸魚沒有骨頭 而且有一半是魚漿了以後再塑型回去變成像魚肉 口感不是很好\nThe fish paste on the sea bass tasted odd, if you’re Asian and used to eating whole fishes this dish might not be for you\n豆苗炒豆皮好吃\nThe tofu skin stir fried pea shoots was good\n炸湯圓跟冰淇淋的甜點也很好吃\nThe dessert was the best part of the meal"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eGFLU3J3RRAB",
            "text": "Apr 2025\nI came back a second time because I thought the food and how chic of this place will impress my visiting friend. Menu is smaller than years ago. Most food we ordered this time were oily and salty.\n- Fried Tofu: it was ok 7/10\n- Peashoots with tofu skin: this one is ok too 7/10\n- Shrimp Floss Lettuce: too salty and no one in my group liked it 3/10\n- You Fan: Some of rice were not cooked and too salty 6/10\n- Huadiao Egg Tofu: too oily and salty 4/10\n- Dong Bei Salad: too oily 4/10\n\nService was just fine; our server didn't know about their food that much and didn't suggest the better choice plus the menu is less than before so we have less choice to pick the food we might like.\n\nJun 2023,\nMy friend supposed to see me near subway station, but she walked to the wrong way and found this interesting restaurant. Greenpoint become more popular and trendier, place with verity of food is all over.\n\nWhen I stepped in, the restaurant was busy but my frined was already inside at the basement seating area. Service was good and friendly. Food is wonderful. We in love with ground pork with chives. Fish is not that fresh. Drinks are fantastic and creative.\n\nBy the way, music in restroom is lovely and funny.\n\nIf you want to eat Taiwanese food I recommended this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdFB2MjZRRRAB",
            "text": "Came here for a birthday dinner and absolutely loved it! Because we had a large group we did the pre-fixe menu and it comes with a tonnnn of food, all amazing! I wish I had taken more pictures but standouts include the cold sesame noodles, popcorn chicken, and lettuce wraps among others. The service was excellent and their drink selection is quite good! I wish I had tried some of the cocktails but I was also perfectly content with my glasses of orange wine. I would love to come back again and try out other items on the menu!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bEk3blhnEAE",
            "text": "We got to share the popcorn chicken, the crispy fried tofu, the tater tot dan bing, and the lo ba bang.\n\nI REALLY enjoyed the popcorn chicken. The powdery crispy part on the outside and the chewiness on the inside are perfect; the sauce goes well with it too. The fried tofu was alright, not a big fan of the sauce so I like it by itself more. The tater tot dan bing gets filling fast but I like it. Quite a big portion. The lo ba bang is also good. The rice dish has a lot of flavor profiles in it. It’s a big stronger with the mustard taste. Definitely filling.\n\nReally nice decorations and spatial area. The staff are really friendly, too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKZ2N5Y0hnEAE",
            "text": "While I applaud the chefs effort to elevate these traditional Taiwanese dishes, they deviate too much from the original taste that I am looking / longing for.\n\nThe popcorn chicken, I found it too sweet and not spicy enough. And the pork in Lo Ba Beng was cooked really well, where fat just melts when you mix them together; the taste is a bit bland lack of punch.\n\nMaybe my expectation was too high coming to this restaurant .. it’s a bit of a let down, they are not bad .. but it’s just not what I am expecting.\n\nService and ambiance were great. I like the decor and the open tall ceiling and also the bar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCak0tZ1JREAE",
            "text": "We liked everything we ordered.  All the flavor of each dish was exceptional; they took traditional Taiwanese dishes and flipped it.  The service here was also top notch.  We got here a bit early before our reservation, and they were quick to rearrange in finding us seats. Our friendly server came frequently filling our water glasses, and attended to our needs. Now we are eager to try their first establishment - 886!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURweHRPRDhRRRAB",
            "text": "TLDR: The food was outstanding, nothing can be said that they could do better at. Everything was incredible from start to finish.\n\nI didn't know any details about this place until my partner decided to reserve a table (2 weeks in advanced) for my birthday dinner. It was just the two of us, I was a bit afraid that the place would be packed due to the 2 week reservation, but I was surprised. The atmosphere and vibes were comforting, despite the tables being so close together, it didn't feel like we were barging in or being a bother to those next to us. We all were there for the same reasons, so it created an great comfort feeling.\n\nDisclaimer: I've only had authentic Japanese/Korean/Thai food. Taiwanese food was a first for me, I only want to add this Disclaimer for perspective purposes only. This was my first (and not last) time eating Taiwanese food.\n\nMy partner wanted the BDSM chicken, which unfortunately was sold out. We had to impromptu and decided to share the seaweed fries, Lo Ba Beng, and 3-Cup chicken. Best. Choice. Ever. This rice bowl opened my taste buds to spices I never thought I would taste. The rice, pork, and adding the chicken that was so tender...mind altering. It had me realize that there was much more to explore food wise.\n\nA place that us worth the one hour drive and definitely worth the price as well! We ended up paying a total of 110$ for appetizer, 2 mains, one desert, one old fashion and one shy boy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyekliUy13RRAB",
            "text": "Made a reservation for 5 to make sure to get an order of their whole BDSM fried chicken. Honest opinion, it was good. it was tender and juicy. The seasoning on the chicken was unique and the vegetables that came with it in the middle was good. Would I ever go back for it? No. Personally, I enjoyed their water spinach & shrimp paste more and their fried tangyuan w/ ice cream was AMAZING! The spinach has a strong shrimp flavor, which I enjoyed and the broth that it comes with is very flavorful. The nuts and the cilantro in the dessert elevated the flavor and texture of the dish and the black sesame paste around it added a lovely earthly flavor.\nHowever, I ordered a bowl of rice on the side, but it basically  came when we were finished with the meal, so that was a disappointment. But the waitress was very bubbly and nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dV9HMmNBEAE",
            "text": "I was so excited to try this spot and man it did not disappoint! Our server angel was full of knowledge about Taiwanese food and super warm.\n\nMy friend and I shared the sesame noodles, the popcorn chicken, the shrimp lettuce wraps and the celtuce salad.\n\nEverything was so delicious and full of balanced flavor. Personally the celtuce salad and the pop corn chicken were my favorites.\n\nCan’t wait to come back and highly recommend this restaurant.\n\nBonus: I danced in the bathroom and the design of this restaurant had so much thought put into it. I’m ready for Taiwan!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKb08zMm13RRAB",
            "text": "Wenwen has been on my to go list since it opened and I heard many great reviews! I understand that Wenwen is a Taiwanese restaurant that aims to bring flavors of a Taiwanese household into Greenpoint, and I was very disappointed.\n\nI walked in around 1 PM on a Sunday with no reservations but that’s no issue. Despite the restaurant being packed, we were seated right away. Mind you the restaurant is small and seatings are very close to one another. As soon as I sat down, there was a bowl with a spec of rice inside my bowl but it was resolved immediately.\n\nWhat we ordered:\n\nGourdgeous Mocktail (2/5) $10\nIt was described to have was Oolong Tea, Winter Melon Gourd and Lemon. When it came, it was definitely aesthetically pleasing as it had a long block of ice with a dried lemon on top of it. Initially you get a hint of winter melon but then you have lemon juice aftertaste. The mocktail isn’t the worst thing I have had but not exactly the taste you expect to get.\n\nSacha Hot Honey Popcorn Chicken (3/5) $13\nI had super high expectations for the popcorn chicken! They came in huge chunks of chicken to my surprise with the sauce drizzled over them. The sauce was both sweet and salt and I wish I had more because it was delicious! The chicken was crispy and easy to bite into but the insides were a bit dry.\n\nStuffed Shrimp Toast (2/5) $15\nThe dish came in with 4 toast and in the description it does mention it also contains cuttlefish. On the side, you will have a dipping sauce of sriracha (unsure if they mixed it with something else) but the sauce was good. Texture wise, the exterior wasn’t as crispy as I would like and the inside wasn’t chewy/bouncy. I tasted more of the cuttlefish but missing the shrimp taste.\n\nBDSM Chicken Sandwich with Seaweed Fries (3/5) $22\nThis dish was almost on every table when I came in and I was intrigued to see what the hype was about! Biting into the sandwich, you do get the crispy texture of the chicken with a hint of dryness but the pickled lettuce did help bring some moisture into it. Though it wasn’t the best chicken sandwich I had but it’s worth a try! The seaweed fries is basically what the name sound like: bunch of fries with seaweed furikake sprinkled over it\n\nCold Sesame Noodle (1/5) $15\nI’m not sure what happened to the dish but this is definitely not what a sesame noodle dish taste like. First thing I noticed when I put the noodle in my mouth was the texture: it wasn’t al dente nor was it bouncy. It was kinda hard? There was no sesame or sweet taste to the dish, I did notice a lot of pepper in my dish, not sure if that affected the taste a lot.\n\nOverall, not sure why everyone was hyping this place up. Besides the nice service and atmosphere, the tables were very close to one another and the foods weren’t great. For the price they’re charging, I expected the dishes to phenomenal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxa01haVR3EAE",
            "text": "There are some moments of triumph and, unfortunately, more moments that fall short of expectations. My recent visit to Wenwen in Brooklyn was a mixed bag of flavors amidst an otherwise mediocre ensemble of dishes. The low hum of conversation contributed to an ambiance that felt relaxed and welcoming. The restaurant maintains its understated charm, allowing the focus to shift to the array of dishes rather than the surroundings.\n\nLet's start with the standout: the hot honey popcorn chicken dish soared high above the rest. The crispy exterior, bathed in hot honey, provided a delightful contrast to the juicy chicken within. It was a taste that lingered on my taste buds and it was a tantalizing tease of what could be. On the flip side, the beef noodle soup lacked the depth and richness that characterizes a memorable bowl. The broth's flavor missed the mark, and the beef slices fell short of elevating the dish to its anticipated height. The shrimp floss lettuce wraps and fried rice, while not outright disappointing, failed to leave a lasting impression as well. Both dishes failed to rise above the mundane, lacking the nuance, boldness and freshness that I fully expected and clearly was needed. It was the dessert that managed to salvage the meal to a certain degree. The fried tangyuan with ice cream hinted at the kitchen's ability to shine, even if fleetingly, with a perfect union of crispy and creamy, sweet and savory. The rice-shaped balls, filled with luscious black sesame, provided a delightful contrast to the cool, creamy taste of the ice cream, making it the standout moment by far.\n\nWhile the service was satisfactory, it lacked the finesse we had experienced elsewhere at similar establishments. The staff seemed a tad disorganized, leading to occasional delays in service. This is a place where selective choices can lead to a satisfying experience, so if you find yourself here make a beeline for the popcorn chicken and dessert. Simple and sweet."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4emVQMnZRRRAB",
            "text": "Came at 5 to try the famous chicken, line already lined up outside. Snagged one right away and ordered more dishes. Chicken came out fast feet and all and was delicious worth the hype. Got some great tofu, veggies, chicken and fried rice. The tang yuan finished off the meal on a sweet note. Great experience, must try."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOWJyNkJ3EAE",
            "text": "The fried chicken was very fatty. The beef broth was dope, clean, tasty - not fond of the menus having porn on it though ?? Brooklyn…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmaHZxaDVRRRAB",
            "text": "The best homestyle Taiwanese food I’ve found in the neighborhood so far! The beef noodle soup and fried rice took me back to the comforting flavors of backstreet eateries from my college days."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeXB1cXNRRRAB",
            "text": "I just came here yesterday and I had really high hopes for this place. I personally wish I could give a higher rating, but the reason why I’m knocking down my rating to 3 stars is due to a lack of consistency in the quality of the dishes and the overall ambience and customer service of the place. The best dishes we had were the dessert (the tang yuan is definitely inventive and well executed and worth ordering) and the crispy tofu appetizer. I love fried tofu when it is done well. They did a great job of getting silken tofu crispy on the outside and creamy on the inside. The dipping sauce was a bit strong but still good. We also ordered the Lo Ba Beng, which was good -it definitely was a generous portion size and had good balance of flavors. It was a comforting homestyle dish. The popcorn chicken was well done in terms of the seasoning of the chicken, but personally it was too heavy on the honey and I don’t crave a sweetness like that when I order Taiwanese popcorn chicken. I was expecting a drizzle of honey, not for it to be doused in honey. The biggest disappointment for me was the cold sesame noodles. This should be a really basic dish to get right. The flavor of the sesame sauce was really off - too salty but also bland on sesame flavor and did not have the complexity of spice or garlic that I would really expect from a sesame noodle dish. Frankly, I make this dish at home better than they did. The restaurant was loud and the host up front was distracted. It took the host a while from when we walked in to take our number to be put on the waitlist for the bar and the host attended to a number of parties that arrived after us first. Perhaps we did not come on a good night or ordered the wrong things, but I do think the lack of consistency is something that would give me pause on coming back here."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuamFyVFBREAE",
            "text": "Amazing food, all the dishes were delicious. However, everything was served way to quick, almost immediately.\n\nWe were a reservation of two and everything was served within 5-15 min of ordering.. our 2 apps and a gigantic entree of beef chili noodles. It was unpleasant to have to rush as the food was getting cold.\n\nA great place to come with a group since theres so much of the menu to try.\n\nLeave space for dessert!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eU82cGlRRRAB",
            "text": "The quality of the food was satisfactory, however, the restaurant was excessively noisy. I would not recommend this establishment for a first date, as the tables are situated very close together, resulting in limited privacy. Conversations from neighboring tables can be easily overheard. While the location is undoubtedly advantageous, the prices of the food items were somewhat excessive. Some of the dishes were served at a less than ideal temperature. Upon being seated, there was a noticeable delay before we were provided with water or acknowledged by the serving staff. The restroom facilities were reminiscent of a nightclub. I recommend visiting the restroom if you happen to be at this establishment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuazZhNXR3RRAB",
            "text": "FAVORITE TAIWANESE SPOT IN NYC!!! The food is LIT drinks are LIT (and STRONG) atmosphere and servers all 💯💯💯 The perfect night out spot with friends :) Some of our favorite dishes are you fan, fried rice,\nbeef chili oil noodle, and don’t sleep on the dessert Tangyuan 🤯❤️"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodXRPMFB3EAE",
            "text": "So good, and you should go, which is mostly all you need to know. But if you insist on me getting into the mundane details, then buckle up. We came here for lunch and got the Lo Ba Beng (pork belly rice, 滷肉飯), the Lily Flemming Fried Rice, and the Taiwanese toast.\n\nThe Lo Ba Beng and the Fried rice were so flippin' good. I could not believe how well they got the flavors and textures - it's like they improved on the traditional dishes with a splash of just enough of something extra to make the flavors even more complete.\n\nThe toast was also very good, the flavors were so unique and fairly well balanced. The syrup was amazing and didn't taste like anything we had really tasted before (almost like a ginger syrup?). Even with that being said, this was our third favorite dish.\n\nDefinitely going again."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadnRDZ1J3EAE",
            "text": "Update 2/2025: got takeout from here and (while many things were delicious,) found what looked like a wire thread from steel wool in my pea shoots!!! Dangerous and disturbing. Unacceptable\n\n——\n\nHad looked forward to this place and overall was pretty good in flavored but everything we got was wayyyy too salty, especially the fried dougan with veggies. The beef noodle soup was delicious with large cuts of beef and amazing broth, but again was too salty after eating it for a while."
        }
    ],
    "reviews_count": 75
}