{
    "name": "Pierozek",
    "place_id": "ChIJl-l0rSdZwokReqiZ7S2yx0A",
    "grid": "BK1",
    "address": "592 Manhattan Ave, Brooklyn, NY 11222, USA",
    "rating": 4.8,
    "user_ratings_total": 1031,
    "phone_number": "(718) 576-3866",
    "reviews": [
        {
            "date": "1일 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVVkwdzBaVzFEWmxsVmFETkVNWGgzYmkxT1pVRRAB",
            "text": "Rewelacja 🙌🏻\nPierogi 🥟 jak u babci! Zdecydowanie polecam!\nPyszne i estetycznie podane.…"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CS2EwRnRZVVl3Y3paMlRtWmhiSGsxU0VsRU1HYxAB",
            "text": "Decent Polish food. Borscht was a bit disappointing."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsc2RWaDBaQzAzVVRJMmNHczFVR3BQY1ZGMk0xRRAB",
            "text": "Both food and service here rise above the average restaurant. Their cooking was consistently satisfying, make no mistake. The employees show niceness too. The food quality never drops, always tastes fresh, and surprises for a casual, fast place. I feel complete satisfaction here."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNeFozQklOR2hVYjNGNGMwUXdMVGh5UVhWQ1NtYxAB",
            "text": "I make excuses to be in this neighborhood just to eat here. Employees are extremely respectful and friendly too. The environment they've created keeps me coming back. Tasty dishes that don't strain your budget. I value this place and plan to return."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Tk1sTXRTWGRpWHpWaU5ESnlaUzFUYnpkT1dYYxAB",
            "text": "A wonderful dining  experience.  The kielbasa and pierogies  were delicious!  The pierogies are made on premise and the kielbasa is made in NJ.\n\nThe restaurant is small and nicely decorated.    The staff is friendly and efficient.  This is a Michelin rated restaurant and certainly worthy of their rating.\n\nI highly recommend this  restaurant in “Little Poland” in Greenpoint"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWk1rZFJWa3BhUkZOVk9EZ3hNWFpuWTNWclNWRRAB",
            "text": "Quite good. Tasted authentic. People were nice. Great for a quick snakc"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obFlVODNXakIwWmxsV01uVkVkbU5TU2s5cVRWRRAB",
            "text": "I had such a great experience at Pierozek! The atmosphere is really pleasant, the food is delicious and my service was excellent!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMFNsVTNlSGMxY1RaNVF6ZHVNWEI1UzNrNVVVRRAB",
            "text": "Yummyyyyyyy yomyom tasted like someone's mom made it for me after a long day. Got the pierogi grill bowl so delicious"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NGRUSjFOWEUzVUdkZlNIUnpTalZ5YkZWMlJVRRAB",
            "text": "This was my first time having pierogis. This spot was so cute, clean, menu was comprehensive and not overwhelming. I was recommended to try the cheese & potato first; which were a generous 6! There was a side of sour cream and sour cream with dill. They were so delicious and filling I only got through half. I ended up ordering other pierogis to go (Bacon & jalapeño and pork), which were also delicious. The staff were friendly smiling and attentive. Menu reasonably priced. They have a cute back patio lots of seating indoor; clean, cute and id definitely come back!"
        },
        {
            "date": "2주 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMlpGZGxNVGh0UVdWcVZsbFZZV2RNUkZGQlVHYxAB",
            "text": "Boże.  Rozpływam się razem z tymi okropnie ... pysznymi pierogami w ustach. Proszę otwórzcie filię w NJ ❤️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sd1FWUkhSMFpIVDNVM1JHc3RZbTlOVjFaNFkzYxAB",
            "text": "The patio is super cute and the food was delicious! There was a minor mix up with the meal, but the staff was very attentive and extremely generous about it. Can’t wait to come back"
        },
        {
            "date": "1달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUlpHSjFjRzlXZERablpqWjBURTAyTVUxeFUwRRAB",
            "text": "Bardzo smaczne polskie pierogi, miła polska obsluga 😀 dobre piwo i drinki…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210aFp6ZHBTRWc0U1ZOWGVYTmZXbDh5VDBSNVozYxAB",
            "text": "Wonderful restaurant with great plating service Definitely authentic handmade Polish dishes. Started with czerwony barszcz uszka (Red Borscht Uszka) very tasty slightly on the sweeter side The pierogi Sauerkraut & Mushroom and Meat, were fresh and tasty Golabki / Stuffed Cabbage meat with rice mushroom sauce on the side they were good (not sure about the type of rice used) texturally just different Far better than other places where they are so dense.  By far the best Polish restaurant in town!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201eFZXbFNSRk5oTTA1d05Vb3pVV3BWVTJJdE9WRRAB",
            "text": "The dishes here balance all the elements that make eating worthwhile. Tasty options with sensible pricing throughout. They chose design elements that work perfectly together. The employees were prompt yet welcoming, so I'll likely bring my family here. I'm looking ahead to my next meal here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWE1XUkNTWGt6V0ZSd1EwOVFlbkozYmxGUmRGRRAB",
            "text": "As close to my babcia’s pierogi as possible. Recommend this to anyone interested in polish food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSGQyRmlMVE5ITUUxeWFYQllXRVJZWTBwbE1WRRAB",
            "text": "Cześć! I am polish and a foodie, so this might come off snobbish, but warranted since it is a Michelin star restaurant. We tried many things on the menu, and most were quite good. I have a couple recommendations on food, and couple items that could be better:\n\nRecommended:\nPierogi: sauerkraut, mushroom, jalapeño(unique), potato with cheese, sweet cheese, and blueberry (my favorite)\n\nCould be better:\nGołombki (cabbage rolls): the mushroom sauce was better than the tomato, however, the rice to meat ratio is way off and the rice is over cooked.\n\nKielbasa: not as special as I anticipated. Flavor was fine, but it was no striking.\n\nBarszcz (beet soup): missing flavor profiles for the broth, however, the dumplings were quite good.\n\nTopped it off with a waffle, which was good. The cream was fresh and not too sweet.\n\nWould I return? Absolutely."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWWVXWnVlVXBSY2xKdFNVNHRVMWxtY21KNVlsRRAB",
            "text": "❤️ the amazing TEAM , how the staff works as one unit . Truly unique and just top notch . Not to mention the food and it's quality 👌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4d1owNHdlRmhrTWtKcmRVY3RNVzVWVlhneU9XYxAB",
            "text": "So glad we found this spot. Definitely will be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNelNHRkphVVJzU3pGeVZqbHZSV3A1WTFSWVJGRRAB",
            "text": "Lovely food! Staff is always super helpful and lovely. Tons of tables. Cozy atmosphere. Great spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sa0xXaFBOMjlmTkdkTWMxUjZaRTVOYjFGM05YYxAB",
            "text": "This place never struggles for business. Staff service truly exceeded expectations! The menu demonstrates value consciousness. The kitchen turns fine ingredients into exceptional meals. Everything maintains standards."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUldERnFZMDB6TW5Cd0xXOXpiM1JETWxGeVkwRRAB",
            "text": "Part of me regrets telling friends about this special spot. The employees maintained high-quality service consistently. The food delivers, but the atmosphere truly shines. Their menu maintains consistency. This place merits a try."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4aWZ2dHNBRRAB",
            "text": "Best pierogi in NY"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVlZVVjNlRFJYU21sMmQyeFRTekZKTTFwWmRtYxAB",
            "text": "Very good authentic Polish food. This is a must. Came over from Queens just to get pierogi and stuffed cabbage, this place did not disappoint."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eVZYUm1kVUZHYzJWUExVVnJTMm90UjFsWlJuYxAB",
            "text": "Very nice place with excellent me u and the best pierogi variety I’ce ever seen. Being Polish that’s a big statement. I honestly recommend every dish. Backyard is noce bit mosquitoes are an issue."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cWNIQnhTREZRU0hWUlQwVllZakZRVXpsQ1UzYxAB",
            "text": "Great music, fantastic food, great service. 10/10."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV04wcEVkMUpsT1RRM1FtUk9aa1p4VW5wUldWRRAB",
            "text": "My first Polish restaurant and Pierozek did not disappoint! The savory vegetarian pierogi were all delicious, as was the mushroom and saurkraut croquette, and the cocktail menu had nice variety."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taV05UVnRUelpKTjNaYWN6QnRNMmhQVmtFMWQxRRAB",
            "text": "If these are the best pierogi in the city, does that mean they're in the running for world champion? I'm going to keep coming back to find out - so should you.\n\nWe tried the 'meat', which is essentially like pulled pork. Mouth watering & delicious. Also the Tatar, & the Murray's are very filling. We had what we call 'plain', aka potato and cheese. These are complimentary to the more, ahem, complex pierogi.\n\nI wish we had room to try everything - there are so many varieties.  Other tempting, beautiful main dishes kept coming out to neighboring tables.\n\nCheck the menu for daily and weekly specials. We came on the weekend and enjoyed a phenomenal lemon zest + sweet cheese pierogi as second course.\n\nFinally, there are enough spirits (flavored vodkas, żubrówka, & nalewka darienówka!) for any special toast. The wine selection is a bit limited - it would be lovely to see some Eastern European wines, perhaps Slovenian or Hungarian. Poland produces fine wines with interesting varietals but not a ton of it is available outside the EU. The domestic (Polish) beer selection is great for whomever skips the hard stuff.\n\nCan't wait to be back!"
        },
        {
            "date": "1달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KblUzRjVaMEppVFZkSVgwRlZaVkUyYVhOblJWRRAB",
            "text": "Drugie najlepsze pierogi, jakie jadłem (na miejscu nr 1 jest moja babcia - nie do przebicia i tylko dla wybranych)."
        },
        {
            "date": "1달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VlVrMWlZV2hJYlVnMFlXdGhNM0JGUjFVM05FRRAB",
            "text": "Będąc w NY odwiedziliśmy Pierożek, fajny klimacik, jedzonko super a obsługa bardzo, bardzo miła, polecamy z całego serca ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMk5sSnpRUzFYU0d4WmRYVnFTV0p4TTB4SWQyYxAB",
            "text": "Bed service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTVZGbFRUWGxHTjE5c2NrSm5TWFppY2padU1HYxAB",
            "text": "Pierozek is a Greenpoint gem! The pierogi are fresh, handmade, and full of flavor—potato & cheese are must-tries. Cozy atmosphere, friendly staff, and great prices"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSmFsVTBXRXhWT1d4alRsOXdYMlZQV0ZWQmMzYxAB",
            "text": "The Murray’s Cheese pierogis were fantastic and amazing! Kielbasa was delish as well!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWlVXWkNhbU00YTBSaFJXYzVjRzk0T0ZkRWNXYxAB",
            "text": "Don’t even doubt it. This is a great spot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMldteEVkRjk1WkhkR2JIZGFTa05TYUZFdFoyYxAB",
            "text": "Pierozek is 1 star Michelin restaurant!!!\nPierogi are delicious!😋\nRed borscht tasty!\nReasonably priced.\nThank you for the delightful experience!\nWill come back many times!\n⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTGJqVjVWa2RIVWxoUVFraGFVMUZNZUVOaVUzYxAB",
            "text": "Best Polish food in all of New York. I also had my wedding here :)"
        },
        {
            "date": "2달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTWVtdE5hbHBsUVRrdE5VWTVVMVV3TTJKWU4yYxAB",
            "text": "Najlepsze pierogi na zachodniej półkuli!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORlgwNUhRVkE0TkhZd1dXTmZOVGt4TkdFMk5GRRAB",
            "text": "Really good homemade polish food, the pierogies are really tasty."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS05sRXdUM0o2Wm5aYVNXcE5abmMxVVhSaVdVRRAB",
            "text": "I always go for the grill bowl (weekends only). It’s a phenomenal deal. The pierogis are always on point!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSWEyNVNSbnBYZEZSZlRIWnhRMlZ1TW0xVUxVRRAB",
            "text": "amazing polish food and super authentic"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4c2JXRlpSWGwyYmxWekxUQTFhWE5KUTBSVGIwRRAB",
            "text": "As most polish people I’m in love with pierogi and was missing a great ones in US.\nWe went at dinner time and we get table with no problem. The food is amazing we tried pierogi and red borscht with sauerkraut croquet it was to die for.\nCan’t wait to visit again! Thank you for great service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMmVtWTJSSEZFVDNKblIyUkZiRnBuV1hFelFVRRAB",
            "text": "Best pierogi I’ve ever had. The food here is so, so, SO good. The staff is also really warm and kind, and the whole evening was perfect. Will recommend to everyone! I already want to go back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxU2VHeFVkbHAxUTBzeFdYUlFhMjlGWTBsMGNFRRAB",
            "text": "It was a very clean and quiet facility."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRWVqRjFTVEZ2WlRFek15MWhkVlV5WlZBNVJVRRAB",
            "text": "I found myself continuously impressed throughout my meal. The kitchen excels with every dish they prepare. The staff handles everything properly without issues. You won't overpay for quality. All features of this restaurant appeal to me and I'll visit again often !"
        },
        {
            "date": "2달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKV1FtcGpTbWRLVGt4d1JVeE1XRGxVTTJNdFdHYxAB",
            "text": "Zarówno pierogi jak i deser były przepyszne. Gorąco polecam odwiedzić to miejsce 😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOZlRtVnpTRWxvUW0xbldYZERkMG81ZUcxbWFVRRAB",
            "text": "Good restaurant but probably a Bib Gourmand is slightly overstated. The sausage was over-fried and dry, but the pierogi was amazing, and also the Polish beer. If you like pierogi, try this place but I would say that Bib Gourmand rating compared to European standards, is farfetched."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSFpIcFBkM1J4YUZoUVR6SnNRV2RUUVV0aFZWRRAB",
            "text": "Amazing Polish food, traditional homemade and delicious, but..  ..the service needs to be improved - less staff talking and laughing only to each other, more smile and egagement in conversation with clients. Good luck"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRVkwOXVZVEZtUzJnNE0zWllVSEpsTVdkc1JYYxAB",
            "text": "I wandered in without expectations and left impressed. Both the dishes and the setting were enjoyable. The workers' attention to customers stands out! We cherish our memories of Pierozek! I trust the food at Pierozek!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFemVIWk9kV1owWW1WaU56bGZkVEppYlhjNE5IYxAB",
            "text": "food and service was fire"
        },
        {
            "date": "2달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRlQyNVhVM0l4ZEMxRFgzTmhTVmxHVG5GMWJGRRAB",
            "text": "Przytulny lokal z wyśmienitym jedzeniem. Właściciel pomocny."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0elZEQjNlR1ZuTmxWUmQxUnhhMEpQYmpWVVdFRRAB",
            "text": "I am not Polish but I have tried a few pierogis and none of them compare to Pierozek! I am a loyal Grubhub customer and will continue to be! The pierogis are so savory, the sweet cheese so buttery sweet and delectable."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNm95UldREAE",
            "text": "여기 최고입니다! 용리단길 느낌 낭낭한 분위기에 화장실 너무 깨끗하고 종업원도 정말 친절했어요. 혼자가서 음식 2개 시켰고 배가 많이 불렀지만 전체적으로 간이 슴슴해서 끝까지 맛있게 먹었어요.\n\n치즈버섯 피에로기와 양배추롤을 시켰고, 둘다 맛있었지만 피에로기가 계속 생각나네요. 시금치 피에로기를 먹기위해 다시 찾아가고 싶어요.\n\n아 그리고 여기 선곡이 미쳤습니다. 밴드곡 위주로 틀어줍니다."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUVdYZHNUbFZ6VW1KNVNDMWxkbmhaYm1wSU9IYxAB",
            "text": "I LOVE BEING POLISH!!!\n\nSo freaking good, incredibly authentic, kind Polish hospitality with the servers. Loved it here!\n\nGot the Pierozek Grill Bowl which came with 6 Ruskie Pierogi (potato and cheese), Kielbasa, Grilled Zucchini / Squash, Red Peppers, Corn, and Pickles. Served alongside sour cream and a yogurt-dill sauce. Very delicious, modern take on Polish food and the bowl was so cute too, reminds me of my Grandma’s kitchenware."
        },
        {
            "date": "3달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNVJXa3lXSFJLYkhJeWNFaDFUa1o0Umkxb2FWRRAB",
            "text": "Zwiedzając NYC wstąpiliśmy do Pierożka. Cudowne miejsce z przepysznym jedzeniem - takich pierogów i barszczu nie jadłam nawet w Polsce 😍 Mąż zachwycony kiełbasą 🙂  Naleśnik z twarogiem przepyszny. Gołąbki i krokiety też świetne. Drinki i piwo też polecamy 😜 Obsługa wspaniała. Klimatyczne i ciepłe miejsce. Będąc w NYC trzeba tu przyjechać żeby smacznie zjeść."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMzZUT2NREAE",
            "text": "So delicious. This small restaurant combines a modern glass kitchen and quaint ceramic tableware. And the combinations are what make this place amazing. The pickle soup is perfectly cut into a creamy soup. What could be heavy entrees like Pierozek grill bowl are still light and delicious thanks to the squash. Absolutely delicious and reasonably priced!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNmFqTkVPVVZSVERoUWRuVXpNSE0yTTNGWE1tYxAB",
            "text": "I was thrilled to finally try this Polish restaurant in Greenpoint, and of course, I had to bring my Polish friend along for the experience! The atmosphere is charming and intimate, yet surprisingly spacious, with additional seating downstairs.\n\nI ordered the savory pierogi mix, including the jalapeño pierogi--stuffed with potato, cheese, and jalapeño, then topped with crispy bacon. Absolutely delicious, though I wish it was more spicy! I also tried the meat pierogi, which was solid, but the real star for me was the dill sauce--creamy, tangy, and utterly addictive.\n\nAs a big fan of gołąbki (stuffed cabbage), I was eager to try theirs with both the mushroom and tomato sauces on the side. Unfortunately, it didn't quite hit the mark. The mushroom sauce, while unique, was too sweet and not traditionally paired with gołąbki, while the tomato sauce was very bland. The cabbage rolls themselves were just okay--falling apart too easily with rice that didn't hold together. I'd take Karczma's gołąbki over these any day.\n\nI also tried the Pierozek Grill Bowl (available only on weekends). It was decent, but the standout was the fried spinach pierogi--crispy, flavorful, and absolutely delicious! The dish came with seasonal veggies and sliced kielbasa, though the kielbasa itself was just average.\n\nOverall, I'd highly recommend this spot strictly for the pierogi--they're phenomenal! I'll definitely be back just for them. I'm officially obsessed!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNSFNqZG5idTUyZkt3EAE",
            "text": "At Pierozek, a Michelin-laureled Polish spot tucked neatly into the old bones of Greenpoint, the past is folded, crimped, and served by the plateful. A hum of soft voices floats above glossy white tables; tea is poured from folk-painted ceramic kettles. It feels like a place out of time—neither kitsch nor caricature, but a living postcard.\n\nWe began with borscht, hot and crimson, tangy but mild, a sort of gentle initiation. The grilled bowl—a heap of charred squash and kielbasa and crisp-skinned pierogi—was hearty, direct, and pleasingly rustic. But it’s the pierogi themselves that earn the marquee: the tatarskie, savory and speckled with dill and bacon; and the raspberry-sweet cheese, ethereal with a dusting of sugar and a single berry like a comma.\n\nThis was our first foray into Polish food, and a happy one. Pierozek doesn’t shout its virtues. It speaks softly, with flour-dusted fingers and old-country calm."
        },
        {
            "date": "3달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4QlZHaEpXVEp5TjAwMVdEQk5WVTR6VjFGdlowRRAB",
            "text": "Cudowne miejsce! Brak mi słów, pierogi są lepsze niż w wielu miejscach w Polsce, plasują się w moim topie. Delikatne ciasto, bogaty farsz, smak. Obsługa top!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTFIwZEZTbGh4TXpWS2FsaE1VM3BhWlZGTFQyYxAB",
            "text": "This place had been on my list for many years, so I made the visit since I had a long layover at JFK. Staff was super friendly and seated me quickly after arriving. I tried the savory pierogi mix of tatarskie and Murray’s cheese. They were both delicious and highly recommend."
        },
        {
            "date": "3달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUVh6TkZhMWxZZEdzeU9VcHlTSGd4Ym01S04zYxAB",
            "text": "Wspaniała Polska kuchnia, sympatyczna obsługa i fajny klimat. Pierogi tak dobre że w kraju ciężko znaleźć lepsze. Polecam gorąco restaurację Pierożek !!! Będąc w NY obowiązkowo trzeba tu zajechać."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvME9Yd3lnRRAB",
            "text": "The pierogies are out of this world, absolutely delicious. The garlic/dill sour cream that they give as a side is amazing as well. It’s fun to get a big 4 ounce cup of vodka to wash the pierogies down with."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTmJUbG9kVmhKTTBOcVdtTXliVkl6VlVaUlpGRRAB",
            "text": "These were life changing pierogis!! I remember trying pierogis elsewhere many years ago for the first time, and decided I didn’t like polish food, but this restaurant changed my life.\nTheir pierogis have a great bite. The dough is light and almost has a chewy texture. All the savory ones taste awesome! My favorites are the jalapeños and the mushroom.\nBring a friend or two, order a bunch of different ones, and get ready to share!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcVZpWm5POHN6MzRnRRAB",
            "text": "Absolutely great place. We had pierogi, beetroot soup in the cup, Polish style croquette with meat and Polish style crepes for the dessert. Everything was outstanding. Also the atmosphere was amazing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeHRMcHRnRRAB",
            "text": "Food was incredible. No reservations, short wait for 2. Borscht was so good, mulled wine was great, and the pierogis are soooo worth it.  Definitely a fun vibe!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bWFXVVF3EAE",
            "text": "Pierozek is a fantastic Polish restaurant offering delicious food at an amazing price. Their pierogi are the highlight—soft dough filled with generous portions of flavorful ingredients, from meat to potatoes and cheese. The quality is top-notch, and the prices are incredibly affordable. If you’re craving authentic, hearty comfort food, Pierozek is the place to go."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdHF2bTRnRRAB",
            "text": "It's a Michelin star rated restaurant.\nMenu is not large but what they  have to offer is top notch Polish cuisine. Definitely enjoyed they're  exceptional pierogis, stuff cabbage, also kibasa. The quality of the food is outstanding. What a real jem !"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROODk2aHJnRRAB",
            "text": "Hello Pierozek,  My girlfriend is Polish but I like the food very much. We came from Tampa and you were on a very short list of restaurants to visit in NYC. This was (by far) the best food we had during out 8 day stay. I cannot believe how good the sausage and pierogis were. We ordered three plates. She said the Galumpkis were just as good I just don't like cabbage. You have an amazing restaurant and if we get the chance to come back we certainly will. It was a pleasure dining here. Oh our service was super amazing too. Thanks again.\n\nWe came back in January 25 and the place was just as good as ever. I think we’ll come here every year!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMWRPd1lnEAE",
            "text": "My friend recommended this polish neighbourhood so I decided to have a polish lunch since I was in this area. I found this restaurant through Google maps. It’s very cute inside and was a little busy even off the lunch hour. The service was very nice. Friendly and sweet. I ordered the pierogies with sausage. I believed it wouldn’t be wrong and of course it proved that I was right. Very delicious and fresh. Just wish the size of the food would have been bigger."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMNmZzSUwtcjlUTEZnEAE",
            "text": "Always great experience! Delicious, authentic polish food. The best pierogi in the NYC! Highly recommended!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaWF2cjVRRRAB",
            "text": "This restaurant doesn't sell anything bad. It's literally all amazing. The pickle soup sounds odd but wow. The bowl is amazing and definitely get the meat dumplings.\n\nAlso amazing happy hour special."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINWFtZ21BRRAB",
            "text": "Personal favorite pierogis in all of NYC! The food and hospitality are on full display here - plus a lovely backyard to enjoy everything in.\n\nIf the Paulie Gee’s pizza pierogis are ever in the menu, get two orders. They are quite special. Otherwise ask your server what to get, classics also deliver. Ideally this is best to go to with a group so you can try a few varieties, but I’d say it’s worth trip regardless.\n\nOh! And get the blueberry pierogis for dessert. Sleeper hit on the menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTlNIVmpVV2gyV21wa1JGZGpZMlp4T0RFd2FIYxAB",
            "text": "Great pierogi and kielbasa! Good service and fresh food. Highly recommend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eU5xeXhnRRAB",
            "text": "Top-notch pierogi spot near the edge of Greenpoint. Pierozek's menu is perfectly-sized, perfectly-priced and straight to the point.\n\nHighly recommend the Savory Pierogi mix to try as many of the flavors as possible. The traditional potato and cheese was excellent, but the Tatarskie was really fresh and interesting (filled with dill and topped with bacon bits). Also recommend the stuffed cabbage with meat and mushroom, which was super tasty.\n\nMy only regret was not getting the kielbasa dish. Someone at the table next to me ordered it, and it looked really great. Will def be back to try the rest of the menu."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NmJIVFh3EAE",
            "text": "Pierozek: The Best Polish Spot in Brooklyn\n\nAs someone raised in a Polish household, I can tell you Pierozek isn’t just good—it’s the real deal. The food here doesn’t just remind you of Poland. It feels like Poland. Every bite brings a little piece of home, a memory, or a story. This is my go-to spot when family visits, and they’re always blown away.\n\nStart with a shot of Soplica vodka. Pick a flavor like hazelnut or plum, and sip it. Yes, sip it. It’s smooth, full of flavor, and the perfect companion to the meal ahead.\n\nThe red barszcz with a croquette is a must. The beet soup is vibrant, earthy, and comforting, while the croquette is crisp and packed with savory goodness. The kielbasa plate is another standout, with smoky sausage and sharp mustard that create a simple yet deeply satisfying dish.\n\nThe gołąbki (stuffed cabbage rolls) are phenomenal. Get them with the mushroom sauce. It’s rich, earthy, and elevates the spiced meat and rice to something extraordinary. Then there’s the pierogi—the stars of the show. Stick to the classics: potato and cheese, meat, or sauerkraut and mushroom. They are light, perfectly balanced, and so good I’ve given up trying to make them at home.\n\nPierozek isn’t just about the food, though. The atmosphere is warm and welcoming, the music sets the tone, and the service makes you feel like family. If you’re looking for authentic Polish cuisine, this is where you’ll find it. It’s more than a meal. It’s an experience."
        },
        {
            "date": "7달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cC02TzlRRRAB",
            "text": "Zjadłem jedne z lepszych jeśli nie najlepsze pierogi ruskie jakie kiedykolwiek jadłem. Idealne ciasto i farsz w którym czuć było pieprz. Pierogi z wody podane z cebulką. Słyszałem, że jeśli ktoś prosił o smażone w taki sposób miał przygotowane. Przepyszne!"
        },
        {
            "date": "11달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQLVAzbGt3RRAB",
            "text": "Barszcz z uszkami mega dobry, pierogi również.\nNa wielki plus na pewno brak nachalności w kwestii zakupu napoju- chcesz darmową wodę z dzbanka? Proszę bardzo. Chcesz butelkowaną lub coś słodkiego? Jest dostępne do zakupu. Jedyne co to byliśmy w szoku, że obsługa nie mówiła po polsku, ale to bardziej jako ciekawostka niż minus. Wrócimy przy następnej wizycie w NY."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdkoySll3EAE",
            "text": "I love the interior design, minimal and stylish.  The staffs were very enthusiastic and patiently introduced different plates to us, make it easier for us to experience Polish cuisine for the very first time. We had a very pleasant dining experience!  We will definitely go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMThqWUdnEAE",
            "text": "Wonderful little Polish restaurant in Brooklyn offering pierogis and other Polish classics in a casual neighborhood setting.   The menu is pierogi-focused, but has other equally delicious choices as well.   Service is very informal with a family-run feel, but they work hard to meet your needs, although it can run slowly at peak times.   Atmosphere is casual and basic, but the outdoor patio is a gem on nice days.   Great option for a casual lunch and a beer if you are in the area."
        },
        {
            "date": "4달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMeWZpTTIzdHNQa2lRRRAB",
            "text": "Megaśnie najlepsze pierogi jakie jadłam. Nie sądziłam że zjem właśnie takie w 🇺🇸\nPozdrawiam z Krakowa"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMRGxudE9pb3NEYnNnRRAB",
            "text": "Came here for dinner last night and was blown away. The pizza pierogis were excellent, but the raspberry & sweet cheese were easily a close second. The staff was incredibly attentive and kind, and they were able to get us in and out quickly. It's super cute inside which is always a bonus! Will definitely be coming back next time I'm in the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIb2J1NUVnEAE",
            "text": "After eating at Karczma for years I decided to go here with my parents visiting from out of state because my mom wanted to try the crepe desert. I was initially not into the vibe (super minimal and more Williamsburg than the over the top almost kitschy feel of Karczma). Also the menu is tiny and the food aesthetic is the opposite of Karczma: small cups of borscht broth and composed little plates instead of the giant platters of meat (including skin, fat, and bones) and borscht served in giant bread bowls. The food, however, was great. The borscht cup was seasoned so well, the mushroom/cabbage croquette was delicious, the pierogies were totally solid, and they enjoyed the crepes. In short, totally great place in its own right and an excellent compliment to other Polish places in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab2Fxb2RnEAE",
            "text": "I didn’t know pierogis could be this tasty 😋 Super affordable. Drinks are also very affordable (weekday happy hour is 2-for-1 beer and wine and $2 shots !) The drink menu is very vodka forward but they also have some beer and wine.\n\nThe interior is nice and they have a lovely back patio"
        }
    ],
    "reviews_count": 81
}