{
    "name": "Lechoneria New York 2",
    "place_id": "ChIJeY3vV_9fwokRuARUgfyTGjQ",
    "grid": "QN3",
    "address": "84-17 Northern Blvd, Jackson Heights, NY 11372, USA",
    "rating": 4.5,
    "user_ratings_total": 61,
    "phone_number": "(347) 448-6789",
    "reviews": [
        {
            "date": "20시간 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMlowbDVYMFJDUmpWSWJGcFlNWFZJU25OdGVrRRAB",
            "text": "Excelente atención de alejandra"
        },
        {
            "date": "1일 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTGVESm1jbXRtVlhoRU1FWXhSQzFRTmxOeGJIYxAB",
            "text": "Lastimosamente hoy realicé una llamada para un delivery , y la mesera prefiero perder la venta que hacernos el delivery que por qué superaba los 100 dólares, se le dice que divida en 3 la cuenta ya que nos pedía tarjeta y no la teníamos se iba realizar el pago en cash (no es la primera vez que llamo para un delivery) , que triste que se pierda el cliente , el consumo y el cariño que se le tiene al lugar, deberían revisar nuevamente sus políticas y con clientes antiguos no realizar este tipo de acciones.\nTambién se que es que le dejen a uno un pedido servido, pero cuando se trata de clientes frecuentes son cosas que no podrían suceder ya que deja unas ganas de no volver y ni realizar de nuevo un pedido"
        },
        {
            "date": "3일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdlRuWkVZbTAyYjFWWk9XeGZkVFJSTTJsRlFuYxAB",
            "text": "La mala pa Latinos allá no tiene el tan buen servicio y comida tan buena q tienen aquí en la Lechoneria el mejor restaurante de todo new York"
        },
        {
            "date": "3일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MGJWVm5aRWR0YzIxblJUSjJhV293ZFZCc1YxRRAB",
            "text": "Que rico la mona de la moto 😈🫣"
        },
        {
            "date": "3일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5eGNETkVSREp1T1hsQmNtcDZTVlZwWTNOWFZIYxAB",
            "text": "Que delicia q monita q me atendió y la picada sabrosa aguante la lechoneria"
        },
        {
            "date": "3일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RFNEaE9jVWhzTUVONlMyRnhlUzFXU2xkSlgzYxAB",
            "text": "El día de hoy fui en las horas de la mañana a comerme un buen desayuno y realmente me pareció muy espectacular la comida, la atención de la chica que se encontraba allí, realmente muy recomendado el lugar"
        },
        {
            "date": "3일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacU9UaHFiM05sWnpFeFVqVlBXSGxxV0ZSV01sRRAB",
            "text": "Recomiendo los postres como los churros y la oblea a mi hija le encantó, el servicio fue el Mejor pese a que estaba un poco lleno, soy cliente fija de este lugar, recomendadisimo"
        },
        {
            "date": "3일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeGR6WkZaM0JmUmxoWU9HeHBXR2h5UTBwVmJsRRAB",
            "text": "Today I was at the place, the food was incredible, the waiters attended to all my needs, I want to recommend that you dress it and try Colombian culture\n\nHoy estuve en el lugar estuvo increíble la comida, los meseros atendieron todas mis necesidades, les quiero recomendar que lo visten y prueben la cultura colombiana"
        },
        {
            "date": "3일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMVpUSkdMVE41VURVMVJFWnljbmxYUnpKVVMzYxAB",
            "text": "Hoy visite el lugar en la mañana y excelente comida , excelente atención, los súper recomiendo en especial la hamburguesa colombiana"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWek0zQnVXVmR0T1hFd1RsWXpkbXBqVEd0T2NuYxAB",
            "text": "Se llama Lechoneria, pero se demoran 50 mins en traerte un plato de lechona jaja. Culpan el hecho que dos del grupo se demoraron en ordenar. Pero uno de esos dos pidió un churrasco y salió más rápido que el plato de lechona que habías pedido antes jaja. Ahora, todo eso pudo haber sido perdonado si la porción fuera razonable. Pero ustedes vendrían a un lugar donde el plato principal es lechona pero el cuero que te sirven tiene este tamaño? Yo no vuelvo"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOZmMxVjVNVk5xVUZSbFJ6UkpUekoyZVdVMVJWRRAB",
            "text": "Realmente la comida que venden allí es muy buena, te recuerda mucho al sabor de casa, recuerdo la buena atención de un chica llamada Alejandra, su amabilidad hace que quieras volver al lugar y compartir de un buen plato de comida con tu familia."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tndE5WZGtiMVIxUW5GU05WVnZaMUV4U2toUmJFRRAB",
            "text": "The burgers were terrible! All the adults ordered from the “typical dishes” section, which wasn’t great either, but the kids decided to try the burgers, big mistake! They were completely inedible. The food overall was very disappointing, and several people in our group got sick afterward.\n\nThe chicharrón tasted old and was extremely greasy. The only decent dish was the lechona, but even the person who ate that ended up sick a few hours later. Honestly, they should only sell the lechona and drop the rest of the menu — even the salchipapas were bad."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paV1dUaGhXV1EyV1dWM1NqbFdVa3AxV0Zaa04wRRAB",
            "text": "visite el lugar me lo habían recomendado ya que no soy de New York y el caldo de costilla estaba delicioso, la arepa de queso, la oblea, la lechona todo estaba delicioso y fresco nos atendió Alejandra, una excelente persona y nos ofreció el mejor servicio volvería mil veces"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NNGVHOTRPRzloV2xJM1dtdGlhSHAyTW1sblpHYxAB",
            "text": "Hoy pasé en la mañana para un desayuno y me encantó el lugar primera vez que voy y quedé encantada muy buena la atención y la comida deliciosa lo súper recomiendo, ya encontré mi lugar para almorzar todos los días"
        },
        {
            "date": "수정일: 1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdmJUTllhbUppWlhsT1VFbHZTRFJ5VDJkc1IwRRAB",
            "text": "Me encanta el ambiente súper familiar y la comida deliciosa, los lunch súper variados"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWakxUbHhXWGxLUlVGMU9FWTBXSFJCTWxGU1QzYxAB",
            "text": "La comida es deliciosa y los sabores son excelentes, pero el servicio deja mucho que desear.\nLa última vez que fui, esperé bastante tiempo para ser atendido y nadie se acercó; todos los empleados parecían ocupados conversando entre ellos. Esto ocurrió en un momento con poco flujo de clientes, así que no me imagino cómo será cuando el lugar esté lleno. Ojalá mejoren el servicio, porque la comida realmente vale la pena —si lo hacen, probablemente volveré."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeVNHRXljakZpUVhvMFNuVnBiRVpxTVhaUk5YYxAB",
            "text": "Ayer pasé por el lugar estaba muy lleno pero realmente la atención del personal fue increíble se convertirá en mi lugar favorito muchas gracias por la comida tan deliciosa y por estar tan pendiente de nuestras necesidades a veces se demora un poco los postres pero es comprendible, Lo súper recomiendo."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcloyTlZhbXA2TjBndGJrTTJWa2wzY3pKV09GRRAB",
            "text": "I had several people telling me thos was the place to go for Lechon this is a typical Colombian plate that consist of rice and pork meat this has to be the best place to get in NY as far is im concerned always looking for that next best thing this is it try the lechona empanadas with the rib soup out of this world and of course the service that the Colombian staff bring always make you feel at home and the price beyond compare a must visit if you are in this area parking sucks but is worth it"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201a1UwRjZNSFZvYkc4elRHbFJXVUpqUW5Sb1ZWRRAB",
            "text": "La comida es deliciosa y muy típica de Colombia, recomendado el lugar !!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oV09XZEtSbUl3YUZkMGMySm9WM2szVUhkT01WRRAB",
            "text": "No sé los otros platos, pero zapatero a su zapatos, llegué a este lugar por el nombre y mi antojo de comer lechona, la verdad no me defraudó, estaba de muy buen sabor, buena porción, buen precio, pedí para llevar y solo esperé como 10 minutos, además probé la empanada de lechona y muy rica también, la fritan a penas uno la pide entonces estaba fresquita.\n\nSi me supo tan rico esa lechona después de durar con ella empacada como 30 minutos, no me imagino cómo sabrá si me la hubiera comido en el acto en el restaurante.\n\nMuy recomendado, muchas gracias, no veo la hora de volver a ver qué más de rico tienen… para los caleños como yo que nos encanta la lechona con arroz (como debe ser jeje) este lugar fue un maravilloso descubrimiento!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wV1JsWkhVbm95ZDBReVgxaG9UV2xxWDA5M1gxRRAB",
            "text": "Geraldine Quintero fue super atenta, me encanto la atención, volveria 100 veces si es necesario, comida deliciosa"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVGRXaFNaV3hDTkdwSVRUWklTM1pUVkhWek1VRRAB",
            "text": "Excelente atención de Geraldine Quintero, una chica muy atenta y muy buena actitud, me hizo sentir como en casa 👌👌👌"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscmVGQkpZMmxKZFZnM2ExWk5lSEZFTVRSMFdIYxAB",
            "text": "La comida llegó fría, pedí mi entrada y se confundieron me la cambiaron pero llegó después del plato fuerte no la pasé tan bien."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5a2RqTkxiRzFFYUVwSlRFVmtVV3AwVlMxaGJHYxAB",
            "text": "My third time eating here and I can say that the food is really good! The portions are very good and the flavor is good and I’m only leaving four star review because I have this kind of problem always with Latin restaurants, they add the tip automatically and it’s not in the menu and we were just 2, it’s not like even a party of four or something like that you know what I’m saying but it’s always like that en lugares latinos I don’t know why lo mismo me a pasado ya en lugares hispanos y No te pueden obligar legalmente a pagarla y me molesta cuando lo hacen es like como sentirse obligado y normalmente es el 15% pero de paso se add more than the 15% y no lo dejan a criterio del cliente but I’m not sure if it’s the restaurant or the server, anyways the food it’s really good and it’s worth it ♥️!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRFoyWkhZWFJuTXpKU2FYaEJTbTR5V25CT2JVRRAB",
            "text": "Hoy fui y el sabor estubo muy bien. Buena la atención, el ambiente agradable igual."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kU05FTTRiQzFFTTBadVEzRkJjVUZKYm1aSVYxRRAB",
            "text": "We asked about the caldo de pescado they told us it was more liquid than the sancocho.  We ordered both and my husband order la cazuela de mariscos … after a while a different server came to tell us that there was no sancocho. We said it is ok we would\nLike to have two soups  (caldo)\nAll 3 orders came late, and they were very salty and the caldo (liquid) wa all full of onions and peppers not too much liquid in it.\nNot too much communication  no one came asking if everything was ok or if we needed anything-\nWe wanted to give it a try - disappointed ."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RE1YUk5SSEpaTVZobVJWTXdWVTAwWjJ0U2QyYxAB",
            "text": "Geraldin quintero excelente servicio"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OeFNsWklaVFZTV0ZSaWIzSnlVMDFLVFdkVlZXYxAB",
            "text": "Muy bueno el servicio y la comida"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOV1EyeHFVRVZTWkdOWlowVkpSbFkwWlc5dmExRRAB",
            "text": "Comida deliciosa y servicio 100 de 10 👌🏽\nGeraldin Quintero muy atenta y muy amable"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcFVVOXphWGhxVVhWRFUwOXpjV05SWVc5TGRWRRAB",
            "text": "50 minutes for a burger restaurant empty, rude staff"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWk56RXphVzVDUWxkTVVtWmhkSEZ5WDBObFZYYxAB",
            "text": "Vine por una oblea y termine también llevando sopa y carne, todo muy muy rico\nSuper recomendado"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdlZTMUdWMFF3UTFwdmMzaFBOemhzWVZKVVQwRRAB",
            "text": "Deliciosa la comida 🥰y muy buen servicio 🙏🏻la mesera Yeraldine quintero tiene excelente atención 10 de 10…"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUWJuSnVPSFJDWWxWUVJWbzFkbk5xUm1OQmFtYxAB",
            "text": "Excelente atención de geraldine👌"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weWRYSmhYekZsUldKT1RUQnJja2xPTldKbWNHYxAB",
            "text": "Omg ! Excelente comida y excelente servicio. Ya he comido aquí y volveré mil veces más !!!! Amo la combinación de el tamal con lechona, ninguno como este… me encantooooo"
        },
        {
            "date": "3달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUVV6WktiRU5zYUMxaU1UVklXbFZYV0RkcWIxRRAB",
            "text": "Memories empanadas nos custa"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM1lrTllUVlJZVmtONkxWTmFkbmxCYVVKVmRYYxAB",
            "text": "Ya he comido muchas veces acá, tamales y lechona y la sacaron del estadio por eso les doy las cinco estrellas porque se las merecen y es de mis restaurantes favoritos, pero ayer fuí con mi esposa y probamos otros platos, yo pedí la mazorcada pero la verdad no era lo que esperaba, estaba tan llena de salsa que la papita ripio ya estaba aguada y la mezcla de tantas salsas hacia que pareciera una sopa, no parecía una mazorcada colombiana.\n\nLa salsa de la hamburguesa estaba saladita.\n\nPerdón por hacer una crítica publica, la idea no es perjudicarlos porque sé que ofrecen comida deliciosa y el servicio siempre es bueno.\nSolamente quiero sugerirles que para la mazorcada dejen que los clientes pongan las salsas a su gusto, no las pongan todas de una vez en la cocina."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdlEyVm1UbEJDTW1WdGFtRnFVR05tUjJSaVoxRRAB",
            "text": "Llegué y pedí para lleva me senté. 20 minutos después. Me levanté y le pregunté a la camarera cuánto tiempo más tardaría. Fue a la trastienda,regresó, miró en una estantería y mi pedido estuvo ahí todo el tiempo, La comida que pedí era comida preparada. Solo tenían que recogerla y ponerla en una caja para llevar... Primera y última vez"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQ1gyNW5XVGQzVWtKUGNXOVFXVTV1VGsxUFltYxAB",
            "text": "Mi Restaurante favorito , Amo todo todo lo que venden es delicious 🤤🤤"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSVQzbE5NalYyZG1aTk9EVjNUVU4wZVZacUxVRRAB",
            "text": "Muy rica la comida"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKc09HOXBWME13WDJSd01EUk5ZVUYxU1RSc1VYYxAB",
            "text": "Love your restaurant customer service."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQlFURnVTMG8xYzNCZk5UbGtVbGRmVFV4WlZGRRAB",
            "text": "Muy tico"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wd1EyeFRTbVk1Um5KMU5GazFURE5qWVd4TVJFRRAB",
            "text": "excelente servicio y comida, cam..( Geraldine ku)…"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcU5FaDVYelF0VjJGaFNYZEZXRmxoYTNWb1puYxAB",
            "text": "Excelente, ambiente muy familiar la mejor comida colombiana 1000/10"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vdGExQnlZMWRqVGprdFozaG1TMGhqUVdwclNFRRAB",
            "text": "Mejor comida y servicio"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSFExOXhOMGxWZFRsblkxOTNSMDVPVldONk5FRRAB",
            "text": "Exelente comida"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaVNrWktlRzVDVVdSVWJGRm9SMEZSYjNCS1ZXYxAB",
            "text": "Súper rica la comida , muy buena atención"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV1dsRkVWamN4V1Vsdk5rVnJjM0ozYzNwU1YxRRAB",
            "text": "I would like to start off by saying. I rarely give 5 stars ever and I have to say this is 5 star! I’m Puerto Rican from the Bronx and I fully approve of this place. The food the portions the flavor the everything. The staff are so nice and sweet.\n\nAbsolutely love this spot! Lechoneria New York 2 has some of the best food and drinks in Queens, hands down. Every time I come here, the flavors hit just right—authentic, fresh, and full of love. The lechon is always cooked perfectly, and the portions are generous too. Drinks are strong, tasty, and reasonably priced. Whether I’m stopping in for a quick bite or hanging out for a while, the atmosphere is always welcoming. Highly recommend this place to anyone craving delicious Puerto Rican or Dominican food done right!\n\nWe came for my son’s middle school graduation and they had seats ready thank god!!!!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdU1IZEJZM3BoV0RCTU5pMUNTMkZ0ZDNSTlExRRAB",
            "text": "Muy buena la spits de ajiaco los viernes\nServicio muy bien y rapido\nIraldinQ"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21semNYWkRVVUZ4Tm5CeU9YbEtNMjlLWldJeFowRRAB",
            "text": "La mejor comida, super deliciosa"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201d1EwVnZUa05vTUUxdlNWbDBSRVpGYjE5NmJHYxAB",
            "text": "Excelente servicio, fui almorzar y todo estuvo maravilloso. Las papas rellena de pollo están riquísimas y las pastas, deliciosas. Además, sus platos estrellas, la lechona y el tamal, estuvieron estupendos"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KYWFWQkpkMFpGYUhkVWQwSmtXRlpmWTJKSWJGRRAB",
            "text": "Muy delicioso y las ensaladas la picada y el precio ni se diga los mejores"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVWNUZ3pTbk5EZFZSNlZHZFNVVFJaTTJaeE5uYxAB",
            "text": "La hamburguesa muy deliciosa y el servicio genial 10/10"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sYVVrRkRWa1EwUzFoWlRsUXlPV2xhWmsxNmFuYxAB",
            "text": "Muy rica comida y buena atención☺️"
        }
    ],
    "reviews_count": 53
}