{
    "name": "Izakaya Fuku",
    "place_id": "ChIJP3cSeLRfwokRiQQ4MtBvdtA",
    "grid": "QN3",
    "address": "71-28 Roosevelt Ave, Jackson Heights, NY 11372, USA",
    "rating": 4.4,
    "user_ratings_total": 547,
    "phone_number": "(718) 255-1120",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMVJHUlBXR00xZDJWM1owczBUVXhuU1doTE1XYxAB",
            "text": "The vibe from that place is something else, food was nice, friendly workers. Would recommend and come back there."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eWVqQkhaazlsWmxScU9FVlZUMFJDTlRoRlpFRRAB",
            "text": "Ive only ordered takeout but the grilled salmon collar and udon carbonara are so delicious! Its better than the ones Ive had in Japan"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ09ESTRORUZ3WnpBeVNFUm5Vbk5rZHpjNWJGRRAB",
            "text": "Hearty and delicious. They are cash only."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWVMwSjVZWGc0UVU1U1ZHZG5WWEpsTFhkYVRIYxAB",
            "text": "Next time, call me very nice talk to and very good and driver thank good service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSFZEUXlka2N0TjFoa1MwcEZVbGMzUVdwRVlrRRAB",
            "text": "Small location but a huge taste of Japan. For those who have been to a Tokyo Izakaya this is a pleasant surprise. Excellent place for quick snacks for a meal."
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbFZsTmZNMnd4VVhaR04xWkxWekF6ZVdVeGRHYxAB",
            "text": "Bueno 👍 😊🤟"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SaVlrUXlPVzVmVms5MVlqTm5XWGw1YTNSRWJXYxAB",
            "text": "Good spot in Queens around Elmhurst area to have the best Japanese food with reasonable prices and service. Also the vibe of restaurant is cozy. I really love it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWclVXMDVjemRhWVY5NGVHYzFkamgyT1U1emNHYxAB",
            "text": "I'm a huge fan of Ramen soup and most of the time I go to Manhattan to get some. This time I was in the area and decided to try it. I loved it. I'll come back here every time I'm in th area. Service was fast, fold was delicious, and everyone was very friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOYU9VTTNUMk0wTUdOQ1IwWlVYMkl0U0ZGVVNYYxAB",
            "text": "When you treat even the dashers like second hand person. That shows a lot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oblowaENibVZWVjJ4QmR6Qm1RMHhOUW5sbVkzYxAB",
            "text": "Small traditional Japanese Dive bar. Only place with real food at late night hours. Great japanese draft beer on tap and great service. Not ideal for parties bigger then 4."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWGNHTnpXVXhsYVdkSVVYUjVOMDgzYUVKeU5rRRAB",
            "text": "Dine in with a few friends here food was good love the vibes def coming back"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zek0zbHRhVFpsVEVkcmEwWlJablF4U2twMmRXYxAB",
            "text": "Izakaya Fuku in NY is very different from what you usually expect when it comes to Japanese food. The moment you walk in, you’re greeted with an urban vibe walls covered in graffiti, hanging lights, a jukebox playing music, and even chairs made out of beer crates with cushions on top. It’s a unique concept that feels casual but very enjoyable.\n\nThe service is good and the food is definitely worth trying. Their sushi is served as a type of nigiri over a bed of rice, with great flavor overall. The only one I personally didn’t enjoy was the fish roe sushi since it had a strong cod-like taste, but everything else was excellent. The classic ramen was absolutely delicious, rich in flavor and perfectly prepared. I also have to highlight their house-made soy sauce it’s outstanding and really elevates the experience.\n\nThe only downside for me is that the place is cash only. I don’t think this adds to the concept, and instead it takes away a bit from the overall experience in such a modern and authentic spot.\n\nOverall, I do recommend Izakaya Fuku if you want to enjoy Japanese food in a very different, urban setting with great flavors and a one-of-a-kind atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kb1dYSlZTR1paUW5CVVdrUlNNMnh2YUZKVmRIYxAB",
            "text": "Wifey and I love this spot. We come here whenever we get a short lunch break from the kiddos, and the food does not disappoint. The bentos are a great value and is a well balanced meal, something we greatly appreciate as we try to be more conscientious eaters. The ramen here is a well kept secret in my opinion. Broth is flavorful and the noodles have a wonderful bite. I imagine this place getting busy but it's quiet on weekday lunch hours."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGa01XMVVSVlJpYVRrdFRrZFVTalU0VG5FeVUxRRAB",
            "text": "Food looks delicious, couldn’t eat most of it because when I went I was still recovering from wisdom teeth removal 🥲. I got the salmon don, the sautéed salmon was on the sweet side and the fresh salmon was good. I like the type of wasabi they use, it’s not the spicy type. Would love to come back to try other dishes!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeVRHdFFjbFpPTlZSMlIwTTNTMFZQTjFoc01XYxAB",
            "text": "Food was great, I like their Creamy Mentaiko Bacon Pasta and Oyako Don."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVVUzaGtWMjVrZUZGR1YwRldXVGh2YkMxWmNIYxAB",
            "text": "Cozy Japanese izakaya with an authentic vibe. Friendly service and perfect for sharing dishes with friends."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNUxXMVpUMWx3VUVnMVoyUjRPRjlUZDNGeWFWRRAB",
            "text": "in love with the snow crab pasta sooo good 🤌🏼"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdU5qUnRkV281U1VwcFNGOTRjbm8yWW5acVlVRRAB",
            "text": "I went in today @1130pm and the lady was pretty rude. Ive been ordering their ramen with extra eggs for years. All I asked was how do you make your eggs so good? And she told me that the conversation wasn’t important to her and had a bit of attitude. It’s not that deep. She could have atleast been nice about it, I really like their eggs here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbVRYSndRV1JYWm1WVlEyUkhlSFl3WWw5d2MwRRAB",
            "text": "I love the food here, so I hope that service improves once again. We went on a weekday when it was not as busy and it was hard to catch the waiters attention even with the relatively small space. Our waiter often seemed disinterested and crossed the line a bit in asking us to lift our things so she could wipe the table. She could have waited 30 seconds after we paid the bill and got up. I am not sure what was off, but I am certain about not feeling welcome."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSmFrSXpkM1ZpWjJKM2VuSlBjRmRETUZaNVkwRRAB",
            "text": "I usually order pickup from this restaurant through Uber Eats, and I must commend the kitchen staff, the food is consistently excellent. Whoever is in charge of preparing the meals does a tremendous job, as every order is top-notch without exception.\n\nIf only the front-of-house staff were as good as the kitchen staff. The service clearly falls short by miles conpared to the quality delivered by the kitchen. Many of the staff obvisouly don’t want to be there as you can clearly see from their body language and sour faces. Is it because there is no Tip involved in a pick up order. Im still a paying customer.\n\nIn one particular instance, I arrived twelve minutes after the scheduled pickup time indicated on Uber Eats. The blonde hostess asked me to wait outside since the order was not ready yet, which I completely understood, even thought it wasnt busy and there were empty tables and chairs. She couldve asked me to sit for a bit instead of waiting outside as its polite since the food was already late. I didn’t mind waiting outside, however no one ever came out to notify me when my food was ready. After waiting outside for about 15 minutes, I went back inside only to see that my order had been sitting on the counter. At the very least, it is common courtesy to inform a paying customer when their order is ready especially when it is already delayed.\n\nThis is not an isolated experience, but rather part of a recurring issue with the service here. If the incompetent front-of-house staff provided the same level of care and professionalism as the kitchen staff, this restaurant could easily be one of the best dining spots in Jackson Heights."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMWFsVmlkRmhPV1d0QlpHdEpNMmw0VjFwMGJFRRAB",
            "text": "The service was fantastic and the food was delicious! I think this might be my new favorite spot when I’m around the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acVQyaDRUV1ZwU2w5bE5VaFdhRlJrZGpSdmNGRRAB",
            "text": "Good place to have small bites and a beer"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcDdqVG5nRRAB",
            "text": "one of my favorite places ever to eat at <3 anyone i bring here also love it. the food is consistently delicious! top faves are the mix sashimi salad, tako wasabi, & the creamy mentai bacon udon with a side of the boiled eggs."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNFkzUjZjRE15VnpKaFFrdFBXbU5OTUVrMVFXYxAB",
            "text": "One day I'll dine in but have ordered delivery many Xs for few years, food always on point, tasty, packaged well 😊"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUVFVUjZiM2d4TjBwb1pqTkNRVEoyU2t4TFdrRRAB",
            "text": "Izakaya Fuku, nestled in the vibrant neighborhood of Jackson Heights, NY, offers a truly immersive dining experience that transports you directly to the heart of Japan. From the moment you step inside, the ambiance is nothing short of excellent; the authentic vibe makes you feel as though you've been whisked away to a bustling izakaya in Tokyo.\n\nThe culinary offerings at Izakaya Fuku are generally quite good, with some standout dishes. The appetizers, in particular, were excellent and remarkably tasty, setting a high bar for the meal. My personal choice, the Black Garlic Ramen, was incredibly satisfying and flavorful, a true highlight. However, my girlfriend had a different experience with her Oyako Don, finding that it had a peculiar aftertaste that wasn't to her liking.\n\nOne significant point of feedback pertains to the service, which we found to be quite rushed. It felt as though plates were being cleared even while we were still enjoying our appetizers and beer, which detracted from the ability to relax and savor the meal at a leisurely pace. This aspect was the only notable drawback we encountered during our visit.\n\nIt's important for prospective diners to be aware that Izakaya Fuku is a cash-only establishment, so come prepared. Regarding parking, it can be challenging to find a spot in the area, especially during peak hours, so be prepared for a wait or consider alternative transportation.\n\nDespite the hurried service, there's nothing else negative to say about Izakaya Fuku. The excellent ambiance, combined with generally good and tasty food, makes it a compelling destination for those craving an authentic Japanese experience in Jackson Heights."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUVJWOUpWVTFDVlhKVWNVOXJUM0JXUlZseGJtYxAB",
            "text": "Three years ago, when I lived in Woodside, this was one of my favorite spots — I used to come here at least three times a week for the food and the atmosphere. Today, I came back for the first time in a long while, and unfortunately, it turned out to be a terrible experience. I should’ve left this place as a good memory.\n\nFirst of all, I ordered a bottled beer, but what I got was a flat beer already poured into a glass — it tasted like it had been sitting out. Later, when my friend ordered a different beer, they brought it properly in the bottle, so I knew mine was not handled right.\n\nThen we ordered the skirt steak and fried squid legs, but they didn’t even bring soy sauce. When I asked for some, they handed me a sauce dish but didn’t give me a small plate to pour it into — I couldn’t understand the logic.\n\nWhat shocked me most was the service. We had to call the servers 7 or 8 times before anyone came to our table. There were only three tables (including ours) and three servers working — yet all they did was gesture that they saw us, and no one actually came.\n\nWith such poor service, the food didn’t even taste good anymore. It was honestly one of the worst dining experiences I’ve had in a while.\n\nI don’t think I’ll ever need to visit again. Goodbye, place of memories."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRM1ZXdG1UVFpFYVc1T1MxcGlRVWx2TFZjNFQwRRAB",
            "text": "Izakaya Fuku is a small, cozy, well rounded Japanese restaurant with some really delicious dishes. I ordered the Creamy Zuwaikani Pasta which is pasta topped with snow crab and salmon roe. The snow crab was sweet, juicy and so flavorful. I've had plenty of snow crabs that are made wrong and has lost all it's flavor but this is definitely not one of them. Along with the flavor of this dish, it is also very well plated.\n\nI had a taste of some other dishes as well. You can't go wrong with ordering a bowl of ramen. The flavor is solid but not one of the best I've tasted. Their chicken teriyaki from their chicken teriyaki don is really well flavored, very crispy and complements the rice really well. I personally wouldn't recommend the salmon donburi just because it lacks a lot of flavor making the dish as a whole pretty bland. They have a very large variety of dishes. Definitely check this place out!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaE4zMmZ3EAE",
            "text": "I went here with my friends after calling ahead and making a reservation only to arrive and tell me that they have no reservation for that time. Upon verifying that I called the right place and phone number they still denied having a reservation, they eventually seated us in the back and told us we cant sit in all the seats because we would have to share the table (there was only two seats left and barely any space). They also were taking our plates away any chance they could, I couldn't eat anymore because they took my chopsticks away.  I have had other negative interactions with this place, from having to wait two hours to be seated even though there were people coming in and out like crazy. I have also ordered a skirt steak to share with my friend and the server never brought it but gave us a sparkling water thinking we asked for that. The atmosphere is the only redeeming thing about this place. My food was burnt when I went, lost my appetite."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTGJrZHRhRlpsYlZJM1ZVZDZkRGxFUmxCbWNIYxAB",
            "text": "I absolutely loved the food at Izakaya Fuku! Everything was fresh, flavorful, and perfectly prepared. The service was great—everyone was kind and attentive. Definitely coming back again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toa01UbDVOWGRyVWpWaFRESTRZM00wWW00MU1sRRAB",
            "text": "Had a quick dinner after a surfing trip in queens 3 Thursdays a go.\nCute little spot with a Japan-like atmosphere that brought me back to my first solo trip in Tokyo 13 years ago! The food was deliciousious, loved how crispy and fresh our Grilled Makerel was and my Udon mentaiko came in a perfect Al dente with the right thickness creamy sauce.\n\nOur waitress was attentive and helpful a bit bummer to hear they said something not really nice about us in Thai before realizing I know the language.\n5 stars for the food and vibes\n\n** Cash only **"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVlNERmtZbTB5UW1SdmIxUjVaMHRyVWpnMWFIYxAB",
            "text": "I appreciate all the hard work n effort that goes into this place. The chef n his staff definitely dedicate their time to me make sure every dish is great. The venue is small but very comforting. It was a very relaxed and fun experience. Thank you so much. 🙏"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVmJrMVlSMFI2Ym1sSk9EUm5aMk16UzBWaVRHYxAB",
            "text": "Very rude staff i will never be there"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNGNFTkNPVkZVVWpOcE5EaEpXSFJqWkhCV2QxRRAB",
            "text": "Muy buena comida tienen un buen chef"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdGNVeGZZbU42ZFVkSFJ6Rk1ZVU5oTmtsM1gzYxAB",
            "text": "Ate here on 7.18.2025 at 10PM.\nHad the Gyu Tan (beef tongue), kimchi bacon fried rice, omu yakisoba, and yukke (blue fin tuna with green apple) - one of the Father's Day specials.\n\nThe beef tongue was thin and cooked really nicely, not too chewy. The fried rice was amazing, would definitely get again. The yakisoba was nice but wasn't for me personally. The tuna was soft and tasty but I personally didn't like the apple.\n\nThe interior has a nice ambiance and decoration. There are Christmas lights, vintage Japanese posters, lanterns, and masks adorning the walls and ceiling.\n\nI really enjoyed my dinner here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMM20yNEt6NjlPZkt3EAE",
            "text": "So many tasty dishes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOWFFqSU9Hdy1tSUZREAE",
            "text": "The food was AMAZING! we got the yuzu sake, fried squid, and the udon carbonara, beyond satisfied! Plus, it’s not only the food and ambience, even the service was top notch! They keep checking on us and really took care of each customer. Would definitely be back to try other menus😍❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQUExxSkNUa1lhekNREAE",
            "text": "Most of the food was great--crab salad, karaage, takoyaki, gyudon. The house sake and the decor of the place also hit the spot. Unfortunately, the yellowtail carpaccio was a miss. It didn't make me sick, thank god, but it was overly fishy. I'm hoping this was a one-off instance, but I would stick to the cooked foods here."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aU5Idk1BEAE",
            "text": "Was around the area and saw a place tried out alot go appetizers it had a great vibe they got bentos and alot of others things take a look at some pics I approve\n\nUpdated swing by place is still amazing pics updated food still gives me the Japan vibe I need for life on nyc"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMQ1lob2V6eDlhMllBEAE",
            "text": "Cash only, but fantastic well priced food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eVZsQjFSVTloVVhVeFZTMWxTa3B1YkdoSFgwRRAB",
            "text": "Food is good and atmosphere. But it's 2025, this place is cash only."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPeXp3ZC1qaTRPMG5BRRAB",
            "text": "My fav Izakaya around here!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMNzhzZkxCeHFiUlBnEAE",
            "text": "The place for hang out near home, the atmosphere is friendly, and the food is delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbnc0ZENydWFtT3h3RRAB",
            "text": "Takes me back to Japan with one bite. Tried the sake with jelly, good food, good vibe, and great service. Loved the fact that our bill came in a DVD."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQLTIwZnZuNU9xVUJ3EAE",
            "text": "A small place but it was packed that Friday night. I enjoyed the ramen and chicken bites.  Cash only, which limited our desire to stay longer and order for more. Good service. I can only wish they will have chairs for disabled persons."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMVEdvUG55NzRuTFNREAE",
            "text": "We’re repeat customers at this fantastic Izakaya Fuku. Today, I indulged in the Mother’s Day special Raman, which had truffles and mushrooms. It was absolutely scrumptious! I also ordered chachu as a side dish, which was surprisingly affordable."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLYXloSVRIMjRuamJBEAE",
            "text": "They don’t know how to talk with customer and the employee are so rude"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPaXcwcHFVN2NDWWxBRRAB",
            "text": "Love this place. Been here few times and always everything was great. Delicious karage chicken, great ramens etc. I really appreciate the authentic Japanese atmosphere you can experience in this place. Also it’s worth mentioning that they are closing at 3am so if you are looking for something to eat in the middle of the night then it’s a place for you!\nPlease note that despite it is Japanese restaurant they do expect the tip. (In Japan giving tips is considered rude) If you won’t give a tip or give very small amount the staff will approach you and ask what was bad with your order."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa28tT3VRRRAB",
            "text": "Awesome spot - the Raman Nana is a must have!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcWZQeE5REAE",
            "text": "Very cozy, small restaurant. Staff was great, authentic food, & loved the Ramen! Great late night spot if you're craving food. Easy to get to from LGA  also"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeThDcmR3EAE",
            "text": "absolutely delicious! i received a warm welcome and service was great. i did not wait long for my meal and the food was so yummy. definitely a new favorite spot!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dXFha01nEAE",
            "text": "명란크림우동 맛있어요"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eTZXOXVBRRAB",
            "text": "This is a really really good place from the silent traveler to all of you, be safe, be well, be open. Ladies and gentlemen this is a place that if you want to experience Japanese culture or just Asian culture. This is a good place to do that you're going to experience how modern culture meets the past. When you walk in the door you're greeted with a big smile. The food is really good and there's a TV that is showing the chef and how he makes each dishes if you get in the right position and you can see it. You scan your QR code with your phone and you can get the menu right there or they can give you a paper menu but the latest and greatest is in scanning a QR code. Very nice quiet and quaint place for couples families and really good gatherings. Why we were there we had a chance to really watch and experience friends come together and having a really good time and celebrating something. I highly recommend this place inside and out. They have great Ramen and other great choices as well so if you're in the area and you're in the neighborhood please check them out you cannot go wrong."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJODd5bFpBEAE",
            "text": "Everything was delicious and well-prepared. The dishes were flavorful and beautifully plated. The atmosphere was warm and inviting, and the staff were kind and attentive. Definitely a place worth coming back to!"
        },
        {
            "date": "10달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2N1BtWFpREAE",
            "text": "202412\n裝潢超可愛 廁所超超超可愛 整體感覺很用心的一家店 而且價格非常親民 鮭魚飯有鮭魚生魚片和鮭魚卵和炒鮭魚和玉子燒 只要$15.95！我們還點了蛋包日式炒麵$13.95 炸魷魚很香$8.95 生章魚$6.95 門口寫只收現金不過好像也能zelle 我們的帳單夾是分手信！如果住附近我真的會常常來外帶 好羨慕居民！"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaTdfZmRnEAE",
            "text": "Had this place on my list for years and finally made it. A very lively and bustling place. The food was decent. we ordered salmon carpaccio, karaage and a pasta dish. It was all delicious. servers were very very attentive. Highly recommend this place. CASH ONLY."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmc1pMQ0ZnEAE",
            "text": "I love that when you walk in the door, you’ll be automatically greeted by the staff and brought to your table. There are also hooks on the wall next to your table where you can hang your coat and belongings. If you run out of space, the staff will help you hang it somewhere nearby. The staff here are very kind, patient, and friendly. Definitely a plus already!\n\nHowever, the food could be better. We shared the following appetizers: Ika Sansai (squid salad with vegetables), Tako Wasabi, Karaage Chicken, Mentai Mayo Fries, and the Ponzu Tuna Tataki. By choice, I only had a small piece of the squid salad and the wasabi octopus because they weren’t that great. Both were too chewy so if that’s not your type of texture in food, maybe avoid them. The tuna tataki had excellent presentation but lacks a bit of taste… kind of bland. The karage was pretty good with a good amount of chicken and the lemon squeezed on top of the juicy interior was honestly the first thing I enjoyed here. The best appetizer we ordered though were the mentai mayo fries. That was definitely a favorite for the group! The fries were crispy, hot, and the paired with the mentai mayo was delicious even though I’m not a big fan of mayo (you taste more mentai than mayo here which was a big plus for us).\n\nSpeaking of mentai, we also ordered the Mentai Udon. Being a huge udon fan and since their mentai mayo from the fries were good, I expected a lot from this and was very very disappointed by it instead. This tasted like straight up mayo with noodles and I couldn’t eat more than a bite of this. I guess if you love mayo, order this? But you might as well put udon and mayo on a plate, mix it up and serve. Their presentation for this (and all their dishes) was pretty good though. The highlight was the bacon… when not covered in sauce.\n\nI also tried the chili garlic Hokkaido and the zuwaikani pasta (snow crab pasta). Both had a tiny but very welcome kick to it. The chili garlic one was overly sweet for noodles but one of us ranked this his favorite of the 3 noodles! The snow crab pasta was the most neutral of all 3. Came with lots of fish eggs and snow crab!\n\nI ordered the black garlic ramen to share because of all the recommendations to try it. I love garlic so I just had to try this. The ramen came with lots of mushrooms, 2 large pieces of char siu, scallions, and half a ramen egg. As this sets upon the table, all you smell is garlic! … but all you taste is also garlic. There was just too much garlic and after a while, it gets tiring, even for someone who loves garlic. Perhaps it’d be better if the black garlic came on the side and we could adjust it for ourselves.\n\nOverall, food was honestly very meh. 3/5. The service/atmosphere 4/5.\n\nWhen the bill comes, it comes in a dvd case which is pretty cute concept. This place is cash only!! Also, I’m not sure if they do this all the time, but gratuity was already included for us. It’s typical for restaurants to already have tip included for parties of 6 or more but we were only a group of 5. The staff here honestly should have said something. Usually staff at restaurants say something if they already include gratuity in the bill. Not seeing this, I included tip again… so read your bill carefully, people!!! … unless you want to give a 50% tip like I did and not realizing until hours later why the staff was so happy after the bill was collected… happy holidays to the staff!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2amZyUHNnRRAB",
            "text": "The best place ever. And such a hidden gem. Prim our server was the most amazing human.\n\nMy favorites were the kimchi, and the aburi salmon salad (I ended up ordering two).\n\nMy boyfriend got the black garlic ramen which looked beautiful.\n\nThe restaurant itself was fun, cozy, inviting.\n\nI already want to come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNy1IaTl3RRAB",
            "text": "Decent place for Japanese food in Jackson Heights. The deep fried appetizers are pretty good. The fried rice is delicious as well. Their steak is really tender! I don't really like the udon tho, isn't that impressive, and same with the don. This place is cash only! Good place for drinks given they open till 2 am and have a lot of drink and small dish options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqejRibGJ3EAE",
            "text": "We had a wonderful date night dinner at Izakaya Fuku. The decor is over-the-top retro and the classic rock was a surprisingly good fit. The beer was so fresh and went perfectly with the meal.\n\nWe shared the Tako Wasabi, Idago, Shio Saba Yaki, Creamy Mentai Bacon Pasta, and Ika Teriyaki. Everything was cooked perfectly and was so flavorful. The dishes came out in the right order, from smaller & lighter to larger & heavier. Service was fantastic - all of our servers were so attentive and kept checking in on us.\n\nWe're happy to make the trek (and bring cash) for fantastic & authentic Japanese izakaya."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcE1TYXN3RRAB",
            "text": "Nice, hole in the wall Japanese eatery! The staff are friendly and attentive!! Food is delicious- definitely comfort food! I only had 2 dishes: squid tentacles and whitefish- very satisfying! Washed it down with a large Sapporo!😄"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dC1xNGdRRRAB",
            "text": "Izakaya Fuku delivers excellence in every aspect. The menu offers diverse, expertly crafted dishes, showcasing fresh ingredients and culinary mastery. Service is attentive and knowledgeable, enhancing the dining experience. The inviting ambiance sets the stage for a memorable meal, whether for a special occasion or casual dining. Highly recommended for an outstanding culinary journey."
        },
        {
            "date": "10달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdE1QS1l3EAE",
            "text": "媽的最後一天才發現這家店 我直接衝出去爆吃\n到了門口發現 cash only 直接衝到下一個車站的boa領錢 花了15分鐘\n進去馬上就有位置 菜單和水也是馬上就來了\n雖然桌上有一瓶水 但店員小姐會一直幫你裝水裝到飽 服務頗優\n我點了一碗黑蒜豚骨拉麵和 high ball\n幹超久沒吃到黑麻油浮在上面的拉麵 超級爽快 屌打曼城所有店 high ball下去更爽\n如果早一點發現 整週基本上必須是宵夜天天光臨了\n最後外帶一盒章魚燒回家嗑 一盒六顆\n雖然章魚小了點 但只能說在美國可以宵夜吃到這麼好吃的章魚燒 根本爽死\n如果大家有機會路過皇后區 務必光臨這家居酒屋 實在爽快\n一人吃兩碗拉麵 一定爽"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdDZMVGxBRRAB",
            "text": "It's one of the best Izakaya I've found so far. It's a very small yet very decorated interior that feels like you're in Japan. The prices are decent for the delicious quantity of food. I ordered many dishes, and all were great! Every other Izakaya will be compared to this one."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdXJDX1ZREAE",
            "text": "Delicious and impressive Japanese restaurant with a lot of style and vibrant ambiance in Jackson Heights, Queens. We went to celebrate a birthday for dinner and it was nice and intimate, with interesting decorations and a nice soundtrack to boot. We had delicious onigiris, an Udon carbonara pasta (yes!) to really die for, the Omu Yakisoba which is an incredible omelette stuffed full with noodles that you can't get enough of, and grilled garlic steak which was very tasty. They have great service, and you can't beat the prices, though be warned: cash only. Give it a try! It's now one of our favorites!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeE1HR2tnRRAB",
            "text": "Finally got the chance to visit Izakaya Fuku and was very pleased with everything we ordered.\nThe food was good, the service was amazing, and the atmosphere made me feel like I was back on Japan. Will definitely be back in the future to try a few more things."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWaUxTVjlBRRAB",
            "text": "I wondered in with friends on Friday night, and was immediately greeted by the friendly staffs and incredible  of Udon Cabonara. The restaurant was filling up quickly but we managed to snag a table. We ordered Salmon Salad , Grilled Squids and so on, all them flavourful and yummy. By the end of the meal we were planning our next visit. ❤️"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbjRyTU1REAE",
            "text": "La atención es buena y rápida. Realmente me parece que el precio es justo porque los platos son de buen tamaño y la comida es de calidad. La atención de respuesta tras el pedido es rápido. Los precios son asequibles y tienen buen sabor. La carta tiene variedad y la cerveza es rica."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bjh1YnhnRRAB",
            "text": "This place is so cute! ❤️\n\nThe food was amazing the staff super friendly and accommodating.\nThis is definitely a must try location, and a must try everything menu.\n\nWe where seated right away and staff served us with nothing but positivity and gratitude 🙏\n\nDefinitely need to come back very soon!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNId3VqX293RRAB",
            "text": "Best ramen I have tried in Jackson Heights! My partner and I ordered the black garlic ramen and the salmon bento which were spectacular. Will definitely be back and will recommend to others!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBOXN5V3NBRRAB",
            "text": "Such a vibe. Here for a second date with a certain lovely lady. Love the artwork and decorations all over the establishment. I especially appreciated the retro arcade machines and the check that came in a blu ray disc box. Very nice touches for the ambiance. I was immediately distracted by the emotionally vulnerable Sam Smith music that came on and forgot what conversation was for a minute. Food also slapped, the bento especially was super cute. Although it seems like every date I've ever been on the girl can't eat raw fish. What the hell is this. Just get over it, sushi and sashimi are delicious. The spice of life, some might say. Regardless, a lovely time was had. I kinda messed up by not bringing cash. My bad. So I was forced to make her pay. I also embarrased myself at ice skating right after. They did start to play the Weeknd though so I locked in for that. Pray for me guys. It's been a tough week."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGaWN6cHl3RRAB",
            "text": "The food was tasty, but the music was very loud — it wasn’t an issue for me but the person I was with had a hard time hearing. The house sake was over warmed, so I’d recommend getting it cold rather than hot. The service was decent considering how limited staff was and how busy they were, and the two waiters were very kind and considerate."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd3BIUFNBEAE",
            "text": "Best place if you want to hang out with your friend at late night. Love the atmosphere, food was good and the decoration is unique"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwa3RpcEdBEAE",
            "text": "Izakaya Fuku is this cute Japanese restaurant run by Thai folks that totally gave me Osaka vibes. They only take cash, just so you know.\nI ordered the seared salmon – it was fairly big and tasty. Also had their kaarage chicken – so soft and perfectly fried. If I’m around Jackson Heights, I’ll definitely drop by again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNy1tZWV3EAE",
            "text": "Late night food shenanigans: at Izakaya, what more can you ask for? Walked in on a Tuesday night at 10:30 pm with my brother. Ordered a few things including takoyaki, chicken teriyaki don, karaage chicken, and omu yakisoba (latter two not pictured). Overall, filling but flavorsome dishes; small yet decorated interior. Servers were kewl and easygoing, for we had to visit a nearby ATM when we received our check (it’s cash only). Matter of fact, our checks were handed to us in a retro Jaws DVD! Love the quirkiness and I hope they continue to embrace that. Great spot for an after hours bite!"
        }
    ],
    "reviews_count": 74
}