{
    "name": "Taqueria Coatzingo",
    "place_id": "ChIJRR_EVgdfwokR9p-sd_XlkyY",
    "grid": "QN3",
    "address": "76-05 Roosevelt Ave, Jackson Heights, NY 11372, USA",
    "rating": 4.2,
    "user_ratings_total": 2080,
    "phone_number": "(718) 424-1977",
    "reviews": [
        {
            "date": "3일 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkU1dYRTRkVFpSVm1oMlNHeFZkazVFZFRaNmFIYxAB",
            "text": "Wow..! Que valor el que cocino la sopa de pancita de res no me explico como me pudieron servir esa sopa yo estaba por hechar las tripas del mal olor que tenia esa sopa eso fue un asco."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xObWFtWmZYMEpGWTNsVE1qZFNjMVZDUVZWT1YwRRAB",
            "text": "Dont listen to the bad reviews, they aren't true. This place is a great for mexican food, their tortas, truly amazing. I love it, iv been eating here for years and they still have that amazing taste."
        },
        {
            "date": "6일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pndExXMU5Oekk0V1hRdGJGaDNlVEJ5Y25oSGJWRRAB",
            "text": "Una excelente opción para degustar de unos muy buenos tacos. Tienen todo tipo de comida"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUVprb3RZWGR4WVhsWFpUYzFkVU0yTFd4Zk1VRRAB",
            "text": "First time here, got to try the carne asada tacos and carnitas chalupas, they were great! Juicy and tender. Our only issue was when we arrived there wasn’t any music playing for a while and out of nowhere loud music started playing which threw us off as we were sitting by a speaker. Will probably do take out moving forward because these tacos are definitely seeing me again."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sb1RsQkRVMEZHZUdoaVNtVXRZekZqUzFKNWRWRRAB",
            "text": "The meat was tender, the salsa verde bright and flavorful, and the atmosphere full of energy. Highly recommend for a genuine experience."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1QlFuWmFkbEJHYmpFMVNrMTRSRlZrTURSUFluYxAB",
            "text": "The team at Taqueria Coatzingo makes you feel like family. I stop by at least once per month for tacos. They are made to order and very filling. Three is my absolute max. I recommend starting with one or two. Do not eat the green chili pepper if you cannot handle spice."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ck5tTnpOemx5TnpCUU1XUXdOUzB4UTIxVlNFRRAB",
            "text": "The food is very delicious. The drinks slap and the service is speedy and attentive. Highly recommend this place. Came here last night and the place was PACKED!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKQ01FSlhaR3hhVnpOMVdIZDROVkphUlhVeWJsRRAB",
            "text": "Best ever Mexican food ate in Queens NY. I feel like I'm in Mexico every time I visit this place, the music, the service, and especially the food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214a1RIVnVWVE5vTVhsUVpXRjVOVkl4TFU1cWJFRRAB",
            "text": "I’ve been eating at this restaurant since 2007 and have tried many of the menu items throughout the years. This is my favorite Mexican restaurant in NY. I’ve tried several different Mexican restaurants and food trucks, and so far, this is the most authentic and delicious in flavor that I’ve experienced in New York. It reminds me of the hole-in-the-wall restaurants I’ve eaten at in Puerto Vallarta.\n\nThere are other Mexican spots in the area that taste authentic, but the quality and flavor don’t compare to this restaurant. The food here is very flavorful and excellent in quality! The way they season their dishes is just so good.\n\nMy favorite is the quesadillas mixtas with rice and frijoles (so creamy and delicious here). I also really like their horchatas, jugo de tamarindo, and their piña coladas—the perfect balance of sweetness and alcohol. My favorite piña coladas on Roosevelt Ave come from this place 🙌🏽. The consistency is spot on: not too watery, not too thick.\n\nThey also serve delicious nachos, salsa, guac, burritos, fajitas—you name it. Their complimentary salsa is my absolute favorite! It’s homemade, a little sweet, a little spicy, and absolutely delicious.\n\nI love this place so much that I’ve been a loyal customer for nearly 20 years."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBelRIbFNVRlIwVkRoMVJqVXRSeTEzWmpKVFZHYxAB",
            "text": "Este lugar asido mi lugar preferido en comida mexicana pero Pedí chilaquiles Rojos??pero son los peores chilaquiles que he comido"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dU1EUmxaVzVXWlhwdVIzRnBaREJKT0hoRFVuYxAB",
            "text": "Coatzingo Taquería is one of those places that truly makes a difference when you’re looking for authentic Mexican food in New York. From the moment you walk in, the atmosphere immediately transports you to Mexico. The entire decoration is fully Mexican, filled with details that make you feel as if you were eating tacos at a traditional market. That authenticity sets it apart and makes the whole experience so much more special than just going to a regular taco spot.\n\nThe food is outstanding. I tried several tacos, and without a doubt, the tripe taco was the best I’ve ever had—perfectly cooked, with amazing flavor and just the right texture. The al pastor tacos are also delicious, with a truly authentic taste that’s hard to find outside of Mexico. The guacamole has excellent flavor, fresh and well-prepared, although I did find the portion quite small compared to the $10 price. Still, I have to admit the taste itself was really good.\n\nThe service is another highlight. The person who took care of my table was attentive, always checking in and making great recommendations to make sure I had a good experience from start to finish. That kind of hospitality makes a big difference and is definitely appreciated.\n\nIf there’s one thing I would add, it would be Mexican music playing in the background. The place already has the authentic décor and amazing food, and adding traditional music would complete the atmosphere and make it feel 100% like being in Mexico.\n\nOverall, Coatzingo Taquería is definitely a place I recommend if you’re in New York and want to enjoy real tacos. The quality of the food, the unique Mexican atmosphere, and the good service make it worth the visit. If you’re looking for a spot that takes you to Mexico with every bite, this is the place to go"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TVJsZFFTbUp1WkRkRWFEY3lXblpIUkZacVUyYxAB",
            "text": "Camarones a la Veracruzana. Chex Quesadilla. And the Modelos Micheladas 😋😋😋\nFood. Drinks and Service. Thank You. Nos Vemos Pronto."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjc1p2dk53EAE",
            "text": "My last experience, the waitress gave me a lovely service, so friendly. Food is always good but El mole de olla no es lo suyo"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toYWJXeElUa1p6VWw5TE1WbGlaMEpGZFZvNVEyYxAB",
            "text": "First time here and it immediately became one of my top Mexican spots. I had the chilaquiles verdes con cecina and my husband had the birria con queso tacos and a shrimp taco. Complementary chip and salsa are top notch. Everything was amazing, we’ll be back very often."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNGREUnJMWEJDUW0welZFZDROek00TUd3NWRFRRAB",
            "text": "Un excelente restaurant en queens para comer"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJenVmaFVnEAE",
            "text": "(4.3/5 ⭐️⭐️⭐️⭐️) They are generous in portions and their sazón is good ! Def worth it ! Be careful confusing the spots as there are a few close to each other but not the same !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCM1gycEZObWhxYzI1T2FIUnFaelZwVkRocU5WRRAB",
            "text": "Excellent - Authentic"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toR2JXaHNhamRhYkRWcU1GZE5TbGxGZEZaWVMwRRAB",
            "text": "el servicio es horrendo lo recomiendo\nllegue a pedir una mesa\nme mandaron para el otro lado y tampoco me dieron mesa por que no tenian y eso que habia 4 disponibles\ntermine por sentarme en la barra y aguantarme el hambre e irme a comer otro lugar"
        },
        {
            "date": "3달 전",
            "language": "gn",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNFpHb3lha3hHWDE5ZloycExjMmhKV1hJNWVsRRAB",
            "text": "Late night lengua tacos hits"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKd1lXZzVNR3gwVXpWaVkyVlZlWEJHYTJKbVltYxAB",
            "text": "There are a handful of restaurants that are a must stop for me whenever I’m back in Queens and this place is heavily on my rotation. I’ve been coming to this spot with my dad since I was in middle school(now late 20’s), this place has a very special place in my heart. Everything is pretty homey, you can’t go wrong with most dishes. My dish here is four carne asada tacos but recently I’ve switched over to their Birria; their consume is so rich.\n\nI love this place, there’s many Mexican restaurants near by but this place is the best in my opinion!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWldWZHZZelZYYTJOd2VVNUdiMnBpY1hGeVdHYxAB",
            "text": "I want to start by saying that the food Taqueria Cuatzingo was absolutely amazing. Everything I ordered was fresh, flavorful, and authentic, -you can tell the kitchen takes the great pride in the quality of the dishes. I would return for the food alone!\nHowever, I was disappointed with the service during my visit. Unfortunately, the waitress who served me, had a very unpleasant attitude-she spoke in a condescending, almost confrontational tone, which made the experience uncomfortable. I don’t know her name, but she was working around 1:00PM on July 11. Service is an esencial part of the dining experience , and hospitality makes a big difference, especially when it comes to Tips and customer loyalty.\nI respectfully suggest that management address this issue. A great meal should be paired with a welcoming, friendly atmosphere. I’d love to keep supporting this business -and I’m sure many others would too- if the service could match the excellence of the food.\nThank you so much for your time.\n\nAffectionately,\nJohn Spinosa."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVE1VNXJlR1ZKV1hBMVJuaG9SRFZDUW1abVVIYxAB",
            "text": "I now understand why it's hard to get reservations here. The dishes showed unexpected finesse. The individual items are reasonably priced, though complete meals cost more. Most importantly, staff demonstrates authentic warmth. The complete visit offered consistent pleasure."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQmVHa3hVMk5aUTI1a1dWRkRkMjV4Wm5seWJFRRAB",
            "text": "Excellent food, great service, will be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbmlzYWY0cU1DMnBBRRAB",
            "text": "We had a great meal here. Delicious chips and guac to start, and some very tasty beef enchiladas with great hot sauce, and micheladas. My friend got the el pastor tacos and was raving about them too, but my portion was so generous I had no room to try hers. Staff were friendly and attentive and we would definitely go again."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKRzB2Y19DX2NuQ0RREAE",
            "text": "No estoy segura, pero definitivamente la calidad ha cambiado desde la última vez que vine. El pollo estaba tan duro que ni siquiera se podía comer. Estoy muy segura de que se dieron cuenta de que el pollo no estaba bien y aun así decidieron servirlo, no una, sino dos veces. También se equivocaron con el pedido y tuvimos que esperar alrededor de una hora por la comida. No volveré."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYlRuc1gtNDdMNzFRRRAB",
            "text": "Price wasn’t expensive. Food and drinks were delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNcm90ZFBsby1HNkx3EAE",
            "text": "Excellent!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOblJ1YnFKaWJYdDlBRRAB",
            "text": "Los mejores tacos de todo NY"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdmM0Y0NlX0lfRkR3EAE",
            "text": "La comida está  buena la atención es buena un lugar. Familiar bueno para comer cenar con la familia  pero la limpieza en los baños súper mala  y si que  le recomiendo este lugar para comer. Disfruten de sus platillos pero no vallan al baño"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS0JudDdPejhEMmd3RRAB",
            "text": "Excellent place ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKZWlsWVRBb1piWHFRRRAB",
            "text": "Love this restaurant"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLTd3TmJqNWZ2ZzJBRRAB",
            "text": "Muy buena la comida y la atencion 10 de 10"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYjZfOENzMXZxQTlRRRAB",
            "text": "love the tostadas"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURvbF90RhAB",
            "text": "Comida riquísima como siempre!! Unos de mis restaurantes favoritos. Tengan cuidado cuando les llegue el cheque las mesera se ponen automáticamente la propina sin dar nada de servicio más q tomar la orden y después aparecer cuando es hora de pagar no ofrecen ni un vaso de agua"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbnJpM1BBEAE",
            "text": "Best mexican place I've been to ever."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNUllQk93EAE",
            "text": "This is my favorite restaurant when it comes to Mexican food. I don't live near by but I've been coming here for years. The food may take a while to hit the table but the wait is more than worth it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaC1ibFRnEAE",
            "text": "Been coming here since 2011, great service and great food. Recommend the nachos texanos with carne asada. Please tip your waiters as well"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOGFyOTRnRRAB",
            "text": "Buena comida, buen servicio yo personalmente pedí la fajina mixta y me encantó y mi esposo ordenó los tacos de birria y estaban muy bueno."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOXUycWhRRRAB",
            "text": "The best tacos and quesadillas I tried so far in New York 😋🌮"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeU42bXRRRRAB",
            "text": "Nice place to eat mexican food. And a Michelada beer."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaXNxR05BEAE",
            "text": "Fui a comprar una pansita grande y Me dieron una pequeña y me cobraron como una grande"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN0xpVUhBEAE",
            "text": "I recomend to try the Molcajete dish it's the best👍"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NUp1RnVnRRAB",
            "text": "Mucho mejor !que el legendario tacos méxico"
        },
        {
            "date": "수정일: 7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneDc3aGpRRRAB",
            "text": "Un lugar para ir con familia o sin o con amigos.las meseras muy amables profesionales.y la comida ni que se diga las cemitas los tacos y mucho más se los recomiendo Amis amigos y familiares ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dWZiTV9nRRAB",
            "text": "Yummy tacos"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dEpMVnJ3RRAB",
            "text": "The food was great. Their Tacos de al pastor always hit.  The service is alright. Not the greatest. They could do better. Now one thing about this place is that they don’t tell you about the 20% service fee. No where in their establishment is it placed. Not on the menus, the walls or even on the receipt. I mean if the service were to be good I get it but it’s not."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbzl2OGhnRRAB",
            "text": "The worse chicken pepian ever they gave me left overs bones and I spoke to the manager. He said he mentioned to the kitchen not to do that again hahahaha… I work in the industry and Im glad he is not my manager. What a shame with the guest."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndmVLRmRREAE",
            "text": "Food was amazing and the staff was friendly & extremely accommodating. I will be returning soon!"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVd09laDdBRRAB",
            "text": "맛있는 로컬 음식점.\n장소가 꽤 넓고 운동경기 시청시 좋을듯."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5ZzhYMkpnEAE",
            "text": "Ordered the mixed enchiladas platter, a red beef soup, and 2 tacos. The enchiladas hit a craving I’ve had for a while. I feel like a lot of places in NYC don’t do them right, this place does though. I found them to be delicious. Red sauce is better than green sauce. The soup was also really good, very flavorful and spiced well. Something I’ve never had before!\n\nTacos were alright. Not the best I’ve had in NYC, but were decent. I think too much guacamole… and I love guacamole.\n\nFree chips & salsa at the start, good salsa too. Try something you’ve never had before on this menu, you’ll surprise yourself."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydmRQV1BBEAE",
            "text": "I enjoyed my soft tacos here, shrimp, pig ear and beef tongue-could’ve been more tender in a melt in your mouth way but some parts were a little tough. The pig ear was best!\n\nLarge restaurant they a have space you can probably close off for private events. Attentive and efficient service.\n\nThey allowed vendors in which was annoying. That is the only thing that ruined the atmosphere for me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEd3ZEQzhBRRAB",
            "text": "Lunch here was a bit of a mixed bag. I do like the fact that they bring out complementary chips and salsa as you order - though the salsa was a bit sweet for my taste. The two tacos I ordered - carnitas and carne asada - were also decent. But the flautas were where they really failed - the chicken was dry and lacked flavor and the tortilla shells were not very crispy. I can’t say anything about the rest of the menu but best to avoid the flautas."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NHJxRHFnRRAB",
            "text": "The food was really good. We ordered chilaquiles and tacos (carne asada, pastor and birria).\nI would definitely be coming back. My only feedback would be to keep the music going to enjoy the atmosphere. Other than that, pretty decent prices and the food was delicious 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMGRIZ1lnEAE",
            "text": "Everything is awesome, from the free nachos and to the entree. Portions are big. We ordered 2 entrees for 2 people. We can't finish it. They have a bar, and seating are plenty. From the outside, we thought it's going to be a small restaurant with 15seats but when you go to the side of the resto, they have many more seats. Food was delicious."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRak4zRU1BEAE",
            "text": "In the last 4 weeks i have been here a handful of times. Tacos are always amazing here. Chips and salsa are okay. Nachos were served in huge portions. Service staff are always nice and smile. They expanded on one side and i recommend getting a seat in the new expanded dining area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdXNTeEdBEAE",
            "text": "Great food, generous portions, I loved that the tacos come with the guacamole. It was so delicious. There was so much variety on the menu. The service was great, very attentive and friendly staff. The only downside, from my experience, was the music was a bit loud so it was difficult to have a conversation. Besides that, the food was great. Definitely a family friendly restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNWJEQ2N3EAE",
            "text": "Amazing tacos amazing flavor welcoming service all the waiters with a big smile & excellent customer service, very attentive! Had chicken, al pastor and beef tacos, full of meat & flavor and toppings onions cilantro guacamole, they even give you chips and salsa as soon as you walk in! Definitely one of my new favorite taco places when I’m around! If your around, don’t hesitate I promise you won’t regret it! Ps they even had authentic Mexican coke, that wasn’t flat and actually made in Mexico 10/10 recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdHI2Tk53EAE",
            "text": "I love this place! I ordered birria tacos and it was delicious!! There were also free complimentary chips which were addicting, and the service was incredible! Muy delicioso!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaTVQOWRREAE",
            "text": "Standard Mexican taqueria with friendly service and delicious food. We got chalupas and mole poblano. The rice and beans were nicely seasoned and delicious just by themselves. The portion sizes are also big here."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSejZlbzF3RRAB",
            "text": "La comida es buena, fuimos todo la familia, probamos sus diferentes platillos, me encantaron sus tacos y su horchata, el molcajete viene con muy poca salsa, muy seco para mi gusto. El servicio fue más o menos, tardaron mucho con las…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3N3BxQ053EAE",
            "text": "At 10:00 I found myself hungry in Jackson heights. I chose Taqueria Coatzingo because it seemed friendly, and was pleasantly surprised. I chose three tacos, which were all terrific. The Birrieria meat melt in my mouth, and the sauce was delicious. The camarones were cooked well and very tasty. The star of the meal was the Orejas. I’ve had them at other places, but this one was a step above. The texture was spot on and the flavor was super. The service was great, and while the place was quite empty, I can tell it has a great atmosphere. Will definitely come back."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMXRDbkJREAE",
            "text": "Justamente ayer fui con mi amiga a comer algo tradicional de Mexico; Guaraches. Valla que desepcionante: la tortilla bien gruesa, parecía tortilla para tlacoyos, la carne se supone que era de carnitas y sabía a res, no me gustó para nada, aparte de que se tardaron muchísimo, y trajeron los platos bien sucios (huellas en ellos platos) queríamos comer algo rico y mexicano pero en vez de eso fue un gastadero de tiempo para recibir algo no sabroso y platos sucios.\nCreo que el mariachi está bien pero son demasiados ruidosos.\nNo recomiendo este lugar, quizá valla en un futuro a ver si las cosas mejoran. Saludos 🫂."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOcGFhLV93RRAB",
            "text": "To be honest i wanted to have some crispy tacos\nAnd i got disappointed when they told me they only have the soft ones\nBut the tacos were yummy\nThey also serve completely nachos👌\nYou can try out\nIt also have a bar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOGNDYlZREAE",
            "text": "The chips and salsa are hands down one of the best I’ve ever had 🤤 I can’t stop eating! I found myself keep returning for their chips and shrimp tacos. Oh the tacos… they’re fresh made! Imagining hot shrimps with cheese and guac… yum😍"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMHBuR053EAE",
            "text": "La comida y el servicio son muy buenos las meseras son muy amables.  El único problema es que dejan entrar a los vendedores ambulantes y uno quiere disfrutar su lunch tranquilamente pero a cada rato entran personas pidiendo que les compres algo, y aunque quiera uno ayudar a todos pues  no se puede."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cU9YMkx3EAE",
            "text": "It's the biggest torta portion i have ever gotten, pay an extra dollar or two for mexican cheese. Very flavorful torta. I got two tacos, chorizo and carnitas, both delicious. Ill be back to try a new dish"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbE55dHJBRRAB",
            "text": "Tacos were all very good and tasted very fresh. Family friendly spot"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbmNHdmN3EAE",
            "text": "Hands down the BEST shrimp tacos I’ve ever had in New York. Such a fun vibe - we enjoyed our spicy margaritas and the al pastor tacos were another big hit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNFkyaU5nEAE",
            "text": "Best Mexican food in queens! This place is super authentic. Delicious and fresh every time. My favorite tacos are the carnitas. I highly recommend!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSX1ByVVpREAE",
            "text": "Stopped in here for some tacos and I was surprised. I ordered 3 shrimp tacos, and these were delicious. They had plenty of guacamole, the shrimp was so fresh and it had a nice kick to it with some spiciness. If you’re in the are these tacos are a must try."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVekp6bmV3EAE",
            "text": "The food here was good with huge portions, what I really couldn't get over was the huge grade pending sign I was staring at while I was sitting down.\n\nI didn't see the sign because we weren't into one entrance and didn't see it but then were sent to the other side where the bar was and that's where I saw the sign\n\nThe waitress got my sister's order wrong. She asked for 3 tacos and 4 were brought out. They wound up taking the 4th one off the bill because we never touched it. I ordered flautas one chicken and one steak.  The steak was way too tough. The chicken was better.  It was very spicy from the salsa verde but I love spice.  The salsa & chips were good too & so was my mango margarita (frozen)"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3M1pQaDFnRRAB",
            "text": "Colorful and casual Mexican spot, with a good range of traditional Mexican fare. Chips and salsa were immediately served on arrival and I ordered a torta which was large and delicious. Only downside is I would say the service wasn't particularly friendly or attentive."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxeVlYMVdnEAE",
            "text": "I love this place. Authentic Mexican food at reasonable prices. I ordered birria tacos and a limonada to drink. Complimentary totopos and salsa were included. Service was quick and friendly.  The limonada was perfectly refreshing. The birria was plentiful, seasoned well, and delicious. I will go back again and try other options."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NEkzRktBEAE",
            "text": "Good Restaurant the food it’s so delicious & prices are ok 😎 this restaurant was closed for 4 months for renovations but they don’t even touch the Bathrooms 1 ⭐️ BATHROOMS…"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDbW9LUHZRRRAB",
            "text": "Comida típica mexicana la cual es excelente, gran variedad de platos. Recomiendo los tragos y jugos. La atención es muy buena. Recomendados 100%."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5cGVEVWxRRRAB",
            "text": "One of the best tacos al pastor I’ve ever had. Fully stuffed taco too. I’d recommend getting 4 if you really wanna be satisfied."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzcDhydG1nRRAB",
            "text": "Authentic and delicious. This was our second stop on a four restaurant self guided food tour of Jackson Heights so my only regret is that I had to pace myself. Really wanted to try the Cemita since it's Pueblan food, so will have to come…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbXBHNE13EAE",
            "text": "The tacos are amazing! I love how fresh they always taste. The meat is never hard and dry. We just tried the burrito for the 1st time because the tacos always are ti die for. The burrito was so good. Very filling."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2c0puaFZ3EAE",
            "text": "The first I went for lunch, and the tacos were amazing, and just having two was so filling. The meat was juicy, the tortillas perfectly soaked in fat, and everything tasted fresh. However, the tacos in the evening were not nearly as good, and other things were a mixed bag: the quesadillas weren't heated up thoroughly, so the cheese wasn't melted; I didn't care much for the beef cemita, especially the bread. The staff was friendly and attentive. Sometimes they play the music way too loud to talk."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MHZ6QTZnRRAB",
            "text": "La atención de Daniela Trejo fue maravillosa, la comida es deliciosa pero definitivamente voy a volver por su atención. Vinimos a celebrar un cumpleaños y fue muy atenta, nos atendió con una sonrisa , muy organizada y muy atenta."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeUtQWC1RRRAB",
            "text": "Estoy muy decepcionada con el servicio. Lo cierto es que la comida es excepcionalmente buena y no tengo ninguna queja respecto a los cocineros. Sin embargo, el hecho de que la mesera intente aprovecharse de la gratificación incluida en la cuenta es muy sospechoso. Comprendo la necesidad de dejar propina, pero esta es la segunda vez que exageran con la gratificación. En esta ocasión, mi esposo y yo fuimos a tomar dos cafés y un desayuno; en ningún momento se acercó a preguntar si necesitábamos algo más y, cuando lo hicimos, no estaba disponible. Tuvimos que pedir a otra persona una coca-cola y dos tacos. Al final, nos entregó la cuenta con un 20% de gratificación, cuando solo éramos dos personas. Espero que el gerente lea esto; tal vez necesite aumentar el salario de sus meseras. Simplemente siento que es una cuestión de principios. Gerente eduquen a sus meseras que en el estado de NYC si son dos personas comiendo NUNCA se debe de poner gratitude. NO SE DEJEN ROBAR\n\n*****8GENTE REVISEN SU RECIVO *****"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLOGQyaHpBRRAB",
            "text": "AWESOME TACOS! Highly recommend checking out. Also the yummiest marg I’ve had in my whole life!"
        }
    ],
    "reviews_count": 82
}