{
    "name": "Mama's Empanadas",
    "place_id": "ChIJL1V8-qNfwokRWAknhvPbZCo",
    "grid": "QN3",
    "address": "85-05 Northern Blvd, Jackson Heights, NY 11372, USA",
    "rating": 4.1,
    "user_ratings_total": 2183,
    "phone_number": "(718) 505-9937",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tob2NYRlhjVTFtVEc1S1FpMWFjVkV5YWkwMGFuYxAB",
            "text": "Delicious. Pernil empanada was delicious. Right amount of saltiness you want in pernil but still juicy. A 10/10. The green sauce exceeded my expectations. Price was reasonable as well."
        },
        {
            "date": "5일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdGVsSkxlVFZJWWtsNFFVNHlaRkpVYW1STmQzYxAB",
            "text": "100% RECOMENDADO atención de primera"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WYVRGaE5Sa3RFT1hGUGMzQnVXbVJYUlZCdlJYYxAB",
            "text": "I have made 3 orders through the Grubhub app and all 3 have had to be cancelled because the delivery never arrives and you call the store to find out what happened with the order and they never know what happened.I have made 3 orders…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MmNDMW1SbVZtWTB0RU1IcHFZM1kwY1RGSWEzYxAB",
            "text": "Almost charged me for an empanada I didn’t even order, glad I know to speak up for myself, worker at the front gave attitude too.. over YOU mishearing?"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbGVHWkthemhYYldWdlRFOVVPVFJUVldoeU1XYxAB",
            "text": "Cheeseburger empanadas🔥🔥🔥🔥"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeWVFNVlRMDkyY1dReU1XNUVWMEZvWjI4M1dGRRAB",
            "text": "I have been coming here for over 10 years I went away for less then a year and they have a new worker that is so rude I saw her on Saturday was so rude and now today they have to close on a Sunday at a certain time I was early by 30 min running from work to make it so I can get some food and she already closed but a uber eats order got there food after I complained the uber eats got stuff she runs off the lights when I had over 20 min left until they had to close"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKb1FWcDBSV2hPUzJ4d05VZE1iRXBpYlhOeFltYxAB",
            "text": "Las empanadas de carnes muy saladas el relleno ademas la atencion al clientele es pesima"
        },
        {
            "date": "수정일: 4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSWMyY3pWVmxTY25CYWFHWllZM0JpTkdzMkxWRRAB",
            "text": "Muy buenas"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGb1h6SjRZMlZ2VGxGTllsQkVPWGd0TFd4TU1sRRAB",
            "text": "What’s not to love about the original Mamas Empanada spot in Jackson Heights.  This place has been here from the start and has lasted the test of time.  Same owner with his mother’s recipes.  A lot of copy cats in the area , but this is the original spot folks.  Also, the spicy chicken baked empanada, is my all time favorite.\nCorrect address is 85-05 Northern Blvd."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeVZqbERUV1ZZVFRsNVdFUkVRMFZDVmxaaVNtYxAB",
            "text": "Pernil empanadas are"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bFZGaFlkM0oyTmt4SVZFMUxjbWhEV0UxT1IxRRAB",
            "text": "las empanadas super ricas pero el servicio al cliente pesimo con esos animos le quita la gana de comprar a uno si no les gusta el trabajo deben de buscar otro que les guste porque con ese servicio pierden clientes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201R1VtUnVWa2RRTFhFMVExTkliSEF3WTJSUlEyYxAB",
            "text": "Terrible customer service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSV1Qwd3ljMjgyWjNsVWFrMXpjbEYzUldoQ2FXYxAB",
            "text": "Great quick stop for food.\nThey have a very big selection of empanadas."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVFMzcGFVVkpuUmw5MFEzY3RhbE0zVlRnd2JYYxAB",
            "text": "The food is absolutely amazing but be on time.thank you so much I appreciate you ❤️ 💗"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twc1QyVk9YMEZwVEdaQk1EaERXSGRVVjNkeExXYxAB",
            "text": "Great service and good food"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVFVWSlFlbUZaUkdseE9UWXpOQzFTTkd3eVZHYxAB",
            "text": "Las chicas de el marter alrededor de las 11 de lanoche ..12 de agosto 2025..\nMuy mala atencion y te deja esperar mas de 25 minutos para ordenar , con mala cara y mala actitud..me gustaría subir fotos pero soy respetuoso..si me las piden las subo..gracias por nada.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVlQyRkliVnA1UW04eFIwTXdjMUJNUzA1aU1GRRAB",
            "text": "Love the pina coladas & ham and 🍍"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0T1ZscFZkWEI2WjJGbVdqQmlWa0ZsUW10VFgxRRAB",
            "text": "Las empanadas allí son riquísimas y los precios son bastante razonables. Adicionalmente trabajan hasta la madrugada. Entonces si tienes un antojo ese es el lugar perfecto"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWllVeE5WSEJYYVdReVRYTjZUbXRvTWtSaVZVRRAB",
            "text": "I've been coming here for years and years, and they're always reliable. The empanadas are great to feed a large group of people. They're great when you're coming home from the bar at 2 AM. Seriously, I'm thankful for this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeVFqTTVSbGh6ZEV0M1EzUlFOR3BZVFhCUmFHYxAB",
            "text": "Location can use interior improvements"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSamVIUjFjVEl5UzJGcU0zcDJjQzFPWDJoMFRtYxAB",
            "text": "I stopped by Mama’s Empanadas and left super disappointed. I ordered a chicken empanada and it was basically just mashed potatoes barely any chicken at all. The “ají” they gave me was more like a watery fake guacamole, not even close to the real thing.\n\nThen came the worst part: my total was $5.33 and they refused to let me pay with my debit card, claiming they have a $10 minimum. I told them that’s illegal in New York, but they didn’t care at all. I had to pay in cash and reported them to the city.\n\nDefinitely won’t be coming back. Bring cash and low expectations if you do."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVlJIQXRTRFpWVEVGTE0yOVlWR2sxTUVka2FrRRAB",
            "text": "On Jul 25 2025 Between 2:45p-3:25p I order with the second to last review 110% very tasty food but the cashiers specially a dirty blonde employee was very obnoxious and unpleasant with a cutthroat attitude.\nHad Me waiting over 30m for my order of 6 empanadas when I was told before it was a 14m wait time.\nWhen 25mns passed I decided to ask the dirty blonde cashier the status of my order she turned her back at me and said I had to wait a little longer, meanwhile there was other customer that placed there order with her at the cash register and got there order sooner in less than 12m.\nI won't be coming back to this place ever again nor recommend it to anyone."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQ1Z5MWlNM2haUWxaaWRFNUtPRkpaY1ZoVGVsRRAB",
            "text": "no paaa nada , es pura grasa, no comestible"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNGIyOVpWRUV3UXpVdGRXaFpSMVkxVTBOaWVIYxAB",
            "text": "Excelente sigan así"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MWJpMU9PRUZ2VW5Kc2NVUkVZVXBJWXpkdmVsRRAB",
            "text": "Us in lugar muy hermoso para disfrutar comiendo unas ricas empanadas"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reVRGbFBhazFhUWpGcVgySjBURUZIY2poU1QzYxAB",
            "text": "IF I COULD GIVE ZERO STARS I WOULD! The cashier is extremely rude and has a nasty attitude that steers away customers ! I have been coming here for years and never had a problem until her. They took 30 minutes for 3 empanadas. She needs to learn customer service rather than telling a paying customer to not come back. Overall she’s a Bad look for the restaurant !"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSFMxTjFSRk53WkhkRmIzcHJOa3BCYkhaeGNtYxAB",
            "text": "me encantan las empanadas de trigo pero las cajeras con una actitud bien groseras ojala el dueño aga algo por lo que veo muchos comentarios negativos"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WM2IzVjBTMDVaVmpsUGFVRjJNVU5vYUd4RFMwRRAB",
            "text": "They need more staff to get orders done fast and efficient. I waited for my order about an hour it’s not good for business"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTE1pMXdlR0l0T1ZJMk0zUkJaVU5OVmxscllXYxAB",
            "text": "Worse customer service , employee geraldine have a really bad customer service , she had a nasty attitude, I made and order and they gave me 2 sauce , went I told her that to include 2 from both . Then I try to pay the .50cent and she…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KeVN6STNjM2xDYTJ0WVVUUmZjWGRWZWpKUFpuYxAB",
            "text": "The store does need some renovations, but the food is amazing. Best empanadas in all of queens"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210d1dGQkdXRGRQVUhSSmEwZEhNM0JuUjFvNFYzYxAB",
            "text": "Las arepas son muy feas la salchipapas muy disgustado la verdad no lo recomiendo mucha papá poca salchicha las empanadas es solo masa nada de carne ni nada sin sal muy duras lugar un poco sucio y desordenado gracias por favor estar más atentos a sus preparaciones y órdenes"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeFVuSnRRMDlOVFc5SGFHZGhUM0JmVEZKTFVXYxAB",
            "text": "Lastimosamente las empanadas son muy ricas pero la atención es PÉSIMA. Las empleadas son más preocupadas por estar hablando de su vida personal que por atender."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSM1IxWnRTV3h5TVZkclNWUmlaalpsV1daRlltYxAB",
            "text": "Always good for a quick fix. Variety provides good options to choose from."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KR1p6UmFOMnBWYkVkeFdYaGhTRUkxT0dWTVpsRRAB",
            "text": "We just moved into the area and walked into this place for the first time ever on June 18th, 2025 and this is exactly what happened:\n\nI see the \"Egg, Spinach and Feta\" option right on the top left corner of their menu, posted large on the wall. I ordered two. 10 minutes later I got the order. As I bite into it, I see that I got eggs, meat and yellow cheese. No spinach. No feta. They clearly gave me wrong empanadas, but hey, things happen, not the end of the world.  I was in a little rush and the food was tasty, I decided to just finish them and go, which I did.\nThat evening, I told my wife about the place, how incredibly tasty their empanadas are, even though I got something different from what I wanted. We decided to go there for an afternoon snack the next day.\nOn June 19 we walked in there about 2pm and the first thing I told them was: \"Yesterday, I ordered Egg, Spinach and Feta\", but instead I got Egg with meat and yellow cheese. I'm guessing they gave me something from your breakfast menu, which is absolutely fine, it was delicious anyway. So today I really want to get Egg, Spinach and Feta, do you have that?\" The ladies (2 of them, one of whom took the order from me the day before) tell me: \"Yes, we do. It's spinach and mozzarella. Is that what you want?\" Both me and my wife assumed that they mean \"yes, we have it, but it's with \"mozzarella\" instead of \"feta\" and I answered \"yes, please, can I have 2\". After that my wife chose another 2 and we ordered. We were planning to get some Starbucks later and eat the empanadas with coffee, so we took the order in about 5 minutes and left.\nLong story short, in about 45 minutes I take a big bite into one of my empanadas and it has ZERO eggs, only spinach and mozzarella. I threw it into the garage, took the other one and came back to the restaurant. I see the same lady who took my order, give her that one empanada and I ask: \"Excuse me, I got the wrong thing again - do you have the actual Egg, Spinach and Feta option?\" Her first response is: \"Oh no, we don't have that\", to which I responded: \"But it's right there, on the top of your menu\". The second lady steps in and goes: \"Yes we DO have it, but did you ACTUALLY say EGG, SPINACH AND FETA or just \"spinach and cheese\"?\", to which the first lady adds: \"I specifically remember repeating the order to you and you said \"yes\" to \"spinach and mozzarella\"\". At that point I was so flabbergasted, I just said: \"No, for 2 days in a row I keep ordering\"EGG SPINACH AND FETA\", but keep getting the wrong thing over and over... Can you please fix this?\" The lady ignores me again and goes \"Well, I remember repeating the order back to you and you confirming to me, but ok, we'll fix it...\"\nI wait for about 5 minutes and the lady gives me ONE empanada. As I take the bag, I ask: \"Why just one, I don't understand?!\", to which she replies \"That's what you returned to me and that's what you get\". Obviously I am upset and I go: \"So for two days you keep taking my money, getting my orders wrong and you have the audacity to give me ONE supposedly correct type of empanada at the end?!\" Her reply - \"Well, you ATE the other one!\" Me - \"No, I took a bite, realized that it was a wrong one AGAIN and threw it in the garage, I wouldn't bring half eaten food into the restaurant, it's disgusting. I brought you the other one so you may see that it's the wrong type.\" Them - \"Well, you should have brought it. That's what you get. If you have a problem, call the number on your receipt and complain there!!!\" Then both of them literally, PHYSICALLY turn their back towards me so I will stop talking to them and leave...\nI left the \"replaced\" empanada on the counter in front of them and left the restaurant completely humiliated and bullied. They made it look like I was trying to hustle them for free food in front of all the people in the restaurant...\nBy the time I got home I was shaking. My wife went back there to confront them and they admitted that they mishandled the situation, offered empanadas, but of course she refused. WE WON'T BE BACK. EVER."
        },
        {
            "date": "수정일: 4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3M1o2V2hnRRAB",
            "text": "I love mama huevo empanadas."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMZlNuTUxObFBIZEdREAE",
            "text": "No dan buen servicio llamo  para ordenar y no contestan platican mucho muy mal servicio"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNaXl0LTNsb0pfLUlnEAE",
            "text": "Long waiting, not organized, placed order and was incomplete last time.\nEmployees has not patience..."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYXk2c18zdTY2Y0NnEAE",
            "text": "Deliciosas las empanadas la de pollo muy buen sabor y estaban llenas al igual que la hawaiana y el precio está excelente"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQeUM3dE9oMExHdTdBRRAB",
            "text": "Lugar tranquilo con rica comida"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNN042S0hJdlozUC13RRAB",
            "text": "Pesimo servicio. Las cajeras no son amables y me dieron la orden mal. Siempre con mala cara y una energia pesada en este lugar y sus empleados. Me dieron una orden mal y pregunte porque y me respondieron de mala manera. Pesimo servcio, pesimos empleados. Horrible lugar."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOcWF3WkRybmV5YXZnRRAB",
            "text": "La atención es pésima  las  muchacha que contesta el teléfono es súper grosera y no tiene nada de educación no debería tener esas personas atendiendo a los clientes lástima porque las empanadas son ricas. Y como si no fuera poco mi esposo fue a recoger las empanadas y lo dejaron hay parado no hay atención"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQdWc0SnZGcDZIcTFnRRAB",
            "text": "Food was good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLLW5wUDJlc3JpTWJnEAE",
            "text": "It gets better every time."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPLTQ0czd0b3Z1cENBEAE",
            "text": "Five star food prices are a little high but the food is amazing"
        },
        {
            "date": "수정일: 6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOGVmSWxRRRAB",
            "text": "Por muchos años he comido empanas de este lugar me gustan muchos sobre todo la cubana la hawaiana y la de jamon con queso. Los tamales son deliciosos"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvczRtODlBRRAB",
            "text": "Great Empanadas.  Get Empanadas hot and eat right away.  Delicious."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJZ3ZqSjV3RRAB",
            "text": "Todo muy delicioso"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJZ0xqMDNBRRAB",
            "text": "Nasty kitchen"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdE0tMGhBRRAB",
            "text": "Don't bother going there. Customer service - 0. Empanadas - Expensive and you can find better anywhere else.\n\nMy order was wrong. I called to get a refund. The girl who picked up the phone was very condescending, like I would lie about a $2.80 empanada. She said she needs to see the wrong empanada. I asked if I can send her a picture of it. No. So I took the 40min ride back, only because she was so not accommodating and to prove my point I guess. I go there and both girls there wouldn't acknowledge me. Not even eye contact. They didn't want to deal with me? Anyway, I tell them why I'm there. They take the wrong empanada to the back, no apologies no nothing, and they tell me it's going to be 10min. What? But I want a refund. I don't want another empanada. Oh yeah. They don't refund your money if you paid with a card! Only when you pay with cash. They could have mentioned that when I called maybe?? What's the point of charging you a fee when you use a credit card then? It will cost them more if they reverse the charge? It seems the management is super cheap.\n\nOh, and there was an eyelash in the filling in one of the other ones. I didn't even bring it up to the girls because I knew nobody would believe me. Whatever. Just don't go there! I won't and I'm telling everyone I know not to as well.\n\nPhoto: I ordered 4 mushroom and 2 vegetable. One of them was chicken and I don't eat meat.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdjdPZXd3RRAB",
            "text": "I recently ordered about 10 empanadas from the Northern Blvd location and, honestly, I only remembered to write this review when I was down to the last two! There are so many delicious options to choose from, it’s hard to decide!\n\nThis spot can get really busy depending on the time of day, and finding parking can be tricky—you might end up double-parking to grab your food. That said, it’s definitely not as much of a hassle as the Steinway location.\n\nOne of the best things about Mama's is that they’re open late until 2 AM, making it the perfect place for a late-night snack or a quick bite after a night out with friends.\n\nIf you're a chicken fan, I highly recommend the Chicken Parm empanada. For beef lovers, the Cheeseburger empanada is a must-try. And for a delicious meat-free option, the Plantain and Cheese empanada is fantastic.\n\nPlus, their prices are quite affordable compared to other locations."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdzhIblBnEAE",
            "text": "Love their empanadas, the beef with potatoes 🤤😋 I always get combo #2 4 empanadas beef and potatoes and 2 chicken and it's slamming with the gingeralle"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbGNlempnRRAB",
            "text": "Nothing beats coming back to the old neighborhood for a plate of killer empanadas. The Hawaiana is an absolute must-try – sweet, savory perfection. The espinaca con queso with their signature pink sauce? Spot-on. And don’t even get me started on the cheeseburger empanada – simply delicious!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNX3FQY0NnEAE",
            "text": "Ugh this spot is such a gem, I can’t get over it! The food is delicious, so affordable.. the Mac and cheese and Hawaiian empanadas are so bomb!!! Perfect for a late night snack or munchies! They also sell frozen ones to cook at home!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eWRIMUZBEAE",
            "text": "Absolute best place for empanadas! We live at least 40 minutes away so whenever we are in the area we always like to pick up some just to have at home. There are so many flavors to choose from, the prices are excellent and the green sauce (spicy) is our favorite. Hands down our favorite empanada place, everything is always fresh and delicious"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1NE9XWE93EAE",
            "text": "Small spot with big flavor! I stopped by on my way home, who doesn't love empanadas. I do!  First there is a wait,  and we'll worth it. I had the 8 empanadas special, mixed with beef, chicken, and broccoli and cheese..WOW. who know broccoli would taste better in an empanada. You need to try these they are crunchy and delicious,  also get the red melon juice, with real pieces of melon!!! Def stopping by again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cnVXdHhRRRAB",
            "text": "1 of my favorite empanada spots lots of flavors to choose from and made fresh to order and don't forget that green sauce..."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwODRILTBnRRAB",
            "text": "Ordered the Arepa Pernil. A little heavy on the salty spices but overstuffed.\nCarne molida maiz shell very good. My favorite thus far.\nPollo Trigo whole wheat empanadas!! EXCELLENT!\nNext time I'm going to order all Trigo!! Not oily....perfect filling."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZdWFfTHpRRRAB",
            "text": "Great spot to grab food at anytime of the night (24 hours). They have a wide variety of empanadas that will have you wanting to try them all. They taste very fresh as if they were just made and I love that. The service is good as well. I’ve been here a good amount of times and I’m not tired of them yet, always taste like the first time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMkplWnpBRRAB",
            "text": "Great spot to pick up a quick corn or wheat empanada or an arepa (pictured). We got the #1 meal, pulled pork arepa and 2x of the sauces and it came to $14. Can’t beat the value."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHODVUOWlRRRAB",
            "text": "The worst experience ever , I placed my order over the phone and paid , once I got to the place ,I ask for my order and employee ask right away for my ID and card , left my stuff in car because it’s hard to find parking around the area,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURob05yUkxREAE",
            "text": "If you’re looking for a late night bite to eat, Mama’s is a pretty good option. HUGE selection of empanadas, savory and sweet.\n\nDefinitely recommend getting an assortment. Chicken fajita, cheeseburger, and the USA dessert empanada are all great options."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrbTgzTVB3EAE",
            "text": "The most authentic empanadas you will taste in NYC. Definitely worth the trip to queens to try them out. Order the beef (no potatoes) + green sauce and the Guava / cheese 😋…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpOElMd2pRRRAB",
            "text": "I love this place I think it has 50 different varieties of empanadas you have to try it the pork cheese steak ham and cheese cheeseburger are some of my favorites"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxOHFTVGh3RRAB",
            "text": "Ordered on uber eats, food was hot and tasty. I like how they’re not greedy with their amazing green sauce :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4djhuOGJ3EAE",
            "text": "The place is very nice. It needs a little attention on the front presentation. The walls looks dirty. The waiting time is always from 10 minutes and up. There is not parking. If you are driving, 98.9 % that you have double park. My recommendation is that always comes with a companion so that one can come in a get the order. They have lunch and other empanadas that you can try. The best empanas de chocolo."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5NzYzam9BRRAB",
            "text": "I tried this place for the first time. The empanadas are fresh and very delicious. They take cash and cards ($10 min). I had beef, chicken, and a pizza empanada. I will be visiting again in the future."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndmFtenlRRRAB",
            "text": "DO NOT ORDER DELIVERY!\n\nI ordered with DoorDash. 7 empanadas spent $27 and not a SINGLE SAUCE! I even paid extra for extra sauce. You understand we order delivery because we can’t come to the store right? So saying oh come pick it up is insane when we order delivery. To who ever packed my bag, YOU SUCK AT YOUR JOB."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcGZxYk1BEAE",
            "text": "Great empanadas but the service is absolutely awful. I called at 7:15pm and placed an order for pick up ( 11 empanadas total) they said it would be about a 10-15 minute pickup. They didnt have my order ready until 8:20pm over an hour later. The empanadas were cold and they even left out two of the empanadas. For the price I paid, I was better off going to so many other places on Northern. Unfortunately, no longer a fan."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfLWE3emxBRRAB",
            "text": "Went on Friday 17th morning n there was super RUDE lady at front n she had BAD ATTITUDE n she was worst n horrible person.. I didn’t paid her tips she showed her bad attitude.\nGood I didn’t paid her no tips. Worst service. I’m not buying empanadas for free.\n\nEven for small sauce they charge $.50cent each. Not worth it. Even on that they put less quantity in it. Very much ripp off. I’m never ever going back to this empanada place. Zero customer service\nX"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHcEp2TTRRRRAB",
            "text": "The empanadas taste pretty good. I usually get steak and chicken. I heard the new pina colada one had taste alright. Customer service was good for me. Employees were attentive and nice."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNLaGJWRBAB",
            "text": "So I thought I was going to a different empanada spot but I’m so glad I ended up here. I’d give it 10 stars if I could. The flour empanadas are so good. Everything from beef to chicken fajita to pepperoni to Greek was so good. If they ask…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURremRpekpREAE",
            "text": "The Chili & beef empanada is by far the best one on the menu. A little spicy but not too much where you can't enjoy it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2c3IyZjNRRRAB",
            "text": "This review is NOT for the empanadas! Why would you go this route! It definitely doesn’t taste fresh or the same, it taste a bit milky and just too hot. Bring back the old sauce!!!!!!!"
        }
    ],
    "reviews_count": 73
}