{
    "name": "J.J. Garden",
    "place_id": "ChIJQbBWD5hfwokRvwiFxiQgPkQ",
    "grid": "QN3",
    "address": "75-21 31st Ave, East Elmhurst, NY 11370, USA",
    "rating": 4.2,
    "user_ratings_total": 424,
    "phone_number": "(718) 898-6686",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscUxUWnRTemhhVkc1VE5IWlFOWHBCT1VVeFNGRRAB",
            "text": "Awesome, tasty Chinese food place and date spot! Or you can bring the kids too!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMVkyeHRkWGR3Vkhod1REUktjSGhDYmpaTmRGRRAB",
            "text": "Good place to have authentic Chinese food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dVdFTk9Walk1VVZadWNXSTBaM2QwZUdrMFVVRRAB",
            "text": "Very disappointed with my general tso's chicken no vegetables fried rice and super bland general tso's and since I'm starving I have no choice but to eat it 17.95 !!! It's not like it used to be"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRVJTMXFNVnBJWTBGTVJsSnRSSE5vYm5CUFpIYxAB",
            "text": "This restaurant until today was one of my favorites that I knew I would eat there, but today I arrived for a meal for my wife and I, but we were disappointed. Two plates of boneless ribs with house rice for $40 dollars and the rice was full of balls and with only one shrimp in each plate. What a joke is that from a place like that? I don't recommend anyone waste their money in this place."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMaktUbWR3EAE",
            "text": "The restaurant is staff are very  respectful food is great"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Q1FrSnhlbGsxVjJoQ2IxbEpSWGs1U1RjNFpWRRAB",
            "text": "Consistent and reliable food for many years. Always hot and well priced considering the number of ingredients used to make chinese food. Cashier / order taker at front desk is not the friendly type but gets the job done."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQmNIbExaazFLVFU0NWMzRjBkalZhTm5WQ1VFRRAB",
            "text": "Service was perfect and food spectacular!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOUEFfWVBWemJQeFBBEAE",
            "text": "I went in to ask about the portion size of thr cold sesemae noodle size was like appetizer not a meal so I had to pass i was lure in by their low pricing yet I sont want a tiny portion seems more like a dine in spot the sp4ings rolls also good price but too tiny I can get food like this in bulk in Costco I'm not a big eater I prefer cheap places with bigger portions"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cVlrcHVNM3B1UkU1dFQzZ3lSMUZXT1ZseVEyYxAB",
            "text": "Too small size , and ignored take with soup"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPMmkwUENvNW8ycC1nRRAB",
            "text": "Real good Chinese food  expensive but worth it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaWJuYlR3EAE",
            "text": "Everything is fresh and great and priced very well."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJby1TQ0lnEAE",
            "text": "Incredible food and even free service, highly suggest coming here"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcWZDRk13EAE",
            "text": "I’ve seen this neighborhood Chinese restaurant since I was a kid, but this was my first time actually dining in. The place gives off that old-school Chinatown vibe, with a menu full of classic American-Chinese dishes. They’ve got tablecloths and a laid-back atmosphere — the only thing missing is that big circular glass lazy Susan you usually see for sharing plates.\n\nIt’s definitely set up for family-style dining, where each dish is meant to be shared. I ordered the mixed seafood dish — nothing in it tasted particularly fresh, but it was still pretty good and came with a side of white rice. The waiters were very attentive, although it wasn’t too busy while I was there. Free parking is a huge plus. I’ll definitely be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJLThUVmZREAE",
            "text": "Fellows are great!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3azVYeWlBRRAB",
            "text": "Food was good server was friendly"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3LWRPa3pBRRAB",
            "text": "The customer service is horrible. Had a terrible approach once i entered the facility."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNW9IMnpBRRAB",
            "text": "They don't listen carefully what you order. They make your order without following given instructions. They charge different price with for the same food items. Been here regularly as I live close by but this was the last time ordering from them. As the quality of the food has gotten really nasty over the time and Chinese became rude as usual."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReHNDRFVREAE",
            "text": "There’s a worm in my food…\nVery unfortunate & disappointing because this has been my go-to spot for 10 years now."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMmUyemt3RRAB",
            "text": "Old style Chinese restaurant. Good food and great service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfc1lfNlRREAE",
            "text": "Took my son Michael out tonight for his birthday to J.J. Garden for some old school cantonese food. With the never ending tea pot, home made fried noodles with duck sauce,General TSO chicken thats so juicy and Beef chop suey to die for. Where aspirations for authentic and comforting cantonese cuisine are fulfilled. On a dime. The best steam pork Dimsum in queens.#jjgarden"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZ3N6bUlBEAE",
            "text": "One of the few places that does white meat general tso’s chicken and non-pork hot and sour soup that I’m aware of. Very authentic (americanized) chinese, doesn’t weigh you down with grease, and always consistent."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bHRiQnpRRRAB",
            "text": "I had bookmarked this place for a while, thinking it might be a hidden gem for authentic Chinese food. Unfortunately, both the food and prices were outrageous! I can’t believe I spent over $40 per person for what felt like fast-food-style Chinese cuisine from Brooklyn. To make matters worse, they gave me the wrong order, refused to admit their mistake, and treated me like I didn’t know anything about Chinese food! It was completely unacceptable. The prices are far too high for this area. If you’re craving Chinese food, drive a bit further to Elmhurst, where you’ll find much better quality, reasonable prices, and proper service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM2VYY19RRRAB",
            "text": "I ordered House Special Fried Rice, large.. Not a single vegetable in it, no carrots, no peas, nothing. It's supposed to have all meats, it had no Beef, chicken and pork was really scared.. A few shrimps and A LOT of White Rice... Not buying again.."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdEw2cDZnRRAB",
            "text": "This place fell off super hard. It wasn't that great many years back either, but the food is very mediocre for the price you pay for."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX191RVVBEAE",
            "text": "Been a customer for years suddenly they treat me like\n\nGive great tips to the lady who answers the phone for delivery\n\nAnd giving good tip to the delivery service, which is not required and still treat me like\nI have never, and will not recommend this restaurant and will never purchase anything from them. Do not support them. They are greedy, selfish, and inconsiderate."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURud1ByLV93RRAB",
            "text": "18 dollars for boneless spare ribs and pork fried rice and a can of soda is insane never ordering from here again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua0pUZjdRRRAB",
            "text": "Great staff. Amazing steamed shrimp dumplings!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNEpmeVJnEAE",
            "text": "No good cooking the chicken, bad"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIel9fMHZBRRAB",
            "text": "The food was good. The waiter was a bit rude and had a little bit of an attitude. Forgot to bring our wings and had to remind him about it. He was not too happy about that. I tend to tip based on level of service so I decided to tip them what I felt was fair given my experience. Another waiter approached me and embarrassed us demanding additional tip (he didn't even serve us). He was very entitled and definitely felt like he deserved a tip regardless of the service. It's unfortunate because I've been coming here for years. I don't think I will go back and definitely wouldn't recommend it. Unless you want to deal with entitled wait staff."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyalBDWFVBEAE",
            "text": "Excellent lunch menu for value, service and taste.  We have been celebrating our family’s special days at this restaurant for over 18\nYears. We highly recommend this restaurant for small parties in their private dining room."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcU1hUVN3EAE",
            "text": "The only Chinese restaurant I use to go"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiak5MdzJ3RRAB",
            "text": "This is my go to sit down restaurant. It is so relaxing and the food is good. I appreciate that there is parking there as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNDhPbG53RRAB",
            "text": "food is good and very clean environment been going here for years"
        },
        {
            "date": "1년 전",
            "language": "zh",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicVlDWTF3RRAB",
            "text": "吃过最难吃的回锅肉..既然是甜的"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicFBiSFN3EAE",
            "text": "Surprisingly nice dining room, wouldn’t expect that from a shopping center food spot. General TSO, and shrimp fried rice. Pro tip: order white meat chicken it’s worth the additional dollar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybXVING9RRRAB",
            "text": "The food was fairly mediocre and small portions. I've definitely had better around multiple spots in Jackson Heights, East Elmhurst and Woodside. The woman working there was a bit rude and gruff. I don't see any reason to return any time soon, to be honest."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMem9LWVlnEAE",
            "text": "One of the best Chinese foods in Queens"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkM3FUSXhBRRAB",
            "text": "We spent $27.10 for 2 combination meals.  I got beef with broccoli and white rice. He got sesame chicken with beef fried rice and no vegetables.  We waited until close to 9 PM since it was Valentines Day. It took an hour, and the food was cold. Place is only 0.8 miles from my house.  Portion is very small for the price.  The driver was more worried his tip than our food being hot. He got angry when he didn't get a tip. My food was cold enough that the oil separated from the sauce. He didn't eat most of his sesame chicken. It was cold  so he called it a night. The first time wasn't the best, not the worst.  I was hoping it was a fluke. I will never order from here again. Look at the container they use. It is a serving for an elementary child."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bTRmV3hBRRAB",
            "text": "Some of the best Chinese food I've had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6OC1ucXR3RRAB",
            "text": "Ordered general Taos chicken all meat was hard as a rock.would the cook eat what he served.why would he serve to customers. Don’t waste you time or money.warning to customers .first and last time never again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb2FqcERnEAE",
            "text": "I made an order on the phone and the man who took my order WAS VERY RUDE ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMXZfQzdBRRAB",
            "text": "Very tasty Chinese foods! Nice workers! Wonderful! Thank you! 😆 🍲🥢🍜✌🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbTR6SFZ3EAE",
            "text": "Got take out. Ordered the chicken with broccoli and spare ribs. Both dishes were good, especially the ribs, the BBQ sauce has the right amount of sweetness. The cashier and packing lady were friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdmVTazhBRRAB",
            "text": "Small portions, soggy chicken and broccoli, and hard rice. Avoid this place; quality has plummeted in recent years."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqa2V5QWVnEAE",
            "text": "Amazing food! Great service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREczRUM1h3EAE",
            "text": "Went here & ordered Lunch, everything was fine until the order was placed. Waiter gave me a look because apparently it was alot of food I ordered & made it seem like i wouldnt finish it. Not to mention , i had someone with me who i was sharing with. I let that go and then another waiter passed by the table & looked at our table and spoke to the women cashier in their language and they both looked at my table and laughed. Obviously talking about us & most likely saying that we were eating alot. Worst feeling in the world . To know that your being starred at and they are talking about you , even though you cant understand it. But your making straight eye contact & know its about you. Wont be returning here. Never thought this would happen to me. I think the staff should mind their business when it comes to their guest. Who cares what they order & make the sale. Judging your customers for eating at your restaurant shouldnt feel shameful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREa1pteUxBEAE",
            "text": "The lobster  is  incredible!! I’ve been to fancier spots and they don’t even come close to JJ Gardens !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMXJ1Q3RBRRAB",
            "text": "The food was absolutely fantastic and I look forward to ordering takeout from here once again. I ordered the Shredded Pork Noodle Soup, the Crystal Shrimp Dumplings, Juicy Little Pork Buns,  Szechuan Spicy Wonton and the Steamed Chicken with Broccoli/White Sauce. Everything tasted extremely fresh, delicious, and savory."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEc29Yc2FBEAE",
            "text": "The food is awesome. The best Chinese cuisine I've taste. I've been coming here for years."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5N3ViYjVnRRAB",
            "text": "Recently I was at JJ garden at Jackson Heights and I request Chinese launch one with duck and the second  with roastpork but the waitress went off   When we ask him for the roadsduck. He say it's no longer in the menu Even the menu have it as a choice. I ask him for soda and also when out of the of the way shown his disrespectful way to serve the customers.  When we order the food they come in and i was a uncomfortably with the service. I've been for a long time. Since the beguini of JJ garden a customer and always been asking for orders. I'm respectful way, but this time I went to the restaurant. And I am not happy with the service. They provided and I think it was disrespectful. At the end they come up with the food The food is small quantity. It's for lunch special, but it's a very small quantity and a higher price, and they didn't offer you a soup Them other waitres ask and request for a tip for bad service. I consider poor service I'm sorry for this, but I'm no longer a customer of JJ garden and I've always been a good customer.\nThanks but no thanks"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKLXJ1MFJnEAE",
            "text": "Our local (Jackson Heights/East Elmhurst) go-to restaurant for Chinese takeaway. The food is of decent quality though by no means gourmet. But for every day eating a reliable choice. Very convenient location in the Jackson Heights shopping center — plenty of parking and other shops (including grocery store and French patisserie)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaODUzYlJnEAE",
            "text": "Forget about Chinese takeout….JJ Garden has a real dining room with linen topped tables and expert waiters clad in black and white. The food is extraordinary, fresh and beautifully presented. Jerry makes a killer cocktail called a Zombie which will make your night. Go there now for a great dining-in experience!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJOWJEMGpBRRAB",
            "text": "Food was ok. Maybe I had high expectations given the 4.5 star google review average. Fried dumplings weren't very flavorful. Wrapper is kinda think; felt more like a bun than dumplings. Shredded beef was ok. Wasn't very flavorful either."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJNmNhM0ZnEAE",
            "text": "A no-frill Chinese style local restaurant. The service is super attentive and friendly. Tried their wonton soup, fried pork dumplings and beef chop suey. Recommend the pork dumplings. Price is reasonable.\n\nThey offer free fried snacks with duck sauce at the beginning and canned fruit cubes (also free) at last. I've visited a number of Chinese restaurants in U.S. and this place is the first one I visited that serve you fruits."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsa0pldGxBRRAB",
            "text": "First thing I ask the man at the front was,  “How long of a wait for seating “ He says “10 minutes, 10 minutes” .. I order my food at the front thinking that Ill be able to sit down and eat. He takes my order & then proceeds to ask me “Takeout or to Stay” … I said “to stay” then he says “NO NO NO I only do take out orders. So why ask me to begin with without verifying with your customer before taking my order? He was just being rude and dismissive. Service was poor."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVbkphWU53EAE",
            "text": "Classic Chinese restaurant with excellent customer service and fun drinks. Delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMm9XNHB3RRAB",
            "text": "Really classic Chinese American restaurant experience. Fairly priced. Will return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MksyMHl3RRAB",
            "text": "It's my second time buying here. The service is fast.. the food is good! I recommend it. If you want to order here for a delivery service. I don't recommend. When you pick up at the location the food arrives hot and on time..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROcllybGJ3EAE",
            "text": "Min I could put is one star. If it were up to me I would put 0 stars. Had food delivered and was unable to go downstairs to get food because I have little kids and wasn’t able to take them down with me. Asked the driver to please ring the doorbell to ring him up and refused to kept insisting to go downstairs, since I couldn’t go downstairs and driver didn’t want to come up I had to cancel the order. Called the store and store owner told me to don’t order from there again. Horrible horrible service regret wasting time waiting for food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OVpiODNBRRAB",
            "text": "Good place for eat! Good service!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbGY3eEJBEAE",
            "text": "Gave three stars because they give you fortune cookies and the food was okay but the service was just awful and there was no ice cream for the kids to have as desert. This place used to be really good. If the service changes  maybe I will come back. I miss King Yum that place was phenomenal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaX1B1NS1nRRAB",
            "text": "I ordered Spring Rolls and they were made different at this restaurant. My chicken and broccoi was good but alot of sauce was in it and extra sauce had dripped inside the bag. The rice and chicken/broccoi was still hot. The delivery driver was on time with the food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZLV9lWmFnEAE",
            "text": "Went here for my son's birthday and had a great dinner. The 3rd time we have been there this year. The old school vibe reminds me of back in the day with my Mom and Dad. The food is fresh and can be served family style. The price is also right very reasonable for what you get. The fresh pineapple and the end is the topper."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5a3BmWENBEAE",
            "text": "I was astonished at the quality of their meals. Also they definitely give you what you pay for. Unlike other Chinese restaurants that overcharge and skimp on the meats and portions. Here they are priced fairly but you definitely get what…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhMU5ycVR3EAE",
            "text": "I am not happy with the 2 dishes that I ordered. I ordered deep fried scallops that were processed fish on a bed of frys and shrimp Lo Mein with shrimp the was the size of a nickel. The home made egg rolls were good. For 38 dollars I expected more."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNMGJfYmFBEAE",
            "text": "As advertised! Very solid Chinese. Nothing was overcooked. Good quality proteins & vegetables. Nice flavors, nice surprise,.\n\nWe still like places in Manhattan or Flushing better but will return and tty to spice our order up.\n\nReally enjoyed our waiter, wonderful panda-bear older gentlema  who could wait tables in his sleep. Very welcoming and professional. Great suggestions.\n\nPace was on point and our water glasses were filled by the waiter or the other waiter.\n\nLots of FREE parking with many other things in the mall."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbDVhNXd3RRAB",
            "text": "Not great. This is why sometimes you cannot trust Google reviews.\n\nOrdered wonton soup which was good as far as the broth but the wontons had almost no meat in them and were soggy.\n\nThen I ordered beef with broccoli which was bitter for some reason and bland I was hungry but I didn't even finish it Even though it was not a big portion.\n\nDon't know if I'll try them again but if I do and it's not good again that's it"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDeHNmam5RRRAB",
            "text": "Although the food itself deserves at least 3 stars, the reason I am giving such a poor rating is due to the fact that the delivery personnel was impatient and wrote down his own tip after not being able to wait for the doctor to come out of…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReXB5U1pnEAE",
            "text": "love ordering from here, the food is really good and even eating in is great. I live nearby and tend to order very often. If anything was bad it might be that if your order for delivery the lady on the phone seems to be really quick in…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNLaUxBZxAB",
            "text": "Unfortunately they are just like every other bad Chinese food location.  Try to put some meat in the dumplings next time."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJOUlqZEl3EAE",
            "text": "Great food and relatively affordable. I personally love the General Tso's Chicken and the Singapore Mei Fun without vegetables. Only complaint is the staff can get a bit rude during busy hours. Definitely still recommend checking out the food sometime."
        }
    ],
    "reviews_count": 71
}