{
    "name": "The Queensboro",
    "place_id": "ChIJk7BlPKdfwokRpUtKYmRXR74",
    "grid": "QN3",
    "address": "80-02 Northern Blvd, Jackson Heights, NY 11372, USA",
    "rating": 4.5,
    "user_ratings_total": 1095,
    "phone_number": "(929) 296-0038",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvdFRUaDBlSGRHUlVVMlpYRjNjMWhFWldWamMxRRAB",
            "text": "A wonderful neighborhood restaurant with an excellent vibe! The food is great (and very creative), the drinks are excellent, and the owners and staff are very friendly. On weekdays, you can work there before 4pm, when they offer a more limited menu. (I love their iced coffee, btw.) The Q is also great for brunch or dinner and offers an array of community-fostering events, like game night, stand-up comedy, etc. Definitely highly recommend!\n\nPS - Everyone who works there loves dogs and will give your dog a treat (with your permission)!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbGJVMXdaVmxmWlRaR1lVeE1RekE0TUVvNVgwRRAB",
            "text": "The food was again 10 out of 10"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STmFIbHhhV014VEV4Vk1HSlRVbHAwUjJkcFNIYxAB",
            "text": "It's one of the best places ever anywhere. Because of the food, the ambiance, and the staff. Truly a great local gem that is worth a trip from anywhere."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUFJtVnVSakF3WWtoS2MyRnRVaTEyTkRkUlRtYxAB",
            "text": "Interesting menu, cool vibes and lots of community building going on here! An awesome place to spend the evening"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WmRXOXlOelUwZERkaVJYcGpNV2syWkVKSllXYxAB",
            "text": "This is the BEST place to work remotely on weekdays. They are super friendly, have WiFi, it’s a cozy environment, and the coffee is great. They’ll also make a vegan salad and have a vegan yogurt option."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkM1ZuVnllRXBaT0MxQ2VWZExUSGhZYVhwUWVXYxAB",
            "text": "Never had a bad meal here…excellent!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUVltcEVObUV5Ymt0a1MwVjViWEYyU0dOTGNuYxAB",
            "text": "The food was great the only thing I would say is the service was a little off they forgot my drink & took long for our order another couple got their food before us. I still think they deserve the 5 stars the food was really good & don’t think one small hiccup defines them but the guy w long hair need to remember drinks and get food out asap."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obWNTMW5keTFTWmxGelJuZ3hNV3h4T0U5UVpXYxAB",
            "text": "Made a reservation and glad we did! Great service the second you walk in the door. Seated in a booth and orders were taken quickly for our group. Attentive in the best ways and luckily it was Hawaiian night! Specials were unique but approachable and everything we ordered was delicious. From Garlic Clam Bread to Linguini with Shrimp & Chorizo to the Pork Adobo w/ 2 sides. Great place to gather with friends-we will be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neVFVdDNRakV4TWxsU01uaEJOMVl4YlhSR1VtYxAB",
            "text": "food is sometimes okay, usually bad. responsible for lots of gentrification. go to restaurant that's been here for a while, not this yuppie stuff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GalRqSXhjVkZDWm1sS2REZGZNelZtTkc0MmRsRRAB",
            "text": "Had the Linguini, shrimp and longoniza. It was so damn good. Just needed some bread to sop up the sauce. Might be hard to try something different next time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNlJHdDZVREJRVkUxclVHVlNOVFUyYkRCZmFYYxAB",
            "text": "One of our favorite places in the neighborhood. The menu changes often, so we are always looking for an excuse to go again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNVJYSnNNalJ2UzFORWJYSnBlakpZWWtoNmVsRRAB",
            "text": "Came for a large birthday party (20+ ppl) and they couldn’t have been better.  Incredibly accommodating and super friendly staff. Luis and his team went out of their way to take care of us.  Also they offered us the ability to order and keep separate tabs which made everything simple and easy.  Owners are friendly, kind and support meals for asylum seekers and refugees as well.  Food was fantastic too. Can’t recommend this place enough for any occasion!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214YVIzTlpTbU5CVVdGSVJ6Sm5aRkJXY1MxRlltYxAB",
            "text": "We had a ball. The person who took care of us Angelica.   Absolutely fabulous"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOU0xXcFJWREZGWXpGak5XbGpSR3hVY0hwMk5GRRAB",
            "text": "The food and atmosphere made it a great spot to enjoy lunch with friends and family. Both the meals and drinks were delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sc1dYRnFSMngxZW01SVVIRlliR1JyUWw5eFlXYxAB",
            "text": "Food is great here but not a fan of the ordering system. You can the QR code and place the order on the app and start a tab. No service other than them bringing the food out. As for the food the pizza was fire. It is detroit style but without the crunchy cheese crust. Very good and light. The cobb salad was lovely and was loaded with ingredients.  There arent many appetizers either. We ordered some veggie chips which were decent. They have a lot more drink options but weren’t drinking. I would come back now that I know what to expect but it took a minute to get my bearings."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM1RrcFVlV2xvWlhsUGRGUTRTMnhJTUdkbU4yYxAB",
            "text": "Very disappointed. There was an egg shell in my food and staff did nothing about it besides taking the food back to the chef. Still was charged the full amount and no type of accommodation. Be careful what you’re eating! Will not come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeFRuVjNTRnBYVGxaRVgwaG1jV2s0ZUhGNE1GRRAB",
            "text": "This place never disappoints. It has good service, the food is delicious and fresh and the place is super nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTVRYWmxPVEJzVHpKemREWTFlREZNT0cxT1lrRRAB",
            "text": "Had a work party here, great and quick service, staff were wonderful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMWVFcHVOVEl0TlZsS05ESlBNVWwzUjBOUmIzYxAB",
            "text": "Delicious food! The plants and interior decoration was cozy. The restroom had great music and was clean! I do wish the drinks weren’t so pricey — especially the Diet Coke! Also, I was thankful to the waitresses for being so kind and checking in on me 3 times. 🙏"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMXR2N2JREAE",
            "text": "The place is amazing, great service, great food and atmosphere.  My favorite restaurant in the neighborhood. They also care about giving back to the local community during COVID and other important civic support.  Thank you Queensboro."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMmFGTjFUMEUxTFhaVGFrbEpUM0ZKWWtaVVgwRRAB",
            "text": "VERY GOOD 👍 🆗️ ORDER 😍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGR2RtUkdPRGRNTWpZd1NFVTJRMWRIVmtOelZGRRAB",
            "text": "Friendly neighborhood location for brunch and dinner. Delicious food, kid friendly and even has a decent happy hour!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SlIyd3lYMlpHWDFWaWNYUjBZMWhYVjFoMlkyYxAB",
            "text": "Food wasn’t super flavorful. Took a while for our drinks to be refilled. Waitress seemed a bit overwhelmed from the busy brunch rush, judging by the subtle attitude she gave us any time she spoke to us lol overall just an okay experience. The place itself is cute"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ad1prbFhZVW94TTBwckxXRkhlbVZ2T1RKVWVuYxAB",
            "text": "We went to this place on someone else’s recommendation. We were very excited, however, we left somewhat disappointed. I think maybe we went on a day with bad luck.\n\nAlthough the place in sight is very beautiful, with plants, illuminated and a good location, that day we visited it had a particularly unpleasant smell. When passing the door you could feel it. We were about to leave but decided to stay.\n\nWe ordered a glass of wine, a chelada and a pizza. Although the taste of the pizza was acceptable, it came a little burnt. The glass and the glass in which the beer was served looked dirty 😮‍💨\n\nHow sad. Maybe another time we can have a better experience but the first one really wasn’t."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLSGw4NlRmMWRqdXp3RRAB",
            "text": "The Q is a great spot for diners in the neighborhood and should definitely be on your restaurant crawl list for folks who don't live in Jackson Heights. Friendly staff, great bartenders (order the Bramble any time and especially from James on Tuesdays and Wednesdays). Most visits we sit at a hightop in the bar area and we're always greeted warmly. The food is great and the vibe is chill. Prices are fair and the bar stays open after the kitchen closes. Can't ask for better than that."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNdmtudXVrM2Nxb0tREAE",
            "text": "We had a party of 14 on a busy Sunday for brunch. Despite this, the staff were excellent, friendly and very available. The food came out in a timely fashion and was very tasty!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wV1R6Qk1Va2w1ZDNSWlptVmlXbFE1UlZCNE5tYxAB",
            "text": "I’ve been to this place a few times, but only for brunch. This time, I decided to give it a shot for dinner. And let me tell you, it was amazing! The staff was super friendly and helpful, and they even pointed out some of their favorite dishes on the menu. My partner and I tried a few things, and the chips and dip were absolutely delicious. And the yellowfin tuna tostada? Well, it was perfectly balanced and presented beautifully. It was a great experience, and I’ll definitely be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLVQ3ZnpVOTVyc3VRRRAB",
            "text": "Great pisco sours and  delicious appetizers!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMN01tb0NCX183SzJBRRAB",
            "text": "Delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcnB4TnY4cHFEMXl3RRAB",
            "text": "We've been coming here regularly for several years and I'm always satisfied. Stellar food and drinks,. friendly service, lovely atmosphere...it really has everything! I'm always happy in the fall when the Brussels sprouts salad is back on the menu, and then I'm happy in the spring and summer when they offer delicious seasonal vegetable pasta! It isn't inexpensive, but it always feels worth it!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNHZEdnN3RRAB",
            "text": "The food was good and the drinks are even better.  The service was amazing.  Overall I will be back. We truly enjoyed our time here!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveC0zNkh3EAE",
            "text": "Don't understand how this place is popular. Every dish and app we had greatly dissapointed."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbWFfNnRBRRAB",
            "text": "Great service, food was good, I recommend the spam and egg sandwich and I usually am not a big fan of spam.\nWent there for a rainy brunch and it was so nice watching the rain through the big windows while sipping a blood orange mimosa. Adding to my regular brunch places.\n\nCame back later and got the jerk chicken. Super good, not very spicy, but well cooked and full of flavor."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzLWJpemhRRRAB",
            "text": "Love it!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOWVXTkl3EAE",
            "text": "A mediocre, expensive American restaurant, where I got spoiled food without acknowledging from management to set things right & loved by locals without a yen for the plethora of ethnic cuisines of the area and a local business, which selfishness takes parking spaces when it has a grand old space and plenty of sidewalks for Al fresco dinning. It could be so much more while following it's brand"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJc2Z1aUV3EAE",
            "text": "Excellent , tasty food at a reasonable price"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeDViSTR3RRAB",
            "text": "Hi\nI’d like to express my dissatisfaction with the experience we had at your restaurant. The food was served cold and had to be taken back, and unfortunately, when it was brought again, it just wasn’t the same. Additionally, the waiter who brought the food was coughing, didn’t greet us, and placed the plates on the table in a very careless manner.\nWe had high expectations when choosing your restaurant, so this was quite disappointing.\n\nThank you for your attention."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdHJYZU5BEAE",
            "text": "The bartender Trey was everything you would want from a seasoned bartender.. good cocktails and good company! I’ll be back for sure!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNk51X2NnEAE",
            "text": "Great sandwiches with generous portions and delicious flavors! The ordering process is entirely online, which was convenient but felt a bit impersonal. It would have been nice if the sandwiches came with sides to round out the meal. Overall, a solid spot for a satisfying bite!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3akxDS19RRRAB",
            "text": "When ordering  cheeseburgers,  they never aaked.The temperature came out very dry and salty"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eHVmNUlBEAE",
            "text": "Delicious brunch! Live atmosphere, some might find it too loud."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NUxHWXpRRRAB",
            "text": "Great! Bartender... good beer selection...good happy hr"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRamNQOUZnEAE",
            "text": "1st time in Queens and went to the Queensboro and it didn’t disappoint! The atmosphere was great the servers were phenomenal! We had breakfast one more and loved it some much came back for brunch two days later and the peach Bellinis and milk toast were amazing! If you’re looking for good food and vibes make the visit."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRamFLa0lBEAE",
            "text": "I had an absolutely amazing experience at the Queensboro! They treated me with kindness on my birthday ! The food was amazing , everyone was lovely and the atmosphere was clean, open and warm 😍❤️ will be coming back again and again ! Not to mention The FOOD WAS FANTASTIC"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbWEtZ1lnEAE",
            "text": "A true gem. Consistent, fresh, inventive takes on classics with seasonal ingredients. Somehow they keep the food hearty and unfussy while injecting a little flair into a wide variety of dishes. Doesn't hurt that the atmosphere is low-key, warm and inviting. Just go."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncl9QYXBRRRAB",
            "text": "I went on a Thursday night for open mic night to support a friend. I sat at the bar and had a veggie burger with root veggie chips. It was delicious! They had a wide selection of vegetarian/vegan friendly options. You can even get a veggie plate with your choice of 4 veggies. It is pretty far from where I live. Otherwise, I would frequent this spot. The staff is also VERY friendly, and it creates a cozy atmosphere. Not to mention, open mic night was fun! I recommend you stop in"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1NHJITGtBRRAB",
            "text": "웨이터들이 친절합니다 음식은 아직 안먹어보고 커피만 리필도 해주고 좋네요"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOXVqZlhBEAE",
            "text": "Great place with absolutely amazing staff. Came with the kids and the staff was so great with them! There’s also some Filipino style food which was also delicious. Alcohol portion is great. And completely surprising their desert was gold; try the muffins!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOejVMLWFnEAE",
            "text": "Really delicious restaurant week entree specials that did not appear on the regular dinner menu. We ordered the pork schnitzel - huge slab of pork in great breading + beets ketchup, and an amazing artic char on lentils, cabbage, and friend wild rice. The skin on the fish was amazing and the best fish skin my partner and I have ever had. The appetizers were on the regular menu but a little special - the chip and onion dip had caviar and the chips were a variety of types of potatoes + plantain. The fried squash rings had an incredible batter. Dessert flavors were amazing - a vegan key lime pie made with avocado!!! How it stayed green was a mystery to me. The root beer cake with vanilla ice cream was also so flavorful, amazing licorice flavor in the moist cake.\n\nService was great, water was constantly filled. Love this local spot!!! Two restaurant week dinner specials + no drinks came out to just under $100.\n\nWe come back here for the garlic bread because it's made of dreams. Everything on the menu is always great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaEltR0VBEAE",
            "text": "Always an amazing time at The Queensboro - I can’t believe I haven’t written a review for them before. The food is fresh and delicious - the menu evolves with the seasons which is nice. Always something new to try with their main staples sticking around. The staff is very welcoming & friendly! This is a local staple that everyone should try and make apart of their regular rotation of restaurants. Will be back and I recommend to everyone to give them a try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NXNUeUdnEAE",
            "text": "Garlic Spam Fried Rice and Morroccan Breakfast. In house spam - pretty good. Garlic Spam fried rice a little too salty for my taste. We started with their ricotta fritters. Pretty damn good. Light and fluffy, made fresh.  I could taste how fresh the cilantro on the Morroccan breakfast was. Likely from their in house herb garden. Spices were very warm and comforting. Coffee was alright. Looked the right color but nothing to write home about. Not complaining either. The happy medium for diner coffee, I'd say. A little expensive for what it is but the decor could have told you that. Family friendly and the service is great."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMDgtejd3RRAB",
            "text": "This restaurant features an open concept that is inviting, rustic with a welcoming feel. Our group sat close to the bar for brunch and the surrounding decor of tiny plants were charming. Angelica our server helped with great suggestions which are placed via a QR scan on the table.\nOur table ordered the sweet potato home fries with eggs, clam pizza, chips and dip, chimichurri steak, fritters, bone marrow custard I believe it was. My absolute favorite food item was the pineapple cream cheese cupcake!!!!!!!! It is so moist with tiny pieces of pineapple and the perfect balance of cream cheese filling. GET IT! The second best dish was the toasted bread with condensed milk!! So decadent and delicious.\nI must say that all our dishes needed seasoning especially salt ( a lot more) which brings me to the the next minor flaw we had, since all our dishes lacked salt we decided to request hot sauce to improve the taste, there is a chef special hot sauce that tasted spoil. Not sure if the banana in it went bad but it did not taste good at all. We ordered pitchers of mimosas, Bellinis and white sangria which are $50 per pitcher, the best I say would be the sangria.\nOverall, the ambiance was super chill and welcoming. Lots of outdoor seating with great music. Ask for Luis if you need drinks!! I would recommend this restaurant as a brunch spot to try if you travel to Queens NY."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadnVMRjVRRRAB",
            "text": "This is a great place. The atmosphere is nice. The wait staff is friendly and genuinely seems interested in serving the customers.\n\nBe aware, if you are there for lunch: they have a brunch menu, and a dinner menu. The menu is accessed on your phone. It is not readily apparent what menu you are ordering from. Some dinner items cannot be ordered for lunch.\n\nI had a veggie burger. It was good. Not my first choice, so I was a little underwhelmed. It was served with homemade chips, cleverly made from various things. Unfortunately, they tasted oily.\n\nIf you are in Jackson Heights, go here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dk03YzhBRRAB",
            "text": "Had an amazing dinner here during restaurant week. We walked in on a Thursday night and were able to get seated without reservation.\n\nService was great, very informative and friendly.\n\nAppetizers were creative and surprisingly filling. I especially enjoyed their take on a beet (not beef!) tartare.\n\nThe Artic Char was the star of the show. Crisp skin and tender, fatty fish - it was perfectly cooked.\n\nMy only nitpick is that we were seated near the window during the evening, and would periodically get blinded by headlights from cars making turns across the street. (The restaurant is dimly lit.)\n\nI'm looking forward to coming back to try their other seasonal dishes and local drinks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bnBUTnNRRRAB",
            "text": "They had delicious food. It was delightful and satisfying There were a lot of nice people specifically Angelica. And I suggest the photos I putt."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEOHVlRTlBRRAB",
            "text": "Went a little too early but hung out with the bar tender (Tray). The Food was worth the wait!!! My daughter had ate half the sandwich it was huge. The pizza a must have. Thank you guys will definitely come back when I am back in NY."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNGM2NFZBEAE",
            "text": "This place is so cute! The service was fantastic,, everyone was so attentive, friendly, and helpful. The muffins were phenomenal and the pancakes with the dulce de leche butter were life affirming. Also had mimosas (perfect oj/champagne ratio), bacon, sausage, and home fries. The baked eggs and steak looked phenomenal too. I didn't get to try those but I saw the table next to me get it and I had a little plate envy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdk02NG1RRRAB",
            "text": "It was my first time checking out the restaurant and while I had no expectations I was extremely disappointed. The server that started us was taken over by another lady that I assume was the manager that seemed agitated since the staff was running around even though the restaurant was only half full, food for my table (3ppl) took 40 min to hit the table (2 chilaquiles and 1 eggs Norwegian) while the food was good, the Cherry shrub was not tasty (I recommend to fix the ratio of vinegar) but quite disappointing since it was highly recommended , will Not be recommending or coming back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXN05UT0lnEAE",
            "text": "Love that they have a rotating menu here. They source their ingredients locally from farmers markets in the area and feature a very unique take on comfort food. We ordered the beef stew and the shrimp and chorizo linguini. The cocktails were light and refreshing as well. Our server Trey was the best. We’ll definitely be coming back for brunch on the weekend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdVBmVTVRRRAB",
            "text": "Went for Brunch on a Sunday, my friend and I were extremely satisfied with both the food and service. Luis one of the servers was really friendly and delivered quality customer service. We will definitely be returning. Making a reservation is a good idea, although we didn’t have one but were seated almost immediately."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLXIzcV9BRRAB",
            "text": "The atmosphere at The Queensboro was quite nice, and the food was even better. Everything we ordered was so unique and flavorful. One of the most interesting dishes we ordered was some pasta with pork sausage, and grapes. I thought that sounded really strange, but the flavors worked!\n\nMake sure to save room for dessert, because they have so many great options. I’d recommend the bread pudding, or the berry tart."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZNWZPTlpnEAE",
            "text": "We came here for Mother's Day to try out the restaurant. Overall the food was good but most of the entree are under seasoned. I definitely recommend the Chips and Dip, the pizza, and the Earl Grey Creme Brulee."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxejhINENBEAE",
            "text": "Such a wonderful and delicious place to eat! My boyfriend and I came to dinner and  really enjoyed the atmosphere. The waiters are very attentive, can’t wait to return and try more items on the menu :)"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCeE5yRDB3RRAB",
            "text": "Uno de mis lugares favoritos en Queens, me encanta la Tostada Caramelizada, los Chilaquiles y el Chocolate Caliente. La mayoría de empleados son súper amables, especialmente los chicos (bos boys) y si te atiende Angélica es increíble. El chef wow, un día me hizo un plato en la mañana que solo está disponible en el menú de la cena!! Mil gracias por la atención! 💜"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcUkzUjVRRRAB",
            "text": "The service was great and the food was good. Broccoli side dish was delicious and so was my eggs benedict. My dear friend got a steak and it was a bit dry even when she asked for medium well. Bloody Mary was amazing!\n\nTip- if you are reserving a table, try to ask for something away from the entrance of the restaurant. Our table was a bit too close to the hostess and I definitely did not enjoy that."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdmMyU25nRRAB",
            "text": "First time here last night. What a great space, very different from the rest of the neighborhood. Came here to see the band Johnny Meyers Quintet.  Good music in a really cool venue with great food. I ordered the Tamarind Beef Stew with…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtenRYZWN3EAE",
            "text": "This place was outstanding! stopped by for brunch with my friends and to start the service is very pleasant, always refilled for our coffee, food was cooked perfectly and had flavor. I got the eggs Benedict, my friends got pancakes + a…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5aVlUZVd3EAE",
            "text": "It is amazing how tremendous a cherished a widely recognized neighborhood spot this restaurant has grown in such a short time. Especially for a neighbourhood as diversely integrated as Jackson Heights, where so many culinary and cultural varieties are available, this spot brings a super strong community-oriented vibe that brings everyone together. It's resonates a hint of a diner with all the mom & pops local vibe that delivers a brilliant consistency, but rises above a static menu to cover all bases. They also offer a variety representative of the plethora of palates from the neighbourhood, and, still with enough flair and flavorful culinary mastery making you want to come back not only for more, but also to try whatever else you can the next time around, or see what next new dishes they may offer temporarily. If you come from the school of evaluating things by how the little things speak volumes.for the rest, then wait until you sample their French Fries! Most everywhere else will be ruined to you after. You've been warned.\n\nTheir hamburgers are utter flavour and portion brilliance, as well.\n\nDefinitely give their signature house \"Q Habanero Hot Sauce\" a shot ...if your into that, too!\n\nAnd, as if feeding you delicious food for weren't enough, The Queensboro has a community fridge to provide for anyone in need of a meal, free of charge, too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacDU2ODNRRRAB",
            "text": "The Queensboro is a very popular spot in the neighborhood I grew up in , Jackson Heights.  It's a very chill spot with tons of seating, which means never having to wait to be seated. The owners and servers are great. Very courteous and friendly and always happy to serve you. I only gave it a 4 star because it is very slow. The restaurant gets very busy, and they never seem to have enough servers to make the service very slow at times. The food, although great flavor, they are sometimes heavy-handed with salt. My pork carnitas dish was delicious but had too much salt for my taste, and I'm a Latina, and I love salt, so trust me, it was over salted. My son's burger was also too salty and couldn't finish it,  so was my sister's steak. The appetizers, on the other hand, were delicious, especially the burrata salad with peaches. The saltyness of the burrata with sweetness of the peaches elevated the flavor. The drinks were good for half the table. Sangria was too dry for my parents, but perfect for my sister. My spicy margarita was flavorless. I could only taste the jalapeños, I couldn't finish it. My daughter, on the other hand, had a watermelon cocktail, sge loved, and brother in law had the grapefruit margarita, and he enjoyed his too. Maybe it was just my bad luck that night.  I've been to The Queensboro many times, and I've enjoyed it, especially brunch, and I'm sure you will too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaF9hREZnEAE",
            "text": "Had higher expectations for this restaurant; I was disappointed that the food didn't taste as good as the reviews stated. I got the jerk chicken with summer squash and grilled asparagus. Food came out really fast indicating that everything was already pre-cooked.\n\nThe jerk chicken was decent (you get 3 pieces), but very salty. The asparagus was hard to eat because the skin was hard and chewy. The summer squash was awful; it didn't mix well with my jerk chicken. Everything was too salty. I paid around $28 after tax and tips. I don't think the price justified for the food I got.\n\nService and decor were nice. They had someone playing music instruments, but honestly it was too loud and I couldn't hear my friends talk."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMXJyQnZ3RRAB",
            "text": "Queensboro is a delectable experience of yumminess, whose dishes merit the highest culinary acclaim. I love this place! 😋❤️😋❤️😋❤️💯"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbnU3ekpBEAE",
            "text": "This place is truly a gem. I've lived literally my entire life in Jackson Heights and this really is symbolically what I love most about my neighborhood.\n\nThe service is impeccable and everyone is incredibly accommodating. The outdoor space is super nice and they are beyond dog friendly bringing doggos more treats than they know what to do with.\n\nThe menu is delicious creative and varies to fit basically any diet. The food is always incredible so are the drinks.\n\nThe fact that they have come into the neighborhood, set up the community fridge, a small library and a doggo station speaks volumes about this type of establishment that deserves it's communities support."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMweWNqRVBBEAE",
            "text": "Great location at the heart of Northern Blvd near 81 Street. Very convenient street meter parking in the front, or you can look for free parking around the streets in between. Our waitress is very energetic and gave us recommendation. I had spicy Mezcal margarita, it is good. My son had a watermelon lemonade mocktail, he like it alot. We ordered special menu with Germain Suasage and garlic bread. It taste ok , didn't meet our expectations. However ambience and decorations is simple and yet so beautiful. Maybe they have other better dishes which we haven't try. They have big space, great for family with kids. They also have a nice bar."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNTZxY3NRRRAB",
            "text": "This restaurant has a beautiful atmosphere.\nPerfect place to get together with friends.\nGood food and great service. Very spacious highly recommend."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0MVBhX2R3EAE",
            "text": "Terrific ambiance here, modern neighborhood restaurant. Terrific pizza crust. Individual pizza is big enough for 2. Some unusual toppings too, like eggplant with currants and garlic. Upholstered booths and a bar as well as tables. Big enough for a party. Worth a trip."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcE0yc2lBRRAB",
            "text": "Loved the place, especially the Wednesday game nights... Super awesome! My cheeseburger was delicious, and so were the fries. I am just a little bummed that I asked for ketchup 3 times, and no one ever brought it. Yeah, it was that good that I ate half before I took a picture."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLOE5tWF9RRRAB",
            "text": "I came into the Queensboro for brunch for the first time and was treated by a server named also Angelica. Angelica is AMAZING and Yash were our servers, both great so attentive, Angelica recommended the Peach Tomato Toast and he helped me navigate through the menu. I also ordered a watermelon gimlet made by Ysa, at the bar, this is best drink ever. This place is a must come. This is a great place in of heart of Jackson Heights."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOXBlLWZREAE",
            "text": "Have been here many many times and never been disappointed. Love the food and services. Will recommend anyone who comes visit Jackson Heights to try this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxX1BmV2JBEAE",
            "text": "I absolutely love this place. Their vegan options are incredible, the staff is full of joy and love, and the ambiance is bliss. Can't wait to go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNHFfRkRnEAE",
            "text": "This is a gem in QB. Drinks are perfect. Food options are plentiful and delicious. Just be ready to order on your phone. However, traditional waiter can assist"
        }
    ],
    "reviews_count": 80
}