{
    "name": "Bistro Eloise - French Restaurant",
    "place_id": "ChIJaW0AKldfwokRZh8-LdwLkkY",
    "grid": "QN3",
    "address": "75-57 31st Ave, East Elmhurst, NY 11370, USA",
    "rating": 4.6,
    "user_ratings_total": 553,
    "phone_number": "(718) 440-9493",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ndE5Ua3hVR1JpYjB4bFFuVnhiVEkwWTJoUGNGRRAB",
            "text": "I look forward to each visit to this restaurant. They provide friendly attention in a relaxing space. The staff showed true hospitality with each request. The flavors they achieve are perfect. The entire experience here is well-executed."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaFRXZFhjWFUyTjFaek1WbEpiamhrUzFscWFWRRAB",
            "text": "Interesting place in a middle of a shopping center in middle of Queens..."
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dlVEQjNiRXh1WmtkdGMzbElPWFpPY1ZseGNGRRAB",
            "text": "Très bon . Très bonne ambiance"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdFN6UnBaM293UW1sc2RTMUJkVXg1VFZCemRVRRAB",
            "text": "Bistro Eloise was exceptional. The food was amazing, including the choices. The staff...amazing along with the service, and being able to speak French at a \"French\" Bistro est très rare. Merci!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSWNEWlhiRVJuYjNSdE9WVkthVTAyUW5scE5tYxAB",
            "text": "The steak tartar is amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oS01HUklMV3hPTUZKT00wNW1OMVJzZFdkRlJuYxAB",
            "text": "I've loved everything I've eaten here and service is polite and never stops hustling."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdFZHVkVVRFZPWlhvelRXdG9Zbk5TV0U4NGExRRAB",
            "text": "This is real French food at its best. Their Beef Bourguingnon is my absolute favorite but anything they serve is wonderfully done. The staff is relaxed and knowledgeable about wines etc. This is one of our family go to places. With parking!!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSb2RqSmhNV0ZITTI5MlRUZGxOWHBaYmxwUFVIYxAB",
            "text": "Hidden in a shopping mall area, non pretentious French restaurant with a lot of delicious dishes worth exploring. Eloise deserves to be a regular spot visited. Great food and very good service.Try it, you’ll not regret it…."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201Q05uRktha0ZMVkhWblZXTldWSGRSYW5SbVFYYxAB",
            "text": "\"Our server,David , was fantastic!He was very attentive, making sure our drinks were always full and that we had everything we needed. He also knew the menu inside and out, offering great recommendations that we loved.\" Can't wait to go back again !Merci bouquet DAVID !!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcFpXTnNMVFptV0dsMk0zZFFSMUJZYm1acFlsRRAB",
            "text": "This little French bistro tucked away in the corner of a little shopping plaza was the best choice that we made on a random Thursday.  Let's start with the server he was absolutely superb, extremely attentive, caring and thoughtful.\n\nNext let's move on to the food.   We ordered three appetizers. Firstly the baked brie was incredibly amazing, cutting into it the brie oozed out and paired perfectly with the honey and the balsamic.  It was a wonderful combination probably our favorite dish of the day.  Next was the mussels. They were tender and sweet to the taste, extremely fresh!! Lastly for the appetizer was the escargot a classic French cuisine.  The escargot was fresh and the parsley garlic oil was to die for.  Dipping the bread in the parsley garlic butter had my taste buds dancing all over the place.  For the 2 entrees we got the boeuf bourguignon and the le cassoulet. The boeuf bourguignon was amazing, tender, flavorful, where it all fit together like a glove. Lastly the le cassoulet was great.  The duck was fall/pull apart tender and paired perfectly with the white beans.\n\nFor the pricing for a French restaurant we thought it would be expensive, but the prices were actually fair.\n\nWill definitely come back to try more dishes!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMU5ERndjbTlFWkc1VlEyRjNVMmxGTTFnNVVuYxAB",
            "text": "I went with my girlfriend, the Lobster Bisque was light and amazing with some bread. The Filet Mignon was smooth and soft along with gratin side."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVU4wVnhhR1pLYkc1bldVUXpPVGs1Y2xOZk5VRRAB",
            "text": "Unfortunately had a really disappointing meal. Mussels were not fresh, steak tartare was more capers than meat and had way too much mustard, strip steak was flavorless and without any char, and the coq au vin was weirdly served in a deep soup bowl and drowning in sauce. The custard in the creme brulee had the consistency of flan and not even a hint of vanilla. Service was pleasant and the restaurant itself is nice, but the food was legitimately bad and the prices are very high, especially considering that the location is a strip mall in Queens."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLNzdfdFB0NU1lMWlRRRAB",
            "text": "The old lady stopped us at the entrance door  and my family who came to visit me … this lady has issues again s latins . It’s the fourth time she shower this bad attitude .. sad 👀"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaFdGWnZOM042WTNweE5pMWhkM2hLWVRsWFRuYxAB",
            "text": "I have been in this place with my husband multiple times. It’s always really good!\nIt got really busy on a Friday dinner. We were glad we made a reservation."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMV3QyY0w2cXFhYllREAE",
            "text": "Awful experience. To be fair, the food is pretty good but the service was awful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VOS3RnSWlqMHAxbBAB",
            "text": "This is our second time here. This first was for my birthday and the second for our anniversary. It just has that special place feel to it. The escargot is mind blowing as is the foi grois and pate. I ordered steak au poive both times bet it’s just that good. Above all, the service is amazing. We went on a Tuesday and there was one waitress for the entire place and she killed it. So glad I don’t have to go to manhattan for this kid our quality and experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VObm8zSjZNMGNDT3B3RRAB",
            "text": "Bigoted toward his own people! I've been to this restaurant twice, and both times, to be honest, the staff was really friendly. Although the proprietor is pleasant and sits people down, I went there with a friend for supper last Saturday. Like me, my Colombian friend saw the obvious on the waitress's face—that she is from Hispanic America —and made an effort to talk to her, asking her where she was from. In a disparaging manner, the waitress sent us to practice speaking English as we were in \"America\" and wouldn't speak Spanish. It's funny how this has never happened to us in any restaurant in Manhattan, and it's even funnier that the racism is from the Hispanic waitress in a neighborhood full of Latinos. It's not worth paying those rates for anything exceptional on the menu and having to tip someone as rude as the waitress when the meal is really mediocre. Never come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdmVMaGp3RRAB",
            "text": "Such a wonderful place. Amazing food and great service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvb3M3dGFnEAE",
            "text": "An explosion of flavors on my palate that left me in the most delightful culinary high of my life! Vincent is wonderful!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJa1otOWN3EAE",
            "text": "I’m just happy to be hear my son like to walk around the food was delicious, and the experience is always excellent"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ZzlmaUN3EAE",
            "text": "Superb\n\nThe best boeuf bourgignon I’ve had this side of Paris"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dDVYRFBREAE",
            "text": "10/10\nTop quality food, service and atmosphere! Such a gem!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NHE3NVFBEAE",
            "text": "Great food, great staff, fun place to go eat."
        },
        {
            "date": "7달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d05qUUpnEAE",
            "text": "Très bonne cuisine française"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncjRfY2h3RRAB",
            "text": "Small, intimate French restaurant with good food and staff"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncXIyVDVnRRAB",
            "text": "Wonderful Sunday dining experience. Waitstaff was pleasant, and the food was impeccable.\nWe will definitely return."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaXBEWmpBRRAB",
            "text": "Love this place.\nCordon Bleu is the best I've had.\nEvery other appetizer was perfection.\nWill be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURna0tuMWRREAE",
            "text": "I’ve been here many times. They don’t disappoint. Delicious food made well with attentive service"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnZ2FXVVdBEAE",
            "text": "👌🏽👌🏽👌🏽👌🏽👌🏽👌🏽"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOU1tMkdBEAE",
            "text": "I went there with my family to celebrate my grandma's birthday, and while we were seated fast (due to reservations), the drinks we ordered took around 10 to 15 minutes to arrive. The food took another additional hour. I realize that they don't have many staff members, but that doesn't explain why people who arrived after us got their food before we did. The staff did apologize, and when it arrived, the food was excellent, with sizeable portions. Overall, 3 stars, two deducted due to service delays."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbGFMSzVRRRAB",
            "text": "Don't trust the self-absorbed whiners scoring arbitrarily with ridiculous comments... This place has a French vibe, honest-to-origin recipes and cares for the customer. It is small and might get a bit tardy when it's packed, but I haven't been in a French restaurant in France or Switzerland that has a faster pace. Some \"Chef Michelins\" are questioning some recipes (judging from what a server told them in the middle of work), but I'm sure if they had the ingredients from Paris and the finest appliances they would have done so much better... Anyway, also $50-70 wine bottles - not bad, right?"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmM0k2UFZ3EAE",
            "text": "This is my go to when I crave good French food, duck breast is consistently perfect, well seasoned and cooked to perfection. The staff is very friendly and the prices are fair. I would highly recommend!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOTlHcWt3RRAB",
            "text": "Good service and food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbDZtck5nEAE",
            "text": "Easily my favorite restaurant now. I will be going here as often as possible.  Everything on the menu looked delicious and everything I ordered was delicious.  I had fois gras, coq au vin, and a nice red. You know the food is good when you and your company eat very quietly,  which we did. We were literally speechless."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MjQyczR3RRAB",
            "text": "Neighborhood gem, would come more often if it was closer.  Legit French fare with lovely staff. Always get the scallops!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aTVyeDl3RRAB",
            "text": "The food is so delicious and the servers are so kind. This is my favorite French restaurant in NY."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeC1uRkZBEAE",
            "text": "I was so lucky to find this gem. Amazing food and even better service. Welcoming and friendly. I came to NY to see Audra McDonald in Gypsy. I booked a cheap Airbnb in Queens and was lucky to find a place that would fit me in with little notice on Thanksgiving evening. Travelling alone, in a city I'd never visited...I went back several times. The food was delicious and I felt welcomed and comfortable."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaE03ajZnRRAB",
            "text": "Enjoyed a wonderful traditional Thanksgiving dinner tonight. Excellent wine.Cozy restaurant.\nStaff are amazing, so attentive - they made us feel very welcome and well cared for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaU9faU1BEAE",
            "text": "Very nice French bistro. Lamb chops, salmon, escargot and onion soup.  Very nice owner and staff also."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURua1p6MUhBEAE",
            "text": "I’ve been to this restaurant multiple times and will continue to come back. I order the duck breast and 3 of the specials and they were all really good. The only thing is that the food came a little bit later, but they gave us a crème brûlée on the house🤗🤗. The service is really nice and friendly. I love this place so much"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNnQ3Mkl3EAE",
            "text": "For the first time ever I’m kind of confused how to really grade this place.\nSome of the dishes are perfection, while others are so far from French cuisine. The tartare for instance, I asked what ingredients were in it and I was told ketchup along with other things that I can’t remember because as soon as I heard ketchup, I was turned off and avoided it all together. The French onion soup also left so much to be desired and lacked flavor. The beef bourguignon was delicious along with steak. Both dishes cooked well and seasoned perfectly. Then you move on to desert and $13 for a crepe without a filling and just some fruit on top is just way over priced for what it is. Other places at least fill it with canned whipped cream to be cheap and still give you a “filling”. I don’t know? Just a very strange place. It’s like they kind of understand French food but also don’t at the same time? It was very hit or miss like there are two different chefs in the kitchen and one is French and the other is like from another planet and is trying to understand what French food is. I have no problem paying for quality but I just don’t think this has the quality for the price. This place isn’t bad but I also wouldn’t say it was great and you have to give it a try. It’s a good attempt at French food given the areas I wouldn’t say Queens is really known for French food but for more authentic places or even places that are at least somewhat decent when it comes to French-American Bistro, I wouldn’t go here. However, given that some of the food was great, I think 3 out of 5 stars is fair. The main reason why I deducted a star is because the service was so slow and it was not busy. I guess they added the Parisian touch of making you wait forever to get the servers attention."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuLUp5M3J3RRAB",
            "text": "The best French  restaurant in queens excellent food excellent service"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOVBMN0tnEAE",
            "text": "Nice brunch place.  Get the mussels and extra bred to dip.   Great service and food.   Don’t forget to goto cannelle bakery next door when you leave. Another good meal.  Thank you!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOFpqNjFnRRAB",
            "text": "Very good French cuisine in East Elmhurst.  Very small restaurant.  Excellent escargot and  creme brulle."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidU1PcF9nRRAB",
            "text": "Excellent food, awesome service. Definitely look forward to visiting again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaWFXMzdRRRAB",
            "text": "Visited this restaurant  yesterday 7/28/24 for the first time. The exterior of the restaurant may not be appealing when you get there, but as you walk in, you will experience the magic of the food the service and the music. Everything was perfect and Lorali  is an exceptional and awesome waitress. I must return and recommend ❤️."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNnJXLXpRRRAB",
            "text": "Always so delicious! Authentic, French comfy food well worth it! Food is the winner here. I’ve ordered multiple dishes multiple times and haven’t disliked anything yet!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieW9iUDVRRRAB",
            "text": "It was my first experience trying french food and I only can say \"the food was DELICIOUS \". Great experience, affordable prices, you feel like home, service was very attentive. Totally recommend this restaurant if you want to experience good french food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKM01TYkxBEAE",
            "text": "Me and my girlfriend have been to Bistro Eloise before, and it’s always a treat. This most recent video was no exception.\n\nWe sat down a little bit closer to closing time than we would have liked, but the server was so kind and welcoming anyway. We even tried to order dessert early, since we knew they were getting close to closing, and the server assured us there was no rush and that we should just relax while enjoying our dinner.\n\nIt was a great experience, and the food was delicious as ever. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMLU9EQkZBEAE",
            "text": "The scallops appetizer was very good. The mussels were very good. But the steak was almost inedible. It was tough, dry, and tasteless. But because I didn’t have lunch, I was so famished I ate the whole steak. Very hard to chew and swallow. The sauce for it was good though.  The mojito was good also."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0aHM3d3ZnRRAB",
            "text": "The food is delicious. I ordered the salmon (saumon à la ratatouille) which was really good, I paired it the white wine Sangria which was also good. Finishing off with my favorite dessert creme brulee, 😋. The aesthetic is unique and the atmosphere was welcoming. Overall, highly recommended💚."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqblB6cll3EAE",
            "text": "The food was amazing. I typically don't get wow'ed by food because I like and eat Flushing and there's a lot of good food everywhere, but I was already planning my second trip here as I was eating dessert here. The people here were also sooooo nice, I don't know why I'm so jaded by humanity, but the kindness blew me away in addition to the food. We had a baby with us and she was getting hungry too; when I tell you the owner (I think she was the owner) dodged and backflipped to get that hot water and cool water to us, I couldn't believe it myself. The sincerity I felt at this place felt almost familial."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhXzdxZ3pnRRAB",
            "text": "While the French food is really good, the service needs to improve. It takes 2 waiters to wait on 8 tables and they are slow. The food is amazing and you feel like you’re in France with the food and ambiance. They waiters take forever to give you bread and water at the beginning of your meal and the French bread wasn’t hot. The Brie and crepe was amazing and flavorful. I’d go back for the food but expect a wait."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkOWNmZjlBRRAB",
            "text": "It was an authentic french experience!\nI had the french onion soup, that was sooooo tasty… probably  without doubt the best french onion soup I’ve had, and as entree I had the Chicken cordon Blue,and for sure was the best ever! So creamy…so tasty…green beans and purée with perfect season and butter.\n\nMy husband had the Steak au proive  which prepared exactly to his  liking, and the chocolate mousse was superb cuz I tried!\nMake efforts to visit this place, and I give you my\nword that you will have a great experience as we had.\nThe staff of the restaurant was so kind and attentive .\nFor sure we are coming back!\nEnjoy the food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0enFHc1RBEAE",
            "text": "A real bistro!  Great French food without ceremony. Not the stereotype “big plate with little food”.\nThe escargots were swimming in sinfully delicious sauce that invited serious mopping - scarpetta!\n\nThe mushroom sauce around the risotto was reduced perfectly to create intense flavor that complemented the delicately seared scallops.\n\nAs usual, Ron and Pauline’s recommendation did not disappoint.  Merci beaucoup!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUZ29HeFV3EAE",
            "text": "The food portion served were larger than I expected. Food were excellent especially the French Onion soup. The baguette was great. The dessert were fantastic!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MmZXbmhRRRAB",
            "text": "Bistro Eloise is a hidden gem in East Elmhurst, New York, and a local favorite that never disappoints. This charming French restaurant has consistently impressed us with their delectable dishes. We often choose it for special occasions, as it provides the perfect setting for a delightful dinner. Their sangria is a refreshing and delightful choice, and it perfectly complements the rich and flavorful dishes on offer.\n\nThe ambiance is cozy and inviting, creating a perfect backdrop for a romantic dinner or a celebratory meal. The attentive and friendly staff add to the overall experience, making every visit memorable.\n\nBistro Eloise is a place where we savor the flavors of France without leaving our neighborhood. It's a genuine culinary treasure, and we look forward to many more special occasions spent enjoying the wonderful food and warm atmosphere of this charming restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoanUyYmRnEAE",
            "text": "We went for brunch but mostly orders off the regular menu. Food was veryyyy yummy, had bright and classic flavors, and it looked nice! Definitely think regular menu items were a little better than the brunch items, which were fine but just not as amazing. The octopus and chorizo was my favorite dish, though the baked brie was a close second. Also had some really great deserts and drinks. it’s a cute and homey spot with delicious meals! definitely recommend  eating here!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyanNYeHZnRRAB",
            "text": "The most authentic French restaurant in Queens. Came here to enjoy a girls afternoon brunch with a bottle of wine. Staff was so friendly and the food is amazing. Foie was creamy and sweet. Escargot was delicious with the right amount of garlic and butter. We will be back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwbGQ3NzlnRRAB",
            "text": "Great service and the escargot appetizer was delicious. I was very underwhelmed by the duck main course, however. I ordered it medium, and it came out pretty well done, and rubbery. The worst that I've ever had, unfortunately (I almost sent…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsN2RINEhBEAE",
            "text": "Their food is simply well done. 2nd yr to celebrate Thanksgiving there and first time I had the turkey and it was deliciously superb with a non watered down great tasting gravy. Would probably do Thanksgiving there again and get that turkey dinner again. Their appetizers are soooo good and we had the tuna Salmon tartar Escargot."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMXJ5TTlBRRAB",
            "text": "Our friends who live in Queens are regular here. In fact my wife ate here on her last trip to NY and raved about Bistro Eloise.\n\nVincent, the owner is charming and very welcoming.\n\nI started with the Les Escargots au beurre persillé, snails in garlic butter sauce. Good but not garlicky enough. My wife tried the  French Onion Soup Gratinée.\n\nFor mains, I ordered the Boeuf Bourguignon,  braised Angus beef stew with carrots, pearl onions, mushrooms, bacon served over mashed potato, Just fair.\n\nMy had the La Crepe Forestiere, chicken, creamy mushroom sauce, swiss, and mushrooms. She said not as good as the last time.\n\nFor dessert,   Chocolate Mousse, the best thing.\n\nSmall and limited wine list."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyODhqZ0pnEAE",
            "text": "Took my here for Mother’s Day, and though there’s a bit of a wait time with service, it’s all worth it because you can see why it takes a while. The food is splendid, service is sweet and excellent, and the desserts are phenomenal! Would highly recommend anyone to go here, but please do not come and complain about the wait times, if you’re in a rush, this is not the place for you. But if you’re willing to wait, you’ll get treated to delicious food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseE51cS1BRRAB",
            "text": "A feel of being in a Paris bistro with food that lives up to the experience! Perfect for a special occasion or when you just want an awesome meal! The servers were welcoming and helpful, adding to the experience!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhNDh5OHJRRRAB",
            "text": "Very attentive, friendly service. (I believe it was the owner!) The food was good as was its presentation, the menu straight forward and appealed to all tastes, the selection of wines was good and befitting the food menu. We really enjoyed it my wife & I!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTOV9ENklREAE",
            "text": "Great food, great service. We sat outside in tent & they have warmers above you in each table. Had the french onion soup and it was exactly what I expected, super good taste and the cheese was good. My friend had the ginger carrot soup and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHeGZyTndBRRAB",
            "text": "Wonderful authentic French bistro unexpectedly tucked in a neighborhood shopping center. I’ve been coming here for a few years now and every time is fantastic. Their onion soup with homemade broth is delicious as well as their savory crepes and sandwiches- there truly isn’t a questionable item on the menu. Their wines are expertly selected and taste great. Dining-in is a relaxing experience and every waitstaff I have ever met has been kind, attentive, and professional. Definitely will be coming back again and again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZdnE3bVpREAE",
            "text": "Paris in Queens? Sure! The staff is friendly and the food is scrumptious. Everything was delicious and savory. Appetizers I recommend, the baked brie and escargot. Entrees: the Mussels and the grilled Lamb chops were very good. The duck was a favorite."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OFBpcDBnRRAB",
            "text": "Don't bother flying to France, just come here. The owners are from Brittany and it shows. Every item I've ordered in my multiple visits has been excellent. Friendly staff too! I love Eloise."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaTlTQ0RREAE",
            "text": "Adorable French Bistro much needed in the   the neighborhood . It's become our go too place for lunch . The Salmon Burger and the Muscles are delicious . Friendly staff nice out door seating area."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLX3VmM2xRRRAB",
            "text": "My favorite place in the entire neighborhood, Jackson Heights included! Amazing food and a great staff as well, if I had the time I’d eat here every day I would 😅 Here are just a few of the wonderful meals I’ve had! (My favorite was the côtelettes d’agneau)…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXbXM3eE93EAE",
            "text": "First time trying escargot, AND IT WAS AMAZING!\n\nMy sister suggested we have lunch here since we grew up in the area and needed a low key girls day.\n\nBistro Eloise is such a pleasant surprise in Queens. The staff is amazing, super polite, funny and just overall helpful.  They also very Covid safe with masks, hand sanitizer at each table and the entrance, as well as both indoor and door dining.\n\nWe ordered the escargot, tuna tartar, croquette monsieur and crème brûlée for desert. Of course I had myself a ton of margaritas and the cappuccino.\n\nIt’s an easy walk from 74th street & Roosevelt or from Astoria Blvd. I walked from Astoria on the beautiful Saturday and it was great."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxd0lMdmVnEAE",
            "text": "The food was incredible! Unlike any other grilled cheese i ever had before! The aperol spritz was delicious too. Lastly, the service was impeccable!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhMHVqRjB3RRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ + more. I can’t really say what delicious genuine French food is. We had an amazing time at the bistro. Vincent and David were very gentle and respectful. Merci🦑🐌😋…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtcU1Qc1J3EAE",
            "text": "Great food at a good price. Cute French restaurant, with friendly staff and atmosphere. Definitely go back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2bHJEVUpBEAE",
            "text": "The most amazing French spot in all of Queens, in the most unexpected location in a strip mall. You must try the escargot, mussels, and chocolate mouse. They made us a Berry crepe as a special request"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZeXFqME93EAE",
            "text": "Chic French restaurant located between 31 and 30 Ave on 77th Street East Elmhurst. They have patio outside and nice table indoor. Burger and their steak cuts are delicious. Plenty of parking available in front of the restaurant."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpeE1hN2t3RRAB",
            "text": "Delicious food,great service,reasonable prices😍\nSupport local business💪🏻💪🏻💪🏻\nDefinitely will go back👍🏻…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcEtuRDFRRRAB",
            "text": "Following a recommendation from a friend.\nMy wife and I enjoyed both our meals.\nThe Mrs had a Crepe and I had a Burger (picture below) I was pleasantly surprised that a very good mixed green salad came with my meal, normally it fries the salad option.\nMy wife enjoyed her Crepe and Mojito.\nPrice was affordable.\nThe girl that took our order was pleasant to us and other patrons.\nWe sat outside under a nice heated tent.\nWe will go back."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDci1DNHlBRRAB",
            "text": "Surprising and wonderful place to eat.  I did not know, I did not expect, that in a parking lot there would be a French place, with such good attention and such good food.\nRecommended!"
        }
    ],
    "reviews_count": 80
}