{
    "name": "Angel",
    "place_id": "ChIJ1wuWgyxfwokRsawxQvB8hMo",
    "grid": "QN3",
    "address": "75-18 37th Ave, Jackson Heights, NY 11372, USA",
    "rating": 4.7,
    "user_ratings_total": 3590,
    "phone_number": "(347) 848-0098",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WWFtdDNlSEl0UW5kUFdIa3dVbmN6ZEd0TUxVRRAB",
            "text": "it was a lovely experience! The food were delicious every dish was bursting with flavor. We had butter chicken, bhindi masala,  aloo tiki chat, paneer pb35. Plus garlic naan and fave amul cheese naan!  We also got mango lassi. The service was warm and attentive, making us feel right at home. The cozy atmosphere made it the perfect spot to relax and enjoy a great meal. A special highlight was getting to chat with the chef himself Chef Amrit!  such a friendly and passionate person who clearly loves what he does. Can’t wait to come back!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaWJYaENPRXhpT0daTGNqZDRiR1F3WmtaU05WRRAB",
            "text": "Had lunch here yesterday and was very pleased. Nice comfy interior, very attentive and welcoming. Food was very good, nicely presented and decent sized portions with plenty of options. Also cool that although theres no bar its BYOB."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTlpFTkxhVmxLUzFaSVExSlNiMnRFZDNrellsRRAB",
            "text": "Fantastic food and service. Some of the best Indian food I’ve had, period. And I’m very picky about Indian food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSWRqUnVUSGN3VlZGQldsRjVkMVJOTlZWNVozYxAB",
            "text": "Best Indian food in NYC"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaWMzbzVPVGRXUkd0dU5VOUNWRkI0YW5wTk5HYxAB",
            "text": "I grew up in New York City and have been eating Indian food all over New York City as an Irish American, so I am by no means an expert, but we had a wonderful time here and the food was incredible. We have been meaning to come to Angel for quite some time as it was highly recommended to us by a friend so we came and  we ordered our “usual Indian food order” but instead of getting a chicken tikka masala, we got lamb vindaloo. I have been on a hunt for chili chicken for a long time. I primarily have not found it because it has been too hot. We came to Angel and we had samosas, the lamb vindaloo, the chili chicken appetizer, which is called something else here (chicken PB 35 appetizer) but it is AMAZING, and the saag paneer. Everything was incredible. The saag paneer was so fresh and so flavorful, it was not overly blended, which I really liked. The chicken PB 35 was one of the most flavorful things I’ve ever eaten, while it reminds me of a chili chicken it wasn’t too sweet and the chicken was not overly breaded or fried which I really enjoyed. The lamb vindaloo was good, but I almost wish that I ordered what we normally get which is chicken tikka masala but it just means we have to be back! The service was amazing. We will definitely be back.\n\nThe place was packed with people because it’s like a really good restaurant, we called ahead and made sure that we didn’t need a reservation. I can’t speak to a bigger crowds or groups. We also had a late dinner like 8 o’clock. I’m not sure if they would be harder to get into an earlier time or not. We were sitting really close to people in front of us and behind us. The girl behind me kept flipping her hair at me, but I just moved and got out of her way. I highly recommend this place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201M1YycHVjWEZtYTJrelZrUnljMjFNT0UxV1NVRRAB",
            "text": "Good food- chicken biryani, chicken kadai"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSU56QnhURTk2TkZoSU1GcHhSWEJ1ZVdobFRVRRAB",
            "text": "The service was attentive but rushy. A table of ten people and they literally gave us the check before we were not finish eating. Not even offered dessert until we requested. Still they placed  check on the table. The waiter came to the table and asked us to get up from the table to sit other people. The whole diner time was probably  a little more than an hour. We felt awkward, rushy and unwelcome. Suggestion if you have a time limit tell your patrons when making a reservation\nExcellent food!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQlFXNDRVVFp0ZWxkNVVuQlFTV05NTkVSSlVuYxAB",
            "text": "Incredible food, impeccable service. BYOB. This place is HEAVEN, no wonder it’s called Angel."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNGIyTjJaREJSUmtadk9HMWxlbWRJWDFkdlFVRRAB",
            "text": "I had a wonderful event a bunch of elite yelpers at Angel Indian Restuarant located at 75-18 37th Ave in Jackson Heights NY 11372 which is up the street from its old location. This new location specializes in serving groups. We had a group of 12 people and the staff function well while still being able to focus on groups of smaller sizes.\n\nThe menu is as follows: Appetizers were Mumbai Bhal Puri and Dahi Batata Puri both were very new for me, and I enjoyed them tremendously.\n\nEntrees: Lamb Madras- this was a very good dish especially if you eat lamb. This was very tender and delicious and cooked to perfection. Chicken Tikka Masala- this was also delicious and my favorite. It has a smooth taste, and the chicken was very tasty. Goat Dum Biryani- Very delicious while the meat was falling off of the bone. Lotus Root Kofta, Basmati Rice, and the Kalonji Naan (black cumin naan) are also delicious. The\nBasmati Rice seemed lighter that than the normal rice.\n\nI arrived very late therefore I did not have time to take pics and notice the aesthetics. The service was tier 1. We had someone at our table the entire time we were there providing exceptional service.\n\nThere is a parking lot located just past 37th Rd on 75th street not too far from the corner just in case you can't find parking. Reservations is a must and there is a penalty fee of $25 for no show, credit card information confirms the reservation."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUGRFSjVjSEZoWlV4SlJFMW5SSGxLTlU1TVNIYxAB",
            "text": "My favorite dish was the Goat Dum Biryani because of how it was presented.  The server cut the crust at our table, revealing the velvety-soft goat meat inside.  I also enjoyed the Mumba Bai Puri.  I will be back to try more dishes on the menu."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sc2RVRnhibXBLV2tweWNqQnNRME13V0RGNU5sRRAB",
            "text": "First time visiting and I will be back for more! Excellent food!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNmNVSkNia2RuVUdWeGFubE5SSE5zYjJWR1EzYxAB",
            "text": "Had lunch here yesterday and was very pleased. Nice comfy interior, very attentive and welcoming. Food was very good, nicely presented and decent sized portions with plenty of options. Also cool that although theres no bar its BYOB."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdU5uRlBSa2syTVdWbGJIZzNWRXhzTTFkRE4xRRAB",
            "text": "Recently tried this restaurant whixh was highly recomended. we tried the following; peshwari Nan which was delicious, butter chicken which was perfect with the vegetable biryani. i would come back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWb1EyVkxObUZOY0c1aFQxVjRkMnRQUVZWS2RVRRAB",
            "text": "Chicken vindaloo is tender, spicy and 10/10 delicious!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kZllUSlhNRk5PVFU1YU1tNXdVa3MwYkc5eFIwRRAB",
            "text": "Very supportive staff and delicious food. Must visit if you are in NYK"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZd2IxUXdVRlZTTm1aSVdsOWZMVkpMWjFrMmVuYxAB",
            "text": "Amaze"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdFRsSmpTSE5CYlZFMmMxaGZRMWhHVEU5ZmVFRRAB",
            "text": "We usually only order out from here so we’re absolutely shocked by the change in location (well - more accurately, the change in atmosphere).\nIt feels much more “fancy” but, based on my visit 2 months after the move, the food is still bomb. I’m not vegetarian but their Saag Paneer & Saag Tofu are still the absolute best I’ve ever had and I order one of either of them every time. The staff are also so incredible sweet and kind. I’m glad to see that they seem to have kept everyone from before.\nI kind of miss the old atmosphere but am happy for them that they are now able to seat more people and get more customers."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MGFIbFpXVkZVWWxsQ1luWkRUVkJ6TlZNMFkxRRAB",
            "text": "Horrible food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MlJYQnJWa3BhY0RKalVHZEZRa2xaTkhKSE9WRRAB",
            "text": "Tried to book a reservation through resy but it was not working. kept saying that the venue doesn’t accept payment reservations. Then I tried calling the restaurant and he immediately said he cannot help me."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204dGRtWkRUVGxrVldFek0xUkZTRWRYTFdNdGFIYxAB",
            "text": "AMAZING meal!! some of the best indian food i’ve had. We got the lamb briyani which is a must. personal fav is also the saag paneer on the garlic naan.\n\nig: @jerica.feasts for more nyc food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cFkwbFNaWEJoTlZKQ1MwSkZRVmRNU2xoMGRsRRAB",
            "text": "The food was really good! I ordered the Chicken Tandori, the samosas and the samosas chat, all were flavorful and presented very well. The service was speedy and the atmosphere was nice. I would definitely come here again and try some of my other favorite dishes !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNVpVeEdaa1ZLVVdWclltUnpZa2xqWkdwV1gwRRAB",
            "text": "Halal indian spot on Jackson Heights. This is their newer location on 37th ave. We went on a Saturday during peak lunch time, it was about a 15 minute wait. The inside looks nice and has a clean ambiance. It's a bit narrow so it can look quite crowded, but it goes pretty far back. We ordered the crispy cauliflower, paneer tikka masala, saag paneer, chicken tikka masala, and garlic naan. Food came out so fast! Soo good and flavorful!! Service was very accommodating and friendly. Had a great time overall, can't wait to stop by again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxblgwZGZiSGMyVUROV05IZDViWGRPVmxWQ2IzYxAB",
            "text": "Awesome food, Courteous service.\nWas a bit loud, but felt like India!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVWRGZE1iV1pYZUVab2J6QmpkQzB3TFdsaWJFRRAB",
            "text": "No longer a local secret, now just simply the best Punjabi place in NYC. Better than a lot of places in India I've been to too.\n\nGet something featuring the freshly made, creamy paneer, like the veg biryani or Amritsari kulcha. The menu's gotten a little bigger since they changed locations, and some of the South Indian stuff on it (like the prawn moilee) is excellent too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wd1JVcGFUbmxHTkU5Rk5GVnNaWEJ4WlRGaldsRRAB",
            "text": "Worst customer service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONlZVTXROR3RRUlZGTWJqRm9hM1pXUTBKT1RWRRAB",
            "text": "Pretty good food. Crazy good service, such nice and enthusiastic staff. Unbearable price for NYC.\n\nNaan, biryani, curry. All good! 10/10, would recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTWFsaHdaamMzUlVneFZGSnJTRlZqY1ZWdVZuYxAB",
            "text": "Angel Indian Restaurant is an absolute gem in Jackson Heights! The food bursts with authentic flavors — especially the dum biryani and paneer PB 35. Cozy atmosphere, attentive service, and every dish feels prepared with love."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dVVTMVpZMWRxYWpReWNuRkdaRU5ZWmtOYVVIYxAB",
            "text": "There is an old location and a new location.  As of today, the old location is closed and it is being remodeled.  Look up the new address online.\n\nThe menu is great.  East Indian fare.  The food is amazing.  Everything looks really good.\n\nThe aesthetics of the dining room look new and good.  The waiters wear black suits.  This place appears like a good  place for a couple or for entertaining out of town guests.  The service is prompt and polite.\n\nI had the chicken marsala.  Also, garlic nan, plus mango lassi.  It was a great choice but everything looks good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeVVFSlhSbGh6VUY5U2VVWllXV1ZwU3psVWFIYxAB",
            "text": "Despite a one-hour wait time, Angel Indian Restaurant was worth every single minute. We put our name down and were pleasantly surprised to get a text back in just 30 minutes!\nOnce inside, we ordered some Kingfisher beers to start and dove into the menu. The goat biryani and chole bhature were the stars of the show. I've tried Indian food all over the city, and honestly, this meal was a complete winner in every way. The flavors were authentic, rich, and truly exceptional.\nAngel Indian Restaurant is a must-try for anyone who loves genuine, delicious Indian cuisine. I can't wait to go back and try more of their incredible dishes!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ1FuSmFURmRCZURsdmVGWlRjSFZxYlVkWlJIYxAB",
            "text": "AMAZING! The food is so fresh and is some of the best Indian food I’ve ever had. The service is incredible, everyone is so kind."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKYVJVdElaSFpyUjA5Q2JXTjNjVGxVWW5Wck9WRRAB",
            "text": "Had some of the best chicken dum biryani and punjabi food here. Some of the best Punjabi restaurant food you'll get in NYC guaranteed. Waheguru ji ka Khalsa Waheguru ji ka Fateh"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMVYxYzFiekZaZURsd1VtTTRUR293Y2pSM1QwRRAB",
            "text": "Stepping into the new location of Angel Restaurant on 37th Avenue it's a definite upgrade, with plenty of seating that makes it feel much more relaxed. The staff was incredibly attentive and friendly, adding to the pleasant atmosphere. For appetizers, I tried the samosa chaat, which unfortunately fell a bit flat. The flavors were there, but the execution was just mediocre, and it didn't quite live up to my expectations. However, things took a turn for the better with the main courses. The chicken tikka masala was truly exceptional. The chicken was tender and cooked perfectly, swimming in a rich, flavorful, and wonderfully spiced sauce. It was easily the highlight of the meal. I also really enjoyed the Amritsari paneer kulcha and the garlic naan. The bread was warm and crispy on the outside with a soft interior, and the paneer filling was savory and delicious.The masala chai was also a bit of a letdown—it was drinkable, but the spice blend was nothing special, making it feel pretty \"mid.\"The main drawback, aside from the appetizers and chai, is the price point. For its location, it feels a bit expensive, which might deter some diners."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWFpucFNUWEZSVEZwYVJqQTNUVTlrWmtGMlZVRRAB",
            "text": "They recently moved to new location.\nThis was my first time visit.\nI tried Pain Puri and Panjabi Lassi.\nIt was just perfect....\nAbout service?  They are really friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVVdsQmFNVUpFTlVST1JEbENUR041ZDE5UlEwRRAB",
            "text": "I did a review a number of years ago in which I pointed out that Angel Indian restaurant is one of the finest I have ever been to, and Indian food is my absolute favorite. I have not been there in a couple of years due to health issues, and I live long distance from there. I finally got to go back the other day, and one always worries that our favorite restaurants Are inevitably going to go downhill. I am happy to report that the food has only gotten better. When you order the saag paneer, you will be blown away by it. Unlike most restaurants that seem to use frozen spinach, you could see the fresh spinach leaves in this dish. Almost no Indian restaurants could possibly be this good. The samosas were the best I have ever had, and I told my nephew and his buddy there, and they agreed. My nephew was raised on homemade superior quality Indian food, and he cooks himself. There was a dish that I had never seen before, vegetable moilee, and it was insanely creamy and addictively tasty. I must admit, we also had the aloo baingan (eggplant and tomato) and bindi masala (okra), and nothing there disappoints, to which I will add that I normally hate okra. I wish they still had their kale pagoda appetizer, which was unique and scrumptious, the vegetable korma which was impossibly delicious, and the malai kofta (again, theirs is the best!). Chef Amrit clearly created this restaurant as his love child, and it shows. You cannot be this good unless you decide to make sure you are the best! Chef Amrit succeeds!!\n\nMy one complaint in my original reviews soon after they first opened, was that the restaurant was too small, so they needed to expand; I predicted that they would do that as they are the best Indian food in Jackson Heights if not NYC. I was happy to learn that they opened a second restaurant only a five minute walk away. The maitre d’, Moon, handles the two restaurants like a pro. We went into their original location, and Moon keeps in contact with the new store to make sure customers are seated as promptly as possible. He is friendly and truly competent, providing outstanding service. The new location is fabulous. Excellent decor and a great atmosphere. Coupled that with this outstanding food, and you have the best happy meal in the world.\n\nMy advice is, if you absolutely love Indian food, you must go there! I know what I am talking about here. My favorite Indian restaurants have been in Britain, and a strangely great hole in the wall in Berkeley, California. There used to be several restaurants here in New York that I loved, but they are gone for years. There are not many in this league.\n\nPS If you have never been a fan of Indian food, this is the place to start. Whether you are a meat eater or vegetarian, check out the vegetarian dishes I just described. No Indian meal is complete without a great samosa and saag paneer."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210YU1tVjNiR1Z6UjJwR09UUkhTek5HYVd0RGFYYxAB",
            "text": "Really sweet staff and delicious spicy food. My favorite was the garlic naan and the lamb vindaloo, love how they put potatoes in it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMU5uSjRhWE14ZGxsa1VsOUtWbEZxY0dKeWQzYxAB",
            "text": "Not good response for delivery guys."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keWFqUTRTRTlhTjI5RVdVWllORFF6WVVvM1ZsRRAB",
            "text": "Very, very mediocre food I did not like the sitting area or the food. Don't waste your time"
        },
        {
            "date": "2달 전",
            "language": "zh",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaVdVUjZaWE5HY0Y5UGFVbENXV3RTWkhOSlVrRRAB",
            "text": "它就像是膨化米加酱汁、辣椒和花生，真的很好吃。他们还提供了脆脆饼作为开胃菜，配上美味的薄荷酱（虽然没有罗望子），但他们给了足够的脆脆饼。然后主菜我们吃了羊肉罗根乔希、羊肉比尔亚尼饭和鸡肉萨格，配上一些米饭和蒜香烤饼。"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMFVIaHFjVGxzVkdObFpscEhkekJOYUVscmMzYxAB",
            "text": "We picked up from this place for dinner and the food was delicious! The lotus root kofta and the paneer dishes were all amazing, and the naan was a perfect side for all the gravies. We also heard that the lamb and chicken dishes were good. Will be revisiting!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTFJUVmFOMmxWY3pBNFFqbHNlVkZUTkhZeFNWRRAB",
            "text": "Lamb briyani and gulab jamun were great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWaVNFcGFZa05aVlY5WU1EaHhhSE5RVlV0TFdVRRAB",
            "text": "Visited on a Saturday afternoon, when there was awesome Bollywood music playing. Great banger tricks from 90s and 2000s - whoever picked the set, great stuff!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKalJWaDFRV2xxTVZScVIxSk9RVUpvVDBsQ1ZWRRAB",
            "text": "Sooo good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTmVtbFNSV2R1Ums4eE5uWjNlbE5KUjNSRk9XYxAB",
            "text": "I recently visited angel and i had wonderful experience, the food was flavorful and authentic."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRGQwTm9aMnczZGtsQlVtVm5aVnBDY0ZZelltYxAB",
            "text": "i love this place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWR1pDMTJNbGxHZERocFlqVlpiakJEVUdSSFlrRRAB",
            "text": "I recently visited them. Just a heads up you gotta do your reservation prior a day or two. Because they are very rude if you don’t do reservations. For weekends, 3-4 days prior. We waited for 40mins to get a table and got biryani and keema pav. Keema pav was decent however the biryani was heavenly. Not to brag but I saw an American with 10 dishes on his table and he was eating as he found heaven, messy but finger licking good. We paid somewhere around 50$ however the portion size is smaller than average.\n\nThe place is very small and the prices are higher than manhattan Indian restaurants.\n\nHonestly I wouldn’t go there again because of the behaviour and rudeness. And they should have added that you should do the reservations prior. Felt a little embarrassed."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNl92QVRBEAE",
            "text": "Update: came back in 2025 and was disappointed by the aloo gobi, it was watery and not as flavorful. I really hope it was a bad day, but all the food just seemed mediocre and we were being rushed out. What happened?\n\nWOW. Just WOW. The best Indian food I’ve ever had, on par with being in India. I wish I took photos of the food first because it was equally as appetizing as it was delicious, but we were so hungry we couldn’t help ourselves. We had the aloo gobi, chicken madras, mango lassi, and garlic naan. Every single dish was fantastic. We will be back again and again. Thank you!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNElTck53EAE",
            "text": "Best Indian food I’ve ever had!!!! So authentic. The butter chicken and the biryani were out of this world!!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odFRYVTBaVVZhVjFBNGEwVkVObEJxZVZoMFZsRRAB",
            "text": "My favorite Indian restaurant in NYC has just opened a new location this week at 75-18 37th Avenue, Jackson Heights, NYC.  The cuisine is as delectable as ever, and both the ambiance and presentation has been elevated to provide a truly unforgettable dining experience."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WlVuWjVSa3RRTTFock1IZGxXR1IyT0VNNGNWRRAB",
            "text": "Recent second visit to the place was a bad experience. There's a guy, maybe the manager or doorman or whatever, who stands at the door, he was rude, arrogant and not welcoming. He signalled the waiter not to talk a lot with us. Food was good for that moment but turned stale the next day. Overall not that good experience, and not expected from an Indian restaurant to forgot its culture of welcoming guests, and just do the business."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqX1p1d053EAE",
            "text": "This restaurant  is simply  over exarated, u have to pay in advance for booking, over price on menu, biryani was spicy not taste as it was supposed to be its pack with customers prices are really  high????"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0b2NyX29BRRAB",
            "text": "여기 레스토랑을 가기 전날에 예약하고 갔습니다.\n레스토랑은 작은편이고 문이 열릴때마다 상당히 춥습니다. 코트를 벗고  식사를 할 수는 없습니다.\n제가 주문한 Butter Chicken 카레와 Lotus Root Kofta는 상당히 맛이 좋습니다! Naan도 갈릭과 스윗난으로 주문했는데 둘다 상당히 맛이 좋아요.\n다음엔 다시 가서 다른 메뉴로 주문해서 먹어 싶을 정도로 아주 전통적인 인도 요리 레스토랑입니다!!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNnRHODBnRRAB",
            "text": "아주 맛있어요, 뉴욕에서 최고수준의 인도 음식점인긋 합니다"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMTVEdTVnRRAB",
            "text": "음식 맛있어요~\nGood food and friendly Adnan"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toalFUSjVWSEU1YjFGaE0wNVpVREE1ZDFSTmVIYxAB",
            "text": "The food was mediocre, I didn’t find anything more special. The price can be much lower given the location because with this price length, you can have everything the same in manhattan with a better setting and vibes.\n\nService was rather underwhelming, we felt extremely forced to rush out while we normally a quick dinners. The service was on a poor side especially when the server (seemed like the captain or head service) forcefully took the plate of appetizers off our table regardless of my partner being eating from that plate still was awfully rude. I understand that they have only few seats and needed to turn the tables, but taking food out of customers when they’re still eating is another level of horrible service.\n\nDon’t feel like a nice place to dine in."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPeVJsYnVJMDZLMEtREAE",
            "text": "In this small restaurant in Jackson Heights we made a reservation for my girlfriends sister's graduation dinner. We had a spot for 9 we probably had to wait about 10 minutes but it was so worth it. We started with mango lassi ($4, nice price) and Mumbai Bhelpuri (my Bengali girlfriend referred to it as sweet jhalmuri) she was so happy to have this because she enjoyed it as street food back when she lived in Bangladesh. It's like puffed rice with sauces and peppers and peanuts, it was really good. They also gave papad to start the meal with a delicious mint sauce (no tamarind though) but they gave plenty of papad. Then for the main dishes we had Lamb Rogan Josh, Mutton Biryani and Chicken saag with some rice and garlic naan. The lamb Rogan Josh was fantastic, I'm glad we got a lot because the flavor at the restaurant was delicious you could taste the autumnal spices and it had a nice kick to it, but when you have it after it's had a day to sit omg the dish comes alive. Also they didn't skimp on the meat we all had plenty and there was leftovers also no bones which I saw as a pro. The Mutton Biryani was presented so nicely they bring out a pot that was topped with a layer of naan, it was a very nice touch. The flavor was magnificent nothing really was center stage but you could taste the saffron the coriander the pepper, the cardamom, everything was in harmony. This did have bones but the portion of meat was excellent. They gave plenty of raita which brought a much needed coolness to the dish. We had a big portion to bring home, but it went quickly. Then the saag was very well made, though I've normally seen it made with cream (that may have been a regional thing) but the chicken was good quality and plentiful (maybe could have been cut differently, but just a suggestion) and the spinach was tender and had no hint of bitterness just absorbing the flavors of the sauce. I'm not sure if we would order this again but it was healthy and very tasty. For dessert we had a ras malai which was probably the best ras malai we've ever had, creamy perfect texture and very flavor while still being delicate. The service was excellent and the price was fair for all that it was a bit above 100 dollars and well worth it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLTE5NmFGeDRILVBnEAE",
            "text": "Indian food being one of my favorite cuisines ever, Ive been so excited to visit Jackson Heights, and more specifically Angel.\n\nThey serve free papadum to start which was so nice!\n\nI started with the Pani Puri which was excellent. I just got back from playing tennis and the pani was extremely refreshing. There was a tiny bit if heat too it which made it cooling but with a kick! I loved this a lot.\n\nThen I tried the Chole Bhature which was fireee. The chikpeas were creamy and the sauce here was super interesting. I honestly didn’t know what to expect because this was my first time trying this dish but I was pleasantly surprised to get sort of a fall spice essence! It really reminded me of pumpkin with cinnamon. It came with some onions which really lightened up the dish too. The bread here was incredible. Very large, super crisp on the outside but was still a bit soft inside.\n\nI also got the Saag Paneer which is my default at every Indian restaurant. I will say I am a bit partial to more blended saag paneers and this one seemed to feature whole spinach leaves, but the flavor was still great. Actually different than most saag paneers Ive had but I liked this variation of it. But I need to give a special shout out to the paneer itself here because WOW that is some of the softest creamiest lightest paneer Ive ever had. It quite literally felt like eating a cloud. I think the paneer here is homemade and you can definitely taste that.\n\nHad some garlic naan on the side as well which was standard but in a good way.\n\nThe portion sizes were large and I have like 2 more dinner’s worth of leftovers which I am so excited about!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNk9LZ05REAE",
            "text": "No wonder why chef VIKAS KHANNA named this place as his one of the favourite dining spots in Newyork.\n\"I had an amazing experience at the Angel Indian restaurant! The food was fantastic, the service was excellent, and the ambiance was good decent. I was especially pleased to find plenty of options for vegans and vegetarians.we had veg dum biryani so delicious must try, lassuni gobi,pani puri I highly recommend this restaurant to anyone looking for a great authentic biryani"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneFMwNDRkMGh5V2xOVmJYbDBXSEF5VDJ4dmJHYxAB",
            "text": "The food is absolutely delicious. We loved our time and will definitely go back. Hosts were very helpful and definitely book in advance. We are planning a revisit soon"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZME0zY3lVR3RyYm1Rd1EwWkJhakpzZWxoWWMyYxAB",
            "text": "Angel in Jackson Heights, New York was a 4/5 experience. We arrived straight for lunch from La Guardia airport in Queens after our flight. The seating area inside isn’t huge, so we were fortunate enough to be seated with just a 5-10 minutes wait.\n\nFor food, we got:\n\n1. Amritsari Kulcha with Chole: Chickpeas curry with Kulcha(Bread stuffed with Paneer) was a nice start to the meal. The chickpeas were just the right amount of spicy, and went well with the kulcha. The onions with chutney, salted yogurt and achaar(pickle) provided just the right kick with the dish. Overall 5/5 for this dish\n\n2. Chicken Biryani: This was not really the best. Imagine chicken curry mixed with rice—that’s not what real biryani is. Overall, this was the lowest point of the meal. Overall 2/5 for this dish\n\n3. Dahi Batata Puri: The quintessential Indian street food—bite-sized puris(crispy, hollow balls made from wheat/semolina) filled with boiled potatoes(batata), chilled, whipped yogurt(dahi), chutneys, onions and sev(crispy, chickpea flour noodles)—tasted okay. The vibrant explosion of flavor in the mouth became one-dimensional after a point. Overall 3/5 for this dish\n\n4. Drinks: Limca and Mango Lassi were your usual.\n\nThey’ve a wide range of other North Indian dishes too(check the photo of the menu).\n\nThe establishment itself gives considerable amount of desi vibes, like the neighborhood it’s located in. Punjabi songs blaring in the background remind you of India as you gorge down the food.\n\nThe walls are decked with photos of staff with the famous Indian chef Vikas Khanna, so you know this place means business.\n\nOverall, we liked our time at Angel, and we could see the charm of visiting here. I can imagine the place getting busy given the snug and limited seating inside. The subway station 74 St-Broadway station is the closest. The staff tries their best to keep the customers moving."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNWZUM0xnEAE",
            "text": "We did not make a reservation and had to wait 1.5 hour because we missed the first call-back. That being said, we were extremely satisfied with everything we ordered! Would definitely come all the way to Queens again just to eat here!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRLWZTcW1BRRAB",
            "text": "Outstanding Indian food in a casual and cozy location. The food here is probably the best Indian food I've had anywhere let alone in New York City! We had the Butter Chicken and Lamb Bhuna with garlic naan. Both dishes were authentic tasting and superbly prepared. Neither dish was overpowering in spices or heat. You could tell fresh spices, seasonings and ingredients were used. Servings were ample too.\nThe Butter Chicken had plenty of tender chicken with a perfectly prepared and delicious sauce. This was the best version of this dish I've ever had.\nThe lamb buhna was very intensely flavored and highlighted garlic, ginger and chilis flavors with pretty intense heat too but it wasn't overboard!! The lamb was tender and flavorful!\nThe garlic naan was excellent!\nService was efficient and friendly!\nThe atmosphere is cozy and only seats about 20 people.\nHighly recommended for authentic Indian food with good service and cozy atmosphere!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKRE4tUHowMTlPc3JnRRAB",
            "text": "Small 18 seat Indian restaurant one block from from Jackson Heights subway stop & Q70 LaGuardia bus stop. Always busy & full, reservations needed now. Very good Indian biryani in bread topped bowl as well as assorted breads & grilled meats. Very simple ambience with efficient service and clean tasty food, unlike most stereotypical greasy spoon restaurants"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYTRuYVdqNzhXNGtnRRAB",
            "text": "We had a wonderful dining experience at this place. The staff was wonderful, and the service was quick. The food had a dhaba-style taste that we really enjoyed. We particularly loved our Peshawari Naan, Lotus Kofta, and Butter Chicken."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOXJtS2d3RRAB",
            "text": "Small restaurant that was very full when we came, but luckily managed to snag a table as people were leaving. The food here is great, full of spices you’d expect from South Asian dishes. The garlic naan was my favorite, they load it up with garlic and ghee and it’s amazing when you pair it with the main courses. We had the aloo gobi and vegetable biryani and couldn’t finish everything, the portions are quite big."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaDRXSXJnRRAB",
            "text": "Nothing but an awesome time here, the staff greets you with a smile and is super attentive, Decor js exactly what you would want the best Indian food in the ( Burroughs to taste like, bland cuteness! The food is out of the world, the flavors wow, it puts most other Indian restaurants especially in the city to shame! Shame on them for hiding the true flavors and praise be upon angel for unlocking the gates to flavor heaven!!!\n6 stars"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbXRIazZ3RRAB",
            "text": "TLDR: Decent Indian in Jackson Heights, close to the train station. Comfy seating.\n\nI was very much looking forward to this meal but maybe I got here past it's prime. The place is well lit, cozy but overall it was just alright.\n\nThe biryani wasn't quite as spicy or seasoned as I'd expect. Butter chicken the meat was a bit on the drier side, the saag also a not too punchy in flavors.\n\nI really wanted to love this place but the food was just kind of okay. Maybe it was an off day because the reviews are very supportive.\n\nService was nice though and seems like a nice family run restaurant. Perhaps I'd have a better experience on a revisit and ordered differently."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNEstRFB3EAE",
            "text": "We had lunch on a Friday last summer at Angel Indian on my friend's way to the airport. We weren't alone -- we saw other people with suitcases at the restaurant, and they seem used to it.\n\nThe most memorable item was the chicken biryani. I really liked the bread that was encasing the biryani. It was buttery, soft, and delicious. I enjoyed ripping it off of the sides and having it with my other dishes. The biryani itself was quite spicy but didn't have a strong savory flavor otherwise. All of the chicken that we had came in really big pieces. It was tender and flavored well.\n\nThe chicken vindaloo was quite spicy but not unbearably so. It was quite good. The garlic naan was a bit burnt but otherwise good. The cauliflower appetizer was fresh and hot, and the sauce was a bit sweet. The mango lassi was good -- tart and creamy.\n\nOverall this is a very solid option for Indian food and I hear that it's reasonably priced for the area. This isn't my favorite Indian food I've had, but it was quite good and I would come back to experience the biryani bread balloon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMDlXZ1lBEAE",
            "text": "A bit of a wait for weekday dinner with no reservation, but turnover was fast. Loved all the appetizers, but too bad they don’t have the Fry Bheja anymore. The Goat Dum Biryani, a chef’s special was surprisingly disappointing. The goat was too tough and chewy it hurt my teeth to eat. Definitely needed some more time cooking."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NzlXc2FnEAE",
            "text": "Angel Indian Restaurant: A Queens Culinary Gem\n\nAngel Indian Restaurant in Queens is a total must-try! Their huge menu is packed with amazing Indian dishes, all cooked perfectly with the best ingredients. You'll have a seriously tasty meal here, but make sure to book online first because it gets super busy! They don't take reservations over the phone, so keep that in mind.\n\nOnce you're seated, you'll be treated to attentive service that complements the true star of the show: the food. Whether you're a seasoned fan of Indian food or looking to embark on a culinary adventure, Angel is a must-visit destination. They even have a  well-deserved Michelin Bib Gourmand too!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKbmsyZW1pMHF6NTN3RRAB",
            "text": "Had a great first visit with a delicious stuffed kulcha, so I came back while traveling to Atlanta—even in heavy rain. There was a 40-minute wait, and I wasn’t allowed to order the stuffed kulcha to-go without a clear reason. A separate takeout menu would help. I then ordered saag paneer, but clearly asked that it is palak paneer. The staff member acknowledged it, but what I received wasn’t what I asked for. At 2:00 AM, this was a letdown, especially after making an effort to visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3a2NUMVl3EAE",
            "text": "The food the absolutely delicious, I think it’s my best Indian food I’ve in New York. When you close by, you will hear loud music from the restaurant, it brings you to India atmosphere. I ordered both Naan and rich with my dish, it’s a little and very tasty. I finished they all very soon. If you interested, please try Lassi to be drink, because it’s very special drink you ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNktYRXJRRRAB",
            "text": "The food was really good! The flavor of each dish was great, highly recommend. The service was attentive but also rushed so this is a place where you go to eat and leave, not necessarily stay there for an hour and a half. We were in and out in 45 minutes due to quick service but the place is small and high in demand so it’s understandable why everything needs to be quick."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyb2RUamhnRRAB",
            "text": "This restaurant is a journey down memory lane, evoking nostalgia for my childhood in India. Without a doubt, they serve the best Pani Puri in the States. Every visit, I can't resist having at least two plates of Pani Puri, and I'm always tempted to have more. Their Laal Maas and Goat Dum Biryani are also exceptional in fact a very unique experience with the preparation and taste. The service is impeccable, starting with complimentary papad. You can end the meal with a first class Chaas just as you like. Overall, it's a great atmosphere, lovely food with excellent staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyN0puQXN3RRAB",
            "text": "Food is good quality and very fresh. Service is very fast too which was great. Flavor wise, something about the authentic flavor is missing however. I guess they cater for a more western taste which is unfortunate, otherwise a good place to have Indian food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbTZLbWZnEAE",
            "text": "Hidden Hole in the Wall in the Heart Of Jackson Heights . Once upon a time Jackson Heights was called Little India not it’s more of Gold Souk.\n\nBeen trying to check this spot for a while now , went few times and couldn’t do the hour waits . Finally made a reservation and made the trip from Long Island.\n\nWe were greeting and seated at our reservation time. Restaurant is small with about 8 tables. It was very diverse in there , I guess people traveled to eat there.\n\nWe were recommended a few dishes by our waiter but we picked what we wanted . For appetizers we went with Tandoori Chicken , Lamb Sheekh and Lamb Chops . Everything came out fast and sizzling. Portions were great and we barely had room for Main Course . But for main course we decided on traditional Butter Chicken , Chicken Dum Biryani paired with Keema Kulcha and Garlic Naan. Everything was great , it was on the spicier side but I am glad I had it as it was. Also loved the fact that they didn’t tone down the spice level as Indian food is usually spicy.\n\nOverall , I wonder why it’s rated 4.7 out of 5 and trust me it’s better than most of these fine dining Indian restaurants in the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaU5IdjBRRRAB",
            "text": "After some hype from close friends we finally ate at Angel. The food was very good and prepared quickly. Comforting and pleasant to eat. We had a cauliflower appetizer, garlic naan, black lentils, and saag tofu. See you again. Thanks 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOHZ1RDdRRRAB",
            "text": "As my Indian friend said “all my non-Indian friends said Angel was the best Indian food they’ve ever had” not sure if it was a jab but he was right. It was the best Indian food I’ve had so far! The paneer is so dreamily soft, the chicken vindaloo was incredible, a good heat to it! I saw another table have biryani and it looked incredible (note to self to order that next time) the prices are fair, had a tangy mango lassi to wash the heat away. Make sure to make a reservation for the weekend, it gets packed! We went there during lunchtime on Tuesday, lots of seats available! Really some of the best Indian I’ve ever had, go to Angel!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcHN6R2JBEAE",
            "text": "I wish I could give more than 5 stars! We reserved a table on Monday at 12pm! We were a little early but the staff was very kind to allow us inside. From the moment we walked in, we felt like we were being treated to a home cooked meal. The aroma of the food was incredibly inviting and reminded us of the comforting smells of home. The restaurant is small but sparkling clean, adding to the cozy and welcoming atmosphere. One of the highlights of our visit was getting the chance to meet the chef, Amrit Pal. He was exceptionally kind and sweet, taking the time to chat with us and ensure that we were enjoying our meal. The staff is super friendly too!\n\nOverall, they offer a delightful dining experience that combines delicious, home-style cooking with a warm and friendly environment. HIGHLY RECOMMEND THIS PLACE AND THEY HAVE THE BEST MANGO LASSI EVER!!!\n\nWishing Amritji All the best and he will soon be a Michelin-star!!\n\nAlso it got super busy on a Monday afternoon at 12pm. I would recommend you go to the restaurant only after making reservations"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSazZQYThnRRAB",
            "text": "Hands down the best/authentic Indian food I’ve had in the States. Both me and my friends have been to India, so trust us! You have to try the curries. Service was above and beyond. They also take credit card (instead of cash only), very convenient. We will definitely come back to try more dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid3VLaU5nEAE",
            "text": "The seating is very cramped, which can make it uncomfortable to eat there. The food is good however. The fried fish was well spiced and flaky and the curries delicious. I didnt care for the biriyani but the rest of their menu was worth it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cE5EVGFnEAE",
            "text": "Truly charming experience, worth a trip from any borough. Some of the most flavorful and warmly prepared Indian food I've ever had. Well priced and well sized portions, a special experience all around. The best part was the spice level that was carefully present in every dish."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLdnByc21fcGNfYkpREAE",
            "text": "I order  goat dum briyani but biryanj was boild  rice , biryani had no taste and there were no spices in it, the rice was not basmati it was of very bad quality rice , when I called the owner of angel , he said that we make it like this only , you should not order it again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1NFozNnB3RRAB",
            "text": "Everything I ate was so satisfying! If you miss Indian or Indian food, THIS IS THE PLACE to visit! I have been to many indian restaurants none of them taste this delicious or have the actual Indian flavors like Angel!!! Portion sizes, service, flavor 11/10\n\nThe minute I walked out of the restaurant I recommended this to all my friends, this is a must visit!\n\nHighly recommend Chicken 35!"
        }
    ],
    "reviews_count": 83
}