{
    "name": "Afghan Boys",
    "place_id": "ChIJTflZvShhwokRfy0X_vnKAfI",
    "grid": "QN3",
    "address": "75 street and, 31st Ave, East Elmhurst, NY 11370, USA",
    "rating": 4.5,
    "user_ratings_total": 54,
    "phone_number": null,
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ScFEzUkJUVWRSUkZWdGVXMU1URVpWTUU5dFFYYxAB",
            "text": "The food here competes with the very best spots. The meals demonstrate evident superiority. The staff showed consistent table awareness. The design choices here are refreshingly unique. Really happy with my meal. I can't wait to return for other menu items."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReFExQlpaVTFLUVdNNVIzaExUMWN0ZUhkMGMyYxAB",
            "text": "Ordered 2 combo platters I never comment unless I have to say great things about a place but this gyro was really over priced with no hype I really thought it would be, with a 4.6 rating. It’s not a busy food stand but has neighboring customers I would say it’s ok, mediocre. I give the chicken and gyro a 7 out of 10 and the rice was brown I really thought it was going to be delicious and rich but it was a 4 out of 10 it was so bland. It barely had taste to it but it did have a slight scent to it. So we got smell no taste. I will never be ordering from here but good luck to whoever does. Service and atmosphere was the best part not the food unfortunately."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201eVRGTmxOME14VTJFNE1UWkdhRU5uZDJWdloyYxAB",
            "text": "It's a 3.5/5 in terms of quality of meat and rice.  I was expecting it to be better but it's just average food. I probably would not return to eat from this cart again. There are many other carts which have much better food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeFNXWlBTSGx4VFZkdE9ITkhSM0kxTUd4V1VVRRAB",
            "text": "The Best food here it is all ways fresh and we’ll do Please come here you would love ❤️ it recommend if you like chicken over rice or more"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213d1JuVTBkV0ZWYlVrMlZrWnJXRk5YVUhoUmVIYxAB",
            "text": "Delicious food and super kind guy.."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNalgwN19Ua1otbnZnRRAB",
            "text": "Best food and best sevice"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeWMtVnhRRRAB",
            "text": "I’m frequently in the area and needed a quick bite, so I decided to check out Afghan Boys after seeing their near-perfect rating. For $12, the mix over rice felt a bit pricey for a lesser-known spot — but it does come with a free soda, which was a nice touch.\n\nThe food surprised me in the best way. The chicken was well-marinated with a good kick of spice, just how I like it. The gyro was solid — cooked well without being greasy like other places. The rice was on point, and the portion was hefty enough to fill you up without that heavy, greasy after-feeling.\n\nDefinitely grabbing a mix again next time I’m in the area."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMXZTRE5nEAE",
            "text": "Lots of food for $10. Chicken is seasoned and rice is aromatic. Good place to go for Jummah lunch."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQLWFPTEF3EAE",
            "text": "their price is not accurate!\nthey will just put whatever price they want !\ni have been this place often  time !\nbut they always change the price !"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbVBHQ0RBEAE",
            "text": "Food very delicious and service is great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMm9pZ3NRRRAB",
            "text": "One of the best food cart I love chicken or rice I buy every week ❤️❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3anI2QXZRRRAB",
            "text": "The best halal food i ever had"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3anQ2dFBBEAE",
            "text": "SO delicious! My husband and I dream about the gyros and platters from this place. Best falafel salad too with the best flavor out of any cart we've tried in the city. Grateful they are in our neighborhood. Hamdolilah!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMenZMa2xRRRAB",
            "text": "I had an amazing experience at Afghan Boys! The chicken over rice is absolutely the best I’ve ever had—flavorful, perfectly cooked, and generously portioned. The staff are incredibly nice and respectful, always treating customers with kindness and professionalism. They truly go above and beyond to ensure a great dining experience. Highly recommend this cart for anyone looking for delicious food and excellent service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6aEw3SURREAE",
            "text": "I stopped here 2 days ago and I had a chicken over rice. It tasted so great. I love chicken over rice and Afghan Boys is the top #1.  Very recommended.\n\nToday I driver 40 minutes just for the chicken over rice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bjVtZFdREAE",
            "text": "My go to place; been going to this cart for years (since 2018) and Afghan Boys has always maintained high quality throughout. All of their offerings are super flavorful with great portions, you can’t go wrong with any of them! This cart is definitely worth the detour, and it’s close to a Q47 bus stop (connects to Roosevelt Ave station). Owners are absolutely amazing and hard working"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdXZHX1dBEAE",
            "text": "Hidden gem one of the best halal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLS1mYXpRRRAB",
            "text": "Afghanistan has the best grilling ever and the rice is very good and flavorful. Even if it's street food they have the same spices and flavors as the restaurant. Any restaurant or gyro stand that's from Afghanistan is always a huge hit. Next time try this place and trust me you will never regret it. 🤯 Their hot sauce is very hot so be very careful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWN1BQTG1RRRAB",
            "text": "Delicious gyro wrap and was super flavorful, definitely recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsLXBlbmVREAE",
            "text": "This spot was close to our AirBNB went for the lamb over rice and was not disappointed. Blows other carts out of the park, the rice is full of flavor and I would buy it by the bucket if i could. Typical gyro meat but salad was different with the inclusion of cabbage. They're different sauces but got the white and red hot sauce, a nice kick but not over powering, if you can't do hot go lite."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwM0xETTlnRRAB",
            "text": "The young guy who works here is not professional and really rude. He doesn't know how to behave with customers. However, the senior one is the best; he knows what he's doing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdllHaHN3RRAB",
            "text": "Jackson heights has the worst halal food in the entire city probably. This place is no doubt the best one out of all of them."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdDlyYUtBEAE",
            "text": "Really tasty and quick!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dTQ3S1FnEAE",
            "text": "Got the lamb over rice with pita bread, food was very fresh and taste good. The hot sauce is pretty spicy they also have green sauce (chutny) and bbq"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbTlDTTJBRRAB",
            "text": "Foods a little spicy but very good. Chicken Over rice was very good. Very filling and great portions."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNVpqMXZ3RRAB",
            "text": "Food was great! The owner was really kind and nice!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoczgzblJBEAE",
            "text": "I met Farhid and amazing guy! I came from Houston just to try the lamb gyro and it was not disappointing! the food was full of flavor! So tasty! Definitely recommend if you're in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCOU9tTVRREAE",
            "text": "I love halal cart foods and have gone to countless numbers of locations. I can confidently say this is easily one of the best in the city.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMktEOTB3RRAB",
            "text": "Amazing workers and AMAZINGGG FOOD. Must try and if do chicken over rice is a must. My go to go meal 💯 👍🏻"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdDduc1JnEAE",
            "text": "The best Halal Food in town! Their food is served clean and fresh daily! Check out this hidden gem in NYC!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtenVpTFN3EAE",
            "text": "Best halal! 5 stars"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQteE1fVVR3EAE",
            "text": "So far so good with this spot. Pals at the truck are friendly. Portions are great. Don’t expect the best halal you’ve ever had, but it’ll hit that spot you’re craving just fine. Sauces are good, give the mango habanero a try if you like a lil sweet twist.\n\nLocation is very convenient, supermarket/stores parking lot right next to it helps make this truck a go-to for its location.\n\nCurrently 9$ for a large platter, doesn’t come with a drink."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlZ016Zm5BRRAB",
            "text": "Very good Afghan food. I drive a quite a distance to come see The Afghan Boys and worth it every trip. Keep up the great work guys."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1Njc3aFZ3EAE",
            "text": "I have tried so many halal food trucks .. this one is superb.. as i love spicy, I added extra spicy sauce.. portion is big enough for 2 persons to eat.. so much matching with pita bread with spicy sauce"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyanNDSFpnEAE",
            "text": "One of the best place to eat halal"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNC03M3lRRRAB",
            "text": "Absolutely incredible gyro"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NjRLc01REAE",
            "text": "The best gyro place in Jackson Heights. Must try. More than enough parkings around."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2M3NleGVnEAE",
            "text": "This food is so good!!!!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhOV9HMVZREAE",
            "text": "That guy is rude ask him a question he say go fine a next place"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDakthZ1pnEAE",
            "text": "love it!!!!! definitely coming back,  food is fresh which i personally love. very amazing food with great service!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDak1hWFpnEAE",
            "text": "Very nice food and professional service"
        }
    ],
    "reviews_count": 41
}