{
    "name": "Nancy Blake’s Tavern + Tap",
    "place_id": "ChIJy8c1zXZfwokRWH10_2J_E58",
    "grid": "QN3",
    "address": "82-19 Northern Blvd, Jackson Heights, NY 11372, USA",
    "rating": 4.9,
    "user_ratings_total": 18,
    "phone_number": "(347) 612-4339",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paU1V6VkthSE5tWDJsS1JrMXRWM1JETmtablYyYxAB",
            "text": "Great tavern"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UmRGOVNRME14Yld4TFNIVTVjM2N0ZGw5cVRtYxAB",
            "text": "Great new place. Very spacious and a nice atmosphere. This place was so overdue and a needed change to the the neighborhood bar dynamic. I feel like every bar on northern blvd is on repeat except for this place. Cant wait till your kitchen opens. Thank you Nancy Blakes!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVU55MVBRbkI1U1ZFNFFWZEtZa3R1YjBKUmVsRRAB",
            "text": "Finally!!!!\n\nSomeone smart enough to open a pub in this neighborhood that's not like all the other loud bars, trying to be night clubs, in J Heights.\n\nA decent pub/bar in this neighborhood that does NOT blast loud tacky dance music so loud they I can't hear myself think.\n\nThe space is new but very well set up and spacious.\n\nIt's a great place to have a decent drink/beer and catch up with friends.\n\nThere is a jukebox so you can pick music you want to hear and it's on a good volume level, where you CAN have conversations with friends.  Thank goodness.\n\nNo food yet but hoping that'll change soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RGVGWmxXWFZGVEZWSmVVaE9ZbkJEVDBaQ2RXYxAB",
            "text": "First time entering this new bar in the boulevard. It was a great experience to sit and have a nice drink with friends. Jeff was such a cool guy and welcomed us to their bar. Looking forward to their growth in the area and hope to see their success grow."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wa1NEZFdURkpMTWpKWFpUSkhWekpQUmtFeGVYYxAB",
            "text": "Beautiful bar and great atmosphere. I went on a whim and I had a great time. The people in the neighborhood were nice and the bartender Carolina was awesome. Will def be going back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaWRXVTVSa2xFT0dsNGJubG9jbFZWU1hoQmRsRRAB",
            "text": "Love this place—cozy, friendly, and always a good time. But the real highlight is Arthur the bartender. He’s welcoming, quick with a smile (and a pint), and makes everyone feel like a regular. You can tell he loves what he does, and it shows. Arthur makes this pub feel like home. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSU0zaDFNRUpqT1ZsRGMwWllSeTAzZVdac1QzYxAB",
            "text": "Padraic, the owner is bringing a whole new vibe to the Heights and doing a great job even without the kitchen open yet. He’s also the owner of another great Pub/Restaurant of 10 years named the Brewery in Astoria.The food and service there is exceptional and he will bring that same experience to NB.  Prices do not change according to the holidays. I love that. . Happy hour 4-7 $6:50 and slides up to $8;50 after 7 and is well worth the stay.  At the moment the kitchen is closed until approved by NYFD whom I hope will find a lovely home there on their nights off. At the moment this is not wheelchair accessible but will be very soon. This is a BYOF, meaning until the kitchen is open for business you can order from any restaurant including the corner pizzeria and enjoy your beers, cocktails and the food of your choice from outside.  Lovely decor and a very nice touch of Ireland added to feel like you’ve gone on a holiday. Private party room in the basement with full on bar, elevator to take you there once approved and some surprises hopefully in the future. Come in out of curiosity and stay for a while.  Meet as strangers and leave as friends.  TVs all over the place to watch any sport and juke box for great self chosen music. What a really nice change of pace to a neighborhood who’s known for their good food, good music and late nights. Hope to see you there.\nCC"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSllteERSMkpYUnpoNFZtMXdha0p1V1dSM05rRRAB",
            "text": "Me and my boyfriend were waiting for this place to open and we weren’t disappointed!! Amazing atmosphere, vibes, and drinks! The bartender we met, Carolina, was above and beyond personable and friendly. We will definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTGFYWTRURkpMWW0xcVJuZFdVVkpUT1V0YVFtYxAB",
            "text": "Such a great new spot — just opened and already feels like a neighborhood favorite in the making. The vibe is warm and welcoming with a clean, stylish setup that makes you want to stay awhile.\n\nArthur, the bartender, was phenomenal — super friendly, skilled, and genuinely made the whole experience memorable. His cocktails were spot-on, and he made sure everyone at the bar felt taken care of.\n\nRight now it’s BYOF (Bring Your Own Food) since the kitchen isn’t open just yet — but it will be soon! In the meantime, they’ve partnered with their next-door neighbor Element Pizzeria, and even have their menu on hand, making it easy to order in some great food while you sip on your drinks.\n\nBetween the drinks, the hospitality, and the flexibility to bring or order food, this place is already a gem. Can’t wait to come back — definitely a five-star experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTlUyRjBVMmxTVVhaV0xYRm5TMEp1UkdGbllVRRAB",
            "text": "Jeff was GREAT and his drinks were awesome!!! So excited that this place has opened! Me and my boyfriend know this will become our new neighborhood hang out spot. Can’t wait to come back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMk9hMU9REAE",
            "text": "Absolutely thrilled for this new spot to open! I'm a huge fan of the owner’s other establishment, The Brewery Bar & Kitchen, where the food is always top-notch, the atmosphere is inviting, and the staff makes you feel right at home. If this new venture is anything like it, it’s bound to be a must-visit! Can’t wait to stop by regularly after the grand opening—this place is sure to be a hit!"
        }
    ],
    "reviews_count": 11
}