{
    "name": "Pokeyaki Japanese Grill Teriyaki&Sushi",
    "place_id": "ChIJSXLlUwdfwokRxdNI-zR8a1w",
    "grid": "QN3",
    "address": "83-10 Astoria Blvd #5, East Elmhurst, NY 11370, USA",
    "rating": 4.9,
    "user_ratings_total": 285,
    "phone_number": "(929) 227-4527",
    "reviews": [
        {
            "date": "19시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NFpqRlhSbXg2UVZKdVJXbG9iVXRIWTFSelEzYxAB",
            "text": "Just moved to the neighborhood and can’t believe I only discovered this place now! Fresh food, perfect flavor, and the doctor told me to eat healthier. My new favorite spot!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTWRWZG1NRnAzVFVKcVZqRkNiV3czUkRsTVpVRRAB",
            "text": "Great prices and amazing food."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eU9XWTVWMDl2TWpsZk56bGpTbTQxTW5BNE1VRRAB",
            "text": "Everything is great here"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RM00wcHhWRk5LYUZvNVZ6TjNUakpuTFVoR1NrRRAB",
            "text": "Amazing ! Just fabulous great tasting food"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT09YWjRabGh0Vm1wclExbFVjRVZPTkdsM1gzYxAB",
            "text": "Great cheap food place."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xblNrVmhOMXAyU0daVU4yNTRXa3BvVWxGTkxWRRAB",
            "text": "It’s the best in this area, with reasonable prices and fresh, delicious food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMmJIZzRkMFl3Tkd3NVppMW5MV2RGT1haQ0xVRRAB",
            "text": "Ever since a nearby sushi place closed down, I started searching for other sushi restaurants in the area. This one had the highest rating, and they definitely deserve it! The staff are super friendly, the prices are fair, and the sushi is fresh and tastes better than most others around. =)"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTmVHeHVUVTA1T0RjMGVFOHRhMEZQVGxCM1RIYxAB",
            "text": "The best food ever and comes out fast and hot"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5blEyRlFTMWxRUm10RmJGVnphVU0zZVhwM1RtYxAB",
            "text": "Food made fresh. They are very clean. And you can get a great affordable meal."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWU0xTkxUWEkwZG1sUlNrOVBkMGwwU0cxa09HYxAB",
            "text": "I work nearby and often come here for lunch. A bento with miso soup keeps me full until the evening. The food is delicious and reasonably priced."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wT1ZYZzVOMjExWkc1SFYwVXlkRW94YmxwSVkxRRAB",
            "text": "Earlier today, I was discussing with a friend who lives near me in Jackson Heights, that there aren't as many places in the hood to get sushi.  Some of the more popular restaurants have closed.\n\nWhile on the train headed home, I googled sushi restaurants in Jackson Heights to see if there were any new restaurants. I saw the ratings for Pokeyaki and decided to order via Grubhub.\n\nOMG! This is the best sushi I've ever had in Jackson Heights.  So tasty! I think I inhaled my sushi after not having eaten for about 8 hours. Delicious and fresh. I'm going to try a poke bowl on my next order. 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMFVXOXNkME5QVWtVNGFESXhiako0TUZwZlpsRRAB",
            "text": "Food is good and they are friendly to their customers"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWVpIQnRXblJRUVY4d01FOXNWRmRLVDNWVVVrRRAB",
            "text": "Not gonna lie, I used to struggle with digestion, but after having their miso soup, everything feels smooth and easy. It’s so good, I joke it’s better than medicine — definitely recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOb2RHVm9NMjh4V0VrNE5WTnNUMDB5YVdaMkxYYxAB",
            "text": "They finally have miso soup — one of my favorite soups,and tasty."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVlNsTTVSRWhZT1VZNVJYQjBibDlWV1dKS09GRRAB",
            "text": "Me estoy alojando en un hotel cercano, y la recepción me recomendó este lugar. Acabo de terminar mi comida y enseguida les di una buena reseña — realmente se lo merecen."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSalVtRTRSSGxVYmpaalVqUlRaMHQ2TlhSWFpXYxAB",
            "text": "Highly recommend the eel+avocado-roll\n\nI'm so glad this place opened after a nearby sushi-restaurant closed"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUlpFTmlTVWQwWkhOdVVsUjZZMkZFZEZNMlZWRRAB",
            "text": "Delicious. Nice and clean. Good people."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcFlVSnROa2xhZVZkSVFWSm1SVjlZV1ZoNVJWRRAB",
            "text": "Very yummy and staff are always kind and professional. Thank you 😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jM1prcGlaRk5DWjA5UFJHOVpOV3BIWkZCbk4yYxAB",
            "text": "Please make sure food taste like fish and chicken looks taste old"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSFVESkRiR0k1VkhJeVluVkRURWxDTWpCNlVWRRAB",
            "text": "El lugar siempre es muy limpio y los chicos son muy amables, me gusta mucho su sushi, es mi lugar favorito de estas vacaciones :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRmRVcFdXSGt5WlhKM05FSXphalpDUW5aWGRsRRAB",
            "text": "I used to frequent Chinese restaurants, but ever since Pokeyaki opened, it's been my go-to spot. Over the past four months, their quality has remained consistently high, which is why I'm finally leaving this review. The 4.9 rating is well-deserved."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSFZqTkhZMkZyZVVaSU5XeDRjVzlHV1ZWTlJXYxAB",
            "text": "Staying at a hotel near the airport and found this top-rated spot—so glad I did! I had the Chicken Bento and Shrimp Tempura Roll, and both were absolutely delicious. Everything tasted super fresh and perfectly made."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNU1EVlRjM1k0UkRGamFHVXlRMk42VlVzM2NtYxAB",
            "text": "Restaurant is very clean and the food is really good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUVZGTXRSMmg2TFVzMmRIaE5TV0ZqTjJWc1RHYxAB",
            "text": "I got the chicken bento box. Chicken tasted fresh with the perfect amount of sauce. The rice and vegetables also taste fresh. You can’t beat the price!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jdGFHcGtXSHBIVEdKTlNVdExMVmhsTlZkNE1uYxAB",
            "text": "The food is always fresh and it always taste good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSU5YRnVWMDVZWXpWcVdIbE5URkJuTmt0d2FFRRAB",
            "text": "The staff here are always friendly, the restaurant is spotless, and the food is incredibly fresh. This is our go-to spot for sushi in the area—nothing else compares."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNFdXWlhTMDFSTlVac2EzRlNjSGRzVTNoWFIwRRAB",
            "text": "Wow very delicious I highly recommend this spot!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvemFLdnJRRRAB",
            "text": "Food is pretty mid"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kM1F6VnFUR2Q1Wm0xTk5XdHdZME5YZW1sbFYzYxAB",
            "text": "Every time I dine here, it’s always busy with lots of customers. But surprisingly, there’s no crowd at the moment—I got my food in less than a minute after ordering! As always, the food is fresh and flavorful, and the sauce is perfectly balanced."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFellTMVhkV3Q0YUdkcE0zTTBkelZuZFdOa1pGRRAB",
            "text": "I work nearby and came to this restaurant for lunch on a recommendation. I can confidently say I'll be coming back every week! The food is incredibly fresh and bursting with flavor-definitely worth a try!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNdFFscHRVR1JXYWpKWU5sWkVXWGR2TkMxUmJIYxAB",
            "text": "I was pleasantly surprised by how fresh and flavorful everything was at Pokeyaki Japanese Grill. The teriyaki chicken was BENTO perfectly grilled—juicy inside with a nice smoky char—and the sauce had just the right balance of sweet and savory. The sushi rolls were also very fresh.\n\nService was fast and friendly, and the portions were generous for the price. I really appreciated how clean and organized the place was too—great for dine-in or takeout.\n\nIf you’re craving tasty Japanese food without the high prices or long waits, this spot is definitely worth checking."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdlJHUnRhME0xY0VaNlIyTnNWbWRZTUdOeFdsRRAB",
            "text": "Great service and food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxemJXdFdURFpFUlZGbGQwMUhja3gyUWxKc09VRRAB",
            "text": "Fine. Amazing for fast food and it was fast.\nWe got them beef and chicken bento 🍱 boxes once they landed and we were at the terminal before they came out. They ate the whole thing. We ate our poke bowls. Seaweed salad, avocado , crab. Shrimp for me and eel for Mark. 4.9 was accurate."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xZk9FYzViSEZSTmpSRmNscDBZbk5DYzNnek5VRRAB",
            "text": "Very pleasant and welcoming as soon as you walk in. Clean, very sanitized. Love it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NGFIbFNlRmQ0VWs5b1pHVkZZbWMzYkUxZldWRRAB",
            "text": "I used to frequent another restaurant chain with multiple locations. However, ever since a friend introduced me to Pokeyaki, I haven't gone back to the old place. The staff at Pokeyaki are incredibly friendly, and the food is not only more delicious but a generous amount of meat.I highly recommend Teriyaki Chicken Combo with extra chicken and will be encouraging more friends to try it out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZM2VrTjZNbkF0YzBsbU5HSTRORzVQWlc5bU1FRRAB",
            "text": "Always busy, always delicious, always friendly – that's what makes this restaurant special!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NdE1ESmtiRXhTUlZKM09HVm9OR3hYV2tJM1JWRRAB",
            "text": "A wonderful Surprise, delicious Poke and Terayaki, we loved the spicy majo perfect and fast the service. We had dinner there, the best around there!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMFdIY3hhbXBuVEhZeGJsQlpURVpVVWxGUmNuYxAB",
            "text": "White tuna bowl 👌👌👌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdWEyUTVaWEl0TlRZMGNIVjRUR0prUjBSaGFIYxAB",
            "text": "My flight was canceled so this was the highest rated food option near my hotel and it did not disappoint! I am almost happy my flight was delayed so I could eat here?! My meal was priced right, prepared fresh, piping hot, and DELICIOUS. All staff were super accommodating and friendly. Highly recommend!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcU5UblpBEAE",
            "text": "Have enjoyed everything I have tried there, the sushi, poke bowl, and teriyaki."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdVpqY3RSRGRzZVhSelIzaFBlV0ZQTjA1U05GRRAB",
            "text": "They used to give so much tuna and salmon portions in their poke bowls and now a salmon and tuna costs 20dollars for like 4 oz of fish"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVVlqQjFSa1ptVFd0RVNHOVJhMUZvUkdWUFFtYxAB",
            "text": "If you're into Poke Bowls/Fresh I have to say that this place is a great find. Location  provides some parking in front in a small dedicated parking lot but there is paid meter parking also along the boulevard.\n\nThe location is a bit sparse but what they have in spades is the food and how clean their location is. I believe I was there about three weeks ago and they had an 'A' Rating posted on their store front glass.\n\nSeating is minimal but this location really is about the food and I noticed many coming in to pickup their orders they ordered on line. There were two or three table to the right side which were larger and about two or three smaller table on the left as you enter where we sat.\n\nPurchased two Poke Bowls with Salmon (Raw) and chose Ponzu sauce. There are other places that may offer more variety of choices of add-ons but their basic setup and fresh ingredients are what people will be drawn back to when they think of a good priced poke bowl. Plus I think if you order in person vs. app the price from what I recall was cheaper in person.\n\nService from their staff was top notch for a takeout place and I checked their behind the counter space and it was clean and tidy.  They do have restroom available for customers. For a Saturday before 3pm I would have thought it would be slow, but before I placed my order and even afterwards there was a steady stream of people walking in to pick up their orders and order food as we waited.\n\nThere is also a special theory offer but I don't recall the details other than it was for a bento box I believe. Will definitely go back for more and try out their other offerings and take photos of them."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213ek9IbFVjSEJ6Y1dONU1HUkRkMlU1WlV0NVRFRRAB",
            "text": "Food was great but the service was even better. I ordered a poke bowl and I wasn't sure on which sauce to order. The person that was helping me gave me the \"sauce samples\" so I was able to try all of them! Also, my poke bowl was done really fast and it was delicious! Will definitely be coming back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbWRsVklNMFZwYm1zdE9IUjJNVkZqYlRoVWNXYxAB",
            "text": "This is my first time visiting this newly opened spot and trying this combo — it's super fresh and flavorful. A great place to enjoy lunch or dinner"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VManVuZW5TczhpQzlBRRAB",
            "text": "Awesome, tasty, fresh food at incredible prices!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQU3VqckQyMjZDSzdRRRAB",
            "text": "Delicious teriyaki, I got their advertised chicken and shrimp combo. Upped to fried rice. Satisfying."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKX0VnX0t2aktmcmFnEAE",
            "text": "A restaurant near the airport. I saw a review recommending the salmon rice bowl and decided to try it. I ordered the spicy mayonnaise - it was delicious! I also love salmon and you deserve it. I will definitely come again."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJUzYzS2FxM09MQVhBEAE",
            "text": "Had very bad diarrhea after having their poke bowl. Never going back to this place again.\n\nThis is not the first time I have raw fish poke, never had this bad kinda reaction before.\n\nP.S. It is not polite to make fun of other people's screen name."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOVHd2ZTNaMnRmMEpBEAE",
            "text": "Yesterday I had the tuna poke bowl — it was amazing! Today I came back with my family and ordered the salmon with yum yum sauce. It was incredibly fresh and delicious. I highly recommend everyone to come and try this new Japanese spot!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKeks4cFdacHRPVEVnEAE",
            "text": "Food comes quick, taste fresh, great customer service and deals. A frequent spot for me when I’m\nHungry"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJa3NYWVlnEAE",
            "text": "I work near here, so I’ve been waiting for this place to open for weeks! Saw lots of positive reviews and decided to try for myself.\nEarlier today, I stopped by and ordered lunch- I was very pleased with my salmon poke bowl. It was delicious and filling… and it was affordable.\nThe place is very clean, including the bathroom- it is also wheelchair accessible!\nThere is a small parking lot available. Depending on the time of day, it could get crowded… but I’ve been able to park 99% of the time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNXUtU0RBEAE",
            "text": "I had the bento box twice now and each time I’m happy with the quality and quantity for the price. There’s lot of food options and ranges, I’ll definitely return soon! The staff is also very interactive and kind—definitely a key to keeping the place up in a positive light."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM1AySVRBEAE",
            "text": "Was very happy with the food. Good amount of food for good price. The whole family enjoyed it. I got a bento box with shirmp and chicken with fried rice and side order of 2 rolls both of which were good. The spicy crab and shrimp tempura rolls were delish."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMU9UOHFRRRAB",
            "text": "Place is extremely clean and well kept\nService is fast and efficient.\nFood is great !\nDefinitely recommend the beef teriyaki!\nPlenty of customer parking in front so no need to look for metered parking."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd0t1VGt3RRAB",
            "text": "Fast, clean, taste like fast food, ingredients expected more and better at this price point of self service restaurant"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJel9xRml3RRAB",
            "text": "The food it self is alright. It’s not horrible but I can’t say it’s good. I asked for sauce on the side and got a full bowl of sauce. I can’t say I am likely to come back to eat here again for another poke bowl. Maybe their sushi is better , didn’t try it , so I won’t be able to really tell until I try their sushi."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdEt6S0NREAE",
            "text": "I had a salmon and chicken Bento box. It was pretty good. I wish there was more sauce options but the food here is tasty. Seems kind of fresh.\n\nI also eat a lot and I think this meal will last me through the day a couple times"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNFl2ci13RRAB",
            "text": "Hey guys it's me again at this new spot called Pokeyaki.  First of this place is clean. I mean the kind of clean where you can eat off the floor kinda clean. Yes. I know it's new but still you feel the attention to detail and care these good folks are putting into the food.  Now for the good part - the food.  Man I was pleasantly impressed by the good service and smiles you get. Yes they are new but still you feel the love from the order taker to the plate bagger. Ok.  Ok. The food. I ordered the spicy crab roll and the poke bowl with chicken. On mine I had spicy mayo and teriyaki sauce. What a combination. I have to shout out my offer taker for her suggestion.  Now for the food. The spicy crab roll was actually spicy so I loved that in and of itself. And the main fish the chicken poke was great. First the smell is amazing and the chicken was tender and juicy. I loved this spot and I will be back for more poke and spicy crab rolls. This place is a must especially if you're on your way to the airport and want a quick bite.  Cheers Pokeyaki."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3M3VhQWhnRRAB",
            "text": "The grand opening of Pokeyaki Japanese Grill in our neighborhood was amazing! 🤩 They create the best sushi we've had in a while! 🍣 We ordered the volcano roll and the shrimp and salmon bento box, and were not disappointed! 😋 We will definitely be ordering from Pokeyaki again!  Welcome to the neighborhood! What a fantastic addition to East Elmhurst! 🎉 #Pokeyaki #JapaneseGrill #Sushi #EastElmhurst #GrandOpening #Restaurant #Food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJenVxSlN3EAE",
            "text": "I was satisfied with the dish I ordered. The food was very fresh and the flavors made each bite a delight. I recommend this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNk5fZFlnEAE",
            "text": "It’s nice knowing we have another restaurant that launched around the neighborhood, Evelyn was very nice and helpful ,  very patient with me , first time coming in this restaurant…. Nice to know we growing plus staff are very nice !!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMkpLTlVnEAE",
            "text": "Wow what a great place!!! Waiting for weeks for them to open and less than 15 mins we got our orders. Can’t wait to come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveE5PNUJBEAE",
            "text": "The food was delicious, the restaurant was very clean, and I’ll definitely come back again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNval92UjdRRRAB",
            "text": "Amazing customer service! I loved all the extra attention to detail! EXTRA SAUCE AND ALL ! 🥰🥰🫠🤤🤤🤤🤤"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcjRhT3RnRRAB",
            "text": "Just went today, a Sunday afternoon. It was my second time going here. Got a poke bowl again and specifically said I didn't want spicy mayo or whatever sauce gave it a kick the last time I ordered a bowl. Lady at the register said maybe it was their yummy sauce. I said ok, I just want the ponzu.\n\nI watched as they made it and the guy put on an orange looking sauce. I went back to the lady at the register. She said it was the yummy sauce, \"poke bowls always have yummy sauce.\" I've been to multiple poke places throughout NYC, yummy sauce is not a standard.\n\n1. Why isn't it noted on the menu that yummy sauce is in every bowl?\n2. Why does the menu say choose 1 sauce, with yummy as an OPTION, not a standard ingredient?\n3.  Why not tell me that the yummy sauce is always on their poke bowls BEFORE I pay?\n4. Why not just make a bowl without the sauce instead of telling me it has to be there?\n\nTaste wise, it's a basic bowl, nothing spectacular. They put some type of sauce brown sauce on there, but not regular ponzu that's thick and stays on top. And yeah, the yummy sauce is what has a bit of a kick that I didn't want.\n\nMy takeaway is that their menu needs to be clearer and their customer service could be better.\n\nThey were also disorganized when it came to calling out orders. My order was sitting on the side for several minutes along with other orders before my number was called. Let's chalk that up to them being new and needing to get a better groove."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOGRDZG5nRRAB",
            "text": "This place is so awesome. The food was really really good and was ready so fast I didn’t even have time to take a seat. The cashier Evelyn was very helpful seeing as it was the first time my fiancée and I ever ate here and didn’t know what to get. I highly recommend this place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdDVpbTBRRRAB",
            "text": "I got the beef & shrimp bento box, & it was of such high quality that I figured it could fetch a quadruple price at some high-end establishment in Midtown. Not only were the meat & rice exemplary, the dumplings & spring rolls were fried to perfection. If I lived closer, I'd guarantee a return trip! May they open a location at the nearby La Guardia Airport (&/or JFK &/or Newark) one day!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvczd1Z0xBEAE",
            "text": "The best Food here! Pretty cheap too"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOVkzaVlnEAE",
            "text": "I was eager to try this spot so once it opened we ordered. They don’t offer delivery so we used grub hub. We ordered 6 rolls: angry roll, poke yaki roll, rainbow roll, rock and roll and 2 shrimp tempura rolls. We only received 3 little soy sauce packets, 3! HOW? WHY? I tried the rolls but couldn’t finish them without the sauce. I did call to complain and was not offered any resolution. The rolls were okay not great. Definitely not ordering from here again- going back to TOMO."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvenREeU5BEAE",
            "text": "After a horrible day…. Missed flight.. ughhhh… needed some good food and sleep. This was a hidden gem… Evelyn was the best! She knew what I wanted before I even asked. She is a keeper!! Thanks for making my day better Evelyn!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa3V5NDJRRRAB",
            "text": "I've been waiting for this place to open! The food is delicious and the servers are super sweet and polite"
        }
    ],
    "reviews_count": 71
}