{
    "name": "Homemade Taqueria Jackson Heights",
    "place_id": "ChIJe6VzBNtfwokRl02Ez-itJuU",
    "grid": "QN3",
    "address": "75-05 Roosevelt Ave, Jackson Heights, NY 11372, USA",
    "rating": 4.2,
    "user_ratings_total": 263,
    "phone_number": "(718) 844-0930",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UGRuWklNVE16Ym5vd2VtNUtSMW81YkV0S2NXYxAB",
            "text": "SO DELICIOUS YUMMY NOM NOM"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NFZsQm9VRTloWmtSNU9VcGtkemRIZURWNGFWRRAB",
            "text": "Deportes"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNWRtVXlZalZaZEdjMVVucFZhVFpzZUdWRmJGRRAB",
            "text": "Les recomiendo visitar este restaurante asen buena comida mexicana asen unos deliciosa chelaquiles aunque yo no soy de México como creador de videos fui con mi familia y me encantó su comida"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VFUwTmpkVk13YzFsV1oydGhMVVpIUVd0YWRuYxAB",
            "text": "Nos encanta este lugar por la torta mexicana y las picaditas de chuleta ahumada,el servicio siempre es muy rápido y la persona que está al teléfono siempre es muy amable.\nLos precios son muy accesibles y la comida es decente por lo que pagas."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reWJUTlJjSGxtVW1KbU1ERndObk5tZWpCdmJYYxAB",
            "text": "The women who work here are incredible. The location was almost full of seated diners and they had way too many orders coming in to be able to handle with just the handful of staff there. Even overwhelmed  and understaffed, they were kind and quick and made my to-go ticket a priority since I was the only one there in person and on time for my takeout order. The people in the kitchen also have made every taco, burrito, quesadilla dish and sauce I’ve ever purchased here full of flavor and fresh. Note: they make one of the best grilled fish tacos in NYC. This has become one of the best Homemade Taqueria locations, and it is hard to compete with all the other cheaper taco places in Jackson Heights, but they do."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdFdWSXhlbWh3UkhOemJXVldhSGhKTUU5WFZXYxAB",
            "text": "Fantastic food- they make everything right in front of you on the street- I had a birria quesadilla that was awesome, and their sides are also delicious. Quick service and reasonable prices too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eVNUVjJOMjF4V0VObVoxSnZaMjE0VG5KMWRrRRAB",
            "text": "Customer service is zero too bad"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vNFZXUnlkbGN6TlRSUVVVMHdXSFJqUnpKR2MzYxAB",
            "text": "Food was great but the customer service was terrible that lady that served my husband and I  table give us the worst experience.  a mi nunca me habían tratado tan mal 👎👎👎👎 los otros empleados fueron muy nice. A y también le dejamos 15 dólares de propina aparte de que la propina ya estaba incluida en el cheque, para que aprenda que no todo el mundo es como ella mal atención al cliente"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSWNFTkVWMlZpTlZBeWNVVnhNVTVIUVhwNlpXYxAB",
            "text": "Place is beautiful music is lovely but the food is why I keep coming back. You will not be disappointed!! Plates came out hot and fast with room food for 2 meals!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNmJtdGFTMGQzZEVVNFduWnllRkpQWlc5bWFVRRAB",
            "text": "Got really bad food poisoning after having the mushroom and avocado burrito and veggie tostada here... Have never vomited so much in my life, for a full 24 hours, couldn't even keep water down. Maybe it was an issue that happened during the delivery -- it was an Uber Eats order. It seems I'm an outlier, as the restaurant seems to have good reviews, so I hope this doesn't happen to others."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWlQydG1UVzVtZVc5M1IzTnVTbGhVZVVsTmVFRRAB",
            "text": "Los mejores tacos de Queens! La comida siempre esta fresca y muy rica! Recomendadisimo!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbWFXVjJUblZIUWxKa1p6aENSWFZSTW13ek1sRRAB",
            "text": "No contestan el teléfono, contestan de mala gana, son unas simple meseras pero recuerden que ahí ética de trabajo eh..."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaGNVdFNhM0ZKVlV4U2MxTjNZVUZZWjA5NGVIYxAB",
            "text": "Walk right inside! Hands down the best quesadillas in Jackson Heights. The staff is so professional and very kind. Don’t think about it twice.\n—————————…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTWMwazBkbmMzTlZOd2FrbFJjRGcyYUVndFNHYxAB",
            "text": "Recommended by my husband's colleague（Beautiful Mexican Lady）, we made a reservation and dined there as a group of five. She chose and ordered all the dishes.\n\nThe food was fresh, delicious, and reasonably priced. My favorite was the cheese and beef nachos. The tacos were crispy and the best I've ever had.We would like to go back.\n\nThey didn't accept custom orders for drinks (just changing the alcohol).That response was the only thing that disappointed us."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeU1tMXFRbEV3VVcwdFZYRldRVVJDVm5reGFIYxAB",
            "text": "Hoy comí por segunda ves y la comida es espectacular son muy amables tiene una buena vibra y es muy limpio el lugar"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eVlVdzNaVkpUVVdKaWFrcFBiblEyWjBJMFoxRRAB",
            "text": "So good and very nice place! Wish they advertised themselves more. Way better than Birrialandia. Not as greasy, more meaty but in a good way!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUFJEZGxXbTE1UTBFNVFqazJkVGRaU0hVelYzYxAB",
            "text": "First time dining here, so happy to have stumbled across this place. Great food and attentive staff, especially on a cool day the aguas frescas were super refreshing!\nDefinitivamente volveremos!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Nd1RFZHZjRWs1UkdKa2FqUk1hVGcwZGtKa2EyYxAB",
            "text": "Service was great, restaurant was clean, food was amazing! We got a burrito and a tostada and both were great."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbWFuUnVTRE4xVTBkQ2RWaFdMV3BYY21acE1sRRAB",
            "text": "Buena comida, ambiente agradable"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV2NtSk9iblJtVkV4UmNVaHJabWxWVDFkT1ptYxAB",
            "text": "This place was amazing. I had their huarache order and I'd only had huaraches one other time in my life so I guess I don't have much to compare it to but I thought they were delicious. Oh! If you get the agua de sandia- get a large. I got a medium and had regrets, lol. 10/10 my total for 2 huaraches and the agua de sandia was twenty bucks and change. Not bad for NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kck5WUnRhbm8xYVdWRVNEUmlVMmM1YVdoM1YzYxAB",
            "text": "Had a little difficulty placing my order by phone and had to repeat myself several times but the food was good. Ordered the Cubana Tortas and the  sandwich was big enough, that i saved half for another meal. Order came out hot and pretty fast as well."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NFJGaHNkSGhaTTFWbGVVc3dSMFZUYURsdlltYxAB",
            "text": "Excelente lugar y el sabor original a México"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKcWFwdTZ1cGItVkt3EAE",
            "text": "Good, taste, fresh food. The servers were very very good, taking orders and moving fast between many people and they. The environment was nice. You can even get some live music if you're lucky."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNlI3cXlQZ1ppellBEAE",
            "text": "Excelente ! Los amo! Me voy de New York y definitivamente extrañaré este restaurante mexicano!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZm9wZUh2czQ2VWNnEAE",
            "text": "Good food  Good  price"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLVE0xdDJ4OW92dVp3EAE",
            "text": "Very nice place.. nice people good service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdi01TER5ek9MaWhnRRAB",
            "text": "Real Mexican food, fresh and hand made. Birria tacos and chicken quesadillas are the best!!! Definitely I will return for the tortas and huaraches"
        },
        {
            "date": "5달 전",
            "language": "zh",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKaUE0X0hpMmJ5TmlnRRAB",
            "text": "食物很美味，但是服务十分不满意，没有零食送！"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOcUxpcEtXaC1uN0VREAE",
            "text": "Got the app because i had to wait for my food for 15 minutes before. The food is good but the wait time sucks!!, i downloaded the app and  used it at 10:11 for pick up at 10:30 pm. My thinking was arriving a few minutes late at 10:41 but my food will be ready, nope.... I had to wait 15 minutes again... I had to ask when is my food coming out, no estimate time. Their app sucks!! Don't use it, the food is good but the wait time and the bad experience is going to prevent me coming again. There's way to many good Mexican restaurants to goto than this one. Coatzingo and birria landa etc, Sucks cause i like the food, if you go just be warned"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQdTRxb09udmNiMldREAE",
            "text": "The first time I ordered delivery from here here was a problem because apparently someone that was new and was in training took our order and apparently they don’t deliver all the way to our house, the person who took down my address wrote down the wrong address because they said they don’t deliver to Astoria I didn’t live in Astoria I lived close by around the area they said the the delivery guys would go to where I live if I left a good tip I said yes that fine because I just wanted me food at that point, after that incident we ordered 3 more times for delivery from there without any problem until about a week ago I tried ordering and the lady who answered the phone was very rude and said we don’t deliver there that you have to call the junction location I told her we’ve order from there many time already and never had a problem she said no we just did the favor for you  the first time (even though they are the ones that wrote down the wrong address) that we are not doing it for you again she eventually just hung up the phone on me. She was very rude won’t be ordering from here again."
        },
        {
            "date": "수정일: 5달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNUptcEJnEAE",
            "text": "The “servers” are ruining this place.\nLas meseras están arruinando este lugar.\n\nI know this place since it opened its doors and to be fair the food is good. Nevertheless, the servers are so rude and unkind. We asked for water and the waitress turned her eyes 🙄🙄🙄. She ignored us completely, ruining the experience.\n\nHoney, if you don’t want to be there, you don’t have to. Please look for another job and let us enjoy the delicious Mexican food.\n\nManagement should do something about this because there are so many complaints already. If so, I will change my review to 5 stars, but for now this is my sincere opinion.\n\nRegards.\n\nLas meseras están arruinando este lugar.\n\nConozco este lugar desde que abrió sus puertas y, para ser justos, la comida es buena. Sin embargo, los meseros son muy groseros y desagradables. Pedimos agua y la mesera nos miró de reojo. Nos ignoró por completo, arruinando la experiencia.\n\nCariño, si no quieres estar allí, no tienes por qué. Por favor, busca otro trabajo y déjanos disfrutar de la deliciosa comida mexicana.\n\nLa gerencia debería hacer algo al respecto porque ya hay muchas quejas. De ser así, cambiaré mi reseña a 5 estrellas, pero por ahora esta es mi opinión sincera.\n\nSaludos."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOU9lazNBRRAB",
            "text": "Fui al  medio día. Me pedí un combo 1 y unas tostadas  con pozole deliciosos pero claro hay más variedad de comida las tostadas son de tortilla echa hay mismo  así como los huaches. Las quesadillas  recomendado el día que fui estaba un americano con su hijo de algunos 7 años y me impreciono muchos ver cómo el niño comía unos tacos. Y les puso salsa y guacamole y el papa un burrito  y lo mismo con salsa visiten este lugar  es buena la comida"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd05Md253RRAB",
            "text": "I love the carnitas on the weekends. The beer is always nice and cold. Very good service always. My favorite taco place of all time. The waiters are always very quick, sweet, kind and accommodating. i wish i cold give 6 stars"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvenJLUkJREAE",
            "text": "The food is good, but the customer service is HORRIBLE…. I kept asking the lady for a singular cup of water just for her to ignore me, mind you she looked at me dead in the eye when I asked her to. After my friends ordered tacos they took Atleast an hour for like what 3 or 5 tacos?!? And when we asked for the bill it took 30 more minutes. And not only that, they automatically applied their tip to the bill which I asked to remove. The lady in the front gave me attitude and a dirty look. And also the prices are NOT it, especially for 3 little tacos. Also there are so many people selling candies in the restaurant like if they were on the subway, every 5 minutes they ask me and my friends if we want candy in a cardboard box like NO for the millionth time we dont want to buy m&ms, and the waiters were staring us down rudely and it made us uncomfortable. Never coming here again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcExmVTRBRRAB",
            "text": "Lenorado and music and the best"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvejhTZkVREAE",
            "text": "Cómo cliente digo que la comida es buena con sabor tradicional.\nEl personal que emplean no es el ideal ya que no son capaz de resolver una orden simple por teléfono, pues para ellos lo más importante es hacer el pedido rápido que complacer al cliente y si no te cuelgan la llamada. Servicio al cliente pésimo, me retiro como cliente......"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLWFfSS1RRRAB",
            "text": "Food is so good and the service excellent"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOHFEUzF3RRAB",
            "text": "Amazing birria tacos!!! Quesadillas are fresh and made outside and are big portions. Horchata is very good as well. They have different menus than online. 10/10 recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveEtEVmRnEAE",
            "text": "I came here with my family members and I was impressed. It’s a very inexpensive place to go to and the food was amazing. I loved the tacos. Everything was very appetising. I especially love the food from The Puesto they have outside, everything was extremely fast which I really appreciate because I’ve been to a couple of different Mexican restaurants and sometimes the service can be extremely slow, but here they were busy and I still managed to get my food within 10 minutes or so, which was great. The service was amazing and the lady who was helping us was extremely friendly and had a lot of patience telling us what different things were. I definitely recommend this place, but if you’re not an accustom to Mexican food, I would ask if the food is spicy or not. I will definitely be coming back here, thank you so much to the staff."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLVBTZkl3EAE",
            "text": "Excelente atención y servicio con una alta gastronomía mexicana y un servicio de primera clase"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdUpDX2lnRRAB",
            "text": "Food is good but horrible service. Never answer the phone and always gets the orders wrong when placing delivery. Would not recommend if you are looking to place a delivery."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdjdiVGJ3EAE",
            "text": "This is a very clean place, food, speak for itself 👌 😋"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbjR5WDZnRRAB",
            "text": "Visité esta taquería por recomendación de unos amigos y la verdad es que superó mis expectativas. Desde que entras, el ambiente es acogedor, con un toque auténtico que te hace sentir como en México. El personal fue muy amable desde el primer momento, atentos, rápidos y siempre con una sonrisa. Da gusto recibir un servicio así.\n\nAhora, hablemos de lo importante: los tacos. ¡Estaban espectaculares! Probé varios tipos y todos tenían su propio sabor bien definido, con ingredientes frescos y tortillas hechas al momento. El de carnitas fue mi favorito, aunque el de pastor también estaba increíble. Se nota que le ponen cariño a lo que hacen.\n\nOtra cosa que me sorprendió gratamente fueron los precios: muy accesibles para la calidad y cantidad que ofrecen. Puedes comer bien sin gastar mucho, lo cual se agradece hoy en día.\n\nEn resumen, una excelente experiencia. Buen trato, tacos deliciosos y precios justos. Sin duda, se ha convertido en uno de mis lugares favoritos para comer tacos. ¡Volveré pronto!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaWVuMzhBRRAB",
            "text": "Pretty good!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJakpqWDZBRRAB",
            "text": "Honestly my favorite taco spot im a regular customer and I have to say the employees are very sweet and generous people I don’t know who the chefs are but they make the food sooooo good gotta be some of the best food I’ve tried the combo deals are the besttttt overall love this place it’s amazing 🫶🏼"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ajVXalZ3EAE",
            "text": "I literally ordered on uber eats something and within two minutes I added a extra order, I called right before I did it and asked if it was possible to add to my order and I can give my card info to you she stated no so I had to had extra stuff when all I wanted was originally chicken tacos because for some reason it wasn’t allowing me to just process that it kept saying I needed like 7$ more or some shit but anyways it was basically two orders but going to the same person AKA me .. I only received half my order I called the store up mind you if I spoke in Spanish which I CAN, they probably would’ve been more nicer to me but I was aggravated I’m pregnant and im hungry and their acting lost as if they couldn’t have just put both of them together and handed it over to the carrier because it states on my end he was picking up both orders.. he showed me his phone and everything to let me know he didn’t see any added order which is fine I ain’t mad at him but the store it’s self could’ve just put both my orders together and it would’ve been fine… I know my kind and it’s sad I’m Mexican and Salvadoran and Guatemalan. Y si les hubiera hablado en español, habrían sido más amables y comprensivos como si fuera simplemente estúpido, ni siquiera quiero el orden que tengo ahora. No le haces eso a las personas que están embarazadas…  Descuidado"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3c1llZUJnEAE",
            "text": "Great food and service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NUxHUFVBEAE",
            "text": "Enjoy the chicken tortas with the fresh bread vegetables fillings and chicken. Although, I did not know what are the 3 bottles of red, light green and darker green chilli sauces, I have tasted all of them. The green chilli hot sauce is the best.  Easy environment with good lively music."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Z0wzcTV3RRAB",
            "text": "Food is good, but they wanted to charge me extra for salsa despite me having ordered double meat nachos and a burrito.\n\nGave me one some small container that wasn't even filled half way.\n\nI won't be able to come here again.  The only power I have as an individual is to not give a business my money."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OUtMbmJBEAE",
            "text": "Great people , ok service , great food quick service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBME5ma0F3EAE",
            "text": "There isn’t enough good things I can say about this place.  The first time I ever had homemade taqueria was in Maspeth, Queens and it was some of the best Mexican I’ve had hands down along w the horchata.  This location doesn’t fall short on the same amazement I got at that location, but feeling even more homey and welcoming.  The food is not only amazing, but the staff, the service and the atmosphere make you feel like you would be back in Mexico City.  The flavors taste authentic and fresh and it’s one of my neighborhood and after-work time staples although it’s short time in the community.  It’s an absolute banger every time, you will not regret coming here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcU5xZVRBEAE",
            "text": "Jackson Heights has no shortage of great food, and this branch of the Homemade Taqueria is no exception.\n\nThe simple dining room is very relaxed, almost cafeteria-style. The menu is broken down by category: tacos, tortas, encheladas, nachos, quessadillas, tostadas, burritos, huaraches, and picaditas.\n\nGiven that the tortillas are homemade (hence the name), we ordered a couple of tacos, an order of huaraches, and some guacamole. As expected, the tortillas and, therefore, the chips were excellent.\n\nThey also offer fresh juice, so I ordered a lemonade and watched them squeeze fresh lime into the blender, which was terrific.\n\nThe food arrived with three sauces: a roasted tomatillo salsa, a “guacamole” style sauce, and a spice chile sauce. All were hard to stop eating. Of the two tacos we ordered, the Beria was much better. The chicken taco was a little bland, but that’s what the salsa was for. The Huaraches were tasty; I ordered them with Al Pastor, which came with lots of pineapple mixed in.\n\nMany people ordered quesadillas, which looked fantastic as well.\n\nIf you are in the area, it’s a fun spot to pop in and have a quick bite. You can even sit on the stools by the window and watch the tortillas being made outside. It’s funny that they are made (literally) outside of both the kitchen and the restaurant, but who cares? They were great."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBalByaUZnEAE",
            "text": "Primera vez en este lugar, excelente comida y servicio . Muy agradable toda la experiencia. La mesera fue muy amable. Les recomiendo las quesadillas que hacen afuera …. Son riquísimas. Recomendado al 1000"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneXUzbzFBRRAB",
            "text": "Wonderful experience! Friendly waiter and lively music. Food was rich in flavor and fresh. Will be visiting again 🙏"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwa3EyTWVREAE",
            "text": "My mom and I enjoyed this restaurant!! It has a welcoming atmosphere with all the Mexican cultural art and on top of that the food is amazing with it being home made. The guy serving us also made my mom a limonada without sugar so they definitely accommodate to their customers wants. Definitely recommend coming here with family & friends."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c2JleXd3RRAB",
            "text": "Delicious!!! taste fresh!!! i been eating here almost daily and omg im so happy they give you the amazing mexican cream (other places are very stingy with it ) the sauces are amazing  :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbDl1b0ZnEAE",
            "text": "Delicious nachos and meats. Ordered myself the nachos with two meats and was not disappointed. The meats tasted divine and amazing. The nachos delicious with a good crunch. Everything from the Lettuce to jalapeños taste so fresh and so good. All of this peefectly complimented with a Mexican coke. I'm so happy I made it in here before a rush. I will be coming back. ♡♡♡♡♡"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUb3RxOHVBRRAB",
            "text": "Been coming here a while and just realized I never reviewed them!\n\nAlways excellent service and the food is always amazing. Also the tacos are huge and delicious!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNkllM2h3RRAB",
            "text": "Súper skinny quesadillas, I believe the chicken flew away. Not worth the $13. No flavor, bad sauces. First and last time. The girl was nice but hardly spoke English."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyN05xSTN3RRAB",
            "text": "What a cute place! Homemade tostadas, and an accommodating staff and chef. I have allergies and was thoroughly taken care of. The staff was not only helpful, but genuinely seemed happy to be there. I didn’t feel rushed.\n\nAlso, there are great vegetarian options."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNScmR3bBAB",
            "text": "There isn’t a taqueria on Roosevelt between 55st and 106st that I haven’t been too. I am confident this is the best one. I guess they just opened, I came with my family so I got to try a lot of things. The birria is amazing, the chorizo is unmatched, they also have combos which let me try a little bit of a few things. That was great. Service is nice, and it’s the closest Mexican place to the train. Very nice I ordered from here 6 times last week. Combo 2 is a great value. New favorite restaurant located 🥰\n\nUpdate: it’s been over a year and this is still by far the best Taqeueria for miles."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MS1fTUVREAE",
            "text": "I had chicken  Nachos and combo number 2, both were superb. Very friendly server. Definitely going back again. I loved it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIM3JiTkt3EAE",
            "text": "Family owned business. You Can get a really decent sized burrito with mushrooms and beef for under $14. Quite tasty too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOGRTbk13EAE",
            "text": "Delicious, clean, and high quality authentic food!! Reasonable pricing and amazing service!"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzb09ya2t3RRAB",
            "text": "El supuesto mole de olla, no tiene la mínima pizca de sabor Mexicano, está hecho con laurel y clavo ,epazote, e insípido no tiene lo que describe en el menú, ni lo que la mesera me dijo que tenía, le faltaron ejotes, le ponen calabaza cruda…Todo un fracaso!!\nPor lo menos usen consomé en polvo, ya que no saben cocinar. No lo recomiedo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkazZlVkhnEAE",
            "text": "Cute small restaurant with friendly service. I’ve ordered their tacos a few times and it’s consistently good. Their shrimp tacos are delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNONl9tb293RRAB",
            "text": "Food is amazing! They made fresh tortilla for your tacos, Quesadillas etc…\nI will be back for sure"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bzVEQWR3EAE",
            "text": "A solid choice if you’re looking for Mexican food 🇲🇽\nHomemade Taqueria features a wide range of meals and they’re all at decent prices. The portions are bigger than what I get at most taquerias, so I’d recommend you go with your stomach empty. I’m vegetarian and they easily have options for me, like the veggie tacos, veggie nachos, cheese quesadilla, amongst others. Their Jamaica is also tasty. This is one of my go-to spots."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OXYtMF9BRRAB",
            "text": "I walked by this restaurant yesterday and decided to check it out with my wife. We had nachos and a torta, which were the best nachos and torta I’ve ever had living in the u.s. There’s a lot of things going right with this restaurant and I hope they succeed, it looks like they opened recently, so I wish em luck."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbUxhaXpRRRAB",
            "text": "I had nachos with steak and 3 kinds of tacos (chicken, shrimp and chorizo (Mexican sausage)) It was delicious."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSM2ZYTVFREAE",
            "text": "Un lugar muy limpio, puedes sentir que la comida es bien casera, sus tortillas son suaves y deliciosas, perfecto de sazon y sal, precios bastante comodos y sobre todo la cantidad perfecta de comida, ame este lugar desde su apertura. Este plato son unas enchiladas de carne con salsa verde"
        }
    ],
    "reviews_count": 71
}