{
    "name": "Jackson House",
    "place_id": "ChIJq84bt6hfwokRCYq_qqqZ97c",
    "grid": "QN3",
    "address": "82-14 37th Ave, Jackson Heights, NY 11372, USA",
    "rating": 4.5,
    "user_ratings_total": 714,
    "phone_number": "(718) 639-6201",
    "reviews": [
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MFBmYWpRRRAB",
            "text": "Good food. Reasonable prices. Excellent service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TGJuWTFWVEpCZFc5WU1UQTNWMFkzVFRSak1uYxAB",
            "text": "This place is so nice and taste is really good:) recommend 10/10 !!!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUGF6VkxWSEZJUzJaWFoxQnZOMHA1VFdwb2QxRRAB",
            "text": "The person speaking on the phone is so rude if you’re gonna answer in that way and not like your job might as well quit your job because how rude you are"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbU9GaEJXREpCVEhod2RqRjJXSEZTYWs0eU0xRRAB",
            "text": "Tourist from Florida here. Decided to try out this diner right a flight and I was wonderfully surprised! The food is impeccable, portions are large and ordering one meal covers for two people, the staff is genuinely wonderful and helped me understand how the diner works.\n\n10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWFdEUjVOWEEwZFhwc09XODVOWEJ2WVV4dE0yYxAB",
            "text": "The staff treat the regulars with great care.  Its fine for a booth to yourself. If you ask for tea do not expect a refill unlike the coffee."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VONzgtTGVfdHVHWlF3EAE",
            "text": "Nice and comfy small diner in Jackson Heights. Food is always on point, so delicious."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLRFcxcHlwcS1YVzZBRRAB",
            "text": "La comida es muy rica primera vez que vengo aquí tiene un toque muy bueno"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb2RIM3VBRRAB",
            "text": "Very friendly waitress recommended I try the waffles. I shit you not they were the best thing I've eaten in 4 years. Whoever made those waffles is a god among men."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcXFEU3dnRRAB",
            "text": "This place ins very cheap and with amazing food, very fast service and great"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRM3ZURjRBRRAB",
            "text": "Muy mala atención y encima te tratan como si fueras un delincuente me refiero a las señoras que te atienden en especial una señora ahí que no se si es mala suerte pero siempre me atiende y la verdad hasta quisiera salir corriendo y no pedir nada"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNlphaF9RRRAB",
            "text": "Best diner"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBM3BXXzR3RRAB",
            "text": "perfect place to get breakfast, is cheap and the service is so nice. this place is really old school american breakfast(in a good way), i like it this place, the portion is also a lot and free refill coffee, recomend! 8.5/10"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdFlxYXp3RRAB",
            "text": "I've been using this dinner for many years. Good food at a reasonable price. The staff is always very friendly. It's a small place, but it's a very typical nyc establishment."
        },
        {
            "date": "9달 전",
            "language": "it",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMWNYZ05REAE",
            "text": "Posto tipicamente americano : cibo davvero ottimo e personale molto gentile.\nConsigliato."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NjkyQjZRRRAB",
            "text": "Food and service was amazing, the cooks were slow bringing up our order, but, when the food came out we were in heaven."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cUltQlBBEAE",
            "text": "Cozy diner with great breakfast and fun staff!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNjVTSWdRRRAB",
            "text": "Great quick bite"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ0pMLWlBRRAB",
            "text": "Solid, old-school diner with good food and great service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMW8tVTJnRRAB",
            "text": "Excellent food. I highly recommend and have reasonable prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNG9qUXJnRRAB",
            "text": "I'm surprised that I haven't left a review before. I love Jackson House and try to stop in fairly often for breakfast or lunch. The service is always amazing and pricing is fair."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeV9QbDJBRRAB",
            "text": "Used to be better breakfast, the potatoes it wasn't  like always."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaTdTcmVnEAE",
            "text": "Always the best service and the most delicious breakfasts and with a great variety of dishes for any time of the day. The entire menu is more than delicious 😋 I love this place ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNGYzVUx3EAE",
            "text": "We went for brunch to this restaurant with our grandchildren. We were greeted by the nicest waiters of all time. My husband and I had the Club Sandwich and our grandson had pancakes and bacon. The portions were so generous and quite…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMXVEVFZBEAE",
            "text": "The food was good the services was awesome they came like in 5 minutes so overall highly reccomend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6d2Qtay1RRRAB",
            "text": "This is the quintessential diner and the food is fantastic! The service was phenomenal when I was there in August 2023! Pancakes cooked to perfection, eggs done as requested and selection in menu was top notch. I'm already planning to return here on my next trip to NYC, next year... It was that good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6NXZMNzhRRRAB",
            "text": "Excellent 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUa0plVjJ3RRAB",
            "text": "Good place with the comfort food you emotionally need..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb1pMWEZREAE",
            "text": "No frills, nyc diner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMXJMS2FBEAE",
            "text": "Such a friendly greeting when we arrived! Never having been there before we were quickly met and told to choose a table. Our server was friendly and cheerful; quick to bring us steaming hot coffee! As busy as the restaurant was, we did not feel neglected.  Just the opposite.  We felt important.\nThe food was classic diner food and comforting. We will be back :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ3JDSXNBRRAB",
            "text": "Terrible service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbzdtVXVBRRAB",
            "text": "I've been going here for 23 years. Best diner in Jackson Heights, and they make the best turkey burgers :)"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcHNxS3dBRRAB",
            "text": "Comida americana muy rica"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaHBhcmpRRRAB",
            "text": "La atención  es muy bueno  la comida  es excelente"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MGVyLUd3EAE",
            "text": "Amazing quality breakfast foood! The ladies here know your order if you’re a regular and they always check up on you to see if you want anything else. Waffles are to die for!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5bXV6czlBRRAB",
            "text": "The lady who attends is so friendly and makes us feel home. She was kind enough to correct the check when I told her to split it. The food was delicious. Definitely will come back."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MU1uN2lnRRAB",
            "text": "Buenos platos"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5d0pLdWpnRRAB",
            "text": "By Far nice cozy family diner highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dGJ5OGt3RRAB",
            "text": "Nice diner to grab a bite to eat. 2nd time being there and the waitress was sweet and pleasant. Will definitely go back again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVdWNDM0xREAE",
            "text": "Great place for local diner food. So good that it gets crowded and busy. One must have patience if they want to eat here at peak hours."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNTViSEdREAE",
            "text": "Nice little restaurant here. Enjoyed the sausage and cheese omelette. Service was good, space was pretty tight. Coffee was so-so and bread was good but a hard."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1aTQ2MjhBRRAB",
            "text": "Started eating here during the pandemic for home delivery.  Went there this weekend for the first time.  The servers are great, they are are really sweet and kind. The Coffee Guy is real attentive as well.  The food is good, they still give you the steel cup where they make the shake instead just throwing it away like a lot of places do."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcTdMM3RRRRAB",
            "text": "After months of eating here practically daily, it comes with a heavy heart that I must find a new go-to restaurant. I really wanted to like this place, but too often the food isn't right. It might be that some of their cooks just aren't very good at cooking.  The final straw came today when I ordered an omelette cooked soft. What I first received was an over cooked omelette with way too much cheese.  I quickly pointed out my concerns and with the next omelette that arrived the waitress stated \"here's a soft omelet\". I sensed that something wasn't right and after a couple of bites I realized it was woefully undercooked, during my last bite when I could feel part of it drooling out of my mouth I had had enough.  Did anyone come to ask how the food was, no.  When I clearly wasn't eating any more, they asked if I wanted it to go and I indicated I did not, they again didn't bother to ask if I was happy with my meal.  Instead I was charged full price for the rather disgusting food. I left there completely disappointed with an upset stomach.\nA few things about my overall experience:\n1. the food quality is hit or miss\n2. For several dishes, the amount they're cooked, their flavor, and the ingredients used aren't ideal, but by providing instructions they can usually make it right the next time.\n3. I've only complained twice, the first time I tried to just eat the food but as I reached the halfway point I realized I couldn't stomach another bite.  When I complained I was advised that I should have complained sooner.  So the second time I complained, I quickly informed my waitress, but the experience was rather uncomfortable. I had to reinforce two or three times that the eggs are overcooked and then showed them on my phone a picture of what the omelette should look like (ironically, it was the omelette that was served to me during my previous visit) and the responses I received from them weren't positive - I expect better.\n\nPrevious Review from three months ago:\nFive star review\nThis place is fast becoming my go to American diner for all things diner related.  This was my second visit and both times they did not disappoint. The first time they made me a delicious omelet that had fresh sliced avocados, cheese, and few other wonderful tasting items. On todays visit I had the Jackson House Combo platter and everything was very tasty. Both times I ordered coffee and they kept it topped off without having to ask (I never had an empty cup).  The service was fast and friendly and my food came out quick.  Definitely coming back again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1N1pLRUd3EAE",
            "text": "The spinach pie crust wasn't flaky. The spinach filling taste like it has vinegar in it. But was kindly taken off the bill. The fried chicken was as good as it looks in the picture. Even the french fries were delicious. Not even one was burnt tasting. The people are so nice. The restaurant is extremely clean, except for flies on the wall. The salad was so fresh like it came out of the garden just before serving. I'm only giving it 4 stars because of the flies on the wall."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMkt1dHVBRRAB",
            "text": "Came here multiple times during my first trip to NYC 3 years ago. Place hasn't changed a bit. Friendly staff, good food for a good price. I know I'll be coming back here on my next trip to NYC. Recommend the combo for breakfast, 16 dollars gets you a lot."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4djRQalhnEAE",
            "text": "I've been living in Jackson Heights for 6 years and I've always seen this diner but never eat there. Today for some reason I ordered breakfast from here and I truly regret why I wasted 6 years without eating there. Food was GREAT!! It is honestly the best waffle I've ever eaten in a diner.\nAlso the service is good. The gentleman that helped me on the phone was kind and super fast to take my order. I will defenitely order from here very often.\n\nOnly problem that I order my eggs over easy and I got them well done but that's not a problem it was still delicious. 🙂\n\nKEEP IT UP GUYS!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndEtuLVFnEAE",
            "text": "My new favorite place for breakfast! The people are so, so sweet and my food was amazing. I got the typical two eggs with hash and sausage- nicely made without being greasy or salty. The sausage they use isn't as fatty as many other diners…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdU1pRm5nRRAB",
            "text": "I really like this place been coming here for years and they ladies recognize me every time that's service right there ! Food it's always fast and well prepared o feel like home here , super accommodating with my family all the time the busboy it's super friendly too hands down the best dinner around"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcmRlMm9nRRAB",
            "text": "I've been ordering for a couple years. I'm not one to have it often but when I do, it never dissapoints. Today I wanted mushroom omelet with spinach & sausage. Avocado on the side. It comes with toast & home fries. Also had coffee &…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dnJEMkNREAE",
            "text": "Jackson House the jewel in Jackson\nHeights! It's been owned by the same\nfamily over 50 yrs! It's PERFECT 💓"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacEtUZ0hBEAE",
            "text": "Just your typical Diner with an old school charm to it. Food is always prepped good. No complaints. Staff are very friendly and out going. Food rating is a 3 out of 5  because its a diner. There isnt anything that separates it from other diners food wise. Same menu as other diners but the quality is very good.."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZbzdQWkt3EAE",
            "text": "Delicious food and excellent service!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPay1DTVlnEAE",
            "text": "REPORT CARD\n\nEnvironment  A++++\nThis diner is clean and comfortable.. Tables are wiped down frequently .\n\nService  A++++\nThe service is outstanding !. The servers always  make  sure that we were attended to courteously and promptly . The owner and staff here are wonderful ! They are all very special, friendly and efficient .Want to mention some of the names that I was able to get:. : They are  Erika, Rufina, Rosa, ,. Manuel  and the owner, Cristina,   Hope I didn't leave anyone out. They are all great ! The men , who you see  in the front of the diner, preparing  our  delicious meals are hardworking and do a wonderful  job !\n\nMeal( s)  A++++\nWe have  also  have truly enjoyed our meals here  They are plentiful and delicious .Today we ordered a Buffalo Burger sandwich ,that came with a pickle and coleslaw  and requested that  a slice of tomato be included.. We  also ordered a  toasted  Swiss cheese  sandwich  on rye bread with raw onion\nEnjoyed our beverages as well .Loved the hot coffee and iced coffee. .\nEverything is reasonably priced.\n\nWe will definitely keep coming back here .It feels like it is our family .\n."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MWI3ZTFBRRAB",
            "text": "Excellent service! Staff very friendly. The waiting time wasn’t long  during brunch hours. All covid rules are followed. At first it seems a little small but it’s actually perfect for a small family. Shout out to our waiter today!! she was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNlBIeXNRRRAB",
            "text": "This is the quintessential old-school NYC diner. Tasty diner fare at good prices, friendly staff who know your order by your 3rd visit. Bustling, buzzy weekend mornings that feel like the heart of the neighborhood. There aren't a lot of places like this left--come while you still can!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaE5MZTNRRRAB",
            "text": "Amazing spot to go to. The service is so sweet, I felt like I was at home the way they accepted me in. Perfect service. I felt like the women with curls was my mother or grandma 😭, the absolute sweetest. The food is great too, fills u up nice and good. Un area perfecto. 5/5! Definitely coming back 😈🫶…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcUlpZzBRRRAB",
            "text": "Food was amazing but I couldn't help but laugh at the size of the sides. Container was the size of a Dixie cup or something smaller but the triple decker sandwiches let that slide. Apart from that the waitress we got was so bitter and off putting that it definitely makes not coming back here an easy choice. You're better off asking for delivery."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybHVDel9nRRAB",
            "text": "The food is great and the service from the waitress to I gave three stars is for the guy than help her because he has a terrible attitude like an angry dog he brings to you water if he wants and if you ask for it he snarls. In this kind of…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdUk2QUJBEAE",
            "text": "Amazing\nMy daughter went there with her friends for Secret Santa\nThe waiters are extremely friendly\nAnd they put tables together in order for them to sit together.\nAnd the food was the best part.\nThe owner is the chef in the restaurant.\nTheir fish is awesome\nAnd I left the them a big tip."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyc2M2UzBBRRAB",
            "text": "I've been coming here for 12+ years and I feel at home. The servers are really sweet and kind. I always forget \"The Coffee Guy\" but he's really nice and attentive as well so I make sure I always tip him too."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhLThLaklnEAE",
            "text": "There’s nothing like a family run diner in the middle of the Big Apple. I’ve been going here for the last 15 years and it will always be a favorite. I wish I’d wrote a review sooner. The employees are always welcoming. The food takes 15 minutes to come out even when the restaurant is full. Someones always ready to refill coffee. I always get the same thing when I go here (the photos were 1 week apart lol). The food is always delicious and fresh. When you eat here its like eating at your moms house. A staple if you’re visiting nyc."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDbXRUbDhRRRAB",
            "text": "This is a solid NYC diner that never disappoints.  The food is always well prepared and the portions are ample.  Service is generally attentive without being clingy or intrusive.  I'd recommend the turkey burger, spaghetti and fish cakes, chicken croquettes, chicken-salad club, or any breakfast item."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrM3VPRUxnEAE",
            "text": "The food is excellent and the price is just right. The servers are very accommodating and it give off a very homely feel. I love coming here but be prepared to wait, especially on Sundays the line goes out the door! The early bird really does get the worm."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaU1TS1JBEAE",
            "text": "Enjoyed the sausage egg and cheese roll and it was so delicious and very filling. Coffee and customer service was perfect. Great place for a quick breakfast!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRa2U3ejl3RRAB",
            "text": "My family and I LOVE this place! They have DELICIOUS food. Unfortunately, we were really disappointed on Mother's Day with the server Ms. Candy. It all started with her taking another table’s order before taking our order even though we got there first and we were ready to order before the other table. She had a VERY RUDE attitude the whole day. When she brought our food to the table she brought a order wrong. When we told her we asked for home fries and not french fries she got very upset. When we told her about the mistake she SNATCHED the toast she had put on our table (that we were about to eat) and said \"I gave you extra toast.\" She goes on to tell the cooks \"they got too much toast take the toast out.\" She did this out of spite due to a mistake she made. Then, we had to ask her THREE times before she actually brought us milk for our coffee. Lastly, when it was time to pay she brought us a check with two different totals. We are all humans, we all make mistakes, but this lady's attitude and rudeness was extremely uncalled for and very UNPROFESSIONAL. Our intention was to take our mother out to enjoy Mother's Day at our favorite restaurant but Ms. Candy made it a terrible morning. It’s such a shame because now we are going to think twice before coming to this restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdU1IYWxRRRAB",
            "text": "It wasn't really anything special but the service was great and the breakfast was like any typical diner. Fast and simple. It's a really tight fit in there though but good for a quick breakfast. Better than Hahn's."
        }
    ],
    "reviews_count": 65
}