{
    "name": "Arepa Lady",
    "place_id": "ChIJnyOF-alfwokR7sHwDUkuKoY",
    "grid": "QN3",
    "address": "77-17 37th Ave, Jackson Heights, NY 11372, USA",
    "rating": 4.6,
    "user_ratings_total": 1341,
    "phone_number": "(917) 745-1111",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrd1JWWnhaVFIwY0dWT1duVldaR3BHY21ONkxXYxAB",
            "text": "Loved it! Good service, great food and amazing server named Brandon."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obFVuSlFSM2RPTFRCWloyd3pUamRCTkU5UVlXYxAB",
            "text": "$20 for an arepa and this is how it comes? Save your money and go somewhere else."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTldVbzJlVXQ0UlcxTGJsWmFSM2hsWWxkaWMyYxAB",
            "text": "Let the staff guide you through the large menu of arepas, and thanks to Lucho for helping my craving for steak and avocado settle on Arepa de choclo carne asada! The white sangria is a bit sweet and the red sangria more dry.  Good side sauces include a sweet pineapple salsa and a creamy lime garlic. Thank you Arepa Lady!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twV01qbEhiMUJxTXkxQlUxQlFkMkl0UkdaTVpYYxAB",
            "text": "A really beautiful place to have Colombian cuisine, the cheese arepas were on the sweeter side rather than savory but had incredible flavor. Service was also quick and provided recommendations on parking and things to do in the area. Overall recommended place for visits and a quick meal."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeFJFMUNVbHBVVFdrd1IzTmpWVTluZEU0eE5tYxAB",
            "text": "Will be back. Had a great experience. Loved the food."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeVpEWXpZMlpZV2t4a1RsODVRblU0U2xkeFJrRRAB",
            "text": "Pedí una botella de agua con gas\nY una arepa de maíz rellena de carne desmechada con chicharrón y plátano maduro\nMuy bien lograda buen aroma sabor contundente muy bien ejecutado sabor criollo colombiano una arepa que no falla 🔥❤️ lo dice un chef con 12 años de experiencia"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVkxXUk5kMlUyVjNCc1dtTlNaVkEwWVd0VVltYxAB",
            "text": "All arepas were amazing! - crispy, fluffy and warm. We got Arepa de chocolo and Arepa Rellena. I like their chorizo, baconand sweet plantains- perfectly seasoning. Also, they also have condensed milk and sauces on the table for you. The atmosphere was cute, nice and cozy. They also big screen on the wall the watch the sports."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeVFYQXRkVTVLVkdsUlpsSlRRMWg1WW1WWldWRRAB",
            "text": "Amazing food, great environment! The music is good and the staff are so friendly! Love this place! 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSa1UzSnZSbmw0VWxaR1dUTnBNRU42ZGtSUlMzYxAB",
            "text": "Lucho was super sweet and very attentive. He was kind enough to help us get connected to the wifi to get some work done, while we juggled the kids. I had the arepa with grilled chicken, the mozzarella sticks, and the straight cheese one. Even took some home for dinner which heated up easily. The bathroom decor is so cute and original. Highly recommend coming here."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RFp5MUhSMmMxYms5dVEzZDFXSEpGWVdzMGNYYxAB",
            "text": "Me encantó jajajaja me comí dos arepas rellenas 💋🥰"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wV1JsQTROMVpUUkUweWQzTjNaRmt3TlV0WlFsRRAB",
            "text": "If you never had a Colombian arepa, you are missing out! No place does it better than Arepa Lady. I have tried various arepas and empanadas there, but the arepa de chocolo con chorizo is my favorite. They give you a variety of sauces too, which are all delicious. The restaurant is impeccably clean, the staff is friendly, plus it looks like a perfect place to also get drinks and watch the World Cup next year. They have a massive big screen tv! I love this place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eVFUUmZSVkp3TWtSaU5FWnNNazB3U2tsaFMxRRAB",
            "text": "Arepa Lady in New York is a small but very pleasant and well-organized place. The service was excellent. I was attended by Carol, who truly provided extraordinary service, always checking on my table and giving great recommendations. The other person working with her was also very attentive, coming by several times to ask how everything was and if I enjoyed the food. There was even a large table of about 24 or 25 people, and despite that, the food came out very quickly, which shows great teamwork.\n\nThe choclo arepa with cheese had a very good flavor and a generous amount of cheese for its size, although I do think it’s a bit overpriced for being just an arepa with cheese. I also tried the choclo arepa with cheese and grilled steak, which was excellent, with the meat full of flavor.\n\nOverall, a highly recommended place to enjoy delicious arepas."
        },
        {
            "date": "수정일: 1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbk1VWnRUMkoyVXpZemEwcGFUbEZIV21jNGJIYxAB",
            "text": "Es la segunda vez que voy a Arepas Leidy, una vez fui a Astoria y compré 4 arepas y dos jugos y la cuenta fue absurdamente cara, las arepas son buenas no la gran cosa honestamente, los meseros te están preguntando cada nada que si como te sientes y no de amabilidad sino de “recuerda la propina”  ese día compramos las arepas y dos jugos y la cuenta absurdamente ascendió a 136 dólares y curiosamente cuando pagas la única opción disponible es la de dejar la propina más alta, presiona No TIP no funciona presiona 5% tip tampoco funciona  solo la opción más alta, ayer con un colega fuimos al cerca de la Roosevelt dos arepas rellena mixtas de $16 dólares una colombiana que te la sirven en un vaso pequeño que probablemente tenga la mitad de la soda y una aguapanela que tenía todo menos panela, aclaro la arepa no es mala de hecho es buena y las salsas son buenas y esta vez seleccioné No Tip y curiosamente se seleccionó la más alta una vez más $54 o 56 dólares aún tengo el recibo para probarlo, una vez más Arepas Leidy y sus trucos de quitarte el dinero no volveré a ese lugar"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUVFVZFpSVVZqY0hOMFNHZG9kbGQ1YkRVMlFsRRAB",
            "text": "Nothing much to say about this place other than all the nostalgia that it gives me. The quality of the food has always been great especially their portions for their prices. Would recommend to anyone on a budget"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSVZFbEVlWFZTU0ZGRFVYaDNTbVl0YVVsWFVXYxAB",
            "text": "Absolutely delicious. The parking is the only drawback from this place. Take mass transit if you can. Not far from the Subway. The food is excellent. I will absolutely be back as often as possible."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWk1YQmthbWwzV0RkNmVYTmlRbVptVG5GSFgzYxAB",
            "text": "We had such an amazing experience. The arepa was Delicious and the service was beyond exceptional! Lovely location and great environment."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOZlNYQnBObmhHU1ZOdmRVbDZkaTFMUzNsNExWRRAB",
            "text": "Tast arepas! Gluten free"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUU0yRkplSFZWYWtWTVJUVkdWVzh3VkhSa2VsRRAB",
            "text": "I love ordering their arepa queso with chicharron , I can’t get enough of it . The staff are super friendly and accommodating."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdFVsWlRYM1ZvWDAxRWJucHljbWN5WjJaa1oxRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nAbsolutely delicious! Arepa Lady is a hidden gem in Queens. The arepas are out of this world, crispy on the outside, soft and cheesy inside, and full of flavor. Every dish we tried was fresh, tasty, and made with love. The service was also great,friendly, attentive, and welcoming. Highly recommend this place if you’re craving authentic Colombian food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTFRIbFdjbk15UzBjMGJsOW9iVkpqU2pkeWMzYxAB",
            "text": "Tasty, but I thought these would be entree sized and they were more like appetizer sized. I had two and was left hungry, and I'm not a big eater #Appetizer #Hunger"
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neWJrbFpaWEZ2UTBwc1FVYzNNemQyVmkxRVduYxAB",
            "text": "Un rincón de América Latina que se destaca en el mix de sabores que ofrece Jackson Heights en Queens. Arepa Lady tiene una carta sencilla pero altamente sabrosa. Pedí el plato de tres arepas diferentes y todas resultaron deliciosas. Lo acompañé con un jugo de frutas natural y la infaltable salsa Cholula."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeE1GcFVYMjVDUjBaWmRERlRZakV5Y1hWcVRFRRAB",
            "text": "This was one of the best meals of my NYC trip. Absolutely delicious arepas and plantains. I loved every bite and everyone had an amazing and very memorable experience. If you are ever in Jackson Heights, make sure to stop by."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VFNrbHhRMXA0VG0xSU1tcEhOMHRsU1Y5elMzYxAB",
            "text": "Bandeja lady platter was the best! Chorizo was perfectly spiced. Friendly staff."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTGFrdzFaME41ZUUxM2NHNTBSbWsxWTI5dU1YYxAB",
            "text": "Les super recomiendo este lugar, donde podrán disfrutar de una gran variedad de arepas con diferentes acompañantes.\n\nEl sabor es exquisito"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWalQyeGFlbm95YW1Jd09GcGFSbmhHUlZwMFJrRRAB",
            "text": "I had the best time with Jacqueline. The hostesf with the mistreat. She was  kind, attentive and joyful. She made my experience incredible. Thank you so much, Jackie!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVaDVUcTBBRRAB",
            "text": "Best spot for arepas. Get the passion fruit juice too (or a margarita)!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrNE5ubFRSa3N5T1Vad1UyaGthVzl4ZVZSUk4xRRAB",
            "text": "A great place to visit if you want an arepa! The food is so filling and the sauces are amazing. We previously went to their location in the Dekalb Food Hall, which has since closed so we had to visit the original. Our visit did not disappoint and I look forward to going back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRGRGcG9kVFZ5UjJseFQzcFlRakl5VkVGd1pYYxAB",
            "text": "This is my first time trying arepas and they absolutely blow my mind. They’re like light sweet and savory pancakes with different stuffings, pork, cheese, shredded beef, etc. Every bite brings me lots of joy and comfort. There’s no other way to describe the food besides delicious 🤤 They are made by corns, as delicious as a pancake, but it’s light and healthy and endlessly delightful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdFlVbzVSRFJ1TTNkUWQwRk1ZMmw1V0dnek1sRRAB",
            "text": "The best arepa de queso I’ve ever had! My favorite spot when I worked at Elmhurst. Especially love the salsa rosada here!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOV3BrTnJaNDRPV2F3EAE",
            "text": "Living in Montreal, it’s a must to stop at Arepa Lady every time I come to NYC to eat the cheese arepa with shrimp on top.. It’s out of this world! But this time I came and tried the brunch, it was amazing. The calentado was super yummy and they give a good portion of beef.\nService is very good as well. Like I said at the beginning of my comment, Arepa Lady is an MUST every time I come to the city which is very often. I highly recommend this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJUC1tWTNlN09YZVR3EAE",
            "text": "Nothing special..."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJS1otdXJ3anJPTmVREAE",
            "text": "Magnificent spot! The Veggie Arepa was delicious! Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdWM4YzNac2REY29BRRAB",
            "text": "First time, the food was amazing, service was good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdkk1T1NIZzlpNGlRRRAB",
            "text": "I came in because I was craving an arepa de choclo (sweet corn patty) with cheese. Ended up having a Patacón with Pollo desmechado. This is shredded chicken with avocado 🥑 served on top of a green plantain which is smashed and deep-fried. This particular dish was executed to perfection & absolutely blew me away! The chicken was juicy & very flavorful and the green plantain was crunchy which made it absolutely delightful and satisfying!\nI ended up ordering the arepa anyway, just to try it & took left overs home since it is quite large. To my surprise it was thin & presented as a crepe stuffed with cheese, instead of the traditional Colombian arepa de choclo, which is so much thicker sweet corn patty with cheese on top. Even though it was different, I thoroughly enjoyed it!\nI’m Colombian & have high standards. The service was excellent & will definitely be coming back to this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdXd2X0xRaTlYOUhREAE",
            "text": "LOVE LOVE LOVE coming here for their arepas, soursop juice with milk, and tostones!! They also have amazing sauces! Love the vibe and music too, a must go in Queens."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJV3g5SV8wa2VuVW93RRAB",
            "text": "Karol, lucho y Manuel do such an amazing job to make you feel welcomed! I come with my partner and they are always so welcoming, they’ve gotten to a point where they know our orders and provide amazing experience. The food overall is so good! I always do the arepa rellena and it never disappoints."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0Y3cUd1dXJPdHhnRRAB",
            "text": "This place is the best! Karol , Lucho and Manuel are the best. Food is delicious and costumer service is always 💯 thank you all!…"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyb2VmMGpRRRAB",
            "text": "05/16/22: I had a magical experience!! I went twice in one day because it was so good. I’m thinking of going back for my third time before I leave NewYork.\n\n11/15/22: Returned 5 months later and this place is still amazing! Food 10/10. Service 10/10.\n\n05/28/25: Back again! Just wow! Every time the food is just as good as the first time. The service 10/10."
        },
        {
            "date": "5달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKR3ZpNy0tbWZLOFVBEAE",
            "text": "Amazing place and food. Felicidades mis amigos!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcWowSmkyMC1ybDJnRRAB",
            "text": "Una joya escondida en Queens.\nArepa Lady es uno de esos lugares que te hacen sentir como en casa. Probé la arepa de choclo con queso y fue una delicia: dulce, doradita por fuera y con el queso derretido perfecto. También pedí unos patacones súper crujientes y una Colombiana que acompañó todo increíble.\n\nEl ambiente es familiar, el servicio muy amable y se nota que la comida está hecha con amor. La historia de Doña María le da un valor especial a este lugar, y se refleja en cada detalle del menú.\n\nIdeal para quienes buscan comida auténtica colombiana en Nueva York. ¡Volveré sin duda!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKUDA2N1NmdEpfOUZBEAE",
            "text": "Great local neighborhood restaurant. Service prompt and friendly. Food excellent. Lots of choices and sides"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbTdvNlhPdGVDUmR3EAE",
            "text": "A beautiful, quaint place in Jackson heights serving up some of the best arepas I’ve had in the states!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMTQ3ZVNBEAE",
            "text": "Muy delicioso 😋, recomiendo mucho la arepa con queso y leche condensada"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbkR4S3ljNWRUWFdBEAE",
            "text": "very tasty arepas in a friendly environment with efficient and attentive service. You can tell the employees are happy and care for their customers. Busy venue, even later in the evening, as this spot has gained fame from years of good food and service, and a strong reputation. Tip: try the condensed milk on your arepa - it is the best of all the options waiting on your table."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMSC0wN2pTbUl6NWFnEAE",
            "text": "I had the mixed chocolo arepa and it was out of this world amazing! So fresh and delicious! I also liked the ambiance of the restaurant and the decor. I would definitely come here again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbU9YQnlRRRAB",
            "text": "I was waiting 2 min.for food!!!They heated in microwave!!!!Food tasted nasty"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMTlybkF3EAE",
            "text": "Limpio, agradable, buen ambiente y la comida suuuper rica. A mi gringo le encantó y no es costoso es un precio justo…"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvemVxaThnRRAB",
            "text": "Sobrevalorado. La comida es regular, precio-calidad no corrresponde, muy caro. Comimos 2 arepas y 2 cervezas a $70"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDM3V6dkVREAE",
            "text": "The food was delicious. We liked the pineapple sauce that they had at the table and the green mayonnaise.  We had the sweet plantains with carne desfechada and the cheese arepa with steak. We drank passion fruit juice in water. The service was really nice, friendly and helpful."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaExTVHFnRRAB",
            "text": "We had an excellent experience at Sunday brunch. The food was delicious, and our servers, Carol and Luis, provided exceptional service. The bottomless brunch option was amazing. We Highly recommend this place."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINU9meWlBRRAB",
            "text": "I wanted to try arepa so came here. My personal description of arepa is thin crispy corn bread. I loved its crispy and yet chewy texture and also that subtle sweet flavor originated from corn. Sirloin inside was mediocre as it was bit dry but wasn’t a huge problem for me cause I perceived that corn bread is the main part and the meat is just a sidekick. Couple different sauces were also nice to have for trying out different flavors. Would love to come again if another chance.\n\nArepa라는걸 먹어보고 싶어서 와봤는데 맛있었습니다. 기본적으로 얇고 바삭하게 구운 쫄깃한 옥수수 빵인데, 옥수수의 은은한 단맛이 잘 살아있어서 제 취향에 아주 잘 맞았습니다. 속에 고기는 좀 말라있어서 고기만 봐선 썩 마음에 들지는 않았으나, 빵을 메인 고기를 서브로 인식하고 먹었기 때문에 큰 문제로 느껴지지는 않았습니다. 또 여러가지 소스랑 같이 곁들여 먹을수 있는데 그러다보니 고기 퀄리티가 덜 신경쓰인것도 있구요."
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnbVBULV9BRRAB",
            "text": "저렴하고 맛있는 콜롬비아 식당. 콜롬비안이 인정한 리얼 오리지널 스타일임. 멕시칸과 비슷하다고 생각하고 간다면 다소 심심하게 느껴질 수 있는 맛이지만 슬로우 푸드 느낌으로 먹을 만함"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeUt6R2tRRRAB",
            "text": "The food is great. We ordered the arepa de queso, patacon de plátano maduro con pollo desmechado, arepa de choclo con chicharrón, and a bunch of sides. The best part honestly may be the sauces they bring to the table (update: you can buy them to take home!!!!) 10/10 recommend\n\nEverything we ordered was gluten free except the arepa de choclo and french fries"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbGZfaU9REAE",
            "text": "- Vine a este lugar por parte de un tour de comida.\n\n- Probé 1/4 de una arepa rellena de queso.\n\n- En cuanto al sabor te diré que no me gustó. Estaba insípida.\n\n- Es un lugar familiar y agradable.\n\n- Apto para niños.\n\n- Aceptan algunas tarjetas de crédito y débito como método de pago adicional al efectivo.\n\n- Si tienes movilidad reducida y/o vas en silla de ruedas, te comento que el acceso y movilidad dentro del lugar es de dificultad alta. El espacio es muy reducido.\n\n- El lugar se encontraba visiblemente limpio.\n\n- La atención fue buena.\n\n- El servicio fue rápido.\n\n- No cuentan con estacionamiento.\n\n- Te comparto una fotografía con el horario que manejan."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLXFMX2RREAE",
            "text": "Sooo good!\nFlavors, service, quality all 10/10\nThis is one of the best places for good Spanish food.\nThe staff is so nice and service is fast and the food flavored to perfection.\nThe drinks are great the frozen drinks are dangerously strong. Love love love it!!\nThe sauces on the table are all a must try. 100 on the pineapple sauce hands down outstanding."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaE52NmtBRRAB",
            "text": "Food and service was good but definitely not worth the price. Seriously $6.95 for a small ear of corn?? The chicken in the arepa was tasty but over priced. With so much awesome food in the area, this is a one and done."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINnRlbmhRRRAB",
            "text": "Tasty food. Good latin atmosphere and music.\nSweet plantain with chicharron was delicious,  so the picada..\n\nBe prepared to be charged 20% for tipping if you do not get use to (it is not my case because I usually tip 20%).\n\nWhat I do not agree is that you can be extra charge either if you pay by cash or credit card."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUXzRheFFBEAE",
            "text": "This was my first time having arepa, I was blown away by it!\nGot a arepa de queso with chicken and avocado. The arepa was nicely stuffed and fresh. The chicken was tasty. The whole dish in itself was very heavy and more than enough for a meal. Also got a side of fried plantain. That was too sweet for me but was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMzl5aHF3RRAB",
            "text": "First time trying arepas! Our waiter was very friendly. The vibe was great, Latin music playing in the background. We got an assortment of arepas. I liked the chorizo and chicharron the best. We tried the queso and choclo varieties. The choclo arepa was sweeter, the queso was a softer/cheesy consistency. If you’re into arepas, this is the spot! If you’re wanting to try them, also the spot!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJem9UNHBBRRAB",
            "text": "The arepas here are some of the best eats I've had while being in NYC! The service was unfortunately very slow when I went but I'd still come back for the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OF9fblVnEAE",
            "text": "Inviting and delicious experience. Food was very flavorful. Tostones with guacamole was a great balanced app. The guacamole was creamy acidic right amount of tomatoes and onions. The arepas didn't disappoint. Lots of meat the arepas were filling, fluffy, chewy the right texture. The decor felt like we were in a garden, leaves, flowers quaint and cozy.  The service was perfect. Courteous, friendly and patiently explaining all our questions. We thoroughly enjoyed our time here. Will come back again soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbTg3Y1JBEAE",
            "text": "This is my favorite place to get patacones and arepas from in NYC Queens. We have ordered from here several times and we genuinely love the food from here. We like to order arepas de choclo con queso as a dessert. So delicious. Have a taste of South America while in NYC. You won’t be disappointed!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURld3ZuLVlBEAE",
            "text": "Nice ambiance and friendly.\nWanted to try out their 3 pack empanadas. They were good but small. I really liked the sauce they give you on the side, but I asked for two of them.\n\nAlso on a 2nd visit, I tried their Columbian Burger w/Shrimp. Delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbHVmTWtnRRAB",
            "text": "My first time have arepas and I'm impressed. I got their arepas de choclo with steak and it was fantastic. The only negative I had, was that it was quite salty. The more you eat it, the saltier it does get, and it was a bit heavy so I was very sleepy afterwards. But other than that, it was really good. I recommend the tostones with guacamole, it came out hot and fresh and it was so good!!\n\nAlso tried their black beans and rice. The beans had an interesting smoky flavor to it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbGNQM2RREAE",
            "text": "Absolutely loved the food and the service - one of my new favorite spots! They have a huge selection of various types of arepas, all sound delicious. I’d recommend one of the corn arepas and try the mix grill. Can’t wait to come back again soon and try out a few more options!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2NThINGRnEAE",
            "text": "My husband and I were brought to this place by curiosity after watching a TV program with A. Bourdain. Good service and nice atmosphere. We ordered the green plantain with chicharron and the choclo arepa with carne desmechada.\nUnfortunatelly not enough spiced meat in arepa, but the pineapple chutney was great and matched perfectly with this chicharron dish.\nNext time we have to try another dishes 😉"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPd0xQSUJnEAE",
            "text": "This establishment offers authentic Colombian cuisine they have plant based/ vegan options. They restaurant has a nice vibe at a reasonable price. The food is delicious, the staff was friendly, helpful and offered great recommendations, my service was fast. I’ve been exploring authentic foodie spots dining on the 7 train this is a great stop."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaDZxLUNnEAE",
            "text": "Wanted to eat an arepa and found this gem. Came in for lunch and ordered 3 different arepas (shredded chicken, chicharrón, and chorizo), and one patacón. For drinks ordered the soursop smoothie, and a black berry smoothie.\n\nThe arepas were superb! They were on point. The chicharrón was made out of smoked pork belly (not a fan of smoked pork belly chicharrón but it was still good) and it was perfectly cooked. Not too hard but crispy skin and not too under cooked were the fat overtake on texture.\n\nThe chorizo and chicken arepas I couldn’t complaint about anything, they were delicious.\n\nThe soursop smoothie and black berry smoothie were done nicely… not too sweet and perfectly creamy.\n\nService was good but missing a bit of friendliness.\n\nOver all a nice spot to grab a bite…go grab an arepa!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWaG9DRFRnEAE",
            "text": "Delicious and authentic. Many different types of arepas to try! Really liked the guacamole with tostadas and the vegetarian arepa."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaTRqUUVREAE",
            "text": "A delicious spot for arepas! There are many different arepas to choose from, as you can see in the menu. When speaking with the staff, they guided me through the options. The arepa de choclo is the most popular."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdC1DRUNBEAE",
            "text": "Nice arepas that are decently priced. I got the normal cheese arepa (4/5) and my friend got the chorizo arepa (4/5). The arepas were good - loaded with cheese and good corn flavor. The dough was a bit too doughy but these were one of the better arepas in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaUlXMzVnRRAB",
            "text": "I went to ‘Arepa Lady’ on a Friday night, and even though it looked busy, they had a table for me right away. I found the menu a bit confusing, especially since I love arepas. I couldn’t quite grasp the differences between the four types, so I ended up with something tasty but not exactly what I had in mind. I ordered the arepa with cheese inside and on top, along with steak. However, it wasn’t the “sandwich arepa” I’m used to, so I felt a bit disappointed, although it did taste good. For dessert, I tried the passion fruit mousse, but it didn’t meet my expectations, and it was quite expensive. Had I known there was a dessert place nearby, I might have skipped it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aXZEV0JREAE",
            "text": "Amazing spot for excellent food at excellent prices. Would recommend and will definitely be back if I'm in the area.\n\nWent with my wife after a Mets game to have late launch. We had 2 different arepas following the recommendations of the waiter (as well as a maracuja juice).\nI had the \"chicharron corn arepa\" and my wife the \"chicken corn arepa\". Both were amazing but I stick with the \"chicharron\" one; very crispy and tasteful meat.\nThe quality of the arepas were great, highly superior to the ones I have had before. There is also a high variety of options (which may be a bit overwhelming though).\n\nThe atmosphere is very chilled and the service friendly."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2aTdfZ0RnEAE",
            "text": "Not a ton of veggie options so if you order one thing that’s veggie everything else tastes almost the same. What really made it taste better for the veggie options was the sauces. I’m sure the meat options are probably amazing. The juices were good but I don’t think they were as fresh for the price. For $5 a cup I’d expect it to be freshly juiced. Cash only"
        }
    ],
    "reviews_count": 74
}